[
    [
        {
            "content": "Watching Watashi ga Motete Dousunda (Kiss Him, not Me!) reminds me of feeling like a kid again. Kind of like a kid walking right into a candy store, the show felt pretty silly at first and even hysterical. I mean, it’s a reverse harem shoujo. Shows like this tends to appeal to mostly a certain demographic and to me, it isn’t something that I favor a lot. However, there’s this something about this show that feels more appealing than some of the other reverse harem shows I’ve watched before. Whether it’s because the series is a parody of making fun of BL or the comedy,this turned out to be a pretty sweet ride.\\n\\n\r\nAdapted from the manga of the same name, the series is about a fujoshi named Serinuma Kae. For those who are not familiar with the term, it basically designates individuals who has fascination about boys’ love (BL, yaoi, etc). Kae is a bit of an extreme example as her character is not only into BL but also fascinates about fictional characters like an otaku. The first few episodes establishes her as an avid fangirl of a TV show that she watches. Furthermore, she ships about her classmates in awkward fantasies. So on surface, you can pretty much say that she’s a girl that may have a hard time making real friends. Oh and she is chubby too. That is, she does certainly lose a lot of weight after the death of one of her favorite anime characters. Life changes and now, Kae is a bombshell who attracts attention at school like never before.\\n\\n\r\nOkay, okay. I know what you’re probably thinking. How can this show really make a character like Kae likable? The fact that is, she is an otaku-fujoshi hybrid although the show seems to emphasize more on her BL fandom. The storytelling focuses on her the most but makes it more into a shoujo dramedy. This is accomplished by the numerous suitors that seeks to capture her heart. The fun catch is that Kae is more interested in seeing the suitors paired with each other. Throughout the show, you can expect a lot of daydreams and fantasies from Kae’s point of view. Most of is delusional while others are crafted by misunderstandings. In the meantime, the main male protagonists really do care about Kae whether she knows it or not.\\n\\n\r\nFrom the main cast, we have Mutsumi, Igarashi, Nanashima, and Shinomiya. Each of these guys has a different personality although all has the same goal: to win Kae’s heart. Oh and later on, even another fujoshi girl enters the story further amplifying the competition. Now I have to admit, these guys are pretty stereotypical in terms of characteristics. For instance, Igarashi instantly gives me the classic suitor type that never seems to give up until he gets what he wants. Nanashima is more of a tsundere with a bad boy type attitude. On the other hand, there’s Shinomiya with feminine features and a more gentle personality. Mutsumi is probably the most care-free of the guys and treats the competition more casually compared to the others. So you get the idea here? They are pretty much the type of guys you can find in any shoujo or reverse harem show. Comically enough, Kae isn’t too interested in dating any of these guys but rather have the guys date between themselves. She is a fujoshi after all.\\n\\n\r\nRegardless of the characters, the show focuses a lot more on its comedy by selling humor. This is done through character relationships that progresses between Kae and the others. While the pacing isn’t too impressive, she does get closer to each of the other guys. In fact, it’s clearly shown that some of them are truly falling for her while Kae herself begins to wonder about her own feelings. The comedy comes in with Kae’s usual fantasies that begins to also blend between fiction and reality. The introduction of a female character (Nishina), also makes the show more refreshing because she and Kae has quite a bit of similarities. It hypes up the competition and also brings out the other guys’ personalities more into the open. The point is, the show isn’t really much more about serious drama or realism. It’s there instead to make the viewers laugh and experience from first view point of a fujoshi character. It isn’t trying to get you to like Kae or the others. Instead, it seizes opportunities to bring the storytelling and characters to a level that is beyond just popcorn entertainment.\\n\\n\r\nFrom a technical perspective, the show is just fine with how Brain’s Base adapted this manga. Honestly, I’m more borderline between fine and so-so because the overall quality isn’t impressive. The character designs obviously gives the reverse-harem and shoujo feel with its bishounen looks. On the other hand, Kae is decorated with femininity and her gentleness. However, character expressions is another story. The directing of Kae and others characters’ facial reactions has a very entertaining way of expressing themselves. Most times, it’s Kae’s yaoi fangirling but the other characters draw attention as well. In retrospect, character expressions adds an extra dose to entertainment in this show.\\n\\n\r\nThe soundtrack is more or less pretty standard although the theme songs stands out with performances by the actual voice actors/actresses. Speaking of voice acting, I have to emphasize that each of the characters does make impressions just by their voice tone alone. It defines their personalities especially Kae. I mean, you’d see Kae fantasying about the guys and her voice changes dramatically to overemphasize her passion. \\n\\n\r\nWatashi ga Motete Dousunda is the type of show that is definitely not suitable for everyone. It’s hard to recommend to everyone because what it looks on paper. Yes, the premise is pretty much what it is and the storytelling never distances itself from that. Still, I would recommend giving this show a chance if you’re seeking for some comedy. As a manga reader, the series is also faithful on most parts so it doesn’t degenerate into a mess. But all else aside, this show is like a buffet where you choose what’s satisfying for you.\\n",
            "date": "2016-12-22T12:53:00+00:00",
            "helpful_count": 67,
            "mal_id": 236146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=236146"
        },
        {
            "content": "As a female who watches plenty of anime and BL, at first I really loved this anime. It was hilarious, light hearted and very cute with great art. \r\nThe first 5 episodes I was laughing so hard... however after a while you notice the story isn't really going anywhere and unfortunately that was definitely reinforced with the season ending, it felt like the main character hadn't really grown throughout the anime, which is also good if you think about it in the way that she \"stayed true to herself\" . \r\nThe characters have good development and all have moments in the spotlight but really itsjust another harem anime (I'm not particularly fond of harem) I still found it very enjoyable and light hearted to watch, quite a few times I found myself laughing or giggling out loud. There are also plenty of moe, BL and even Yuri moments for the fangirl at heart. \\n\\n\r\nDue to the lack of story beyond romance .. I'll have to rate it 7/10",
            "date": "2016-12-24T21:22:00+00:00",
            "helpful_count": 63,
            "mal_id": 236430,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3287851.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LilithSkyfire",
                "username": "LilithSkyfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=236430"
        },
        {
            "content": "Looking at the score, I wonder how this anime made it so high. This was one of those anime my group of weaboo friends made fun of and made each other watch on many accounts of i dare yous. Though to be fair, the art is pretty decent.\r\nThe story starts out with a fat and ugly kae, eyes like brock from pokemon, and glasses like any stereotypical otaku in akihabara. After a tragic death of an animated drawing of a male yaoi character and about a week of starving herself (wow! promoting that anorexic lifestyle!) she not only loses her glasses and develops some tohruhonda eyes, but becomes the next victoria secret angel, loosing over half her initial body weight! Suddenly, all the guys who ignored her before as she was shipping them have turned their heads and looked at her newly evolved form! \\n\\n\r\nEven after they establish that they're all after her, she still treats them like toys. She never thinks about them, rather about how they could be together with each other. She clumps them together and don't think of them as their own respective person, yet they're still smitten. \\n\\n\r\nThink of every trope you've ever seen, like the kabe-don, the beach scene, the double kabe-don scene, the date scene with all suitors, and smash them all in one, and you've found a shojo hellhole that makes up this anime. \\n\\n\r\nThe music is mediocre and very upbeat, but nothing sticks out. Art is the only redeeming feature. I was really sad because I was expecting something like her BL or yaoi mangas, which I actually really like. \\n\\n\r\nDo yourself a favor and don't waste your time. If you like BL or yaoi, skip this manga/anime and just read her other manga\\n",
            "date": "2017-05-29T16:36:00+00:00",
            "helpful_count": 41,
            "mal_id": 248831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5350177.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/tinaisatd",
                "username": "tinaisatd"
            },
            "url": "https://myanimelist.net/reviews.php?id=248831"
        },
        {
            "content": "There are anime where there is a girl who ships two guys together, and there are anime where there is a girl who has her own reverse harem. Well, why not combine them into one? Behold! A girl who ships the guys in her own reverse harem! I first heard about the manga for this anime before the anime was even announced; it seemed interesting, so when it was announced that it was getting an anime adaptation, I was immediately on board. Thus, I watched it as it aired, and honestly, I'm really glad I did.\r\nLadies and gentlemen, here is my review of \"Kiss Him,Not Me\", a.k.a. \"Watashi ga Motete Dousunda\".\\n\\n\r\nKiss Him, Not Me follows Kae Serinuma, an overweight fujoshi who ships her classmates, Yusuke Igarashi and Nozomu Nanashima, and is in love with a character from the anime \"Mirage Saga\", Shion. However, in one episode, Shion ends up dying; as anyone who has had their favorite anime character die can relate to, Kae does NOT take his death well. She locks herself in her room for a week, refusing to eat.... and when she comes back to school, she comes back very attractive as a result of all of her weight loss. Needless to say, she catches the attention of not just Igarashi and Nanashima, but she also ends up attracting an underclassman named Hayato Shinomiya and an upperclassman named Asuma Mutsumi. Unfortunately, she's not romantically interested in any of them, but still, the competition begins....\\n\\n\r\nI'm just going to be honest; the story wasn't as good as I was hoping it would be. There were episodes where I wasn't really as engaged in what was happening as others, and the ending was slightly unsatisfactory. However, that does not mean the story is bad; on the contrary, it's actually a good one. There were a lot of funny moments that at least made me smile, and it was interesting to see the characters' development. Plus, with Kae being an otaku and all, there are a few Easter eggs from other anime scattered here and there, especially from Attack on Titan, so that was interesting to see!\\n\\n\r\nNow, let's talk about the characters. Kae is someone who any otaku girl can relate to, whether they're a fujoshi like her or not; that, along with the funny moments involving her, make her an interesting protagonist. Each of the boys in her reverse harem have their own quirks, too, and without exception, each of them gets their time to shine. Mutsumi is my favorite out of all of them; he's very kind, it's obvious he cares about Kae whether in a platonic or romantic way, and the episodes focused on him were my favorites. There's also Shima Nishina, a girl who joins the reverse harem a bit later than the rest. As a yuri fan, I'd like to rejoice, but honestly, I never saw the relationship between her and Kae as anything more than platonic; however, she was still an amusing character nonetheless. The supporting cast was amusing whenever they appeared, too, especially Kae's friend, A-chan.\\n\\n\r\nThe art was really pretty, and the character designs were solid. Brain's Base did a really good job with the animation, too. Both the opening and ending themes, \"Prince x Prince\" by From4to7 and \"Dokidoki no Kaze\" by Rie Murakawa, were both extremely catchy songs that I've already listened to a million times! As for the voice acting, I was originally a bit sad about the cast from the drama CD being changed (especially Yu Kobayashi replacing Kana Hanazawa as Kae), but all of the voice actors really nailed their respective roles. I'll admit that it's a bit strange how different Kae sounds between her fat and skinny forms, but it really goes to show you how her voice actress can do different kinds of voices.\\n\\n\r\nOverall, Kiss Him, Not Me was an enjoyable anime. If you're tired of the same old reverse harem anime and want one where the protagonist is a fujoshi, I'd definitely recommend this one. Who knows? You may ship one of the boys with Kae, but you may ship the boys with each other even more!",
            "date": "2016-12-24T05:22:00+00:00",
            "helpful_count": 32,
            "mal_id": 236341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=236341"
        },
        {
            "content": "[SPOILERS AT THE END]\r\nOk, so another reverse harem has ended, funny that this 2016 winter season anime was just so full of it, so: \r\n7 over 10\r\nStorywise, at first I thought that I'm gonna be looking at a usual reverse harem, you know where the girl actually is surrounded by guys, and unlike a 1 boy to many girl ration kind of harem where the competition would be fierce , the reverse harem where there is a 1 girl to many boys is usually more subtle and in most cases the girl itself acts more like a mother figure to the guys than a loveinterest. Here, is where the term \"REVERSE HAREM\" was given a totally different definition, this was probably the only reverse harem where the main character is pretty much as obnoxious as a guy in a regular harem, and this was also the only anime where the harem member were competing for the girl's affection, what makes the harem member different from a usual reverse harem was an addition of a lesbian who adds to the competition of the guys for the girl. \\n\\n\r\n5 over 10\\n\\n\r\nArtwise, I just don't have anything to say about the illustrations o the character.\\n\\n\r\n4 over 10\\n\\n\r\nI really don't give a damn about them seiyuus who did the character's voices, so let's just leave it at that.\\n\\n\r\n8 over 10\\n\\n\r\nCharacters, well since this anime really gives the term \"REVERSE HAREM\" a new definition, it won't come as a surprise that the guys here were a total quintessential of a usual guy to girls harem like: \\n\\n\r\n Asuma Mutsumi, a quintessential sempai who is the bright one, here, he's is the male version of a Yamato Nadeshiku.\\n\\n\r\n Nozomu \"Nana\" Nanashima, a quintessential tsundere, a male version of a tsundere that is.\\n\\n\r\n Yuusuke Igarashi, a quintessential athletic type who is a male version of the typical sporty type. \\n\\n\r\nHayato Shinomiya, a quintessential half breed, in fact he is a make version of a half Jap and half white that would be usually be found in any harem.\\n\\n\r\nShima Nishina, well she the usual bokuko, and since there can't be a male bokuko , she has to really be a bokuko. Why do they have to add her anyways.\\n\\n\r\nNow let's go to the main character, Kae Serinuma, pretty much a character I'd like to give a karate chop on her head, as a main character of this anime/ manga she, basically is quite annoying on one hand cu'z of her immaturity, but then again I really like that she was portrayed as this total obnoxious main character. In which in my book is a very good thing, now I've rate is an 8 not because I like the characters, but because I really admire the way the characters were portrayed.\\n\\n\r\n6 over 10\\n\\n\r\nEnjoyment, I really wasn't that eager to enjoy this anime , in fact, I've skipped some episodes along the way, since I really hate the way as to how the main character see her harem, for her, they were just her basis for her imagination as an otaku.\\n\\n\r\n7 over 10\\n\\n\r\nOverall, it was decent enough to be watched, but my annoyance for the main character was a bit overwhelming, but then again, seeing how unique the ending went, kinda changes my perspective for this anime. Besides, it wasn't always that we get to see a harem getting rejected by  the main character, and that is the only good part.\\n\\n\r\nWhoahoho OUT!\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-12-27T11:50:00+00:00",
            "helpful_count": 19,
            "mal_id": 236677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=236677"
        },
        {
            "content": "Know that this genre of anime isn't for everybody. The only people who are gonna enjoy it are female otakus, especially if they're into BL. We're the core audience here so if you're a straight male, you should best stay away from it.\r\nFor those of you interested in the reverse harem genre, know that somethings have to be accepted at face value, including:\r\n1. Lots of boys will like one girl, for no apparent reason other than that she's pretty (and sometimes, has a sweet personality)\r\n2. The girl is always completely oblivious of how the boys feel for her.\r\n3. There is no plot - all theboys compete in their own way with each other to catch the girl's eye, who in turn sees them as nothing more than friends.\\n\r\n5. The big reveal is always within the last 5-10 minutes of the last episode of the series. \\n\\n\r\nSo now that you've accepted that this WILL happen, let's move on to my review. As you have already understood by my score, I thoroughly enjoyed this series. I loved how it poked fun at the moe culture and otakus, without really being offensive to either. In many scenes, I saw myself in the shoes of the female MC ; I guess that's what made it all the more enjoyable for me. Many, many scenes had me in splits. I loved how the shipping of male characters was given an entire episode; this is something I haven't seen before in any anime.\\n\\n\r\nWhat I also like about the reverse harem genre is how deeply respectful all the male characters are towards the feelings, decision and consent of the female character. Always. The choice is always left to *her* to decide who she likes and the boys always agree to *respect* her decision. The 4 boys in the series (apart from being very good looking) had 4 different personalities, which shone wonderfully throughout the series. I especially loved the discomfort they felt every time they were made to do something yaoi-ish. Hahaha! Those were some of the best scenes.\\n\\n\r\nAll in all, it's a pretty decent watch and unlike most female MCs from the reverse harem genre, this one actually has a brain. It's definitely worth a binge watch!\\n\\n\r\nPS. I LOVED the anime references in this anime. They had me fangirling like crazy!\\n\\n\r\nPPS. I really wanted the MC to daydream a lot more about the BL between her admirers, but unfortunately, in that way the title of the anime is misleading, because there was very little of that.\\n\\n\r\n*you can stop reading this point afterwards if you haven't watched the anime*\\n\\n\r\nJust a small overview of the characters and who I ship with whom:\\n\\n\r\n1. Mutsumi (history club dude) was the most obvious choice for Kae, because he saw beyond her looks and loved/respected her for who she really was. He was the only one who noticed her when she was fat.\\n\r\n2. Igarashi (the sports guy) was the only one who understood *why* he liked Kae. That was character development! He and Nishina (the girl) had some moments together and I was hoping the two would end up together. He was my 2nd choice for Kae.\\n\r\n3. Nanashima (the blonde) showed the maximum character development. The ep with his sister was adorable and showed us his kinder/gentler side. Made him 10x more attractive to me and I'm sure, to many other fangirls as well. He's also ready to defend/fight for Kae's honour, which is HOT. He was my 3rd choice for Kae.\\n\r\n4. Shinomiya (the youngest boy) is cute, adorable and easily lovable. He was the least suited as Kae's partner, but we all fell in love with him nonetheless :)\\n\r\n5. Nishina (the girl) was a pleasant surprise, and it was nice to see how none of the boys poked fun at her for being a girl (and competing for the affections of a girl). They all accepted her as another competitor, which I think was wonderful for the LGBTQ+ cause. I didn't ship her with Kae, though. I got more of a crazy-otaku-bff vibe from them.\\n\r\n6. Kazuma was a surprise entry, and I TOTALLY shipped him and Nanashima. Hahahahahahahaha!! The Junjou Romantica references made their scenes so much more hilarious!!\\n\\n\r\nIf you have any thoughts, please drop by my profile! Would love to hear your opinions.\\n",
            "date": "2017-02-28T11:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 241600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5909765.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sonal1988",
                "username": "Sonal1988"
            },
            "url": "https://myanimelist.net/reviews.php?id=241600"
        },
        {
            "content": "Watashi Ga Motete Dousunda was a really enjoyable causal romance.\r\nIt was interesting to see a girls point of view of shipping (which may not be true) never the less it was very enjoyable to see Serinuma reactions to boys love and how much of an Otaku she is.\r\nI liked the typical boy harem aspect where there's a different boy for everyone's taste and how Serinuma sees each of them.\r\nI also thought it was interesting how they brought a girl into a reverse harem which gave boys something to look forward to as well.\r\nI quite liked the side characters like Amene Nakano.\r\nThroughout the series it isconstantly reminding you she is an Otaku which made the series all the more enjoyable and I could relate to her.\\n\\n\r\nOverall this series was absolutely hilarious and never ceased to amuse me. \\n\r\nI highly recommend this series to anyone who likes comedy and romance.",
            "date": "2017-01-14T10:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 238277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4624364.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DarknessReality",
                "username": "DarknessReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=238277"
        },
        {
            "content": "*bear with me, this is my first review (also first anime I completed Fall season)*\r\nI'll be honest, I'm not a big fan of harems with male leads (mainly the concept of it), but after watching Watashi ga Motete Dousunda, it dawned on me that I love the idea of REVERSED harems--probably typical for a girl though, right? That thrown aside, this anime was quite entertaining for me regardless of it being a reversed harem, and I totally would recommend girls AND guys to watch this if you're looking for a silly, short and easy-to-watch anime to pass time.\r\n***\r\nI say the first 5 episodes of Watashiga Motete Dousunda were the most interesting. The first 5 really lure you in. An overweight otaku loses--or I should say drops--weight and transforms into a beauty queen, and suddenly she is surrounded by a group of handsome males who are originally after her for her looks, but soon grow to like her for more than what's on the outside. Starts off pretty original, right?\\n\\n\r\nAfter episode 5, well, things became *sort of* unoriginal. Not entirely. But there were a couple of scenes that you have most likely seen before in a school/harem anime. Did that make it 1% less entertaining? Well, I guess, but it was still entertaining anyhow.\\n\\n\r\n***\\n\\n\r\nOnto the characters:\\n\\n\r\nSome of the characters were somewhat unoriginal, so the character descriptions will be simple. Although they are kind of generic, they each had small traits that separated them from other similar characters. Each one of them has an 'eye candy' appearance and are all very lovable, and watching the characters interact with one another was very enjoyable and fun, sometimes funny.\\n\\n\r\nKae Serinuma - The female protagonist, Serinuma, is defintely not your standard heroine. She is a diehard otaku with a huge BL (Boys Love) fetish that she shows all throughout this anime. Although she has that typical nice-girl personality - the mix of her weird, drooling fujoshi nature is enough to differentiate her from other heroines.\\n\\n\r\nYuusuke Igarashi - The mature \"nice guy\" type\\n\\n\r\nAsuma Mutsumi - The happy-go-lucky 'stoner' type\\n\\n\r\nNozomu Nanashima - The tsundere/aggressive type (personal fav)\\n\\n\r\nShima Nishina - I'll start off by saying she is voiced by one of my favorite female voice actors--Miyuki Sawashiro. She's the female, lesbian 'prince charming', very similar to Kashima from Gekkan Shoujo Nozaki-kun.\\n\\n\r\nHayato Shinomiya - The weak, 'scaredy-cat' type (voiced by my overall favorite male voice actor, Yoshitsugu Matsuoka!)\\n\\n\r\n***\\n\\n\r\nThe setting and music were nothing out of this world. The OP and ED were both cute and give off the familiar happy vibe that gets you enjoying what you're watching even more, that being said I would rate the music a 7.5. The setting is your average school-life environment, but it varies as the main characters do new activities so the sights never get boring.\\n\\n\r\n***\\n\\n\r\nMy biggest problem--and I won't spoil--is as the anime is further executed you begin to wonder; do ALL of them actually like Kae Serinuma for more than her looks? That's one thing that put me off a bit with the story, as it didn't show much proof of them liking her for who she is and not solely what she looks like, and in a way this can send a bad message to women - so if you are easily offended or perhaps have a light sense of humor, I would recommend you to not watch this. \\n\\n\r\nIf it were not for that issue and the already-been-done events in this anime, I may have rated higher for the cute concept - I would say this anime is more of a 7/10, but I rated it an 8 because I'm generous with my ratings :)",
            "date": "2016-12-31T19:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 237126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5566481.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lolipopsicle",
                "username": "lolipopsicle"
            },
            "url": "https://myanimelist.net/reviews.php?id=237126"
        },
        {
            "content": "Well when I was recommended this series I will admit I was sceptical and to be fair it is obvious from the start just what kind of crowd this anime was aimed at. \r\nNevertheless I followed my golden rule and I gave it a fair shake. This series is what we call a reverse harem in that instead of a male protagonist with endless females hanging off his arm, we have the complete opposite. \r\nI was drawn in by the premise with a kind of sick fascination as it was so different and I love different. \r\nFat girl becomes thin and gorgeous and everybody wantsher suddenly.\\n\\n\r\nAdmittedly the show can be funny at times but the problem lies in everything else. \\n\r\nThe animation while pretty good is backed up by a mediocre (at best) soundtrack and bland and tasteless characters that seem to have been copied and pasted from other series.\\n\\n\r\nThe ludicrousness of the whole situation where she and several guys go on a date all at the same time personally rubbed me the wrong way and is actually a concept that I haven't come across in standard 'harem' anime as the main is too scared to ever make an actual choice in those. \\n\\n\r\nAll in all...\\n\r\nI recommend that unless this trope is definitely your kind of thing that you give it a skip or just watch the first 2-3 episodes to get your laughs before moving on.",
            "date": "2017-02-22T02:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 241128,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AraelDranoth",
                "username": "AraelDranoth"
            },
            "url": "https://myanimelist.net/reviews.php?id=241128"
        },
        {
            "content": "While the premise of this show might seem shallow and repetitive at first, I think it's worth sticking around to look into. \r\nI found this show totally by accident. I watched a clip of it on Youtube, encompassing Serinuma's weight loss transformation. It looked funny, so I decided to give it a try. Needless to say, within the first episode, I found myself pissed off by most of the people in the show, especially because they were all so shallow and rude. However, as the show went on, it really grew on me, and while I don't agree with some of the statements made, itmade for a really fun time.\\n\\n\r\nTo begin with, the story; the story was decent (I would have preferred a few modifications; after all, fluctuating weight is a problem, especially when starving yourself is how you get there) and I had a lot of problems with the fat-shaming. However, the show got better in that aspect. It showed change in the people who previously fat-shamed Serinuma, who learned to fall in love with a personality instead of an appearance. I thought the message was sweet. I liked it even better considering I'm a massive fangirl and otaku myself-- however, I'm not as big on BL as Serinuma is. I just ship EVERYTHING-- no restrictions. :) As a fellow obsessive fan, I really enjoyed all the little references in the show and nods to fan culture. (AND YES IT DOES MATTER WHOSE NAME COMES FIRST IN A SHIP FIGHT ME) (I'm worse than I thought I was...) XP\\n\\n\r\nThe art was beautiful. The backgrounds were colorful and ever-changing, not to mention that all the girls and guys were drawn beautifully and were very appealing to look at. \\n\\n\r\nThe sound was alright. Both the opening and ending were catchy, but I'm not sure if I would listen to it again unless it just came up. The background music was fitting and wasn't distracting. \\n\\n\r\nThe characters were pretty amazing. As a fangirl, I appreciated having the community represented by such an amazing example :D Jokes aside, it's been a while since I've seen a heroine with so much nerve and passion, and considering that I hate most female characters (they're usually written as passive, submissive, and weak) I was pleasantly surprised to find myself liking one-- ESPECIALLY in a reverse harem anime! Some of the boys were insufferable at first due to their rude behavior when Serinuma wasn't attractive, but a few of them I liked (namely Mutsumi and a little Igarashi as well) because they respected Serinuma even when she was 'fat'. While Nishima definitely isn't my type, I really loved her respect and honest love towards Serinuma, no matter what she looked like. Despite being an avid shipper of anything and everything, by the end of the show, I just loved everyone together as a friend group opposed to anyone dating Serinuma (though I think Mutsumi deserves her most out of everyone there... I can find room in my heard for Nishima and Igarashi if need be).\\n\\n\r\nI enjoyed this way too much and finished it in less than 24 hours (which I rarely do... I usually don't get this excited over many shows). There were enough references and fangirl jokes to have me on the ground laughing (which is rare for me, I rarely laugh while watching anime) there were also enough cute moments for me to be screaming into the void as my shriveled fangirl heart started beating again. All in all, this was a wild ride, and I was glad I tried it! \\n\\n\r\nI would recommend this if you: like otome games, like reverse harems, like smexy boyish lesbian girls, like hot dudes, like cliche anime episodes like the 'beach' episode and the 'ghosts' episode, are a fangirl, are a BL fangirl, like shipping things, like humor and satire\\n\\n\r\nI would NOT recommend this if you: don't like harems of any sort, don't like fangirl or fangirling, you don't like shipping, you like serious plotlines, you wanted serious romance\\n\\n\r\nHave a great day everyone!",
            "date": "2018-03-17T14:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 274101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=274101"
        },
        {
            "content": "This is a pretty good anime. The story is interesting. The characters are great and funny. I loved the animation as well. I do recommend it because you will laugh your pants off. The main girl is Kae Serinuma who by the way is hilarious. I swear she cracked me up every episode. She honestly makes the show. The guys are also pretty funny. If you're looking for a funny high school romance story then this is it! \r\nHowever, there are two things that I didn't like \r\n1.) The way she lost weight makes no sense. \r\n2.) I hated how the guys who ignored herfor years are now suddenly into her because she's hot. Mutsumi senpai was the only one who was kind to her before. \\n\\n\r\nANYWAY, \\n\\n\r\nI know a lot of people hate the ending but honestly I kind of liked it. It was different and funny. It's a great show so go watch it! Also I hope they make season 2.",
            "date": "2018-01-22T22:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 269393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919522.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JoyJoyJoy",
                "username": "JoyJoyJoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=269393"
        },
        {
            "content": "Summary:\r\nThis anime is about 4 beta orbiters and 1 lesbian who are all attracted to the main character, this really annoying but beautiful girl who is a massive gay anime loving otaku. This love for gay anime leaks to real life and she often fantasizes about romance between guys. Every episode they all follow her (the main character) around doing stuff for her, helping her and guarding her in hopes to get (sexual) attention from her. However she doesn't like any of them romantically and ultimately let's them down (really predictable and anti-climatic ending), because she likes her gay anime more than real life.\r\nThoughts:\r\nThere's verylittle character deveploment and the characters itself aren't that good either. There's some humor and anime references, but nothing that would make me laugh. Probably the only good thing about this anime is the animation and art style, it's easy to look at. But that doesn't help when you got a really bad story that doesn't produce other feelings than anger.\\n\\n\r\n4/10, would not watch again.",
            "date": "2018-01-20T12:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 269145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5146029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kipsu",
                "username": "Kipsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=269145"
        },
        {
            "content": "I ain't gonna suggest it if u're male.\r\nBut this story was fun. It felt like lowered version of modern \"Ouran High School Host club\". I just wanted watch this series because there's a scene fat mc turns into cute bon kyuin bon girl :)). I expected lot but In fact i couldn't get why she turned into that as logical way... that was disappointing. Author could've made it better if he had more experience expect BL manga settings. Nah whatever, it'd be good dessert for fans of BL. But it was not bad for me. \r\nStory is good. But author destroyed main key point atfirst place. Why she turned into cute girl... if it explained with logical way it could turned this series to great one. But it just buried in the ground. \\n\\n\r\nArt was normal. Characters movements were normal. Background was lonely. \\n\\n\r\nAt early episodes character's voices it didn't stick to my ears. But it stick later. Op, ed were normal but osts were better.\\n\\n\r\nI didn't liked mc girl. \\n\r\nIn fact this anime's main genre was romance Mutsumi could be main heroine. I liked him.(for his role)\\n\r\nOthers were fine. \\n\\n\r\nIt wasn't bad. I had a good time. I enjoyed 240 mins. \\n\\n\r\nSee you again at other reviews.\\n\\n\\n",
            "date": "2019-01-20T09:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 299573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526766.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nyamo-sama",
                "username": "Nyamo-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=299573"
        },
        {
            "content": "To begin, I'm not exactly into BL and stuff like that. I am completely a straight male.\r\nThis is my first review ever since joining last October.\r\n---------------------------------------------------------------------------------------\r\nBasically, I honestly think that the art, sound, and story is superb. It has all those good elements to it. Once you've watched enough anime (romance and shoujo in particular) in your lifetime you'll get this certain irresistible feel about this certain series that it absolutely has that \"romantic excitement\" to it that makes you feel tingly all over.\r\nThe characters are ABSOLUTELY LOVABLE. Although it may seem like it has the cliche elements of an otome, the characters are stillunique in their own way. I firmly believe that this anime is totally and utterly adorable and I love it to bits!\\n\\n\r\nThis anime is recommended for those hopeless romantics out there!\\n\\n\r\nIT IS PERFECT! 10/10",
            "date": "2016-12-31T02:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 237061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5779067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/metalrain_15",
                "username": "metalrain_15"
            },
            "url": "https://myanimelist.net/reviews.php?id=237061"
        },
        {
            "content": "I binged watched this series in one sitting and here's what I have to say if you're interested in my opinion. Go!\r\nOk, so the art is great and each of the main cast has different aspects to each of their personalities that just makes them likeable and you see pretty equal amounts of each of them so viewers certainly have enough to see with whoever they ship the main heroine with (or with any other character!)\r\nThough I do wish that Kae's best friend A-chan had more screen time considering that she is, well, the MC's best friend and all. Bit odd that we only seeher in small intervals and that Kae only spends time with the \"harem\".\\n\\n\r\nThough I usually dislike the whole weight loss cliche I do like some aspects of how this one was handled (just in case any future viewers are avoiding watching for that reason) - \\n\\n\r\n1 - The weight loss was completely unintentional and it doesn't affect whatsoever the way in which the MC lives her life. \\n\\n\r\n2 - Before her change Kae wasn't bullied about her weight which is a trope often seen that I'm very glad was not in this. \\n\\n\r\n3 - Someone is called out on the fact that they only started liking the MC after she lost the weight and is made to reflect on that.\\n\\n\r\nAll in all this is a good comedy anime that is light-hearted and doesn't take itself too seriously, so if you're looking for a strong plot I'm afraid you're not going to find it here. I'd recommend this anime for people who like fanservice (there are pretty boys AND girls, though definitely more boys) and people who just want something easy to watch and have a bit of a laugh. Also I have a feeling that if you like visual novels (as I do) you will also probably find yourself liking this!\\n\\n\r\nHope this little review helps!\\n\\n\\n\r\n(Also Mutsumi-Senpai is the best - Fight Me.)\\n\\n\r\n(NOT A SPOILER BUT COULD BE THOUGHT OF AS ONE SO READ BELOW AT OWN RISK)\\n\\n\r\nHOWEVER one reason why people might not like this anime as it's why I unfortunately had to knock down the rating from and 8 to a 7 is that if you are a romance lover as I am this anime has what can be thought of as an open ending and no actual conclusion pairing.\\n\\n",
            "date": "2018-09-23T06:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 289763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4641371.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Emeraldyoukai",
                "username": "Emeraldyoukai"
            },
            "url": "https://myanimelist.net/reviews.php?id=289763"
        },
        {
            "content": "This show was so entertaining!! I really loved it. It's a good time kind of show. I laughed out loud so many times and having the romance thrown in just made it that much better. I feel like Kae is really relatable and is just so cute. I love when the girl is actually super pretty and the guys are just as good looking.\r\nThe only thing that would have made this anime better would be if they had progressed within the relationships with the boys. I was hoping for more of that. But overall I still love the guys trying to win her over.\r\nOverall ithas a good mixture of romance and comedy. It's a cute show. I couldn't stop watching it. I would definitely recommend this show to anyone who is even remotely interested in it. You won't regret it.",
            "date": "2018-08-23T21:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 287245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7306167.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thatgrrljen",
                "username": "Thatgrrljen"
            },
            "url": "https://myanimelist.net/reviews.php?id=287245"
        },
        {
            "content": "Many of us can relate to this otaku friend. The main character Kae is an ordinary girl who's an otaku. Actually, she's a pure fujoshi, which means she's very obcessed with anything BL in anime world.\r\n\"Watashi ga Motete Dousunda\" aka. \"Kiss Him, Not Me\"... For a first impression, the story didn't disappoint me at all. The comedy is infinite, which means is fun to watch from the very first episode to the last one. I personaly think that whoever tries watching this anime \"Watashi ga Motete Dousunda\" will NOT be disapointed at all, I can guarantee that, however... be aware that this may show alittle yaoi in some parts, but I think you shouldn't be bothered by it cuz the whole anime will be focussed more in comedy and the fight to win Kae's heart.\\n\\n\r\nThe jokes about anime will make you laugh like, \"Hey, that's-\" or \"Where have I seen this reference from?\". You will get the idea once you try and see what I was talking about. It's super fun to watch!\\n\\n\r\nAbout the boys... no offence, but I think they are an eye sore, except for Mutsumi which did like Kae before she got thin. Mutsumi, for me, is the only one for Kae, a pure heart angel, the most genuine boy I saw in this entire anime.",
            "date": "2018-03-12T18:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 273681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5933783.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PurpleGirl203",
                "username": "PurpleGirl203"
            },
            "url": "https://myanimelist.net/reviews.php?id=273681"
        },
        {
            "content": "This show is about an overweight girl who drastically losses weight overnight and ends up having 4 guys pining for her. Even though it’s rather shallow they even find her personality  irresistible. My favorite thing about this show is the main character Kae Serinuma. She is kind and bubbly but also a little awkward. She is a huge anime fan and I completely relate to her in more ways than one. The story itself is not he greatest however I still found myself enjoying the show. If you just want a funny lighthearted show to check out I would suggest giving it a try.",
            "date": "2018-02-28T11:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 272676,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6994675.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/asampsell",
                "username": "asampsell"
            },
            "url": "https://myanimelist.net/reviews.php?id=272676"
        },
        {
            "content": "Review #4: Kiss Him, Not me!\r\nStory 7/10 -- The story is funny, an interesting combination of reverse harem and comedy. The romance aspect of the series is average, partly because of Kae's addiction to merchandise, making her character uninteresting to fans of the genre. There's many tropes in this show when it comes to episode locations and events, but it's worth watching for shoujo fans, as the competition between the guys is intense, but professional and peaceful at the same time.\r\nArt 6/10 -- I'm not a real fan of Brain's Base, and the art seems like it would come from an anime 10 years agorather then late 2016. The character design isn't that unique, but props to the guys that make the comedic faces in the series. Not a lot of visible mistakes to my eyes, however the series backgrounds lacked detail from my perspective.\\n\\n\r\nSound 7/10 -- Acting was average, music also average. \\n\\n\r\nCharacter 8/10 -- Even though the character design was average, I actually enjoyed the growth of some characters in this series. Yuusuke learns quickly that not everything is based off looks. Nozomu and Hayato are both naive but earn maturity points while they spend time with Kae. Shima and Asuma are probably my favorite characters, as I like Asuma's quiet but cool mannerism, and Shima's loyalty to who her friend was from the beginning. Kae seems awkward as a reverse harem protagonist, but her obsession with BL makes her character unique, and it shys away from the harem genre and makes it more amusing as a comedy. \\n\\n\r\nEnjoyment 7/10 -- I think what's most enjoyable is the boys passion for trying to win Kae over, mixed with Kae's and Shimas hot topic of seeing the boys together. The two different agendas blend well together to make an interesting series to watch. The facial expressions are golden, but certain characters definitely leave more impression then others. I think the first half is better then the second half as well, as you realize that the story seems to slow down after midway.\\n\\n\r\nOverall 7/10 -- Reverse Harem and Shoujo are two genres I don't watch a lot. However being new to both, I found this anime to be amusing. It's not as great as Ouran Host Club, but I believe this anime can't be compared to that one fairly. This anime is mid tier for people that are stocking up on plan two watch lists. Even though i'm giving this series a 7 overall, I probably wouldn't recommend this series to romance fans, as it's more of a comedy aimed at girls rather then a romantic show.\\n\\n\r\n~Castawayz",
            "date": "2018-02-17T06:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 271740,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271740"
        },
        {
            "content": "A series that openly mocks Otaku culture, while being written in a way only otaku will really get, \"Kiss Him, not Me\" is a functional but completely forgettable series. Centering around a girl who loses a massive/unhealthy amount of weight and suddenly becomes popular, the premise is equally as shallow as most of the cast. Everyone is a stereotypical shonen or shoujo character, the plots cycle through all the main anime tropes (a school festival, a sports event, a beach episode, a dating episode with all 5 potential partners), and it all ends without any of the characters really moving anywhere. The only character whodoes have an arc still only does so to move the plot to a status quo ending.\\n\\n\r\nThat being said it is very self aware and pokes fun at the Otaku culture without pulling its punches, while also portraying that extreme otaku can be both functional as well as the worst kind of fan. If you have a weekend with absolutely nothing better in your que, you could find the humor enjoyable.",
            "date": "2017-02-03T19:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 239852,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5541769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CCYamato",
                "username": "CCYamato"
            },
            "url": "https://myanimelist.net/reviews.php?id=239852"
        }
    ],
    [
        {
            "content": "Watching Watashi ga Motete Dousunda (Kiss Him, not Me!) reminds me of feeling like a kid again. Kind of like a kid walking right into a candy store, the show felt pretty silly at first and even hysterical. I mean, it’s a reverse harem shoujo. Shows like this tends to appeal to mostly a certain demographic and to me, it isn’t something that I favor a lot. However, there’s this something about this show that feels more appealing than some of the other reverse harem shows I’ve watched before. Whether it’s because the series is a parody of making fun of BL or the comedy,this turned out to be a pretty sweet ride.\\n\\n\r\nAdapted from the manga of the same name, the series is about a fujoshi named Serinuma Kae. For those who are not familiar with the term, it basically designates individuals who has fascination about boys’ love (BL, yaoi, etc). Kae is a bit of an extreme example as her character is not only into BL but also fascinates about fictional characters like an otaku. The first few episodes establishes her as an avid fangirl of a TV show that she watches. Furthermore, she ships about her classmates in awkward fantasies. So on surface, you can pretty much say that she’s a girl that may have a hard time making real friends. Oh and she is chubby too. That is, she does certainly lose a lot of weight after the death of one of her favorite anime characters. Life changes and now, Kae is a bombshell who attracts attention at school like never before.\\n\\n\r\nOkay, okay. I know what you’re probably thinking. How can this show really make a character like Kae likable? The fact that is, she is an otaku-fujoshi hybrid although the show seems to emphasize more on her BL fandom. The storytelling focuses on her the most but makes it more into a shoujo dramedy. This is accomplished by the numerous suitors that seeks to capture her heart. The fun catch is that Kae is more interested in seeing the suitors paired with each other. Throughout the show, you can expect a lot of daydreams and fantasies from Kae’s point of view. Most of is delusional while others are crafted by misunderstandings. In the meantime, the main male protagonists really do care about Kae whether she knows it or not.\\n\\n\r\nFrom the main cast, we have Mutsumi, Igarashi, Nanashima, and Shinomiya. Each of these guys has a different personality although all has the same goal: to win Kae’s heart. Oh and later on, even another fujoshi girl enters the story further amplifying the competition. Now I have to admit, these guys are pretty stereotypical in terms of characteristics. For instance, Igarashi instantly gives me the classic suitor type that never seems to give up until he gets what he wants. Nanashima is more of a tsundere with a bad boy type attitude. On the other hand, there’s Shinomiya with feminine features and a more gentle personality. Mutsumi is probably the most care-free of the guys and treats the competition more casually compared to the others. So you get the idea here? They are pretty much the type of guys you can find in any shoujo or reverse harem show. Comically enough, Kae isn’t too interested in dating any of these guys but rather have the guys date between themselves. She is a fujoshi after all.\\n\\n\r\nRegardless of the characters, the show focuses a lot more on its comedy by selling humor. This is done through character relationships that progresses between Kae and the others. While the pacing isn’t too impressive, she does get closer to each of the other guys. In fact, it’s clearly shown that some of them are truly falling for her while Kae herself begins to wonder about her own feelings. The comedy comes in with Kae’s usual fantasies that begins to also blend between fiction and reality. The introduction of a female character (Nishina), also makes the show more refreshing because she and Kae has quite a bit of similarities. It hypes up the competition and also brings out the other guys’ personalities more into the open. The point is, the show isn’t really much more about serious drama or realism. It’s there instead to make the viewers laugh and experience from first view point of a fujoshi character. It isn’t trying to get you to like Kae or the others. Instead, it seizes opportunities to bring the storytelling and characters to a level that is beyond just popcorn entertainment.\\n\\n\r\nFrom a technical perspective, the show is just fine with how Brain’s Base adapted this manga. Honestly, I’m more borderline between fine and so-so because the overall quality isn’t impressive. The character designs obviously gives the reverse-harem and shoujo feel with its bishounen looks. On the other hand, Kae is decorated with femininity and her gentleness. However, character expressions is another story. The directing of Kae and others characters’ facial reactions has a very entertaining way of expressing themselves. Most times, it’s Kae’s yaoi fangirling but the other characters draw attention as well. In retrospect, character expressions adds an extra dose to entertainment in this show.\\n\\n\r\nThe soundtrack is more or less pretty standard although the theme songs stands out with performances by the actual voice actors/actresses. Speaking of voice acting, I have to emphasize that each of the characters does make impressions just by their voice tone alone. It defines their personalities especially Kae. I mean, you’d see Kae fantasying about the guys and her voice changes dramatically to overemphasize her passion. \\n\\n\r\nWatashi ga Motete Dousunda is the type of show that is definitely not suitable for everyone. It’s hard to recommend to everyone because what it looks on paper. Yes, the premise is pretty much what it is and the storytelling never distances itself from that. Still, I would recommend giving this show a chance if you’re seeking for some comedy. As a manga reader, the series is also faithful on most parts so it doesn’t degenerate into a mess. But all else aside, this show is like a buffet where you choose what’s satisfying for you.\\n",
            "date": "2016-12-22T12:53:00+00:00",
            "helpful_count": 67,
            "mal_id": 236146,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=236146"
        },
        {
            "content": "As a female who watches plenty of anime and BL, at first I really loved this anime. It was hilarious, light hearted and very cute with great art. \r\nThe first 5 episodes I was laughing so hard... however after a while you notice the story isn't really going anywhere and unfortunately that was definitely reinforced with the season ending, it felt like the main character hadn't really grown throughout the anime, which is also good if you think about it in the way that she \"stayed true to herself\" . \r\nThe characters have good development and all have moments in the spotlight but really itsjust another harem anime (I'm not particularly fond of harem) I still found it very enjoyable and light hearted to watch, quite a few times I found myself laughing or giggling out loud. There are also plenty of moe, BL and even Yuri moments for the fangirl at heart. \\n\\n\r\nDue to the lack of story beyond romance .. I'll have to rate it 7/10",
            "date": "2016-12-24T21:22:00+00:00",
            "helpful_count": 63,
            "mal_id": 236430,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3287851.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LilithSkyfire",
                "username": "LilithSkyfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=236430"
        },
        {
            "content": "Looking at the score, I wonder how this anime made it so high. This was one of those anime my group of weaboo friends made fun of and made each other watch on many accounts of i dare yous. Though to be fair, the art is pretty decent.\r\nThe story starts out with a fat and ugly kae, eyes like brock from pokemon, and glasses like any stereotypical otaku in akihabara. After a tragic death of an animated drawing of a male yaoi character and about a week of starving herself (wow! promoting that anorexic lifestyle!) she not only loses her glasses and develops some tohruhonda eyes, but becomes the next victoria secret angel, loosing over half her initial body weight! Suddenly, all the guys who ignored her before as she was shipping them have turned their heads and looked at her newly evolved form! \\n\\n\r\nEven after they establish that they're all after her, she still treats them like toys. She never thinks about them, rather about how they could be together with each other. She clumps them together and don't think of them as their own respective person, yet they're still smitten. \\n\\n\r\nThink of every trope you've ever seen, like the kabe-don, the beach scene, the double kabe-don scene, the date scene with all suitors, and smash them all in one, and you've found a shojo hellhole that makes up this anime. \\n\\n\r\nThe music is mediocre and very upbeat, but nothing sticks out. Art is the only redeeming feature. I was really sad because I was expecting something like her BL or yaoi mangas, which I actually really like. \\n\\n\r\nDo yourself a favor and don't waste your time. If you like BL or yaoi, skip this manga/anime and just read her other manga\\n",
            "date": "2017-05-29T16:36:00+00:00",
            "helpful_count": 41,
            "mal_id": 248831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5350177.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/tinaisatd",
                "username": "tinaisatd"
            },
            "url": "https://myanimelist.net/reviews.php?id=248831"
        },
        {
            "content": "There are anime where there is a girl who ships two guys together, and there are anime where there is a girl who has her own reverse harem. Well, why not combine them into one? Behold! A girl who ships the guys in her own reverse harem! I first heard about the manga for this anime before the anime was even announced; it seemed interesting, so when it was announced that it was getting an anime adaptation, I was immediately on board. Thus, I watched it as it aired, and honestly, I'm really glad I did.\r\nLadies and gentlemen, here is my review of \"Kiss Him,Not Me\", a.k.a. \"Watashi ga Motete Dousunda\".\\n\\n\r\nKiss Him, Not Me follows Kae Serinuma, an overweight fujoshi who ships her classmates, Yusuke Igarashi and Nozomu Nanashima, and is in love with a character from the anime \"Mirage Saga\", Shion. However, in one episode, Shion ends up dying; as anyone who has had their favorite anime character die can relate to, Kae does NOT take his death well. She locks herself in her room for a week, refusing to eat.... and when she comes back to school, she comes back very attractive as a result of all of her weight loss. Needless to say, she catches the attention of not just Igarashi and Nanashima, but she also ends up attracting an underclassman named Hayato Shinomiya and an upperclassman named Asuma Mutsumi. Unfortunately, she's not romantically interested in any of them, but still, the competition begins....\\n\\n\r\nI'm just going to be honest; the story wasn't as good as I was hoping it would be. There were episodes where I wasn't really as engaged in what was happening as others, and the ending was slightly unsatisfactory. However, that does not mean the story is bad; on the contrary, it's actually a good one. There were a lot of funny moments that at least made me smile, and it was interesting to see the characters' development. Plus, with Kae being an otaku and all, there are a few Easter eggs from other anime scattered here and there, especially from Attack on Titan, so that was interesting to see!\\n\\n\r\nNow, let's talk about the characters. Kae is someone who any otaku girl can relate to, whether they're a fujoshi like her or not; that, along with the funny moments involving her, make her an interesting protagonist. Each of the boys in her reverse harem have their own quirks, too, and without exception, each of them gets their time to shine. Mutsumi is my favorite out of all of them; he's very kind, it's obvious he cares about Kae whether in a platonic or romantic way, and the episodes focused on him were my favorites. There's also Shima Nishina, a girl who joins the reverse harem a bit later than the rest. As a yuri fan, I'd like to rejoice, but honestly, I never saw the relationship between her and Kae as anything more than platonic; however, she was still an amusing character nonetheless. The supporting cast was amusing whenever they appeared, too, especially Kae's friend, A-chan.\\n\\n\r\nThe art was really pretty, and the character designs were solid. Brain's Base did a really good job with the animation, too. Both the opening and ending themes, \"Prince x Prince\" by From4to7 and \"Dokidoki no Kaze\" by Rie Murakawa, were both extremely catchy songs that I've already listened to a million times! As for the voice acting, I was originally a bit sad about the cast from the drama CD being changed (especially Yu Kobayashi replacing Kana Hanazawa as Kae), but all of the voice actors really nailed their respective roles. I'll admit that it's a bit strange how different Kae sounds between her fat and skinny forms, but it really goes to show you how her voice actress can do different kinds of voices.\\n\\n\r\nOverall, Kiss Him, Not Me was an enjoyable anime. If you're tired of the same old reverse harem anime and want one where the protagonist is a fujoshi, I'd definitely recommend this one. Who knows? You may ship one of the boys with Kae, but you may ship the boys with each other even more!",
            "date": "2016-12-24T05:22:00+00:00",
            "helpful_count": 32,
            "mal_id": 236341,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=236341"
        },
        {
            "content": "[SPOILERS AT THE END]\r\nOk, so another reverse harem has ended, funny that this 2016 winter season anime was just so full of it, so: \r\n7 over 10\r\nStorywise, at first I thought that I'm gonna be looking at a usual reverse harem, you know where the girl actually is surrounded by guys, and unlike a 1 boy to many girl ration kind of harem where the competition would be fierce , the reverse harem where there is a 1 girl to many boys is usually more subtle and in most cases the girl itself acts more like a mother figure to the guys than a loveinterest. Here, is where the term \"REVERSE HAREM\" was given a totally different definition, this was probably the only reverse harem where the main character is pretty much as obnoxious as a guy in a regular harem, and this was also the only anime where the harem member were competing for the girl's affection, what makes the harem member different from a usual reverse harem was an addition of a lesbian who adds to the competition of the guys for the girl. \\n\\n\r\n5 over 10\\n\\n\r\nArtwise, I just don't have anything to say about the illustrations o the character.\\n\\n\r\n4 over 10\\n\\n\r\nI really don't give a damn about them seiyuus who did the character's voices, so let's just leave it at that.\\n\\n\r\n8 over 10\\n\\n\r\nCharacters, well since this anime really gives the term \"REVERSE HAREM\" a new definition, it won't come as a surprise that the guys here were a total quintessential of a usual guy to girls harem like: \\n\\n\r\n Asuma Mutsumi, a quintessential sempai who is the bright one, here, he's is the male version of a Yamato Nadeshiku.\\n\\n\r\n Nozomu \"Nana\" Nanashima, a quintessential tsundere, a male version of a tsundere that is.\\n\\n\r\n Yuusuke Igarashi, a quintessential athletic type who is a male version of the typical sporty type. \\n\\n\r\nHayato Shinomiya, a quintessential half breed, in fact he is a make version of a half Jap and half white that would be usually be found in any harem.\\n\\n\r\nShima Nishina, well she the usual bokuko, and since there can't be a male bokuko , she has to really be a bokuko. Why do they have to add her anyways.\\n\\n\r\nNow let's go to the main character, Kae Serinuma, pretty much a character I'd like to give a karate chop on her head, as a main character of this anime/ manga she, basically is quite annoying on one hand cu'z of her immaturity, but then again I really like that she was portrayed as this total obnoxious main character. In which in my book is a very good thing, now I've rate is an 8 not because I like the characters, but because I really admire the way the characters were portrayed.\\n\\n\r\n6 over 10\\n\\n\r\nEnjoyment, I really wasn't that eager to enjoy this anime , in fact, I've skipped some episodes along the way, since I really hate the way as to how the main character see her harem, for her, they were just her basis for her imagination as an otaku.\\n\\n\r\n7 over 10\\n\\n\r\nOverall, it was decent enough to be watched, but my annoyance for the main character was a bit overwhelming, but then again, seeing how unique the ending went, kinda changes my perspective for this anime. Besides, it wasn't always that we get to see a harem getting rejected by  the main character, and that is the only good part.\\n\\n\r\nWhoahoho OUT!\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-12-27T11:50:00+00:00",
            "helpful_count": 19,
            "mal_id": 236677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=236677"
        },
        {
            "content": "Know that this genre of anime isn't for everybody. The only people who are gonna enjoy it are female otakus, especially if they're into BL. We're the core audience here so if you're a straight male, you should best stay away from it.\r\nFor those of you interested in the reverse harem genre, know that somethings have to be accepted at face value, including:\r\n1. Lots of boys will like one girl, for no apparent reason other than that she's pretty (and sometimes, has a sweet personality)\r\n2. The girl is always completely oblivious of how the boys feel for her.\r\n3. There is no plot - all theboys compete in their own way with each other to catch the girl's eye, who in turn sees them as nothing more than friends.\\n\r\n5. The big reveal is always within the last 5-10 minutes of the last episode of the series. \\n\\n\r\nSo now that you've accepted that this WILL happen, let's move on to my review. As you have already understood by my score, I thoroughly enjoyed this series. I loved how it poked fun at the moe culture and otakus, without really being offensive to either. In many scenes, I saw myself in the shoes of the female MC ; I guess that's what made it all the more enjoyable for me. Many, many scenes had me in splits. I loved how the shipping of male characters was given an entire episode; this is something I haven't seen before in any anime.\\n\\n\r\nWhat I also like about the reverse harem genre is how deeply respectful all the male characters are towards the feelings, decision and consent of the female character. Always. The choice is always left to *her* to decide who she likes and the boys always agree to *respect* her decision. The 4 boys in the series (apart from being very good looking) had 4 different personalities, which shone wonderfully throughout the series. I especially loved the discomfort they felt every time they were made to do something yaoi-ish. Hahaha! Those were some of the best scenes.\\n\\n\r\nAll in all, it's a pretty decent watch and unlike most female MCs from the reverse harem genre, this one actually has a brain. It's definitely worth a binge watch!\\n\\n\r\nPS. I LOVED the anime references in this anime. They had me fangirling like crazy!\\n\\n\r\nPPS. I really wanted the MC to daydream a lot more about the BL between her admirers, but unfortunately, in that way the title of the anime is misleading, because there was very little of that.\\n\\n\r\n*you can stop reading this point afterwards if you haven't watched the anime*\\n\\n\r\nJust a small overview of the characters and who I ship with whom:\\n\\n\r\n1. Mutsumi (history club dude) was the most obvious choice for Kae, because he saw beyond her looks and loved/respected her for who she really was. He was the only one who noticed her when she was fat.\\n\r\n2. Igarashi (the sports guy) was the only one who understood *why* he liked Kae. That was character development! He and Nishina (the girl) had some moments together and I was hoping the two would end up together. He was my 2nd choice for Kae.\\n\r\n3. Nanashima (the blonde) showed the maximum character development. The ep with his sister was adorable and showed us his kinder/gentler side. Made him 10x more attractive to me and I'm sure, to many other fangirls as well. He's also ready to defend/fight for Kae's honour, which is HOT. He was my 3rd choice for Kae.\\n\r\n4. Shinomiya (the youngest boy) is cute, adorable and easily lovable. He was the least suited as Kae's partner, but we all fell in love with him nonetheless :)\\n\r\n5. Nishina (the girl) was a pleasant surprise, and it was nice to see how none of the boys poked fun at her for being a girl (and competing for the affections of a girl). They all accepted her as another competitor, which I think was wonderful for the LGBTQ+ cause. I didn't ship her with Kae, though. I got more of a crazy-otaku-bff vibe from them.\\n\r\n6. Kazuma was a surprise entry, and I TOTALLY shipped him and Nanashima. Hahahahahahahaha!! The Junjou Romantica references made their scenes so much more hilarious!!\\n\\n\r\nIf you have any thoughts, please drop by my profile! Would love to hear your opinions.\\n",
            "date": "2017-02-28T11:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 241600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5909765.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sonal1988",
                "username": "Sonal1988"
            },
            "url": "https://myanimelist.net/reviews.php?id=241600"
        },
        {
            "content": "Watashi Ga Motete Dousunda was a really enjoyable causal romance.\r\nIt was interesting to see a girls point of view of shipping (which may not be true) never the less it was very enjoyable to see Serinuma reactions to boys love and how much of an Otaku she is.\r\nI liked the typical boy harem aspect where there's a different boy for everyone's taste and how Serinuma sees each of them.\r\nI also thought it was interesting how they brought a girl into a reverse harem which gave boys something to look forward to as well.\r\nI quite liked the side characters like Amene Nakano.\r\nThroughout the series it isconstantly reminding you she is an Otaku which made the series all the more enjoyable and I could relate to her.\\n\\n\r\nOverall this series was absolutely hilarious and never ceased to amuse me. \\n\r\nI highly recommend this series to anyone who likes comedy and romance.",
            "date": "2017-01-14T10:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 238277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4624364.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DarknessReality",
                "username": "DarknessReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=238277"
        },
        {
            "content": "*bear with me, this is my first review (also first anime I completed Fall season)*\r\nI'll be honest, I'm not a big fan of harems with male leads (mainly the concept of it), but after watching Watashi ga Motete Dousunda, it dawned on me that I love the idea of REVERSED harems--probably typical for a girl though, right? That thrown aside, this anime was quite entertaining for me regardless of it being a reversed harem, and I totally would recommend girls AND guys to watch this if you're looking for a silly, short and easy-to-watch anime to pass time.\r\n***\r\nI say the first 5 episodes of Watashiga Motete Dousunda were the most interesting. The first 5 really lure you in. An overweight otaku loses--or I should say drops--weight and transforms into a beauty queen, and suddenly she is surrounded by a group of handsome males who are originally after her for her looks, but soon grow to like her for more than what's on the outside. Starts off pretty original, right?\\n\\n\r\nAfter episode 5, well, things became *sort of* unoriginal. Not entirely. But there were a couple of scenes that you have most likely seen before in a school/harem anime. Did that make it 1% less entertaining? Well, I guess, but it was still entertaining anyhow.\\n\\n\r\n***\\n\\n\r\nOnto the characters:\\n\\n\r\nSome of the characters were somewhat unoriginal, so the character descriptions will be simple. Although they are kind of generic, they each had small traits that separated them from other similar characters. Each one of them has an 'eye candy' appearance and are all very lovable, and watching the characters interact with one another was very enjoyable and fun, sometimes funny.\\n\\n\r\nKae Serinuma - The female protagonist, Serinuma, is defintely not your standard heroine. She is a diehard otaku with a huge BL (Boys Love) fetish that she shows all throughout this anime. Although she has that typical nice-girl personality - the mix of her weird, drooling fujoshi nature is enough to differentiate her from other heroines.\\n\\n\r\nYuusuke Igarashi - The mature \"nice guy\" type\\n\\n\r\nAsuma Mutsumi - The happy-go-lucky 'stoner' type\\n\\n\r\nNozomu Nanashima - The tsundere/aggressive type (personal fav)\\n\\n\r\nShima Nishina - I'll start off by saying she is voiced by one of my favorite female voice actors--Miyuki Sawashiro. She's the female, lesbian 'prince charming', very similar to Kashima from Gekkan Shoujo Nozaki-kun.\\n\\n\r\nHayato Shinomiya - The weak, 'scaredy-cat' type (voiced by my overall favorite male voice actor, Yoshitsugu Matsuoka!)\\n\\n\r\n***\\n\\n\r\nThe setting and music were nothing out of this world. The OP and ED were both cute and give off the familiar happy vibe that gets you enjoying what you're watching even more, that being said I would rate the music a 7.5. The setting is your average school-life environment, but it varies as the main characters do new activities so the sights never get boring.\\n\\n\r\n***\\n\\n\r\nMy biggest problem--and I won't spoil--is as the anime is further executed you begin to wonder; do ALL of them actually like Kae Serinuma for more than her looks? That's one thing that put me off a bit with the story, as it didn't show much proof of them liking her for who she is and not solely what she looks like, and in a way this can send a bad message to women - so if you are easily offended or perhaps have a light sense of humor, I would recommend you to not watch this. \\n\\n\r\nIf it were not for that issue and the already-been-done events in this anime, I may have rated higher for the cute concept - I would say this anime is more of a 7/10, but I rated it an 8 because I'm generous with my ratings :)",
            "date": "2016-12-31T19:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 237126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5566481.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lolipopsicle",
                "username": "lolipopsicle"
            },
            "url": "https://myanimelist.net/reviews.php?id=237126"
        },
        {
            "content": "Well when I was recommended this series I will admit I was sceptical and to be fair it is obvious from the start just what kind of crowd this anime was aimed at. \r\nNevertheless I followed my golden rule and I gave it a fair shake. This series is what we call a reverse harem in that instead of a male protagonist with endless females hanging off his arm, we have the complete opposite. \r\nI was drawn in by the premise with a kind of sick fascination as it was so different and I love different. \r\nFat girl becomes thin and gorgeous and everybody wantsher suddenly.\\n\\n\r\nAdmittedly the show can be funny at times but the problem lies in everything else. \\n\r\nThe animation while pretty good is backed up by a mediocre (at best) soundtrack and bland and tasteless characters that seem to have been copied and pasted from other series.\\n\\n\r\nThe ludicrousness of the whole situation where she and several guys go on a date all at the same time personally rubbed me the wrong way and is actually a concept that I haven't come across in standard 'harem' anime as the main is too scared to ever make an actual choice in those. \\n\\n\r\nAll in all...\\n\r\nI recommend that unless this trope is definitely your kind of thing that you give it a skip or just watch the first 2-3 episodes to get your laughs before moving on.",
            "date": "2017-02-22T02:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 241128,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AraelDranoth",
                "username": "AraelDranoth"
            },
            "url": "https://myanimelist.net/reviews.php?id=241128"
        },
        {
            "content": "While the premise of this show might seem shallow and repetitive at first, I think it's worth sticking around to look into. \r\nI found this show totally by accident. I watched a clip of it on Youtube, encompassing Serinuma's weight loss transformation. It looked funny, so I decided to give it a try. Needless to say, within the first episode, I found myself pissed off by most of the people in the show, especially because they were all so shallow and rude. However, as the show went on, it really grew on me, and while I don't agree with some of the statements made, itmade for a really fun time.\\n\\n\r\nTo begin with, the story; the story was decent (I would have preferred a few modifications; after all, fluctuating weight is a problem, especially when starving yourself is how you get there) and I had a lot of problems with the fat-shaming. However, the show got better in that aspect. It showed change in the people who previously fat-shamed Serinuma, who learned to fall in love with a personality instead of an appearance. I thought the message was sweet. I liked it even better considering I'm a massive fangirl and otaku myself-- however, I'm not as big on BL as Serinuma is. I just ship EVERYTHING-- no restrictions. :) As a fellow obsessive fan, I really enjoyed all the little references in the show and nods to fan culture. (AND YES IT DOES MATTER WHOSE NAME COMES FIRST IN A SHIP FIGHT ME) (I'm worse than I thought I was...) XP\\n\\n\r\nThe art was beautiful. The backgrounds were colorful and ever-changing, not to mention that all the girls and guys were drawn beautifully and were very appealing to look at. \\n\\n\r\nThe sound was alright. Both the opening and ending were catchy, but I'm not sure if I would listen to it again unless it just came up. The background music was fitting and wasn't distracting. \\n\\n\r\nThe characters were pretty amazing. As a fangirl, I appreciated having the community represented by such an amazing example :D Jokes aside, it's been a while since I've seen a heroine with so much nerve and passion, and considering that I hate most female characters (they're usually written as passive, submissive, and weak) I was pleasantly surprised to find myself liking one-- ESPECIALLY in a reverse harem anime! Some of the boys were insufferable at first due to their rude behavior when Serinuma wasn't attractive, but a few of them I liked (namely Mutsumi and a little Igarashi as well) because they respected Serinuma even when she was 'fat'. While Nishima definitely isn't my type, I really loved her respect and honest love towards Serinuma, no matter what she looked like. Despite being an avid shipper of anything and everything, by the end of the show, I just loved everyone together as a friend group opposed to anyone dating Serinuma (though I think Mutsumi deserves her most out of everyone there... I can find room in my heard for Nishima and Igarashi if need be).\\n\\n\r\nI enjoyed this way too much and finished it in less than 24 hours (which I rarely do... I usually don't get this excited over many shows). There were enough references and fangirl jokes to have me on the ground laughing (which is rare for me, I rarely laugh while watching anime) there were also enough cute moments for me to be screaming into the void as my shriveled fangirl heart started beating again. All in all, this was a wild ride, and I was glad I tried it! \\n\\n\r\nI would recommend this if you: like otome games, like reverse harems, like smexy boyish lesbian girls, like hot dudes, like cliche anime episodes like the 'beach' episode and the 'ghosts' episode, are a fangirl, are a BL fangirl, like shipping things, like humor and satire\\n\\n\r\nI would NOT recommend this if you: don't like harems of any sort, don't like fangirl or fangirling, you don't like shipping, you like serious plotlines, you wanted serious romance\\n\\n\r\nHave a great day everyone!",
            "date": "2018-03-17T14:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 274101,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=274101"
        },
        {
            "content": "This is a pretty good anime. The story is interesting. The characters are great and funny. I loved the animation as well. I do recommend it because you will laugh your pants off. The main girl is Kae Serinuma who by the way is hilarious. I swear she cracked me up every episode. She honestly makes the show. The guys are also pretty funny. If you're looking for a funny high school romance story then this is it! \r\nHowever, there are two things that I didn't like \r\n1.) The way she lost weight makes no sense. \r\n2.) I hated how the guys who ignored herfor years are now suddenly into her because she's hot. Mutsumi senpai was the only one who was kind to her before. \\n\\n\r\nANYWAY, \\n\\n\r\nI know a lot of people hate the ending but honestly I kind of liked it. It was different and funny. It's a great show so go watch it! Also I hope they make season 2.",
            "date": "2018-01-22T22:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 269393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919522.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JoyJoyJoy",
                "username": "JoyJoyJoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=269393"
        },
        {
            "content": "Summary:\r\nThis anime is about 4 beta orbiters and 1 lesbian who are all attracted to the main character, this really annoying but beautiful girl who is a massive gay anime loving otaku. This love for gay anime leaks to real life and she often fantasizes about romance between guys. Every episode they all follow her (the main character) around doing stuff for her, helping her and guarding her in hopes to get (sexual) attention from her. However she doesn't like any of them romantically and ultimately let's them down (really predictable and anti-climatic ending), because she likes her gay anime more than real life.\r\nThoughts:\r\nThere's verylittle character deveploment and the characters itself aren't that good either. There's some humor and anime references, but nothing that would make me laugh. Probably the only good thing about this anime is the animation and art style, it's easy to look at. But that doesn't help when you got a really bad story that doesn't produce other feelings than anger.\\n\\n\r\n4/10, would not watch again.",
            "date": "2018-01-20T12:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 269145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5146029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kipsu",
                "username": "Kipsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=269145"
        },
        {
            "content": "I ain't gonna suggest it if u're male.\r\nBut this story was fun. It felt like lowered version of modern \"Ouran High School Host club\". I just wanted watch this series because there's a scene fat mc turns into cute bon kyuin bon girl :)). I expected lot but In fact i couldn't get why she turned into that as logical way... that was disappointing. Author could've made it better if he had more experience expect BL manga settings. Nah whatever, it'd be good dessert for fans of BL. But it was not bad for me. \r\nStory is good. But author destroyed main key point atfirst place. Why she turned into cute girl... if it explained with logical way it could turned this series to great one. But it just buried in the ground. \\n\\n\r\nArt was normal. Characters movements were normal. Background was lonely. \\n\\n\r\nAt early episodes character's voices it didn't stick to my ears. But it stick later. Op, ed were normal but osts were better.\\n\\n\r\nI didn't liked mc girl. \\n\r\nIn fact this anime's main genre was romance Mutsumi could be main heroine. I liked him.(for his role)\\n\r\nOthers were fine. \\n\\n\r\nIt wasn't bad. I had a good time. I enjoyed 240 mins. \\n\\n\r\nSee you again at other reviews.\\n\\n\\n",
            "date": "2019-01-20T09:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 299573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526766.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nyamo-sama",
                "username": "Nyamo-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=299573"
        },
        {
            "content": "To begin, I'm not exactly into BL and stuff like that. I am completely a straight male.\r\nThis is my first review ever since joining last October.\r\n---------------------------------------------------------------------------------------\r\nBasically, I honestly think that the art, sound, and story is superb. It has all those good elements to it. Once you've watched enough anime (romance and shoujo in particular) in your lifetime you'll get this certain irresistible feel about this certain series that it absolutely has that \"romantic excitement\" to it that makes you feel tingly all over.\r\nThe characters are ABSOLUTELY LOVABLE. Although it may seem like it has the cliche elements of an otome, the characters are stillunique in their own way. I firmly believe that this anime is totally and utterly adorable and I love it to bits!\\n\\n\r\nThis anime is recommended for those hopeless romantics out there!\\n\\n\r\nIT IS PERFECT! 10/10",
            "date": "2016-12-31T02:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 237061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5779067.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/metalrain_15",
                "username": "metalrain_15"
            },
            "url": "https://myanimelist.net/reviews.php?id=237061"
        },
        {
            "content": "I binged watched this series in one sitting and here's what I have to say if you're interested in my opinion. Go!\r\nOk, so the art is great and each of the main cast has different aspects to each of their personalities that just makes them likeable and you see pretty equal amounts of each of them so viewers certainly have enough to see with whoever they ship the main heroine with (or with any other character!)\r\nThough I do wish that Kae's best friend A-chan had more screen time considering that she is, well, the MC's best friend and all. Bit odd that we only seeher in small intervals and that Kae only spends time with the \"harem\".\\n\\n\r\nThough I usually dislike the whole weight loss cliche I do like some aspects of how this one was handled (just in case any future viewers are avoiding watching for that reason) - \\n\\n\r\n1 - The weight loss was completely unintentional and it doesn't affect whatsoever the way in which the MC lives her life. \\n\\n\r\n2 - Before her change Kae wasn't bullied about her weight which is a trope often seen that I'm very glad was not in this. \\n\\n\r\n3 - Someone is called out on the fact that they only started liking the MC after she lost the weight and is made to reflect on that.\\n\\n\r\nAll in all this is a good comedy anime that is light-hearted and doesn't take itself too seriously, so if you're looking for a strong plot I'm afraid you're not going to find it here. I'd recommend this anime for people who like fanservice (there are pretty boys AND girls, though definitely more boys) and people who just want something easy to watch and have a bit of a laugh. Also I have a feeling that if you like visual novels (as I do) you will also probably find yourself liking this!\\n\\n\r\nHope this little review helps!\\n\\n\\n\r\n(Also Mutsumi-Senpai is the best - Fight Me.)\\n\\n\r\n(NOT A SPOILER BUT COULD BE THOUGHT OF AS ONE SO READ BELOW AT OWN RISK)\\n\\n\r\nHOWEVER one reason why people might not like this anime as it's why I unfortunately had to knock down the rating from and 8 to a 7 is that if you are a romance lover as I am this anime has what can be thought of as an open ending and no actual conclusion pairing.\\n\\n",
            "date": "2018-09-23T06:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 289763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4641371.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Emeraldyoukai",
                "username": "Emeraldyoukai"
            },
            "url": "https://myanimelist.net/reviews.php?id=289763"
        },
        {
            "content": "This show was so entertaining!! I really loved it. It's a good time kind of show. I laughed out loud so many times and having the romance thrown in just made it that much better. I feel like Kae is really relatable and is just so cute. I love when the girl is actually super pretty and the guys are just as good looking.\r\nThe only thing that would have made this anime better would be if they had progressed within the relationships with the boys. I was hoping for more of that. But overall I still love the guys trying to win her over.\r\nOverall ithas a good mixture of romance and comedy. It's a cute show. I couldn't stop watching it. I would definitely recommend this show to anyone who is even remotely interested in it. You won't regret it.",
            "date": "2018-08-23T21:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 287245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7306167.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thatgrrljen",
                "username": "Thatgrrljen"
            },
            "url": "https://myanimelist.net/reviews.php?id=287245"
        },
        {
            "content": "Many of us can relate to this otaku friend. The main character Kae is an ordinary girl who's an otaku. Actually, she's a pure fujoshi, which means she's very obcessed with anything BL in anime world.\r\n\"Watashi ga Motete Dousunda\" aka. \"Kiss Him, Not Me\"... For a first impression, the story didn't disappoint me at all. The comedy is infinite, which means is fun to watch from the very first episode to the last one. I personaly think that whoever tries watching this anime \"Watashi ga Motete Dousunda\" will NOT be disapointed at all, I can guarantee that, however... be aware that this may show alittle yaoi in some parts, but I think you shouldn't be bothered by it cuz the whole anime will be focussed more in comedy and the fight to win Kae's heart.\\n\\n\r\nThe jokes about anime will make you laugh like, \"Hey, that's-\" or \"Where have I seen this reference from?\". You will get the idea once you try and see what I was talking about. It's super fun to watch!\\n\\n\r\nAbout the boys... no offence, but I think they are an eye sore, except for Mutsumi which did like Kae before she got thin. Mutsumi, for me, is the only one for Kae, a pure heart angel, the most genuine boy I saw in this entire anime.",
            "date": "2018-03-12T18:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 273681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5933783.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PurpleGirl203",
                "username": "PurpleGirl203"
            },
            "url": "https://myanimelist.net/reviews.php?id=273681"
        },
        {
            "content": "This show is about an overweight girl who drastically losses weight overnight and ends up having 4 guys pining for her. Even though it’s rather shallow they even find her personality  irresistible. My favorite thing about this show is the main character Kae Serinuma. She is kind and bubbly but also a little awkward. She is a huge anime fan and I completely relate to her in more ways than one. The story itself is not he greatest however I still found myself enjoying the show. If you just want a funny lighthearted show to check out I would suggest giving it a try.",
            "date": "2018-02-28T11:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 272676,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6994675.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/asampsell",
                "username": "asampsell"
            },
            "url": "https://myanimelist.net/reviews.php?id=272676"
        },
        {
            "content": "Review #4: Kiss Him, Not me!\r\nStory 7/10 -- The story is funny, an interesting combination of reverse harem and comedy. The romance aspect of the series is average, partly because of Kae's addiction to merchandise, making her character uninteresting to fans of the genre. There's many tropes in this show when it comes to episode locations and events, but it's worth watching for shoujo fans, as the competition between the guys is intense, but professional and peaceful at the same time.\r\nArt 6/10 -- I'm not a real fan of Brain's Base, and the art seems like it would come from an anime 10 years agorather then late 2016. The character design isn't that unique, but props to the guys that make the comedic faces in the series. Not a lot of visible mistakes to my eyes, however the series backgrounds lacked detail from my perspective.\\n\\n\r\nSound 7/10 -- Acting was average, music also average. \\n\\n\r\nCharacter 8/10 -- Even though the character design was average, I actually enjoyed the growth of some characters in this series. Yuusuke learns quickly that not everything is based off looks. Nozomu and Hayato are both naive but earn maturity points while they spend time with Kae. Shima and Asuma are probably my favorite characters, as I like Asuma's quiet but cool mannerism, and Shima's loyalty to who her friend was from the beginning. Kae seems awkward as a reverse harem protagonist, but her obsession with BL makes her character unique, and it shys away from the harem genre and makes it more amusing as a comedy. \\n\\n\r\nEnjoyment 7/10 -- I think what's most enjoyable is the boys passion for trying to win Kae over, mixed with Kae's and Shimas hot topic of seeing the boys together. The two different agendas blend well together to make an interesting series to watch. The facial expressions are golden, but certain characters definitely leave more impression then others. I think the first half is better then the second half as well, as you realize that the story seems to slow down after midway.\\n\\n\r\nOverall 7/10 -- Reverse Harem and Shoujo are two genres I don't watch a lot. However being new to both, I found this anime to be amusing. It's not as great as Ouran Host Club, but I believe this anime can't be compared to that one fairly. This anime is mid tier for people that are stocking up on plan two watch lists. Even though i'm giving this series a 7 overall, I probably wouldn't recommend this series to romance fans, as it's more of a comedy aimed at girls rather then a romantic show.\\n\\n\r\n~Castawayz",
            "date": "2018-02-17T06:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 271740,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=271740"
        },
        {
            "content": "A series that openly mocks Otaku culture, while being written in a way only otaku will really get, \"Kiss Him, not Me\" is a functional but completely forgettable series. Centering around a girl who loses a massive/unhealthy amount of weight and suddenly becomes popular, the premise is equally as shallow as most of the cast. Everyone is a stereotypical shonen or shoujo character, the plots cycle through all the main anime tropes (a school festival, a sports event, a beach episode, a dating episode with all 5 potential partners), and it all ends without any of the characters really moving anywhere. The only character whodoes have an arc still only does so to move the plot to a status quo ending.\\n\\n\r\nThat being said it is very self aware and pokes fun at the Otaku culture without pulling its punches, while also portraying that extreme otaku can be both functional as well as the worst kind of fan. If you have a weekend with absolutely nothing better in your que, you could find the humor enjoyable.",
            "date": "2017-02-03T19:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 239852,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5541769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CCYamato",
                "username": "CCYamato"
            },
            "url": "https://myanimelist.net/reviews.php?id=239852"
        }
    ],
    [
        {
            "content": "This anime is aimed at a particular audience. It is 'shoujo anime' but I think fujoshis will find this anime more enjoyable. \r\nThe story is about an obese girl, Kae Serinuma, who becomes depressed after her favourite anime character dies. She stops eating, and a week later, when she decides to stop sulking, she realizes that she has lost a lot of weight and now looks extremely pretty. Yes, I know what you all are thinking. 'What the hell?!' isn't it? But trust me, if you just ignore this tiny little fact, you will find the series more enjoyable. \r\nA lot of people argue thatall the episodes are really random, but that is what makes it so fun to watch! None of the episodes are lacking in humour and there are almost no plot holes. Although, I do get what the others are trying to say... The story doesn't progress much in the 'romantic aspect' and the ending is a BIG troll, but I found it kind of funny. I know a lot of people were disappointed with the ending since they were all rooting for someone or the other to end up with Serinuma, but there's always the manga, right? Go read it. She has already chosen someone in the manga. \\n\\n\r\nRemember that the author of this is a BL mangaka, so you might not be able to fully understand certain parts of this anime if you aren't a fujoshi. \\n\\n\r\nMy Score:\\n\r\nSTORY: 8\\n\r\nART: 10\\n\r\nSOUND: 9\\n\r\nCHARACTER: 8\\n\r\nENJOYMENT: 10  \\n\r\nOVERALL: 9\\n\\n\r\nThis is just my opinion.",
            "date": "2018-02-02T01:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 270395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6723887.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kotonami_chan",
                "username": "Kotonami_chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=270395"
        },
        {
            "content": "Watashi ga Motete Dousunda (Kiss Him, Not Me) is about a girl named Kae Serinuma who is an otaku and an avid lover of all things yaoi.  She begins the story being overweight, but once she watches her favorite anime character get killed off she grieves for him and in doing so she refuses to leave her room, eat any food, and shuts herself off from everything for awhile so she can continue mourning her precious Shion.\r\nSince she refused to eat, she has miraculously lost a significant amount of weight and now is thin and now considered to be a beauty.\r\nHer peers are shockedand some of them even fall for her. In particular, four boys and even a girl.  These five pursue her throughout the anime and try to win her over by competing with the other four.\\n\\n\r\nNow for individual scoring:\\n\\n\r\nStory - Nothing too original, its a reverse harem with many clichés and typical things you'd see and expect in a harem with a touch of comedy.  One thing in particular that I liked about this anime is that all candidates in this harem got a fair chance at winning Kae Serinuma over, including the other female.  Other than that nothing too notable.  The story was interesting to continue to watch and I got through it fairly easily and quickly without growing tired of watching it.  Although the ending was predictable (and to be honest, slightly disappointing) the story was fairly well done.\\n\\n\r\nArt - Artwork is pretty well done, but somewhat generic of its type.  That being said, its fine and is by no means \"ugly\" to look at.  However, I must point out that it took me quite awhile to get used to the coloring of many characters eyes.  They seem to have tried to make the characters eyes pop more with a gradient of color, but in many cases for me began to be a bit of an eyesore at first.\\n\\n\r\nSound - Music was well fitting and fine, nothing bad to say about it.\\n\\n\r\nCharacters - Character designs were good and unique.  Each character had an interesting personality and I found myself liking all of them quite well.\\n\\n\r\nOverall, Watashi ga Motete Dousunda (Kiss Him, Not Me) was a fairly well done anime.  Even though I personally do not enjoy harems, I found this one to be good and I was able to watch it with ease.  In my opinion, this anime was quite enjoyable, I got a few laughs out of it, and felt it was something I felt I wanted to finish and see through to the end.\\n\\n\r\nEnjoy the anime if you plan on watching it, and thank you for reading!",
            "date": "2017-01-10T18:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 237986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4868019.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dustyyyy",
                "username": "Dustyyyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=237986"
        },
        {
            "content": "Kiss him, not me. The name suggests the series would probably be centered around Yaoi but thankfully that is not the case. The main character (female) is a fujoshi who loves pairing \"ikemen\" guys being hardcore at what she does. Through a miraculous weight loss she becomes the center of attention for these guys she so loves pairing. The guys try to woo her in attempts to get her to like them back. \r\nThe charm of the series lies in the fact that the female MC cannot fathom a scenario of a girl and guy dating. As I said a hardcore fujoshi she is. Despitethis the series does, at one point seem like it would make a decent romance anime. However, this is ruined by the end of this season. So if you are also like me and are suckers for love stories this might be a little harsh on you at the end.\\n\r\nAll in all the anime is a good laugh. Although I would like to point out that I don't really like the voice actress behind the MC female. All the other characters are well represented and have a life of their own. Each have their own well thought out personalities which is good to see. However, it's generic in the manner that you have a klutz, a kuudere, a tsundere and others.\\n\r\nThat ends my review. I hope I eased your decision on whether or not to give it a try. If you liked my review please click that helpful button. I would also appreciate comments if you have any about my reviews and how I could improve on them.\\n\r\nThank you",
            "date": "2016-12-25T08:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 236466,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2398295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gagan5867",
                "username": "gagan5867"
            },
            "url": "https://myanimelist.net/reviews.php?id=236466"
        },
        {
            "content": "Watashi ga Motete Dousunda is a great shoujo anime that mixes static characteristics and dynamic environments together in beautiful blend in this reverse harem romantic comedy.\r\nTo start off, this anime rarely acts as a harem. It's more similar to Watamote than anything else. Kae Serinuma is plunged into several situations she's never been in such as having an romantic relationship. Everything that she's learned about relationships, is from her insane BL/fujoshi lifestyle. To say that our main character is oblivious and unrealistic is wrong, and it puts a complete twist on the harem stereotypes. She isn't looking to screw one of these guys, but insteadwants to see the guys screw each other. She's a static character in a dynamic environment.\\n\\n\r\nThat's what makes this anime great. \\n\\n\r\nSerinuma is set in a situation with 5 guys + 1 girl in which she doesn't know how to handle, so she puts them in ludicrous scenarios (or the guys put themselves in ludicrous scenarios) where she can keep her BL lifestyle alive. It's the perfect protagonist for the intended audience.\\n\\n\r\nThe show makes it that every character is likable in someways. Our MC's disinterest in the others makes it so that this can spark conversation, shipping, etc for the fanbase. One episode even makes fun of that exact premise. Overall, the character interactions and humor is great. It's kinda like \"One Punch Man\", you either understand it or not. Not for everyone, but still a great show and I highly recommend it to anyone that understands fujoshi or BL culture.",
            "date": "2016-12-24T19:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 236422,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5587097.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Marth_of_Altea",
                "username": "Marth_of_Altea"
            },
            "url": "https://myanimelist.net/reviews.php?id=236422"
        },
        {
            "content": "Every week I look at this website and when I saw that Watashi ga Motete Dousunda was having an adaption... I flipped.\r\nI've already read the manga and I loved it so much so I was excited seeing an adaption to the manga, but the way it was made was strictly by the manga and I was kind of expecting a little twists from the manga, well, the end I suppose.\r\nThe start of it was kind of like a regular shoujo character but it uses the idea of regular romance to create more ideas within the story. For example, the regular shoujo heroine is actually afujoshi which ships people in her class ~which is relatable lol which means shounen-ai and shoujo-ai themes across the anime, which I think is the cool thing about the story\\n\\n\r\nThe art was beautiful, the design was just like Junko's designs in the manga which I love the designs so the art was nice. \\n\\n\r\nThe sound was okay. I listen to every opening and ending theme in each anime but I don't know how to react to this at all, it jsut seemed plain.\\n\\n\r\nThe characters are loveable. The reason is, they're all funny. They all have there own purpose, and that is to go out with the protagonist.\\n\\n\r\nOverall, I enjoyed it very much and I would really recommend this to anyone who wants to try becoming a fujoshi.",
            "date": "2016-12-24T10:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 236369,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5496268.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/WFCgbow",
                "username": "WFCgbow"
            },
            "url": "https://myanimelist.net/reviews.php?id=236369"
        },
        {
            "content": "Story - 8\r\nIf you're familiar with other reverse harems this takes a very commonplace narrative and presents it in a funny, light-hearted, near-realistic way (not quite as over-the-top in comedy The Wallflower, not as serious at times as Ouran). I felt that a lot of the story may have been rushed as sometimes this happens with adaptions to \"keep up\" with the manga. The premise of this series has a leg up on it's predecessors and is relatable to the average femme otaku or fujoshi (I am the former, not the latter - I'm not into BL as much as the protagonists, but can empathize).\\n\\n\r\nArt - 8\\n\\n\r\nI personally love the simple distinctive shoujo style, and the colours used and details to the main characters eyes are captivating. Everything else is pretty standard animation.\\n\\n\r\nSound - 7 \\n\\n\r\nIntro is pretty catchy and memorable, but the ending song isn't. Standard anime dramatic-ism and shoujo/comedy sound effects.\\n\\n\r\nCharacter - 8\\n\\n\r\nThe main characters fit their tropes/types but have great build-able backstories. The only issue I had is the lack of personal development or background we have is from the protagonist, Kae - unlike predecessors that feature dramatic weightloss, she is shown to be just herself and there are seemingly no mental or physical repercussions to the sudden gain of popularity - aside from her constant note that she's not used to attention, gets flustered easily, and is not used to human contact.\\n\\n\r\nEnjoyment - 8\\n\\n\r\nKae is relatable, and the boys that love her are strongly built and believable. I thoroughly enjoyed it and ended up binging the whole season in one night to get to some type of resolve (surprise - it's ongoing!). \\n\\n\r\nOverall - 8",
            "date": "2017-04-02T11:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 244376,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70668.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/himecinda",
                "username": "himecinda"
            },
            "url": "https://myanimelist.net/reviews.php?id=244376"
        },
        {
            "content": "*sPoiLerS*\r\ni really enjoyed this anime. it was pretty hilarious. but..it was just the average reverse harem. of course she didn’t end up with one of them. \r\nstory; 7/10. \r\nthe plot sounded stupid, which is why i wanted to watch the anime lmao. i don’t really know what else to say about the story. { i’m pretty lame at giving reviews oof. }\r\nart; 10/10. \r\ni loved the animation. especially the character designs. it was well made and nice to look at. \r\nmusic; 100/10. \r\nTHE OPENING THEME IS HANDS DOWN THE BEST PART OF THIS ANIME. it was so catchy, i never skipped it. the ending themeis good too. \\n\\n\r\nsound; 9/10. \\n\\n\r\nvoice acting was pretty decent. i don’t know about the dub since i watched the sub. \\n\\n\r\ncharacters; 7/10. \\n\\n\r\nthe characters..i guess i liked all of them? serinuma was like most female protagonists in reverse harem { actually maybe not most since she was like, the biggest fujoshi on the planet } but i really liked mutsumi and shima. and honestly apart from those two, if felt like the other three { igurashi, nanashima, shinomiya } were only in love with serinuma for her looks. maybe igurashi realised he liked her for more than just her appearance but, eh i don’t know. \\n\\n\r\noverall; 8/10. \\n\\n\r\nwatashi ga motete dousunda is a hilarious anime, and a good one to watch if you need a laugh.",
            "date": "2019-04-27T15:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 307270,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7932588.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mikaelachan_",
                "username": "mikaelachan_"
            },
            "url": "https://myanimelist.net/reviews.php?id=307270"
        },
        {
            "content": "Is it wrong to enjoy this show? I mean I would't tell anyone I watched it. I feel like this insults my super ultra analyst reviewer persona to an freakish degree. Harems are objectively bad and no one should enjoy them right? Well Its a bad show but if anything was good it's the voice acting which is fantastic and is the best thing added to the anime. The hilariously goofy voices add alot to the characters like when serinuma and nishina go full fujoshi mode. The ed is also good but set's me off at the same time. I value their friendship more thanthe who win's deal.I like all the characters and their individual episodes do well to flesh them out. Nanashima is best guy his relationship with his sister felt so wholesome like they were actually siblings and not gross anime stereotypes. Mutsumi and Igarashi are alright characters who care more for serinuma over the course of the show. I would've given this show a 7 if the ending was better and did'nt make me feel like everything I just watched was pointless.I had some fun with this show and no one should be ashamed of what they like which is why I dislike the term guilty pleasure. I feel some kind of desire to read the manga which is more than most other shows accomplish.",
            "date": "2017-03-09T20:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 242210,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5205089.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Riotpilot14-15",
                "username": "Riotpilot14-15"
            },
            "url": "https://myanimelist.net/reviews.php?id=242210"
        },
        {
            "content": "Okay. Listen, you need to know going into this that it's meant to be cliche. Like, the whole point of the anime is to throw every yaoi and reverse harem cliche it can at you. Also, there's a lot of anime innuendos. Like \"Grey Butler\" and Attack on Titan cosplay. So... just know what you're getting into, okay?\r\nAlright, first of all, the art is gorgeous. It's just the type of art style I like. Pretty colors, refined character designs, and good environments. Also, this anime is funny as hell. Especially if you can relate to the type of anime viewer/fan the main character is. Ithink the premise of the series comes across really well; it pulled off what it wanted to. \\n\\n\r\nThe characters, as well, were all very fun to watch together. The ensemble as a whole made the anime very entertaining. Like I said, this anime is cliche, though, so the characters are all very textbook. You got your bad boy, your tsundere, your hot jock, your mild-mannered dude, etc. etc. \\n\\n\r\nI do like that the story is sort of taking the piss out of excessively wild fans and a couple anime genres, but... I don't know, I was hoping that, at some point, it was going to turn into a somewhat compelling story. I've seen anime of this type that do actually become something else that can stand on its own, but this one didn't. It just didn't have much substance. I will admit that that's probably because this anime didn't adapt all of the manga, but from what I saw, the story didn't have any depth beyond the base romance plot. There wasn't any character development that let me attach to these characters. They were fun to watch, but I couldn't say, \"Ah, so that's who this guy is.\"\\n\\n\r\nObviously, I don't think this anime was meant to be all that deep. I think, as I said, it did what it set out to do and that was to create a fun, light romance story. It isn't entertaining to watch, and I got quite a few laughs out of it. If you aren't searching for a super sophisticated romance story like Ao Haru Ride or Ouran HS Host Club, but rather are looking for an easy-to-watch anime, this'll do it for you. I wouldn't come back to it, but... actually, as a game, I'd be down. So, who knows? Maybe it's better than it seems?",
            "date": "2019-03-18T18:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 303819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=303819"
        },
        {
            "content": "This is a light romance, more comedy anime for the weekend.\r\nCharacters were generally well developed, and the relationship between them really evolved too.  From the first episode to the very last you create a connection with them and that's very cool.\r\nThe story is fine, probably too many cliches, but I really laughed hard sometimes. It's very positive and the boys are charming.\r\nThe only BIG problem si the ending, which is very unsatisfaying and predictable, I wish they took the romance situation more seriously, but they didn't.\r\nIn the end, is not an amazing anime, but it gives you some joy.",
            "date": "2019-02-16T04:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 301781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MephistoChan",
                "username": "MephistoChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=301781"
        },
        {
            "content": "-- THIS WILL CONTAIN SPOILERS --\r\nWhile everyone else is freaking out about how progressive and phenomenal Yuri!!! on Ice is, I'll just review this anime. Usually, I'm not a huge fan of harems, Kiss Him not Me captivated me due to its appealing colors and the characters. It's also very relatable for fujoshi! (I'm not a fujoshi but I still found it relatable as an anime fan)\r\nSTORY: 7\r\nThe story is pretty typical for a reverse harem. Serinuma Kae is a fujoshi who starts out being overweight but then loses it all once she becomes depressed and locks herself up in her room after her favoritecharacter dies. After she loses weight, all of the cute guys that she ships together ends up falling in love with her and competing for her love. I'm not a huge fan of a character's weight being the butt of the joke (which unfortunately happens in almost all anime) but the way each character interacts with Kae drives the story forward, which I really enjoyed.\\n\\n\r\nART: 7\\n\r\nThe art was also typical for a shoujo anime. The characters and backgrounds are very colorful and pretty pleasing to look at. It's not the most gorgeous thing ever, but I was able to deal with it. \\n\\n\r\nSOUND: 6\\n\r\nThe opening was the most reverse harem thing (that's the only way I can describe it) I've ever heard come from an anime. It's unfortunately also pretty catchy (it's stuck in my head as I speak). The ending song isn't super memorable and the BGM doesn't really stand out at all. The ending and opening songs are both fitting for the anime, so I'll give it that.\\n\\n\r\nCHARACTERS: 8\\n\r\nAll of the characters are extremely tropey, but I love Nishina and 6-senpai a lot so I'm being extremely forgiving here. I'm gonna rank them from best to worst (in my personal opinion)\\n\r\nI personally consider Nanashima to be worst boy since there's literally nothing going for him other than the fact that he looks like Serinuma's favorite anime character. He's a pretty big jerk and one of the main people that forced Serinuma to lose weight when she gained it back (which is just... really? come on, man).\\n\r\nShinomiya is probably the most tropey one since he's supposed to be the obligatory shota. I love cute characters, so I couldn't let him be worst boy. He's not a jerk, unlike Nanashima. But at the same time, the shota characters usually aren't jerks so I wouldn't imagine him being one.\\n\r\nIgarashi is a better version of Nanashima. He was one of the first ones to be straight forward about his crush on Serinuma. He also treated her somewhat ideally. I wasn't a huge fan of his character design, though.\\n\r\nMutsumi-senpai is infinitely better than the other three boys. I honestly question why there's competition between them to begin with. He's really nice to Serinuma, doesn't force her to lose weight, and is extremely accepting of her and her interests. Near the end (for reasons I won't say) he especially proves himself to be best boy of the series. \\n\r\nAnd finally, there's Nishina, the only reason why I fully enjoyed this anime. I personally consider her to be best girl of the year because of how cool she is. \\n\r\nOne thing I really liked about this anime was how Nishina was treated like a proper member of this harem. None of the characters belittled her for being a girl pursuing Serinuma and saw her as an equally formidable competitor. A lot of people praised Yuri!!! on Ice this season for being progressive for same sex relationships, but at least (spoilers here oops) Nishina actually claimed that she loved (she said \"daisuki\" for goodness sake, unlike the other three inferior boys) Serinuma. There was no gay subtext or inferences or \"they don't have to say 'I love you' for it to be love\" bs she was straight to the point and confessed her love. Definitely less queerbaiting than Yuri!!! on Ice IMO.\\n\\n\r\nENJOYMENT: 9\\n\r\nI genuinely enjoyed this anime for what it was. It was very fun to watch and it kinda made me feel like a middle schooler again (that wasn't a bad thing, by the way).\\n\\n\r\nThis was a lot longer than I wanted it to be and I didn't mean to bring Yuri!!! on Ice into this, but I just needed to go into why I liked this anime. If you feel like YoI was queerbaiting and want to watch something more genuine, try giving this one a chance?",
            "date": "2017-01-15T09:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 238361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4259189.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/flababe",
                "username": "flababe"
            },
            "url": "https://myanimelist.net/reviews.php?id=238361"
        },
        {
            "content": "I have to admit, I was very excited when I first heard about this anime. That's too bad because it was disappointing. I'm not too much of a harsh critic, but I believe that my score for this anime is fair. I'll admit though that I should not have had high expectations. When you read the description, you would have most likely become super excited to watch this Anime. But to be honest, It was a letdown. and here is why\r\n.\r\n.\r\n.\r\n>\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\nStory: 6/10\r\nThis story is about a second-year girl named Kae, who is a fujoshi that is absolutely obsessed with BL (Boys' Love). She shipsher classmates Nana and Igarashi. After her favorite character from Mirage Saga (Shion) dies, she starves herself and loses weight. After she loses her weight, she becomes absolutely gorgeous. Then everyone falls head over heels for her.  As I've said before in my other reviews, It is hard to develop good stories/characters with so little episodes. \\n\r\nNow the first problem I'm going to talk about is the plot. To be honest, the show started very interestingly. but then the plot went nowhere. I've noticed this a lot in animes, and I personally refer to it as the Lost Plot Syndrome. The Lost Plot Syndrome is when an anime goes nowhere by either not knowing where to go after a certain arc ends, to betray its main purpose in an unprofessional way, or to suddenly turn into a filler show halfway through. The story starts as a standard reverse harem romance. I think that after you introduce the characters, you take your chances to turn your show from a standard anime into a unique one. I have to say that the idea itself was very creative, but it was not executed properly.\\n\\n\r\nCharacters: 8/10 \\n\\n\r\nKae: 6/10\\n\r\nI like the idea of having a fujoshi as the main character.  She was too much of an airhead though. \\n\\n\r\nMutsumi: 9/10\\n\r\nMy favorite. He was kind to her from the start and didn't judge her because of her weight.\\n\\n\r\nIgarashi:8/10\\n\r\nAlthough he fell in love with her for her looks, he learned over time to like her for her true self.\\n\\n\r\nNanashima: 8/10\\n\r\nHe turned from a rough aggressive bad boy into a nice, understanding person. I like how he is shown to be a good older brother. But what on earth was the fever that he got that made him do that to Kae?\\n\\n\r\nNishina: 8/10\\n\r\nI didn't know why I shipped her and Kae so much. But I do like her character.\\n\\n\r\nShinomaya: 9/10\\n\r\nVery adorable. I like how Kae brings him confidence.\\n\\n\r\nArt: 9/10\\n\r\nVery good. The best thing about this Anime. Is it just me or does it get better throughout the show? Only minus a point because the \"lipstick\" was very dark and out of place.\\n\\n\\n\r\nEnding:3/10\\n\r\nVery bad. Because the creators didn't want to choose a favorite, they ended it in a dumb way. \\n\\n\r\nSoundtrack: 5/10\\n\r\nVery average. Nothing special that stands out.\\n\\n\r\nExtra: Enjoyment (7/10)\\n\r\nPretty funny for the most part. Although its sense of humour is quite average for this genre. \\n\r\nShould YOU watch it?\\n\\n\r\nMaybe. It is a very standard reverse harem anime with good art and a not so good plot.\\n\\n\r\nOverall score: 6/10 (AKA fine)",
            "date": "2019-01-07T07:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 298315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7626740.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MatchaTaiyaki",
                "username": "MatchaTaiyaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=298315"
        },
        {
            "content": "There were a lot of things I really liked about Kiss Him, Not Me. Some expected, and others that pleasantly surprised me. \r\nI think Kae herself is a good example. On one hand, she's pretty much what we were promised. A crazed fujoshi fangirl who can't quite separate her love for fictional characters from her everyday real life. But at the same time, there was more to her than that. I found her to be quite likable. She was generally a very kind and caring person, passionate about various issues when she saw them. (Spurred on by the Saturday-morning cartoon sort of justice that's beeninstilled in her throughout the years.) And she was capable of interacting with her classmates as real people. I guess it just felt a little... refreshing. I'm used to seeing otaku characterized as being so socially awkward that they can't even function on a day-to-day basis. The only time Kae really fits that bill is when she's face-to-face with her new friends' romantic intentions. As the series goes on, it was nice to see Kae stay true to herself. I feel like she learns and grows a little with each experience, but never really changes, and I liked that. Simultaneously, I liked seeing her suitors grow to accept her for who she is-- even the craziest parts of her-- more and more as they had more adventures together. And I found all of the main cast to have their likable points. I do wish most of them had been developed a little more, but I there was no one I truly disliked, no one who brought down every scene they were in.\\n\\n\r\nOn top of that, it was interesting to see the series occasionally tackle serious issues. The main plot itself comes into question-- addressing the boys only liking Kae for her appearance when she gains the weight back in one episode. This, thankfully, ends on the note that she's the same person on the inside no matter what she looks like. (And the manga actually addresses this issue multiple times and is more outright about the message the author was trying to send.) There's also an episode that takes a serious look into sexual assault, and Mutsumi's relationship with his older brother looks into sibling abuse and toxic family relationships... Honestly, the story with Mutsumi isn't addressed as completely as I hoped it would be, but I felt the sexual assault storyline was handled tastefully, and I really liked that the writers weren't afraid to discuss something so serious with no real barriers between the audience and the message they were trying to impart there. (Basically, it's a very quick moment with Kae and one of the love interests who's delirious with a fever at the time, but no one tries to brush it off like it wasn't a big deal, and Kae was reasonably affected by it, which I really appreciated. Too often in anime, those sorts of scenarios are brushed off like they're not a big deal-- or worse, played off like it's romantic in some way-- and it was just... very refreshing. Kae even goes back through her manga to reevaluate her opinions on those types of stories.) \\n\\n\r\nOn a lighter note, I can't remember the last time a show had me laughing this hard from start to finish, almost every single episode. There's definitely a lot to love here for long-time anime fans, a lot of references and just... otakuisms that they managed to simultaneously poke fun at and indulge in. I do think that you'll probably know from the summary alone whether you'll enjoy this show, though. I don't really feel like it's the type of show that can deviate from its intended audience, and it's not something I'd recommend to new anime fans. But I personally enjoyed it just as much as I thought I would, and if it sounds interesting to you, I'd definitely encourage you to check it out! \\n",
            "date": "2019-01-06T14:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 298252,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5131864.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Duckielover151",
                "username": "Duckielover151"
            },
            "url": "https://myanimelist.net/reviews.php?id=298252"
        },
        {
            "content": "Watashi ga Motete Dousunda is a great light-hearted anime, definitely more suited to a casual binge rather than a series to become committed to. I really enjoyed this short series despite the extremely frustrating ending to it, I found myself genuinely laughing out loud throughout the series. It combines yaoi and a reverse harem genres very well and makes for a very enjoyable watch (for the most part). \r\nI find that the series quite lacks a storyline, just multiple characters that are all pursuing one girl, who is somehow clueless the entire time of it. I really enjoyed watching the character development of Nanashima, Igarashiand Asuma Mutsumi but am disappointed to say that the main character, Serinuma, whom everyone pursues has no individual development whatsoever. \\n\r\nOverall I still rate this series a good 7/10 since it was entertaining the entire way through up until the last 5 minutes of the series finale. As you might be able to tell, I got a bit too attached to this and the ending was just plain disappointing and unsatisfactory so please take my advice and just watch it as a quick, casual binge.\\n\\n\r\nNow for all the viewers that have already finished the series, I just have a quick rant (including spoilers): In the last episode when everyone finally reveals their feelings to the clueless Serinuma and requests her to make a decision, she acknowledges the seriousness of their words and yet gives the MOST IRRESPONSIBLE AND SHALLOW CONCLUSION WHYYYYYYYYYYYYYYYYY UGHHHHHHHHHH\\n",
            "date": "2018-12-25T10:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 296813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/marytaptiklis",
                "username": "marytaptiklis"
            },
            "url": "https://myanimelist.net/reviews.php?id=296813"
        },
        {
            "content": "I was really torn between 6 and 7 for this one but ultimately decided for all the laugh to give it an extra point.\r\nThis anime is something you have already seen about hundred times and has little surprises to present. It actually started fresh, promising the viewer to show something slightly different from what already exists but alas, it turned into the typical harem/ slice of life. It included almost all stereotypes one can think of. The Cultural festival, the beach episode, the scary episode, of course all the romance and drama, fair share of misunderstandings and fights in the group of protagonists etc etcetc etc (does it sound familiar? Can bet few bells rang). In sense of story development, flow and setting it was disappointing, could not live up to my expectations especially with this high (MAL) score. \\n\\n\r\nThat said, however, I didn't give it a 7 for nothing of course. What was quite well done here was the humor (tsukkomi) of the characters. It really had me laughing out loud on few occasions and giggling quite a lot (though not all jokes can be properly translated into English so they wouldn't strike as funny). The references to and parodies of other animes were adequate as well. The art was very pleasing and so was the voice actor selection (except for Kobayasi Yuu - I admit she fits the fujoshi role quite well, but after the unexplained transformation of the heroine, that image gradually started to fade and it just became unpleasant hearing her high pitched voice, just a personal preference of VAs but I think Sawano should have voiced the heroine).   \\n\\n\r\n If I have to recommend anime to someone this will not be on my list of recs but if I'm asked if it's any good to watch, I would probably say if you want to waste time go for it, it's not bad, it's just I have already seen this pattern so many times and probably everyone else has too, so why bother watch something you already have watched....",
            "date": "2017-01-05T14:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 237519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26235.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Enjyu",
                "username": "Enjyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=237519"
        },
        {
            "content": "This is a very light and cute/funny anime. Over all, I liked it. The worst part of it is the end ... the last five minutes ... they went with the worst possible way to end the story. \r\nI also didin't like the way main character divelopped, or more specificly how i didin't develop at all.\r\nThe harem members were designed well. Their stories were covered in just the right ammount.\r\nI recomend the anime, just pause it before the last scene on the roof in ep 12 and pick your favorite :) it will save you some anger ;)\r\nI enjoyed the anime and don't have furthercomplaints.",
            "date": "2017-01-03T17:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 237372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211795.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_mirage_",
                "username": "_mirage_"
            },
            "url": "https://myanimelist.net/reviews.php?id=237372"
        },
        {
            "content": "Harem anime usually follow a certain formula. The main character is bland with brown hair and eyes while it's the other people around him that are interesting. Oh and the MC is always oblivious even though it's all happening right infront of them. \r\nThis anime plays with those stereotypes. The girl is not bland at all, in fact she has so much persoanlity there is very little room for someone else in her life... that isn't 2D that is. \r\nwith the guys they focus on their love interest and although each is a stereotype they play it up nicely giving them some depth. \r\nWith thegirl however they play up the extreme fangirl aspect which makes for a refreshing change... and it's freakin hilarious! It's also what kept her likable as they weren't afraid to play a few jokes on her expense rather then her being the magical Mary Sue. \\n\\n\r\nIf his anime had a fault is that things started to slow down in the later episode with a bit too much focus shifting to the romance.\\n\\n\r\nA solid anime with a lot of laughs. perfect for a slow weekend binge.",
            "date": "2018-04-27T11:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 279140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7172724.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kidlike101",
                "username": "Kidlike101"
            },
            "url": "https://myanimelist.net/reviews.php?id=279140"
        },
        {
            "content": "I wasn't expecting much, but there were a few laughs here and there.\r\nWatashi ga Motete Dousunda! A reverse-harem anime, a first for me. And I must admit that it was slightly better than I was expecting it to be. For starters we have Kae, a chubby, 'fujoshi' lover who drool's over two guys dating, and a crazy otaku. But one day, one of her most precious anime guys dies and she shuts herself out from the world for a few days. Then magic happens as she realizes that she's no longer a chubby mess, yet a cute, stereotypical girl with some redeeming factors. Thus followsa band of your standard, typical guys who all find her to be wildly attractive and go out of their ways to try and win her over. As you can see, this show is littered with cliches, but that's not too bad in this case.\\n\\n\r\nI like a show that can entertain me enough to the point where the cliches kinda go away. And wildly enough there were quite a few moments that made me laugh. \\n\\n\r\nAs for the sound and art, it's all very fair. Nothing too good, nothing too bad. Just what you would expect out of a show of this stature. I must admit that the voice acting was quite good though (subbed).\\n\\n\r\nSo overall I'd say that it's worth a watch if all you are looking for is some good, wholesome entertainment with nothing more around the bones. I will only recommend this anime to someone who is a die-hard fan of harem anime, or someone who just wants to be amused.",
            "date": "2018-04-10T20:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 277696,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=277696"
        },
        {
            "content": "Yes, yes. I know what all of you are thinking, another f*** dumb reverse harem. You have your typical female airhead, and boys that like her. First the tsundere, the athletic, bokou, and then the dude that actually has a brain. So let me start the story is about Kai, who was an overweighted girl. She is fujoshi and otaku. She likes collecting BL books, and stores and has a whole collection of them. She goes through when her favorite character dies, she starts not going to school. She also stops eating, for a week. Which means, rapid weight loss. She finally comes to school,and boys go all over her. The tsundere first makes his b*** move, and that's when she falls and meets the tsundere-bokou. \\n\r\nAt the nurse, we meet the dude who has a brain. \\n\\n\r\nOver the few episodes, comedy was all over the place. It was really funny, and then we meet a plot twist. Yuri is added, a girl who is cosplayed is now Kai's senpai. I believe a charming girl, who looks like a charming boy. \\n\\n\r\nOverall, the story was funny and great. Though it was just focused on Kai's addiction to BL, as she starts partnering up the boys together. \\n\\n\r\nSo my overall is eight, I liked it, but I disliked it as well. So a mixture. \\n\r\nSo, my fav character is the tsundere-bokou. He was cute, pretty girly in the theater. \\n\\n\r\nSo, lemme say this, good anime, just what the f*** are with tsunderes?\\n\\n",
            "date": "2018-04-04T11:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 276866,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6215499.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/VioletaOcelio",
                "username": "VioletaOcelio"
            },
            "url": "https://myanimelist.net/reviews.php?id=276866"
        },
        {
            "content": "I was not expecting to fall head over heels in love with this anime! It really captured my heart to the point where I fangirl squealed at multiple moments throughout each of the 12 episodes!\r\nAs with all harem based anime, you crush hard on all the characters chasing after the protagonist; and that's exactly what happened this time around. With each male role making your heart pound at different moments throughout each episode, you can't help but feel for them as they try to understand their own feelings and make moves on Serinuma.\r\nAs for our leading lady, Serinuma is certainly easy to love. The initialintroduction to her being a chubby fujoshi that loses weight after a deep week depression over her favourite yaoi character dying is certainly a unique way to start the show. She is beautiful both big and small and dealing with having attention from both males and females for the first time due to her looks is like watching yourself go through high school puberty all over again!\\n\\n\r\nThe only thing that sucked was that it ended too soon! Understandably it would've been due to the fact that the manga is still being released. So I truly hope to see more of Watashi ga Motete Dousunda. In the meantime, I will certainly be reading the manga!\\n\\n\r\nI wholeheartedly recommend this anime, even if you just want a few giggles. It's so easy to watch without realising the time has passed.\\n\\n\r\n10/10 would totally fangirl again!",
            "date": "2018-03-06T01:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 273165,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6717494.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Riyerwor",
                "username": "Riyerwor"
            },
            "url": "https://myanimelist.net/reviews.php?id=273165"
        }
    ],
    [
        {
            "content": "As far as I know, no one pointed out the fact that I was really stricken with, that's why I decided to write this review.\r\nI believe in succinctness so I'll be brief.\r\nFirst I have to say, that the art was pretty good, and animation was decent. Also the anime had a lot of funny moments.\r\nBUT the whole concept is wrong!\r\nA girl is fat, so boys either ignore her or are mean towards her. Then she suddenly loses weight, and the same boys start to be very interested in her. The whole anime is about them being interested in her, spending time together and so on.But honestly, I wouldn't want to spend time with someone who is nice to me only because I'm attractive.\\n\r\nIn my opinion she should have enough self-esteem to say no to jerks who are only after her looks, and doesn't care about her personality.\\n\\n\r\nMoving forward, given that she didn't say no, and they indeed spend so much time together you'd think there is a room for change. The boys should realize looks aren't everything and like her for who she is.\\n\r\nNot a chance.\\n\r\nAlthough one boy says he realized just that, his actions speak oppositely. They go with her to anime conventions and historical adventures, and hate it all the way. They hate things she is interested in, so you tell me if they like her for her personality.\\n\\n\r\nFor most episodes we get to watch funny moments of a group of friends, only we are constantly remained they aren't really friends. The boys don't like each other. They hang out together only because they don't want to leave one of them  alone with a girl, which is really sad.\\n\\n\r\nTo be fair there are two characters that don't mach this description, as they liked the girl even when she was fat, and they share her interests. But unfortunately that doesn't change anything.\\n\r\n<beginning slight spoiler>\\n\r\nI thought in this anime the girl will come to realize which characters like her for who she is, choose them or one of them, and leave other jerks alone, but that's not what happened.\\n\r\n<spoiler end>\\n\\n\r\nTo sum up, the plot is terrible, but I can't deny I laughed a lot, so if you don't mind the story, you can watch it just for laughs.",
            "date": "2018-02-01T05:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 270300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4978954.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/eliz_jum",
                "username": "eliz_jum"
            },
            "url": "https://myanimelist.net/reviews.php?id=270300"
        },
        {
            "content": "This is the only reverse harem show I've seen and most likely will ever see. So because of that fact I can't compare this to others in the genera but regardless, I wish to give my two cents on the show in question.\r\nThe show \"Kiss Him, Not Me\" is a reverse harem comedy with a very intriguing gimmick. I trust that before reading this you read the show's synopsis. And so as she becomes ungodly beautiful, she in turn attracts lots of guys (and a girl) and despite being surrounded by all these people who are in love with her beauty, only wants them tobe in love with each other, Hence the title. And so her boylove passions collide with a set a pretty boys attempting to woo her and as such, highjinks insue.\\n\r\nSo lets take a paragraph and talk about our fujoshi hero. She is so damb good looking. Somthing about her more appealing to relatable girl audience apperance is really attractive. The lovely purple hair, the earings, the make-up and the outfits are really beautiful. Not only does she look unique but from what I've heard. Her personality is also very different from most reverse harems. From what I've heard most reverse harem protagonist are boring slates to which the veiwer (your generic girl I guess) is to project herself onto. In KHNM our heroin has a waterfall of personality with more to bottle and ship to stores. She has things she likes and enjoys, things she dislikes and people she cares about. Generally we see her show her caring towards the rest of the main cast.The rest of our main cast consists of the four pretty boys and the pretty girl. Because I'm terrible with names I'll be calling each by their archetype. The first one is your strong boy. He's strong and cares much for the main girl. But that's as far as he goes. He looks normal, black short hair and a plain face. Easily the most forgettable. Next is blonde badboy. He's got more going on. He's protective of the one's he cares about. Ignores everyone he doesn't. He has an imouto (little sister) he cares about and does whatever possible to make her happy. And is very straightforward with what he wants. Next is the wimpy yet smart kid. He's well, kinda the wimp character that only wants to be like the strong protective type like the previous two. But in the end is the second most boring character as well as the most annoying character. Next is the weird nice guy that at the start doesn't even want to date the main girl but eventually progresses to like her. He has a longer face and brown hair. He's interesting and fun, is mysterious is some ways and is all round the least shallow and most good natured guy in the cast. And finally, the girl who vies for our protaganist affection as well. She is a rich girl who fills the rolls of a fujoshi friend and a potential love interest to our main girl. She is fun to watch as she gushes about boylove both as an admirer and as someone who creates it through drawing. Personally I think she was best love interest but that's me.These are our characters now what kind of story do they inhabit? Well the story is really a collection of goofy cenarios revolving around our heroin's hobbies such as comiket or traveling to a historic place where an anime took place. Each episode is usually a different situation, with the goal of each love interest scoring points in the form of building affection with the heroin. Some are quite funny while others kinda suck. Without spoilers the anime doesn't give a full resalution to the story. At least not in a satisfying way. \\n\r\nNow as for the music I can't tell you anything. Music probably wasn't that good cuz I can't remember any of it. Meanwhile the op has some funny gags and is very good at showing how good looking the characters are. The ed had a cool slideshow esc thing where the main girl would be in different cute outfits. As the op and ed music. Not memorable. \\n\r\nThe animation was your basic on the budget animation. Nothing astounding or unique. The character designs were very much \"pretty\". Very much exaggerating how beautiful these men and women are. Artyle on the other and was also not very impresive otherwise. But the show is not about the visual spectical. Its about the gags and character interactions.\\n\r\nMy closing thoughts are that this show was surprisingly entertaining despite it's genera and my general taste. Meaning that this might be one of if not the best of it's kind. If your into the reverse harem genera than I highly recomend this. Personally : 6/10",
            "date": "2017-12-18T03:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 265485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5365939.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/fistmake",
                "username": "fistmake"
            },
            "url": "https://myanimelist.net/reviews.php?id=265485"
        },
        {
            "content": "Wow, I really loved this one. I’m still pretty damn new to the world of anime, so watching shows like this and those that are similar are such a new experience for me. As with every single anime that I find and make the decision to watch, I am always very analytical and skiddish about it at first. This one, I am so happy I got to enjoy it. It’s pretty different, and maybe I don’t totally get the way that others view this kind of anime, but to me I saw a bunch of people brought together by one girl. At first, she wasn’tthe prettiest and had her flaws. But it was so amazing to watch her grow because of everyone and to watch everyone accept her and love her for who she is as a person. That to me was the most powerful part of this anime. That, if you discount everything else, was beautiful to watch. I haven’t had friends like this before, so if I did, I’d want them to be exactly like all of the characters in this anime. I’d very highly recommend this to literally anyone of any taste in entertainment and would be so excited to watch another season. What an amazing show.",
            "date": "2017-11-12T02:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 263052,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Witcher151",
                "username": "Witcher151"
            },
            "url": "https://myanimelist.net/reviews.php?id=263052"
        },
        {
            "content": "I'm coming from a place where I find harem anime somewhat frustrating but, from that frustration, rather fun. From the first episode, though, it teased at being something more, but, ultimately, chickened out. I think my favorite part of this anime is thinking about how the premise would have worked out if someone else was handling it.\r\nFirst off, let's get the execution out of the way. The artwork is solid and has a subtle style and flair to it without drawing too much attention to itself. There is, however, a lot of lazy moments where blob white gingerbreads are drawn instead of the characters whichis fine for a gag but I think this one teeters on the edge of \"too much screentime\". But when the characters are drawn, even in gag shapes, it's always expressive and feels thought out to go with what the topic of the scene is. Sound is nothing special, but I switched to the dub a few times and felt it was treated really well by the English cast. \\n\\n\r\nSo why the poor marks? I think it's just cowardly. It was brave enough to show a fat-girl-gets-hot transformation, and brave enough to portray a sensible what-if for the situation, but it wasn't brave enough to really tackle the concept of superficiality which I think could have been central to it. The series does tease a little in this direction but, by the time it's over, we're back to normal and, wow, it's just a joke! Premise! Premise beach! Just some sand, no real rocks.\\n\\n\r\nI mean, I get it, it's supposed to be a lighthearted harem with teenage hijinks so you don't really want to go too deep. But, this story could exist without that whole \"girl suddenly gets hot\" angle. Similarly, Serinuma is only friends with these guys because they're hot, too, so I felt the whole 12 episode run kind of danced around the fact that, sure, everyone's a decent person, but no one would have spent any time getting to know anyone else unless they were attractive.\\n\\n\r\nThere are also a few moments where you can see the glimmer of something challenging in the distance. The question of acting out the subconscious and challenging the notion of consent. The question of confidence and challenging what it means to be a man. The question of loyalty and straddling the line between ambiguous and concrete. Again, Premise beach! Just a lazy sunny afternoon.\\n\\n\r\nIn the end, you wind up with an anime that's only memorable for the premise set up in each episode and not really memorable for how it unfolds. And that's a shame.",
            "date": "2017-09-02T14:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 256754,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/bukkaw",
                "username": "bukkaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=256754"
        },
        {
            "content": "You should probably skip this anime.  After reading the synopsis and watching the first episode i was pretty exited about the premise of this show.  A reverse Harem where the main character isn't an oblivious moron, but rather a pervert who is going to try to redirect her harem's affection towards each other instead of her.\r\nThen... it turns into a typical harem anime.  You get a little fan service here and there with the guys looking cute.. but it is few and far between.  The main character becomes an oblivious moron who has Zero character and just blushes or yells abouther favorite anime  character.  The harem of boys immediately make it clear they like the girl, so there is no tension or build up.\\n\\n\\n\\n",
            "date": "2017-09-01T10:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 256662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/footfoe",
                "username": "footfoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=256662"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\n✦Story\r\nA fat blob perverted overly annoying fujoshi (disgusting otaku stereotype) who fantasizes constantly about BL, imagines BL about her classmates and schoolmate bishounens. Then suddenly otaku shock happens and she becomes bishoujo and suddenly all pretty boys love her. And becomes an otome game character basically. Aside from the whole plot device story was for most part enjoyable.  It was funny, cute at times and disgusting otaku at times. Sadly, not surprised as usual with these types of anime, coupling won't be concluded. So \"read themanga\" part from here. Also this anime offered some cameos and references which was a nice touch. If you want funny fujoshi anime then this is a good series.\\n\\n\r\n✦Art\\n\r\nI liked it, it was pretty and simple. Main girl was quite pretty, bishounens were bishounens. Also lot of expressions/reactions were also quite nicely done.\\n\\n\r\n✦Sound\\n\r\nVoice acting was nice, but main girl overly cute voice can become tiresome at times. Music and OST was okay, nothing too good, nor bad. Was fitting, but with lesser presence.\\n\\n\r\n✦Character\\n\r\nHardcore fujoshi and bunch of pretty boys with different otome game stereotypes. Enough said, enjoyable and fun.\\n\\n\r\n✦Enjoyment/Overall\\n\r\nEven though that fujoshi (otaku stereotype) is quite disgusting and overly cute voice she had became somewhat tedious at times. It was still a fun ride. Enough funny moments, some cute moments. Weak drama and almost no romance development. But anime idea is to be simple fun and funny. In that aspect what it tried to be, was satisfying. So I think it deserves such scoring that I gave.",
            "date": "2017-08-31T06:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 256600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=256600"
        },
        {
            "content": "Watashi ga Motete Dousunda is an anime with an unusual plot, which may bring some fresh air in one's Anime list, however personally I did not enjoy it so much.\r\nAssuming one had already knows the plot of the anime I jump straight forward to the characters:Most of them are just bad. \r\nPersonally I had the most problems with the boys, since we get a pretty nice look how they treated the MC, as two of them treated her as garbage, and the other two was nice to her because they are nice to everybody (well, I could say they were the better case),\r\nand yet whenour miracle happened, somehow these guys were head over toes about MC. This gives the audience a really bad taste about these guys since is clear that they were only into their looks. This a**holish behavior of the boys set the tone for the rest of the show for me and even after the many attempts the show tried give them some redeeming qualities, I personally wished all of them to burn in hell. Later on we met yet one other lover of MC, yet I could't like her either since her annoying personality...\\n\r\nAt least MC had gave me some laughs...\\n\r\nLooking at the animation and sounds, I can only say its good enough to not disturb the flow of the show, but isn't something extraordinary eihter...\\n\r\nOverall, I can only say: Give it a try, but don't get your hopes up...",
            "date": "2017-08-29T06:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 256467,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6343257.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShiraYukiTO",
                "username": "ShiraYukiTO"
            },
            "url": "https://myanimelist.net/reviews.php?id=256467"
        },
        {
            "content": "This morning around 5 am (yes a mosquito was in my room so I couldn't help but to open my eyes and catch that beast haha) I saw a clip of \"When you lose weight\" Basically featuring the first episode of this anime. I was kinda impressed by the originality of that clip and decided to give it a shot, not knowing this is a harem or anything with yaoi elements etc. However I finished this anime within the same day and I will tell you guys why! \r\nSTORY 7/10\r\nBasically the story is pretty much to the point since episode 1. Girl loses weight andgets huge attention from people around her and basically love is in the air. Overall I really liked how some episodes featured one of the harem guys and how they each had a chance to win over the heart of the main character. But overall there was not really a development between the main character and her harem.  But every episode offered something different, which made it really fun to watch! Basically I kept watching because I was wondering which guy she would pick haha, but you will see for yourself!\\n\\n\r\nART 8/10\\n\r\nreally great art! Nothing really to add, just that it doesn't stand out but also isn't bad either. \\n\\n\r\nSOUND 7/10 \\n\r\nGood sound, didn't really pay attention to it. The OP was pretty good and also very upbeat which really suits the anime. I didn't pay attention to the voice acting, but it's good! \\n\\n\r\nCHARACTER 6/10 \\n\r\nThis is probably which made me not give this anime a 8. The awkwardness of the main character as she is overhyped as an otaku became quite annoying at a point. I find that the most irritating about this anime, but you may think different! The harem all had their types: The genius, the clumsy one, sportive one, the one who only likes the girls from looks and the tomboy/bokukko. Honestly their actions were all so predictive, but still I find them all interesting based on their backgrounds. But naah, still not interesting enough for meh \\n\\n\r\nENJOYMENT 7/10 and OVERALL 7/10 \\n\r\nOverall I pretty much enjoyed from the beginning till the end. It's a bit of originality, and as it's my first reverse harem i watched it's good. It's worth a shot and you will definitely be shipping guys in this anime haha!\\n\\n\\n\r\n~This review is dedicated to mosquito, I honestly don't know where you are right now, but thanks to you I got to watch this anime! \\n\\n\\n",
            "date": "2017-08-22T06:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 256014,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4289905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Splimmie",
                "username": "Splimmie"
            },
            "url": "https://myanimelist.net/reviews.php?id=256014"
        },
        {
            "content": "I have seen bad Shoujo, bad ones that don't know how to execute a scene, don't know make characters likeable and memorable, and how to provide entertainment without purposely striping, make sexual tension, and flirting in a awkward way. They are more likely \"strangely enough\" attract peoples attention \"mostly females\" because of how hot their bodies look or their stereotypical personalities are. Strangely, this show is straight and it's weird, but it works.\r\nI had to tip my hat for the creators of this show (most importantly the manga where they got they resources from), I think people in both genders can watch this show, sure,it's meant for women as they say, but that sounds like an excuse for not actively making creative work, instead, being lazy and provide jokes that women can only understand. If you would have a show only meant for boys or girls, then I don't think it would deserve so much credit if it really excuses why the opposite gender couldn't enjoy as much as the actual gender do.\\n\\n\r\nThis review will be over the Plot, The Animation, Sound, Characters, and its Flaws that it had.\\n\\n\r\nPlot: This plot wasn't so much interesting if you were to discuss it on paper, which I am. You have a chubby woman named Kae, and she is an Otaku who is strongly into Yaoi and fantasizing her classmates being couples. Then a tragedy happens, one of her favorite characters, Shion (yes you will have to remember this stupid character), gets killed off of the show, and she gets over dramatic and shuts herself out for about a week, with no food or water. Finally, her family gets her out of her senses, but suddenly, Kae lost a lot of weight, and pretty much looks a model (the anime side, not my side, I only see a drawing on paper). \\n\\n\r\nNow, excusing my plot explanation for a disclaimer, this logic of not eating or drinking anything for a week is obviously for comedic purposes, and it is what got peoples attention, and you can see why it did. This logic obviously doesn't work, but it's more like, \"Eh, it's a cartoon, let it do what it wants.\" Anyway, back to the plot.\\n\\n\r\nBecause she looks hotter than ever, she attracts many sorts of attention, she attracts a male that makes fun of her weight, she attracts a male that tries to forgive himself for his friends sake of making fun of weight, and finally, she attracts a male that seemed awfully rude to her, even when she was injured. Not to mention she has a male friend that talked to her, even before she lost her weight. Now everywhere she goes, she always has 4 male friends with her, including a female that later joins the roster. \\n\\n\r\nObviously, all these characters has feelings for her, except one, because he is an air head that only hung out. I'll describe about these characters later. There isn't much of the plot anymore, other than short sub plots in each episode, they want to date Kae, that's all.\\n\\n\r\nThe Animation: I liked it how they manage to pull peoples attention by turning a fat person into a super model by shutting yourself, but they don't express the animation so much. Sometimes you get bored of a scene, and looked at what the other people are doing because you got bored looking at the main characters, but they don't do anything but freeze where they are and don't do anything. Sometimes they have decent animation I can give credit for, even the ones that are doing the animation for humor, other times it's just lazy. Every time, when Kae has a \"special\" moment to say, it's all glitterly, sparkly, and pink, and it gets old after the 6 time they used it in the first episode, I get that it's suppose to visualize how men see it, but it doesn't excuse why they use it in every 3 minutes whenever she smiles.\\n\\n\r\nThe Sound: This music track does have some good musical background for the atmosphere that catches your ear, but most of it is bland and isn't noticeable. \\n\\n\r\nThe Characters: I think the characters carried on the show quite well, it's the only real reason why I did. Overall, most of these characters did deliver some good humor and dialogue to follow, but only for half of the show.\\n\\n\r\nKae: Kae is a otaku, yaoi fan who loves to fantasizes men as couples. She is very kind to people, is quite shy at times, and doesn't express much of love, but appreciation. This is a good character you could understand and like, especially the humor she delivers, you don't have to be a yaoi to understand, you could just hear what she says and think it's ridiculous, but then realize that some people actually think like that. I liked this character, and I don't think we can have a yaoi fan that can be annoying again for awhile, at least I think that is the case.\\n\\n\r\nYuusuke: This character is bland and boring, you can understand his relationship easily, but he isn't interesting. He is just kind and athletic, he does display a little bit of character trying to steal a chance to be alone with Kae, but that's all you get out of him. He does deliver good dialogue that makes him funny, but it doesn't really display his personality.\\n\\n\r\nNozomu: He is just temperamental and wants to date Kae for looks. Also he is good with kids.\\n\\n\r\nHayato: He is a bit of a coward, childish, clumsy, and he doesn't do anything for the show except one episode. Now those qualities doesn't make him a bad character, however, this show fails to display this character, rather, he is just put in just for his personality and stereotype, I didn't get a laugh out of him which is disappointing, and he doesn't do anything remarkable. Therefore, he is the lamest character out of this roster.\\n\\n\r\nAsmua: He is just an air head, who is also kind, gentle, caring, and a bit weird. He is, however, protective, and gets serious when someone picks on Kae. \\n\\n\r\nShima: A female who is also wants to date Kae, she stands out more than Hayato does. She is rich, well-known from a lot of people (which is hardly mentioned) talented with drawing and creating mangas (about yaoi). Finally, she is a hardcore fan of yaoi. \\n\\n\r\nOther characters: They just play their part.\\n\\n\r\nThe Flaws: While I do credit for its humor and characters, it does a few things wrong, for example, one episode (for japanese) plays the music loud enough that you can barley make what the the characters are saying, sure, in subtitles you can easily know what they are saying by reading it, but think about people that went through that don't read the subtitles and understand the language, that would be a problem. The beginning wasn't the most exciting part because it only focuses on having a crush on Kae, but when you get to episode 3, you will see the charm it gives away, but by episode 8, it loses that charm and goes back being bland. \\n\\n\r\nConclusion: I was just surprised that it was good, it completely changes my opinion about how a show about yaoi could be boring and goes no where, but yet, this show proves that it could be entertaining in the right elements. I think it deserves the credit that is given to us, and hopefully you, the audience, agrees. \\n\\n\r\nI give it a 6/10, if the ending didn't end with a joke that had a serious topic on top of it, then I would give this a 7, oh well, I got some laughs out of the show, and that's what matters.\\n\\n\\n\\n",
            "date": "2017-08-21T11:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 255953,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6190384.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PapaRonny",
                "username": "PapaRonny"
            },
            "url": "https://myanimelist.net/reviews.php?id=255953"
        },
        {
            "content": "This anime was one of the cringiest shows I've ever watched in my entire life. I found myself cringing throughout the entire thing- not even exaggerating.  Reverse harems are a huge guilty pleasure of mine, so I found the show and decided to watch. I wasn't expecting too much out of it as it seemed like your generic shoujo anime with a bunch of cute guys, an average main character, and all that jazz. I thought the concept of it would be interesting, you know, the whole fangirl \"wants the guys that want to be with her to be with each other.\"\r\n ButGod, I wasn't expecting it to be that bad. \\n\\n\r\nSo the main character, she's the worst. The whole fangirl trope in the series was something I could relate to, but the way that the show portrays Serinuma, making her \"fangirling\" so exaggerated to the point that she couldn't even control herself while two men were speaking made the show so unbearable to watch. \\n\\n\r\nNow, I understand that the show is a reverse harem so the base concept for the show is unrealistic in itself, but the fact that five characters followed around this girl just waiting so blatantly in competition to be with her was so impractical it made me feel bad for them. Not to mention that most of the characters that wanted to be with Serinuma were extremely superficial. It rubbed me the wrong way that the idea of the anime for a while was that if you're fat then you are undesirable, but if you're skinny then people will like you. \\n\\n\r\nLet's not forget the fact that throughout the entire series there was little to no character development for any of the characters except (in the slightest way) Asuma.\\n\\n\r\n I get that the show was basically a slice of life, but every single episode was just a recycled plot trope from every single anime you've probably ever seen. Same with the characters. I can name at least three shows that each character was so obviously taken from.\\n\\n\r\nThe humor was OK, the art was good in certain parts,  but I feel like often in order to avoid elaborately animating certain scenes the animators would just put in excessive chibi clips which got old after the second episode.\\n\\n\r\nIn conclusion, this show was worse than your average slice of life reverse harem anime, and if you're expecting a lot out of it, think again.",
            "date": "2017-08-11T21:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 255234,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3769449.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/geoxvir",
                "username": "geoxvir"
            },
            "url": "https://myanimelist.net/reviews.php?id=255234"
        },
        {
            "content": "Well, I’m finally making a review for this. In all honesty, it’s hard to give this a bad rating, as I did really enjoy it. But… er, let’s just jump right into the review.\r\nStory\r\nThe story is actually very clever and comedic. A girl who is absolutely crazy about boy on boy love, turns into a beautiful girl over night because she lost a bunch of weight from the shock of her favorite character dying in an anime. After this, several of the boys at school fall in love with her, and she isn’t sure how to react to them. It becomes a race to thefinish as each of the boys compete against each other to try to steal her heart.\\n\\n\r\nCharacters\\n\r\nSurprisingly, all the boys have their own unique personalities and are all very likable. However the girl character they introduce, Shima, seemed… rather basic to me. While she may have some spectacular moments her character leaves a lot to be desired. If anything she was just annoying because she constantly drags Serinuma away from the boys, the actual interesting characters, and instead have a rather boring scene of her being a flirt or them going crazy over some yaoi couple. In the end her screen time is just wasted and could be replaced with much more interesting scenes. Sure she’s entertaining when she’s with the main cast, but on her own she’s not a very interesting character. Her interactions with the boys are hilarious and intriguing, but when she’s alone with Serinuma it’s basically the same thing over and over again. Shima is a great character for the others to bounce off of, but alone she tends to be generic and not as unpredictable or interesting as the other characters.\\n\\n\r\nThe Ending\\n\r\nSo, now we come to the big issue, the ending. As I said in one of my post, “Endings however are also very important because they sum up a story and either influence the viewer to watch their other works (and a sequel if one exist), or it could possibly influence them to avoid that specific creator or not have a good attitude to the idea of a sequel. I also stated, “Most viewers can see straight through marketing ploys and writer’s trying to over hype a sequel and put it down in an instant. It’s not a good strategy, and I hope writers eventually realize that in this day in age, it doesn’t usually work.” As you may have guessed, the ending was a horrific marketing ploy for the Manga. So, as the story progresses we see Serinuma begin to change her attitude to real life boys and actually begin to form meaning full relationships with the main cast, a lot of them hinting at her seeing them more romantically then she ever did before she changed. We can see this shift in attitude, which is one reason why the ending is even more startling and disappointing. It comes to a point were they all confess and she has to decide which boy. She actually struggles over this a lot, seeming to like them all in their own way. Again making it seem like she has truly changed her idea about boys and relationships. However, in the end, she picks now of them saying her true love is the fantasy character mentioned before and going back to square one. After I made a post about this, I was then informed the manga was ongoing and in it she still hadn’t picked a boy yet. Basically, we both agreed that the ending was a marketing strategy to get viewers to want to read the manga. It’s a shame that writers let endings and just shows in general go down the gutter trying to use it as a change to advertise their other form of the work or over hype a sequel. They’ll leave it at a bad note to make you want to view the other work or the sequel, rather than having the ending wrap up the series in a well written conclusion. It’s sad for me to see writers are pouring their works down the drain from desperate marketing ploys instead of taking the time to make it well written, and well, put all their effort in it to make it a satisfactory work of art.\\n\\n\r\nConclusion\\n\\n\r\nSo to truly sum up what I felt about the ending, here’s a quote from the rant I posted, “ Serinuma seemed to evolve and be ready to take on romance, getting farther away from the fictional world and more into reality. However, in the end she digressed back into her old self and ended up not picking any of them! To be honest, I fell in love with all of the characters and seeing it end like that for them was just frustrating.” And, from my marketing ploy rant, “I’d rather support and continue to follow creators who are aware of how important a good, well developed beginning and end is, rather than one who always tries to use the end of their shows to advertise a planned sequel or other form of the work.”",
            "date": "2017-08-04T00:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 254656,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5663927.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/luluuwindhope",
                "username": "luluuwindhope"
            },
            "url": "https://myanimelist.net/reviews.php?id=254656"
        },
        {
            "content": "I found myself dragging my feet throughout this anime due to its inability to make me laugh. It's a reverse harem anime that is advertised as different because the main character ships the guys together. While this seems hilarious, I felt awkward watching it because it's literally just a basic harem anime with uninteresting characters and dull art. I don't expect much excellent or quirky animation coming from a harem anime, but this one is so static and unmoving I felt bored watching it. \r\nThe characters themselves are weak because no one seems to grow. There's no development, nothing urging me to stay and watchmore episodes. How the characters play off each other is pretty lame as well with repetitive dialogue and animation. I couldn't watch past episode 8, so this review is likely not as reliable as those who've actually completed the anime.",
            "date": "2017-07-15T10:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 252927,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4459704.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Pockers",
                "username": "Pockers"
            },
            "url": "https://myanimelist.net/reviews.php?id=252927"
        },
        {
            "content": "Dear Fellow Otakus and Anime lovers, \r\nThings this anime contains: \r\nReverse Harem\r\nReferences to other anime\r\nHave the elements of any dating simulator.\r\nGirls who fangirl over two boys (who are love interest) \r\nPersonally,  I found this anime quite amusing, the humor had me laughing and held my attention at all time. From the first episode, I was hooked, with some anime I have to wait until few episode in before I actually get into it. From being an otaku myself (yay!) I fangirled over a lot of the boy x boy scenes and anime references. With those elements, I couldn't find any reason why Iwouldn't love this anime. It has all the elements I like in my animes. I know everyone has their own taste in anime, like (my boyfriend likes One Piece more than I do). \\n\r\nBut if you're a girl who likes this type of stuff then I really do recommend this anime to you guys.",
            "date": "2017-04-05T07:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 244697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5825028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/YuiFireDragneel",
                "username": "YuiFireDragneel"
            },
            "url": "https://myanimelist.net/reviews.php?id=244697"
        },
        {
            "content": "A HILARIOUS ANIME WITH INTERESTING PERSPECTIVE\r\nThis anime is ideal for those up to date with the current anime/manga culture, trends, and overall fandom. The main character Kae is a high school girl obsessed with anime. She in particular, is obsessed with the Boy Love genre and shipping male characters together. The entire anime is not only incredibly funny, but represents what the now \"USUAL\" girl watching anime is like.\r\nThe characters developed pretty well for a 12-Episode anime and are more interesting than the main lead Kae, that is me being honest. They grew to be likable. \r\nThe ending stayed true to overall theme of theseries. Although it does not have that nice cliche ending to make you happy, it does have you consider these are the mentality of your anime girls today",
            "date": "2017-02-11T19:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 240381,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3828677.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AllHateHaters",
                "username": "AllHateHaters"
            },
            "url": "https://myanimelist.net/reviews.php?id=240381"
        },
        {
            "content": "Watashi ga Motete Dousunda is a good anime. It has a good story, one I wanted to see completed. However, I was so disappointed at the ending, I'm not gonna spoil it, whoever is reading this review, go watch the ending and then you'll see what I mean.\r\nIn the end, the anime's about Serinuma and how she deals with the world around her, a girl obssessed with anime and BL stuff, she even does it when she gets more friends (and gets extremely thin and beautiful... Can't you that IRL). Kinda makes you think: \"What about her other friend?\" Yeah, I wonder that too.\r\nOverall, it'sa good anime. I recommend it to old anime watchers and to people new to anime.",
            "date": "2017-01-24T18:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 239051,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5767879.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kirimash",
                "username": "Kirimash"
            },
            "url": "https://myanimelist.net/reviews.php?id=239051"
        },
        {
            "content": "Review Text\r\nLet me start off by stating this is not a Boy Love anime. It's about a closet otaku girl that loves BL mangas. So all you peeps out there freaking out because you don't want to see boy on boy action rest assured.\r\nThe beggining of the series is about how shallow we all were back in school days. Lets be honest we all tried our best to get along with the popular guys, or the good looking people. If you managed to find mutual interests and or had good chemistry you'll tag along for the rest of your Junior High or high school period.If there's no compatibility or you just get treated like dirt you move on to a different circle. Having stated it, yes, a couple of the guys didn't treat Kae with proper respect due to her appearance, and that completely changes when she becomes slim and noticeable. The good thing is that once Kae gains weight, all of the guys try to help her get back for her own sake, but also find out that they love kae no matter her appearance. No, the series isn't going to win the best humanitarian message award, it's not so bad is it? afterall it's a very light romance/friendship kind of series.\\n\\n\r\nThe characters are simple and likeable, non of them are complex or entireable relatable, in fact some of them are archtypes of other romance/comedy series. Again, that's not bad at all, since it's a light romance/comedy series.\\n\r\nWe got Kae, the Fujoshi otaku closet girl, who is very shy when it comes to speaking to guys even after she gets her change appareance. Igarashi the though decisive athletic guy. Nanashima or Nana, the hothead. Mutsumi the mild kind hearted guy and Shino the younger nicer guy. And there's also Shima the boyish looking girl who can do pretty much anything. Yep all 5 of them will try to win Kae's hearth by trampling each other. I said earlier that all of the characters were pretty likeable, but I'll have to be honest and say that Misha is just ludicrous as it is, being a rich girl, fashion oriented, straight forward, profesional self published mangaka.\\n\\n\r\nThe art is very faithful to the manga, and that's a good thing. It goes almost by the book to the old shojo manga designs, girls with big bright eyes, long eyelashes, lovely pinkish lips, and slender figure. Although it's kinda odd that Kae managed to get a bigger bust size compared to the rest of the girls in the series, mostly for comic relief on the cliched stumble jokes. The guys are pretty much what girls like, slender and a tad muscular on most of them.\\n\r\nThe backgrounds are pretty plain and single colored, not so bad since most of the plot happens in school grounds.\\n\\n\r\nThe weakest point could be music is almost non existant or at least nothing remarkable.\\n\\n\r\nThe fun factor is probably it's best asset, you'll always want to see Misha and Kae taunting the boys and pulling pictures of them in awkward BL situations wich they don't enjoy at all.\\n\\n\r\nIf you enjoy like light romance/comedy series, no brainer required, this is one you should watch.",
            "date": "2017-01-06T08:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 237592,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5906372.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kimurah",
                "username": "Kimurah"
            },
            "url": "https://myanimelist.net/reviews.php?id=237592"
        },
        {
            "content": "I loved this series mostly because as a fujoshi, the main character is very relatable! I love the concept of this show and the love developments, the only downside is the ending. It's not the best way to end UNLESS a second series is planned (Which I hope there is). I think I may go onto read the manga if not because it leaves you itching for more\r\nOverall, I really enjoyed this series and I very much enjoyed all the references from other anime (If you liked Umaru-chan, you'll like this). If you like yaoi this is the way to go, lots of boy lovescenes as well as the main love interest. \\n\r\nI'd very much recommend this!",
            "date": "2017-01-04T14:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 237425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5375672.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lemongrabmyass",
                "username": "lemongrabmyass"
            },
            "url": "https://myanimelist.net/reviews.php?id=237425"
        },
        {
            "content": "First off I have to state I am a STRAIGHT man. I have no interest in BL.\r\nBut I did enjoy this anime especially the comedy part of it. Serinuma, Kae a girl with two sides, a kind and timid side and her fujoshi side are portrayed really well by Yuu Kobayashi(Voice of Sasha Blouse from Attack on Titan). With 4 generic prince type characters we get a mix of crazy, funny and romantic scenes. Seeing how Serinuma interacts with each of the characters is really interesting and fun, especially when we see the boys \"interact\" with each other as seen in the eyes of Serinuma.Theyalso added a handsome girl into the fray which just made things all the more funnier and awesome. The flow of the anime is also really good giving each guy in the harem an arc of 1-3 episode. Each guy in its own way fell in love with Serinuma even though most of them at first they only liked her looks and body. \\n\\n\r\nThe downside to this anime is the story and some of its characters. Like most anime who have a harem genre some characters don't give a good reason for falling in love with the main character most of the guys in the group fell in love with Serinuma because of her looks although some may have redeemed themselves later on but they don't expand on why and how.\\n\\n\r\nI would have given this anime a higher score if it gave a good reason as to why each character liked or even loved Serinuma and an overall goal to the story. But I cannot deny as to how much I laughed at their gags and other stuff and when the Shoujo parts come in I can't help but giggle like a girl because of how cute Serinuma's reactions are.\\n\\n\r\nOverall if you like Comedy, A bit of BL, or even harem you will like this anime. And you might also fall in love with the main character.",
            "date": "2017-01-01T22:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 237233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5379403.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MeteorEvox",
                "username": "MeteorEvox"
            },
            "url": "https://myanimelist.net/reviews.php?id=237233"
        },
        {
            "content": "Kiss Him Not Me in a word: MaiLife!\r\nOMG, this girl right here is basically me only with Shoujo anime! Any hardcore Otaku or Weeb will strongly relate to the main girl (Kae). I loved her from the first episode. \r\nKae is a girl consumed with a love of manga, anime, and visual novels where hot guys fall in love with each other. As a result, she likes to fantasize about the hot boys at school getting into lovey dovey situations. Also she is fat, so the hot boys don't pay attention to her, which she is perfectly fine with. But one day (slight spoiler, Iguess??? not giving away anything major) she is at home watching her favorite anime when suddenly something tragic happens to her favorite anime boy! Now this anime boy was totally her waifu btw. She has all the collectible stuff and cardboard cut outs for this character. So naturally, she is devastated when calamity befalls upon him. She locks herself in her room and refuses to eat, sleep, or go to school for a whole week. Finally her mother forces her to get out of bed and to everyone's surprise, she has lost all the excess weight and looks soups Kawaii! Now all the hot boys at school notice her and try to woo her, but she much rather watch them fall in love with each other! Thus comedy ensues!\\n\\n\r\nI highly recommend it! I think Kae will rise to become a mascot for all Otakus!\\n\\n\\n\\n",
            "date": "2017-01-09T19:53:00+00:00",
            "helpful_count": 0,
            "mal_id": 237908,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4884977.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VegetaOver9000",
                "username": "VegetaOver9000"
            },
            "url": "https://myanimelist.net/reviews.php?id=237908"
        },
        {
            "content": "Okay, I want to start out by saying I really enjoyed this anime! It had me laughing the whole time, despite what other comments said because I laughed up until the very last episode. The reason I didn't give this anime a better score, because the whole time it was a 10 for me, was due to the final episode. I'll try not to spoil anything but that last episode was so disappointing that I could not give this anime a 10, otherwise I would have. The story is very cute and funny, again I was laughing pretty much from start to finish. However, therewere a few episodes that seemed a little out there, meaning they felt out of placed. Nevertheless, even though the plot (how things happen) was a little jumpy at times, it still made a cohesive story (as to what happens). The art was beautiful and I liked how adorable and quirky it was. Even the character designs were top notch, and I truly appreciated the little things throughout the anime and its design. Sound wasn't anything to memorable but it was good. The characters were great, I liked a few more than others, but they were all enjoyable in their own way. The main character was hilarious, though a little over the top at some moments where she kind of annoyed me, especially in the last episode!! -_- Again, I won't spoil it but I really just wanted to chuck my laptop across the room after that fiasco. Still, she was pleasant throughout the series. I found all the characters enjoyable, funny and likable.\\n\\n\r\nOverall, I really enjoyed this anime and it would have been one of my favorites if not for the brutal ending. I would still recommend anyone to watch this anime because it was hilarious, delightful and adorable. I would say give it a try and keep an open mind from the start because it isn't as bad as some people are declaring it to be.",
            "date": "2017-01-09T09:25:00+00:00",
            "helpful_count": 0,
            "mal_id": 237868,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4756188.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Retrem",
                "username": "Retrem"
            },
            "url": "https://myanimelist.net/reviews.php?id=237868"
        }
    ]
]