[
    [
        {
            "content": "Let me explain something to you guys, before I get on with this actual review.\r\nIs Grisaia no Rakuen (also known as The Eden of Grisaia) an anime that is necessarily an \"amazing\" one, at least to the eyes of most critical anime fans? And what I mean by that is this; does Grisaia no Rakuen have everything needed for a series to be amazing in the eyes of most anime fans, and use those things well? Things like; serious/deep/though provoking themes, elements of suspense used correctly without deus ex machina, a fluid and linear story, psychological/dark plot lines, well-characterized and developed characters, all bundled togetherwith stellar animation and an ass-kicking soundtrack?\\n\\n\r\nIn some aspects, yes, Grisaia no Rakuen has those things. In others... well...\\n\\n\r\nOne thing I feel I should mention before going on with my review of this absolute treat is that, you shouldn't go into Grisaia no Rakuen expecting those things. Does that mean I'm directly implying that this series is nothing more than mindless fun, and can't be enjoyed as something deeper than that? No, not at all. But I think that Grisaia no Rakuen has a meaning to it that's different from the typical \"norm\" of what makes an anime so amazing. The absolute greatness behind Grisaia no Rakuen is, in a very small way, similar to that of Masaaki Yuasa's masterpiece The Tatami Galaxy. It, in no way, follows the norm of what people consider to make anime as great as it is, yet is still something many people consider to be one of the best anime of all time, if not the very best. Grisaia no Rakuen is similar to it in that regard.\\n\\n\r\nSo what I'm saying is, Grisaia no Rakuen should be thought of as mindless fun, because in a way, that's all it really is... yet, it's enjoyable at a level FAR above your typical mindless fun series. Hell, I'd say it's far above ANY mindless fun series, no matter how good it is/how good people consider it to be.\\n\\n\r\nSo today, I'm reviewing the recently-finished 2015 visual novel adaptation by Studio 8bit, sequel of the highly acclaimed visual novel Grisaia no Kajitsu, is the anime adaptation for Grisaia no Rakuen. Let's begin.\\n\\n\\n\r\nSmall thing to note before we continue:\\n\r\nDo understand that Grisaia no Rakuen is the final installment to the Grisaia anime series. The first 2 are Grisaia no Kajitsu, the main series, and Grisaia no Meikyuu, an hour-long prequel special. If you are here looking for a new series to start, please visit the page for the anime [Grisaia no Kajitsu] which is where this series is meant to be started.\\n\\n\r\nIf you're still here, then you probably understand that this is meant to be a review of Grisaia no Rakuen, the sequel to Grisaia no Kajitsu/Meikyuu. With that being said, in my head, there's only 2 reasons why anyone would want to read a review for a sequel series like this one:\\n\r\n1. You've seen the first season, and want to know if it's worth it to watch the next, or...\\n\r\n2. You've seen the whole thing, and want to see what someone else thought about it, purely out of curiosity or because you want to compare your opinions to someone else, or something along those lines.\\n\\n\r\nWhichever you fall under, it proves you've seen the first season... and given that, there WILL be some spoilers (though minor, spoilers nonetheless) to both Grisaia no Kajitsu and Grisaia no Meikyuu within this review. So, I'd advise you do not read any further if you haven't seen the first season/hour long special and don't want to be spoiled.\\n\\n\r\nWith that aside, let's begin the actual review.\\n\\n\\n\\n\r\nInitial Thoughts (prior to watching):\\n\\n\r\nGoing into Grisaia no Rakuen, I was actually quite hyped, and not for the reasons you'd expect.\\n\\n\r\nAfter finishing Grisaia no Kajitsu, which I happened to finish about a week after it finished airing, I was left with an EXTREMELY bitter tasted in my mouth... though, I still had hope for the future, but I'll talk about that later.\\n\\n\r\nThe reason for my bitter taste was simply because of how terrible an adaptation Kajitsu was. While I firmly believe that comparing an anime too much to its source material is stupid (because if you want the source material, go read the source material, don't give the anime slack for not being an exact copy of it), I usually only say that as an attempt to justify a series that goes the route of being an anime-original adaptation and not specifically an adaptation of any source material. My logic behind liking those things is because it gives is a new take on a story, and basically gives us two different versions of it... since, well, more is always better.\\n\\n\r\nHowever, my original claim of \"comparing an anime too much to its source material is stupid\" is completely null and void when the reason for making those comparisons is due to the series being extremely rushed. Basically, when a series tries to be an animated copy of its source material, but fails to do so because way too much was left out.\\n\\n\r\nAs a visual novel reader of the entire Grisaia series, I'm able to say that that's EXACTLY how it was with Grisaia no Kajitsu. A visual novel that took me about 85 hours to complete, crammed into a 13-episode anime adaptation barely even 5 hours long. And my god, when people tell you that a lot was cut out, don't think they're just complaining and not believe them because that's EXACTLY how it was; so much was cut out, and it was almost impossible to enjoy.\\n\\n\r\nThough, I can understand why people do, and I tried to take into consideration how people who haven't read its visual novel felt about the series when scoring it. Thus, I gave it a 4/10; enough to mainly think negatively about it, and enough to be vocal about my problems with it, but not bad enough to curse at it or truly call it bad.\\n\\n\r\nThen came Grisaia no Meikyuu which, honestly, can be said to be pretty dang rushed as well. While not NEARLY as rushed as Grisaia no Kajitsu, a 15-20 hour visual novel being crammed into an hour long special (about 48 minutes in total) can be considered quite rushed as well, as typical GOOD visual novel adaptations tend to be about 1/4 as long as the original source material. However, I still think Meikyuu was given an amazing adaptation for the plain and simple fact of what it \"truly\" was as a visual novel: something MANY people considered to be, primarily, a fan disc. Meaning, fanservice was the prominent thing here, and the story was only a small part of it. Almost every important aspect of the Grisaia no Meikyuu visual novel was included within these 48 minutes, and to be quite honest, I don't think I'd ever ask for better, even if I was given the chance.\\n\\n\r\nThough, it's a given that I didn't think Meikyuu was the most amazing thing ever, but I won't deny that it was done in, most likely, the most amazing WAY ever. Which is why I gave it an 8/10.\\n\\n\r\nRemember how I said earlier that I still had hope for the future of this series? The main reason I felt this way was due to the confirming of sequels at the end of episode 13 of Grisaia no Kajitsu. While I didn't know what was in store for the future, I assumed another TV series would be on the way, and that's why I thought good things for the future. I though, \"unless they plan to make a 3 episode anime adaptation, there's no way they can screw this up.\"\\n\\n\r\nWell, here's the thing. Despite it being EXTREMELY rushed and barely enough to understand even part of what's really happening, the things that WERE animated in Grisaia no Kajitsu were actually done quite well. So, the way I thought about it was that IF it were given a good adaptation, and wasn't rushed very badly, it would be an amazing anime. So, all we needed was an episode count that made it hard to be rushed, and Grisaia no Rakuen could almost be confirmed to end up being a really good anime.\\n\\n\r\nOnce the episode count was announced, the things I said were pretty much confirmed in my head, as I thought there was no way Grisaia no Rakuen could be screwed up... and I was predicting it to be one of my favorite anime series' by the end had that been true. And look who was right.\\n\\n\\n\r\nAnd now, let's begin the actual review!\\n\\n\\n\\n\r\nStory:\\n\\n\r\nGrisaia no Rakuen starts off as a continuation of Grisaia no Meikyuu. We continue on with Yuuji's backstory, visiting his life after his childhood, after being taken in by Asako. With Yuuji's life being as terrible as it has been up until this time, Asako was prepared with the challenge of healing Yuuji's wounds and helping him to live an enjoyable life (flashback to the beginning of Kajitsu, where Yuuji claims he wants to join Mihama Academy so he can live a \"normal life.\")\\n\\n\r\nThis piece of the Grisaia story is one of extreme importance, maybe even the most important in the entire series. While it can easily be noted that Yuuji acts much different within custody of Asako than he does within the story of Kajitsu, you are easily able to tell how each thing that happens to him plays a part in the way he acts as a character within Kajitsu, as it takes place after the events of Meikyuu. And let me just tell you this, Yuuji is an extremely well-written character... though, I'll save that for when it needs to be talked about.\\n\\n\r\nYuuji within Kajitsu seemed a lot like a mystery. We wondered what exactly happened to him to cause him to act the ways he does; and we were given answers. Many answers. Many of the answers brought up questions we didn't even have, which were promptly answered not long after. Yes, everything was made clear, and what we were given from the story of the first 4 episodes of Grisaia no Rakuen was absolute perfection in what we needed to know. And, really, that's all there is to say about it. It was simply amazing.\\n\\n\r\nAnd then, we get to the sequel... episodes 5-10.\\n\\n\r\nGiven what I said prior about Grisaia no Rakuen and the entire aspect of \"mindless fun,\" it's a bit of a given that the story aspect of the series won't necessarily be the most prevalent throughout it. And, for the most part, that's true.\\n\\n\r\nWhat is most prevalent, however, is something that can be considered even BETTER than just a simple story.\\n\\n\r\nWhile elements of storytelling remain throughout everything that happens, and not a SINGLE thing happens without playing a part to the main story line (no matter how big or small), what we take from most of what happens is everything but a super developed story. And honestly, that's perfectly fine. No complaints here.\\n\\n\r\nWe're given information of a certain enemy appearing at a certain place at a certain time, and that he needs to be taken out. Simple enough, right? Sounds pretty common for a series like this. So what we're given to do just that, is a 15 year old loli girl being given a pink sniper rifle that's just as tall as her.\\n\\n\r\nDid you just drop gas bombs onto the streets of an urban city? Are alive enemies that need to be taken down lurking through the gas? Just give a pink-haired maid a gas mask and two knives. I mean c'mon, it's first grade, isn't it?!\\n\\n\r\nJust in-case it hasn't been made obvious, Grisaia no Rakuen is extremely larger-than-life, absurd, and just plain nonsensical (at least the sequel portion of episodes 5-10). Like really, almost nothing makes real sense... but at the same time, it does.\\n\\n\r\nNow, what do I mean by that? Think about it this way: bad things happen, and things need to be done ASAP to fix them/prevent them from being worse. Those things are the solutions. What's absurd isn't necessarily the situations, or the things happening, or any other thing that plays towards the aspect of battle. What's absurd is the solutions.\\n\\n\r\nThese solutions are things like detecting an enemy riding up the side of a mountain. Instead of just trying to block him off on the mountain, why not just fly a chopper with machine-gun-turret equipped over the mountain and shoot straight at the mountain with it? Do you see what I mean by absurd and nonsensical?\\n\\n\r\nAnd yet, they just seem to work so well. While I'm not going to say this style of writing is the most perfect thing ever, it's kind of the optimal way to do things with a series like this. After all the crazy, borderline-supernatural things that have happened, something like this seems to just be called-for... none of it really feels out of place.\\n\\n\r\nNow, does \"it works for the series and doesn't feel out of place\" make a good reason for giving the story aspect of this series a 9/10? No, not at all. That only has to do with a small part of what makes a story good. The rest has to do with the extreme awesomeness that exists within this series.\\n\\n\r\nThe brilliantly well-thought-out psychological scenes, the erection-throbbing action, and the absolutely emotional scenes of attachment are what make Grisaia no Rakuen as amazing as it is. These things aren't really meant to be described here in the story portion of this review, but I'll go over them briefly.\\n\\n\r\n1. Amazing antagonist introduced.\\n\r\n2. Incredible plot twists (this could be explained, but impossible to do so without spoiling).\\n\r\n3. Well-written characters EVERYWHERE.\\n\r\n4. Everything just feels so amazing. Hard to get a feeling like this from anywhere else.\\n\r\n5. All looks and sounds amazing.\\n\\n\\n\\n\r\nCharacter:\\n\\n\r\nNow, let's start to explain the things that make Grisaia no Rakuen as amazing as it is.\\n\\n\r\nIf you were like me, you didn't specifically like the characters of any girl that was part of Yuuji's harem in Grisaia no Kajitsu... you only really liked their stories or what we learned from them.\\n\\n\r\nThis was, almost completely, fixed in Grisaia no Rakuen.\\n\\n\r\nWhat were originally really annoying and slightly one-dimensional \"SUPAH CUTE!!\" harem girls in Kajitsu, turned a total 180 and turned into pretty dang good characters in Rakuen. While I won't say that any of their personalities changed, it was more the lack of extreme attention put onto them and the WAYS their personalities were used that made them as amazing as they were.\\n\\n\r\nYou see, I didn't necessarily think any girl was THAT bad in Kajitsu. What I thought made them as annoying as they were was the plain and simple fact that they were given too much attention, and used in ways that made people think that they were meant to be seen as the most important people ever. When it's proven that that isn't the way they're meant to be seen in Rakuen, they almost instantly become great characters that are extremely hard not to like in some way.\\n\\n\r\nWhat if I were to tell you, these characters are a lot different than you most likely thought they were after watching Kajitsu? If that got your attention at all, you'll definitely enjoy watching Grisaia no Rakuen.\\n\\n\r\nThough, that isn't to say why I gave the characters of Grisia no Rakuen the score I did. It wasn't quite that simple, nor that effective.\\n\\n\r\nGrisaia no Meikyuu introduced Asako, and she became such a great character within Rakuen once we learned who she really was. She was one addition that I truly thought was perfect, and the emotional value we, as viewers, placed on her after the short time we saw here was just great, and I have to hand it to the writers for being able to do something like that. Honestly, Asako may have been my favorite side character from the entire series if it weren't for one other character in specific.\\n\\n\r\nThere was only really one other \"introduction\" of a new character in this series, and not really one I'd really call much of a true introduction (hence the quotes). Despite that character being, without a doubt, my favorite character in the entire series (and even my 2nd favorite character of ALL TIME), they're a character that I can't talk about at all without giving spoilers. So, please remember the name \"Thanatos,\" and enjoy watching the series.\\n\\n\r\nDespite liking that certain character I mentioned above more than him, Yuuji Kazami was without a doubt the most developed character in this series. It can be said, without difficulty, that he's the most well-written harem protagonist of all time.\\n\\n\r\nSpeaking of harem, the entire Grisaia series is a very interesting take on the aspect of harems. While it can be said, without a single doubt, that he Grisaia series fulfills everything that's required to be a harem, it has a very interesting take on it. The girls are constantly in battle over who will win over Yuuji, but it's not the focal point of the series, and many other things are paid more attention to than that. Just wanted to mention that, to anyone who might be turned off by the fact that it's tagged as a harem.\\n\\n\r\nWell, really, nothing else can be said about the characters. Development is off the charts for Yuuji, and a specific side character is heart-stoppingly amazing, with the rest of the harem being great as well. I give this a 10 for being perfect in every regard that I could ever ask for.\\n\\n\\n\\n\r\nAnimation and Sound:\\n\\n\r\nThis won't take a while, since there isn't really a lot to say.\\n\\n\r\nWhile it was still animated really well, Grisaia no Kajitsu didn't have a lot to animate due to the fact that nothing really required an extremely high budget. For the most part, Kajitsu was a pretty still series that just looked well-done for what it was.\\n\\n\r\nThat wasn't necessarily the truth for Rakuen, however. Rakuen was flooded with different action scenes, and a lot of \"gotta go fast!\" scenes that required detailed animation (commonly referred to as \"sakuga\"). And yet, the animation received NO sudden decline in quality... it remained amazing for the entire duration of the series, and man, did it look good.\\n\\n\r\nThe action scenes were absolutely flawless. The sakuga was a little overused at times, but still looked amazing each time. The battles were so intense, and the incredible artwork just made it so much more engaging. And, like with Kajitsu, the still scenes also looked amazing. There was absolutely no decline in quality at any moment within the series, which was incredibly surprising. Completely deserving of a 10.\\n\\n\r\nThe soundtrack was also quite great as well. Usually, I don't place much of a high value in an anime's soundtrack, since it's not something that I really think about beyond watching the series. And usually, soundtracks are done well enough to get by anyways, so there's not a whole lot that's needed to be thought about deeply.\\n\\n\r\nIn short, the soundtrack of Grisaia no Rakuen does its job without being completely outstanding. It's deserving of a 9 just because of that, since a bad soundtrack doesn't really exist in modern anime and thus soundtracks kinda \"should\" be overrated.\\n\\n\\n\\n\r\nOverview and Final Thoughts:\\n\\n\r\nGrisaia no Rakuen is a treat. That's all I really need to say.\\n\\n\r\nWhat can come off as a huge load of absurd crap ends up being one of the most fulfilling experiences ever, and it's just SO amazing. What you'll get out of Grisaia no Rakuen is a nearly unmatched experience of absolute blood-pumping action alongside emotional sub plots and incredible character writing. It's just simply an amazing series.\\n\\n\r\nWhile I don't find it to be the most perfect thing ever, it actually is in some regards. Some things about this series are just simply unmatched, and the most perfect example of that thing that's ever been seen in anime thus far.\\n\\n\r\nWhile there are times where the quality of the writing seems to dip, and ends up being a little too dumb, the overall product of this amazing series is exactly as I just said, amazing.\\n\\n\r\nStory: Given that I try to combine the aspects of the above-average story with the amazing absurd fun, I give the story a 9.\\n\r\nCharacter: Pure amazing development, writing, and the changes some characters were given was just perfect. Definitely a 10.\\n\r\nArt: Perfect. Nothing more needs to be said. Easy 10.\\n\r\nSound: I overrate soundtracks because not a lot comes from them. Grisaia no Rakuen's does its job and thus deserves a 9.\\n\r\nOverall score for Grisaia no Rakuen: 9.5/10, rounded up to a 10 for this review.\\n\\n\r\nWho would I recommend this series to: Anyone who's seen Grisaia no Kajitsu. If that was your intent of coming to this review, the answer is yes, Grisaia no Rakuen IS DEFINITELY WORTH WATCHING!\\n\r\nOtherwise, given that Grisaia no Kajitsu wasn't very good, it's really hard to recommend the entire series to someone. But, if you understand, even for a second, my burning passion for Rakuen, then that should be enough to persuade you to watch the entire series, starting from Kajitsu.\\n\\n\r\nRakuen is a treat, and should be experienced by most people, if not everyone, just because of that.\\n\\n\\n\\n\r\nThank you for reading my review! I hope you guys enjoyed it!! See ya next time!!!\\n\\n\r\n<3\\n\\n\r\n- Alne",
            "date": "2015-06-21T13:53:00+00:00",
            "helpful_count": 243,
            "mal_id": 190846,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4193331.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Prince_Altoid",
                "username": "Prince_Altoid"
            },
            "url": "https://myanimelist.net/reviews.php?id=190846"
        },
        {
            "content": "“Rushed”. “Butchered”. “Unintentional comedy”. “Inevitably lacking development”. “Extremely poor adaption”. Even as an anime-only watcher of this franchise, I could not disagree with the heavy bombardment of VN readers’ harsh criticism and saltiness as Grisaia no Kajitsu emerged as yet another victim in the modern anime industry of being a one cour anime, instead of two. Despite the redemption given by Angelic Howl and personally enjoying Kajitsu a lot myself overall, the fact remains the first half of Grisaia no Kajitsu has deterred the anime-only watchers by portraying itself as a mediocre harem , and to put it mildly, not meeting the bare minimum standardVN readers expected from the adaption for being a poorly paced anime.\\n\\n\r\nFast forward to 2015, 8bit has further damaged its reputation (did it even have any in the first place?) by producing, in my opinion, a complete garbage of an anime called Absolute Duo (please forgive me for steering off the topic, but I did not like that season very much) and in a season with highly anticipated giant titles such as Yahari Zoku, UBW, Shokugeki no Soma, Gintama, and Danmachi added with the number of discouraged droppers from the earlier episodes, the prospect of the Grisaia sequels, Meikyuu and Rakuen, has been overshadowed and dwarfed out. However, in spite of the strong competition offered by Spring 2015 season, many people will find it pleasant to know that this time it is not prone to a rushed and butchered adaption with amazingly confusing plot with lack of development as Grisaia no Rakuen has rose up to be a lucky find and possibly one of the strongest anime of the season.\\n\\n\r\nGrisaia no Rakuen is a direct continuation to Grisaia no Meikyuu, a short movie OVA depicting Yuuji’s past, where “tragic and traumatic” to describe it would be the understatement of the decade. Therefore I cannot stress enough to say not only watch that before this, but also in case there are people who are tempted and considering to skip Kajitsu due to its score difference, it is unquestionably compulsory to watch it for the understanding of this sequel (or just read the VN, as the readers would say). \\n\\n\r\nAnd by direct continuation, I do mean straight away from Meikyuu as if that was the prologue to the first episode as the girls of the Mihama Academy continue to learn more about Yuuji’s past through a document. Yuuji’s frightening past continues as his story transitions from being raised as a child assassin, to being raised by his mentor who he respects very highly. This arc known as “Cocoon of Caprice” further continues to portray Yuuji’s life in a military academy as he creates bonds and overcome his own psychological weakness which will be explained more in the later paragraph. The second arc known as “The Seed of Blanc Aile” returns to the present time which is where the meat of the anime is, with the spotlight returning to the original cast of the Mihama Academy and ultimately, the matter between Yuuji and his past is settled so that he can return to his academy or rather, his family. \\n\\n\r\nThis is where the most major difference between Kajitsu and Rakuen comes up. In first half of Kajitsu each girls are only given two episodes to develop with Yuuji helping them ultimately out of distress, which not only lacks the sufficient amount of character interaction and development required due to its poor pacing, but also quickly becomes formulaic, repetitive, and dull. However in Rakuen, the story progresses linearly as a single route in a solid manner while seeming like a natural, realistic story and thanks to much lower amount of content to cram into small number of episodes, the story is immune from the confusion and it is made much easier to understand.\\n\r\nWhat I and probably many other people also loved about Grisaia no Rakuen was how it diverges from a harem setting in a school environment with subtle amount of darkness enough to disguise, which dissuaded many people to drop Kajitsu early on - to a breathtaking, eye-catching thriller from a military setting Yuuji experienced in and where the girls of the Mihama academy becomes involved in intelligence and reconnaissance and putting their specialization to use. \\n\\n\r\nApart from plot, Grisaia no Rakuen also shined very strongly in the department of character development especially in the first half of the anime. Yuuji’s backstory and emotional development as mentioned earlier has been crucial in this anime as unlike Kajitsu which portrays him as a flawless, robotic human being who somehow specializes in rescuing a damsel in distress every two episodes. In Rakuen however, despite his background as a raised cold-blooded killing machine, Yuuji can be shown to empathize through his representation of his trauma and how he overcomes it and also through his interaction with rest of the cast, especially Asako. His psychological weakness of being traumatized of killing any life form has been a key plot point to this season. And of course, who cannot love his witty, sarcastic sense of humour while putting on his iconic poker face? I also want to add he is probably one of the few harem leads out there who is not just bearable, but so likeable.\\n\\n\r\nSpeaking of Asako, her role as Yuuji’s mentor has been crucial to the character development and process of maturity on Yuuji and through his interaction with her and her assertive, confident approach to her philosophy, it is obvious why Yuuji has deep respect for her not only as a soldier and an instructor, but possibly also as an older sister model. His relationship with JB is further explored as well, as she is not merely his superior at work who constantly amusingly irritate and tease at each other, but she is also there to emotionally comfort and support Yuuji whenever she is needed.\\n\\n\r\nWith the military academy setting mentioned earlier, there has also been very nice addition to the mixture who have provided enjoyable interactions with Yuuji illustrating the bond he has made during his gaining of military experience, while they also become necessary and relevant in the later episodes. Although there have been several new likeable introductions, the most notable ones are Miliela Stanfield, who becomes slowly attached to Yuuji as a comrade, nicknaming him “Genie”, and Robbie aka James Okada, his weeaboo characteristic and imouto fetish being the running joke. \\n\\n\r\nDespite the girls of Mihama Academy not receiving as much development as Yuuji and his peers did as unfortunately that was Kajitsu’s job which it unfortunately failed at, they have also been given a spotlight to stand on as well as “The Seed of Blanc Aile”, or where the “real fun” starts to return to the present time. Though too much details would end up as a spoiler, from Makina being an awesome loli sniper, to Sachi being Crappy Maid, to Yumiko being the rational and logical strategist, to Michiru being… Michiru (^_^), this season yet again reminded me how the diverse, yet abnormal personalities of the girls and their wacky, comical interaction have been pivotal to the entertainment level of this franchise.\\n\\n\r\nAlthough the production value is probably not the best you will ever see, there are some aspects to praise. Though background and animation is pretty much the standard you would see in any other anime, the contrast of brightness and dark, bold linings on characters and the details on their faces in general captures the tone of the series well while representing as an unorthodox harem that would not be seen very often.\\n\\n\r\nI have also found the opening and endings very enjoyable as the catchy electronic rhythm of the opening and first ending are complimented well with the panning of the important characters and settings, which I found it as amazingly enjoyable set of animation and direction. First ending especially represents Yuuji’s past very well and how Yuuji still has a conflict unresolved from the past, with the characters important to him appearing in it. Musically, I like the second ending more as it foreshadows the epilogue of the Grisaia franchise, which may represent Yuuji’s will to return safely to his “Eden”, where his family waits for him. \\n\\n\r\nI may be underappreciating the soundtrack and even though I did not find them VERY noticeable, there have been noteworthy usage of violin and piano during dramatic and emotional scenes, and in many dialogue scenes in general which I find it to be very powerful and complimenting well with the scenes, while in the later episodes during dark and mysterious scenes there have been an ominous tones and using electronic guitar very well during climax and action scenes to emphasize on its upbeat and dynamic tone. And of course, Grisaia no Rakuen would not have been nowhere near enjoyable without the appropriate voice acting for each distinct personality and proper use of sound effect in the action scenes.\\n\\n\r\nAs for personal enjoyment, to put it into context:\\n\\n\r\n-Grisaia no Kajitsu was my third WEAKEST anime of Fall 2014 after Sora no Method and Trinity Seven (to be fair that was an extremely strong season as well)\\n\\n\r\n-Grisaia no Rakuen was my third FAVOURITE of the season after Yahari Zoku and UBW and equal to Shokugeki no Soma. It was as if it is a complete different anime from the first season\\n\\n\r\n-I would put the eighth episode as one of the best episode of the season, on par with Danmachi 08, Hibike! Euphonium 08, and few of the Yahari Zoku episodes\\n\\n\r\nAlthough this quickly became a comparative piece between first and second season, through this review I hope I have illustrated its vast difference with the first season very clearly and why it is definitely more enjoyable. As an anime-only viewer, even though I had the confidence Grisaia sequels to be better paced and plot to be more interesting than Kajitsu due to the short teaser at the end of Kajitsu, I have been blown away by the amount of enjoyment and thrill I have perceived from this series and it really makes me glad I did not drop Kajitsu halfway through when my opinion of it was at its lowest. \\n\\n\r\nTherefore I plead and implore not just the VN readers disappointed, discouraged, dissuaded by the unacceptably handled adaption, but also the anime-only viewers who initially dismissed as a mediocre, clichéd harem in a school setting disguised as a dark psychological anime to reconsider picking up Grisaia no Kajitsu (or pick up directly from Meikyuu or Angelic Howl to the VN readers), as this hidden gem is too great to be forgotten and thrown back into obscurity. The miniscule amount of people anticipating and giving attention before it aired was disheartening to see, and in fact it still is not the most watched either as, at the time of writing this review, it is out of Top 1000 in the popularity rankings.\\n\\n\r\nFrom a harem in an eccentric and unusual setting, to amazing character development and likeable cast, to perfect pacing, to overwhelmingly over-the-top action, every second of the anime surprisingly impressed me with the entertainment level it has offered me and I don’t know why it would not be the same to other anime-only viewers.\\n",
            "date": "2015-06-21T20:42:00+00:00",
            "helpful_count": 93,
            "mal_id": 190886,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441915.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/peacefulkorean",
                "username": "peacefulkorean"
            },
            "url": "https://myanimelist.net/reviews.php?id=190886"
        },
        {
            "content": "Grisaia no Rakuen can basically be summarized like this:\r\nDoes it make any sense? Not really.\r\nDoes it matter? No, because you're having way too much fun watching it to really give a damn.\r\nAlthough the anime version of Grisaia no Kajitsu remains one of the worst adaptations I've ever seen in my life, Rakuen on the other hand is one of the very best ones. The difference in level of faithfulness to their respective visual novels is so unbelievably big that I don't even know how to put it into words. The pacing is solid, the production value is great and very little noteworthy content is leftout. Overall, it's a brilliant adaptation from start to finish.\\n\\n\r\nThe anime can be divided into two parts. Episodes 0-4 (yes, zero; don't miss the double-length special episode, it's mandatory) cover the Grisaia no Meikyuu visual novel and takes place almost entirely as a prequel story about Yuuji's past. It is a quite dark and depressive tale containing physical abuse, rape and death among other things. It is one of the most serious parts of the Grisaia trilogy, and it gives you an excellent insight into Yuuji as a character. You'll realize that he is quite likely the most in-depth harem protagonist ever written when all is said and done.\\n\\n\r\nAfter that, episodes 5-10 instead cover the Grisaia no Rakuen visual novel, which in contrast to the rest of the series is one of the most exaggerated, absurd and just plain ridiculous stories that I've ever had the pleasure of reading, but it's also those same exact reasons that make it so incredibly entertaining. It is effectively the inverse of Kajitsu, as the original story is about Yuuji having to save all the girls, whereas Rakuen is about the girls having to save him in return. Now that may just sound like more of the same, but I kid you not when I say that Rakuen is *completely* different. It's essentially a different genre altogether. Rakuen almost feels like a Hollywood action film, containing logic-defying car jumps, helicopter chases, submarines and pink .50 caliber sniper rifles, as well as some highly questionable sci-fi elements such as human-computer integration and cloning technology. If Mission: Impossible was an anime, this would be it. All-in-all it's an absolute nutcase of a storyline, but it's so much fun that despite its absurdity everything just ends up feeling awesome to watch. There are countless points throughout the anime where you'll find the flow of events being blatantly illogical, but it won't make you feel annoyed. Instead it'll just make you laugh and/or feel excited for what curveball the anime is going to throw at you next. Another boon with this is that the nonsensical story turns out incredibly unpredictable since literally *anything* can happen in it, no matter how unlikely it may be. And as the cherry on top, Rakuen also has one of the most ridiculous and far-fetched endings in anime history, but given the progression of the story... dammit it just feels so *right* somehow.\\n\\n\r\nAs far as the characters go... I'll just say this: taking the entire series into account, the character cast of the Grisaia trilogy is and always has been my number one favorite one of all time. No exaggeration. Seriously, Yuuji is arguably the best harem protag ever, at least in terms of writing and persona, and after you've seen his backstory you might also argue that he's perhaps the only one who legitimately *deserves* to have his harem already. And the girls... they just have so much charisma, all of them. How could you not love them? Makina has one of the most outstanding personalities and speech patterns you'll ever find, Amane is like a mother to everyone else, Sachi is the most badass maid of all time, Yumiko is a natural-born commander, Michiru just has waifu tier written all over her and Kazuki is without a doubt my favorite Onee-chan character ever. Even the side characters like Asako, JB and some others are quite spectacular by themselves. \\n\\n\r\nThe animation is as good as it ever was (the only part which even Kajitsu's adaptation got right after all), but the soundtrack of Rakuen is just plain better all-round. It's upbeat and energizing, and has numerous memorable instrumental tunes containing lots of violins combined with fast-paced music. The anime's opening theme is also fantastic, albeit not quite as legendary as Rakuen's visual novel opening (seriously go YouTube it if you haven't, it's amazing).\\n\\n\r\nAnyway, overall what you have is a story which I highly recommend you to not take too seriously. Or rather you can take it seriously, but only up until Rakuen starts (episode 5) because from there on out it's a joyride of insanity all the way to the end. If you try to make a detailed analysis of the story as a whole, then what you have is a plot with more holes than a golf ball... in other words; don't try to analyze it. You'll be the only one who'll suffer from it. Instead, just lean back and tag along for the ride, and you're in for a ton of fun.\\n\\n\\n\r\nNow if only all visual novel adaptations could be this good..................... and yes I'm still looking at you Kajitsu...",
            "date": "2015-06-21T10:52:00+00:00",
            "helpful_count": 79,
            "mal_id": 190835,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=190835"
        },
        {
            "content": "By this point, any of fan of the Grisaia should know firsthand the thrill of the experience. Unlike most harems, Grisaia focuses a bit more on story elements rather than just purely to get into the main guy’s pants. As the third and final season of the Grisaia trilogy, it’s important to understand how this series operates. Grisaia no Rakuen is meant to be completed after the first season (Grisaia no Kaijutsu) and the 1-hour special feature, Grisaia no Meikyuu. From those episodes, you will learn much more about the characters as well as our main lead man, Yuuji Kazami. The catch now is thathe is labeled as a terrorist and it’s up the girls to save her. A dangerous journey of cat and mouse, Grisaia no Rakuen (The Eden of Grisaia) exploits military ethnics and psychological ploys that is able to equally adept with action while building on the story.\\n\\n\r\nI have not played the visual novel, but the series should be easily be understandable as long as you’ve seen the previous season and the special, Grisaia no Meikyuu. The first few episodes shows more of Yuuji’s past life and his role in the military. We already learn about the dark tragedies he has suffered in his past but now, we really get to see a close glimpse of what it’s like. It’s not a pretty picture to think about but at the same time, it’s important to see the events that made him become the person he is today. Yuuji is indeed a complex person and the time he has spent in military has caused him to develop traits that he carries on later in life. One of the most important characters in his life is a woman named Asako, who trained him after his parents’ tragic death. Their relationship can be described as a sort of master/apprentice/guardianship/lover all at once. His relationship with his sister, Kazuki is also very important as she seems to be only other close person in his life. Regardless, the present Yuuji shows a sharp contrast prior to his parents’ deaths. Previously, Yuuji was more of a coward and often did whatever others asked him to. Now, he adapted a more sarcastic sense of humor with cold calculating behavior (especially during missions). Despite not being a cold blooded killer, Yuuji does not hesitate to eliminate others when the time comes. And that’s really makes Yuuji quite an interesting character to understand. No one will probably know the real him though.\\n\\n\r\nThe other parts of the season involves a recuse operation involving the girls from Mihama Academy. A tricky part to execute this section of the plot is how to get all of them together. Essentially, the series shows that they have little clue to help him until they receive the help of an unlikely ally. This is where the mystery of the show comes as this particular character will seem to be very familiar to any fans who watched the franchise. Transitions during these episodes are good and makes its purpose fruitful to answer our viewers’ questions. And while the gimmick of a supercomputer operative may seem like a trick from the old book, it pulls successfully with a blend between humor, creativity, and trust. In retrospect, the second half of the series becomes a thrilling cat and mouse game. Unlike the first season where Yuuji helps the main female leads one by one, Grisaia no Rakuen involves them helping him. Every main female character participates in some sort of role that collectively has the same purpose – to save Yuuji. To skillfully do this, the show delivers action, drama, humor, chases, and mind games. One thing I do frown on sometimes is the humor that practically seeks to advertise attention with its characters. While it’s good for some fun, it quickly gets old. Thankfully, the psychological aspect makes up for this.\\n\\n\r\nI’d think to Grisaia no Rakuen as a combination of action and psychological flick that embraces human emotions. A downside about the season may be the main antagonists. There’s little emphasis on them and their main boss, Heath Oslo hardly has a personality that is explored; we do see that in the special though. Instead, this season barely puts emphasis on them as well his goons. There’s also some mystery regarding their true purpose although by the buildup of many events, it probably won’t look pretty. The plus side however is that the show manages to capture spectacular action features. All sorts of weapons are involved ranging from guns, sniper rifles, helicopters, and hellfire missiles. The show also captures the thrill of a full throttle chase that really is worth waiting for after all the necessary buildup. In retrospect, this season is able to keep its audience at its feet and always wonder what may happen next. Plot twists can be unpredictable including those that gets involved or anything that can happen along the way.\\n\\n\r\nIn retrospect, the artwork and soundtrack is standard to the franchise. It doesn’t change much except for the OP and ED theme songs with its many foreshadowing, metaphor, and symbolisms. However, I have to give praise to the well-directed choreography. It lives up to the promise of the thrill and each episode builds more on that until that climatic moment. Character designs also runs fluid with many of the female characters dressed in their casual attire (except for Sachi in her maid attire). Fan service is still present although is hardly distracting in most cases. Finally, I have to give some praise to Kazuki’s presence in this season. Her ability to command attention through her voice is a highlight and offers that impressive smart package the audience deserves to see.\\n\\n\r\nSurprisingly, Grisaia no Rakuen is actually a pretty fun show to choose if you want some thrilling action and dark storytelling. Rather than repeating some of the mistakes from the first season, the show plays with a lot of its themes and transforms into a product that is grappling. It’s a worthy successor with the style of the story building and characterization. And while some characters doesn’t shine as much as the others, it can appealing to see their roles. It can even make the audience feel jittery at times with this season’s surprising elements. Now, don’t go into this season expecting a blooming romance. In fact, Grisaia hardly can pull off a genuine romance on-screen despite its attempts to do so in the past. Instead, experience sensational feel with the flow of this season’s story as it pulls of its daring risks.",
            "date": "2015-06-21T10:54:00+00:00",
            "helpful_count": 57,
            "mal_id": 190836,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=190836"
        },
        {
            "content": "8bit, the studio who half-assed Grisaia no Kajitsu into a 13 episodes.  The good news is they do not repeat the same mistakes. In 10 episodes they turn it into diamond, shining and bright. Everyone rejoice! Because this sequel would really change your mind about this series. It's exceeded all estimate that exist. \r\nThe sequel of Grisaia no Kajitsu started right after Grisaia no Meikyuu, one of the best thing that Rakuen ever offer it's the main character development.\r\nAt the early episode we can see that the protagonist's past described very well, the feeling and the drama tension can feel deep into your bones.Rakuen tell all the development that required for Kazami Yuuji. The series told Yuuji's past time and many things that didn't exist in it's prequel. Like a rainbow, the character development really prove something well. The development itself it's not shallow like they do in Kajitsu, it's well depth and understandable.\\n\\n\r\nWhile Rakuen succeed in the character development, the story itself got some admire.\\n\r\nRakuen story may be described as \"rare breed harem\". The story pacing it's still unstable, but the audience can still keep up with the story. It is not rushed, but balance and good. The story focused in one linear, which make it more understandable than the 1st season, unlike many harems that didn't notice in developments and story, Grisaia no Rakuen surely shocked all of it's viewers.\\n\\n\r\nWhile the animation we saw are one of the most standard.  We have beautiful environment, colorful characters, explosions, and many other good thing. While the voice actors it's pretty decent, the \\n\\n\r\nAnother good thing is the enjoyment of the series, the excitement it's really beyond the boundary. All of those elements packed together created a massive enjoyment in my personal thought. \\n\\n\r\nJust like a puzzle, when everything collected they will form something beautiful, from wrecked up harem shows, it become one unit of exhilarating story that succeed both in entertaining us and storytelling. Anyone who disappointed by the 1st season should watch this diamond, it is really a good experience indeed.",
            "date": "2015-07-12T03:32:00+00:00",
            "helpful_count": 34,
            "mal_id": 193182,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=193182"
        },
        {
            "content": "Grisaia as a series has an interesting tone going for it.  Placed in a rather unusual setting for a harem anime with a very different kind of protagonist in comparison to the generic harem MC's that we are all aware of, Grisaia managed to pull off a somewhat negligible adaptation for its first season which as a result got some mixed feedback.  So, as the second season, Grisaia no Rakuen, what kind of story awaits us here?\r\nStory (7.00/10): Continuing off of Meikyuu, the 1 hour OVA that came after the first season Kajitsu, we return back to the world of Grisaia back tothe place where the five girls harem girls of the series, Amane, Makina, Michiru, Yumiko, and Sachi recover Yuuji's shredded documents and stick them back together so that we can finally, after an entire season of the anime (and one OVA), learn the complete story of who Kazami Yuuji's is.  (Since Meikyuu not covered about half of his whole backstory.)\\n\\n\r\nSimilarly to its predecessor, Rakuen follows the same kind of storytelling that Kajitsu utilized, which was a method of storytelling that involved the use of a character arcs that ran over a long period of time.  Like its first season, Rakuen uses ths style once again, but rather than squeezing five complete stories like last time (which was a reason why Kajitsu had its downfall), Rakuen features only two of these arcs spread over its ten episode runtime.  \\n\\n\r\nOne of the biggest things that makes Rakuen I feel a whole lot more successful is that it utilized it's time a little bit better.  By having only two arcs of storytelling, the anime itself was able to focus a lot better on what it wanted to deliver, giving us for the first arc, a more cohesive and overall better details and storytelling that made it a lot better of a watch.  It finished up the tale of who Kazami Yuuji's as and what kinds of events led him up to the point we see him in now, which is a great positive for the series.  The second half though...not so much.\\n\\n\r\nThe second half of Rakuen is where the show hits a bit of a slippery slope.  Following in a more present day situation rather than a flashback, the second half is...lacking to put it mildly.  The biggest issue I have with this is the fact that the show really rushed to try and finish the story in its ten episode runtime.  To my knowledge, ten episodes for anime is quite a danger for a story-based show, as the short runtime results in lacking details that in the end, don't make the best shows.  Sadly, for Rakuen, this was the case.  For the latter half, it put together this long and convoluted plotline that I think really could've used a little bit more time to fully explain.  Because of the short runtime, it lacked details such as the villain's exact plan, character motivations, and characters explanation overall, because honey, a short monologue to explain who you are is not enough for me to know or care about your existence.\\n\\n\r\nOverall, I would say that Rakuen did a little bit better than Kajitsu did, but it still had some similar problems.  While giving us some character explanation for our main protagonist, it suffered by not being able to fully give us that same kind of detail all the way through, leading to s climax and an ending that kinda felt...anticlimactic.  A happy ending's nice and all, but...eh, could've been a bit more dramatic or done something a little more tragic given how thick our MC's plot armor is.\\n\\n\r\nOverview:\\n\r\n+ Character explanation for our MC\\n\r\n+ Pretty good first half\\n\r\n-  Lacking second half\\n\r\n-  Plot holes (and character convenience, cause that whole operation done by the girls was awesome, but complete bullshit)\\n\\n\r\nCharacters (7.33/10):  In terms of cast changes, Rakuen for the most part doesn't make an absurd amount of cast differences except one.  But aside from that one increase of main cast, there's really no difference in the numbers.\\n\\n\r\nKazami Yuuji's.  As our main protagonist, Yuuji is Grisaia has historically been very different from your average harem MC.  He doesn't fluster at the sight of a girl, he's actually quite expressionless, and he knows how to be a proper badass when he wants to be one.  As I have stated before, Rakuen makes note of what was missing in Grisaia back in Kajitsu, which we giving an explanation as to who and what Kazami Yuuji was.  Meikyuu gave us a good chunk of his backstory, but his whole story comes full circle and finished once we get to here, giving our MC here a great explanation as to what kind of life he had before coming to Mihama Academy, and giving us look further into his growth as a person next to Asako.  You can really see the growth in Yuuji during this flashback arc in the first half, and I think that part really set it apart from the rest of the Grisaia series.\\n\\n\r\nAfter that, we have Asako, Yuuji's guardian after the events that happened back in Meikyuu.  Asako is a very rough woman, as you can say.  Giving a very stern style of raising to Yuuji and giving him instruction and lessons on how to be a soldier, Asako was a very crucial part of Yuuji and provided him with lessons that really grew his character.  (Also, she kinda swiped his V card when he was like 14, so...I don't know how to feel about her character in that aspect.). Really though, Asako mainly serves as a plot device in the series, giving Yuuji the words of inspiration that help morph and shape into the character he is today.  This is no means a bad thing since it was clear from the very beginning that that was the role that she was going to play.\\n\\n\r\nAnd then we have the previous important characters in the series, the five girls of Mihama academy.  Even though they'd are considered to be main characters, for Rakuen...that simply isn't the case.  Because the show is so centrally focused on Yuuji and his past, present, and future, the girls in Rakuen really serve more as plot devices or characters that help move the story along more than anything.  Because Yuuji helped them with their personal problems, they in turn do the same thing back to Yuuji because they love him, blah blah blah, you get the idea.  The main issue I have with this is the fact that same as with Kajitsu, not all of the girls get treated with the same amount of importance.  (Before, it was just the amount of episodes they get to tell their story.  Now it's just actual involvement in the story to begin with.  Poor Michiru...). This bugs me a little bit because generally in a harem show, it's the girls that we care more about, so it was a bit sad to see most of the essential characters just get shelved off to something equivalent to a supporting role.  \\n\\n\r\nThat reminds me, supporting characters.  Supporting cast in Rakuen does what you sort of expect them to be, plot devices.  With a good number of supporting cast facing a similar fate as the main girls in the series did (ie, help Yuuji because he scratched their backs, now they scratch his), a lot of them aren't really as developed, especially the ones that we see that weren't involved with the first season.  The ones that were in the first season can stand on their own because they have some decent background from before to really help them, but for the ones that weren't, it's hard for them to stack up in any way, shape, or form.  Another thing I have a problem with in the supporting cast are the villains.  The antagonists in Rakuen are horribly underdeveloped, given motives that really don't make sense on account of the poor storytelling in the second half of the story's, leading to some really unexplained villain plans, and a bit of a lame ending because I really have no idea what exactly the guy was planning to do with Yuuji, even after having seen everything the Grisaia series had to offer.\\n\\n\r\nOverview:\\n\r\n+ Great character development for the MC\\n\r\n+ Good supporting character to help with said development\\n\r\n-  Other characters that crossed over are disappointingly shelved\\n\r\n-  New side cast is mostly plot related with no way to stand out on their own.\\n\\n\r\nArt and Sound (7.44/10 and 6.88/10):  Produced by 8-bit, Rakuen returns back to the general Grisaia style of animation with really no change in the way the animation actually looks.  It still uses the same style of neon bright colors for the color palette with a horror/dreadful feel to it, and because it's consistent with the quality as it did with Meikyuu and Kajitsu, there's not really much else to say. \\n\\n\r\nHowever, the show does go a little bit...farther with how exposed some of our characters are.  Because Yuuji's history has some...ahem, pleasurable moments, there are a few scenes that involve the aftermath of such an encounter, with the end result of Yuuji butt.  Also, the red hue on the eyelashes of the female characters return, and that's an art design that really bugs me.  It looks like they have a rash above their eyes, and that just looks weird.\\n\\n\r\nIn terms of sound, it sounds very average.  There's not really much to say for the soundtrack because none of it is really all that memorable. I can't really recall much of what the OP or ED actually sounded like because it kinda sounded generic and nothing really all that spectacular.  Is it bad?  No, it's decent.  Is it good?  Not really, pretty average I'd say.  (Although I will give props to the Yuuji childhood progression thing to his gun at the start of the OP.  That I admit was pretty cool.)\\n\\n\r\nOverview\\n\r\n+ Consistent art\\n\r\n- Decent soundtrack, but not all that memorable\\n\\n\r\nPersonal Enjoyment (5.34/10): So, you may ask, why is personal enjoyment so low? Well, to be honest, I hate Grisaia.  I always found the series to be a bit too weird for my taste, and the series itself goes into some pretty intense and uncomfortable themes and actions, which kind of put me off.  Hell, Yuuji is taught how to sleep with a woman at age fourteen or something and then proceeds to commit that kind of act to a woman at least twice as old as him on account of his master telling him to do it.  And that's only in episode two!  What the hell, Grisaia?!  Why I watched it?  My friend suggested it to me and said it was really good.  (I ask him everyday, what the hell is wrong with you cause there is some weird and uncomfortable shit to be seen in this show....)\\n\\n\r\nDid I like this show?\\n\\n\r\nFrom a storytelling aspect, I did.  It gave us a good sense of storytelling, which is always something I enjoy and appreciate whenever I watch an anime.  It gave us a proper explanation as to what kind of life our main protagonist lived before the events of the show began.  But when it comes to the actual story itself though, no...I didn't enjoy what they were showing.  That kind of content is NOT for me.\\n\\n\r\nWhat didn't I like about the show?\\n\\n\r\nThe second half really disappointed me.  When going back to the present, Grisaia didn't really deliver very well on the kind of story that it wanted to present, which really led to Rakuen's downfall in a sense.  The characters were also something that disappointed me since a lot of the labeled \"important characters\" really didn't come around till the end, and their importance even then was average at best.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you're someone looking for a different approach to the harem genre or a story that actually is quite original in every which way, then Grisaia may be the show for you.  It's got quite a bit of originality to it, and the development for the characters isn't all too bad.  Personally though, I'm not a big fan of this series because it touches on a lot of...uncomfortable themes and showcases some pretty fucked up stuff, so if you're fine with that, go ahead.  Just nite that since this is the season that finishes up the whole series, you will have to watch Kajitsu and Meikyuu in that order before getting to Rakuen.\\n\\n\r\nOverall Score: 7.22/10",
            "date": "2015-06-21T17:06:00+00:00",
            "helpful_count": 15,
            "mal_id": 190867,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=190867"
        },
        {
            "content": "Okay... I really liked the first series far more than this.  I tried, repeatedly, to get through episode 5 but just couldn't complete it.  \r\nI'm sorry - but my opinion is different from a good number of solid anime fans - I just did not like this anime.\r\nSo many cliches, annoying over acting loli with a lisp, and a secondary story about how they are going to fund the place which makes absolutely zero sense.\r\nTo me the storyline seemed to slip considerably, in belief and narrative, from the first season.  \r\nThe Art is Very Good.  I have no complaints here.\r\nI alsodon't have any complaints about the Sound.\\n\\n\r\nCharacter?  Well the annoyingly more talking loli (than last season) with the father/daughter complex... makes me want to poke my eardrums with sharp objects.  The rest of the female characters living with the main character became a \"mashup\" and boring to me.\\n\\n\r\nEnjoyment went down the drain for me on the 2nd Season.  \\n\\n\r\nOverall - if you're in for the long haul then go for it.  I've already moved on to greener pastures...\\n\\n",
            "date": "2016-06-03T10:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 219909,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1112169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/thumpz99",
                "username": "thumpz99"
            },
            "url": "https://myanimelist.net/reviews.php?id=219909"
        },
        {
            "content": "The Fruit of Grisaia was not your run of the mill harem, and The Eden of Grisaia continues that proud tradition. Whereas the Fruit of Grisaia focused on how our Sagara Sousuke clone saves a bunch of girls with unique (and sometimes horrific) pasts, the second installment continues from the OVA (The Labyrinth of Grisaia) and explores Yuuji's past and motivations, and perhaps finally brings some closure to the series.\r\nWith the exception of a very few parts, this second installment is much more action-oriented than the previous series. Remember how the first season broke from harem-mode to spend almost three complete episodes on Amane's past?Expect similar things in this season. If you found the last season intriguing, and are keen on learning more about Yuuji, then this is definitely a great watch. If you're looking for something between an action and a harem, with perhaps a darker tonality than your run-of-the-mill action-based ecchi, definitely give this a try. If you hate emotionless, male versions of Ryougi Shiki, steer clear.\\n\\n\r\nAnimation:\\n\r\nThe animation in The Eden of Grisaia maintains all the unique characteristics of the first season, an extremely widescreen format with a rich and diverse color palette and nice shading. Given the nature of the plot, the scenery is a bit different from the previous season with a lot more shifting scenery. Given that most of the girls' character development occurred in the previous season, don't expect as much emotion in general as Yuuji doesn't have much to offer there. There is a bunch of new characters in this season, most of which play minor roles but nonetheless all play a part in the plot. The neko maid was a particularly fun addition (you'll see why).\\n\\n\r\nWhat is lost in emotion is made up and them some in many energetic action scenes and (occasionally) fights. Remember how Yuuji half-heartedly trained Makina with sniping and how Sachi is secretly an explosives expert? Expect the series to fully utilize those skills in this season. There is some gore and blood as with the last season; if you made it mostly unscathed through Amane's arc in the last season you should be good here. I won't say that the action (or physics) is completely realistic, but at least there isn't any reliance on mechs or magic. Given the focus on Yuuji there won't be as much fan service in this season, though you will still find some mature ecchi scenes, similar to what was in the first season.\\n\\n\r\nSound:\\n\r\nThe show starts with a rather fast-paced, pop-based OP that feels rather fitting given how fast the plot moves, though I don't particularly care for the melody. There are two main EDs that go with each arc. The first main ED is a nice, electronic-infused work with a rather good melody, which reminds me of FripSide's work with Railgun. The second main ED is a slightly slower piece that isn't as memorable. Some of the BGM (especially the playful songs) is fairly familiar by now; though nothing was particularly worth collecting, it successfully gives the show a unique feel.\\n\\n\r\nThe original cast returns to give a strong performance in this sequel. The cast grows significantly with a lot of new supporting cast, some of which play pretty significant roles. As with the plot in general, expect the conversation to be a bit on the mature side relative to your standard harem.\\n\\n\r\nStory:\\n\r\nThe story takes a deviation from the character-based arcs in the prequel; it's much more linear here. We last left off with Yuuji, for some reason, explaining his life story to Yuria. The first arc of this season continues where the OVA left off, explaining how Yuuji was re-socialized by his master Asako and how he learned to be useful to society through the armed services. It explains a lot about Yuuji's motivations and how he became such an efficient and cunning killing machine. The second arc sees the return of Heath Oslo, the pedophile and prolific terrorist who wants to reclaim Yuuji. How will the girls return Yuuji's favors in the past season?\\n\\n\r\nExpect quite a few plot twists and cliffhangers in this winding adventure that grows to a literally atomic climax. This is followed by a nice, long conclusive ending.\\n\\n\r\nI found this adaption truly amazing in its ability to connect events and characters. Point to virtually any scene in the prequel, and you'll be able to see the repercussions in the sequel. Almost all of the open questions of the first season were completely dealt with in this season, barring the aforementioned unrealistic physics and what not. It truly is well beyond what I would have expected from an erotic hentai adaption.\\n\\n\r\nCharacter:\\n\r\nNormally I'd condemn the mass-expansion of character but in this case, all the additional characters are prudently added and meticulously used. If you see a new character in the first arc, don't be surprised to see them return later on.\\n\\n\r\nThe focus is squarely on Yuuji this season, and you'll get to see him develop from an emo pile of suicidal massacre to a purpose-driven machine (yes... still rather emotionless) willing to sacrifice everything for the ones he cares about. There is a lot of wit in this show whether it is Asako's off remarks or Kazuki's sly jokes- definitely don't skip the final part of the conclusion. In the latter half, you'll also enjoy more of the original school girls- they're mostly static characters by this point but still quite entertaining.\\n\\n\r\nValue:\\n\r\nMany shows try to attempt something different, and often they give this up and return to well established patterns- especially in sequels. Grisaia is unique in that it sticks with its approach and delivers a truly unique mix of action and harem. Yes, it is a bit dark and yes, the subject is probably more appropriate to those 16+, but it truly is a unique work, and an unexpectedly good one. Re-watch value also exists given the number of connections and foreshadows throughout the show. I highly recommend this sequel for those who enjoyed the original.",
            "date": "2015-11-12T00:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 203213,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203213"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nHmm.. I think here I'll first comment the whole franchise and then move onto this season specific. \r\nSo the plot is pretty much odd people in odd school with odd background living an odd life. As well pimp of a main guy, that's one hell of a harem he has, womanizer to the core. I won't go into detail, but I'm going to mention mixed feelings this franchise gives me. It is somewhat of \"fck yea, Murica\" anime with odd Japanese touch. By that I mean thewhole military life, strong personalities with somewhat loose moral sense. Here I mean sex was something I'm not fond of in this manner that this anime presented. (rather than sacred thing that I consider it is, it was more of western shows \"normal & casual thing, nothing serious\"), but here I should emphasize word \"pseudo\", meaning it still wasn't as west and was more towards purer side as actually most of characters really cared of the guy and so did he. Plus yeah whole military thing I'm not fond/accept either.  First I just hated that whole thing IRL (military/politics) than after certain event in life, it somewhat traumatized me and hate it even more now. Point being, this franchise has aspects I despise IRL, yet somewhat it was presented in a really oddly satisfying way. Thus the reason I can't hate this anime. So anyhow.. moving on to this season specific.\\n\\n\r\nStory\\n\\n\r\nStory continues where it last ended. It was odd and \"pseudo-hollywood\" fun as always. A very unique and odd Anime. For most part I enjoyed it, felt quite good. Probably only minus it gets from me are the personal quirks I hate. Normally it would lower score for me a lot, but this Anime managed to bypass my hate. Must say most things were folded in an acceptable level and probably the \"route/pairing\" was for the most part also understandable which pairing would it gone to.\\n\\n\r\nArt\\n\\n\r\nI don't know whenever its just me or it felt that this season Art/animation was somewhat blander and cheaper looking. Might be possible that I can't remember how it was previously as some time has passed since I watched this franchise. But nevertheless, it didn't feel as impressive.\\n\\n\r\nSound\\n\\n\r\nMost tracks felt interesting and fitting. Maybe not utterly my taste, but felt quite good in here. Music/ost didn't have too much or too little presence, it felt as fitting background music.\\n\\n\r\nCharacter\\n\\n\r\nCast of dramatic past. All of them are somewhat odd, but nevertheless still love most of the characters. Various stereotypes with a depth of oddity. Yuria and Yumiko my favorite.\\n\\n\r\nPoint being, not much to comment regarding characters without spoiling. Characters are odd and tragic/dramatic, but you grow into them. Or well, will hate them.\\n\\n\r\nTo sum up, this anime gave me mixed feelings, but in the end I found it really unique and intriguing franchise. It had aspects I despise, but it was presented in a manner I couldn't hate it. Oh, and fanservice or women were done very sweetly. Hot n sexy stuff on that part. But so were really male characters also fairly sexualized. So stuff for both gender viewers.",
            "date": "2017-08-27T11:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 256356,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=256356"
        },
        {
            "content": "Take note that I haven't read the visual novels yet, but I do enjoy the adaptations of Kajitsu and Rakuen. After the so called trainwreck adaptation of Kajitsu, which questions has been cleared after the sequel Grisaia no Meikyuu, this time Rakuen is much easier to follow. With more on buildup the anime has a big \r\nThe story is probably above average, this season we get more on the character's stories and flashbacks, more on tension and plot buildup but is paid by thrilling scenes and the way of storytelling is very good, I must say that I'm impressed that 8bit puts effort in adaptingthis. I think the pacing is good and smooth, and it's much easier to follow the anime. This time the story is more focused on the main guy Yuuji, his backstory, the past, and the present. \\n\\n\r\nJust like the prequels, the art in my opinion is really well done, just like of the VN. Character designs are very detailed, it's catchy to the eyes and the backdrops are pleasing that the character designs can easily blend in. Each scene can be considered \"of good quality\". At times, it can be crappy or mediocre. Animation-wise, I don't see any flaws about it. Use of colors are also pretty good, I must say it's a unique and fresh style of art which can't be seen from other animes out there. \\n\\n\r\nWe have a decent set of soundtracks right here,very different from Kajitsu and definitely better, and some background music are from the VN as well, which are very good. Some songs are too short for some scenes and then another song comes in which is a bit out of place can make us feel the adaptation quite rushed. Again, Kurosaki Maon performs the opening. \"Setsuna no Kajitsu\" is a really great song and very catchy, together with the animations it can easily become addictive. It fits well with the fast pace and mood of the anime. The endings are also alright and catchy, but I prefer the first ED which is fast and has messages in the animation, I'd say the endings gets its job done. For the voice actors, they were perfect, voices suit their respective characters, and have distinct voices that we can tell who they are just through listening.\\n\\n\r\nNow for the characters. I'm not going to introduce them anymore, but its super obvious that they really get lots of development from this season, even new introduced characters can have a decent arc, just like Asako's, which has less screentime but she got a decent development through good storytelling and deep exploration with her character. For Yuuji, this time he's not that stiff as the first season so its obvious that his slow but sweet development made huge impacts to his character. This time the story mostly revolves around him with his harem. From this point, the main girls of Grisaia are honestly developed from the first season, their interactions and personalities are very entertaining that you'll find them all likeable. They have substance, not just carbon copies of characters from other series. \\n\\n\r\nEnjoyment. How much does my 24 minutes last? Oh god it feels like time flies fast when watching this. It's prequel is very different from this one, as this is more enjoyable, with a good sense of direction and likeable characters I really find myself enjoying this one before I knew it. Everytime I finish an episode I want more. This wasn't made to become a blockbuster, its simply just being itself. Too bad it is overlooked by more anime this season and this is so underrated. Only problem was that the few last episodes felt a bit little rushed, but that's just about it.\\n\\n\r\nStory - 9 (Rakuen has more interesting plot direction, story has a big potential and they made good use of it)\\n\r\nArt - 8 (Pretty good. Pleasing to the eyes and nothing to say bad about it.)\\n\r\nSound - 9 (Soundtracks are really touching, but sometimes too short or out of place. Badass opening and ending.)\\n\r\nCharacter - 10 (Very good developments of EVERY character including the supporting characters, they have allotted screentime for themselves)\\n\r\nEnjoyment - 10 (No joke. This one is so good you'll want more every episode)\\n\r\nOverall - 9 (Adaptation done well. Nearly perfection.)\\n\\n",
            "date": "2015-06-22T04:21:00+00:00",
            "helpful_count": 8,
            "mal_id": 190904,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3779267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BaptizED",
                "username": "BaptizED"
            },
            "url": "https://myanimelist.net/reviews.php?id=190904"
        },
        {
            "content": "You are in a running race. As you approach the finish line you are in first, far ahead of your competitors. But right before you get to the finish line you trip. Your victory and your new record is a goner.\r\nThis is basically the feeling Eden of Grisaia left me with. A would-be masterpiece that just ruins it at the very end just like Charlotte. Just when I first thought I found a masterpiece in a genre called \"Harem\", a genre often filled with mediocre stories, the ending just had to ruin it all. And it did it not only once, but twice: at thelast episode of first season and the last arc (though the latter was a bigger turnaround).\\n\\n\r\nGrisaia series is another series that has left me excited while watching. Heck, I finished the entire series within 48 hours of a weekday just because of how enthralling this was. It was a surprise that this series with such compelling story originally was an eroge (whaa). I have not read the VN before watching this series, and really didn't find major flaws until the very end (like pacing), unlike the fans of VN.\\n\\n\r\nStory: 5/10\\n\r\n\"Will I ever be able to live a normal life? I have too much blood on my hands. But I am not allowed to die until I save five people\"\\n\\n\r\nThe story was a masterpiece... until the writer decided to say \"F*** it, and threw physics and logic just out of the gate. \\n\\n\r\nLet me start of by saying how this would have been a masterpiece if it wasn't for the last arc.\\n\r\nThe Grisaia series is really a mix of everything: romance, action, psychological, harem, romance, and quite a lot of genres. And despite the chaos the combination the flow of the story (until the last arc) and the tension were perfectly smooth - it felt like I was watching a psychological piece like Psycho-Pass while watching The World God only Knows with tension of Death Note and action like Attack on Titan. And what Grisaia does is gets rid of the flaws of those series and only puts the best elements in the story. I can safely say it's one of the best.\\n\\n\r\nI initially thought that this series would be like Nisekoi or another conventional dull and average MC, but he's pretty bad-ass and just \"like a boss\", I'd say. And the Harem series does not really act as a detractor from the main series; they all add up adding to the mysterious component of the series. I understand why the VN has received so much praise.  Well, this series WAS superb..\\n\\n\r\nThen there was the last arc. (and I thought the last episode of Fruit of Grisaia was full of BS too)\\n\r\nWhere nobody gets injured when a car crashes falls from midair off quite some altitude (quite an irony to the Microbus incident), or the villains who are just ridiculously terrible shots, or a bomb that just doesn't detonate, and the girls magically earning money like piece of cake. Well, this series was full of action that kept me tense the entire time, but it just went too overboard here. And the ending was troll just like the last arc itself.\\n\\n\r\nIf I were to rate the story, I'd give the first season 8.5/10 (-1 due to last episode), S2+Yuuji's past arc 9.7/10 (Simply just brilliant), and the last arc meager 3.5/10.\\n\\n\r\nAnd this series probably one of the best sexual innuendos. Well Miles above others. And it doesn't interrupt the action aspect of the story at all. But it has some \"quirky and unique\" characters....\\n\r\n(Kazuki???)\\n\\n\r\nTL DR; Just a Masterpiece... Until the last arc.\\n\\n\r\nArt: 9/10\\n\r\nThe angle of shots and just the general tone of the cinematography is perfect for setting up the tension in the series. But it kinda gets distracted by some moe-ish characters (like the principal or the secretary). And it has some waifus for those into 2-D girls (I hope you are not).\\n\\n\r\nSound: 8/10\\n\r\nDidn't find anything getting me off the anime. I like this season's opening too - pretty ominous song unlike other anime labeled \"harem\" (that's really because Harem is not the main genre of the story)\\n\\n\r\nCharacter: 9/10\\n\r\nI'm basing this off all three series.\\n\r\nThe background story behind each characters are deep and just thrilling. Yuuji, the guy who just looks like a generic average guy from a harem anime, is actually one of the most complex characters; he is haunted by the past, and his story reflects upon nihilism, existentialism, moral values, and countless other themes and motives.\\n\r\nAnd it doesn't cross the boundary with the LOLI character! (thank you... they are more like father-daughter relationship...)\\n\\n\r\nExcept two characters ruin the atmosphere - the principal and the secretary from JB's office. They are too \"moe-ish\" and just doesn't really feel like they belong there. Would have gave a 10/10 if not for this (it just felt way too out of place).\\n\\n\r\nEnjoyment: 8/10\\n\r\n10/10 without the last arc.\\n\r\nWay too thrilling. Action packed. I didn't want to skip any of it (which is pretty rare) until the last arc. Was better than most movies.\\n\\n\r\nOverall: 6/10\\n\r\nI kinda wrote a review on the Grisaia series as a whole. I gave 9 to S1 and S2. But as for this series, we have the first part which is a 10/10 for me (Yuuji's past) followed by mediocre \"f**k physics and logic\" arc. I just couldn't give this a high rating (mostly because the last art is 6 out of 10 episodes). But great series overall. I'd still recommend anyone watching this series to even watch until the ending to get a sense of resolve.\\n\\n\r\nTL DR; Absolutely AMAZING series as a whole, containing the best of elements of top anime such as Death Note, Psycho-Pass, Attack on Titan, and other romance/harem-ish anime. Terrible last arc, but I'd still recommend to get the feel of being resolved. Low score due to it half of it being about the last arc.",
            "date": "2018-01-06T18:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 267682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5631716.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xre",
                "username": "xre"
            },
            "url": "https://myanimelist.net/reviews.php?id=267682"
        },
        {
            "content": "After finishing the Grisaia series i wanted more. Kinda like that fat kid at the birthday party that always asks for more cake, but then is told, \"No, you already ate half of it\" and then not given the cake and then they whine like a baby until they get what they want. That is how i feel about this show. Why is it so good? Hm. I don't know. Probably because of the harem king who stars in the show (Kazami Yuuji) and the plot development along with the opening and ending. This is one of my ideal animes that i like to watch.There is a harem, but not too much harem with harem cliches. There is action, but the show is not all about action. The girls in the harem are also not afraid to kiss Yuuji. Lets move on from this big paragraph, shall we?\\n\\n\\n\r\nOkay welcome to paragraph number two where i talk about how funny this show is and you start thinking, (when will this end?). The comedy (and holy shit is there comedy) is OFF THE CHARTS. If you ever watch this and say you haven't giggled, laughed, or even smiled, you are a fucking liar. How could you not laugh every time Immortal Robbie played some of his imouto games? Especially during the episode where Yuuji, Milliela (or however it is spelled), and that one guy walked in on him and he was shouting, \"SUCK IT! SUCK IT! YOU SUCK IT FIRST!\" I won't tell you what else happened because this is a spoiler-free review, am I right? But trust me when I say if your grandpa watches this whole anime (without dozing off) he will laugh, even an old guy like him. Old people never laugh.\\n\\n\r\nNow we shall talk about the harem. Now I don't remember all their names (\"But you said you just finished it a few hours ago. D:\" says you. Well you can't blame my memory.) but i can remember that Kazami Yuuji and his harem need to be inducted into the Harem Hall Of Fame. The girls are so....um.....(how to put this without sounding like a huge perv? ( ͡° ͜ʖ ͡°) ) ANIMATED. YES. Their graphics are attractive and they each have their own backstory. They also get an episode dedicated to them too, unlike other shows where the only information you get on the harem girls are from weak flashbacks, which make them seem like side characters, unlike Grisaia no Rakuen where the girls are main characters. I guess you could include Kazami's sister in the harem too since she has a brother complex and that is fine. Even she gets her own series of episodes (three or two as i remember from Grisaia no Kajitsu) explaining her disappearance. \\n\\n\r\nLast topic, I promise. The story is so good. almost half the episodes are dedicated to Yuuji's past and that is okay. I'm pretty sure everyone was curious about his past as well. It explains his personality. It doesn't cover his child years i think. As I can recall that was probably in Grisaia no Meikyuu. \\n\\n\r\nOkay I'm sure you have something else to do with your life. I do too. I will end the review on this note: Grisaia No Rakuen is a good anime, the whole Grisaia series is a great series. If you are looking for something to watch at the moment, you have found your anime. It is worth your time and if you can watch it without dying by laughter you will see how great it was. \\n\\n\r\nP.S. I forgot to mention how good the opening and ending are.\\n\\n\r\nP. P. S. Also, unless you are comfortable with seeing boobies uncensored, DON'T WATCH THE SPECIALS. They are basically soft-core hentai. While creating the specials the creators were ONE STEP away from crossing into hentai zone. I endured through them though.  ( ͡° ͜ʖ ͡°) there is no censored version too so if you don't like hentai don't watch it.\\n\\n\\n",
            "date": "2016-07-14T00:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 223973,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4546882.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Magister_Jakene",
                "username": "Magister_Jakene"
            },
            "url": "https://myanimelist.net/reviews.php?id=223973"
        },
        {
            "content": "Enjoyment 6/10\r\nI think that Grisaia no Rakuen is a good sequel to the first season i think that it has incredible art good story and antagonist well written characters and great action scenes.... but i just couldn't enjoy this season as much as the first one because of 2 characters - JB, Asako\r\nthose 2 completely ruined a lot of Yuuiji's past for me with completely unnecessary sexual relationships with him \r\ni mean (very minor Spoilers) Asako just decides to have sex with him when he was 16 as a present and she is like 30 years old and JB was even worse... so much worse\\n\r\nok she was a VIRGIN !!! and again around 30 years old when Asako just pushes her to lose her virginity to a 16 year old kid \\n\r\nall of this makes absolutely no sense and completely ruined my immersion in the show a few times. i understand that this is an adaptation of a sexual eroge but this just fills wrong . it was like he was having sex with his mom and then his aunt. (End of Spoilers)\\n\r\nanyway this is most of the bad stuff i have to say about the show so let's jump into the good stuff \\n\r\nStory 8/10\\n\r\nin the first few episodes the story focuses on Yuuji's past before meeting the girls at the academy and also introduces the villain Oslo a pretty great antagonist to be honest \\n\r\nafter about i thing 5 episodes of Yuuji's very well written and interesting past (except for the things mentioned above). \\n\r\nafter 5 episodes of the past we get back to the present and Oslo returns to get Yuuiji. \\n\r\nits a rather interesting story that has a satisfying ending so i enjoyed  it overall. \\n\r\nArt 8/10 \\n\r\nthe art is very good looking and the animation is very good especially in the action scenes that i have to admit are just gorgeous as well but there are very annoying black bars that coused  me to lower the score form 9 to 8 overall its very pretty ( just look it up online and see its for your liking)  \\n\r\nand of you enjoy the occasional boob that you will love the art  \\n\r\nSound 7/10 \\n\r\nit matched the show really well but nothing really stood out except the opening song that i just love seriously go listen to it  \\n\r\nCharacters 9/10 \\n\r\nexcept for the two characters i mentioned in the start ALL of the cast of this show is great. \\n\r\nthe girls are likable relatable  sometimes even hilarious and each of then has their own unique personality but there is no more development for the girls which kinda disappointing to me after the great development in the first season but  i still love the cast and they provide great development for Yuuiji \\n\r\nOverall 7/10\\n\r\nIs you don't mind boobs every once in a while this show is great. its a drama harem that provides the fan service the drama and the action that we all want and adds on top of that great writing and characters which is very rare for harems \\n\r\ni really really felt that its a great show but because of thing i mentioned at the start it really i feel ruined my experience with show but i can still recommend it to people that like harem and want more than the regular ecchi comedy that we get every season.",
            "date": "2016-03-14T08:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 212925,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5071202.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/21choices",
                "username": "21choices"
            },
            "url": "https://myanimelist.net/reviews.php?id=212925"
        },
        {
            "content": "Well it's an improvement from the first series I'll give it that, but it could still use improvement.\r\nStory: 7\r\nThe story in the start and going on was good, and definitely a whole lot better paced then the last season was. However near the end, and especially the last episode, it seemed like the writers tried to cram a whole 2 episodes worth into 12 minutes. Yeah, not a really pretty sight to see. However, they decided to still go with the 10 episodes instead of 12 episodes which would have allowed for a lot better of a transition in the story.\r\nArt: 8\r\nThe art, like lastseason, doesn't fail to let down the viewer. The action scenes especially shined in this element with all of the car flipping, exploding, and death parts that were to be seen in various places in the anime.\\n\\n\r\nSound: 8\\n\r\nThe sound was well implemented and sounded pleasing to the ears, as well as the intro and outro music were really enjoyable. Besides that however, there weren't any specific parts that I could think of that were impressive.\\n\\n\r\nCharacters: 7\\n\r\nHow would I describe it...well the characters are all from last season with the encompassing of some new characters who weren't that well explained with the exception of (spoiler) Yujii's sister and some others. Literally, the clone of Yujii was in the anime for less then 5 minutes with little to no backstory before he gets shanked by Yujii. I didn't watch the OVA so maybe theres more information about the characters in it, but the anime itself gives very little information about the villians in this series besides the fact that there bad, and need to be stopped.\\n\\n\r\nEnjoyment: 6\\n\r\nI really don't know personally why I give it only a 6 in the enjoyment category, but I do know that while I enjoyed watching this in the beginning, I started to watch this because I hate to leave animes unfinished, and not because I love it. Maybe it's because they focus so much on Yuuji's backstory or maybe on whats happening to the girls in the present, but I started not to watch it because I liked it, but because I didn't have any other animes to watch on Sundays.",
            "date": "2015-06-21T18:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 190876,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066335.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Somebody101",
                "username": "Somebody101"
            },
            "url": "https://myanimelist.net/reviews.php?id=190876"
        },
        {
            "content": "When I first watched the First Season, I honestly thought I was getting a \"Shuffle\" kind of thing.\r\nNumerous girls with different routes, different stories and different outcomes.\r\nBoy was I wrong. This series is honestly amazing. It follows the life of a man looking to escape his past. A man looking for redemption. A man looking for peace.\r\nEach of the girls have their own story, their own past and their own will to survive.\r\nI think those elements are great. The background of Yuuji, JB and Asako is so powerful. These 3 had such a powerful history that one without the other leaves a huge hole inyour heart.\\n\\n\r\nIf you enjoyed Season 1 and the OVA, definitely continue watching for the full story.\\n\\n\r\nI'm saddened that this season is only 10 episodes...\\n\\n\r\n---------------------------------------------------------------------------------------------\\n\\n\r\nBest anime of Spring 2015. Honestly, this is how you do drama/romance. The closure, the feels, the suspense, the leveling with MC and his harem.\\n\\n\r\nBeautiful.\\n",
            "date": "2015-06-24T10:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 191137,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=191137"
        },
        {
            "content": "I really enjoy this anime lol. not much i can said in this review, this anime is indeed a good psychological anime, the past of each character is really sad, especially Yuuji and Amane (my opinion though).\r\nThe art improved a lot since the first season, especially that 3DCG part when they are being chased by a helicopter. 10/10 for me.\r\nOP and ED is nice, i really like the background music they put in each scene.\r\n10/10 for me.\r\nCharacter development is very good despite this season only have 10 episode. \r\nI really enjoy this season, and overall i gave this anime a perfect score.\r\nIf you like anaction, psychological, and romance anime, this anime is for you!",
            "date": "2015-06-29T22:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 191769,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4702973.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Badass_Hole",
                "username": "Badass_Hole"
            },
            "url": "https://myanimelist.net/reviews.php?id=191769"
        },
        {
            "content": "It is a sequel of Grisaia no Meikyuu and Grisaia no Kajitsu, so watch them before it to understand the storyline.\r\nCharacters:\r\nThere were added some new secondary characters, like Yuuji's military friends and a girl who raised him (although, the first time she appeared in special), however the main characters are still the same - professional hitman and his harem.\r\nStory:\r\nIt starts with a story of main character's childhood and then he's fighting with bad guys. Unlike the first season, it had more action and less drama. Even sometimes it looks like a western action movie of the 90s.\r\nArt and sound:\r\nArt and background music style are stillthe same, but I would like to mention that all episodes are made in the cinema widescreen format (2.35:1), therefore these ten episodes look like a long movie.\\n\\n\r\nDon't expect it to be a harem anime like the first season, it's rather an action with a little fanservice and drama.",
            "date": "2015-07-19T00:59:00+00:00",
            "helpful_count": 5,
            "mal_id": 193800,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3861507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ever2014",
                "username": "Ever2014"
            },
            "url": "https://myanimelist.net/reviews.php?id=193800"
        },
        {
            "content": "If you watched the first season and the special for this show and think you know what you're in for, think again. This show is balls to the wall insane at this point, but I loved every moment of it. From spending half the season in flashbacks to create a second harem, to coming back to the modern day where it's up to 8 women who are interested in him at one time. You have a 12 year old with a Baretta .50 cal, a maid who makes bombs, and robotic AI trying to control the world. This show just keeps on giving with insaneplots, set pieces, yet still managing to make me care about what's happening on screen.\\n\\n\r\nThe art is interesting enough while it draws your attention to guns, vehicles, or locations. Past that, the characters are all tropes that are slightly subversive to their type, however this was established in season 1.\\n\\n\r\nIt's a harem show through and through, but it's also a thriller. That's the description that hooked me in. You'll be on the edge of your seat while also feel like you're watching garbage. In the end, if you liked S1 but didn't feel it was insane enough, you won't be disappointed.",
            "date": "2018-04-07T11:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 277249,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=277249"
        },
        {
            "content": "While the season was off to a good start, the last several episodes seems to be a letdown.\r\nThe beginning being a continuation of the movie, was by far(for me) the best part of the show.(although I am not a great fan of the movie)\r\nHere we get a deep insight into Yuji's charecter, both providing a background for the first season and letting viewers develop an appreciation for what made Kazami Yuji.\r\nAt the beginning of the review I did say that the last few episodes were disappointing, perhaps this is not entiarly true. The finale was, in a very proper usage of the word, EPIC.\r\nThe amazingstory of the majority of the show + the spectacular finale( which I'd be happy to use as an example of badassery) most definitely make up for the shows shortcomings.\\n\\n\r\nPOINT IS : it's worth a watch",
            "date": "2017-03-03T20:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 241819,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6066237.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OKusernameihope",
                "username": "OKusernameihope"
            },
            "url": "https://myanimelist.net/reviews.php?id=241819"
        },
        {
            "content": "Grisaia became somewhat disappointingly self-aware and therefor much less ridiculous (though still completely ridiculous) but to its credit it also became a technically better series. What it does really well is that it starts playing with your expectations of the hot garbage that Grisaia is and uses it to create some genuinely clever and humorous moments mostly by really leaning into the silly Grisaia stuff early on just so they can circumvent their own tropes later on. In fact, even the serious moments go over a bit better this time around. They provided enough of the Grisaia bs I know and love while both acknowledgingthat its awful and using that to actually improve the overall product. The direction and shot composition are also improved for the most part but still throw in some laughably bad CG and other silliness here and there for old times sake. On the part of the creators this is a fairly measured and mature, and dare I say, respectable response to the original series.",
            "date": "2016-06-11T09:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 220496,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66757.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ueno_station54",
                "username": "ueno_station54"
            },
            "url": "https://myanimelist.net/reviews.php?id=220496"
        }
    ],
    [
        {
            "content": "Let me explain something to you guys, before I get on with this actual review.\r\nIs Grisaia no Rakuen (also known as The Eden of Grisaia) an anime that is necessarily an \"amazing\" one, at least to the eyes of most critical anime fans? And what I mean by that is this; does Grisaia no Rakuen have everything needed for a series to be amazing in the eyes of most anime fans, and use those things well? Things like; serious/deep/though provoking themes, elements of suspense used correctly without deus ex machina, a fluid and linear story, psychological/dark plot lines, well-characterized and developed characters, all bundled togetherwith stellar animation and an ass-kicking soundtrack?\\n\\n\r\nIn some aspects, yes, Grisaia no Rakuen has those things. In others... well...\\n\\n\r\nOne thing I feel I should mention before going on with my review of this absolute treat is that, you shouldn't go into Grisaia no Rakuen expecting those things. Does that mean I'm directly implying that this series is nothing more than mindless fun, and can't be enjoyed as something deeper than that? No, not at all. But I think that Grisaia no Rakuen has a meaning to it that's different from the typical \"norm\" of what makes an anime so amazing. The absolute greatness behind Grisaia no Rakuen is, in a very small way, similar to that of Masaaki Yuasa's masterpiece The Tatami Galaxy. It, in no way, follows the norm of what people consider to make anime as great as it is, yet is still something many people consider to be one of the best anime of all time, if not the very best. Grisaia no Rakuen is similar to it in that regard.\\n\\n\r\nSo what I'm saying is, Grisaia no Rakuen should be thought of as mindless fun, because in a way, that's all it really is... yet, it's enjoyable at a level FAR above your typical mindless fun series. Hell, I'd say it's far above ANY mindless fun series, no matter how good it is/how good people consider it to be.\\n\\n\r\nSo today, I'm reviewing the recently-finished 2015 visual novel adaptation by Studio 8bit, sequel of the highly acclaimed visual novel Grisaia no Kajitsu, is the anime adaptation for Grisaia no Rakuen. Let's begin.\\n\\n\\n\r\nSmall thing to note before we continue:\\n\r\nDo understand that Grisaia no Rakuen is the final installment to the Grisaia anime series. The first 2 are Grisaia no Kajitsu, the main series, and Grisaia no Meikyuu, an hour-long prequel special. If you are here looking for a new series to start, please visit the page for the anime [Grisaia no Kajitsu] which is where this series is meant to be started.\\n\\n\r\nIf you're still here, then you probably understand that this is meant to be a review of Grisaia no Rakuen, the sequel to Grisaia no Kajitsu/Meikyuu. With that being said, in my head, there's only 2 reasons why anyone would want to read a review for a sequel series like this one:\\n\r\n1. You've seen the first season, and want to know if it's worth it to watch the next, or...\\n\r\n2. You've seen the whole thing, and want to see what someone else thought about it, purely out of curiosity or because you want to compare your opinions to someone else, or something along those lines.\\n\\n\r\nWhichever you fall under, it proves you've seen the first season... and given that, there WILL be some spoilers (though minor, spoilers nonetheless) to both Grisaia no Kajitsu and Grisaia no Meikyuu within this review. So, I'd advise you do not read any further if you haven't seen the first season/hour long special and don't want to be spoiled.\\n\\n\r\nWith that aside, let's begin the actual review.\\n\\n\\n\\n\r\nInitial Thoughts (prior to watching):\\n\\n\r\nGoing into Grisaia no Rakuen, I was actually quite hyped, and not for the reasons you'd expect.\\n\\n\r\nAfter finishing Grisaia no Kajitsu, which I happened to finish about a week after it finished airing, I was left with an EXTREMELY bitter tasted in my mouth... though, I still had hope for the future, but I'll talk about that later.\\n\\n\r\nThe reason for my bitter taste was simply because of how terrible an adaptation Kajitsu was. While I firmly believe that comparing an anime too much to its source material is stupid (because if you want the source material, go read the source material, don't give the anime slack for not being an exact copy of it), I usually only say that as an attempt to justify a series that goes the route of being an anime-original adaptation and not specifically an adaptation of any source material. My logic behind liking those things is because it gives is a new take on a story, and basically gives us two different versions of it... since, well, more is always better.\\n\\n\r\nHowever, my original claim of \"comparing an anime too much to its source material is stupid\" is completely null and void when the reason for making those comparisons is due to the series being extremely rushed. Basically, when a series tries to be an animated copy of its source material, but fails to do so because way too much was left out.\\n\\n\r\nAs a visual novel reader of the entire Grisaia series, I'm able to say that that's EXACTLY how it was with Grisaia no Kajitsu. A visual novel that took me about 85 hours to complete, crammed into a 13-episode anime adaptation barely even 5 hours long. And my god, when people tell you that a lot was cut out, don't think they're just complaining and not believe them because that's EXACTLY how it was; so much was cut out, and it was almost impossible to enjoy.\\n\\n\r\nThough, I can understand why people do, and I tried to take into consideration how people who haven't read its visual novel felt about the series when scoring it. Thus, I gave it a 4/10; enough to mainly think negatively about it, and enough to be vocal about my problems with it, but not bad enough to curse at it or truly call it bad.\\n\\n\r\nThen came Grisaia no Meikyuu which, honestly, can be said to be pretty dang rushed as well. While not NEARLY as rushed as Grisaia no Kajitsu, a 15-20 hour visual novel being crammed into an hour long special (about 48 minutes in total) can be considered quite rushed as well, as typical GOOD visual novel adaptations tend to be about 1/4 as long as the original source material. However, I still think Meikyuu was given an amazing adaptation for the plain and simple fact of what it \"truly\" was as a visual novel: something MANY people considered to be, primarily, a fan disc. Meaning, fanservice was the prominent thing here, and the story was only a small part of it. Almost every important aspect of the Grisaia no Meikyuu visual novel was included within these 48 minutes, and to be quite honest, I don't think I'd ever ask for better, even if I was given the chance.\\n\\n\r\nThough, it's a given that I didn't think Meikyuu was the most amazing thing ever, but I won't deny that it was done in, most likely, the most amazing WAY ever. Which is why I gave it an 8/10.\\n\\n\r\nRemember how I said earlier that I still had hope for the future of this series? The main reason I felt this way was due to the confirming of sequels at the end of episode 13 of Grisaia no Kajitsu. While I didn't know what was in store for the future, I assumed another TV series would be on the way, and that's why I thought good things for the future. I though, \"unless they plan to make a 3 episode anime adaptation, there's no way they can screw this up.\"\\n\\n\r\nWell, here's the thing. Despite it being EXTREMELY rushed and barely enough to understand even part of what's really happening, the things that WERE animated in Grisaia no Kajitsu were actually done quite well. So, the way I thought about it was that IF it were given a good adaptation, and wasn't rushed very badly, it would be an amazing anime. So, all we needed was an episode count that made it hard to be rushed, and Grisaia no Rakuen could almost be confirmed to end up being a really good anime.\\n\\n\r\nOnce the episode count was announced, the things I said were pretty much confirmed in my head, as I thought there was no way Grisaia no Rakuen could be screwed up... and I was predicting it to be one of my favorite anime series' by the end had that been true. And look who was right.\\n\\n\\n\r\nAnd now, let's begin the actual review!\\n\\n\\n\\n\r\nStory:\\n\\n\r\nGrisaia no Rakuen starts off as a continuation of Grisaia no Meikyuu. We continue on with Yuuji's backstory, visiting his life after his childhood, after being taken in by Asako. With Yuuji's life being as terrible as it has been up until this time, Asako was prepared with the challenge of healing Yuuji's wounds and helping him to live an enjoyable life (flashback to the beginning of Kajitsu, where Yuuji claims he wants to join Mihama Academy so he can live a \"normal life.\")\\n\\n\r\nThis piece of the Grisaia story is one of extreme importance, maybe even the most important in the entire series. While it can easily be noted that Yuuji acts much different within custody of Asako than he does within the story of Kajitsu, you are easily able to tell how each thing that happens to him plays a part in the way he acts as a character within Kajitsu, as it takes place after the events of Meikyuu. And let me just tell you this, Yuuji is an extremely well-written character... though, I'll save that for when it needs to be talked about.\\n\\n\r\nYuuji within Kajitsu seemed a lot like a mystery. We wondered what exactly happened to him to cause him to act the ways he does; and we were given answers. Many answers. Many of the answers brought up questions we didn't even have, which were promptly answered not long after. Yes, everything was made clear, and what we were given from the story of the first 4 episodes of Grisaia no Rakuen was absolute perfection in what we needed to know. And, really, that's all there is to say about it. It was simply amazing.\\n\\n\r\nAnd then, we get to the sequel... episodes 5-10.\\n\\n\r\nGiven what I said prior about Grisaia no Rakuen and the entire aspect of \"mindless fun,\" it's a bit of a given that the story aspect of the series won't necessarily be the most prevalent throughout it. And, for the most part, that's true.\\n\\n\r\nWhat is most prevalent, however, is something that can be considered even BETTER than just a simple story.\\n\\n\r\nWhile elements of storytelling remain throughout everything that happens, and not a SINGLE thing happens without playing a part to the main story line (no matter how big or small), what we take from most of what happens is everything but a super developed story. And honestly, that's perfectly fine. No complaints here.\\n\\n\r\nWe're given information of a certain enemy appearing at a certain place at a certain time, and that he needs to be taken out. Simple enough, right? Sounds pretty common for a series like this. So what we're given to do just that, is a 15 year old loli girl being given a pink sniper rifle that's just as tall as her.\\n\\n\r\nDid you just drop gas bombs onto the streets of an urban city? Are alive enemies that need to be taken down lurking through the gas? Just give a pink-haired maid a gas mask and two knives. I mean c'mon, it's first grade, isn't it?!\\n\\n\r\nJust in-case it hasn't been made obvious, Grisaia no Rakuen is extremely larger-than-life, absurd, and just plain nonsensical (at least the sequel portion of episodes 5-10). Like really, almost nothing makes real sense... but at the same time, it does.\\n\\n\r\nNow, what do I mean by that? Think about it this way: bad things happen, and things need to be done ASAP to fix them/prevent them from being worse. Those things are the solutions. What's absurd isn't necessarily the situations, or the things happening, or any other thing that plays towards the aspect of battle. What's absurd is the solutions.\\n\\n\r\nThese solutions are things like detecting an enemy riding up the side of a mountain. Instead of just trying to block him off on the mountain, why not just fly a chopper with machine-gun-turret equipped over the mountain and shoot straight at the mountain with it? Do you see what I mean by absurd and nonsensical?\\n\\n\r\nAnd yet, they just seem to work so well. While I'm not going to say this style of writing is the most perfect thing ever, it's kind of the optimal way to do things with a series like this. After all the crazy, borderline-supernatural things that have happened, something like this seems to just be called-for... none of it really feels out of place.\\n\\n\r\nNow, does \"it works for the series and doesn't feel out of place\" make a good reason for giving the story aspect of this series a 9/10? No, not at all. That only has to do with a small part of what makes a story good. The rest has to do with the extreme awesomeness that exists within this series.\\n\\n\r\nThe brilliantly well-thought-out psychological scenes, the erection-throbbing action, and the absolutely emotional scenes of attachment are what make Grisaia no Rakuen as amazing as it is. These things aren't really meant to be described here in the story portion of this review, but I'll go over them briefly.\\n\\n\r\n1. Amazing antagonist introduced.\\n\r\n2. Incredible plot twists (this could be explained, but impossible to do so without spoiling).\\n\r\n3. Well-written characters EVERYWHERE.\\n\r\n4. Everything just feels so amazing. Hard to get a feeling like this from anywhere else.\\n\r\n5. All looks and sounds amazing.\\n\\n\\n\\n\r\nCharacter:\\n\\n\r\nNow, let's start to explain the things that make Grisaia no Rakuen as amazing as it is.\\n\\n\r\nIf you were like me, you didn't specifically like the characters of any girl that was part of Yuuji's harem in Grisaia no Kajitsu... you only really liked their stories or what we learned from them.\\n\\n\r\nThis was, almost completely, fixed in Grisaia no Rakuen.\\n\\n\r\nWhat were originally really annoying and slightly one-dimensional \"SUPAH CUTE!!\" harem girls in Kajitsu, turned a total 180 and turned into pretty dang good characters in Rakuen. While I won't say that any of their personalities changed, it was more the lack of extreme attention put onto them and the WAYS their personalities were used that made them as amazing as they were.\\n\\n\r\nYou see, I didn't necessarily think any girl was THAT bad in Kajitsu. What I thought made them as annoying as they were was the plain and simple fact that they were given too much attention, and used in ways that made people think that they were meant to be seen as the most important people ever. When it's proven that that isn't the way they're meant to be seen in Rakuen, they almost instantly become great characters that are extremely hard not to like in some way.\\n\\n\r\nWhat if I were to tell you, these characters are a lot different than you most likely thought they were after watching Kajitsu? If that got your attention at all, you'll definitely enjoy watching Grisaia no Rakuen.\\n\\n\r\nThough, that isn't to say why I gave the characters of Grisia no Rakuen the score I did. It wasn't quite that simple, nor that effective.\\n\\n\r\nGrisaia no Meikyuu introduced Asako, and she became such a great character within Rakuen once we learned who she really was. She was one addition that I truly thought was perfect, and the emotional value we, as viewers, placed on her after the short time we saw here was just great, and I have to hand it to the writers for being able to do something like that. Honestly, Asako may have been my favorite side character from the entire series if it weren't for one other character in specific.\\n\\n\r\nThere was only really one other \"introduction\" of a new character in this series, and not really one I'd really call much of a true introduction (hence the quotes). Despite that character being, without a doubt, my favorite character in the entire series (and even my 2nd favorite character of ALL TIME), they're a character that I can't talk about at all without giving spoilers. So, please remember the name \"Thanatos,\" and enjoy watching the series.\\n\\n\r\nDespite liking that certain character I mentioned above more than him, Yuuji Kazami was without a doubt the most developed character in this series. It can be said, without difficulty, that he's the most well-written harem protagonist of all time.\\n\\n\r\nSpeaking of harem, the entire Grisaia series is a very interesting take on the aspect of harems. While it can be said, without a single doubt, that he Grisaia series fulfills everything that's required to be a harem, it has a very interesting take on it. The girls are constantly in battle over who will win over Yuuji, but it's not the focal point of the series, and many other things are paid more attention to than that. Just wanted to mention that, to anyone who might be turned off by the fact that it's tagged as a harem.\\n\\n\r\nWell, really, nothing else can be said about the characters. Development is off the charts for Yuuji, and a specific side character is heart-stoppingly amazing, with the rest of the harem being great as well. I give this a 10 for being perfect in every regard that I could ever ask for.\\n\\n\\n\\n\r\nAnimation and Sound:\\n\\n\r\nThis won't take a while, since there isn't really a lot to say.\\n\\n\r\nWhile it was still animated really well, Grisaia no Kajitsu didn't have a lot to animate due to the fact that nothing really required an extremely high budget. For the most part, Kajitsu was a pretty still series that just looked well-done for what it was.\\n\\n\r\nThat wasn't necessarily the truth for Rakuen, however. Rakuen was flooded with different action scenes, and a lot of \"gotta go fast!\" scenes that required detailed animation (commonly referred to as \"sakuga\"). And yet, the animation received NO sudden decline in quality... it remained amazing for the entire duration of the series, and man, did it look good.\\n\\n\r\nThe action scenes were absolutely flawless. The sakuga was a little overused at times, but still looked amazing each time. The battles were so intense, and the incredible artwork just made it so much more engaging. And, like with Kajitsu, the still scenes also looked amazing. There was absolutely no decline in quality at any moment within the series, which was incredibly surprising. Completely deserving of a 10.\\n\\n\r\nThe soundtrack was also quite great as well. Usually, I don't place much of a high value in an anime's soundtrack, since it's not something that I really think about beyond watching the series. And usually, soundtracks are done well enough to get by anyways, so there's not a whole lot that's needed to be thought about deeply.\\n\\n\r\nIn short, the soundtrack of Grisaia no Rakuen does its job without being completely outstanding. It's deserving of a 9 just because of that, since a bad soundtrack doesn't really exist in modern anime and thus soundtracks kinda \"should\" be overrated.\\n\\n\\n\\n\r\nOverview and Final Thoughts:\\n\\n\r\nGrisaia no Rakuen is a treat. That's all I really need to say.\\n\\n\r\nWhat can come off as a huge load of absurd crap ends up being one of the most fulfilling experiences ever, and it's just SO amazing. What you'll get out of Grisaia no Rakuen is a nearly unmatched experience of absolute blood-pumping action alongside emotional sub plots and incredible character writing. It's just simply an amazing series.\\n\\n\r\nWhile I don't find it to be the most perfect thing ever, it actually is in some regards. Some things about this series are just simply unmatched, and the most perfect example of that thing that's ever been seen in anime thus far.\\n\\n\r\nWhile there are times where the quality of the writing seems to dip, and ends up being a little too dumb, the overall product of this amazing series is exactly as I just said, amazing.\\n\\n\r\nStory: Given that I try to combine the aspects of the above-average story with the amazing absurd fun, I give the story a 9.\\n\r\nCharacter: Pure amazing development, writing, and the changes some characters were given was just perfect. Definitely a 10.\\n\r\nArt: Perfect. Nothing more needs to be said. Easy 10.\\n\r\nSound: I overrate soundtracks because not a lot comes from them. Grisaia no Rakuen's does its job and thus deserves a 9.\\n\r\nOverall score for Grisaia no Rakuen: 9.5/10, rounded up to a 10 for this review.\\n\\n\r\nWho would I recommend this series to: Anyone who's seen Grisaia no Kajitsu. If that was your intent of coming to this review, the answer is yes, Grisaia no Rakuen IS DEFINITELY WORTH WATCHING!\\n\r\nOtherwise, given that Grisaia no Kajitsu wasn't very good, it's really hard to recommend the entire series to someone. But, if you understand, even for a second, my burning passion for Rakuen, then that should be enough to persuade you to watch the entire series, starting from Kajitsu.\\n\\n\r\nRakuen is a treat, and should be experienced by most people, if not everyone, just because of that.\\n\\n\\n\\n\r\nThank you for reading my review! I hope you guys enjoyed it!! See ya next time!!!\\n\\n\r\n<3\\n\\n\r\n- Alne",
            "date": "2015-06-21T13:53:00+00:00",
            "helpful_count": 243,
            "mal_id": 190846,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4193331.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Prince_Altoid",
                "username": "Prince_Altoid"
            },
            "url": "https://myanimelist.net/reviews.php?id=190846"
        },
        {
            "content": "“Rushed”. “Butchered”. “Unintentional comedy”. “Inevitably lacking development”. “Extremely poor adaption”. Even as an anime-only watcher of this franchise, I could not disagree with the heavy bombardment of VN readers’ harsh criticism and saltiness as Grisaia no Kajitsu emerged as yet another victim in the modern anime industry of being a one cour anime, instead of two. Despite the redemption given by Angelic Howl and personally enjoying Kajitsu a lot myself overall, the fact remains the first half of Grisaia no Kajitsu has deterred the anime-only watchers by portraying itself as a mediocre harem , and to put it mildly, not meeting the bare minimum standardVN readers expected from the adaption for being a poorly paced anime.\\n\\n\r\nFast forward to 2015, 8bit has further damaged its reputation (did it even have any in the first place?) by producing, in my opinion, a complete garbage of an anime called Absolute Duo (please forgive me for steering off the topic, but I did not like that season very much) and in a season with highly anticipated giant titles such as Yahari Zoku, UBW, Shokugeki no Soma, Gintama, and Danmachi added with the number of discouraged droppers from the earlier episodes, the prospect of the Grisaia sequels, Meikyuu and Rakuen, has been overshadowed and dwarfed out. However, in spite of the strong competition offered by Spring 2015 season, many people will find it pleasant to know that this time it is not prone to a rushed and butchered adaption with amazingly confusing plot with lack of development as Grisaia no Rakuen has rose up to be a lucky find and possibly one of the strongest anime of the season.\\n\\n\r\nGrisaia no Rakuen is a direct continuation to Grisaia no Meikyuu, a short movie OVA depicting Yuuji’s past, where “tragic and traumatic” to describe it would be the understatement of the decade. Therefore I cannot stress enough to say not only watch that before this, but also in case there are people who are tempted and considering to skip Kajitsu due to its score difference, it is unquestionably compulsory to watch it for the understanding of this sequel (or just read the VN, as the readers would say). \\n\\n\r\nAnd by direct continuation, I do mean straight away from Meikyuu as if that was the prologue to the first episode as the girls of the Mihama Academy continue to learn more about Yuuji’s past through a document. Yuuji’s frightening past continues as his story transitions from being raised as a child assassin, to being raised by his mentor who he respects very highly. This arc known as “Cocoon of Caprice” further continues to portray Yuuji’s life in a military academy as he creates bonds and overcome his own psychological weakness which will be explained more in the later paragraph. The second arc known as “The Seed of Blanc Aile” returns to the present time which is where the meat of the anime is, with the spotlight returning to the original cast of the Mihama Academy and ultimately, the matter between Yuuji and his past is settled so that he can return to his academy or rather, his family. \\n\\n\r\nThis is where the most major difference between Kajitsu and Rakuen comes up. In first half of Kajitsu each girls are only given two episodes to develop with Yuuji helping them ultimately out of distress, which not only lacks the sufficient amount of character interaction and development required due to its poor pacing, but also quickly becomes formulaic, repetitive, and dull. However in Rakuen, the story progresses linearly as a single route in a solid manner while seeming like a natural, realistic story and thanks to much lower amount of content to cram into small number of episodes, the story is immune from the confusion and it is made much easier to understand.\\n\r\nWhat I and probably many other people also loved about Grisaia no Rakuen was how it diverges from a harem setting in a school environment with subtle amount of darkness enough to disguise, which dissuaded many people to drop Kajitsu early on - to a breathtaking, eye-catching thriller from a military setting Yuuji experienced in and where the girls of the Mihama academy becomes involved in intelligence and reconnaissance and putting their specialization to use. \\n\\n\r\nApart from plot, Grisaia no Rakuen also shined very strongly in the department of character development especially in the first half of the anime. Yuuji’s backstory and emotional development as mentioned earlier has been crucial in this anime as unlike Kajitsu which portrays him as a flawless, robotic human being who somehow specializes in rescuing a damsel in distress every two episodes. In Rakuen however, despite his background as a raised cold-blooded killing machine, Yuuji can be shown to empathize through his representation of his trauma and how he overcomes it and also through his interaction with rest of the cast, especially Asako. His psychological weakness of being traumatized of killing any life form has been a key plot point to this season. And of course, who cannot love his witty, sarcastic sense of humour while putting on his iconic poker face? I also want to add he is probably one of the few harem leads out there who is not just bearable, but so likeable.\\n\\n\r\nSpeaking of Asako, her role as Yuuji’s mentor has been crucial to the character development and process of maturity on Yuuji and through his interaction with her and her assertive, confident approach to her philosophy, it is obvious why Yuuji has deep respect for her not only as a soldier and an instructor, but possibly also as an older sister model. His relationship with JB is further explored as well, as she is not merely his superior at work who constantly amusingly irritate and tease at each other, but she is also there to emotionally comfort and support Yuuji whenever she is needed.\\n\\n\r\nWith the military academy setting mentioned earlier, there has also been very nice addition to the mixture who have provided enjoyable interactions with Yuuji illustrating the bond he has made during his gaining of military experience, while they also become necessary and relevant in the later episodes. Although there have been several new likeable introductions, the most notable ones are Miliela Stanfield, who becomes slowly attached to Yuuji as a comrade, nicknaming him “Genie”, and Robbie aka James Okada, his weeaboo characteristic and imouto fetish being the running joke. \\n\\n\r\nDespite the girls of Mihama Academy not receiving as much development as Yuuji and his peers did as unfortunately that was Kajitsu’s job which it unfortunately failed at, they have also been given a spotlight to stand on as well as “The Seed of Blanc Aile”, or where the “real fun” starts to return to the present time. Though too much details would end up as a spoiler, from Makina being an awesome loli sniper, to Sachi being Crappy Maid, to Yumiko being the rational and logical strategist, to Michiru being… Michiru (^_^), this season yet again reminded me how the diverse, yet abnormal personalities of the girls and their wacky, comical interaction have been pivotal to the entertainment level of this franchise.\\n\\n\r\nAlthough the production value is probably not the best you will ever see, there are some aspects to praise. Though background and animation is pretty much the standard you would see in any other anime, the contrast of brightness and dark, bold linings on characters and the details on their faces in general captures the tone of the series well while representing as an unorthodox harem that would not be seen very often.\\n\\n\r\nI have also found the opening and endings very enjoyable as the catchy electronic rhythm of the opening and first ending are complimented well with the panning of the important characters and settings, which I found it as amazingly enjoyable set of animation and direction. First ending especially represents Yuuji’s past very well and how Yuuji still has a conflict unresolved from the past, with the characters important to him appearing in it. Musically, I like the second ending more as it foreshadows the epilogue of the Grisaia franchise, which may represent Yuuji’s will to return safely to his “Eden”, where his family waits for him. \\n\\n\r\nI may be underappreciating the soundtrack and even though I did not find them VERY noticeable, there have been noteworthy usage of violin and piano during dramatic and emotional scenes, and in many dialogue scenes in general which I find it to be very powerful and complimenting well with the scenes, while in the later episodes during dark and mysterious scenes there have been an ominous tones and using electronic guitar very well during climax and action scenes to emphasize on its upbeat and dynamic tone. And of course, Grisaia no Rakuen would not have been nowhere near enjoyable without the appropriate voice acting for each distinct personality and proper use of sound effect in the action scenes.\\n\\n\r\nAs for personal enjoyment, to put it into context:\\n\\n\r\n-Grisaia no Kajitsu was my third WEAKEST anime of Fall 2014 after Sora no Method and Trinity Seven (to be fair that was an extremely strong season as well)\\n\\n\r\n-Grisaia no Rakuen was my third FAVOURITE of the season after Yahari Zoku and UBW and equal to Shokugeki no Soma. It was as if it is a complete different anime from the first season\\n\\n\r\n-I would put the eighth episode as one of the best episode of the season, on par with Danmachi 08, Hibike! Euphonium 08, and few of the Yahari Zoku episodes\\n\\n\r\nAlthough this quickly became a comparative piece between first and second season, through this review I hope I have illustrated its vast difference with the first season very clearly and why it is definitely more enjoyable. As an anime-only viewer, even though I had the confidence Grisaia sequels to be better paced and plot to be more interesting than Kajitsu due to the short teaser at the end of Kajitsu, I have been blown away by the amount of enjoyment and thrill I have perceived from this series and it really makes me glad I did not drop Kajitsu halfway through when my opinion of it was at its lowest. \\n\\n\r\nTherefore I plead and implore not just the VN readers disappointed, discouraged, dissuaded by the unacceptably handled adaption, but also the anime-only viewers who initially dismissed as a mediocre, clichéd harem in a school setting disguised as a dark psychological anime to reconsider picking up Grisaia no Kajitsu (or pick up directly from Meikyuu or Angelic Howl to the VN readers), as this hidden gem is too great to be forgotten and thrown back into obscurity. The miniscule amount of people anticipating and giving attention before it aired was disheartening to see, and in fact it still is not the most watched either as, at the time of writing this review, it is out of Top 1000 in the popularity rankings.\\n\\n\r\nFrom a harem in an eccentric and unusual setting, to amazing character development and likeable cast, to perfect pacing, to overwhelmingly over-the-top action, every second of the anime surprisingly impressed me with the entertainment level it has offered me and I don’t know why it would not be the same to other anime-only viewers.\\n",
            "date": "2015-06-21T20:42:00+00:00",
            "helpful_count": 93,
            "mal_id": 190886,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441915.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/peacefulkorean",
                "username": "peacefulkorean"
            },
            "url": "https://myanimelist.net/reviews.php?id=190886"
        },
        {
            "content": "Grisaia no Rakuen can basically be summarized like this:\r\nDoes it make any sense? Not really.\r\nDoes it matter? No, because you're having way too much fun watching it to really give a damn.\r\nAlthough the anime version of Grisaia no Kajitsu remains one of the worst adaptations I've ever seen in my life, Rakuen on the other hand is one of the very best ones. The difference in level of faithfulness to their respective visual novels is so unbelievably big that I don't even know how to put it into words. The pacing is solid, the production value is great and very little noteworthy content is leftout. Overall, it's a brilliant adaptation from start to finish.\\n\\n\r\nThe anime can be divided into two parts. Episodes 0-4 (yes, zero; don't miss the double-length special episode, it's mandatory) cover the Grisaia no Meikyuu visual novel and takes place almost entirely as a prequel story about Yuuji's past. It is a quite dark and depressive tale containing physical abuse, rape and death among other things. It is one of the most serious parts of the Grisaia trilogy, and it gives you an excellent insight into Yuuji as a character. You'll realize that he is quite likely the most in-depth harem protagonist ever written when all is said and done.\\n\\n\r\nAfter that, episodes 5-10 instead cover the Grisaia no Rakuen visual novel, which in contrast to the rest of the series is one of the most exaggerated, absurd and just plain ridiculous stories that I've ever had the pleasure of reading, but it's also those same exact reasons that make it so incredibly entertaining. It is effectively the inverse of Kajitsu, as the original story is about Yuuji having to save all the girls, whereas Rakuen is about the girls having to save him in return. Now that may just sound like more of the same, but I kid you not when I say that Rakuen is *completely* different. It's essentially a different genre altogether. Rakuen almost feels like a Hollywood action film, containing logic-defying car jumps, helicopter chases, submarines and pink .50 caliber sniper rifles, as well as some highly questionable sci-fi elements such as human-computer integration and cloning technology. If Mission: Impossible was an anime, this would be it. All-in-all it's an absolute nutcase of a storyline, but it's so much fun that despite its absurdity everything just ends up feeling awesome to watch. There are countless points throughout the anime where you'll find the flow of events being blatantly illogical, but it won't make you feel annoyed. Instead it'll just make you laugh and/or feel excited for what curveball the anime is going to throw at you next. Another boon with this is that the nonsensical story turns out incredibly unpredictable since literally *anything* can happen in it, no matter how unlikely it may be. And as the cherry on top, Rakuen also has one of the most ridiculous and far-fetched endings in anime history, but given the progression of the story... dammit it just feels so *right* somehow.\\n\\n\r\nAs far as the characters go... I'll just say this: taking the entire series into account, the character cast of the Grisaia trilogy is and always has been my number one favorite one of all time. No exaggeration. Seriously, Yuuji is arguably the best harem protag ever, at least in terms of writing and persona, and after you've seen his backstory you might also argue that he's perhaps the only one who legitimately *deserves* to have his harem already. And the girls... they just have so much charisma, all of them. How could you not love them? Makina has one of the most outstanding personalities and speech patterns you'll ever find, Amane is like a mother to everyone else, Sachi is the most badass maid of all time, Yumiko is a natural-born commander, Michiru just has waifu tier written all over her and Kazuki is without a doubt my favorite Onee-chan character ever. Even the side characters like Asako, JB and some others are quite spectacular by themselves. \\n\\n\r\nThe animation is as good as it ever was (the only part which even Kajitsu's adaptation got right after all), but the soundtrack of Rakuen is just plain better all-round. It's upbeat and energizing, and has numerous memorable instrumental tunes containing lots of violins combined with fast-paced music. The anime's opening theme is also fantastic, albeit not quite as legendary as Rakuen's visual novel opening (seriously go YouTube it if you haven't, it's amazing).\\n\\n\r\nAnyway, overall what you have is a story which I highly recommend you to not take too seriously. Or rather you can take it seriously, but only up until Rakuen starts (episode 5) because from there on out it's a joyride of insanity all the way to the end. If you try to make a detailed analysis of the story as a whole, then what you have is a plot with more holes than a golf ball... in other words; don't try to analyze it. You'll be the only one who'll suffer from it. Instead, just lean back and tag along for the ride, and you're in for a ton of fun.\\n\\n\\n\r\nNow if only all visual novel adaptations could be this good..................... and yes I'm still looking at you Kajitsu...",
            "date": "2015-06-21T10:52:00+00:00",
            "helpful_count": 79,
            "mal_id": 190835,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=190835"
        },
        {
            "content": "By this point, any of fan of the Grisaia should know firsthand the thrill of the experience. Unlike most harems, Grisaia focuses a bit more on story elements rather than just purely to get into the main guy’s pants. As the third and final season of the Grisaia trilogy, it’s important to understand how this series operates. Grisaia no Rakuen is meant to be completed after the first season (Grisaia no Kaijutsu) and the 1-hour special feature, Grisaia no Meikyuu. From those episodes, you will learn much more about the characters as well as our main lead man, Yuuji Kazami. The catch now is thathe is labeled as a terrorist and it’s up the girls to save her. A dangerous journey of cat and mouse, Grisaia no Rakuen (The Eden of Grisaia) exploits military ethnics and psychological ploys that is able to equally adept with action while building on the story.\\n\\n\r\nI have not played the visual novel, but the series should be easily be understandable as long as you’ve seen the previous season and the special, Grisaia no Meikyuu. The first few episodes shows more of Yuuji’s past life and his role in the military. We already learn about the dark tragedies he has suffered in his past but now, we really get to see a close glimpse of what it’s like. It’s not a pretty picture to think about but at the same time, it’s important to see the events that made him become the person he is today. Yuuji is indeed a complex person and the time he has spent in military has caused him to develop traits that he carries on later in life. One of the most important characters in his life is a woman named Asako, who trained him after his parents’ tragic death. Their relationship can be described as a sort of master/apprentice/guardianship/lover all at once. His relationship with his sister, Kazuki is also very important as she seems to be only other close person in his life. Regardless, the present Yuuji shows a sharp contrast prior to his parents’ deaths. Previously, Yuuji was more of a coward and often did whatever others asked him to. Now, he adapted a more sarcastic sense of humor with cold calculating behavior (especially during missions). Despite not being a cold blooded killer, Yuuji does not hesitate to eliminate others when the time comes. And that’s really makes Yuuji quite an interesting character to understand. No one will probably know the real him though.\\n\\n\r\nThe other parts of the season involves a recuse operation involving the girls from Mihama Academy. A tricky part to execute this section of the plot is how to get all of them together. Essentially, the series shows that they have little clue to help him until they receive the help of an unlikely ally. This is where the mystery of the show comes as this particular character will seem to be very familiar to any fans who watched the franchise. Transitions during these episodes are good and makes its purpose fruitful to answer our viewers’ questions. And while the gimmick of a supercomputer operative may seem like a trick from the old book, it pulls successfully with a blend between humor, creativity, and trust. In retrospect, the second half of the series becomes a thrilling cat and mouse game. Unlike the first season where Yuuji helps the main female leads one by one, Grisaia no Rakuen involves them helping him. Every main female character participates in some sort of role that collectively has the same purpose – to save Yuuji. To skillfully do this, the show delivers action, drama, humor, chases, and mind games. One thing I do frown on sometimes is the humor that practically seeks to advertise attention with its characters. While it’s good for some fun, it quickly gets old. Thankfully, the psychological aspect makes up for this.\\n\\n\r\nI’d think to Grisaia no Rakuen as a combination of action and psychological flick that embraces human emotions. A downside about the season may be the main antagonists. There’s little emphasis on them and their main boss, Heath Oslo hardly has a personality that is explored; we do see that in the special though. Instead, this season barely puts emphasis on them as well his goons. There’s also some mystery regarding their true purpose although by the buildup of many events, it probably won’t look pretty. The plus side however is that the show manages to capture spectacular action features. All sorts of weapons are involved ranging from guns, sniper rifles, helicopters, and hellfire missiles. The show also captures the thrill of a full throttle chase that really is worth waiting for after all the necessary buildup. In retrospect, this season is able to keep its audience at its feet and always wonder what may happen next. Plot twists can be unpredictable including those that gets involved or anything that can happen along the way.\\n\\n\r\nIn retrospect, the artwork and soundtrack is standard to the franchise. It doesn’t change much except for the OP and ED theme songs with its many foreshadowing, metaphor, and symbolisms. However, I have to give praise to the well-directed choreography. It lives up to the promise of the thrill and each episode builds more on that until that climatic moment. Character designs also runs fluid with many of the female characters dressed in their casual attire (except for Sachi in her maid attire). Fan service is still present although is hardly distracting in most cases. Finally, I have to give some praise to Kazuki’s presence in this season. Her ability to command attention through her voice is a highlight and offers that impressive smart package the audience deserves to see.\\n\\n\r\nSurprisingly, Grisaia no Rakuen is actually a pretty fun show to choose if you want some thrilling action and dark storytelling. Rather than repeating some of the mistakes from the first season, the show plays with a lot of its themes and transforms into a product that is grappling. It’s a worthy successor with the style of the story building and characterization. And while some characters doesn’t shine as much as the others, it can appealing to see their roles. It can even make the audience feel jittery at times with this season’s surprising elements. Now, don’t go into this season expecting a blooming romance. In fact, Grisaia hardly can pull off a genuine romance on-screen despite its attempts to do so in the past. Instead, experience sensational feel with the flow of this season’s story as it pulls of its daring risks.",
            "date": "2015-06-21T10:54:00+00:00",
            "helpful_count": 57,
            "mal_id": 190836,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=190836"
        },
        {
            "content": "8bit, the studio who half-assed Grisaia no Kajitsu into a 13 episodes.  The good news is they do not repeat the same mistakes. In 10 episodes they turn it into diamond, shining and bright. Everyone rejoice! Because this sequel would really change your mind about this series. It's exceeded all estimate that exist. \r\nThe sequel of Grisaia no Kajitsu started right after Grisaia no Meikyuu, one of the best thing that Rakuen ever offer it's the main character development.\r\nAt the early episode we can see that the protagonist's past described very well, the feeling and the drama tension can feel deep into your bones.Rakuen tell all the development that required for Kazami Yuuji. The series told Yuuji's past time and many things that didn't exist in it's prequel. Like a rainbow, the character development really prove something well. The development itself it's not shallow like they do in Kajitsu, it's well depth and understandable.\\n\\n\r\nWhile Rakuen succeed in the character development, the story itself got some admire.\\n\r\nRakuen story may be described as \"rare breed harem\". The story pacing it's still unstable, but the audience can still keep up with the story. It is not rushed, but balance and good. The story focused in one linear, which make it more understandable than the 1st season, unlike many harems that didn't notice in developments and story, Grisaia no Rakuen surely shocked all of it's viewers.\\n\\n\r\nWhile the animation we saw are one of the most standard.  We have beautiful environment, colorful characters, explosions, and many other good thing. While the voice actors it's pretty decent, the \\n\\n\r\nAnother good thing is the enjoyment of the series, the excitement it's really beyond the boundary. All of those elements packed together created a massive enjoyment in my personal thought. \\n\\n\r\nJust like a puzzle, when everything collected they will form something beautiful, from wrecked up harem shows, it become one unit of exhilarating story that succeed both in entertaining us and storytelling. Anyone who disappointed by the 1st season should watch this diamond, it is really a good experience indeed.",
            "date": "2015-07-12T03:32:00+00:00",
            "helpful_count": 34,
            "mal_id": 193182,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=193182"
        },
        {
            "content": "Grisaia as a series has an interesting tone going for it.  Placed in a rather unusual setting for a harem anime with a very different kind of protagonist in comparison to the generic harem MC's that we are all aware of, Grisaia managed to pull off a somewhat negligible adaptation for its first season which as a result got some mixed feedback.  So, as the second season, Grisaia no Rakuen, what kind of story awaits us here?\r\nStory (7.00/10): Continuing off of Meikyuu, the 1 hour OVA that came after the first season Kajitsu, we return back to the world of Grisaia back tothe place where the five girls harem girls of the series, Amane, Makina, Michiru, Yumiko, and Sachi recover Yuuji's shredded documents and stick them back together so that we can finally, after an entire season of the anime (and one OVA), learn the complete story of who Kazami Yuuji's is.  (Since Meikyuu not covered about half of his whole backstory.)\\n\\n\r\nSimilarly to its predecessor, Rakuen follows the same kind of storytelling that Kajitsu utilized, which was a method of storytelling that involved the use of a character arcs that ran over a long period of time.  Like its first season, Rakuen uses ths style once again, but rather than squeezing five complete stories like last time (which was a reason why Kajitsu had its downfall), Rakuen features only two of these arcs spread over its ten episode runtime.  \\n\\n\r\nOne of the biggest things that makes Rakuen I feel a whole lot more successful is that it utilized it's time a little bit better.  By having only two arcs of storytelling, the anime itself was able to focus a lot better on what it wanted to deliver, giving us for the first arc, a more cohesive and overall better details and storytelling that made it a lot better of a watch.  It finished up the tale of who Kazami Yuuji's as and what kinds of events led him up to the point we see him in now, which is a great positive for the series.  The second half though...not so much.\\n\\n\r\nThe second half of Rakuen is where the show hits a bit of a slippery slope.  Following in a more present day situation rather than a flashback, the second half is...lacking to put it mildly.  The biggest issue I have with this is the fact that the show really rushed to try and finish the story in its ten episode runtime.  To my knowledge, ten episodes for anime is quite a danger for a story-based show, as the short runtime results in lacking details that in the end, don't make the best shows.  Sadly, for Rakuen, this was the case.  For the latter half, it put together this long and convoluted plotline that I think really could've used a little bit more time to fully explain.  Because of the short runtime, it lacked details such as the villain's exact plan, character motivations, and characters explanation overall, because honey, a short monologue to explain who you are is not enough for me to know or care about your existence.\\n\\n\r\nOverall, I would say that Rakuen did a little bit better than Kajitsu did, but it still had some similar problems.  While giving us some character explanation for our main protagonist, it suffered by not being able to fully give us that same kind of detail all the way through, leading to s climax and an ending that kinda felt...anticlimactic.  A happy ending's nice and all, but...eh, could've been a bit more dramatic or done something a little more tragic given how thick our MC's plot armor is.\\n\\n\r\nOverview:\\n\r\n+ Character explanation for our MC\\n\r\n+ Pretty good first half\\n\r\n-  Lacking second half\\n\r\n-  Plot holes (and character convenience, cause that whole operation done by the girls was awesome, but complete bullshit)\\n\\n\r\nCharacters (7.33/10):  In terms of cast changes, Rakuen for the most part doesn't make an absurd amount of cast differences except one.  But aside from that one increase of main cast, there's really no difference in the numbers.\\n\\n\r\nKazami Yuuji's.  As our main protagonist, Yuuji is Grisaia has historically been very different from your average harem MC.  He doesn't fluster at the sight of a girl, he's actually quite expressionless, and he knows how to be a proper badass when he wants to be one.  As I have stated before, Rakuen makes note of what was missing in Grisaia back in Kajitsu, which we giving an explanation as to who and what Kazami Yuuji was.  Meikyuu gave us a good chunk of his backstory, but his whole story comes full circle and finished once we get to here, giving our MC here a great explanation as to what kind of life he had before coming to Mihama Academy, and giving us look further into his growth as a person next to Asako.  You can really see the growth in Yuuji during this flashback arc in the first half, and I think that part really set it apart from the rest of the Grisaia series.\\n\\n\r\nAfter that, we have Asako, Yuuji's guardian after the events that happened back in Meikyuu.  Asako is a very rough woman, as you can say.  Giving a very stern style of raising to Yuuji and giving him instruction and lessons on how to be a soldier, Asako was a very crucial part of Yuuji and provided him with lessons that really grew his character.  (Also, she kinda swiped his V card when he was like 14, so...I don't know how to feel about her character in that aspect.). Really though, Asako mainly serves as a plot device in the series, giving Yuuji the words of inspiration that help morph and shape into the character he is today.  This is no means a bad thing since it was clear from the very beginning that that was the role that she was going to play.\\n\\n\r\nAnd then we have the previous important characters in the series, the five girls of Mihama academy.  Even though they'd are considered to be main characters, for Rakuen...that simply isn't the case.  Because the show is so centrally focused on Yuuji and his past, present, and future, the girls in Rakuen really serve more as plot devices or characters that help move the story along more than anything.  Because Yuuji helped them with their personal problems, they in turn do the same thing back to Yuuji because they love him, blah blah blah, you get the idea.  The main issue I have with this is the fact that same as with Kajitsu, not all of the girls get treated with the same amount of importance.  (Before, it was just the amount of episodes they get to tell their story.  Now it's just actual involvement in the story to begin with.  Poor Michiru...). This bugs me a little bit because generally in a harem show, it's the girls that we care more about, so it was a bit sad to see most of the essential characters just get shelved off to something equivalent to a supporting role.  \\n\\n\r\nThat reminds me, supporting characters.  Supporting cast in Rakuen does what you sort of expect them to be, plot devices.  With a good number of supporting cast facing a similar fate as the main girls in the series did (ie, help Yuuji because he scratched their backs, now they scratch his), a lot of them aren't really as developed, especially the ones that we see that weren't involved with the first season.  The ones that were in the first season can stand on their own because they have some decent background from before to really help them, but for the ones that weren't, it's hard for them to stack up in any way, shape, or form.  Another thing I have a problem with in the supporting cast are the villains.  The antagonists in Rakuen are horribly underdeveloped, given motives that really don't make sense on account of the poor storytelling in the second half of the story's, leading to some really unexplained villain plans, and a bit of a lame ending because I really have no idea what exactly the guy was planning to do with Yuuji, even after having seen everything the Grisaia series had to offer.\\n\\n\r\nOverview:\\n\r\n+ Great character development for the MC\\n\r\n+ Good supporting character to help with said development\\n\r\n-  Other characters that crossed over are disappointingly shelved\\n\r\n-  New side cast is mostly plot related with no way to stand out on their own.\\n\\n\r\nArt and Sound (7.44/10 and 6.88/10):  Produced by 8-bit, Rakuen returns back to the general Grisaia style of animation with really no change in the way the animation actually looks.  It still uses the same style of neon bright colors for the color palette with a horror/dreadful feel to it, and because it's consistent with the quality as it did with Meikyuu and Kajitsu, there's not really much else to say. \\n\\n\r\nHowever, the show does go a little bit...farther with how exposed some of our characters are.  Because Yuuji's history has some...ahem, pleasurable moments, there are a few scenes that involve the aftermath of such an encounter, with the end result of Yuuji butt.  Also, the red hue on the eyelashes of the female characters return, and that's an art design that really bugs me.  It looks like they have a rash above their eyes, and that just looks weird.\\n\\n\r\nIn terms of sound, it sounds very average.  There's not really much to say for the soundtrack because none of it is really all that memorable. I can't really recall much of what the OP or ED actually sounded like because it kinda sounded generic and nothing really all that spectacular.  Is it bad?  No, it's decent.  Is it good?  Not really, pretty average I'd say.  (Although I will give props to the Yuuji childhood progression thing to his gun at the start of the OP.  That I admit was pretty cool.)\\n\\n\r\nOverview\\n\r\n+ Consistent art\\n\r\n- Decent soundtrack, but not all that memorable\\n\\n\r\nPersonal Enjoyment (5.34/10): So, you may ask, why is personal enjoyment so low? Well, to be honest, I hate Grisaia.  I always found the series to be a bit too weird for my taste, and the series itself goes into some pretty intense and uncomfortable themes and actions, which kind of put me off.  Hell, Yuuji is taught how to sleep with a woman at age fourteen or something and then proceeds to commit that kind of act to a woman at least twice as old as him on account of his master telling him to do it.  And that's only in episode two!  What the hell, Grisaia?!  Why I watched it?  My friend suggested it to me and said it was really good.  (I ask him everyday, what the hell is wrong with you cause there is some weird and uncomfortable shit to be seen in this show....)\\n\\n\r\nDid I like this show?\\n\\n\r\nFrom a storytelling aspect, I did.  It gave us a good sense of storytelling, which is always something I enjoy and appreciate whenever I watch an anime.  It gave us a proper explanation as to what kind of life our main protagonist lived before the events of the show began.  But when it comes to the actual story itself though, no...I didn't enjoy what they were showing.  That kind of content is NOT for me.\\n\\n\r\nWhat didn't I like about the show?\\n\\n\r\nThe second half really disappointed me.  When going back to the present, Grisaia didn't really deliver very well on the kind of story that it wanted to present, which really led to Rakuen's downfall in a sense.  The characters were also something that disappointed me since a lot of the labeled \"important characters\" really didn't come around till the end, and their importance even then was average at best.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you're someone looking for a different approach to the harem genre or a story that actually is quite original in every which way, then Grisaia may be the show for you.  It's got quite a bit of originality to it, and the development for the characters isn't all too bad.  Personally though, I'm not a big fan of this series because it touches on a lot of...uncomfortable themes and showcases some pretty fucked up stuff, so if you're fine with that, go ahead.  Just nite that since this is the season that finishes up the whole series, you will have to watch Kajitsu and Meikyuu in that order before getting to Rakuen.\\n\\n\r\nOverall Score: 7.22/10",
            "date": "2015-06-21T17:06:00+00:00",
            "helpful_count": 15,
            "mal_id": 190867,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=190867"
        },
        {
            "content": "Okay... I really liked the first series far more than this.  I tried, repeatedly, to get through episode 5 but just couldn't complete it.  \r\nI'm sorry - but my opinion is different from a good number of solid anime fans - I just did not like this anime.\r\nSo many cliches, annoying over acting loli with a lisp, and a secondary story about how they are going to fund the place which makes absolutely zero sense.\r\nTo me the storyline seemed to slip considerably, in belief and narrative, from the first season.  \r\nThe Art is Very Good.  I have no complaints here.\r\nI alsodon't have any complaints about the Sound.\\n\\n\r\nCharacter?  Well the annoyingly more talking loli (than last season) with the father/daughter complex... makes me want to poke my eardrums with sharp objects.  The rest of the female characters living with the main character became a \"mashup\" and boring to me.\\n\\n\r\nEnjoyment went down the drain for me on the 2nd Season.  \\n\\n\r\nOverall - if you're in for the long haul then go for it.  I've already moved on to greener pastures...\\n\\n",
            "date": "2016-06-03T10:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 219909,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1112169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/thumpz99",
                "username": "thumpz99"
            },
            "url": "https://myanimelist.net/reviews.php?id=219909"
        },
        {
            "content": "The Fruit of Grisaia was not your run of the mill harem, and The Eden of Grisaia continues that proud tradition. Whereas the Fruit of Grisaia focused on how our Sagara Sousuke clone saves a bunch of girls with unique (and sometimes horrific) pasts, the second installment continues from the OVA (The Labyrinth of Grisaia) and explores Yuuji's past and motivations, and perhaps finally brings some closure to the series.\r\nWith the exception of a very few parts, this second installment is much more action-oriented than the previous series. Remember how the first season broke from harem-mode to spend almost three complete episodes on Amane's past?Expect similar things in this season. If you found the last season intriguing, and are keen on learning more about Yuuji, then this is definitely a great watch. If you're looking for something between an action and a harem, with perhaps a darker tonality than your run-of-the-mill action-based ecchi, definitely give this a try. If you hate emotionless, male versions of Ryougi Shiki, steer clear.\\n\\n\r\nAnimation:\\n\r\nThe animation in The Eden of Grisaia maintains all the unique characteristics of the first season, an extremely widescreen format with a rich and diverse color palette and nice shading. Given the nature of the plot, the scenery is a bit different from the previous season with a lot more shifting scenery. Given that most of the girls' character development occurred in the previous season, don't expect as much emotion in general as Yuuji doesn't have much to offer there. There is a bunch of new characters in this season, most of which play minor roles but nonetheless all play a part in the plot. The neko maid was a particularly fun addition (you'll see why).\\n\\n\r\nWhat is lost in emotion is made up and them some in many energetic action scenes and (occasionally) fights. Remember how Yuuji half-heartedly trained Makina with sniping and how Sachi is secretly an explosives expert? Expect the series to fully utilize those skills in this season. There is some gore and blood as with the last season; if you made it mostly unscathed through Amane's arc in the last season you should be good here. I won't say that the action (or physics) is completely realistic, but at least there isn't any reliance on mechs or magic. Given the focus on Yuuji there won't be as much fan service in this season, though you will still find some mature ecchi scenes, similar to what was in the first season.\\n\\n\r\nSound:\\n\r\nThe show starts with a rather fast-paced, pop-based OP that feels rather fitting given how fast the plot moves, though I don't particularly care for the melody. There are two main EDs that go with each arc. The first main ED is a nice, electronic-infused work with a rather good melody, which reminds me of FripSide's work with Railgun. The second main ED is a slightly slower piece that isn't as memorable. Some of the BGM (especially the playful songs) is fairly familiar by now; though nothing was particularly worth collecting, it successfully gives the show a unique feel.\\n\\n\r\nThe original cast returns to give a strong performance in this sequel. The cast grows significantly with a lot of new supporting cast, some of which play pretty significant roles. As with the plot in general, expect the conversation to be a bit on the mature side relative to your standard harem.\\n\\n\r\nStory:\\n\r\nThe story takes a deviation from the character-based arcs in the prequel; it's much more linear here. We last left off with Yuuji, for some reason, explaining his life story to Yuria. The first arc of this season continues where the OVA left off, explaining how Yuuji was re-socialized by his master Asako and how he learned to be useful to society through the armed services. It explains a lot about Yuuji's motivations and how he became such an efficient and cunning killing machine. The second arc sees the return of Heath Oslo, the pedophile and prolific terrorist who wants to reclaim Yuuji. How will the girls return Yuuji's favors in the past season?\\n\\n\r\nExpect quite a few plot twists and cliffhangers in this winding adventure that grows to a literally atomic climax. This is followed by a nice, long conclusive ending.\\n\\n\r\nI found this adaption truly amazing in its ability to connect events and characters. Point to virtually any scene in the prequel, and you'll be able to see the repercussions in the sequel. Almost all of the open questions of the first season were completely dealt with in this season, barring the aforementioned unrealistic physics and what not. It truly is well beyond what I would have expected from an erotic hentai adaption.\\n\\n\r\nCharacter:\\n\r\nNormally I'd condemn the mass-expansion of character but in this case, all the additional characters are prudently added and meticulously used. If you see a new character in the first arc, don't be surprised to see them return later on.\\n\\n\r\nThe focus is squarely on Yuuji this season, and you'll get to see him develop from an emo pile of suicidal massacre to a purpose-driven machine (yes... still rather emotionless) willing to sacrifice everything for the ones he cares about. There is a lot of wit in this show whether it is Asako's off remarks or Kazuki's sly jokes- definitely don't skip the final part of the conclusion. In the latter half, you'll also enjoy more of the original school girls- they're mostly static characters by this point but still quite entertaining.\\n\\n\r\nValue:\\n\r\nMany shows try to attempt something different, and often they give this up and return to well established patterns- especially in sequels. Grisaia is unique in that it sticks with its approach and delivers a truly unique mix of action and harem. Yes, it is a bit dark and yes, the subject is probably more appropriate to those 16+, but it truly is a unique work, and an unexpectedly good one. Re-watch value also exists given the number of connections and foreshadows throughout the show. I highly recommend this sequel for those who enjoyed the original.",
            "date": "2015-11-12T00:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 203213,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203213"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nHmm.. I think here I'll first comment the whole franchise and then move onto this season specific. \r\nSo the plot is pretty much odd people in odd school with odd background living an odd life. As well pimp of a main guy, that's one hell of a harem he has, womanizer to the core. I won't go into detail, but I'm going to mention mixed feelings this franchise gives me. It is somewhat of \"fck yea, Murica\" anime with odd Japanese touch. By that I mean thewhole military life, strong personalities with somewhat loose moral sense. Here I mean sex was something I'm not fond of in this manner that this anime presented. (rather than sacred thing that I consider it is, it was more of western shows \"normal & casual thing, nothing serious\"), but here I should emphasize word \"pseudo\", meaning it still wasn't as west and was more towards purer side as actually most of characters really cared of the guy and so did he. Plus yeah whole military thing I'm not fond/accept either.  First I just hated that whole thing IRL (military/politics) than after certain event in life, it somewhat traumatized me and hate it even more now. Point being, this franchise has aspects I despise IRL, yet somewhat it was presented in a really oddly satisfying way. Thus the reason I can't hate this anime. So anyhow.. moving on to this season specific.\\n\\n\r\nStory\\n\\n\r\nStory continues where it last ended. It was odd and \"pseudo-hollywood\" fun as always. A very unique and odd Anime. For most part I enjoyed it, felt quite good. Probably only minus it gets from me are the personal quirks I hate. Normally it would lower score for me a lot, but this Anime managed to bypass my hate. Must say most things were folded in an acceptable level and probably the \"route/pairing\" was for the most part also understandable which pairing would it gone to.\\n\\n\r\nArt\\n\\n\r\nI don't know whenever its just me or it felt that this season Art/animation was somewhat blander and cheaper looking. Might be possible that I can't remember how it was previously as some time has passed since I watched this franchise. But nevertheless, it didn't feel as impressive.\\n\\n\r\nSound\\n\\n\r\nMost tracks felt interesting and fitting. Maybe not utterly my taste, but felt quite good in here. Music/ost didn't have too much or too little presence, it felt as fitting background music.\\n\\n\r\nCharacter\\n\\n\r\nCast of dramatic past. All of them are somewhat odd, but nevertheless still love most of the characters. Various stereotypes with a depth of oddity. Yuria and Yumiko my favorite.\\n\\n\r\nPoint being, not much to comment regarding characters without spoiling. Characters are odd and tragic/dramatic, but you grow into them. Or well, will hate them.\\n\\n\r\nTo sum up, this anime gave me mixed feelings, but in the end I found it really unique and intriguing franchise. It had aspects I despise, but it was presented in a manner I couldn't hate it. Oh, and fanservice or women were done very sweetly. Hot n sexy stuff on that part. But so were really male characters also fairly sexualized. So stuff for both gender viewers.",
            "date": "2017-08-27T11:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 256356,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=256356"
        },
        {
            "content": "Take note that I haven't read the visual novels yet, but I do enjoy the adaptations of Kajitsu and Rakuen. After the so called trainwreck adaptation of Kajitsu, which questions has been cleared after the sequel Grisaia no Meikyuu, this time Rakuen is much easier to follow. With more on buildup the anime has a big \r\nThe story is probably above average, this season we get more on the character's stories and flashbacks, more on tension and plot buildup but is paid by thrilling scenes and the way of storytelling is very good, I must say that I'm impressed that 8bit puts effort in adaptingthis. I think the pacing is good and smooth, and it's much easier to follow the anime. This time the story is more focused on the main guy Yuuji, his backstory, the past, and the present. \\n\\n\r\nJust like the prequels, the art in my opinion is really well done, just like of the VN. Character designs are very detailed, it's catchy to the eyes and the backdrops are pleasing that the character designs can easily blend in. Each scene can be considered \"of good quality\". At times, it can be crappy or mediocre. Animation-wise, I don't see any flaws about it. Use of colors are also pretty good, I must say it's a unique and fresh style of art which can't be seen from other animes out there. \\n\\n\r\nWe have a decent set of soundtracks right here,very different from Kajitsu and definitely better, and some background music are from the VN as well, which are very good. Some songs are too short for some scenes and then another song comes in which is a bit out of place can make us feel the adaptation quite rushed. Again, Kurosaki Maon performs the opening. \"Setsuna no Kajitsu\" is a really great song and very catchy, together with the animations it can easily become addictive. It fits well with the fast pace and mood of the anime. The endings are also alright and catchy, but I prefer the first ED which is fast and has messages in the animation, I'd say the endings gets its job done. For the voice actors, they were perfect, voices suit their respective characters, and have distinct voices that we can tell who they are just through listening.\\n\\n\r\nNow for the characters. I'm not going to introduce them anymore, but its super obvious that they really get lots of development from this season, even new introduced characters can have a decent arc, just like Asako's, which has less screentime but she got a decent development through good storytelling and deep exploration with her character. For Yuuji, this time he's not that stiff as the first season so its obvious that his slow but sweet development made huge impacts to his character. This time the story mostly revolves around him with his harem. From this point, the main girls of Grisaia are honestly developed from the first season, their interactions and personalities are very entertaining that you'll find them all likeable. They have substance, not just carbon copies of characters from other series. \\n\\n\r\nEnjoyment. How much does my 24 minutes last? Oh god it feels like time flies fast when watching this. It's prequel is very different from this one, as this is more enjoyable, with a good sense of direction and likeable characters I really find myself enjoying this one before I knew it. Everytime I finish an episode I want more. This wasn't made to become a blockbuster, its simply just being itself. Too bad it is overlooked by more anime this season and this is so underrated. Only problem was that the few last episodes felt a bit little rushed, but that's just about it.\\n\\n\r\nStory - 9 (Rakuen has more interesting plot direction, story has a big potential and they made good use of it)\\n\r\nArt - 8 (Pretty good. Pleasing to the eyes and nothing to say bad about it.)\\n\r\nSound - 9 (Soundtracks are really touching, but sometimes too short or out of place. Badass opening and ending.)\\n\r\nCharacter - 10 (Very good developments of EVERY character including the supporting characters, they have allotted screentime for themselves)\\n\r\nEnjoyment - 10 (No joke. This one is so good you'll want more every episode)\\n\r\nOverall - 9 (Adaptation done well. Nearly perfection.)\\n\\n",
            "date": "2015-06-22T04:21:00+00:00",
            "helpful_count": 8,
            "mal_id": 190904,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3779267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BaptizED",
                "username": "BaptizED"
            },
            "url": "https://myanimelist.net/reviews.php?id=190904"
        },
        {
            "content": "You are in a running race. As you approach the finish line you are in first, far ahead of your competitors. But right before you get to the finish line you trip. Your victory and your new record is a goner.\r\nThis is basically the feeling Eden of Grisaia left me with. A would-be masterpiece that just ruins it at the very end just like Charlotte. Just when I first thought I found a masterpiece in a genre called \"Harem\", a genre often filled with mediocre stories, the ending just had to ruin it all. And it did it not only once, but twice: at thelast episode of first season and the last arc (though the latter was a bigger turnaround).\\n\\n\r\nGrisaia series is another series that has left me excited while watching. Heck, I finished the entire series within 48 hours of a weekday just because of how enthralling this was. It was a surprise that this series with such compelling story originally was an eroge (whaa). I have not read the VN before watching this series, and really didn't find major flaws until the very end (like pacing), unlike the fans of VN.\\n\\n\r\nStory: 5/10\\n\r\n\"Will I ever be able to live a normal life? I have too much blood on my hands. But I am not allowed to die until I save five people\"\\n\\n\r\nThe story was a masterpiece... until the writer decided to say \"F*** it, and threw physics and logic just out of the gate. \\n\\n\r\nLet me start of by saying how this would have been a masterpiece if it wasn't for the last arc.\\n\r\nThe Grisaia series is really a mix of everything: romance, action, psychological, harem, romance, and quite a lot of genres. And despite the chaos the combination the flow of the story (until the last arc) and the tension were perfectly smooth - it felt like I was watching a psychological piece like Psycho-Pass while watching The World God only Knows with tension of Death Note and action like Attack on Titan. And what Grisaia does is gets rid of the flaws of those series and only puts the best elements in the story. I can safely say it's one of the best.\\n\\n\r\nI initially thought that this series would be like Nisekoi or another conventional dull and average MC, but he's pretty bad-ass and just \"like a boss\", I'd say. And the Harem series does not really act as a detractor from the main series; they all add up adding to the mysterious component of the series. I understand why the VN has received so much praise.  Well, this series WAS superb..\\n\\n\r\nThen there was the last arc. (and I thought the last episode of Fruit of Grisaia was full of BS too)\\n\r\nWhere nobody gets injured when a car crashes falls from midair off quite some altitude (quite an irony to the Microbus incident), or the villains who are just ridiculously terrible shots, or a bomb that just doesn't detonate, and the girls magically earning money like piece of cake. Well, this series was full of action that kept me tense the entire time, but it just went too overboard here. And the ending was troll just like the last arc itself.\\n\\n\r\nIf I were to rate the story, I'd give the first season 8.5/10 (-1 due to last episode), S2+Yuuji's past arc 9.7/10 (Simply just brilliant), and the last arc meager 3.5/10.\\n\\n\r\nAnd this series probably one of the best sexual innuendos. Well Miles above others. And it doesn't interrupt the action aspect of the story at all. But it has some \"quirky and unique\" characters....\\n\r\n(Kazuki???)\\n\\n\r\nTL DR; Just a Masterpiece... Until the last arc.\\n\\n\r\nArt: 9/10\\n\r\nThe angle of shots and just the general tone of the cinematography is perfect for setting up the tension in the series. But it kinda gets distracted by some moe-ish characters (like the principal or the secretary). And it has some waifus for those into 2-D girls (I hope you are not).\\n\\n\r\nSound: 8/10\\n\r\nDidn't find anything getting me off the anime. I like this season's opening too - pretty ominous song unlike other anime labeled \"harem\" (that's really because Harem is not the main genre of the story)\\n\\n\r\nCharacter: 9/10\\n\r\nI'm basing this off all three series.\\n\r\nThe background story behind each characters are deep and just thrilling. Yuuji, the guy who just looks like a generic average guy from a harem anime, is actually one of the most complex characters; he is haunted by the past, and his story reflects upon nihilism, existentialism, moral values, and countless other themes and motives.\\n\r\nAnd it doesn't cross the boundary with the LOLI character! (thank you... they are more like father-daughter relationship...)\\n\\n\r\nExcept two characters ruin the atmosphere - the principal and the secretary from JB's office. They are too \"moe-ish\" and just doesn't really feel like they belong there. Would have gave a 10/10 if not for this (it just felt way too out of place).\\n\\n\r\nEnjoyment: 8/10\\n\r\n10/10 without the last arc.\\n\r\nWay too thrilling. Action packed. I didn't want to skip any of it (which is pretty rare) until the last arc. Was better than most movies.\\n\\n\r\nOverall: 6/10\\n\r\nI kinda wrote a review on the Grisaia series as a whole. I gave 9 to S1 and S2. But as for this series, we have the first part which is a 10/10 for me (Yuuji's past) followed by mediocre \"f**k physics and logic\" arc. I just couldn't give this a high rating (mostly because the last art is 6 out of 10 episodes). But great series overall. I'd still recommend anyone watching this series to even watch until the ending to get a sense of resolve.\\n\\n\r\nTL DR; Absolutely AMAZING series as a whole, containing the best of elements of top anime such as Death Note, Psycho-Pass, Attack on Titan, and other romance/harem-ish anime. Terrible last arc, but I'd still recommend to get the feel of being resolved. Low score due to it half of it being about the last arc.",
            "date": "2018-01-06T18:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 267682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5631716.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xre",
                "username": "xre"
            },
            "url": "https://myanimelist.net/reviews.php?id=267682"
        },
        {
            "content": "After finishing the Grisaia series i wanted more. Kinda like that fat kid at the birthday party that always asks for more cake, but then is told, \"No, you already ate half of it\" and then not given the cake and then they whine like a baby until they get what they want. That is how i feel about this show. Why is it so good? Hm. I don't know. Probably because of the harem king who stars in the show (Kazami Yuuji) and the plot development along with the opening and ending. This is one of my ideal animes that i like to watch.There is a harem, but not too much harem with harem cliches. There is action, but the show is not all about action. The girls in the harem are also not afraid to kiss Yuuji. Lets move on from this big paragraph, shall we?\\n\\n\\n\r\nOkay welcome to paragraph number two where i talk about how funny this show is and you start thinking, (when will this end?). The comedy (and holy shit is there comedy) is OFF THE CHARTS. If you ever watch this and say you haven't giggled, laughed, or even smiled, you are a fucking liar. How could you not laugh every time Immortal Robbie played some of his imouto games? Especially during the episode where Yuuji, Milliela (or however it is spelled), and that one guy walked in on him and he was shouting, \"SUCK IT! SUCK IT! YOU SUCK IT FIRST!\" I won't tell you what else happened because this is a spoiler-free review, am I right? But trust me when I say if your grandpa watches this whole anime (without dozing off) he will laugh, even an old guy like him. Old people never laugh.\\n\\n\r\nNow we shall talk about the harem. Now I don't remember all their names (\"But you said you just finished it a few hours ago. D:\" says you. Well you can't blame my memory.) but i can remember that Kazami Yuuji and his harem need to be inducted into the Harem Hall Of Fame. The girls are so....um.....(how to put this without sounding like a huge perv? ( ͡° ͜ʖ ͡°) ) ANIMATED. YES. Their graphics are attractive and they each have their own backstory. They also get an episode dedicated to them too, unlike other shows where the only information you get on the harem girls are from weak flashbacks, which make them seem like side characters, unlike Grisaia no Rakuen where the girls are main characters. I guess you could include Kazami's sister in the harem too since she has a brother complex and that is fine. Even she gets her own series of episodes (three or two as i remember from Grisaia no Kajitsu) explaining her disappearance. \\n\\n\r\nLast topic, I promise. The story is so good. almost half the episodes are dedicated to Yuuji's past and that is okay. I'm pretty sure everyone was curious about his past as well. It explains his personality. It doesn't cover his child years i think. As I can recall that was probably in Grisaia no Meikyuu. \\n\\n\r\nOkay I'm sure you have something else to do with your life. I do too. I will end the review on this note: Grisaia No Rakuen is a good anime, the whole Grisaia series is a great series. If you are looking for something to watch at the moment, you have found your anime. It is worth your time and if you can watch it without dying by laughter you will see how great it was. \\n\\n\r\nP.S. I forgot to mention how good the opening and ending are.\\n\\n\r\nP. P. S. Also, unless you are comfortable with seeing boobies uncensored, DON'T WATCH THE SPECIALS. They are basically soft-core hentai. While creating the specials the creators were ONE STEP away from crossing into hentai zone. I endured through them though.  ( ͡° ͜ʖ ͡°) there is no censored version too so if you don't like hentai don't watch it.\\n\\n\\n",
            "date": "2016-07-14T00:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 223973,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4546882.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Magister_Jakene",
                "username": "Magister_Jakene"
            },
            "url": "https://myanimelist.net/reviews.php?id=223973"
        },
        {
            "content": "Enjoyment 6/10\r\nI think that Grisaia no Rakuen is a good sequel to the first season i think that it has incredible art good story and antagonist well written characters and great action scenes.... but i just couldn't enjoy this season as much as the first one because of 2 characters - JB, Asako\r\nthose 2 completely ruined a lot of Yuuiji's past for me with completely unnecessary sexual relationships with him \r\ni mean (very minor Spoilers) Asako just decides to have sex with him when he was 16 as a present and she is like 30 years old and JB was even worse... so much worse\\n\r\nok she was a VIRGIN !!! and again around 30 years old when Asako just pushes her to lose her virginity to a 16 year old kid \\n\r\nall of this makes absolutely no sense and completely ruined my immersion in the show a few times. i understand that this is an adaptation of a sexual eroge but this just fills wrong . it was like he was having sex with his mom and then his aunt. (End of Spoilers)\\n\r\nanyway this is most of the bad stuff i have to say about the show so let's jump into the good stuff \\n\r\nStory 8/10\\n\r\nin the first few episodes the story focuses on Yuuji's past before meeting the girls at the academy and also introduces the villain Oslo a pretty great antagonist to be honest \\n\r\nafter about i thing 5 episodes of Yuuji's very well written and interesting past (except for the things mentioned above). \\n\r\nafter 5 episodes of the past we get back to the present and Oslo returns to get Yuuiji. \\n\r\nits a rather interesting story that has a satisfying ending so i enjoyed  it overall. \\n\r\nArt 8/10 \\n\r\nthe art is very good looking and the animation is very good especially in the action scenes that i have to admit are just gorgeous as well but there are very annoying black bars that coused  me to lower the score form 9 to 8 overall its very pretty ( just look it up online and see its for your liking)  \\n\r\nand of you enjoy the occasional boob that you will love the art  \\n\r\nSound 7/10 \\n\r\nit matched the show really well but nothing really stood out except the opening song that i just love seriously go listen to it  \\n\r\nCharacters 9/10 \\n\r\nexcept for the two characters i mentioned in the start ALL of the cast of this show is great. \\n\r\nthe girls are likable relatable  sometimes even hilarious and each of then has their own unique personality but there is no more development for the girls which kinda disappointing to me after the great development in the first season but  i still love the cast and they provide great development for Yuuiji \\n\r\nOverall 7/10\\n\r\nIs you don't mind boobs every once in a while this show is great. its a drama harem that provides the fan service the drama and the action that we all want and adds on top of that great writing and characters which is very rare for harems \\n\r\ni really really felt that its a great show but because of thing i mentioned at the start it really i feel ruined my experience with show but i can still recommend it to people that like harem and want more than the regular ecchi comedy that we get every season.",
            "date": "2016-03-14T08:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 212925,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5071202.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/21choices",
                "username": "21choices"
            },
            "url": "https://myanimelist.net/reviews.php?id=212925"
        },
        {
            "content": "Well it's an improvement from the first series I'll give it that, but it could still use improvement.\r\nStory: 7\r\nThe story in the start and going on was good, and definitely a whole lot better paced then the last season was. However near the end, and especially the last episode, it seemed like the writers tried to cram a whole 2 episodes worth into 12 minutes. Yeah, not a really pretty sight to see. However, they decided to still go with the 10 episodes instead of 12 episodes which would have allowed for a lot better of a transition in the story.\r\nArt: 8\r\nThe art, like lastseason, doesn't fail to let down the viewer. The action scenes especially shined in this element with all of the car flipping, exploding, and death parts that were to be seen in various places in the anime.\\n\\n\r\nSound: 8\\n\r\nThe sound was well implemented and sounded pleasing to the ears, as well as the intro and outro music were really enjoyable. Besides that however, there weren't any specific parts that I could think of that were impressive.\\n\\n\r\nCharacters: 7\\n\r\nHow would I describe it...well the characters are all from last season with the encompassing of some new characters who weren't that well explained with the exception of (spoiler) Yujii's sister and some others. Literally, the clone of Yujii was in the anime for less then 5 minutes with little to no backstory before he gets shanked by Yujii. I didn't watch the OVA so maybe theres more information about the characters in it, but the anime itself gives very little information about the villians in this series besides the fact that there bad, and need to be stopped.\\n\\n\r\nEnjoyment: 6\\n\r\nI really don't know personally why I give it only a 6 in the enjoyment category, but I do know that while I enjoyed watching this in the beginning, I started to watch this because I hate to leave animes unfinished, and not because I love it. Maybe it's because they focus so much on Yuuji's backstory or maybe on whats happening to the girls in the present, but I started not to watch it because I liked it, but because I didn't have any other animes to watch on Sundays.",
            "date": "2015-06-21T18:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 190876,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3066335.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Somebody101",
                "username": "Somebody101"
            },
            "url": "https://myanimelist.net/reviews.php?id=190876"
        },
        {
            "content": "When I first watched the First Season, I honestly thought I was getting a \"Shuffle\" kind of thing.\r\nNumerous girls with different routes, different stories and different outcomes.\r\nBoy was I wrong. This series is honestly amazing. It follows the life of a man looking to escape his past. A man looking for redemption. A man looking for peace.\r\nEach of the girls have their own story, their own past and their own will to survive.\r\nI think those elements are great. The background of Yuuji, JB and Asako is so powerful. These 3 had such a powerful history that one without the other leaves a huge hole inyour heart.\\n\\n\r\nIf you enjoyed Season 1 and the OVA, definitely continue watching for the full story.\\n\\n\r\nI'm saddened that this season is only 10 episodes...\\n\\n\r\n---------------------------------------------------------------------------------------------\\n\\n\r\nBest anime of Spring 2015. Honestly, this is how you do drama/romance. The closure, the feels, the suspense, the leveling with MC and his harem.\\n\\n\r\nBeautiful.\\n",
            "date": "2015-06-24T10:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 191137,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=191137"
        },
        {
            "content": "I really enjoy this anime lol. not much i can said in this review, this anime is indeed a good psychological anime, the past of each character is really sad, especially Yuuji and Amane (my opinion though).\r\nThe art improved a lot since the first season, especially that 3DCG part when they are being chased by a helicopter. 10/10 for me.\r\nOP and ED is nice, i really like the background music they put in each scene.\r\n10/10 for me.\r\nCharacter development is very good despite this season only have 10 episode. \r\nI really enjoy this season, and overall i gave this anime a perfect score.\r\nIf you like anaction, psychological, and romance anime, this anime is for you!",
            "date": "2015-06-29T22:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 191769,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4702973.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Badass_Hole",
                "username": "Badass_Hole"
            },
            "url": "https://myanimelist.net/reviews.php?id=191769"
        },
        {
            "content": "It is a sequel of Grisaia no Meikyuu and Grisaia no Kajitsu, so watch them before it to understand the storyline.\r\nCharacters:\r\nThere were added some new secondary characters, like Yuuji's military friends and a girl who raised him (although, the first time she appeared in special), however the main characters are still the same - professional hitman and his harem.\r\nStory:\r\nIt starts with a story of main character's childhood and then he's fighting with bad guys. Unlike the first season, it had more action and less drama. Even sometimes it looks like a western action movie of the 90s.\r\nArt and sound:\r\nArt and background music style are stillthe same, but I would like to mention that all episodes are made in the cinema widescreen format (2.35:1), therefore these ten episodes look like a long movie.\\n\\n\r\nDon't expect it to be a harem anime like the first season, it's rather an action with a little fanservice and drama.",
            "date": "2015-07-19T00:59:00+00:00",
            "helpful_count": 5,
            "mal_id": 193800,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3861507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ever2014",
                "username": "Ever2014"
            },
            "url": "https://myanimelist.net/reviews.php?id=193800"
        },
        {
            "content": "If you watched the first season and the special for this show and think you know what you're in for, think again. This show is balls to the wall insane at this point, but I loved every moment of it. From spending half the season in flashbacks to create a second harem, to coming back to the modern day where it's up to 8 women who are interested in him at one time. You have a 12 year old with a Baretta .50 cal, a maid who makes bombs, and robotic AI trying to control the world. This show just keeps on giving with insaneplots, set pieces, yet still managing to make me care about what's happening on screen.\\n\\n\r\nThe art is interesting enough while it draws your attention to guns, vehicles, or locations. Past that, the characters are all tropes that are slightly subversive to their type, however this was established in season 1.\\n\\n\r\nIt's a harem show through and through, but it's also a thriller. That's the description that hooked me in. You'll be on the edge of your seat while also feel like you're watching garbage. In the end, if you liked S1 but didn't feel it was insane enough, you won't be disappointed.",
            "date": "2018-04-07T11:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 277249,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=277249"
        },
        {
            "content": "While the season was off to a good start, the last several episodes seems to be a letdown.\r\nThe beginning being a continuation of the movie, was by far(for me) the best part of the show.(although I am not a great fan of the movie)\r\nHere we get a deep insight into Yuji's charecter, both providing a background for the first season and letting viewers develop an appreciation for what made Kazami Yuji.\r\nAt the beginning of the review I did say that the last few episodes were disappointing, perhaps this is not entiarly true. The finale was, in a very proper usage of the word, EPIC.\r\nThe amazingstory of the majority of the show + the spectacular finale( which I'd be happy to use as an example of badassery) most definitely make up for the shows shortcomings.\\n\\n\r\nPOINT IS : it's worth a watch",
            "date": "2017-03-03T20:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 241819,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6066237.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OKusernameihope",
                "username": "OKusernameihope"
            },
            "url": "https://myanimelist.net/reviews.php?id=241819"
        },
        {
            "content": "Grisaia became somewhat disappointingly self-aware and therefor much less ridiculous (though still completely ridiculous) but to its credit it also became a technically better series. What it does really well is that it starts playing with your expectations of the hot garbage that Grisaia is and uses it to create some genuinely clever and humorous moments mostly by really leaning into the silly Grisaia stuff early on just so they can circumvent their own tropes later on. In fact, even the serious moments go over a bit better this time around. They provided enough of the Grisaia bs I know and love while both acknowledgingthat its awful and using that to actually improve the overall product. The direction and shot composition are also improved for the most part but still throw in some laughably bad CG and other silliness here and there for old times sake. On the part of the creators this is a fairly measured and mature, and dare I say, respectable response to the original series.",
            "date": "2016-06-11T09:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 220496,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66757.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ueno_station54",
                "username": "ueno_station54"
            },
            "url": "https://myanimelist.net/reviews.php?id=220496"
        }
    ],
    [
        {
            "content": "\"The reason a woman takes up arms has always been obvious, to protect her beloved family and to protect the home to which her belove will return\" - Makina Irisu.\r\nSuch loving words from such a little girl.\r\nGrisaia no Rakuen or The Eden of Grisaia is exactly what you get when combining the traditional harem anime with Hollywood action movie and my god, it's awesome and that's just an understatement.\r\nYou can consider this show is the continuos story picking up immediately after the events of Grisaia no Meikyuu, with Kazami Yuuji- our MC- having been detained for suspected involvement with an international terrorist organization. Why? Gowatch the show to find out.\\n\\n\r\nThe animation is good, a bit dark, fit the tone of the show. The soundtrack is beautiful, the op, ed are amazing.\\n\\n\r\nI can proudly say this is the greatest harem anime ever produced and one of most amazing story i have seen in the anime world. Do you agree with me?",
            "date": "2015-06-30T06:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 191793,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489573.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/johnbradshaw",
                "username": "johnbradshaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=191793"
        }
    ]
]