[
    [
        {
            "content": "I'm a huge fan of shoujo, romance, and reverse harems; my absolute favorite is Ouran High School.\r\nSo I really, REALLY, wanted to enjoy this. \r\nThe art is beautiful, the characters are beautiful and all each unique in their own way.\r\nThe powers are very cool; very unique and original in concept.\r\nThe storyline seemed promising.\r\nEverything, seemed promising, everything has so much potential.\r\n\"So what's the problem here?\" You may ask.\r\nThe main character, is the problem.\r\nThe story revolves around one girl; named Felicita, she does not speak, does not have a personality, all she really honestly does is stand in the background of every scene and look pretty whilethe male characters do all the talking. \\n\\n\r\nWhen she does occasionally talk, it's \"eh?\" or \"What's wrong _____?\" \\n\\n\r\nShe only talks at appropriate times, when needed.\\n\\n\r\nShe just makes sounds, you find her character, very VERY, flat and robotic. \\n\\n\r\nAll of the male characters have more personality than her, SERIOUSLY. \\n\\n\r\nEven the side male characters that you know won't get the girl, talk more than her, they all have more personality than her.\\n\\n\r\nHer reactions to things and situations are either too downplayed, where it's as if she didn't or doesn't react to things at all, doesn't notice things around her, doesn't care almost.\\n\\n\r\nBut when the story forces her to care, it's overblown, and she suddenly cares SO much, it's unrealistic.\\n\\n\r\nI wanted to drop the show after the second episode was ALREADY a filler, it was an episode, about a cat, just some random stupid cat, and really would you spend an entire day looking for an owner of a cat. I was hoping that the owner of the cat would be someone important, but in the end it was just some random lady that had nothing to do with anything.\\n\\n\r\nA useless filler episode.\\n\\n\r\nThere wasn't any romance in the episode either, it was just honestly, a time waster.\\n\\n\r\nBut I kept watching anyways. \\n\\n\r\nEpisode three seemed like another filler, but it became potentially good at the end when the mystery child returns to Jolly, and a part of Liberta's past revealed. \\n\\n\r\nGiving us a thought that this might get darker and more serious, with Jolly's \"shady research\" and the strange child returning to him.\\n\\n\r\nWith Liberta's mysterious power, the episode left me wanting to know.\\n\\n\r\nFourth Episode, reveals liberta's past, but I felt as though it was all rushed and down very shabbily. \\n\\n\r\nIt just seemed half assed, it was good, but shown half assedly. \\n\\n\r\nIt just saddens me because this anime has SO much potential, so many wonderful characters, so many good ideas, but it's shown very lousily.\\n\\n\r\nSo with potentially good plots and ideas already wasted, and the main character's flat personality.\\n\\n\r\nI have sadly decided to drop this Anime.\\n\\n\r\nAlso a note: I understand that this is derived from a game, and since in the game you get to pick how you talk and interact with the characters, you basically choose the girl's personality, I do not understand why they chose to leave the main character's personality blank in the anime as well, you can't just imagine she has a personality, she has to have one if she's interacting with the other characters on her own, so leaving her quiet and blank most of the time, does not work in an anime. \\n\\n\r\nThey should have given her more personality, interests, quirks, dislikes, they should have just made her more human, and not just a blank pretty doll that's important because she's the daughter of a very important man, and very attractive, in my opinion. \\n\\n\r\nLike if you want to make a huge group of attractive men like her, then you have to sell her to us too, give us reasons as to why she's so likable, why do all the men want her as their wife? \\n\\n\r\nSo far the only reasons I've been able to notice is that she's attractive and the daughter of everyone's boss. \\n\\n\r\nAnd basically the only available girl in the anime; an attractive bachelorette with looks, money, and power.\\n\\n\r\nNothing actually deep like other than shallow attraction. \\n\\n\r\nYes Liberta likes her, a lot, but why, why does he like her so much?\\n\\n\r\nIs it just because she's the only girl his age in the anime? \\n\\n\r\nCome on.. \\n\\n\r\nInstead of wasting episodes and production on filler stuff, why didn't you use those episodes to develop the main story and to tell us why the main character is so desired?\\n\\n\r\nEither way.\\n\\n\r\nI'm done:\\n\\n\r\nStory - 7/10 \\n\r\n(Story is good and has potential but not presented well.)\\n\r\nArt - 9/10 \\n\r\n(The art is quality.)\\n\r\nSound - 10/10 \\n\r\n(The voice actors are superb.)\\n\r\nCharacter - 7/10\\n\r\n(All the male characters are good, but the main character's mother and father has more personality than she does herself.)\\n\r\nEnjoyment - 5/10\\n\r\n(Almost all the episodes except the first seemed like fillers to me, very boring, with attempts at making it more exciting.)\\n\\n\r\nOverall - 6/10",
            "date": "2012-07-26T11:47:00+00:00",
            "helpful_count": 229,
            "mal_id": 67797,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/848195.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/snoh",
                "username": "snoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=67797"
        },
        {
            "content": "To start my review, let me say that I don't necessarily hate Arcana Famiglia.\r\nI simply hate the payoff I got for watching it. Which was absolutely nothing.\r\nThe entire series looks as if it is building for this tournament that has been set to decide who will be the new leader of the Family and marries the boss' daughter.\r\nIn the first episode, you get some immediate development in the relationship between father and daughter plus daughter and coworkers. To add, there are some pretty nice powers being used and an awesome mysterious character with an awesome name looming in the background (Jolly). So, when the seriesstarts, you know where some people stand and how things are going to go.\\n\\n\r\nThe only thing is, it never goes there.\\n\\n\r\nArcana Famiglia gives you the build for this tournament that's soon to take place. Every episode is wasted on character development and character interaction. You see everyone's past and you even find the origin of the family. For a build-up, this is great, it helps strengthen character connection so that you root for a particular character to win when the fighting starts.\\n\\n\r\nThe fighting doesn't start. Ever.\\n\\n\r\nWatching the entire series would be worth it if it led to some awesome battle royal conclusion. It would even be awesome if a bunch of pirates just came and ruined said battle royal. Neither happens. All of the action is skipped and the powers aren't expanded on any further than episode one. They're explained, but they aren't expanded on.\\n\\n\r\nAnother thing, this has to be the only series I've seen where I think character development was a bad thing. The characters lose any finesse that they had when their lives are explored. The only exception was Jolly, who barely got any screentime in most of this series. And he didn't even participate in any real fighting. However, I can tell you exactly what his past is like and why he's so cold. That's absurd and just plain ridiculous.\\n\\n\r\nThe anime takes so much time in explaining every single character and having them fight their demons that we don't even see what their demons really are. They never come across any serious conflict and the only climax to look forward to is the tournament that's supposed to be the motherload of all battles.\\n\\n\r\nThe battling is non-existent. Chances are I said that earlier in the review, but I must emphasize how bad it was. For one, it was minimum. There was no intricate fighting nor any type of personalized moves. The tournament that the series builds up to becomes absolutely pointless with every new episode. The winner was even pointless and so was their \"resolve\" once they won. You really feel like a major butt for even watching the entire series for a climax that could've been the length of an average youtube video.\\n\\n\r\nAnd to make matters worst, it doesn't try to cover its flaws. Maybe a little fanservice or some nice cop-out scenes. Nope, not once. It burrows a reverse harem shtick that it can't even fully deliver on. You don't feel like these guys (with the exception of two) are all that into her.\\n\\n\r\nThere were no antagonists. There was minimum fighting. The romance barely showed and was ended on the weakest of terms. The characters don't live up to their reputations. The story blows major chunks.\\n\\n\r\nThe climax . . . faking it.",
            "date": "2013-02-27T20:14:00+00:00",
            "helpful_count": 223,
            "mal_id": 88099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1904192.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AuronPond",
                "username": "AuronPond"
            },
            "url": "https://myanimelist.net/reviews.php?id=88099"
        },
        {
            "content": "When La Storia Della Arcana Famiglia, or just Arcana Famiglia started airing, I was first surprised over how entertaining I found it, considering it was based on a dating sim visual novel for girls. The quality of the art and animations where good, the story appeared interesting, but most of all was the character gallery and their hidden powers very appealing.\r\nAfter watching the whole series I was saddened to see it was only the first episode that showed true potential of what this series might eventually have become had it not been for certain downfalls that I will try to explain bellow.\r\nThe story, which issupposed to be a love story with Felecità, and one of the male characters in the series never seems to advance.\\n\r\nMost episodes aren't even slightly connected to either Felecità or romance at all, and the typical rivaling struggle between the two male protagonists grows to be nothing but annoying over the course of the series.\\n\r\nFelecità remains more as a background accessory, whilst non of the male characters seems to be interested in her above the point of cheering her up when she is depressed. Which she happens to be in all the later episodes. This depression is also the only real emotion she expresses, which is kinda sad considering this is supposed to be a love story.\\n\\n\r\nHowever, the main factor that brings this series down from what it could have been is the way they neglect to explore any character. \\n\r\nIn most of the episodes we are introduced to a new characters personality and background, which could have become very interesting, had it not been for the fact that we only ever get to see the surface of every characters life. Not one single character throughout  the whole series is properly explored. We are only shown enough to know that \"There is a lot more to know\". \\n\r\nNot even the main characters are properly explored, which leaves us at loss as of what pasts all these people share.\\n\r\nWe are only shown glimpses of their pasts, and it is never properly explained what really happened between any of them.\\n\\n\r\nAll in all, Arcana Famiglia starts out with a great potential, and the very interesting character gallery, which end up being completely wasted due to the lack of progress the characters make, and non of them being properly introduced or explored.\\n\r\nWhen this series ended I honestly felt a little angry with the producers, having wasted a lot of potential, and made what could have been a super cool action/shoujo/romance into just another series nobody will remember in a year.\\n\\n\r\nNote that I have not played the game, but I sincerely hope and believe that it is much better than the anime.",
            "date": "2012-09-16T18:30:00+00:00",
            "helpful_count": 189,
            "mal_id": 72511,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284694.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Snodig",
                "username": "Snodig"
            },
            "url": "https://myanimelist.net/reviews.php?id=72511"
        },
        {
            "content": "Watching Arcana Familga is like reading an autobiography, you know..the sort of book a person writes about his or own life and it is usually full of all sorts of boring details. In any case, Arcana Famiglia is a strange series from the start. \r\nLa Storia Della Arcana Famiglia details a group of people who have made contracts with the Arcana cards to obtain special abilities in his or her own rights. On the birthday of the head of household, the Father decides to host a tournament -  a series of duels known as the  Arcana Duello, between Arcana-users. It is every onefor themselves because it's winner takes all. \\n\\n\r\nApparently, the series' promo depicts around a tournament but half way now through the series, what do we have?\\n\\n\r\n- cat/neko chasing\\n\r\n- babysitting \\n\r\n- rivalries between two of the main characters in a boring love triangle that has little flavor\\n\\n\r\nAt any rate, this series is not exactly the smash of the season and shouldn't be especially with throwing in fillers at the very get go. \\n\\n\r\nThe series continuously avoid the major story of the series but instead throws fillers at your face like apple pies. But the story is not as tasty. It lacks flavor of an apple pie because they are all fillers from the beginning. Although later on, we do see some storyline development (chiefly flashbacks), the main story so far is avoided. Furthermore, it seems that the flashbacks are cliched and stereotyped. Honestly, who on Earth is planning on sitting through over four episodes to watch some flashbacks? We want to see some movement and drama with the main arc! \\n\\n\r\nLuckily though, the character designs are cool. And of course, they need to be especially since everything up to this point has been focused on the characters of the tournament (you know, the one that hasn't yet officially begun yet). But towards the finale (yes the very last episode), the duel is finally presented. Even the duel itself has some problems though with one of the main characters actually withdrawing while other battles between our cute pigtailed girl being way too short and no flavor.\\n\\n\r\nFelicità is the main heroine of the series, the  holder of The Lovers arcana, which gives her the ability to read the hearts of others. She is spicy, she is cute, and she is to herself. And those little pigtails, who doesn't want to cuddle them? Beyond that though, she has some interesting interactions between two of the main characters, Libertà and Nova.\\n\\n\r\nThat brings to their rivalry.\\n\\n\r\nIt seems that Libertà and Nova often gets into fights like ying and yang. Just look at it. Every five minutes in the series, they fight out and competes sometimes over absolutely nothing. Libertà is depicted as the hot headed guy while Nova remains his cool. (most of the time) Regardless though, it gets old after watching it over 9000 times. Besides, there's already rivalries similar to this without the l for love in a certain ongoing series. Perhaps the Tail of the Fairies ring a bell? \\n\\n\r\nThe other characters of the series seem to be like background characters of a stage play so far despite their cool appearances. The bold headed guy who has the ace hands of a bazooka, the cool level headed guy with the eye patch, and the mysterious Jolly with his shades. I'm sure they will eventually get the opportunity to shine but so far, it's not happening. Besides maybe Jolly, everything seems so stale between the background characters. Yup, the apple pie is once again losing its flavor.\\n\\n\r\nLuckily, there is some minor good flavors for this disappointing anime so far. The soundtrack, namely the opening  song of the series seems to play well in this series. \\n\\n\r\nMagenta Another Sky\" by Hitomi Harada is well orchestrated and depicts the Arcana-users showing off some of their abilities in the sequences. The music is also catchy and as one of the first series to watch on Sundays, it's a pretty damn good way to start off the week, at least in the music department.\\n\\n\r\nThe art is also colorful in this series. It gives off an Italian like atmosphere and overall, demonstrated well with the cool looking characters, some backgrounds, and the mansion where the family stays at. \\n\\n\r\nOverall, to enjoy this series, you'd have to be a real brave fighter, one that is very patient and ignores the fillers but instead concentrate on other aspects of the \"story\". The first half of the series isn't one of the best ways to start off this originally hyped series. The \"story\" moves like a turtle and the apple pie is losing its touch. It's not too surprising that J.C. Staff's expectations didn't live up to the hype. \\n\\n\r\nWith all the filler episodes going on and the \"story\" moving so damn slow, it's no surprise that some people have dropped it. There should be limits on how to start a potential series but in this case, Arcana wasted it. It brings up boring sequences from the get go and fails to deliver anything unique to the viewers. While the art and music/Op song does somewhat makes up for this, it so far is anything but special. J.C. Staff you disappoint. No one likes reading an autobiography and especially of a series that originally had potential. \\n\\n\\n\\n",
            "date": "2012-08-11T14:36:00+00:00",
            "helpful_count": 77,
            "mal_id": 69443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=69443"
        },
        {
            "content": "La Storia Della Arcana Famiglia, or just Arcana Famiglia is one of those shows that when the new season came along, I read the synopsis and became fairly interested in it. I'm generally not the kind of person who tends to discriminate on anime based upon genre so I had no problem watching something labeled as shoujo, however, I became somewhat hesitant when I learned that it was based of an otome game aimed at young girls. (Please note that I have not played the game; I have only watched the anime.) Despite my hesitation, I watched the first episode and found it to beenjoyable. It was enjoyable enough that I showed my little sister it as well (who is a preteen and definitely within the target audience); she enjoyed it and from then on we watched it together.\\n\\n\r\nThe concept of the Arcana powers and the characters seemed interesting based off the the first episode. There was a lot of action in the first episode and the premise of a family-wide contest for the position of Papa (the big boss) and the protagonist's, Felicita's, hand in marriage was interesting as well. It provided a dilemma for her that would allow her to develop as a character while defending her right to choose who she marries. It had potential- in fact, the entire series had potential. Unfortunately, the series never comes close to fulfilling the potential it initially held with the protagonist remaining static and boring throughout and the event that I expected to span most of the series, the Duello, only spans the last episode and that itself was a disappointment, much like the rest of the series.\\n\\n\r\nFirst, let's talk about character development. There is none- well, nothing really besides an introduction to most of the characters. They never really delve deep into any one character. In fact, the most developed character is not the protagonist; the most developed characters are the two main male leads, Liberta and Nova who are in love with the protagonist. Even though they are the most developed I could never bring myself to really remotely care about them- I frankly found them annoying. In fact, the only thing I found interesting about the both of them was Liberta's mysterious Arcana Power. Felicita seemed less of a protagonist and more of a side character the entire series, only speaking when necessary and often seeming to go out of character by being overly-concerned or over-emotional only when the situation demands. (And her Arcana power is clearly just a tool made for the game's romances.)\\n\\n\r\nThe second topic of discussion is the art and animation. The art was nothing spectacular to me, however it did its job- most of the time. The characters never really looked bad, even the background characters seemed to be drawn well (besides the occasional derp character), however what really suffered was the background itself. I noticed several instances of just plain bad background art and the one in particular that really bugged me wasn't even noticed by me at first; it was noticed by my sister. A pirate ship in one of the episodes actually changed in art style at least three times in the same episode (and it really wasn't drawn well in the first place). Besides the art itself, the animation was not very good for the parts where it should have been good, namely the fight scenes. The fights seemed more like gifs that were just repeated at different times and at one point in the last episode, Nova's shoulder was definitely in a strange position.\\n\\n\r\nThe sound of the anime serves its purpose but does little else, it does not excel in any aspect. I personally like the opening song much better than the ending song, mostly because the guys can't sing.\\n\\n\r\nOverall, I don't have much good to say about this anime. With each passing episode, I prayed that it would get better. Unfortunately, my prayers were never answered; its potential having been completely wasted. This anime is bad; my sister, a member of the target audience, does not think that this show is good. If there was anything redeemable about the series, it would have to be the supporting cast because the main characters are all flat, boring, annoying, or a combination of all three.\\n\\n\r\n4/10 \\n",
            "date": "2012-09-25T19:03:00+00:00",
            "helpful_count": 30,
            "mal_id": 73303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474568.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Newmn84",
                "username": "Newmn84"
            },
            "url": "https://myanimelist.net/reviews.php?id=73303"
        },
        {
            "content": "Ooh Arcana Famiglia. I really wanted to enjoy this series...and to begin with, I actually did.\r\nThe setup was sublime. A mafia-esque vigilante organisation, known as The Family, is dedicated to protecting the port town of Regalo. Many members of the Family have made deals with the \"Arcana\", granting them abilities based on different tarot cards. Okay, interesting...\r\nThe head of the family announces he wishes to retire from his role and choose an heir by means of a grand tournament, in which all Family members with Arcana powers must duel until only the victor remains, who will become the new \"Papa\" of the family...and have hisdaughter Felicite's hand in marriage. Felicite violently objects to this sudden announcement, but has no way out of it unless she either wins the tournament herself, or the new Head of the Family grants her freedom.\\n\\n\r\nFelicite's two close friends, the rebellious Liberta and the moody Nova, both agree to grant Felicte's freedom if either of them win the tournament...even though both of them appear to share feelings for the girl, and constantly compete for her approval.\\n\\n\r\nIt was a great setup, with a solid concept and characters that weren't wholly original, but mostly likeable. The style is crisp with a pleasant colour scheme that gives is a classy but lively atmosphere.\\n\\n\r\nUnfortunately, in time it became clear that the series suffers from two CRIPPLING faults:\\n\\n\r\n1) Felicite is NOT a protagonist. A protagonist is supposed to be a driving force the moves the plot forward and who's actions are most influential to the story. However, Felicite, whilst certainly the FOCUS, does not exert any kind of force on the plot. She stands around, looks cutely puzzled or asks questions, and doesn't actually do anything unless promted to do so by another character. And it does beg the question: Why does she consider independence so valuable when she seems incapable of making independent decisions? Why is she so bothered about losing her freedom when she seems quite happy to just do what everyone tells her to do anyway? Now, this COULD have been an incredibly original and fascinating approach to a tired concept, and raised questions about the value of freedom for freedom's sake, or if there's any shame in admitting when you can't live the independent life you desire. Unfortunately it eventually became apparent that Felicite was just a poorly written protagonist with all the impact of a wet flannel, and hinging dangerously on looking like a fan-made Mary Sue.\\n\\n\r\n2) And by far worse: The series seems to be under the delusion that just MENTIONING a good idea is enough to constitute entertainment. It's...honestly a very unusual habit. It will bring up a fascinating concept or a promising plot point and then...forget about it. Case in point: The Family is referred to as a kind of vigilante organisation, and yet we barely see ANY vigilante activity throughout the whole series, they just become a bunch of characters in suits for no reason. Similarly, many of the arcana powers are mentioned, but go entirely unused. Even the tournament, which is set up as the main concept, is forgotten about until the end of the whole series!! But perhaps the most shocking example of this is when one character reveals an experiment he's been working on...I'll keep spoilers out of it, but suffice to say it is a pretty major project with staggering ethical ramifications and with massive potential effects on the whole Arcana concept. What happens to this experiment? Never mentioned or alluded to again. Ever. In any form. Like I said, the series believes that it just needs to mention a good idea to get an audience's attention, and then either forgets to follow through with it or doesn't believe it needs to. Some backstories never come to fruition, ideas are never explored, and a mass of potential is painfully squandered.\\n\\n\r\nSo, combine a weak protagonist with some extremely clumsy \"idea-only\" storytelling, and an entire tournament that feels like it was forgotten about and then slapped togehter at the last minute...and you can imagine that the ending of this show didn't leave me with a good taste in my mouth.\\n\\n\r\nThis show had so much potential, soo muuuch!! The setup was golden, the concept presented lots of possibilities, and most of the characters (Felicite aside) were actually very likeable and interesting, especially Debito, Pace and Luca. Even the humour, which is often a weak aspect in most anime, was pretty solid, either focusing on amusing character interactions or some well-timed slapstick. I also loved the picturesque, European design of Regalo, which created a very distinct setting.\\n\\n\r\nBut ultimately, all that was good about Arcana Famiglia was quickly buried by the efforts of overly-excited writers throwing in plot points and ideas without bothering to think how they'd tie into the story and how they'd resolve.\\n\\n\r\nA promising start that came to a bitter, frustrating end, and is only enjoyable on its most shallow level.",
            "date": "2012-12-01T05:18:00+00:00",
            "helpful_count": 25,
            "mal_id": 78796,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1839672.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheLastVeo",
                "username": "TheLastVeo"
            },
            "url": "https://myanimelist.net/reviews.php?id=78796"
        },
        {
            "content": "*Note: Due to a previous review I wrote, I am acknowledging beforehand that I have not read the visual novel. I am reviewing this anime solely on it's own story rather than it's accuracy as an adaptation.\r\nI have to admit, Arcana Famiglia is probably the most disappointing anime that I have seen this year. It's probably not the worst but DEFINITELY the most disappointing. It's got a good cast of characters and there's certainly nothing wrong with the artwork, music, or voice acting...however, a complete lack of story and the missed opportunity to show off the shonen aspect of this anime just derailed it.\r\nOverall, Ithought the strongest aspects of this anime was it's music and characters. The music fit the tone of the anime extremely well. It did have a very Italian feel to the music and I thought the OP and ED songs were very good as well. The only thing I would argue is the OP song didn't help my disappointment because it gave the feel that this was going to be an action-packed full-throttle anime and it turned out to be the exact opposite. \\n\\n\r\nAs for the characters, on the whole I thought they were pretty good. The characters on the whole were pretty likable. One of the few beefs that I did have with the characters was actually the lead herself, Felicita. Her character seemed so bland. I normally wouldn't have a problem with this if she were a side character, but the fact of the matter is this story revolved around her and her choices. Due to the lack of character with her, it became difficult to become invested in her. If Liberta or Nova were the main protagonist (which this anime gave some early direction to), it would've been much more tolerable. Those two characters seemed to have an interesting back story and appealing characteristics. Even the side characters such as Pace, Debito, Luca, Jolly, Dante, etc. had more character than Felicita. Overall, I thought all the side characters were solid...just the lead character was lacking.\\n\\n\r\nThe weakest part of this anime as aforementioned is the story. This story is just dreadful. However, to be honest, some aspects of it don't seem so bad. I did like the concept of Felicita having two arcana powers and using both of them together (in a sense) has the ability to save her father. I do actually find that pretty interesting. Therein lies the problem...that is the only interesting thing about this anime. This series basically opens up with Mondo announcing that they will be holding an Arcana Duello to determine who the next leader of the Arcana Famiglia will be. Okay, sounds like your typical shonen anime plot. So what happens over the next 11 episodes? We slowly and barely learn about Liberta and Nova's back story, how they can't control their powers and how they must slowly learn to control them before the Arcana Duello. Even then, that content actually takes up MAYBE 3 episodes...the rest of it is essentially character development padding. What I mean by that is, it's essentially padding since they are repeating similar events to show off each character's personality. It ends up mostly being a waste of time since we don't learn any more about the characters than we already know.\\n\\n\r\nSince the story was weak, surely the shonen-esque action sequences will surely make up for it, right? Actually, wrong. The action sequences in this anime were extremely weak and extremely poorly animated. There are even sequences where action scenes (especially in the final episode) aren't shown entirely or there are scenes where characters are fighting but you're seeing the expressions and thoughts of a spectator instead of the actual fight. It seemed as though the producers of this anime didn't trust their animators enough with action sequences that they just used this to cover up for it. It was a poor move and was extremely noticeable. \\n\\n\r\nMy overall thoughts on Arcana Famiglia is it had my interest piqued in the beginning, but as the series wore on, so did my expectations. It missed out on so many opportunities that it's hard to classify this anime. I'd call it a shonen but the action sequences were non-existent. I'd call it a romance but any time a romance was hinted at, it was brushed aside for more meaningless padding. I'd call it a drama but it really wasn't very dramatic. This anime essentially has no identinty and it really wouldn't shock me if I forget that I even watched this anime at one point. It really was that forgettable.\\n\\n",
            "date": "2012-09-17T05:51:00+00:00",
            "helpful_count": 20,
            "mal_id": 72547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=72547"
        },
        {
            "content": "I was very happy when i begin watching this, and the first episode caught me. The mafia thing isn't that original, but the idea to bind that with tarot cards with powers. That was an unexpected thing to me, and made me to watch. Like I said in other posts : Never judge a anime by its first episode, the sentence applys to this. First episode was good, others : Ehhh\r\nI liked some characters, but the story didn't help to develop them. And the whole plot turned boring. When i was almost finishing, i thought things would change, but i got disappointed another time.\r\nWell, theart and sound are good, in my opinion, but it's not enough to save the disaster.",
            "date": "2012-12-01T05:47:00+00:00",
            "helpful_count": 19,
            "mal_id": 78800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1579475.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fukitsu",
                "username": "Fukitsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=78800"
        },
        {
            "content": "Bujorno everyone! Now I've completed this 12 episode rip-off, I think it is now time to make a review as to how disgusted I am with this kind of anime. Ok, so the story of this rip-off thing is about a family of well-loved thugs in the island of Regalo, where it is rule by  Mondo a well respected warlord - hey, I like calling him that and besides he does act like one, going back to business the island itself according to MAL's forum is constantly being invaded either by neighboring city states of Italy or criminal syndicates who wants to be thebig bosses of the island . Mondo's enforcers are composed of men in black with Arcana powers and I probably need not mention them, anyway the plot of this anime is about Mondo announcing  the opening of the so called \"Arcana Duello\" where he will award his daughter's hand in marriage and also replace him as the \"Papa\" of Arcana Famiglia........or at least that's what it was suppose to be, what we have instead is a series of episode with its own plot. The mentioned genre; Action, romance, mafia and supernatural didn't lived up as to what is expected, instead this anime revolves around a reverse harem that exist between Fecita, Liberta and Nova, so for the story I'm giving a a \"Poor\" number 3. That's because the story doesn't apply to the anime itself instead it was poorly divided among its episode. \\n\\n\r\nArt: Mediocre 5.\\n\\n\r\nI'm no art critic.\\n\\n\r\nSound: Good 7.\\n\\n\r\nI kind like the opening theme and I also find Felicita's  voice very cute.  \\n\\n\r\nCharacter, enjoyment and overall: Poor 3\\n\\n\r\nI really didn't like the way that the director of this anime wasted the talents of the characters, the director,Chiaki Kon could've used the characters potential relating to the fact that this anime has an action genre in it and the duello would have provided a nice entertainment for this anime, but alas the duello of the cast were done in the very last episode of this anime and quite frankly we audience were left hanging on the expected \"Arcana Duello.\" In fact the character's themselves where confined to do a kind of soap opera/ adventure thingy which make the enjoyment frustrating, I really didn't like the overall of this 12 episode thingy co'z at the first episode is a teaser makes one to think that this anime is gonna be awesome, but as you go on one would wonder as to what is taking the \"Arcana Duello\" so long, in the end this anime has turned us audience in an \"Il Matto\" which means \"fool\" in Latin, overall this anime is a \"RIP-OFF!\"   \\n\\n",
            "date": "2012-09-17T11:10:00+00:00",
            "helpful_count": 19,
            "mal_id": 72563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=72563"
        },
        {
            "content": "Arcana famiglia: An anime that has a good premise, but its lieing to you. its not what it makes it self out to be in the first episode. i honestly thought i found something interesting when i learned this anime was about a mafia tournament. the thing is, in the next  10 episodes just pussy foot around and doesnt get to the tournament until the last episode. And then, it delivers one of the worst endings i have ever seen. Today I review: La Storia della Arcana Famiglia\r\nStory: The story of arcana famiglia at episode 2 starts as a \"who will we save today\"or \" whose past sill we learn about today\" .  I might have been fine with this if i was only in the beginning . The thing is, they're not executed well. i found myself not immeresed in the story except for a few plot secrets the show had to offer, and when these where explaned, i expected more. The worst part was they hype up this big tournament episdode 1 and never get there till the end. Overall the story is much to be desired. 3/10\\n\\n\r\nArt: This show honestly has a unique art style and gets credit for that. that was one of the big reason i even watched the show. It is very fluid and looks very nice in the actions scenes it has. 8/10\\n\\n\r\nSound: this is an interesting department for the show, as it sounds great, but never really sticks out. the Opening is something u might actaully watch instead of skipping it every episode. 7/10\\n\\n\r\nCharacter: L0l@!. the most interesting characters were the ones who never got enough screen time, and while the main characters have some interest, they never truely get developed. they just do what one might expect and nothing really more. that being said, i did like some of the characters 4/10\\n\\n\r\nenjoyment: The only reason i enjoyed this anime even a little is the animation. It just fits the anime . when it come to my enjoyment of the story I kept hoping for more than the show actaully delivered to me. by the end i lost hope and was dissastified. the animation  and some of the comedy in the anime is really the only redeming factor for my enjoyment. 5/10\\n\\n\\n\r\noverall: this anime i would put below average and rate it with BAD. the pacing was terrible in the last episode ant left me feeling, \"why didnt u span this over the 2nd half of the series. if they had a tournament 6 episodes long. and spent the first  5 episodes with hardcore training, this show could have been something awesome. but overall, it just fails to deliver. 4/10\\n",
            "date": "2013-09-11T18:21:00+00:00",
            "helpful_count": 16,
            "mal_id": 112625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2176115.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Theanimepack",
                "username": "Theanimepack"
            },
            "url": "https://myanimelist.net/reviews.php?id=112625"
        },
        {
            "content": "La storia della Arcana Famiglia, most known by, simply, Arcana Famiglia, is a mafia anime. It's a so much interesting theme, don't you think? All these men with suits, guns and power atmosphere. All their mystery and charm, inherent of a mafia member surely will come with good characters and great stories, yeah? Yeah, the characters are great but the story... Uh... Keep reading and you will know what I'm talking...\r\nIn begining, you're introduced to Felicitá, the only daughter of Mondo, the mafia chef in Regalo island. This place has a lot of beauty and a safe population because the mafia efforts are much effective.But the members of this mafia have something more special than guns and knifes, they have Arcana powers, some type of magic controlled by emotions. Each Arcana power is based on a Tarocco card and Felicitá, our protagonist, has the power of Gli Amanti, the power of heart. She's a courageous and pretty girl, but she can't decide her own destiny because her father announced the Arcana Duello, a duel for all the Arcana users to decide who will be the next chef and who will marry Felicitá.\\n\\n\r\nThere is many guys wanting to win the Arcana Duello, specially Nova and Libertá. Nova is my favorite character, he's serious, shy and dedicated. Libertá is his opposite, funny, outgoing and irresponsible. They're Felicitá's best friends and their relationship are pretty well. Between them and Felicitá, of course. Nova and Libertá are mortal enemies. Another characters, like Luca, Felicitá's majordomo, Pace and Debito have funny moments and deep personalities. And Dante and Jolly too. I can bet that the characters will enchant you because I think that is the better point of this anime. My grade is 8, yeah!\\n\\n\r\nThe art and sounds are bad. Yeah, I think they worked in low budget all this time and didn't get a good result in this side. I can't see a good match with the music and the rest of anime... Argh, I will not comment more nothing about this. Next topic.\\n\\n\r\nBut the story is fair, we have a interesting plot, there's something uncommon in animes here: a girl with a lot of guys! (In the most, there is opposite, no?)\\n\r\nIf you are waiting action, give up. But if you want see good characters facing troubles and having fun, keep going.\\n\\n\r\nArcana Famiglia is fun and that's all. A good distraction, a few episodes and a weekend of adventures are waiting for you. My overall is 6 and that's not bad. I hope I helped you with this review.",
            "date": "2013-03-13T11:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 89635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2264983.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MShizuka",
                "username": "MShizuka"
            },
            "url": "https://myanimelist.net/reviews.php?id=89635"
        },
        {
            "content": "This is one of the best anime I have seen in a long time it has a great story, romance, its funny, and it keeps you wanting to watch more. I am not that into fighting animes but this one is so good I could not emagin people not liking this anime.",
            "date": "2012-08-21T23:06:00+00:00",
            "helpful_count": 10,
            "mal_id": 70565,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1457225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jnonymous",
                "username": "Jnonymous"
            },
            "url": "https://myanimelist.net/reviews.php?id=70565"
        },
        {
            "content": "When I heard that the otome game was becoming an anime, I was so excited. I really loved the Arcana Famiglia otome game, it really was so much fun. And I was hoping for a faithful adaptation of it.\r\nWhy thank you, J.C. Staff, for giving us the exact opposite.\r\nStory: 6\r\nWhile the story itself may seem good at first, don't be fooled. At least, in the anime, it starts off as side stories, kind of. They're kind of like minor events in the story. But the problem here is that it doesn't really improve. Without spoiling anyone who wants to watch this, it doesn't really amountto anything in the end. There's a lot of talk about friendship and bonds and stuff like that, and it seems as if a lot of the action happens off stage. I don't know, but there's something definitely lacking here. While it is interesting, you can laugh here and there, it's definitely not as good as the otome game. \\n\\n\r\nArt: 7\\n\\n\r\nThe art is, in my opinion, one of the commendable bits of the anime. While the anime is not amazing itself, the art is pretty good. Not comparable to the otome game, but it's still good. Although, I felt like I saw a few derpy faces here and there, but they were few and far between, so I didn't really mind. But the reason it's a seven and not an eight is because of the backgrounds. The backgrounds were recycled way too many times. While the animation itself was flash at first, I felt like it was only like that in the OP (and the ED is just some still motion pictures from the otoge). I felt kind of like the fluidity of the animation in the anime was watered down as the anime progressed, and that was really disappointing as well.\\n\\n\r\nSound: 8\\n\\n\r\nDespite the story, the seiyuus did an amazing job. They are the same seiyuus from the game, and maybe I'm a little biased because of that, but I still feel as if they did a good job. The OP and the ED were nice to listen to as well. Again, there was the case of reusing the same track again and again towards the end.\\n\\n\r\nCharacter: 5\\n\\n\r\nTHIS is it. This is where the shit hits the fan. And the problem relies mostly with the main character, our lovely Felicita. Now they tried to make a badass out of her, but failed when her inability to speak was discovered. While this is not so much of a problem in the otoge, this is a problem in the anime. Why does she even need a seiyuu? When given a chance to speak, Fel only asks, \"What's wrong?\" Or of course, the ever so famous \"C-could it be...?!\" Could it be WHAT? TELL me what it could be! I WANT TO KNOW. Now typically I wouldn't mind the \"C-could it be...?!\" but if the character follows it up with some kind of explanation or the other. However, every time Fel says that, she does not follow it up. In fact, she just stands there like a log. \\n\\n\r\nThe side characters were much more interesting, to be honest. Especially the Pace, Luca and Debito trio. If JCS had based the anime off these three, they would have gotten a lot more material for the anime itself.\\n\\n\r\nEnjoyment: 7\\n\\n\r\nIn the end, it was okay I suppose. It was definitely not the best thing I've ever seen, because every time I think about this anime, I'm going to remember how amazing the otoge was and be thoroughly disappointed. There were some times that I laughed, but other than that, not really. It was really just meh.\\n\\n\r\nOverall: 6\\n\\n\r\nIn the end, this felt like a really crap commercial for the otoge. I cannot say JCS did a good job with this. JCS has had quite a few good adaptations, but they've also had quite a few bad ones, and this is one of them. I cannot say I loved this, it was enjoyable at times. It was really disappointing, however. Those of you who have not played the otoge, I suggest you play it; it is about a million times better than this.",
            "date": "2012-10-10T20:38:00+00:00",
            "helpful_count": 10,
            "mal_id": 74635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557987.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Laciie",
                "username": "Laciie"
            },
            "url": "https://myanimelist.net/reviews.php?id=74635"
        },
        {
            "content": "I really wanted to like this anime. The first episode I watched gave me hope that this would be a good anime and so I decided to stick around, now I don't know if I should have. \r\nBasically there are 3 main characters. Nova, the katana wielding special forces guy in the Arcana family, he's a pretty serious looking guy from the outside, but he's got his soft spots for certain people. Probably the more mature one of the 3 mains. Next is Liberta who is your typical goofball that always ALWAYS follows his heart and doesn't really think things through. He's impulsive, but hidesa secret apparently. Then you have Felicita who's kind of independent, feels a sense love towards her comrades, but we're not really told if she has some kind of love interest in the other main characters. There's a number of other characters, but they're not explored deep into so they're not really that important. \\n\r\nIf I had to choose the most interesting one, it would probably be Nova? Why? You can relate to him to an extent that makes you care for him. Liberta is probably the weakest imho, his reasons just seem rather shallow so you end up (I did) rooting against him. Felicita well..she ends up being the love interest let's just say.\\n\\n\r\nThe storyline is somewhat strange to be honest. It tries to focus on this Duello or Duel that would reward the winner with Felicitas hand and of course any wish they want. This sounds great to start. Heck I love duels, who doesn't? Well from there you get to know the main characters better. A few episodes are spent on developing their chemistry, histories, etc, but then there seems to be some fillers in between in my opinion which detracts from the story, though I really like the focus on the characters, still the story line didn't really seem solid. I felt like it was missing something. It felt more like a harem with just better characters, if I could explain the feeling when I watched this anime. The Duello? That? It was plain garbage. I was so disappointed in the battles (they didn't even show all of them and the important ones they just put up crap), I was like man that's it? So disappointing. To top it off through out the episodes you were being let on to believe that Felicita would choose who she liked....well let me just tell you you're gonna be disappointed with the outcome. Hell I was. A LOT of people were. \\n\\n\r\nIn the end the anime had some potential. I thought the main characters were good, but that terrible story line and ending just completely bring down this anime. I really wanted to like it, but it just plain disappointed me. It ended up being almost garbage. 3 out of 10.",
            "date": "2012-09-17T01:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 72537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=72537"
        },
        {
            "content": "Yare yare~ All I can say is that I had really high hopes for this anime but NOOOOOOO they just had to make it into a crappy slice of life anime ughhhh what's the point of even mentioning the duello and the mafia. If they were to make into anime they should've just made it into a normal sparkly shoujo anime like it is without the supernatural powers and mafia. REALLY HOW IS THIS EVEN MAFIA. MAFIA IS KILLING, FIGHTING, ACTION,  if you wanna see a real MAFIA go and watch Baccano and Katekyo Hitman Reborn, heck even Durararais closer to mafia. Really don't even compare this to all the other beasty ass mafia anime like KHR and Baccano. \\n\r\n      And the characters UGHHHHH THE CHARACTERS the designs are really good but the MCs can they even be considered MCs? The 2 guys are so cliched and Fel doesn't even have personality. Honestly I liked everyone else, even the side characters better.\\n\r\n      And the Duello was only one day? WTF? I mean even IRL duels,tournament (fighting ones) take at least 3 days at least. This anime was a waste of time I'm a girl and did not enjoy this heck I'd rather get my ass in the kitchen.",
            "date": "2012-12-28T12:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 81712,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1869154.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CandyLemon3",
                "username": "CandyLemon3"
            },
            "url": "https://myanimelist.net/reviews.php?id=81712"
        },
        {
            "content": "After elegantly spectating the complex maze which subsides in the harem genre, meeting a reverse-harem anime immediately triggered an alarm in my head. The usual problem with the Harem Genre is the stupidity which the main male protagonist simultaneously seems to preveal. Just when you think it can't get any frustrating, it just gets worse. \r\nThe Reverse-Harem Genre seems like it could be just as bad. However, assuming is also considerably naive.\r\nThe plot of Arcana Famiglia resides in a very unique setting, where seemingly superantural themes are just being thrown randomly. Actually, it is. The central plot is the result of anime trying to adaptother cultures, and in this case, the Italians. The story centers around a Female named Felicita, who is a fine piece of 'ss by herself, and the plot basically sets up an indirect reverse harem of many guys chasing after her. It's more enjoyable than expected due to all the characters' foolish actions...\\n\\n\r\nahh running out of time so...\\n\\n\r\nCharacters create a fine atmosphere, aren't as frustrating as most harems. Developments are bond to happen between characters.\\n\\n\r\nThis anime should be listed as a slice of life, because that's all that's been happening. I recommend this to be picked up by romance/harem fans.\\n\\n\r\nHacked by Nova.",
            "date": "2012-07-23T15:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 67493,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MustachedNinja",
                "username": "MustachedNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=67493"
        },
        {
            "content": "This is not a spoiler free review. But trust me this Anime's not even worth your care to not be spoiled. If anything please don't waste your 12*25 minutes with this series. \r\nThis series is just horrid. Like holy moly is it bad. \r\nI actually was really looking forward to this one since Fukuyama Jun was playing a main and the character design (visually-wise) is actually pretty good. I really regret my decision to get into this. \r\nMy overall experience was just this constant irritation. Irritation because I can literally predict every singe thing that was gonna happen. This is mainly because the characters inthis Anime are, in every sense of the phrase, one-dimensional. It's that bad. I predicted every moment the Nova was gonna say \"Don't call me a chickpea\" I know Felicita wasn't going to save Papa. I predicted the punch Liberta gave Nova at the end and then they're going to be buddy buddy again with Liberta extending his hand out with a side of an extra hand from Felicita. There's just no interesting thing about this Anime ! I'm fine with cliches but when you can predict the freaking dialogue ? Oh god help me...\\n\\n\r\nThe powers are also just badly done I'm annoyed at the situation where Pink Haired girl was losing her memories to save Papa and then Jolly the suspicious guy's power is \"to forcefully bring back her memories\". Like thank F*CK for that convenience !! There's no showing, just a bunch of telling which absolutely mundane. Also what's the beef with Jolly anyways if you guys know his powers was to do that ? \\n\\n\r\nI also would like to point out that this series is like a scam to scam away your time (and my condolences to anyone who bought even a cheap Chinese CD of this). The first episode got you into thinking this Anime is going to be mostly about this Tournament between powered people and people sorting out their dramas, discovering things about themselves and such. Then in the next 10 episodes it has absolutely nothing, like really nothing. You'll get told the main characters past with no showing, you get your time wasted on things like Cat finding and Chasing and telling children scary stories and you'll keep asking yourself \"Where the heck is the tournament with all the action packed fighting ??\" Finally you get there in the very last episode and they literally treat 3 of the main characters like side characters. Felicita kicks their ass but of course we don't get to see it because the Director and Animators were lazy and decided \"We're just going to show them running to Felicita then skip to the scene where they get depressed from losing\". \\n\\n\r\nI was hoping for this series to be one of those short but interesting anime like Hataraku Maou-sama. I REALLY wanted to like this Anime but it is just disappointment. It's lazy, it's a waste of time and it is undoubtedly the WORST waste of potential I've ever seen.",
            "date": "2015-12-05T22:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 204887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4438639.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/UmiNoKami",
                "username": "UmiNoKami"
            },
            "url": "https://myanimelist.net/reviews.php?id=204887"
        },
        {
            "content": "I had really high hopes for this series.\r\nThough it is rated as a shoujo anime it has a lot of shonen elements in it.\r\nThe main characters are two boys, Liberta and Nova and one girl, Felicita, which also represent the main romance part of the story, which is based on a love triangle.\r\nFelicita which should be the main protagonist is the least recognizable character of the show. She is barely established as a unique character and seems replacable.\r\nLiberta and Nova both have had emotionally crippling events in their past which they have to overcome in order to protect what is dearest to them, their loveto Felicita.\\n\\n\r\nIt is far easier to identify with one of those two boys as you really care for them and grow to like them as the real protagonists of the show.\\n\\n\r\nMaybe this is only caused by me being male myself and i just don't understand the depth of a character Felicita presents but i doubt it.\\n\\n\r\nThe first episode is totally missleading as you would think that the whole anime would be centered around a great tournament, the arcana duello, perhaps with fights between the contestants staged between the character development episodes to show how much they have grown while constantly throwing new challenges at them.\\n\\n\r\nThis was the anime i expected but it turned out completely different.\\n\\n\r\nWithout ever announcing when or how this duello was to take place it turned into a bit of a sleight of life anime showing the daily life of the characters and focussing on their weaknesses and how they try to overcome them.\\n\\n\r\nThe character design is excellent with a few exceptions (Felicita being one of them).\\n\\n\r\nI really enjoyed the group of the slightly older members, Pace, Debito and Luca which all had very unique characteristica which resulted from their various pasts that are in a way all linked to each other.\\n\\n\r\nI simply loved the voice acting of Yoshino, Hiroyuki as Debito and the voices chosen for the other characters perfectly fit with them too.\\n\\n\r\nThe anime in itself is fun to watch and there are a lot of sideplots involving the other characters, expecially Jolly.\\n\\n\r\nBut all that builds up to nothing as the last episode smashes everything the writers have build up over the first 11 episodes into peaces.\\n\\n\r\nThe anime is clearly build to have a much larger set of episodes dedicated to it resuting in a grand finale, the arcano duello resolving the last of the subplots and ending in a decision for Felicita wether she will choose Liberta or Nova.\\n\\n\r\nBut it seems like the anime got discontinued on short notice making the 12th episode the final one.\\n\\n\r\nI have not read the correlating manga this anime is based on but by the pacing up till episode 11 i would guess we were storylike at least half-way through of what the manga has to offer.\\n\\n\r\nThe main story was shortened as much as possible to fit it all in one final episode leaving behind all of the subplots and further character development.\\n\\n\r\nIt is just a fast forward through the story to show what would have happened, which it also shows that there is no second season planned as they just could have left the story open for continuation should it be needed.\\n\\n\r\nThis also renders the show uncomplete and unsatisfactory. Though i enjoyed the anime pretty much up to this last episode i can only advise anyone planning to watch this anime not to do so unless you want to be really disappointed.\\n\\n\r\nIf you watch the last episode you don't even get the chance to just read the manga instead because it contains major spoilers for upcoming events (if it isn't an alternate ending).\\n\\n\r\nIf you really want to watch this series you should stop after episode 11 and pick up the manga for continuation.\\n\\n\r\nAs i said before i have not read the manga so far but from the storytelling and the good character-development i'm pretty sure that it will deliver a good enough experience and to be honest it can't be worse than the ending of the anime.",
            "date": "2012-09-17T14:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 72581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1176409.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Uryel",
                "username": "Uryel"
            },
            "url": "https://myanimelist.net/reviews.php?id=72581"
        },
        {
            "content": "Disclaimer: Going into this I had no idea that this anime was based of a game\r\nI will be frank, this was not a good anime plot-wise. It plays a sly trick by making the first episode good therefore drawing you in. Afterwards you was maybe 2 or 3 hours hoping the show gets better and it doesn't. The show does have it's good point though.\r\nStory-3\r\nIt seems like a very decent story at first but then the shows goes off on some tangent that is, IMO, unrelated to the plot presented in the first episode.In its attempt to evoke a emotional response from the audience itfall face first.\\n\\n\r\nArt-7\\n\\n\r\nThe artwork was very decent, one of the few highlights of this show. Character designs were very good.\\n\\n\r\nSound-6\\n\\n\r\nVoice acting was very good, also a highlight. OP and ED were not to my liking but that is personal preference.\\n\\n\r\nCharacter-8\\n\\n\r\nI love the characters. From their design to the voices and their personalities. On of the main things that kept me hooked for 6 painful episodes.\\n\\n\r\nOverall it was an anime that I found had a lot of potential but suffered poor execution. Never judge a book by its cover.",
            "date": "2012-12-01T19:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 78872,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/336113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seraphrim",
                "username": "Seraphrim"
            },
            "url": "https://myanimelist.net/reviews.php?id=78872"
        },
        {
            "content": "Here are some Q&A to help you get a grasp at what the anime is like. (SPOILER ALERT....kind of.)\r\nWhat kind of ending does Arcana Famiglia have?\r\nA: A round about way to end. No progression in relationship with other characters what so ever.\r\nHow is the action/violence in the anime?\r\nA: Yeah..... lame sword fighting..... thats it...... (Unless you want to include the powers which they don't use what so ever.)\r\nWho is the antagonist?\r\nA: What antagonist?\r\nOk, here's the actual review:\r\nStory:\r\nIt starts of near a city next to the ocean where a \"clan\" lives. They all have superpowers that hold great power. The head of the family wants hisdaughter to marry someone in the clan. The winner of a fighting contest will be able to marry daughter of the head. The result was.......pathetic. The majority of this anime was just background info on every main and supporting characters.\\n\\n\r\nArt:\\n\r\nAverage art in my opinion. It's not bad but not so spectacular.\\n\\n\r\nSound:\\n\r\nMusic was fine. Able to dramatize the situation the characters were caught in. Again nothing really that spectacular. \\n\\n\r\nCharacters:\\n\r\nThis was suppose to be amazing. They had awesome superpowers from a deck of god cards. They were suppose to use these cards agains evil!!! These characters COULD have brought this anime to the top, but did they? NO! All they did was random and pointless stuff. Their bonds might have deepen between themselves, but definitely not with the viewers of this anime. Because of their lack of \"motivation and moving forward and stuff\" I gave them a 4 instead of the 9 which they could have gotten to make this anime 400x better.\\n\\n\r\nEnjoyment:\\n\r\nIf you could;t tell already I had to push myself to finish this anime. It was lame. End of story.",
            "date": "2015-03-22T21:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 183106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4317017.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/mottowers",
                "username": "mottowers"
            },
            "url": "https://myanimelist.net/reviews.php?id=183106"
        }
    ],
    [
        {
            "content": "I'm a huge fan of shoujo, romance, and reverse harems; my absolute favorite is Ouran High School.\r\nSo I really, REALLY, wanted to enjoy this. \r\nThe art is beautiful, the characters are beautiful and all each unique in their own way.\r\nThe powers are very cool; very unique and original in concept.\r\nThe storyline seemed promising.\r\nEverything, seemed promising, everything has so much potential.\r\n\"So what's the problem here?\" You may ask.\r\nThe main character, is the problem.\r\nThe story revolves around one girl; named Felicita, she does not speak, does not have a personality, all she really honestly does is stand in the background of every scene and look pretty whilethe male characters do all the talking. \\n\\n\r\nWhen she does occasionally talk, it's \"eh?\" or \"What's wrong _____?\" \\n\\n\r\nShe only talks at appropriate times, when needed.\\n\\n\r\nShe just makes sounds, you find her character, very VERY, flat and robotic. \\n\\n\r\nAll of the male characters have more personality than her, SERIOUSLY. \\n\\n\r\nEven the side male characters that you know won't get the girl, talk more than her, they all have more personality than her.\\n\\n\r\nHer reactions to things and situations are either too downplayed, where it's as if she didn't or doesn't react to things at all, doesn't notice things around her, doesn't care almost.\\n\\n\r\nBut when the story forces her to care, it's overblown, and she suddenly cares SO much, it's unrealistic.\\n\\n\r\nI wanted to drop the show after the second episode was ALREADY a filler, it was an episode, about a cat, just some random stupid cat, and really would you spend an entire day looking for an owner of a cat. I was hoping that the owner of the cat would be someone important, but in the end it was just some random lady that had nothing to do with anything.\\n\\n\r\nA useless filler episode.\\n\\n\r\nThere wasn't any romance in the episode either, it was just honestly, a time waster.\\n\\n\r\nBut I kept watching anyways. \\n\\n\r\nEpisode three seemed like another filler, but it became potentially good at the end when the mystery child returns to Jolly, and a part of Liberta's past revealed. \\n\\n\r\nGiving us a thought that this might get darker and more serious, with Jolly's \"shady research\" and the strange child returning to him.\\n\\n\r\nWith Liberta's mysterious power, the episode left me wanting to know.\\n\\n\r\nFourth Episode, reveals liberta's past, but I felt as though it was all rushed and down very shabbily. \\n\\n\r\nIt just seemed half assed, it was good, but shown half assedly. \\n\\n\r\nIt just saddens me because this anime has SO much potential, so many wonderful characters, so many good ideas, but it's shown very lousily.\\n\\n\r\nSo with potentially good plots and ideas already wasted, and the main character's flat personality.\\n\\n\r\nI have sadly decided to drop this Anime.\\n\\n\r\nAlso a note: I understand that this is derived from a game, and since in the game you get to pick how you talk and interact with the characters, you basically choose the girl's personality, I do not understand why they chose to leave the main character's personality blank in the anime as well, you can't just imagine she has a personality, she has to have one if she's interacting with the other characters on her own, so leaving her quiet and blank most of the time, does not work in an anime. \\n\\n\r\nThey should have given her more personality, interests, quirks, dislikes, they should have just made her more human, and not just a blank pretty doll that's important because she's the daughter of a very important man, and very attractive, in my opinion. \\n\\n\r\nLike if you want to make a huge group of attractive men like her, then you have to sell her to us too, give us reasons as to why she's so likable, why do all the men want her as their wife? \\n\\n\r\nSo far the only reasons I've been able to notice is that she's attractive and the daughter of everyone's boss. \\n\\n\r\nAnd basically the only available girl in the anime; an attractive bachelorette with looks, money, and power.\\n\\n\r\nNothing actually deep like other than shallow attraction. \\n\\n\r\nYes Liberta likes her, a lot, but why, why does he like her so much?\\n\\n\r\nIs it just because she's the only girl his age in the anime? \\n\\n\r\nCome on.. \\n\\n\r\nInstead of wasting episodes and production on filler stuff, why didn't you use those episodes to develop the main story and to tell us why the main character is so desired?\\n\\n\r\nEither way.\\n\\n\r\nI'm done:\\n\\n\r\nStory - 7/10 \\n\r\n(Story is good and has potential but not presented well.)\\n\r\nArt - 9/10 \\n\r\n(The art is quality.)\\n\r\nSound - 10/10 \\n\r\n(The voice actors are superb.)\\n\r\nCharacter - 7/10\\n\r\n(All the male characters are good, but the main character's mother and father has more personality than she does herself.)\\n\r\nEnjoyment - 5/10\\n\r\n(Almost all the episodes except the first seemed like fillers to me, very boring, with attempts at making it more exciting.)\\n\\n\r\nOverall - 6/10",
            "date": "2012-07-26T11:47:00+00:00",
            "helpful_count": 229,
            "mal_id": 67797,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/848195.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/snoh",
                "username": "snoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=67797"
        },
        {
            "content": "To start my review, let me say that I don't necessarily hate Arcana Famiglia.\r\nI simply hate the payoff I got for watching it. Which was absolutely nothing.\r\nThe entire series looks as if it is building for this tournament that has been set to decide who will be the new leader of the Family and marries the boss' daughter.\r\nIn the first episode, you get some immediate development in the relationship between father and daughter plus daughter and coworkers. To add, there are some pretty nice powers being used and an awesome mysterious character with an awesome name looming in the background (Jolly). So, when the seriesstarts, you know where some people stand and how things are going to go.\\n\\n\r\nThe only thing is, it never goes there.\\n\\n\r\nArcana Famiglia gives you the build for this tournament that's soon to take place. Every episode is wasted on character development and character interaction. You see everyone's past and you even find the origin of the family. For a build-up, this is great, it helps strengthen character connection so that you root for a particular character to win when the fighting starts.\\n\\n\r\nThe fighting doesn't start. Ever.\\n\\n\r\nWatching the entire series would be worth it if it led to some awesome battle royal conclusion. It would even be awesome if a bunch of pirates just came and ruined said battle royal. Neither happens. All of the action is skipped and the powers aren't expanded on any further than episode one. They're explained, but they aren't expanded on.\\n\\n\r\nAnother thing, this has to be the only series I've seen where I think character development was a bad thing. The characters lose any finesse that they had when their lives are explored. The only exception was Jolly, who barely got any screentime in most of this series. And he didn't even participate in any real fighting. However, I can tell you exactly what his past is like and why he's so cold. That's absurd and just plain ridiculous.\\n\\n\r\nThe anime takes so much time in explaining every single character and having them fight their demons that we don't even see what their demons really are. They never come across any serious conflict and the only climax to look forward to is the tournament that's supposed to be the motherload of all battles.\\n\\n\r\nThe battling is non-existent. Chances are I said that earlier in the review, but I must emphasize how bad it was. For one, it was minimum. There was no intricate fighting nor any type of personalized moves. The tournament that the series builds up to becomes absolutely pointless with every new episode. The winner was even pointless and so was their \"resolve\" once they won. You really feel like a major butt for even watching the entire series for a climax that could've been the length of an average youtube video.\\n\\n\r\nAnd to make matters worst, it doesn't try to cover its flaws. Maybe a little fanservice or some nice cop-out scenes. Nope, not once. It burrows a reverse harem shtick that it can't even fully deliver on. You don't feel like these guys (with the exception of two) are all that into her.\\n\\n\r\nThere were no antagonists. There was minimum fighting. The romance barely showed and was ended on the weakest of terms. The characters don't live up to their reputations. The story blows major chunks.\\n\\n\r\nThe climax . . . faking it.",
            "date": "2013-02-27T20:14:00+00:00",
            "helpful_count": 223,
            "mal_id": 88099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1904192.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AuronPond",
                "username": "AuronPond"
            },
            "url": "https://myanimelist.net/reviews.php?id=88099"
        },
        {
            "content": "When La Storia Della Arcana Famiglia, or just Arcana Famiglia started airing, I was first surprised over how entertaining I found it, considering it was based on a dating sim visual novel for girls. The quality of the art and animations where good, the story appeared interesting, but most of all was the character gallery and their hidden powers very appealing.\r\nAfter watching the whole series I was saddened to see it was only the first episode that showed true potential of what this series might eventually have become had it not been for certain downfalls that I will try to explain bellow.\r\nThe story, which issupposed to be a love story with Felecità, and one of the male characters in the series never seems to advance.\\n\r\nMost episodes aren't even slightly connected to either Felecità or romance at all, and the typical rivaling struggle between the two male protagonists grows to be nothing but annoying over the course of the series.\\n\r\nFelecità remains more as a background accessory, whilst non of the male characters seems to be interested in her above the point of cheering her up when she is depressed. Which she happens to be in all the later episodes. This depression is also the only real emotion she expresses, which is kinda sad considering this is supposed to be a love story.\\n\\n\r\nHowever, the main factor that brings this series down from what it could have been is the way they neglect to explore any character. \\n\r\nIn most of the episodes we are introduced to a new characters personality and background, which could have become very interesting, had it not been for the fact that we only ever get to see the surface of every characters life. Not one single character throughout  the whole series is properly explored. We are only shown enough to know that \"There is a lot more to know\". \\n\r\nNot even the main characters are properly explored, which leaves us at loss as of what pasts all these people share.\\n\r\nWe are only shown glimpses of their pasts, and it is never properly explained what really happened between any of them.\\n\\n\r\nAll in all, Arcana Famiglia starts out with a great potential, and the very interesting character gallery, which end up being completely wasted due to the lack of progress the characters make, and non of them being properly introduced or explored.\\n\r\nWhen this series ended I honestly felt a little angry with the producers, having wasted a lot of potential, and made what could have been a super cool action/shoujo/romance into just another series nobody will remember in a year.\\n\\n\r\nNote that I have not played the game, but I sincerely hope and believe that it is much better than the anime.",
            "date": "2012-09-16T18:30:00+00:00",
            "helpful_count": 189,
            "mal_id": 72511,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284694.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Snodig",
                "username": "Snodig"
            },
            "url": "https://myanimelist.net/reviews.php?id=72511"
        },
        {
            "content": "Watching Arcana Familga is like reading an autobiography, you know..the sort of book a person writes about his or own life and it is usually full of all sorts of boring details. In any case, Arcana Famiglia is a strange series from the start. \r\nLa Storia Della Arcana Famiglia details a group of people who have made contracts with the Arcana cards to obtain special abilities in his or her own rights. On the birthday of the head of household, the Father decides to host a tournament -  a series of duels known as the  Arcana Duello, between Arcana-users. It is every onefor themselves because it's winner takes all. \\n\\n\r\nApparently, the series' promo depicts around a tournament but half way now through the series, what do we have?\\n\\n\r\n- cat/neko chasing\\n\r\n- babysitting \\n\r\n- rivalries between two of the main characters in a boring love triangle that has little flavor\\n\\n\r\nAt any rate, this series is not exactly the smash of the season and shouldn't be especially with throwing in fillers at the very get go. \\n\\n\r\nThe series continuously avoid the major story of the series but instead throws fillers at your face like apple pies. But the story is not as tasty. It lacks flavor of an apple pie because they are all fillers from the beginning. Although later on, we do see some storyline development (chiefly flashbacks), the main story so far is avoided. Furthermore, it seems that the flashbacks are cliched and stereotyped. Honestly, who on Earth is planning on sitting through over four episodes to watch some flashbacks? We want to see some movement and drama with the main arc! \\n\\n\r\nLuckily though, the character designs are cool. And of course, they need to be especially since everything up to this point has been focused on the characters of the tournament (you know, the one that hasn't yet officially begun yet). But towards the finale (yes the very last episode), the duel is finally presented. Even the duel itself has some problems though with one of the main characters actually withdrawing while other battles between our cute pigtailed girl being way too short and no flavor.\\n\\n\r\nFelicità is the main heroine of the series, the  holder of The Lovers arcana, which gives her the ability to read the hearts of others. She is spicy, she is cute, and she is to herself. And those little pigtails, who doesn't want to cuddle them? Beyond that though, she has some interesting interactions between two of the main characters, Libertà and Nova.\\n\\n\r\nThat brings to their rivalry.\\n\\n\r\nIt seems that Libertà and Nova often gets into fights like ying and yang. Just look at it. Every five minutes in the series, they fight out and competes sometimes over absolutely nothing. Libertà is depicted as the hot headed guy while Nova remains his cool. (most of the time) Regardless though, it gets old after watching it over 9000 times. Besides, there's already rivalries similar to this without the l for love in a certain ongoing series. Perhaps the Tail of the Fairies ring a bell? \\n\\n\r\nThe other characters of the series seem to be like background characters of a stage play so far despite their cool appearances. The bold headed guy who has the ace hands of a bazooka, the cool level headed guy with the eye patch, and the mysterious Jolly with his shades. I'm sure they will eventually get the opportunity to shine but so far, it's not happening. Besides maybe Jolly, everything seems so stale between the background characters. Yup, the apple pie is once again losing its flavor.\\n\\n\r\nLuckily, there is some minor good flavors for this disappointing anime so far. The soundtrack, namely the opening  song of the series seems to play well in this series. \\n\\n\r\nMagenta Another Sky\" by Hitomi Harada is well orchestrated and depicts the Arcana-users showing off some of their abilities in the sequences. The music is also catchy and as one of the first series to watch on Sundays, it's a pretty damn good way to start off the week, at least in the music department.\\n\\n\r\nThe art is also colorful in this series. It gives off an Italian like atmosphere and overall, demonstrated well with the cool looking characters, some backgrounds, and the mansion where the family stays at. \\n\\n\r\nOverall, to enjoy this series, you'd have to be a real brave fighter, one that is very patient and ignores the fillers but instead concentrate on other aspects of the \"story\". The first half of the series isn't one of the best ways to start off this originally hyped series. The \"story\" moves like a turtle and the apple pie is losing its touch. It's not too surprising that J.C. Staff's expectations didn't live up to the hype. \\n\\n\r\nWith all the filler episodes going on and the \"story\" moving so damn slow, it's no surprise that some people have dropped it. There should be limits on how to start a potential series but in this case, Arcana wasted it. It brings up boring sequences from the get go and fails to deliver anything unique to the viewers. While the art and music/Op song does somewhat makes up for this, it so far is anything but special. J.C. Staff you disappoint. No one likes reading an autobiography and especially of a series that originally had potential. \\n\\n\\n\\n",
            "date": "2012-08-11T14:36:00+00:00",
            "helpful_count": 77,
            "mal_id": 69443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=69443"
        },
        {
            "content": "La Storia Della Arcana Famiglia, or just Arcana Famiglia is one of those shows that when the new season came along, I read the synopsis and became fairly interested in it. I'm generally not the kind of person who tends to discriminate on anime based upon genre so I had no problem watching something labeled as shoujo, however, I became somewhat hesitant when I learned that it was based of an otome game aimed at young girls. (Please note that I have not played the game; I have only watched the anime.) Despite my hesitation, I watched the first episode and found it to beenjoyable. It was enjoyable enough that I showed my little sister it as well (who is a preteen and definitely within the target audience); she enjoyed it and from then on we watched it together.\\n\\n\r\nThe concept of the Arcana powers and the characters seemed interesting based off the the first episode. There was a lot of action in the first episode and the premise of a family-wide contest for the position of Papa (the big boss) and the protagonist's, Felicita's, hand in marriage was interesting as well. It provided a dilemma for her that would allow her to develop as a character while defending her right to choose who she marries. It had potential- in fact, the entire series had potential. Unfortunately, the series never comes close to fulfilling the potential it initially held with the protagonist remaining static and boring throughout and the event that I expected to span most of the series, the Duello, only spans the last episode and that itself was a disappointment, much like the rest of the series.\\n\\n\r\nFirst, let's talk about character development. There is none- well, nothing really besides an introduction to most of the characters. They never really delve deep into any one character. In fact, the most developed character is not the protagonist; the most developed characters are the two main male leads, Liberta and Nova who are in love with the protagonist. Even though they are the most developed I could never bring myself to really remotely care about them- I frankly found them annoying. In fact, the only thing I found interesting about the both of them was Liberta's mysterious Arcana Power. Felicita seemed less of a protagonist and more of a side character the entire series, only speaking when necessary and often seeming to go out of character by being overly-concerned or over-emotional only when the situation demands. (And her Arcana power is clearly just a tool made for the game's romances.)\\n\\n\r\nThe second topic of discussion is the art and animation. The art was nothing spectacular to me, however it did its job- most of the time. The characters never really looked bad, even the background characters seemed to be drawn well (besides the occasional derp character), however what really suffered was the background itself. I noticed several instances of just plain bad background art and the one in particular that really bugged me wasn't even noticed by me at first; it was noticed by my sister. A pirate ship in one of the episodes actually changed in art style at least three times in the same episode (and it really wasn't drawn well in the first place). Besides the art itself, the animation was not very good for the parts where it should have been good, namely the fight scenes. The fights seemed more like gifs that were just repeated at different times and at one point in the last episode, Nova's shoulder was definitely in a strange position.\\n\\n\r\nThe sound of the anime serves its purpose but does little else, it does not excel in any aspect. I personally like the opening song much better than the ending song, mostly because the guys can't sing.\\n\\n\r\nOverall, I don't have much good to say about this anime. With each passing episode, I prayed that it would get better. Unfortunately, my prayers were never answered; its potential having been completely wasted. This anime is bad; my sister, a member of the target audience, does not think that this show is good. If there was anything redeemable about the series, it would have to be the supporting cast because the main characters are all flat, boring, annoying, or a combination of all three.\\n\\n\r\n4/10 \\n",
            "date": "2012-09-25T19:03:00+00:00",
            "helpful_count": 30,
            "mal_id": 73303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474568.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Newmn84",
                "username": "Newmn84"
            },
            "url": "https://myanimelist.net/reviews.php?id=73303"
        },
        {
            "content": "Ooh Arcana Famiglia. I really wanted to enjoy this series...and to begin with, I actually did.\r\nThe setup was sublime. A mafia-esque vigilante organisation, known as The Family, is dedicated to protecting the port town of Regalo. Many members of the Family have made deals with the \"Arcana\", granting them abilities based on different tarot cards. Okay, interesting...\r\nThe head of the family announces he wishes to retire from his role and choose an heir by means of a grand tournament, in which all Family members with Arcana powers must duel until only the victor remains, who will become the new \"Papa\" of the family...and have hisdaughter Felicite's hand in marriage. Felicite violently objects to this sudden announcement, but has no way out of it unless she either wins the tournament herself, or the new Head of the Family grants her freedom.\\n\\n\r\nFelicite's two close friends, the rebellious Liberta and the moody Nova, both agree to grant Felicte's freedom if either of them win the tournament...even though both of them appear to share feelings for the girl, and constantly compete for her approval.\\n\\n\r\nIt was a great setup, with a solid concept and characters that weren't wholly original, but mostly likeable. The style is crisp with a pleasant colour scheme that gives is a classy but lively atmosphere.\\n\\n\r\nUnfortunately, in time it became clear that the series suffers from two CRIPPLING faults:\\n\\n\r\n1) Felicite is NOT a protagonist. A protagonist is supposed to be a driving force the moves the plot forward and who's actions are most influential to the story. However, Felicite, whilst certainly the FOCUS, does not exert any kind of force on the plot. She stands around, looks cutely puzzled or asks questions, and doesn't actually do anything unless promted to do so by another character. And it does beg the question: Why does she consider independence so valuable when she seems incapable of making independent decisions? Why is she so bothered about losing her freedom when she seems quite happy to just do what everyone tells her to do anyway? Now, this COULD have been an incredibly original and fascinating approach to a tired concept, and raised questions about the value of freedom for freedom's sake, or if there's any shame in admitting when you can't live the independent life you desire. Unfortunately it eventually became apparent that Felicite was just a poorly written protagonist with all the impact of a wet flannel, and hinging dangerously on looking like a fan-made Mary Sue.\\n\\n\r\n2) And by far worse: The series seems to be under the delusion that just MENTIONING a good idea is enough to constitute entertainment. It's...honestly a very unusual habit. It will bring up a fascinating concept or a promising plot point and then...forget about it. Case in point: The Family is referred to as a kind of vigilante organisation, and yet we barely see ANY vigilante activity throughout the whole series, they just become a bunch of characters in suits for no reason. Similarly, many of the arcana powers are mentioned, but go entirely unused. Even the tournament, which is set up as the main concept, is forgotten about until the end of the whole series!! But perhaps the most shocking example of this is when one character reveals an experiment he's been working on...I'll keep spoilers out of it, but suffice to say it is a pretty major project with staggering ethical ramifications and with massive potential effects on the whole Arcana concept. What happens to this experiment? Never mentioned or alluded to again. Ever. In any form. Like I said, the series believes that it just needs to mention a good idea to get an audience's attention, and then either forgets to follow through with it or doesn't believe it needs to. Some backstories never come to fruition, ideas are never explored, and a mass of potential is painfully squandered.\\n\\n\r\nSo, combine a weak protagonist with some extremely clumsy \"idea-only\" storytelling, and an entire tournament that feels like it was forgotten about and then slapped togehter at the last minute...and you can imagine that the ending of this show didn't leave me with a good taste in my mouth.\\n\\n\r\nThis show had so much potential, soo muuuch!! The setup was golden, the concept presented lots of possibilities, and most of the characters (Felicite aside) were actually very likeable and interesting, especially Debito, Pace and Luca. Even the humour, which is often a weak aspect in most anime, was pretty solid, either focusing on amusing character interactions or some well-timed slapstick. I also loved the picturesque, European design of Regalo, which created a very distinct setting.\\n\\n\r\nBut ultimately, all that was good about Arcana Famiglia was quickly buried by the efforts of overly-excited writers throwing in plot points and ideas without bothering to think how they'd tie into the story and how they'd resolve.\\n\\n\r\nA promising start that came to a bitter, frustrating end, and is only enjoyable on its most shallow level.",
            "date": "2012-12-01T05:18:00+00:00",
            "helpful_count": 25,
            "mal_id": 78796,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1839672.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheLastVeo",
                "username": "TheLastVeo"
            },
            "url": "https://myanimelist.net/reviews.php?id=78796"
        },
        {
            "content": "*Note: Due to a previous review I wrote, I am acknowledging beforehand that I have not read the visual novel. I am reviewing this anime solely on it's own story rather than it's accuracy as an adaptation.\r\nI have to admit, Arcana Famiglia is probably the most disappointing anime that I have seen this year. It's probably not the worst but DEFINITELY the most disappointing. It's got a good cast of characters and there's certainly nothing wrong with the artwork, music, or voice acting...however, a complete lack of story and the missed opportunity to show off the shonen aspect of this anime just derailed it.\r\nOverall, Ithought the strongest aspects of this anime was it's music and characters. The music fit the tone of the anime extremely well. It did have a very Italian feel to the music and I thought the OP and ED songs were very good as well. The only thing I would argue is the OP song didn't help my disappointment because it gave the feel that this was going to be an action-packed full-throttle anime and it turned out to be the exact opposite. \\n\\n\r\nAs for the characters, on the whole I thought they were pretty good. The characters on the whole were pretty likable. One of the few beefs that I did have with the characters was actually the lead herself, Felicita. Her character seemed so bland. I normally wouldn't have a problem with this if she were a side character, but the fact of the matter is this story revolved around her and her choices. Due to the lack of character with her, it became difficult to become invested in her. If Liberta or Nova were the main protagonist (which this anime gave some early direction to), it would've been much more tolerable. Those two characters seemed to have an interesting back story and appealing characteristics. Even the side characters such as Pace, Debito, Luca, Jolly, Dante, etc. had more character than Felicita. Overall, I thought all the side characters were solid...just the lead character was lacking.\\n\\n\r\nThe weakest part of this anime as aforementioned is the story. This story is just dreadful. However, to be honest, some aspects of it don't seem so bad. I did like the concept of Felicita having two arcana powers and using both of them together (in a sense) has the ability to save her father. I do actually find that pretty interesting. Therein lies the problem...that is the only interesting thing about this anime. This series basically opens up with Mondo announcing that they will be holding an Arcana Duello to determine who the next leader of the Arcana Famiglia will be. Okay, sounds like your typical shonen anime plot. So what happens over the next 11 episodes? We slowly and barely learn about Liberta and Nova's back story, how they can't control their powers and how they must slowly learn to control them before the Arcana Duello. Even then, that content actually takes up MAYBE 3 episodes...the rest of it is essentially character development padding. What I mean by that is, it's essentially padding since they are repeating similar events to show off each character's personality. It ends up mostly being a waste of time since we don't learn any more about the characters than we already know.\\n\\n\r\nSince the story was weak, surely the shonen-esque action sequences will surely make up for it, right? Actually, wrong. The action sequences in this anime were extremely weak and extremely poorly animated. There are even sequences where action scenes (especially in the final episode) aren't shown entirely or there are scenes where characters are fighting but you're seeing the expressions and thoughts of a spectator instead of the actual fight. It seemed as though the producers of this anime didn't trust their animators enough with action sequences that they just used this to cover up for it. It was a poor move and was extremely noticeable. \\n\\n\r\nMy overall thoughts on Arcana Famiglia is it had my interest piqued in the beginning, but as the series wore on, so did my expectations. It missed out on so many opportunities that it's hard to classify this anime. I'd call it a shonen but the action sequences were non-existent. I'd call it a romance but any time a romance was hinted at, it was brushed aside for more meaningless padding. I'd call it a drama but it really wasn't very dramatic. This anime essentially has no identinty and it really wouldn't shock me if I forget that I even watched this anime at one point. It really was that forgettable.\\n\\n",
            "date": "2012-09-17T05:51:00+00:00",
            "helpful_count": 20,
            "mal_id": 72547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=72547"
        },
        {
            "content": "I was very happy when i begin watching this, and the first episode caught me. The mafia thing isn't that original, but the idea to bind that with tarot cards with powers. That was an unexpected thing to me, and made me to watch. Like I said in other posts : Never judge a anime by its first episode, the sentence applys to this. First episode was good, others : Ehhh\r\nI liked some characters, but the story didn't help to develop them. And the whole plot turned boring. When i was almost finishing, i thought things would change, but i got disappointed another time.\r\nWell, theart and sound are good, in my opinion, but it's not enough to save the disaster.",
            "date": "2012-12-01T05:47:00+00:00",
            "helpful_count": 19,
            "mal_id": 78800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1579475.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fukitsu",
                "username": "Fukitsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=78800"
        },
        {
            "content": "Bujorno everyone! Now I've completed this 12 episode rip-off, I think it is now time to make a review as to how disgusted I am with this kind of anime. Ok, so the story of this rip-off thing is about a family of well-loved thugs in the island of Regalo, where it is rule by  Mondo a well respected warlord - hey, I like calling him that and besides he does act like one, going back to business the island itself according to MAL's forum is constantly being invaded either by neighboring city states of Italy or criminal syndicates who wants to be thebig bosses of the island . Mondo's enforcers are composed of men in black with Arcana powers and I probably need not mention them, anyway the plot of this anime is about Mondo announcing  the opening of the so called \"Arcana Duello\" where he will award his daughter's hand in marriage and also replace him as the \"Papa\" of Arcana Famiglia........or at least that's what it was suppose to be, what we have instead is a series of episode with its own plot. The mentioned genre; Action, romance, mafia and supernatural didn't lived up as to what is expected, instead this anime revolves around a reverse harem that exist between Fecita, Liberta and Nova, so for the story I'm giving a a \"Poor\" number 3. That's because the story doesn't apply to the anime itself instead it was poorly divided among its episode. \\n\\n\r\nArt: Mediocre 5.\\n\\n\r\nI'm no art critic.\\n\\n\r\nSound: Good 7.\\n\\n\r\nI kind like the opening theme and I also find Felicita's  voice very cute.  \\n\\n\r\nCharacter, enjoyment and overall: Poor 3\\n\\n\r\nI really didn't like the way that the director of this anime wasted the talents of the characters, the director,Chiaki Kon could've used the characters potential relating to the fact that this anime has an action genre in it and the duello would have provided a nice entertainment for this anime, but alas the duello of the cast were done in the very last episode of this anime and quite frankly we audience were left hanging on the expected \"Arcana Duello.\" In fact the character's themselves where confined to do a kind of soap opera/ adventure thingy which make the enjoyment frustrating, I really didn't like the overall of this 12 episode thingy co'z at the first episode is a teaser makes one to think that this anime is gonna be awesome, but as you go on one would wonder as to what is taking the \"Arcana Duello\" so long, in the end this anime has turned us audience in an \"Il Matto\" which means \"fool\" in Latin, overall this anime is a \"RIP-OFF!\"   \\n\\n",
            "date": "2012-09-17T11:10:00+00:00",
            "helpful_count": 19,
            "mal_id": 72563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=72563"
        },
        {
            "content": "Arcana famiglia: An anime that has a good premise, but its lieing to you. its not what it makes it self out to be in the first episode. i honestly thought i found something interesting when i learned this anime was about a mafia tournament. the thing is, in the next  10 episodes just pussy foot around and doesnt get to the tournament until the last episode. And then, it delivers one of the worst endings i have ever seen. Today I review: La Storia della Arcana Famiglia\r\nStory: The story of arcana famiglia at episode 2 starts as a \"who will we save today\"or \" whose past sill we learn about today\" .  I might have been fine with this if i was only in the beginning . The thing is, they're not executed well. i found myself not immeresed in the story except for a few plot secrets the show had to offer, and when these where explaned, i expected more. The worst part was they hype up this big tournament episdode 1 and never get there till the end. Overall the story is much to be desired. 3/10\\n\\n\r\nArt: This show honestly has a unique art style and gets credit for that. that was one of the big reason i even watched the show. It is very fluid and looks very nice in the actions scenes it has. 8/10\\n\\n\r\nSound: this is an interesting department for the show, as it sounds great, but never really sticks out. the Opening is something u might actaully watch instead of skipping it every episode. 7/10\\n\\n\r\nCharacter: L0l@!. the most interesting characters were the ones who never got enough screen time, and while the main characters have some interest, they never truely get developed. they just do what one might expect and nothing really more. that being said, i did like some of the characters 4/10\\n\\n\r\nenjoyment: The only reason i enjoyed this anime even a little is the animation. It just fits the anime . when it come to my enjoyment of the story I kept hoping for more than the show actaully delivered to me. by the end i lost hope and was dissastified. the animation  and some of the comedy in the anime is really the only redeming factor for my enjoyment. 5/10\\n\\n\\n\r\noverall: this anime i would put below average and rate it with BAD. the pacing was terrible in the last episode ant left me feeling, \"why didnt u span this over the 2nd half of the series. if they had a tournament 6 episodes long. and spent the first  5 episodes with hardcore training, this show could have been something awesome. but overall, it just fails to deliver. 4/10\\n",
            "date": "2013-09-11T18:21:00+00:00",
            "helpful_count": 16,
            "mal_id": 112625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2176115.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Theanimepack",
                "username": "Theanimepack"
            },
            "url": "https://myanimelist.net/reviews.php?id=112625"
        },
        {
            "content": "La storia della Arcana Famiglia, most known by, simply, Arcana Famiglia, is a mafia anime. It's a so much interesting theme, don't you think? All these men with suits, guns and power atmosphere. All their mystery and charm, inherent of a mafia member surely will come with good characters and great stories, yeah? Yeah, the characters are great but the story... Uh... Keep reading and you will know what I'm talking...\r\nIn begining, you're introduced to Felicitá, the only daughter of Mondo, the mafia chef in Regalo island. This place has a lot of beauty and a safe population because the mafia efforts are much effective.But the members of this mafia have something more special than guns and knifes, they have Arcana powers, some type of magic controlled by emotions. Each Arcana power is based on a Tarocco card and Felicitá, our protagonist, has the power of Gli Amanti, the power of heart. She's a courageous and pretty girl, but she can't decide her own destiny because her father announced the Arcana Duello, a duel for all the Arcana users to decide who will be the next chef and who will marry Felicitá.\\n\\n\r\nThere is many guys wanting to win the Arcana Duello, specially Nova and Libertá. Nova is my favorite character, he's serious, shy and dedicated. Libertá is his opposite, funny, outgoing and irresponsible. They're Felicitá's best friends and their relationship are pretty well. Between them and Felicitá, of course. Nova and Libertá are mortal enemies. Another characters, like Luca, Felicitá's majordomo, Pace and Debito have funny moments and deep personalities. And Dante and Jolly too. I can bet that the characters will enchant you because I think that is the better point of this anime. My grade is 8, yeah!\\n\\n\r\nThe art and sounds are bad. Yeah, I think they worked in low budget all this time and didn't get a good result in this side. I can't see a good match with the music and the rest of anime... Argh, I will not comment more nothing about this. Next topic.\\n\\n\r\nBut the story is fair, we have a interesting plot, there's something uncommon in animes here: a girl with a lot of guys! (In the most, there is opposite, no?)\\n\r\nIf you are waiting action, give up. But if you want see good characters facing troubles and having fun, keep going.\\n\\n\r\nArcana Famiglia is fun and that's all. A good distraction, a few episodes and a weekend of adventures are waiting for you. My overall is 6 and that's not bad. I hope I helped you with this review.",
            "date": "2013-03-13T11:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 89635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2264983.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MShizuka",
                "username": "MShizuka"
            },
            "url": "https://myanimelist.net/reviews.php?id=89635"
        },
        {
            "content": "This is one of the best anime I have seen in a long time it has a great story, romance, its funny, and it keeps you wanting to watch more. I am not that into fighting animes but this one is so good I could not emagin people not liking this anime.",
            "date": "2012-08-21T23:06:00+00:00",
            "helpful_count": 10,
            "mal_id": 70565,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1457225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jnonymous",
                "username": "Jnonymous"
            },
            "url": "https://myanimelist.net/reviews.php?id=70565"
        },
        {
            "content": "When I heard that the otome game was becoming an anime, I was so excited. I really loved the Arcana Famiglia otome game, it really was so much fun. And I was hoping for a faithful adaptation of it.\r\nWhy thank you, J.C. Staff, for giving us the exact opposite.\r\nStory: 6\r\nWhile the story itself may seem good at first, don't be fooled. At least, in the anime, it starts off as side stories, kind of. They're kind of like minor events in the story. But the problem here is that it doesn't really improve. Without spoiling anyone who wants to watch this, it doesn't really amountto anything in the end. There's a lot of talk about friendship and bonds and stuff like that, and it seems as if a lot of the action happens off stage. I don't know, but there's something definitely lacking here. While it is interesting, you can laugh here and there, it's definitely not as good as the otome game. \\n\\n\r\nArt: 7\\n\\n\r\nThe art is, in my opinion, one of the commendable bits of the anime. While the anime is not amazing itself, the art is pretty good. Not comparable to the otome game, but it's still good. Although, I felt like I saw a few derpy faces here and there, but they were few and far between, so I didn't really mind. But the reason it's a seven and not an eight is because of the backgrounds. The backgrounds were recycled way too many times. While the animation itself was flash at first, I felt like it was only like that in the OP (and the ED is just some still motion pictures from the otoge). I felt kind of like the fluidity of the animation in the anime was watered down as the anime progressed, and that was really disappointing as well.\\n\\n\r\nSound: 8\\n\\n\r\nDespite the story, the seiyuus did an amazing job. They are the same seiyuus from the game, and maybe I'm a little biased because of that, but I still feel as if they did a good job. The OP and the ED were nice to listen to as well. Again, there was the case of reusing the same track again and again towards the end.\\n\\n\r\nCharacter: 5\\n\\n\r\nTHIS is it. This is where the shit hits the fan. And the problem relies mostly with the main character, our lovely Felicita. Now they tried to make a badass out of her, but failed when her inability to speak was discovered. While this is not so much of a problem in the otoge, this is a problem in the anime. Why does she even need a seiyuu? When given a chance to speak, Fel only asks, \"What's wrong?\" Or of course, the ever so famous \"C-could it be...?!\" Could it be WHAT? TELL me what it could be! I WANT TO KNOW. Now typically I wouldn't mind the \"C-could it be...?!\" but if the character follows it up with some kind of explanation or the other. However, every time Fel says that, she does not follow it up. In fact, she just stands there like a log. \\n\\n\r\nThe side characters were much more interesting, to be honest. Especially the Pace, Luca and Debito trio. If JCS had based the anime off these three, they would have gotten a lot more material for the anime itself.\\n\\n\r\nEnjoyment: 7\\n\\n\r\nIn the end, it was okay I suppose. It was definitely not the best thing I've ever seen, because every time I think about this anime, I'm going to remember how amazing the otoge was and be thoroughly disappointed. There were some times that I laughed, but other than that, not really. It was really just meh.\\n\\n\r\nOverall: 6\\n\\n\r\nIn the end, this felt like a really crap commercial for the otoge. I cannot say JCS did a good job with this. JCS has had quite a few good adaptations, but they've also had quite a few bad ones, and this is one of them. I cannot say I loved this, it was enjoyable at times. It was really disappointing, however. Those of you who have not played the otoge, I suggest you play it; it is about a million times better than this.",
            "date": "2012-10-10T20:38:00+00:00",
            "helpful_count": 10,
            "mal_id": 74635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/557987.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Laciie",
                "username": "Laciie"
            },
            "url": "https://myanimelist.net/reviews.php?id=74635"
        },
        {
            "content": "I really wanted to like this anime. The first episode I watched gave me hope that this would be a good anime and so I decided to stick around, now I don't know if I should have. \r\nBasically there are 3 main characters. Nova, the katana wielding special forces guy in the Arcana family, he's a pretty serious looking guy from the outside, but he's got his soft spots for certain people. Probably the more mature one of the 3 mains. Next is Liberta who is your typical goofball that always ALWAYS follows his heart and doesn't really think things through. He's impulsive, but hidesa secret apparently. Then you have Felicita who's kind of independent, feels a sense love towards her comrades, but we're not really told if she has some kind of love interest in the other main characters. There's a number of other characters, but they're not explored deep into so they're not really that important. \\n\r\nIf I had to choose the most interesting one, it would probably be Nova? Why? You can relate to him to an extent that makes you care for him. Liberta is probably the weakest imho, his reasons just seem rather shallow so you end up (I did) rooting against him. Felicita well..she ends up being the love interest let's just say.\\n\\n\r\nThe storyline is somewhat strange to be honest. It tries to focus on this Duello or Duel that would reward the winner with Felicitas hand and of course any wish they want. This sounds great to start. Heck I love duels, who doesn't? Well from there you get to know the main characters better. A few episodes are spent on developing their chemistry, histories, etc, but then there seems to be some fillers in between in my opinion which detracts from the story, though I really like the focus on the characters, still the story line didn't really seem solid. I felt like it was missing something. It felt more like a harem with just better characters, if I could explain the feeling when I watched this anime. The Duello? That? It was plain garbage. I was so disappointed in the battles (they didn't even show all of them and the important ones they just put up crap), I was like man that's it? So disappointing. To top it off through out the episodes you were being let on to believe that Felicita would choose who she liked....well let me just tell you you're gonna be disappointed with the outcome. Hell I was. A LOT of people were. \\n\\n\r\nIn the end the anime had some potential. I thought the main characters were good, but that terrible story line and ending just completely bring down this anime. I really wanted to like it, but it just plain disappointed me. It ended up being almost garbage. 3 out of 10.",
            "date": "2012-09-17T01:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 72537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=72537"
        },
        {
            "content": "Yare yare~ All I can say is that I had really high hopes for this anime but NOOOOOOO they just had to make it into a crappy slice of life anime ughhhh what's the point of even mentioning the duello and the mafia. If they were to make into anime they should've just made it into a normal sparkly shoujo anime like it is without the supernatural powers and mafia. REALLY HOW IS THIS EVEN MAFIA. MAFIA IS KILLING, FIGHTING, ACTION,  if you wanna see a real MAFIA go and watch Baccano and Katekyo Hitman Reborn, heck even Durararais closer to mafia. Really don't even compare this to all the other beasty ass mafia anime like KHR and Baccano. \\n\r\n      And the characters UGHHHHH THE CHARACTERS the designs are really good but the MCs can they even be considered MCs? The 2 guys are so cliched and Fel doesn't even have personality. Honestly I liked everyone else, even the side characters better.\\n\r\n      And the Duello was only one day? WTF? I mean even IRL duels,tournament (fighting ones) take at least 3 days at least. This anime was a waste of time I'm a girl and did not enjoy this heck I'd rather get my ass in the kitchen.",
            "date": "2012-12-28T12:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 81712,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1869154.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CandyLemon3",
                "username": "CandyLemon3"
            },
            "url": "https://myanimelist.net/reviews.php?id=81712"
        },
        {
            "content": "After elegantly spectating the complex maze which subsides in the harem genre, meeting a reverse-harem anime immediately triggered an alarm in my head. The usual problem with the Harem Genre is the stupidity which the main male protagonist simultaneously seems to preveal. Just when you think it can't get any frustrating, it just gets worse. \r\nThe Reverse-Harem Genre seems like it could be just as bad. However, assuming is also considerably naive.\r\nThe plot of Arcana Famiglia resides in a very unique setting, where seemingly superantural themes are just being thrown randomly. Actually, it is. The central plot is the result of anime trying to adaptother cultures, and in this case, the Italians. The story centers around a Female named Felicita, who is a fine piece of 'ss by herself, and the plot basically sets up an indirect reverse harem of many guys chasing after her. It's more enjoyable than expected due to all the characters' foolish actions...\\n\\n\r\nahh running out of time so...\\n\\n\r\nCharacters create a fine atmosphere, aren't as frustrating as most harems. Developments are bond to happen between characters.\\n\\n\r\nThis anime should be listed as a slice of life, because that's all that's been happening. I recommend this to be picked up by romance/harem fans.\\n\\n\r\nHacked by Nova.",
            "date": "2012-07-23T15:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 67493,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MustachedNinja",
                "username": "MustachedNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=67493"
        },
        {
            "content": "This is not a spoiler free review. But trust me this Anime's not even worth your care to not be spoiled. If anything please don't waste your 12*25 minutes with this series. \r\nThis series is just horrid. Like holy moly is it bad. \r\nI actually was really looking forward to this one since Fukuyama Jun was playing a main and the character design (visually-wise) is actually pretty good. I really regret my decision to get into this. \r\nMy overall experience was just this constant irritation. Irritation because I can literally predict every singe thing that was gonna happen. This is mainly because the characters inthis Anime are, in every sense of the phrase, one-dimensional. It's that bad. I predicted every moment the Nova was gonna say \"Don't call me a chickpea\" I know Felicita wasn't going to save Papa. I predicted the punch Liberta gave Nova at the end and then they're going to be buddy buddy again with Liberta extending his hand out with a side of an extra hand from Felicita. There's just no interesting thing about this Anime ! I'm fine with cliches but when you can predict the freaking dialogue ? Oh god help me...\\n\\n\r\nThe powers are also just badly done I'm annoyed at the situation where Pink Haired girl was losing her memories to save Papa and then Jolly the suspicious guy's power is \"to forcefully bring back her memories\". Like thank F*CK for that convenience !! There's no showing, just a bunch of telling which absolutely mundane. Also what's the beef with Jolly anyways if you guys know his powers was to do that ? \\n\\n\r\nI also would like to point out that this series is like a scam to scam away your time (and my condolences to anyone who bought even a cheap Chinese CD of this). The first episode got you into thinking this Anime is going to be mostly about this Tournament between powered people and people sorting out their dramas, discovering things about themselves and such. Then in the next 10 episodes it has absolutely nothing, like really nothing. You'll get told the main characters past with no showing, you get your time wasted on things like Cat finding and Chasing and telling children scary stories and you'll keep asking yourself \"Where the heck is the tournament with all the action packed fighting ??\" Finally you get there in the very last episode and they literally treat 3 of the main characters like side characters. Felicita kicks their ass but of course we don't get to see it because the Director and Animators were lazy and decided \"We're just going to show them running to Felicita then skip to the scene where they get depressed from losing\". \\n\\n\r\nI was hoping for this series to be one of those short but interesting anime like Hataraku Maou-sama. I REALLY wanted to like this Anime but it is just disappointment. It's lazy, it's a waste of time and it is undoubtedly the WORST waste of potential I've ever seen.",
            "date": "2015-12-05T22:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 204887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4438639.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/UmiNoKami",
                "username": "UmiNoKami"
            },
            "url": "https://myanimelist.net/reviews.php?id=204887"
        },
        {
            "content": "I had really high hopes for this series.\r\nThough it is rated as a shoujo anime it has a lot of shonen elements in it.\r\nThe main characters are two boys, Liberta and Nova and one girl, Felicita, which also represent the main romance part of the story, which is based on a love triangle.\r\nFelicita which should be the main protagonist is the least recognizable character of the show. She is barely established as a unique character and seems replacable.\r\nLiberta and Nova both have had emotionally crippling events in their past which they have to overcome in order to protect what is dearest to them, their loveto Felicita.\\n\\n\r\nIt is far easier to identify with one of those two boys as you really care for them and grow to like them as the real protagonists of the show.\\n\\n\r\nMaybe this is only caused by me being male myself and i just don't understand the depth of a character Felicita presents but i doubt it.\\n\\n\r\nThe first episode is totally missleading as you would think that the whole anime would be centered around a great tournament, the arcana duello, perhaps with fights between the contestants staged between the character development episodes to show how much they have grown while constantly throwing new challenges at them.\\n\\n\r\nThis was the anime i expected but it turned out completely different.\\n\\n\r\nWithout ever announcing when or how this duello was to take place it turned into a bit of a sleight of life anime showing the daily life of the characters and focussing on their weaknesses and how they try to overcome them.\\n\\n\r\nThe character design is excellent with a few exceptions (Felicita being one of them).\\n\\n\r\nI really enjoyed the group of the slightly older members, Pace, Debito and Luca which all had very unique characteristica which resulted from their various pasts that are in a way all linked to each other.\\n\\n\r\nI simply loved the voice acting of Yoshino, Hiroyuki as Debito and the voices chosen for the other characters perfectly fit with them too.\\n\\n\r\nThe anime in itself is fun to watch and there are a lot of sideplots involving the other characters, expecially Jolly.\\n\\n\r\nBut all that builds up to nothing as the last episode smashes everything the writers have build up over the first 11 episodes into peaces.\\n\\n\r\nThe anime is clearly build to have a much larger set of episodes dedicated to it resuting in a grand finale, the arcano duello resolving the last of the subplots and ending in a decision for Felicita wether she will choose Liberta or Nova.\\n\\n\r\nBut it seems like the anime got discontinued on short notice making the 12th episode the final one.\\n\\n\r\nI have not read the correlating manga this anime is based on but by the pacing up till episode 11 i would guess we were storylike at least half-way through of what the manga has to offer.\\n\\n\r\nThe main story was shortened as much as possible to fit it all in one final episode leaving behind all of the subplots and further character development.\\n\\n\r\nIt is just a fast forward through the story to show what would have happened, which it also shows that there is no second season planned as they just could have left the story open for continuation should it be needed.\\n\\n\r\nThis also renders the show uncomplete and unsatisfactory. Though i enjoyed the anime pretty much up to this last episode i can only advise anyone planning to watch this anime not to do so unless you want to be really disappointed.\\n\\n\r\nIf you watch the last episode you don't even get the chance to just read the manga instead because it contains major spoilers for upcoming events (if it isn't an alternate ending).\\n\\n\r\nIf you really want to watch this series you should stop after episode 11 and pick up the manga for continuation.\\n\\n\r\nAs i said before i have not read the manga so far but from the storytelling and the good character-development i'm pretty sure that it will deliver a good enough experience and to be honest it can't be worse than the ending of the anime.",
            "date": "2012-09-17T14:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 72581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1176409.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Uryel",
                "username": "Uryel"
            },
            "url": "https://myanimelist.net/reviews.php?id=72581"
        },
        {
            "content": "Disclaimer: Going into this I had no idea that this anime was based of a game\r\nI will be frank, this was not a good anime plot-wise. It plays a sly trick by making the first episode good therefore drawing you in. Afterwards you was maybe 2 or 3 hours hoping the show gets better and it doesn't. The show does have it's good point though.\r\nStory-3\r\nIt seems like a very decent story at first but then the shows goes off on some tangent that is, IMO, unrelated to the plot presented in the first episode.In its attempt to evoke a emotional response from the audience itfall face first.\\n\\n\r\nArt-7\\n\\n\r\nThe artwork was very decent, one of the few highlights of this show. Character designs were very good.\\n\\n\r\nSound-6\\n\\n\r\nVoice acting was very good, also a highlight. OP and ED were not to my liking but that is personal preference.\\n\\n\r\nCharacter-8\\n\\n\r\nI love the characters. From their design to the voices and their personalities. On of the main things that kept me hooked for 6 painful episodes.\\n\\n\r\nOverall it was an anime that I found had a lot of potential but suffered poor execution. Never judge a book by its cover.",
            "date": "2012-12-01T19:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 78872,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/336113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seraphrim",
                "username": "Seraphrim"
            },
            "url": "https://myanimelist.net/reviews.php?id=78872"
        },
        {
            "content": "Here are some Q&A to help you get a grasp at what the anime is like. (SPOILER ALERT....kind of.)\r\nWhat kind of ending does Arcana Famiglia have?\r\nA: A round about way to end. No progression in relationship with other characters what so ever.\r\nHow is the action/violence in the anime?\r\nA: Yeah..... lame sword fighting..... thats it...... (Unless you want to include the powers which they don't use what so ever.)\r\nWho is the antagonist?\r\nA: What antagonist?\r\nOk, here's the actual review:\r\nStory:\r\nIt starts of near a city next to the ocean where a \"clan\" lives. They all have superpowers that hold great power. The head of the family wants hisdaughter to marry someone in the clan. The winner of a fighting contest will be able to marry daughter of the head. The result was.......pathetic. The majority of this anime was just background info on every main and supporting characters.\\n\\n\r\nArt:\\n\r\nAverage art in my opinion. It's not bad but not so spectacular.\\n\\n\r\nSound:\\n\r\nMusic was fine. Able to dramatize the situation the characters were caught in. Again nothing really that spectacular. \\n\\n\r\nCharacters:\\n\r\nThis was suppose to be amazing. They had awesome superpowers from a deck of god cards. They were suppose to use these cards agains evil!!! These characters COULD have brought this anime to the top, but did they? NO! All they did was random and pointless stuff. Their bonds might have deepen between themselves, but definitely not with the viewers of this anime. Because of their lack of \"motivation and moving forward and stuff\" I gave them a 4 instead of the 9 which they could have gotten to make this anime 400x better.\\n\\n\r\nEnjoyment:\\n\r\nIf you could;t tell already I had to push myself to finish this anime. It was lame. End of story.",
            "date": "2015-03-22T21:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 183106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4317017.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/mottowers",
                "username": "mottowers"
            },
            "url": "https://myanimelist.net/reviews.php?id=183106"
        }
    ],
    [
        {
            "content": "**** This review might contain some spoilers ****\r\n[STORY] - 5/10\r\n-----------\r\nThe story was overall average. The plot and the climax didn't really start until mid way, so I had to watch a couple episodes for it to get interesting. I was hoping for more action when it was time for the Arcana Duello. Instead, the whole match was held in less than one episode. The ending was also kind of a disappointment, but it could've been worse. Although it was a happy ending, the ending seemed very sudden. \r\n[ART] - 7/10\r\n-----------\r\nThis anime aired in 2012, so I would expect the quality to me high and clear.This anime's cut scenes were pretty blurry, and the background / scenery was very 'non-detailed'. Although, when it came to where the anime focused on the most, the details were spot on. \\n\\n\r\n[SOUND] - 8/10\\n\r\n-----------\\n\r\nThe subbed version of this anime was overall great! The opening theme really gave me that action genre vibe, and the opening wasn't bad at all. I don't really know how to feel about the ending theme though. Also, the anime really had a lack of adding background music when it was necessary. \\n\\n\r\n[CHARACTER] - 9/10\\n\r\n-----------\\n\r\nAll the characters in this anime was very well detailed and very well acted. Each main character had their own unique personality, their own appearances, and own supernatural powers. I especially really liked the fact that all leading characters had their own unique Arcana powers. \\n\\n\r\n[ENJOYMENT] - 6/10\\n\r\n-----------\\n\r\nLike I said in the beginning of this review, this anime didn't really get interesting until mid way through, so I didn't really enjoy this anime that much. The part where Princess lost her memories was where I found the most interesting. I've also previously mentioned that the ending (in my opinion) was just a little sloppy. \\n\\n\r\n[OVERALL] - 7/10\\n\r\n-----------\\n\r\nOverall, this anime was average. I would watch it again if I had nothing to watch, but I wouldn't rewatch it for fun. This anime would've been better if it went into a little bit more into detail when it came to certain events, instead of clumping them all together into a couple of minutes, especially the Arcana Duello. I was really hoping for more action during many of the major events that happened in this anime. \\n\\n\r\nFINAL SCORE: \\n\r\n7/10",
            "date": "2018-10-24T20:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 292517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6159701.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnastasiyaV",
                "username": "AnastasiyaV"
            },
            "url": "https://myanimelist.net/reviews.php?id=292517"
        },
        {
            "content": "Overall the concept for this anime was enticing, hence why i watched it. However, i regret the hours i spent watching it for numerous plot, genre, and character execution related problems. The only good aspect of this anime was the mysterious back stories of the characters about their powers and how they acquired them. However, those back stories were explained weakly, and in a rush, and didn't make up for the abysmally weak overarching plot which had the most dissatisfying ending! Its anticlimactic and mediocre plot was a poor attempt at a cliché mob family story with supernatural aspects, which weren't executed or explained inentrancing or coherent ways as you would expect them to be explained. I wouldn't recommend this unless you want to waste some time.",
            "date": "2016-10-23T00:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 232405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 1,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/GIORGIOW",
                "username": "GIORGIOW"
            },
            "url": "https://myanimelist.net/reviews.php?id=232405"
        },
        {
            "content": "First episode in, and we are immediately introduced to a mafia-esque organization with cool men in tuxedos, an ultimate duello that rewards the winner with our extraordinarily attractive female main - Felicita, a glimpse of well choreographed fights ranging from sword fights to close quarters combat, and a hint of romance tacked with a little bit of humor. Did I mention that the songs for both the opening and ending - as well as the animation, were pretty good? Going into this anime, I felt that there was already a lot of potential - decent plot, decent production values, decent room for character development. \r\nThisall falls a bit short though, when the anime is only scheduled to run for 12 episodes. The immediate problem that comes to us is that there just isn't enough time to go through the in and outs of the main cast. Character development is focused mainly on the three - Felicita, Nova, and Liberta. We still get to learn a lot more about the other characters, but the information often comes in snippets and tidbits that really only make a moderate amount of sense.\\n\\n\r\nThis problem is existent even when exploring the background of  Nova, and Liberta - the picture is just too small for us to care in any major way. Other problems with the plot include unexplained purposes of certain actions and unexplained reasons to having certain characters. Romance does make its way around the series, but most of this is limited and sees no real decisive conclusion.\\n\\n\r\nMoving on to the shonen aspect of Arcana Famiglia, the first episode does a great job in packing us with some decent action. The series itself though, lacks any major combat from there onwards - making it somewhat of a rare occasion. This part of the anime suffers similarly to the plot and character development, where many things are still left unexplained/ partially explained.\\n\\n\r\nThere is also a minor issue with budget allocation, as viewers may see a deterioration in quality towards the end of this series. In general, the themes of action and romance that were promised in the very beginning of this anime fails to follow-up on the strong start. \\n\\n\r\nArcana Famiglia however, does a fairly good job at perhaps, being a slice-of-life anime series. Despite being unable to grant complete character development, the episodes are often entertaining and joyful to watch. The characters are capable of setting heartwarming moments at times. \\n\\n\r\nThis series is all in all, an average pick out of many slice-of-life anime. There is definitely potential with Arcana Famiglia, but an inadequate amount of episodes and average execution on the studio's part has left it with a fairly plain score. The pace for this anime could have worked with 25 episodes. \\n\\n",
            "date": "2012-10-04T08:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 74069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1567857.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/neejohn",
                "username": "neejohn"
            },
            "url": "https://myanimelist.net/reviews.php?id=74069"
        },
        {
            "content": "The series had a promising premise, with the concept of hosting an Arcana Duello in order to marry the famiglia Papa's daughter, Felicita. I am glad that the series did not focus on romance, as is the motif in typical reverse harems. Instead, there was ample character development in the males; people get a sense of their struggles with controlling/awakening their powers. However, Felicita, our heroine, seemed like a background character in what is supposed to be her story. She was decent at fighting, but I kept waiting for her to emote in some powerful and meaningful way, but I was left unsatisfied. \r\nI ama bit disappointed at the predictable, rushed, and \"safe\" ending. The series could have devoted time to exploring friendships and actual fighting scenes in order to allow viewers to appreciate the ending more. \\n\\n\r\nTo end the review on a more positive note, the art in the show is amazing - that's what kept me watching the show. For example, the dreams/nightmares the characters have are so vivid.",
            "date": "2012-09-16T13:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 72477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1107845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lemonchiffon",
                "username": "lemonchiffon"
            },
            "url": "https://myanimelist.net/reviews.php?id=72477"
        },
        {
            "content": "Overall I was pretty disappointed with this anime, and that's saying a lot since I'm a huge fan of reverse harems. Good reverse harems with quaulity Art is pretty hard to come by so I was looking forward to this anime when it first came out. \r\nStory: In my opinion the whole thing was all over the place. The main heroin Felicita hardly does anything but stands around the whole anime. The only stories in there are about the characters backgrounds. You don't actually  start to get to the actual problem until the last couple episodes. Basically, it was pretty wishy-washy. I won't gointo details about the end but I was very mad and annoyed with it too. If you watch it you'll know what I mean.\\n\\n\r\nArt: I loved the art. It was one of the main points for this anime. I loved the colors and the vividness of it all. Which is probably why I kept watching the whole way through.\\n\\n\r\nSound: As far as soundtracks go there wasn't a lot but I did love the theme song, and that's important to me when I'm watching an anime. After all you see the theme song before you see the actual anime so it's what hooks you in to see the rest.\\n\\n\r\n*** Little bit of a Spoiler here***\\n\r\nCharacters: Ok I'm going to go on a bit of a rant. The supporting male leads were interesting and great. You got to learn about THEIR problems and backgrounds. I loved Luca especially. In fact you spend mainly the whole anime focusing on the 2 biggest to maie leads Nova and Liberta. I mean of course it's important to learn about all the supporting characters too but what about the main heroin? Well that's the part I'm severly disappointed about. The Lead character of this anime Felicita pretty much has no emotions. She's just like a robot. In fact you might as well have not included her. And in the end she didn't even choose to be with Nova or Liberta, I sort of predicted that though. She was a very dull character. I guess expecting a lot out of her character was too much to ask. \\n\\n\r\nEnjoyment: Even though I've ranted a lot, I did like pretty much all of the male leads and the episodes were all pretty interesting. So I gave it a 7 for my enjoyment.\\n\\n\r\nOverall: Overall I'm pretty indecisive myself about how to rate this. I mean there was a lot to rant about but there were some perks too. So I think I'll go with a 5.",
            "date": "2012-09-28T23:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 73557,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1451781.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XxYoursTrulyxX",
                "username": "XxYoursTrulyxX"
            },
            "url": "https://myanimelist.net/reviews.php?id=73557"
        },
        {
            "content": "Arcana Famiglia had an interesting premise but every passing episode, the show began to get duller and duller. I hope the show will get better soon, and I know it will, but here are my current thoughts on Arcana Famiglia.\r\nStory: About a royal family that holds a fight tournament where the winner will get to marry the beautiful Felicita'. That was how it began. But every episode, it feels like the show is walking away from its original plot. They're having side episodes or fillers that don't seem very important to the show. \r\nThey keep having separate episodes for different characters so you can getto know their background story better, but I feel that a better approach to do that, is to just launch off the main plot already and then have the character background stories be revealed during mid-combat.\\n\\n\r\nArt: I really love the art, it's quite beautiful. But what I dislike is when the three main characters always seem to get in a skirmish or battle with some pirates, bandits, etc, but they always walk away unscathed. In fact, they don't even need their weapons. They pull their deadly looking weapons out but they always end up using the blunt end of the weapon or end up just kicking away the opponent. I think they would fight better just hand to hand combat, sheesh. Not once, have I seen them using their weapons to actually slash or kill. I have never seen a single drop of blood in the series yet, and for an anime that's supposedly going to be action-y later, that upsets me. No blood means no intense action. Its like the shows creators are so impressed with their art style that they don't want to stain it with blood...\\n\\n\r\nSound: The opening and ending isn't too much of a headache to listen to, and the voice actors match the characters nicely. Except whenever I listen to Debito's voice I always think of Bossun from \"Sket Dance\". One problem though I have is that it's just painful for me to listen to Japanese voice actors trying to pronounce Italian names... \\n\\n\r\nCharacters: The characters all look different, and that's good. But the problem is, some of the characters seem too bland. The only characters that aren't always serious 24/7 is Liberta, Debito, and Pace. Besides that everyone else seems so boring. Another problem with the main character, Felicita, is that her character is hard to become infatuated with. She says \"eh?\" way too much and its annoying. She's pretty and her personality is also pretty, but still, she fails to be an entertaining character.\\n\\n\r\nOne cool thing about the characters though is that they all have special powers that only they can use and those powers are called \"Arcana\" abilities. But a problem I have with some of these Arcana abilities is that some of them seem way overpowered and in a battle with one another, it really falls down on which Arcana power is stronger. And its not like they earned those abilities, they just have it. That's it. They just have it. For example, one character has the Arcana power of super strength, cool right? But another has the power of \"death\". So basically if he just wants somebody to die, then they're dead. That's it. They're just dead. To me, it seems this whole Arcana system is really unfair and unbalanced and needs better backing. \\n\\n\r\nEnjoyment: My overall enjoyment of the show is a 7. Despite everything I previously said, the show isn't that bad, but its definitely not anything special. It's not something you'll love or remember, but at least its not something you'll remember just because you hated it. Watch it, you won't be overly impressed but its something you can watch every week while you're waiting for the next Naruto episode or the next Sword Art Online. \\n\\n\r\nOverall: Overall, the show gets a 8 because the art style is amazing. \\n\\n\\n",
            "date": "2012-09-01T19:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 71367,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SavageSmickey",
                "username": "SavageSmickey"
            },
            "url": "https://myanimelist.net/reviews.php?id=71367"
        },
        {
            "content": "The only good thing about this anime is the art and sound both 6 and 5.\r\nThis anime starts off with promise whereby in order for one of the boys to marry Felicita, they must win the tournament and Felicita will also be participating in the tournament with Papa. If they defeat Papa, then he will grant them any wishes. But then episode 2, just starts showing random scenes which is not fighting related, contradicting the story plot line. They never develop the story well, just contradicts people. Episode 2 to 11 shows only their daily life.\r\nThings start to happen in the last episode, when thetournament starts. I was so excited to see Felicita and Papa duel together, and she used her power from her back but then they just cut it off and the ending shows that Felicita was the winner, I dunno how the hell she wins. Then, Felicita says that she wants Papa just to be himself. Oh my, this is like everything turned into waste. It all goes back to episode 1. This anime never explain properly things and just rushed through.\\n\\n\r\nIt was a bad idea to have slice of life and make the ending rushed. Overall, this show is a waste of time and so contradicting.",
            "date": "2013-05-29T00:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 98809,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=98809"
        },
        {
            "content": "First of all I might be the only damn person that would give a 7 to this anime, but I just couldn't help it when seeing all the 3s and 4s and 5s. xD This anime  ISN'T that bad, KEEPING IN MIND that La Storia Dell' Arcana Famiglia is originally an otome game!  Those of you who don't know what that is I shall explain. An otome game is a game for girls where you play as the protagonist and attempt to get close to one of the several male choices around you and practically get hooked together. Simple explanation, right? Now. Usuallythese type of games have that which is called \"routes\", which seem completely epic in game mode since each route concentrates on ONE guy. The main problem when you try to animate an otome game is that, maybe because of budget or other commercial factors, you unfortunately can't waste time and animate ALL routes and makes different arcs like in Amagami SS or CLANNAD. In this case, the producers had to insert a complicated, messed up plot, already divided by its different routes, into mere 12 episodes and actually make a sense out of it while trying to remain as close to the game as possible. \\n\r\nI have to recognize Arcana Famiglia, despite having a really good start and premise, after the first episode, it just gets dragged with random events making it look boring and completely unrelated to the real deal which is the Arcana Duello, with Felicita jumping to one guy to another all the time in order to flesh their personalities more. But I really don't have anybody to blame for it since Arcana Famiglia has a massive cast and in 12 episodes they just tried to develop every character as much as they could, which made them omit a lot of stuff to give space to something else that was considered more important, which in the end became a total mess and disappointment for those that really looked forward to a good anime. The only thing I can reproach is that the anime would have been better if the producers would have chosen a guy for Felicita to concentrate on more than the others or, even if differently from the game, they could have inserted some dynamical movement to it if the Arcana Duello would have started after the first 2-3 fillers and going on with a fight for a whole episode then bring in other 2 filler episode so we could have slowly found out about the characters' issues with eachother. For example I was yearning to see the fight between Luca and Jolly animated but it never came and I had to stick with the short versions of Liberta vs. Dante and Nova vs. Sumire when they randomly decided to make a love triangle out of Arcana Famiglia instead of a reverse harem. xD \\n\r\nThe only praise I could give to the anime without thinking of the game is the comedy and art but that's all there is to it. Okay, i was also pleasantly surprised to have most of the last part of Jolly's route animated even though they could make him seem less of the bastard he actually he is, but at the same time they had Luca and Pace completely overshadowed by him, Liberta and Nova which was a real shame, despite me adoring Nova over all possible means. \\n\\n\r\nAll this said I think I don't really have anything more to add. The art was pretty high quality despite the low budget, which I think could have been a little higher because the PSP game was a complete innovation to otome gaming with it looking more like a picture drama than an otome, but hey! We all like ecchi harem stuff more so let's invest more in that type eh? *is completely ironic over here* \\n\\n\r\n*deep sigh* Here is how another epic otome game was completely destroyed and misjudged because of an anime adaption. xD",
            "date": "2012-09-27T08:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 73405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328165.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/xgreeneyednekox",
                "username": "xgreeneyednekox"
            },
            "url": "https://myanimelist.net/reviews.php?id=73405"
        },
        {
            "content": "When I first read the synopsis, I was hopeful that the reviews were overly critical and maybe, just maybe, I'd enjoy it nonetheless. I found Arcana Famiglia from an article suggesting reverse harems (my current addiction). With a cast of good-looking, weapon swinging young males, it certainly had potential. Sadly, nothing was done with said potential.\r\nEven though the characters each appear to have interesting back stories, we never get more than just the barest of glimpses into them. For example, there's constant animosity between Jolly and Debito, Pace and Luca, but the show never explores their past. Same goes for Liberta. There are flashbacks thatallude to a supernatural past but we never really learn his history. \\n\\n\r\nTo be fair, the first 11 episodes were enjoyable. The art and sound meet expectations and the characters are all well-dressed in suits or fancy Victorian dresses. It's really when you reach the last episode that you realize that there are more unanswered questions than there are resolutions. The final Arcana duel (that the entire anime is based around) was also completely anti-climatic. In fact, you could even say that it was downright nonexistent. At the pace that the first 11 episodes were moving at, the final episode came too abruptly and does not do the anime justice.\\n\\n\r\nTake away: I wish I heeded the advice of the existing reviews.\\n",
            "date": "2017-03-30T19:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 244062,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141997.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/citycat",
                "username": "citycat"
            },
            "url": "https://myanimelist.net/reviews.php?id=244062"
        },
        {
            "content": "i expected the anime to be great after reading the plot but it failed to meet my expectations.\r\nthe character development was poor.though i liked both the male leads and their love triangle with the female lead their story was very slow paced. the liked the plot that the girl fights to make her own choices in life but there was nothing of that sort. when i read the plot it said that there would be a tournament but believe me when i say that the f.....g tournament was only in the final episode and it got over in a blink of an eye. people fightinginn the tournament were supposed to fight using their arcana powers because only people with arcana powers were allowed to participate but no one seemed to use them in their fight. the whole point of the tournament was useless. but the anime had real good characters in it. the father daughter relation was way good. the animation is also great. i hope to read the manga to find out exactly about what the arcana powers are and the plot seemed to have a lot of potential. give it a try if u have no better anime left to watch or u just not want urself to get involved in the anime much.",
            "date": "2017-02-13T04:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 240502,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5946125.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/animecritic007",
                "username": "animecritic007"
            },
            "url": "https://myanimelist.net/reviews.php?id=240502"
        },
        {
            "content": "Wrote some spoils, but if you know it, it will probably make the story better (well maybe) one part kinda does ruin the end.   Don't read sentence 3\r\n1. If you are planning to watch this, stop and think your decision. \r\nArcana's cover is something you would watch, but in reality it's mediocre or worse.\r\n2. Select few are given powers, and in the story who ever wins gets to marry the daughter (there is a tournament btw). \r\n3. The tournament is being because \"father\" is dying, but somehow gets to live in the end.\r\n4. black hair ( or was it blue) and blond hair,have a crush on the main girl (so we get some romance).\\n\\n\r\n5. Also we get some backstory on some characters (which they had some traumatic pasts, well the two main guys).\\n\\n\r\n6. The OVA is hilarious if you watch the the original anime, so you will get to know the characters.\\n\\n\r\nStory-4 ( decent or mediocre)\\n\\n\r\nArt-7 (It was good at best)\\n\\n\r\nSound-8 (probably a 7, but only good thing)\\n\\n\r\nEnjoyment-4 ( Not the best, but planned to watch this for 6+ years)\\n\\n\r\nOverall-4 (could be better or worse)\\n\\n",
            "date": "2019-01-13T18:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 298981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4906592.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lord_Valzin",
                "username": "Lord_Valzin"
            },
            "url": "https://myanimelist.net/reviews.php?id=298981"
        },
        {
            "content": "Arcana famiglia could have been better\r\nI mean the art and sound was good\r\nBut what happened to the story!\r\nMaybe it was the episode limit that they rushed the end part\r\nAt least she could have chosen one between nova or libertà\r\nFor me it was fine (6/10)\r\nAgain..it's just my opinion",
            "date": "2013-03-08T09:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 89067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1729417.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IzayaKuchiki",
                "username": "IzayaKuchiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=89067"
        },
        {
            "content": "First Episode Was Amazing. And the special powers about making contracts with cards and every card had different abilities it astonished me.\r\nEvery episode but the first Sucks.\r\nThe Anime had so much potential they basically ruined it by rushing every plot.\r\n Spoiler Alert* And In The end she didn't even choose anyone. I would have been less disappointed if she chose someone but, REALLY. And totally ruining Liberta's Character , I mean he is the most overpowered character in the series and even in the end he doesn't know how to use his powers.\r\nHe could just shatter Nova's sword and one but , *sigh I don'tknow. \\n\\n\r\nOver all : Loved the first episode hated the rest\\n\r\nAdvise : Watch the first episode and don't watch the rest and let your imagination take over.\\n\\n\r\n                                                    Good Luck.",
            "date": "2014-05-16T00:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 143437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3297249.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/neonseeker",
                "username": "neonseeker"
            },
            "url": "https://myanimelist.net/reviews.php?id=143437"
        },
        {
            "content": "Of all the anime I've watched (which admittedly isn't very many), Arcana Famiglia ended off making me feel the most disappointed. I loved the characters, and the scenes were rather amazing, it wasn't too bad until it got to the final episode, and I was asking myself what was the entire point of it? \r\nIf plot isn't that big of a deal to you, than maybe this will be a nice enough anime to watch, although I just find it could have done a better job in conclusion. \r\nI also felt the main character could have been portrayed a lot better, she was rather indecisiveand was more of the backdrop whenever a fighting scene aired, although that wasn't too big of a problem for me. \\n\r\nIn conclusion, the anime isn't bad, it just reminded me of a few filler episodes of a longer anime put together, and it closed off without really answering the plots main question.",
            "date": "2016-03-14T14:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 212942,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5257393.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RoseToAshes",
                "username": "RoseToAshes"
            },
            "url": "https://myanimelist.net/reviews.php?id=212942"
        },
        {
            "content": "Arcana Famiglia like some reviews have said revolves on character development and issues, rather than balancing both, plot and character development...\r\n The story as I thought was suppose to be a ultimate battle in which will determine on who would be the next King and marry the current Kings daughter named Felicita. \r\nAs the episodes went on, it was just drama between the characters and little was to be known about the ultimate tournament. Which honestly made it irritating since there was no action. Once the tournament actually happened, it was so rushed after so long of waiting. \r\nThis seemed like a great anime, butit was okay in the end. Could of been executed better.",
            "date": "2015-07-25T21:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 194331,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4766450.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DazzlingDesserts",
                "username": "DazzlingDesserts"
            },
            "url": "https://myanimelist.net/reviews.php?id=194331"
        },
        {
            "content": "La stoira della Arcana Famiglia is an anime that can be summed up in one sentence, \"cool guys doing cool things\". This anime relies heavily on the friendships and characters, while the plot seems to \"sneak\" past the viewer, and have them wondering where it went. That's all good and well of you like watching pretty boys in suits and ties, but those who don't....you maybe wondering where the plot has escaped too. I must give this anime credit for one thing, it knocks all the filler episodes in the first three. This is a great get-away chance for those who aren't as patient asthe ones who have sat through an entire episode devoted to a kitten, but those who have, might see an actual plot over this thundercloud of \"cool guys doing cool things\" summary. \\n\\n\r\nAfter many, many depressing back-stories, hand-holding, lost kittens, and breast foundling, does the actual plot begin......on episode 11. Since this anime does rely so heavily on characters and the atmosphere, the characters are quite good and have a nice varieties of looks, voice, and how they carry themselves. The music is plains, besides the first opening, and doesn't really catch my eye. If you were expecting fighting, awesome battles, and other shounene features, you may want to skip this one. I can understand why you want to skip it, as even I wanted to even with my \"DO NOT DROP\" policy when doing reviews, I wanted to opt out as well. With immense concentration and many, many painstaking hours with my cursor hovering over the big X button, I ended up watching it. \\n\\n\r\nThis anime is a strange case of false advertisements, making the viewer think of \"much action, less romance\" while it's the complete opposite. Overall I give it a 6.01/10, as it was enjoyable (for the most part), but didn't quite live up to its name.",
            "date": "2014-07-13T12:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 151847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3652097.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/JadeOlivia",
                "username": "JadeOlivia"
            },
            "url": "https://myanimelist.net/reviews.php?id=151847"
        },
        {
            "content": "(This is my first review, so be considerous)\r\nWhenever I think about Arcana Famiglia, whenever I talk about Arcana Famiglia or whenever I see Arcana Famiglia on forums, there is only one thing I can think off to describe it.\r\nWasted potential.\r\nThis anime could have been great. Not just good, but great. The kind of great you'll always remember. But no. Arcana Famiglia is nothing but disappointment. It's not a bad anime, but it's far from even decent. Let's start off with the positives.\r\nThe music of the opening. Probably the best thing in the whole 12 episodes. It's catchy and rocky and everything.  Even the openingin itself is not that bad. \\n\\n\r\nThen, let's talk about the first episode of the anime. Probably one of my favorite introduction ever of an anime. It shows us all the different characters and explains the tournament that's gonna take place later in the serie (waaaaaaay later), and all of this in a really cool mafia-like atmosphere.\\n\\n\r\nNow, the characters.  Yeah, they're great. Really great. I especially like Pace, Luca and Nova. They're all pretty likable, except Jolly who I love to hate (he's not a bad character, I just don't like him as a person). Though this character development also hurts the anime, but I'll talk about that in two or three paragraphs.\\n\\n\r\nFinally, we have the art. While nothing really impressive, it does it's job, so I can't really count it as a low point.\\n\\n\r\nOnto the negatives.\\n\\n\r\nRemember when I talked about character development hurting the anime? Yeah, we're gonna talk about that. Let's get straight to the point, the story is nonexistent. No, really. It's not here. It's lost in space, just like my interest in One Piece. Actually, the story is existent. In the first episode and the last two or three if I remember correctly. The other episodes? Oh wait, sorry, they're too busy telling you of Libertà or Felecità's sooooooooo tragic backstory, or having some kind of mission for the organisation or something. It's like they made the first episode, then made episodes 2 to 10, and then remembered that there was an actual story behind all this.\\n\\n\r\nBut if only the last episode was a good episode, it would be ok, right? But no, even the ending is disappointing. I won't spoil it here and you may actually like it, and if you do, lucky you. But that's not my case.\\n\\n\r\nWhen I started this anime, I thought it would be some kind of mafia style action anime, but all I got was a mess of uninteresting romance and sometimes some action happened and it was fun because finally something was happening since ten minutes. It's not the worse anime I've ever seen (not like I've seen that many), but oh boy is it not the best. Do I recommend it? In all honesty...no. The opening and characters may be great, but outside of that there's not much stuff hapening and Arcana Famiglia is just not so enjoyable.",
            "date": "2018-05-20T13:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 281024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7137105.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/LolcarioWOB",
                "username": "LolcarioWOB"
            },
            "url": "https://myanimelist.net/reviews.php?id=281024"
        },
        {
            "content": "As suggested form the synopsis this anime is about some mysterious powers and people wielding them. Now this is where people will go wrong, there is no fighting or any kind of battles. The entire anime revolves around how the Boss of these people is suffering from his too powerful power and how his daughter and two other kids (romantic relation intended) save him. Now this coming to characters and enjoyment I can very confidently its very close to ground zero. Rather than a mafia kind of background had this been a hospital kind of background it would have been more appealing.",
            "date": "2016-08-23T12:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 227435,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/282120.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/jkalyana",
                "username": "jkalyana"
            },
            "url": "https://myanimelist.net/reviews.php?id=227435"
        },
        {
            "content": "This is an anime you should watch if you want relationship/character growth and filler episodes. Let me explain. I thought the two main male protagonists were going to be outlaws stealing away the princess for her freedom, for the end of episode 1 and continue from ep.2. However, I was wrong. I also thought that the other members were going to chase them down for the princesses safe return, but nope! Instead they mention the main event of the series at the very beginning and show it at the very end. In the middle of those episodes are filler-feeling -like episodes about the characters relationshipsfeeling and backstorys. A real shoujo for you there! Anyway, before I forget, I did really enjoy the ending theme and I didn't realise there was an OVA until I was having way through the series!",
            "date": "2016-07-06T12:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 223304,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007061.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Weezzy_bean",
                "username": "Weezzy_bean"
            },
            "url": "https://myanimelist.net/reviews.php?id=223304"
        },
        {
            "content": "Okay now where do you even start with this anime from the first episode its gives you a really good feel you meet the three Main characters Felicta Liberta and Nova Felicta father is putting up her hand for marriage to the winner of the tournament both Liberta and Nova are in love with Felicta and they dont ant to see her unhappy so the fight in the tournament to save her sounds like a good plot right but it went horribly wrong\r\nthere was a major lack of any character development for anyone besides Lirberta and Nova but even that wasn't enough so for therest of the season you are building up to the tournament with the three main character learning how to control there powers by the time the tournament comes you are. ready for the action to get under way but all you get is a few sceans of people losing to the three main characters\\n\r\nThen finally the moment people were waiting for and my biggest disappointment with this the Liberta vs Nova this should have been the main fight in the series but all we got was awful they clashed swords a few time then we ddnt even get to see a full fight which was disappointing so this anime could have been SO MUCH BETTER but it wasn't done right",
            "date": "2017-10-16T13:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 260957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/olly18",
                "username": "olly18"
            },
            "url": "https://myanimelist.net/reviews.php?id=260957"
        }
    ],
    [
        {
            "content": "Ok, I just finished it. This anime is one of those trashy anime guilty pleasures. The concepts presented in the story are cool. However, there are two main problems with the story: timing and characterization. \r\nFirst, let me talk about timing. In the description, it talks about guys battling out for the hand of the daughter of a mafia type group. Great description, but that isn't really the main focus of the story. This story takes place two months before the fight and then leads up to it. You don't get the actual fight until the last episode. Which is weird but if you shiftyour perspective for what the show is actually about there brings up some interesting things and you get to know the characters. \\n\r\nThe other thing I want to talk about is the characterization. Now... how to describe this? Basically, the story will describe a character as one way or give a certain character a specific backstory and the character in question won't act at all like they are described. I don't think I can say much more about it without spoilers. \\n\r\nAlright enough about the negatives some positives I have about this anime: \\n\r\n-kick-butt lady who isn't used for \"plot\" and wears practical-ish clothing. \\n\r\n-backstories are given in full detail for such a short anime\\n\r\n-The adults in this anime (you'll understand if you watch it)\\n\r\n-cute fluffy cat\\n\r\n-characters who have drastically opposing personalities and the dynamics they form with each other\\n\r\n>It's not the best reverse harem/action/??? I've seen but that's okay.<",
            "date": "2017-08-27T23:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 256393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208433.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/alphysIRL",
                "username": "alphysIRL"
            },
            "url": "https://myanimelist.net/reviews.php?id=256393"
        },
        {
            "content": "Arcana Famiglia was one of those animes I really wanted to watch. It was a good start but the story began dragging. DRAMATICALLY.\r\nThe story was mediocre. The idea of one person marrying the daughter of a mafia leader, I knew that things would get a bit pathetic but I decided to keep watching because I liked the character design. \r\nOf course were in 2012, where art and animation are like in a new level. Not just the colors but I liked the character design as well.\r\nI felt like the anime was dreading after a couple episodes. Especially the last episode. It was extremely rushed andI was just disappointed. Now if they make a second season prior to the first, I wouldn't be so angry.",
            "date": "2012-09-19T20:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 72749,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/455473.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Z-Wei",
                "username": "Z-Wei"
            },
            "url": "https://myanimelist.net/reviews.php?id=72749"
        },
        {
            "content": "Many people have said that Arcana Famiglia sucked, due to the ending and the lack of storyline. I would agree, but it wasn't to that exaggerated extent. \r\nFirst of all, I can agree that there really was no story plot. The Arcana Duello was supposed to be the main core of this anime. However, it wasn't really reached. All the episodes in between the last felt like fillers except for the character development scenes. Personally, I find these very enjoyable, but the fact that 90% of the anime were these episodes, it wasn't entirely satisfying. It was like: Alright, I know this about this character,and that about that character, so what are you going to bring next regarding these facts? Honestly the end was rushed, and it ended the story, but whether it was executed properly is a whole different  situation. I guess you could also say the ending itself was not the ending the viewers wanted, but the twist was expected. \\n\\n\r\nMoving on, the art and sound was satisfying, I guess you could say, for any anime it would've passed. I don't know why, but in my opinion I found the outfits rather... cool. It set the atmosphere and the whole mafia scheme really got me hooked. I think the voice actors really suited the characters, and modulation between different emotions were smooth as well. \\n\\n\r\nCharacter development was good, but again, it left it at a point where nothing was accomplished. I felt like I understood the characters, but I didn't know what the producers and directors would do regarding these basic structures. Nova, Liberta, Diberte, Luca, Pace, Dante, and even Jolly were developed quite well during the anime. This makes it entertaining, due to all their contrasting personalities. However, Felicita was developed poorly. This is the downfall. I wouldn't say she had no personality at all, but she had no significant outstanding qualities that made her different from other anime girls. Considering that she was the main character, this made the anime much less enjoyable. I kept thinking, if i were in Felicita's place, I wouldn't be acting like that... \\n\\n\r\nThe enjoyment was great though. During the first 7 episodes, I laughed so much. The little jokes and sexual innuendos were great. However, when things began to turn serious, those little puns lessened. I even enjoyed the punishment/repent sessions at the end of every episodes since they stopped. Even though the ending was rushed, I enjoyed it, comprehending every detail. It wasn't intense enough, but they had good laughs. I would recommend you to watch it if you don't mind the somewhat trashy storyline and like comedy animes. Despite the main female lead being a typical girl, the other male characters were hilarious due to their contrasting personalities (again). \\n\\n\r\nOverall: I really enjoyed Arcana Famiglia, and I wouldn't say that it was terrible. I think you should give it a try, because it isn't as bad as all the comments say. I probably shouldn't compare, but these first 12 episodes are rather like a build-up similar to build-ups in the anime Fairytail. The difference is that Fairytail has a more thought out story-line with a main antagonist. Like Arcana Famiglia, they had to develop their characters, but I think that with Fairytail being 100+ episodes, has more potential for a storyline rather than 12 episodes. Again, give Arcana Famiglia a try, because I enjoyed it, despite the disappointing ending. I'll tell you that it isn't a really crappy ending, but it's rather rushed. I rate this a 7.",
            "date": "2013-06-22T22:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 102011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2565825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/kaenjonetsu",
                "username": "kaenjonetsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=102011"
        },
        {
            "content": "I really wanted to like this anime. I loved the game, enjoyed some of the manga.\r\nOh boy...\r\nStory-6\r\nI liked the whole idea with the Tarot cards and the Mafia. But they didnt play it out too well.\r\nArt-7\r\nI was ok with the art style, I could still watch it. So if your one one those people, like me, who wont watch something even if the plot is good unless the art is well done. Its ok.\r\nSound- 6\r\nThe sound was ok too, the opening was alright and so was the ending. It didnt make me go\r\n\"OMG I NEED TO DOWNLOAD IT NOOOOOOOW\"\r\nBecause id usually go like that. Nothingimpressive though.\\n\\n\r\nCharacter-6\\n\r\nOh.How.I.Wish.They.Done.Better.\\n\r\nIs it me or do the characters  seem like they have a flat personality? Nova's and Liberta's were ok but they made Pace look like a guy who just eats and Luca who \"doesnt have a backstory\"\\n\r\nI wanted them to focus on the characters a little more since they do have personality, the anime just doesnt show it much.\\n\\n\r\nEnjoyment- 5\\n\r\nI didnt enjoy this as much as I wanted too. Every episode felt like a filler episode, every episode I wanted it to focus on the actual plot so it doesn't affect the ending. Oh how right was I....\\n\\n\r\nOverall- 6\\n\r\nIt was ok. I didnt enjoy it and I didnt hate it either.\\n\r\nIt was a love and hate relationship. I wouldnt recommend watching this though. If you want to see a good reverse harem watch Hakuouki or OHSHC.\\n\r\nAnd no I dont hate Arcana famiglia, I just didnt like the anime. Thats it.",
            "date": "2013-08-03T09:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 108037,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2848553.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/YandereObsessed",
                "username": "YandereObsessed"
            },
            "url": "https://myanimelist.net/reviews.php?id=108037"
        },
        {
            "content": "Let's see if I can keep it short...\r\nStory:\r\nReally good plot, but a bit rushed since it was 13 episodes; there were really odd scene transitions and useless episodes as well. I also didn't quite understand the whole card contract thing but it was nice watching people toy with their 'powers'. I also didn't feel the whole \"We live on an Italian island but we all speak perfect Japanese and have never been to Japan\" thing.\r\nArt:\r\nQuite beautiful, it wasn't super detailed like a futuristic type anime but it was enough to let you know where the characters are without having them blend in/out of the scenery.\r\nSound:\\n\r\nDecent opening theme, the rest of the score was ok as well; don't remember too much of any actual OSTs with lyrics, mostly just instrumentals.\\n\r\nCharacter: \\n\r\nEach episode tries to focus on one specific person and their problem(s) which would have been great if the anime had 20+ episodes but for 13 episodes, some characters didn't add much to the storyline. When I say didn't add much, I mean they weren't horrible but they weren't great either. I like the whole kick-ass female lead thing but I would've liked to see more of the love triangle blossom and less of that creepy old dude making suggestive comments at a 15/16 year old girl. Also a bit more on what the card contract means, I think they spent more time on a gibberish explanation rather than actual power usage.\\n\r\nEnjoyment: \\n\r\nI had a few chuckles and grins here and there but nothing that left a lasting impression on me.\\n\r\nOverall: \\n\r\nThe last episode fell reaalllly short of my expectations...and by then it was pretty obvious what was going to happen. It felt like the writers were scrambling to tie up all the loose ends and once that was done they only had a few minutes left for the actual Duello so we get like 10 seconds of each contestant and their power, YAY! Not. If you watch the first few episodes you can skip to the end without missing a thing. I'm not even sure who I would recommend this to because its like false advertisement to repeat the plot line when the actual plot veers off into another dimension.",
            "date": "2013-08-10T21:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 109139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2990351.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mijjang",
                "username": "mijjang"
            },
            "url": "https://myanimelist.net/reviews.php?id=109139"
        },
        {
            "content": "You have -got- to be kidding me. That's something that both you, the reader of this review, and myself would say. Why would someone give Arcana Famiglia an eight? Instead of clicking on not helpful JUST because I scored it as such, I ask that you try reading this review first. Anyway, let me tell you why I'd say that first line. I hateee most reverse harem anime; I usually dislike any anime too heavy on harem or reverse harem traits. I was curious about Arcana's score after finishing it. I was surprised at how low the score was. Do you know what's very interesting,though? I noticed one of the first reviews was hating on it back before I tried it out. You see, my friend said it wasn't too overdone with the whole reverse harem factor. Anyway, I checked again way way after, and there's a clear pattern to me. A hater starts out by hating it, and then others follow. I'm not saying everyone did that, because not everyone did, but I see a sort of pattern here. Go with the majority? I'm sorry, that's childish and stupid. It's like a bunch of bullies making everyone else join in.\\n\\n\r\nStory: 8\\n\r\nArcana Famiglia's story is interesting. Yes, for those of you who know of the ending, it was lacking, but it's not like it was bad. The fillers and off-trackness of this anime wasn't the best, but it's not like it wasn't entertaining. I liked how it was both serious and not serious. Remember that this is aimed at GIRLS, and that it's originally an OTOME GAME. If there's lack of action, how can we place any blame? So the ending left some desire for more, but I wouldn't say it ruined the rest of the show. Like MAL's guidelines say. If you need a summary, there's the synopsis up there. Anyway.\\n\\n\r\nArt: 7\\n\r\nThe art wasn't the best for me, but still pretty good. The animation quality was on the high side, but from what I've seen, the art style fell short of the official art for the game. Of course, this is an adaptation, so we can't really compare the anime to a game much. Again, art style's not the best, but it's still good. Effects are utilized nicely, and the shading was good.\\n\\n\r\nSound: 8\\n\r\nI didn't like the opening (a certain someone's singing is a bit off; instrumentals were good), but the ending was pretty great. Arcana's bgm is ordinary- you won't really remember it at all. The ending left a memory on me, and I remember how the opening goes. These two left a good impression overall. Otherwise, not much here.\\n\\n\r\nCharacters: 8\\n\r\nThis is a tricky part, but one of the main issues besides the story. I really can't believe Felicita got so much hate. \"She's too much of a good person- that's unrealistic.\" Wait, what? Sawako from Kimi ni Todoke? A bunchhh of female characters out there? Hello? Just because our world is filled with a lot of bad people, doesn't mean a goody-goody personality isn't impossible. In fact, I know a lot of friends like that. Even if morally bad people outnumber them. Another issue is people having an issue with Mamiko Noto's depiction of her voice. I'll admit, I found it unfitting at first. She seems like the type to have a higher-pitched voice, albeit soft (so Kana Hanazawa, then?). However, I got used to this after an episode or two. The voice becomes her, it ends up becoming a part of who Felitcita is. Another topic is how she's not the most emotionally active. Well, let's see. SHE HAS AMNESIA, REMEMBER? Why is it that Tachibana Kanade from Angel Beats! gets praise, and Felicita gets hate? I'd say both characters have their pros and cons. Moving on.\\n\\n\r\nThe rest of the cast in Arcana Famiglia are fairly strong. The weakness of some series is having too many characters. This also applies to the show, but there's something very notable about this one. With my knowledge, most reverse harems have multiple guys all liking the heroine in some way or another. Yet with this, you have mostly Liberta and Nova having a rivalry over her. Indeed, the other male characters show some interest in her, but it's NOT overdone. It's much more realistic when compared to others of the same genre. Felicita isn't fawned over by a bunch of guys like crazy. Another strong point is how each and every character is notable in their own way. You don't have a bland character, or the one that's mistaken for someone else. How this is executed is commendable.\\n\\n\r\nEnjoyment: 8\\n\r\nI was shocked that I actually liked this anime. This was after a few episodes. It managed to pull me in, and I'd have that \"Come out sooner,\" thought for it.  I know it seems ordinary from my scoring, but it really isn't. I'd recommend Arcana Famiglia to anyone who is able to understand that people like Felicita really aren't that unrealistic. That there's more to this series than meets the eye. Not amazing, no, but good and notable. I really wish more people on MAL were able to see its potential.\\n\\n\r\nOverall: 8\\n\r\nA recap of sorts. Not the most amazing plot, but still good. Somewhat rushed at the end, but a otome game-anime transition has to do with that (anime requires a huge budget, you know; it also doesn't give much profit unless really popular among fans). Art's notable, even if it's not extraordinary. Opening and ending shouldn't disappoint you with those instrumentals. Overall BGM's sup-par, though. As for characters, you'd have to skim back up. I enjoyed this anime, and wish people would reconsider it a lot more. It really isn't as bad as some make it out to be. Don't be so harsh on something when it's not horrible, y'know? Constructive criticism and considerate arguments are welcome. Have a nice day~",
            "date": "2013-12-23T03:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 125171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/840621.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Wintear",
                "username": "Wintear"
            },
            "url": "https://myanimelist.net/reviews.php?id=125171"
        },
        {
            "content": "i dont hate this anime its just that it disappointed me badly :(\r\nFrom what i read about this anime i thought that it would be amazing, and if im being really honest the best thing about it were the characters.When you start waching this you expect a love triangle, a lot of fights , and for sure that it will be suprising.None of those things really happen,sadly.For me it was quite a big disappointment, specially was really bad and the final fight was really lame -.- So my expectations of it were 9 out of 10 but on the end it was 4.5 out of10.I suppose  you can wach it for the characters but im not sure if its worth it  ;/",
            "date": "2013-03-23T14:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 90637,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2337117.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/linalovesanime",
                "username": "linalovesanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=90637"
        },
        {
            "content": "The only things I like about this one was the fact that made me watch it ‘till the last episode and that the ending wasn’t like I though it’s going to be. And that’s all about it…\r\nThe first episode starts really good. We have this powerful organization that’s like a “family” and Mondo (the leader) makes a duel-contest to choose the one that will replace him and will marry his daughter, Felicita. Felicita comes quite the strong type of woman I like… but only in the first episode, then it’s like we have another Felicita.",
            "date": "2012-09-30T08:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 73723,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/352458.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/magicb",
                "username": "magicb"
            },
            "url": "https://myanimelist.net/reviews.php?id=73723"
        },
        {
            "content": "Stumbling upon La Storia della Arcana Famiglia, the summary got my expectations a tad high there. It had a great potential but the moment I saw the rating I understood that the potential would disappear somewhere in between. Of course, this is just the start of it. Do bare with me.\r\nSo, the rating as you may know is 13+. Now, this lowers the potential for realism and so, the whole anime itself is an experience of a girl who cannot choose who she loves and thus going for the middle option that she could accept them as friends, of course, presented in a much moreheroic way for the cause that's being chased. Also, since they have to make a decent footage for 13 year-olds, they bring in abit of unnecessary slice-of-life moments, halting the development of the plot; and the duration of the series IS 13 episodes. Another aspect of realism brought down are the fighting scenes but at the very least, do make it believable - there was a scene where one of the main characters hits a guy with the blade of his sword and the guy falls neither wounded nor dead but unconscious. So, as a summary of all of the above, I felt I was watching a really spoiled kids' show of which its plot and characters Do actually bare great potential for development and leaves you with the hope of the next episode being, okay, not gory, but presented well enough story-wise, so it feels completed with the actual great animation and art.\\n\\n\r\nMoving on, although I believe everything comes from the rating of the show, is that the chracters are left undeveloped and brings you a really average show just to pass the time. Because the series do start really badassly-like announcing a tournament that you wait for about 7 or so episodes before it starts and in which the characters are supposed to be developed but somehow they are not. That is due to the fact that you see that there is a struggle to focus on the character (that is to be revealed of more) to be the main one for the episode, yet we always go back to actual Main protagonist (the afore mentioned girl) struggling with choosing between two boys just because she is entering puberty. Summary of this paragraph: watching the episodes, you feel there is some kind of chaos throughout of it that causes no satisfaction after you finish watching it.\\n\\n\r\nAs for the rest of the technical aspects, they were good. I regret that such a great art and plot went to waste. It doesn't even answer to the manga that much. So, my overall score is 5. Because of the potential it keeps, I have respect for it. Also because of the ending credits song!",
            "date": "2012-12-28T15:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 81732,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/231698.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Saturjay",
                "username": "Saturjay"
            },
            "url": "https://myanimelist.net/reviews.php?id=81732"
        },
        {
            "content": "Im not the type to write reviewsomething but this show is a doozy. Its original in its initial premise, the art is good, it's short and it has unique character motives apon watching the preliminary plot layers but as you can see from the aggregate score something is amiss. Well it turns out its actually a very very very conventional reverse harem at its core once you mentally shred away some pretty wrapping paper. What really hurt me was it took me so long to realize that. I did not take the time to find out pre-watch that it was based off a visual novel.Everything else wrong about it is rooted in that. It weaves a shit ton of semi-explored subplots(as is the case with most harem type shows) Also as you would imagine  (as is the case with most of these harem type shows)  it drives the plot on getting finality in its conclusion only to leave the viewer with something left to be desired. This show is a show that disguises itself as your action/fight-to-be-the-strongest variety of show to gradually reveal itself to be a gimme-attention-from-multiple-members-of-the-opposite-sex category show. It is however one of a kind in that they managed like 5 filler episodes in a 12 episode series. Sad really... The premise aka the first episode could have lead to a very good anime unfortunately I don't think that's what the producers of this poor thing werected trying to do. Matter of fact I'm not sure what they were trying to do. If anyone knows, can you tell me what is the target demographic of such a series?",
            "date": "2016-01-05T00:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 207793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/250722.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Gang_Orca",
                "username": "Gang_Orca"
            },
            "url": "https://myanimelist.net/reviews.php?id=207793"
        },
        {
            "content": "Anime based on Dating simulators I never really expect much of, I'll just tell you that right now, we've had some pretty...ehh ones...*cough* *cough* Amnesia..\r\nWhen I rate anime, I rate it on the normal things like Story, Art, Sound, Characters, Enjoyment..\r\nBut another thing that makes a huge difference when I rate it is Execution, especially with the genres they are supposed to be, there are the normal genres, Action, Romance, Comedy, and when I watch an anime with one or all these genres, then,\r\nIT BETTER BLOW ME AWAY WITH ITS ACTION, IT BETTER MAKE ME CRY FROM THE LOVE! AND IT BETTER MAKE ME LAUGHMY ASS OFF! (in other words good execution)\\n\\n\r\nBut there are many other sub-genres I like to classify anime in, one present in Arcana Famiglia is a sub-genre I like to call, \\n\\n\r\nThe Tournament Genre,\\n\\n\r\nAt the first episode, it is announced that they would have the Arcana Duello, the battle that will decide the new leader of the Arcana Famiglia, and our main character's future husband,\\n\\n\r\nSo, what I expected was that you would have the characters train and grow together and develop their powers and maybe even find the mystery of them, and finally ending with epic showdowns that will decide the new leader and the canon ship,\\n\\n\r\nBut what we got?\\n\\n\r\nThe characters did train and grow together, for about 1-3 episodes.\\n\r\nTheir powers were barely explored upon,\\n\r\nand it ended with the most pathetic tournament fights I have seen to this day.\\n\\n\r\nBe warned I'm going to go into my anime preaching mode, but\\n\\n\r\nTHERE IS A DIFFERENCE BETWEEN DEVELOPMENT AND FILLERS.\\n\\n\r\nThis anime wasted SO much time it drives me nuts! NO POTENTIAL FILLED AT ALL!\\n\r\nAnd for a first time, TOO MUCH DEVELOPMENT, AND NOT THE GOOD KIND!\\n\\n\r\nSure its fine if there is a filler episode or two in an anime as long as its enjoyable and gives inside development on characters, but when an anime is 89% fillers? Yeah that's another story.\\n\r\nThey could have done much better ways of developing them that didn't waste our time.\\n\\n\r\nBut anyway, animation was smooth with the few fight scenes that were in, and I liked the opening, the ending was...meh.\\n\\n\r\nBut overall, you don't even get riled up for the final showdown because you really only see 3 of the many characters actually train. \\n\r\nOverall, if you just want to see a bunch of characters just sort of...waste their time, go ahead and watch, but if you're looking for what I said beforehand, turn around now.\\n\\n\r\nThanks for reading!\\n\\n\\n\\n\\n\\n",
            "date": "2017-07-25T16:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 253793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6005625.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jersie",
                "username": "Jersie"
            },
            "url": "https://myanimelist.net/reviews.php?id=253793"
        },
        {
            "content": "The story is pretty good, the art is great, the sound is great, characters are fair, and I found myself somewhat enjoying this series.\r\nBut it gets very slow.\r\nIt's hard to enjoy this anime because it bounces back and forth a bit, and even though I loved every single character design in this anime, I didn't feel like there was much to take away from these characters.\r\nIf anything, after a second look, they all seemed... stale.\r\nStill, overall I got a bit of enjoyment out of it. It's a creative story idea, I LOVED the first few episodes, but they try to cram waaay too much in.It's best to go into this anime not with high hopes.\\n\\n\r\nOverall, I give this a 7. It's good, but not award winning good. Which is sad, because it could've been if there story telling wasn't so jumpy and stuffed full of information.",
            "date": "2017-02-27T12:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 241525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731363.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Katyrical",
                "username": "Katyrical"
            },
            "url": "https://myanimelist.net/reviews.php?id=241525"
        },
        {
            "content": "First I'd like to say that I thought this show had a great premise. I thought that over all it was decent. The plot was great and the character development was awesome but the story felt rushed. The whole point of the story was to help felicita to win the arcana duello so she could be free of the burden of having to marry the winner. My problem is the fact that they made a huge deal out of the arcana duello so I thought it would span at least 2 episodes. Instead they crammed it in to just one, and to me thatjust seemed a little to rushed after all the hype they put into it. It just seemed like a big let down.",
            "date": "2015-07-28T04:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 194528,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4694293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Seth_Rodney",
                "username": "Seth_Rodney"
            },
            "url": "https://myanimelist.net/reviews.php?id=194528"
        },
        {
            "content": "Do not be fooled by the word tournament! If you go in to this series thinking its going to be 12 episodes of a tournament and seeing a bunch of fighting you will be disappointed. But! If you go in to this series with an open mind and knowing that's its less about the tournament and more about the building of a friendship between a trio of main characters, Liberta, Nova and Felicita then you might enjoy it. I unfortunately didn't enjoy it that much but I didn't hate it either. I watched the show because of the Italian language (the title caught my eye)being mixed in with the Japanese in the show, it wasn't much but there are some words here and there and all the titles are in Italian aswell as the card names. and I read alot of the bad reviews or comments on the episodes were a about how it was nothing like expected no action all character talking terrible waste of time etc.. I have to admit that seeing all those cool characters and slowly revealing the past of each one and there arcana powers it was like a big tease because they all had these cool powers but they weren't really used much, and it seemed like the development was for nothing when you reach the end which really bothered me. But at least everyone can have there favorite. Pace is the best cause hes the real italian with the passion of food! Anyways I liked the series it wasnt an amazing story and I know it wasn't what I expected but halfway through I stopped thinking of what I thought it would be and tried to enjoy it for what it was, a cast of cool characters with humor on the side surrounding the main three characters who grow to learn about themselves and eachother. that helped me get through it. If your looking for all action this is not for you. but I was still very disappointed at the way this show was made because there was so much potential it could have been great but it ends up being just mediocre. If your going to make a 12 episode show all about character development you CANNOT do it with 10 characters. Overall I gave it a six cause it was cool to see all the different characters and their unique respective powers and it was a fun concept for a show but it the end it was poorly executed.",
            "date": "2013-08-16T11:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 109935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2965293.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Twin2",
                "username": "Twin2"
            },
            "url": "https://myanimelist.net/reviews.php?id=109935"
        },
        {
            "content": "SOMEWHAT SPOILER!! ENDING.\r\nAlright, lets start out with the background. The anime is based off of a family that uses powers given to them basically from Taro cards. Each card gives the person a different power with a price, each card chooses the person basically, and each cards power is based on the users emotions. I didn't really like this anime very much, it was hard for me to really tell who the central character was because it jumps around a lot without giving much character development.\r\nThe fight scenes themselves were good in a technical sense but they reused the same scene each time the cameraflipped back to the fight like the moves were on loop. Also it seemed a lot more that they only used the fighting scenes to be able to let their characters say a lot in one period of time rather than the person just standing there talking. \\n\\n\r\nThe storyline is also terrible, because the beginning of the show is exactly the same as the end of the show with, in my opinion, nothing really gained or lost. The shows subtitles also use some Italian words, like the Italian word for Lemonade, Japanese, and Taro, because it was basically like they were speaking Japanese but would throw in an Italian word every once in a while so that was odd.\\n\\n\r\nHonestly I wouldn't recommend this one, but that's just me. Some people may like it more, but I found that there wasn't very much explanation to anything really and they were just trying to get the show done rather than have a very good show.",
            "date": "2013-07-11T18:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 104901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1181593.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/weregonnalos3",
                "username": "weregonnalos3"
            },
            "url": "https://myanimelist.net/reviews.php?id=104901"
        },
        {
            "content": "With a different sounding title, apparently Italian, I was expecting a dark and action-packed anime. What I got was slow, cheesy, unfocused, and overly dramatic storytelling.\r\nPowers involving the cards from a Tarot deck seemed promising; A duel to decide who will rule the whole clan was intriguing. I felt cheated after watching the whole thing. The best parts of the anime might just be the 1st and last episodes. \r\nTo give it credit, the Art was very good since everything was well-drawn. OP, ED and BGM are just okay. Characters - now I wanted to love the characters but with all the unnecessary stuff goingon, I just cannot bring myself to do so. Felicita was a very disappointing female lead. The other characters were likeable at best (I'm sorry, Debito).\\n\\n\r\nI scored it lower than what I initially placed, and would not really be recommending this to others. It might even be in my 'try to avoid as much as possible' list.",
            "date": "2012-09-28T22:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 73553,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=73553"
        },
        {
            "content": "Eh.\r\nI don't want to make this review a whole speech so here's the pros cons.\r\nPros: -Interesting Story having a family(mafia-like) with individual powers\r\n-Hot female with knives\r\n-(for girls) hot guys in suits\r\n-fair animation \r\n-fair music and intro\r\nCons: -Poor finale\r\n-Things went nowhere fast\r\n-Climax was a bust\r\nGood anime to watch if you like gentle story lines without heavy action.",
            "date": "2013-08-31T11:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 111739,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1499933.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dave-Brooks714",
                "username": "Dave-Brooks714"
            },
            "url": "https://myanimelist.net/reviews.php?id=111739"
        },
        {
            "content": "The idea of the story was interesting and I really did enjoy the show. I loved the music and the art was absolutely adorable. I did find the story a little lacking though. The arcana duel that was mentioned in the beginning and feature at the end of the show was barely an issue throughout most of the serie. The characters did think about it and wanted to become stronger, but mostly, the episodes revolved around some adventures they had on their own. For a moment, I forgot about the arcana duel altogether and suddenly, it's happening. It just seemed to me that the plotwas rushed toward the end, as if they suddenly realized they needed to get back on topic and wrap up the show.\\n\\n\r\nThe characters were interesting. They each had a unique personality that made them attractive in their own way and there isn't a single character that I would want gone from the show. I would have wanted to see a bit more of some of their past, but nonetheless, I still liked how the characters were presented in the show.\\n\\n\r\nThe ending wasn't quite satisfying enough, but that may just be my fangirl personality being too demanding. If I put that part of me aside, I can say that the ending was quite fitting and good.",
            "date": "2014-06-05T12:26:00+00:00",
            "helpful_count": 0,
            "mal_id": 145985,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3822721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AceOfNoTrade",
                "username": "AceOfNoTrade"
            },
            "url": "https://myanimelist.net/reviews.php?id=145985"
        }
    ]
]