[
    [
        {
            "content": "1981: A group of folks create the Daicon III and IV opening animations This group would later become Gainax.\r\n1988: Aim for the Top! is released to massive appeal.\r\n1991: Otaku no Video is released, comically cataloging the life and times of the mythical people at Gainax. Also released in this year is Gainax's first TV anime - Nadia: Secret of the Blue Water.\r\nOctober 1995: Neon Genesis Evangelion is released to commercial and critical success.\r\n2000: FLCL is released as an OVA sparking wonderment in the minds of children everywhere. Especially those with ADD (and it's hyperactive cousin ADHD).\r\n2004: Gainax recreates it's critical success with Melody of Oblivion,reshaping the future of anime in a way that no other company could. Also Gunbuster.\\n\r\n2005: Gainax and Shaft team up for a groundbreaking anime - \"He Is My Master\", which revolutionized the idea that \"no concept is too basic\".\\n\r\n2007: Tengen Toppa Gurren Lagann makes lots of money and also Gainax starts remakes of Evangelion for a lot of money, too.\\n\r\n2010: Hanamaru Kindergarten becomes the perfect deconstruction of the \"I just got diabetes\" genre.\\n\r\nOctober 2010: Recreating the level of depth found in Neon Genesis Evangelion fifteen years prior, Gainax blesses planet Earth with a new anime by the name of \"Panty & Stocking with Garterbelt\".\\n\r\n2011: Dantalian takes a wildly refreshing concept and makes it even better, because it's Gainax.\\n\r\nApril 5th, 2012: An anime of pure legend comes to be. Essentially a magnum opus of not only the best company in the industry, but possibly a pinnacle of animation itself. A lovechild between \"Baked man gets artsy\" creator NisiOisiN and manga artist Shouji Saeki, Medaka Box is hands down the only anime you'll ever need to see.\\n\\n\r\nSo you might as well stop watching anime. Here's why:\\n\\n\r\nMedaka Box is the perfect parody of every anime ever. It manages to do this because it is an anime, and all other anime are anime. Therefore just by existing, Medaka Box is parodying all anime ever. If you didn't think that concept was suave, wait until you get a load of the setting. It's a school. That scenario right there perfectly satirizes Neon Genesis Evangelion (which in case you didn't know also had a school setting in it). \\n\\n\r\nSo what about the visuals? Let me start off by creating a metaphor. In the beginning, there was the alpha and omega. In 2012, there's Medaka's babycharmers. Capeesh? Let me end this section by creating another metaphor. I'm so hungry I could eat a horse. By horse I mean Medaka's chestnukes.\\n\\n\r\nWhat does a Medaka Box sound like? It sounds like the opposite of a really wet fart. Unless you like that the best, because then it sounds just like that. It's hard to describe the sound of Medaka Box other than unparalleled. There is indeed an opening and ending. I thought this was a nice touch. If you like music and sound, then you may end up enjoying Medaka Box very much.\\n\\n\r\nHow many characters can fit inside of a Medaka Box? Like more than Bleach. Oh my god there's like three new ones an episode. Are they complex human beings constantly developed by the pressure and situations constructed around them by a series of choices that affect the way they live? No. They're just character designs that sometime speak. Easily the best way to handle characters ever. Thank you, Gainax.\\n\\n\r\nPros:\\n\r\n+Medaka's rack. Just look at it. \\n\r\n+A lot of characters. If you like characters you can find them in this anime.\\n\r\n+There is an opening and ending song.\\n\r\n+Wacky random crazy zaniness\\n\r\n+There's a second season\\n\r\nCons:\\n\r\n-Medaka isn't real\\n\\n\r\nIf you care about anime you will watch Medaka Box. If you care about what it means to live you will watch Medaka Box. There will NEVER be another anime this excellent. It is actually impossible to be this systematically perfect, but leave it to Gaianx!\\n\\n\r\n^------v\\n\\n\r\nOkay, yeah, you got me, all that was sarcasm.\\n\\n\r\nMedaka Box takes a high seated position on my list for being extremely unmemorable. It's up there with a select few titles for being so dramatically dull that I really wish I didn't watch it. It's generic, which isn't always bad, but it's also mediocre. A level of mediocrity that I have never seen before watching Medaka Box. There's nothing offensive or out of place in Medaka Box. Somehow when you're being dragged along by this show, you are never surprised. Anything could happen, and because of that Medaka Box fails.\\n\\n\r\nIt fails as entertainment because there is no punch line. In its comedy genre it can't manage to pull out something truly wild because there are no rules to keep Medaka Box in check. When one character is considered so good at literally everything (I say this because she is written to be literal perfection) it is impossible to wow the audience. There's nothing a character does that isn't overshadowed by Medaka, and everything she does is just a positive extreme. If someone is fighting for a physical concept, she chastises that character and then fights for an abstraction. This can be a great technique in writing. Personifying an idea within a character is great, except Medaka does nothing with it. The talk about justice and righteousness is all just smoke to cover for the inadequate motivation the writers inability caused them to script. So yes, a bunch of crazy and unrealistic things happen in Medaka Box. Sadly, unlike some shows it does nothing with them other than present them to the viewer and move on. There are no timed gags and there are no running gags. There are no gags other than shock humor that really isn't even all that shocking. It's a comedy with no jokes.\\n\\n\r\nMedaka Box, primarily being a shounen, must have some unique set up right? Nope. It's a pure concept copy of The Melancholy of Suzumiya Haruhi. Apathetic boy doesn't want to do anything with his high school life, yet an eccentric and attractive female convinces him to do otherwise. They join a club together and there they meet many bizarre people. The one slight alteration between the two productions is that where Haruhi would diverge and create subplots and backplots with it's supernatural characters, Medaka Box just wants to make a battle arc. A character will come in with a problem, and then a battle takes place (sometimes over the course of a few episodes). A villain character is always introduced, and his goals are always blatantly evil. Power Rangers has more intricate villains than Medaka Box. I'd even say that the fights in Power Rangers have more suspense, despite knowing that the Red Ranger will use his super weapon or the Mega-Zord at some point to take down the boss and then everyone will go home happy. In Medaka Box, there really is no suspense. At some point, all you know, is that Medaka is going to win. Why? Because she does so every time. She's perfect.\\n\\n\r\nMary Sue. The impossible insert character or object of desire. In this case, its the desire. She has everything. Power, popularity, smarts, athletic skill, and so on. It is so easy to write this character. It is so hard to like it. There is nothing unpredictable Medaka will ever do in this anime (other than occasionally surprise the viewer with revealing clothing). Her male counterpart whose name I refuse to even look up because he's that stereotypical is no better. He's simply a self-insert. The writers want you to feel like you're on the adventure, and you live through the most logical choice in the anime - the average guy. If you're a guy, you'll immediately be able to resonate with this fellow. He's average at stuff, he's kinda smart in his own ways, and sometimes he gets angry when his friends are at a disadvantage. He's competitive with another guy who is very much like him. That's as far as the characters in this anime go. There's no interaction that's worthwhile or unique. Even the sound is pathetic, with nothing but pop tracks for it's opening and ending and all instrumental upbeat tracks for its main series. It's all paint-by-numbers.\\n\\n\r\nYou change the outfit colors, get new scenery, change the supernatural aspects, include a series of anime cliche episodes (pool etc.) and there you have it. A twelve episode series of nothing better than sleeping pills. The animation is clearly looped when present, otherwise it's stiff characters standing around talking. And there's a lot of talking. It's about whose abstractions are superior, semi-Freudian analysis', and whose most powerful attack really is more powerful. Of course everything has a jargon codename too, because having terminology is really \"cool\". For example Medaka's Forte #4 turns her hair pink and allows her to hit with the force of a dump truck. Really, why not watch Dragon Ball instead?\\n\\n\r\nIf you're interested in this series for its ecchi qualities, it's not even passable in that category. If you saw Medaka's cleavage and said \"Oh yes! Sign me UP!\" I recommend Queen's Blade, Seikon no Qwaser, and Manyuu Hikenchou instead. Even the fanservice is mediocre.\\n\\n\r\nPlease don't watch this anime. There is no way I could recommend this anime to anyone. Not to boys and not to girls. Not if you're ten or if you're twenty and up. Even out of irony I couldn't watch this series again. Anime like this doesn't deserve your time. There will always be something better to watch. If you're struggling between this anime and another one, pick the other one. Thank you.",
            "date": "2012-07-18T18:42:00+00:00",
            "helpful_count": 250,
            "mal_id": 67011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207137.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Detective",
                "username": "Detective"
            },
            "url": "https://myanimelist.net/reviews.php?id=67011"
        },
        {
            "content": "Perhaps one of the most hyped up anime of this Spring Season. Based off the popular manga Medaka Box, the shonen manga written by Nisio Isin (author of the Monogatari series including that oh yes, infamous toothbrush scene from the who can we forget, Nisemonogatari), has officially became an anime. Now, is that a good or bad thing? Hmm..with roughly half the series airing already, let's put our heads together and find out.\r\nFirst of all, there seems to be a trend of strong and unusual female leads this season. Koko from Jormungand, Yuuko from Dusk Maiden of Amnesia, Rea from Sankarea, just to name afew. Then, we have Medaka Kurokami, the beautiful and well-endowed student council president who has in her mind, no problem showing of that voluptuous body of hers which is right now, one of the main reasons some of us may be watching the show. Beyond that, she is nearly perfect and achieves what we can see as inhuman feats. But most curiously, she wishes to help the helpless and does so by creating a suggestion box. You can probably figure out where the title of the series comes by this point. Then, we have the other characters starting with her lucky or maybe not so lucky childhood friend Zenkichi Hitoyoshi. He reluctantly joins the council for the sake of his childhood friend despite the strange put-ups he has to endure daily. (such as Medaka stripping in front of him with little care) Then, we have the other characters. The student secretary Kouki Akune who became an instant fan boy of Medaka and the blue loli Hansode Shiranui who seems to have an eating habit that surpasses the hunger levels of a saiyan. Although these characters are all appealing and makes us anime fans watch further and learn more about them, what are their backgrounds? From here and out, I definitely wants to see more of that than what they do in the council everyday. Lately, another character by the name of Mogana Kikaijima is introduced and so far, we know that she is obsessed with money. To her, it's all about the money, money, and money.\\n\\n\r\nNow, the art and music seems to be alright from what's seen so far. However, I do realize that Gainax is NOT putting their effort into it as much as I originally hoped. The characters are blend, not original and not cutting edge. The absurd amount of fan-service seems to also seems to be thrown into our faces every 5 minutes. To me, that shows lack of effort on their behalf. I honestly expected more.\\n\\n\r\nSome of the music does mix in during the scenes but let's face it, it's not worth a Grammy Award. The OP for this series is somewhat catchy especially those Medaka cameos in nearly every scene. It makes sense after all to have our starring president in it as she's also the title character. However, \"Happy Box\"? The title of this seems a bit ambiguous. That suggestion box is filled with notes that expresses concerns that I highly doubt would be something \"happy\" for the council to read.\\n\\n\r\nBut beyond that, there are also those little stitches we pay attention in every episode such as the blue loli Hansode Shiranui eating 24/7, Medaka's random symmetrical poses with the other characters, and Kouki Akune's narcissism. Strangely enough, I found these little things to be quite amusing from time to time even though they are served as comic reliefs (or maybe not later?). I mean, after all so far, this series is mostly amusing and entertaining and not one of these deep emotional series like Clannad: Afterstory where we cry tears that will fill the Grand Canyon.\\n\\n\r\nHowever, in later episodes, Medaka Box lies the smackdown and delivers some unexpected action that some of us may have not expected. Yes, it still falls under the common cliches and fan-service but at this point, who really cares? This is one of those series where you expect the unexpected from our cast, ours truly the Student Council.\\n\\n\r\nThis series is something to keep an eye on (especially if you're into the comedy, shounen type genre) but NOT to hype over (especially for those who've read the manga beyond this point). It has its good but also the bad points. If you're a fan of comedy and entertainment, then this series is definitely for you. If not, then just sit back and watch this for the lulz. Later on though, you can expect Medaka lay some smackdown on those she sees as troublemakers to the academy. All in all, this is a busy series. Its first six episodes of half-stories may shun away viewers and make some hit that \"drop\" button. But if you can survive that, then you might be worth in for a little treat beyond the fan-service and cliches. If it's anything, this show does bring some entertainment especially in the middle of the week where you work your ass off at work or school. But hey, that's why we have anime like Medaka Box to kill reality.",
            "date": "2012-05-09T23:43:00+00:00",
            "helpful_count": 114,
            "mal_id": 60917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=60917"
        },
        {
            "content": "Oh the things this could have been. When one of my favorite manga became slated for an anime adaptation you can bet your ass I was jumping for joy, however the initial ecstasy was soon power-slammed into the ground and pissed on as time flew by. Penned by phenomenon known as Nisioisn, the Medaka Box manga started mediocre but eventually established itself as a wonderful clusterfuck combination of every genre known to man. The problem with the anime is that it didn't get past the mediocre part.\r\nStory - 6\r\nGainax produced a 1:1 adaptation of Medaka Box's first arc, but this faithfulness is one of theanime's fatal flaws. By choosing to animate the series with only 13 episodes Gainax trapped the show in its slice of life phase. The problem here is that Medaka Box wasn't meant to be slice of life, it was meant to be a jumbled mess of battle, romance, fourth wall breaking, screwed up villains, and character interaction. The series pretty much focuses on the introduction of the story, and introductions aren't really that stimulating.\\n\\n\r\nArt - 5\\n\\n\r\nThe inconsistency in quality is quite apparent, you can clearly tell the budget was saved to animate the last few episodes. One might mistake Medaka Box for an anime made in the early 2000's as the quality is far below the average series produced today. Rejoice though, for the budget can be found hiding in the final arc of the series! Unfortunately the first part was done so bad that I doubt many people even made it to the final arc, which is quite a shame really. In contrast to the questionable animation plaguing the opening sequences, the latter half of the series is animated quite nicely. It displays the vibrancy of Medaka, the immense power she wields, the emotion filled faces of her enemies, and all her splendor when what little sanity she has is substituted for the primal fury of a wild dog.\\n\\n\r\nSound - 3\\n\\n\r\nThere is no better way to start off a series than with a vapid J-pop song that doesn't compliment or tie into the story in any way, right? Thank god Medaka Box has one of these opening sequences to distract us from the generic ending song. All jokes aside though, the only thing memorable in Medaka Box's soundtrack is how unfitting the music is with some scenes.\\n\\n\r\nCharacters - 8\\n\\n\r\nEnough with the negativity! The characters of the series are depicted as well as I could have hoped, showing each persons unique traits in a flavorful way. Akune's aura of superiority, Kikaijima's aloofness, and Medaka's overbearing superiority are fleshed out skillfully in the narrative. If you enjoy watching overpowered characters accomplishing a myriad of insane tasks then I definitely recommend this series. Characters are the driving force of Medaka Box, and while there are many who dislike overpowered characters, for those who do this anime is a special treat.\\n\\n\r\nEnjoyment - 6\\n\\n\r\nMy views may be biased as a manga reader as I know the series should have been longer and had a quicker pace but I still enjoyed the show, if only for the ending. While the slice of life portion may have drudged on and on, the battle arc at the end nearly redeemed the series. Nearly.\\n\\n\r\nOverall - 6\\n\\n\r\nMany, many things could have done better but if you enjoy school life anime with a twist of battle shounen then I would recommend you at least try Medaka Box. Even if you're only a fighting anime fan then it may be worth it to marathon this series in preparation for season two which I predict will be MUCH better. Manga readers may be disappointed with the anime, but for a first time audience of the series this show may be quite the treat. All I have done is pointed out the major flaws afflicting the series, if you can deal with these gripes then by all means try a few episodes.After all it IS written by Nisioisin, the man who brought us beautiful works of fiction such as Katanagatari and the Monogatari series.",
            "date": "2012-06-26T23:12:00+00:00",
            "helpful_count": 79,
            "mal_id": 64517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287865.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Selsica",
                "username": "Selsica"
            },
            "url": "https://myanimelist.net/reviews.php?id=64517"
        },
        {
            "content": "Obviously it's not every year that Gainax pulls out a Gurren Lagann or a Panty and Stocking, but this latest offering is fairly dull and predictable.\r\nThe main problem with Medaka is that it's yet another Anime about high school, yet another Anime about some sort of school club, and the characters themselves are boring tropes of the genre. Everything about the show is so overplayed, and probably being done in any of the other 10 or so high school shows this season.\r\nCredit where it's due though, the voice work, sound design, and artwork is pretty good...even if there's a bit of OTT character designs forfanservice reasons.\\n\\n\r\nAdmittedly I've only seen two episodes, and it's not awful by any means. Just...boring",
            "date": "2012-04-21T15:00:00+00:00",
            "helpful_count": 38,
            "mal_id": 59371,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81878.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BudokaZ",
                "username": "BudokaZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=59371"
        },
        {
            "content": "Here is my review on Ahoge: the anime!\r\nWelcome to Hanokiwa Academy, where everything takes place. Right from the start you are told that first-year Medaka (the busty main character) is the new President of the Student Council. After she has got it established, Zenkichi (guy main character) joins her, followed by Akune. They have created a suggestion box, taking suggestions from fellow students to improve the school by solving problems, but also for personal help. I can't say it's original, but you can't judge a book by it's cover.\r\nHowever this anime keeps going and going in the same direction, going from the gymnasium to theindoor pool, the same shit ALL THE TIME.\\n\r\nYou shouldn't watch this for the ecchi either, you're better off going on danbooru and searching for Medaka or something. \\n\\n\r\nOne last thing i'd like to mention is that it's tolerable that Medaka is pretty much perfect as a person, but seriously how fucking far are you going to take this? On episode 1 with the space and everything I was lost, but Medaka also has superhuman strength, discipline, she even.. solved the worlds most problematic math problem... WHAT THE FUCK ARE YOU DOING IN A NORMAL HIGH SCHOOL THEN? \\n\\n\r\n'What the fuck am I watching' applies to this anime.\\n\\n\r\nStory: 3. Poor.\\n\r\nArt: 5. Mediocre art, not to mention weird anatomy but original to praise it a little.\\n\r\nSound: 5. Sounds normal?\\n\r\nCharacters: 4. Not memorable at all, except for Medaka. \\n\r\nEnjoyment: 5. \\n\r\nOverall: 5. I'm being generous here, because maybe it will get better. But it won't ever get a rating higher than a 5, so i'm set.",
            "date": "2012-05-04T09:29:00+00:00",
            "helpful_count": 33,
            "mal_id": 60489,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/767073.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/CynicalCrux",
                "username": "CynicalCrux"
            },
            "url": "https://myanimelist.net/reviews.php?id=60489"
        },
        {
            "content": "There is an abundance of people in the world considered enigmas. Un-explainable, insane and completely out on the outer rim. Their persona ultimately comes to be accepted or completely rejected, most cases swinging either way.\r\nMedaka Box or \"Suggestion Box\" sparked my interest by means of such an enigma known as Kurokami, Medaka but ended up just being another anime I couldn't really appreciate. I can't really say anything let me find a groove of enjoyment.\r\nBeing another school based setting this rather failed to bring much of anything called \"New\" to the table, its outright out done and gets boring after dozens of morbid failures. Ijust keep running flaws after flaws in my head but picking a few out of a handful is hard.\\n\\n\r\nFirst off, the art style just down right turned me off. I can't really say it was done very well at all, it felt almost low budget. The level of detail in anything was non existent and the thing that annoyed me the most were the character drawings. As we all know anything anime related is hardly comparable to real world applications, especially on the character sides. What I really want to touch on are the facial features, everything is low detail, everything overlaps and it just feels like a thrown together slop job. Unless you're into fan service I assume you were staring at \"Jugs\" a majority of the time.\\n\\n\r\nNow I felt that Medaka's character was out of place all over the map. Going from looking like the innocent school girl to a DragonBall Z parody was just appalling. I for one want to see more of the \"Character of interest and power\" show less empathy for the students or people around them. I can't really appreciate an overpowered character try and bring out the inner goodness of people then eliminate anything or anyone threatening the peace. Its just been done too much already, and in a school setting it just feels out of place.\\n\\n\r\nI really put this entire series off on weekly basis because it had it lacked substance. It was slow paced and put me off. I can't really say I enjoyed it at all. Maybe one day originality will be norm.\\n\\n\r\nDon't let me make you pass this though, if you're a fan of club based shows with a cute main lead you might give this a watch.\\n\\n",
            "date": "2012-06-21T22:28:00+00:00",
            "helpful_count": 31,
            "mal_id": 64029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=64029"
        },
        {
            "content": "Gainax: they do great original series (Evangelion) but perhaps, never fantastic adaptations.\r\nStudio Shaft and Studio White Fox both had a splendid adaptation of Nisio Isin’s (NisiOisin) Bakemonogatari and Katanagatari respectively. Due to this, I’ve set my bars high for Medaka Box which is animated by another known-to-be-good animation studio—Gainax. I have seen quite a lot of original stories from Gainax and they’re all good. But when you talk about their adaptations, well, they’re badly narrated and fares mediocre at best. Unfortunately, Medaka Box is on the same line: run-of-the-mill (see section: Dialogue).\r\nSTORY (2/5):\r\nThe story follows a problem-of-the-day format and I don’t think this would changein the latter episodes. I would have been better if Gainax would incorporate some original ideas into their adaptation to spice up the dull format of the story. If not, they may also follow the Monogatari series’ three-to-four episode arc format so they will have room to build up the tension. But judging from the first episode—and much to my dismay—I think they will stick to the dull problem-of-the-day format.\\n\\n\r\nCHARACTERS (3/5):\\n\r\nCharacters are so-so. The main character is a tsundere, her leading man is a delinquent and the girl-in-blue is a hyperactive moe. I have seen these personalities in other series already. Gainax should add some unique and striking personas to set Medaka Box apart from the multitude of rip-offs and wanna-be’s.\\n\r\nOn the contrary, voice acting was good but not great. They can express the characters’ emotions reasonably but they still have a lot to go to actually leave a lasting impression—maybe in the next episodes they will do so.\\n\r\nOn a side note, I am VERY DISPLEASED with this: why does Medaka very much resemble Senjougahara Hitagi that even their hair color is the same?\\n\\n\r\nSOUND (2/5):\\n\r\nClassical music is good but not when it is out of place. A triumphant music to complement a casual conversation? Seriously. Why? All I could say is that the background music is usually unfit for the scenario it complements.\\n\\n\r\nART (3/5):\\n\r\nI see some imitation of SHAFT and Silver Link elements in their art.\\n\r\nImmediately in the first five seconds of the first episode, you’d see checkered accent in the clock tower. That is an art style made famous by Silver Link’s Baka to Test to Shoukanjuu series. Gainax could imitate it but to some extent  they fail and just proves that imitators cannot simply beat the creator of the original idea.\\n\r\nLikewise, SHAFT references are present in many scenes. You’d see how at times, characters are separated by two contrasting colors of the area they stand in—light and shadow for example. But, well, again, they can’t draw the contrast harmoniously—a feat that only the originator of the idea SHAFT can do.\\n\r\nOn a brighter side, they have a fluid smooth animation which is commendable. But that is all, nothing more.\\n\\n\r\nDIALOGUE (1/5):\\n\r\nTruncating conversations in a NisiOisin novel is like cutting the lifeline of the series itself. So why Gainax? Why did you truncate the conversations? It is the most essential element of the novel, and without it, the foundation of the whole story topples down.\\n\r\nI am severly displeased to how short their conversations are. They’re like throwing one-liner quotes at a time—and this is definitely not how it should be.\\n\\n\r\n***\\n\r\nGainax might not really be the suitable studio to animate Medaka Box. Isin’s novels always require this “bizarre air” in the adaptation to make the series shine. Gainax was too straight-forward and their style just contradict Isin’s.\\n\r\nEccentric anime studios like SHAFT, White Fox or Silver Link are better suited to man the helm of Medaka Box.\\n\\n\r\nFor now, Medaka Box still reeks of bad animation. But I'm still giving it a \"5\" to give it a chance to, perhaps, prove itself.",
            "date": "2012-04-08T00:13:00+00:00",
            "helpful_count": 26,
            "mal_id": 58237,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/172924.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/arcunhacked",
                "username": "arcunhacked"
            },
            "url": "https://myanimelist.net/reviews.php?id=58237"
        },
        {
            "content": "Hello!!!!!!!!everybody, as we near the last episode of this 12 episode anime, it is probably very  obvious that technically this anime ended on the 11th episode and the last episode is merely a filler, so let's cut the BS and let's proceed as to how I rate this anime. First of all, we are expecting that the Gainax will follow along  with the manga, but what we have instead is a lousy combination of \"Sket Dance/ Ōkami-san to Shichinin no Nakamatachi/ Kaichou wa Maidsama with a \"Dragon Ball Z\" element all  squeeze into just one character, the worse part is that theplot of this anime is loosely  focus on the character itself, so I can't help but give it a \"Poor\" number 3. Btw, I have yet to read more of this anime's manga.\\n\\n\r\nArt: Good 7. \\n\\n\r\nThe rating is for the fanservice of the main character, and her resemblance to  Rias Gremory from High school DxD.\\n\\n\r\nSound: Fair 6.\\n\\n\r\nNo comment here.\\n\\n\r\nCharacter: Pathetic 1.\\n\\n\r\nOk, so why such rating? Well the thing about the main character Medaka Kurokami, is that the anime's director Shouji Saeki  has project her so perfectly that I'd find her irritating, it is not what she's capable of that I dislike, it is what the author  don't want to make Medaka to go through that is a deal breaker, we all know that in any show there is a unwritten rule that the protagonist always win, however there is an provision in that rule that the protagonist has to undergo some kind of seemly hopeless ordeal, in this case Medaka is somewhat of  a character who is  excepted to under go such ordeal as any protagonist will go through which to me makes her an unlikable character, in fact I kind view her a an apex bully in Hakoniwa Academy, who uses the student council as her den.\\n\\n\r\nThere is also Medaka's childhood friend Zenkichi Hitoyoshi whom she assigns as her  Gen Affarirs Manager....more like she forces him to be one, according to available info, he's Medaks's dog so \"Ka Ching\" the role suits him, but it also says that he's good in Savate............ok, so does the author know what \"Savate\" is? Co'z the way he fights is no different than what other fight scene  in any other animes with an action and martial arts genre in it, IMAO the author should have just made Zenkichi a black belt in Karate.\\n\\n\r\nFor those of you who don't know what \"Savate\" is, it is basically a French version of Muay Thai, the differences are that in Muay Thai using the knee and elbow is legal while in Savate it is illegal, also, Savate is the only kick boxing contact sport were players wore shoes.  \\n\\n\r\nEnjoyment: Fair 6.\\n\\n\r\nTo me to the enjoyable part here is my sympathy for the antagonist who failed to give Medaka a good spanking. I kinda cheer for the antagonist of this anime hoping that anyone of them would give Medaka hell, but then again I also cheered that Medaka was able to whoop the antagonist's ass instead, as much as I wanna give this part a \"Good' rating, a 'fair\" rating will do instead, since I'm  pissed at Unzen for unable to kick Medaka's ass, but I do enjoy the fanservice as well as Shiranui and Mogana Kikaijima cutsy roles.\\n\\n\r\nOverall: Pathetic 1.\\n\\n\r\nWell, if you're after the moe and the fanservice of this anime, then enjoy, for me this is one can be considered as a rare lousy anime were the author place all the eggs in one basket particularly on Medaka where she can be classified as some kind of cuisine that has too many condiments and seasonings in it that it becomes inedible. Frankly, I'd advice to simply stick to the manga, and I hope that Gainax won't even think about making a season 2. \\n\\n",
            "date": "2012-06-16T13:53:00+00:00",
            "helpful_count": 23,
            "mal_id": 63583,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 1,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=63583"
        },
        {
            "content": "After finishing this series, there are just a few things I'd like to clear up. \r\nFirst of all, this series was adapted (quite faithfully, I must add) from a relatively popular shounen manga of the same name. It's not in any way complete, and a second season has just been confirmed. This first season served mainly as an introduction to the characters and setting.\r\nSecondly, if you haven't read the manga already, I suggest doing so. It's nearly exactly the same as this anime has been so far, so you won't be missing out on much if you skip over this in favor of the manga.\r\nAlright,on to the actual review!\\n\\n\r\nMedaka Box starts out as a typical school life story with supernatural/shounen elements. It's interesting to see a shounen series with the main fighting protagonist a female, although some may argue that Zenkichi is the true protagonist here.\\n\\n\r\nThe premise of this series is about a student council with an unbeatable president, Kurokami Medaka. Right off the bat, everything about this series seems like it should be completely unlikable. We've got a useless male lead, an overpowered big-breasted female lead, and a bunch of other seemingly annoying characters. But somehow, after just watching a few minutes of the first episode, I began to actually like them.\\n\\n\r\nHonestly, by itself, this anime is not very good. It just doesn't make sense unless you know what the manga will eventually be about, and that's never a good idea. My enjoyment came from the way this show made me laugh, and I really did like the characters a lot. Despite the fact that all the characters are overpowered archetypes, Medaka Box presents them in a way that is rather satirical. This show doesn't take itself seriously, which makes it very enjoyable to watch.\\n\\n\r\nOverall, I liked Medaka Box. The pacing was strange, but the ending left room for all of the events that have yet unfolded in this anime adaptation.\\n\\n",
            "date": "2012-04-28T21:25:00+00:00",
            "helpful_count": 22,
            "mal_id": 59911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/545777.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_mahoushoujos_",
                "username": "_mahoushoujos_"
            },
            "url": "https://myanimelist.net/reviews.php?id=59911"
        },
        {
            "content": "Medaka Box is an anime about Medaka Kurokami, a flawless girl and her childhood friend Hitoyoshi Zenkichi, who works hard to follow her, the story follows the two and more in the joining of high school while these two make up the Student Council, but one twist the president Medaka promised to solve everyone problems by the use of the Medaka Box.\r\nNote: This review contains light spoilers.\r\nDisclaimer: This is my own opinion. They are not facts.\r\nPerfection, this subject hasn't been touched a lot in the anime franchise, this anime: Medaka Box is not a real battle shounen and the action is very one sided, butit is neither a fail of a shounen, rather it could be called an anime which mocks these kind of anime. In a lot of shounen the good guy/girl overcomes hardships and in a life or death battle the bad guy gets transformed to the good side by seeing the light or something. Medaka doesn't have this life or death situation or the problems, well because the main character is perfect and flawless and a big physiological factor plays with this:\\n\r\nCan we stand someone who is completely better than anyone in everything? No, obviously we can't. We are humans who have pride, so we dislike the people who do everything right while being modest about it. This is called pride in a positive way and arrogance in a negative way. \\n\\n\r\nThe story itself consists of Medaka and Zenkichi solving problems around school, the latter episodes revolves around a fight between the Student Council and the Disciplinary Committee. I think this anime stopped at the point where it becomes somewhat more of a shounen and where the other characters actually get to do something.\\n\\n\r\nArt-wise it does differ a lot from recently aired anime, instead of going for a more realistic look it has a pretty shounen like look. The animation isn't anything special, nothing too be amazed over. Maybe even a bit skippy if you ask me.\\n\\n\r\nThe opening song \"Happy Crazy Box\" fits the anime well and the ending theme is a character song by Medaka's seiyuu. Which is good, again this anything really good, it is decent and that is it all.\\n\\n\r\nSince I already talked a lot about the character Medaka, you might notice that I think this is the anime's strongest point and I do think that. A character doesn't always need to be likeable to be a well done. Medaka's personality and actions might be disliked by a lot of people, but they probably made it so you would not like her and that is the point. On the other Zenkichi is a real typical shounen like protagonist, hard-working self-sacrificing and surprisingly a bit of a tsundere. Akune is more of a supporting character than a main, but still contributes to the story, Kikaijima, one of the many \"reformed\" enemies is a shy girl who only has money on her mind.\\n\\n\r\nOverall I though this was a very unique anime, which opened some people's eyes about the term \"perfect\".\\n\\n\r\nBest thing in this anime:\\n\r\n- The various range of characters and their personalities and the view it gave me on \"perfect\".\\n\r\nWorst thing in this anime:\\n\r\n- The art, animation and sound part were very lacking. The series might also have been a bit too episodic, but with only 12 episodes this probably could not have been helped.\\n\\n\r\nLife lesson learnt: People rather have a hard-working failure, than a talented, flawless person.",
            "date": "2012-06-29T09:50:00+00:00",
            "helpful_count": 19,
            "mal_id": 64743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1191455.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Karpman",
                "username": "Karpman"
            },
            "url": "https://myanimelist.net/reviews.php?id=64743"
        },
        {
            "content": "Your typical shounen hero is a saint. No doubt about it. Whether they are challenging the strongest guys in the universe on planet Namek, traveling the endless oceans on their way to become the pirate king or gathering the most exquisite ingredients to complete their full course menu, these perfect human beings will overcome any challenge by propagating the three golden principles of the Shounen Jump Magazine: friendship, effort and victory.\r\nThe main question is: do you really buy it?\r\n- The Story:\r\nAlthough it may at first glance look like a blatant Suzumiya Haruhi rip-off, Medaka Box actually deals with the afore-mentioned question. We follow the adventuresof the abnormally perfect Kurokami Medaka fulfilling her duties as the student council president. Accompanied by her more than sceptical childhoodfriend Zenkichi Hitoyoshi, Medaka dashes off to help every student on campus, whether they are really in need or not. There are no boundaries for this student council president as she resocializes even the most notorious delinquents. \\n\r\nThe storytelling is more or less character-centered and engages the consumer with its many humourous moments and crazy situations. The numerous student requests lead the student council to join wacky escapades while the audience discovers layer neath layer of what can be assumed to be Kurokami Medaka's psychological profile. Is she a saint or a monster...?\\n\\n\r\n- The Characters:\\n\r\nTo be honest, this is probably the most striking element of Medaka Box. While the scenario, as described above, the concept of an energetic girl forcing a cynical boy to join a club against his will, is not new, the characters that fill the roles of Suzumiya Haruhi, Kyon, Koizumi etc are very well written and invite you to actually understand their competing world views as well as their fascination with the main heroine. And that fascination is not without cause.\\n\r\nThis show stands and falls with its main character. Kurokami Medaka, the saint-like student council president, knows how to get what she wants, which is most likely something for the good of everyone. She definitely is one of the toughest female main characters in a Shounen franchise that I have ever seen. Talking personally here, after seeing countless of these pseudo-strong heroines fall to being protected by their male counterparts revealing themselves to be the actual strongest in the end (talking about Saber, Shana, etc), it was completely refreshing to see a female character taking the lead role in a Shounen Jump series, actually being in charge of most of the butt-kicking action while her male partners rather support than supress her power.\\n\\n\r\n- The Design:\\n\r\nAlthough its scenario appears as your typical highschool setting, the character design already underlines its actual focus. Most of the students are weird looking, starting by their unusual school uniform look and ending in their crazy hairstyles or extreme body shapes. Those differ from certain elementary school kid sized students to brawny muscle guys or girls like Kurokami Medaka herself being overly sexy. This style adds a more than trashy vibe to the already weird contents of the Medaka Box adventures and gives you an idea of how to really handle the show.\\n\\n\r\n- The Final Conclusion:\\n\r\nAlthough the first season of Medaka Box only covers a small percentage of the actual Shounen Jump Manga series, it really appears to be more or less complete within itself dealing with the simple matter of constructing and introducing Kurokami Medaka's saint-like character and posing the question of whether we trust our perfect Shounen heroes or not. \\n\\n\r\nIf you are sick of your typical pseudo-strong heroine please feel free to experience something different within this student council.\\n",
            "date": "2013-12-24T17:52:00+00:00",
            "helpful_count": 11,
            "mal_id": 125425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185483.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MikeOnHighway61",
                "username": "MikeOnHighway61"
            },
            "url": "https://myanimelist.net/reviews.php?id=125425"
        },
        {
            "content": "Oddly enough, I found myself enjoying this show more than I thought I would. Far from perfect, it still has it where it counts with its witty humor and “out there” characters.\r\n       According to fans of the manga, the anime really didn’t cover a lot of ground. More or less the majority of it was introducing the characters and developing them as they interact with each other in a case by case sort of way. The last, oh let’s say, third of the series is the first story arc.This character, Medaka, is too perfect. She has a way with getting anyone to see things her way and uses this to “convert” delinquents into upstanding people. Her methods are a little less than ideal as there tends to be violence involved at some point. In the end, however, she succeeds in accomplishing her goal, one way or another. While it is for the good of things, she’s a love/hate kind of character.\\n\\n\r\n       The comedic value of the show overall isn’t the best. But it has its moments. The general consensus says that it may be a better option to read the manga if you’re really looking to get into this series. I cannot confirm or deny that, as I have not read the manga.\\n\\n\r\n      Overall I give this show 6/10 , its a Decent for what it was, but nothing award winning. Sort of became an after thought when I was finished watching it. For a slice of life style anime, with decent humor and all around fun characters, it’s good to give a shot if you’re bored and need some comedy.",
            "date": "2014-11-27T07:54:00+00:00",
            "helpful_count": 11,
            "mal_id": 170091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=170091"
        },
        {
            "content": "Medaka Box is one of the anime that has greatly let me down. Being a fan  of Nisio Isin, I hoped it to be a good anime. But it was nowhere near what I had hoped it to be. Please note that I didn't read the manga, so i am NOT gonna compare. Honestly the anime had a good potential, but unfortunately it ended up with more flaws then perks.\r\nThe first flaw of the anime is it's story. Story without any continuity is not that uncommon. In fact, it has become quite common it recently. To barely cover the setup and then burst offto some random events - I like that type since it's good refreshment from deep, complex storyline. But unfortunately it didn't work quite well for Medaka Box. The short 12 episodes tried to do a lot, yet did nothing than merely gathering the characters. I do realize that this acted as a mere setting before the second season, where it will hopefully get into the real story. However, even so, it could've tried to be not so boring.\\n\\n\r\nThe second, and the biggest problem of this series - is it's lack of character development. Honestly, the other members of the Student Council then Medaka got around as much screen time as a decorative foot soldier of a war movie. They did almost nothing. Zenkichi spent most of his time explaining Medaka's forte. they got episode 12 for themselves, that's all. Thinking about it, they didn't do much except speaking about Medaka. So, in the end, Medaka got all the spotlight. Even if she is the protagonist, it's overdoing it.\\n\\n\r\nThe third flaw would be its grandeur and exaggerations. Well, it's anime, so that is forgivable. But the \"pretentious appeal to innate goodness\" - well, it gets old. Things like that goes well once or twice in one anime, not one per episode.\\n\\n\r\nAs for the good sides, the art is quite good. The grandeur becomes quite bearable, in fact, it becomes normal looking thanks to the art. And I have no complaints in the sound department either.\\n\\n\r\nOverall, it's not a failure of an anime, but neither is one that may be considered very good. If you're not used to exaggerating actions and somewhat pointless stories, you're better off not seeing it.\\n\\n\r\nOh, and also, if you're familiar with Nisio Isin's works, then you might understand - this anime has that signature style of his. Honestly that was the only reason I ever started this anime.",
            "date": "2013-03-07T08:25:00+00:00",
            "helpful_count": 10,
            "mal_id": 88965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1140035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RFShahrear",
                "username": "RFShahrear"
            },
            "url": "https://myanimelist.net/reviews.php?id=88965"
        },
        {
            "content": "I want to start off by saying that this review is for both series of Medaka Box.  This anime had very much so it's strong points and it's weak points.  For the strong points my three favorite things in anime: the characters were amazing, Medaka and Zenkichi, I can't spell so do not get mad, there was contrast to the characters such as the overall change in how Medaka changed over the period of the series, and finally, the comedic relief was out of this world I liked that probably the most.  It definitely lacked in art because of the fact thatif the character had long hair, their eyes would go through the hair and in my opinion was tacky and also the soundtrack was not bad, but not memorable by any means. Overall though I loved this anime and I was contemplating on giving it a nine until the last episode which got way off topic.  Definitely a great watch and I encourage anyone who would want to watch the anime, you need to watch it really great.",
            "date": "2015-01-17T11:49:00+00:00",
            "helpful_count": 10,
            "mal_id": 178195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cloudff7",
                "username": "Cloudff7"
            },
            "url": "https://myanimelist.net/reviews.php?id=178195"
        },
        {
            "content": "I wish I could just say \"It's a series by Gainax. Enough said.\" Unfortunately, it is too early to make that statement for Medaka Box. The series is off to a good start but it is still unclear if the series will hit the mark that many expect out of Gainax.\r\nThe series revolves around Medaka, a first year that is elected as Student Council President with a staggering 98% of the vote, and more or less forces her childhood friend, Zenkichi, into joining the Student Council as its lowest ranking member.\r\nThe first thing she does is establish a suggestion box, later dubbed by students the\"Medaka Box\". Medaka encourages students to submit any problem to the box without hesitation and promises to take on any issue from anyone. The Student Council members then spend their days solving the problems submitted through the Medaka Box, whether they be hooligans in clubs where they don't belong or people who've lost their pets, gradually earning the respect and admiration of the entire school.\\n\\n\r\nMedaka has a very charismatic, hardworking, trustful and overwhelming personality that makes her seen as a 'superior human' which plays a huge role in the series as various characters continually point out, but she also has some very glaring human flaws that few see. She has a very large jealous side and can also be a tease to her friends. In a way she reminds me of Haruhi Suzumiya with the alien and supernatural obsession swapped out with an obsession to help others.\\n\\n\r\nMy favorite character at thie point, however, would have to be Shiranui. She is the comic relief character of the series. Zenkichi is apparently the only person who can get along with her and somewhat control her. Even though she is the smallest of the main characters, Shiranui has a very large appetite and is constantly seen eating. She has a knack for finding confidential information with ease, knowing about most things that would seem to be vague details, and is unusually perceptive. Normally, she is a very cheerful girl but she is shown to have a dark side and is brutally tactless.\\n\\n\r\nBackgrounds are well done. It's vivid and bright, reminded me of Baka to Test series. The character designs really remind me of High School DxD and the animation is very fluid and smooth.\\n\\n\r\nThe soundtracks do a pretty good job of blending into the anime's atmosphere, and while the opening and ending were quite good they are not all that memorable.\\n\\n\r\nThe series definitely show the elements to make a great show, but it all has yet to come together. Based on the first two episodes I would say...\\n\\n\r\nScore wise:\\n\r\nStory (7/10)\\n\r\nArt (9/10)\\n\r\nSound (7/10)\\n\r\nCharacter (9/10)\\n\r\nEnjoyment (8/10)\\n\r\nOverall (8/10)",
            "date": "2012-04-16T20:09:00+00:00",
            "helpful_count": 9,
            "mal_id": 59007,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tenko_Ranchi",
                "username": "Tenko_Ranchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=59007"
        },
        {
            "content": "I really enjoyed watching Medaka Box and I will review it for you in an easy to - read way. I seriously suggest watching it for a funny and entertaining anime!\r\nStory (no spoilers) - Medaka Box is about a nice yet bossy student council president who is OBSESSED with helping strangers when they're in need. She tries to get her childhood friend in the student council but he is totally against it. She tries to reform everybody who has done a bad deed and eventually comes up against difficult challenges. \r\nCharacters - The characters throughout the show are good with some great background stories. Thereare a lot of unique fighting styles between the characters and some interesting personalities. My favourite character would have to be Unzen, Myouri because I love his fighting style and bossy - childish personality.\\n\\n\r\nOverall the anime is great to watch when your bored or if your into a comedy, action and school anime.",
            "date": "2014-12-23T11:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 173815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4121779.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FlyingLasso",
                "username": "FlyingLasso"
            },
            "url": "https://myanimelist.net/reviews.php?id=173815"
        },
        {
            "content": "I want to say that this anime is good I love it but, I disappointed when listen tha only have 12 episodes and say Oh My God Why? Because is a good anime and in the manga have a long history. However, I wait more of this anime xDD I want more and I hope a excelent second season and all the members tha apper in the manga :3 Gainax thanks for your good work.",
            "date": "2012-06-24T21:20:00+00:00",
            "helpful_count": 9,
            "mal_id": 64357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1106669.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ecchiha",
                "username": "Ecchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=64357"
        },
        {
            "content": "Going into this I thought it would be a usual Ecchi anime, just fan service and not much story line at all. \r\nBut as soon as it starts, there's a story unfolding. Even if it is small, and not necessarily a proper story straight away, it's there which is what matters. \r\nThe plot lined out in the synopsis shows a pretty common way for Ecchi, but it has a twist that makes it interesting. It isn't the main focus so there's been effort put into other parts of the anime for people to enjoy if fan service isn't just what they want. There isn't reallymuch of it either, so if you're just looking for Ecchi, this isn't a good choice. \\n\\n\r\nIf you like romance, there's some of that and good comedy too. Little bits of action are put in as well. The anime has a nice feeling to it. The balance between genres and what happens in each episode has a nice flow. \\n\r\nWatching the dub, the voice to mouth sync is a little off at some points but it's not a big deal. \\n\\n\r\nOver all it's worth watching. It's entertaining and enjoyable. The action and plot quickly kicks in at the end, though in a bit of a weird way but it makes you excited to see what happens in the next season.",
            "date": "2016-10-24T02:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 232515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232515"
        },
        {
            "content": "[This review contains minor spoilers.]\r\n[This is a review of both seasons, together.]\r\nI am glad that I watched this.\r\nI probably wouldn't recommend this to others.\r\nI have watched this once, subtitled. Before watching the anime, I had read all the chapters of the manga, translated.\r\nI probably won't watch this again.\r\n---- Positives ----\r\nThe series does a relatively good job exploring special power strengths, weaknesses, and match-ups.\r\nAlthough there are too many special powers to be painstakingly explored, for the number of special powers that are encountered in the series, we learn a lot about each of them, of which their weaknesses and how they fair against other special powersare the most important and well-handled.\\n\\n\r\nThis series focuses on the intellectual aspect of battles.\\n\r\nCharacters win battles by outsmarting their opponents - discovering who their opponents are and using that to gain the upper hand, analyzing their opponents' abilities and finding a weakness, etc. Although every series that handles the meshing of different special powers is eventually doomed to trip on inconsistencies and not-quite-thought-through and overlooked applications of special powers, this series does a considerably good job at balancing powers and making sure that characters have a good grasp of their own limits. There really aren't any instances where you see the author in the characters - characters don't spontaneously apply their abilities in new ways as an afterthought. There seems to have been a large amount of thought that went into each character and their power beforehand.\\n\\n\r\nCharacters in this series have good chemistry within their groups.\\n\r\nWhen characters are grouped together in this series, such as being in a club, their personalities mesh really well despite being very different, generally.\\n\\n\r\nKurokami Medaka is voiced very well.\\n\r\nHer voice and dialect match her character.\\n\\n\r\nThe art looks particularly good, in bursts.\\n\r\nCertain scenes look really detailed and vibrant, mainly the early episodes before it turns into a battle series. Art is decent throughout.\\n\\n\r\nThere's a girl who's worried that her head is going to roll off unless she's constantly holding it in place.\\n\r\nBecause those scenes are adorable.\\n\\n\r\nGood Loser Kumagawa breaks the mold, so the negatives written below don't apply during that episode.\\n\r\nThe final episode of season 2 is a side story that conveys the general feel of the entire [manga] series better than the main episodes did. Kumagawa is the most interesting and complex character in Medaka Box, so at least the production staff threw him a bone even if only for a moment. On a basic level, the ways in which Kumagawa does and doesn't use his special power are central to his character, all the other characters, and why Medaka Box [manga] performs so well as a Special Powers series.\\n\\n\r\n---- Negatives ----\\n\\n\r\nThe genre shift is odd.\\n\r\nThis series starts out as a Student Council Slice of Life genre and changes into a Special Powers Intellectual Battle genre. This shift was also peculiar in the manga.\\n\r\nOpportunity for cancel: Yes, depending on who you are. If you're okay with both genres, this will be fine and you may not even notice it until someone else points it out for you, but if you don't like one of the genres, you'll definitely notice and you probably won't enjoy the shift.\\n\\n\r\nThe series never gets far enough off the ground to delve into the characters' life philosophies as successfully as the manga did.\\n\r\nYes, it's obvious that an anime series based on a manga series won't quite cover as many scenes. However, the life philosophies of characters, including, if you read into it, whether their views affected how they used their abilities or the way in which their abilities changed their lives changed their views along with it, was an extremely important part of the manga. Building that part of the story up takes a long time though, since you can't stop at simply dedicating a few pages/scenes to a character explaining their life and then expect it to have a profound effect on the viewer. The manga is long and the characters act out their views over a long time, so there's a strong, genuine feeling that develops regarding what types of people they are and how they view life. This is handled superbly in the manga.\\n\r\nOpportunity for cancel: Yes. For one, Kurokami Medaka gets decent coverage. Kumagawa gets a surprising amount of this sort of coverage even though he only has one-and-a-partial episode spent on him. Other characters such as Miyakonojou get decent coverage, though it's still slightly lacking.\\n\\n\r\nThe series didn't receive enough episodes in order to communicate its focus.\\n\r\n[This is related to the above negative, but examines how this aspect practically impacts viewers who haven't and won't read the manga.] As far as my opinion goes, the manga's focus is really on differing life philosophies coming together and enjoying both the positives and negatives of the result. Instead, based on how far the anime got, it appears to the viewer that Medaka Box is about inter-club battles and the Flask Plan and ... and actually, I'm not sure that there is any overarching focus. The series doesn't get far enough along. Someone who only watches the anime and doesn't read the manga will walk away with a very different impression of this series.\\n\r\nOpportunity for cancel: Yes, because the production team did a good job with the episode count that they had. There simply wasn't enough time to focus on what the manga focused on. I don't mean that there weren't enough scenes for monologue - there were. --but monologues wouldn't have cut it here. What I mean is that you'd need enough scenes that demonstrate the characters' views in order to properly cement those views in the story, but there just weren't enough minutes to show all those scenes without unacceptably rushing. So, the team focused on all the right things for a brief anime series.",
            "date": "2016-12-09T22:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 235171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5753100.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sorata861",
                "username": "sorata861"
            },
            "url": "https://myanimelist.net/reviews.php?id=235171"
        },
        {
            "content": "The story is you're average slice of life it can be related to the God Harui Suzimia. At the beginning or any Student council slice of life anime. But the story does get stale as old bread [cough cough tournament arc] but PERSEVERE for those long episodes were meant to be only a few chapters but they decided to make them ARCS, for some reason! But Near the end it starts to get spicey :)\r\nI even almost put it forever on the \"ON HOLD\" list, but i took a nap and continued.  Now after watching I WANTED MORE! so I watched the second season.QUESTIONS ARE ANSWERED! and its so nice, it may have a stale beginning but dont worry.now its by favorite anime of all time \\n\\n\r\nSo please watch this, Give it chance. Once you pass the stale episodes you already know the full cast so you just watch the \"Cool\" parts",
            "date": "2018-02-20T20:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 272067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6427020.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Neko-Nini",
                "username": "Neko-Nini"
            },
            "url": "https://myanimelist.net/reviews.php?id=272067"
        }
    ],
    [
        {
            "content": "1981: A group of folks create the Daicon III and IV opening animations This group would later become Gainax.\r\n1988: Aim for the Top! is released to massive appeal.\r\n1991: Otaku no Video is released, comically cataloging the life and times of the mythical people at Gainax. Also released in this year is Gainax's first TV anime - Nadia: Secret of the Blue Water.\r\nOctober 1995: Neon Genesis Evangelion is released to commercial and critical success.\r\n2000: FLCL is released as an OVA sparking wonderment in the minds of children everywhere. Especially those with ADD (and it's hyperactive cousin ADHD).\r\n2004: Gainax recreates it's critical success with Melody of Oblivion,reshaping the future of anime in a way that no other company could. Also Gunbuster.\\n\r\n2005: Gainax and Shaft team up for a groundbreaking anime - \"He Is My Master\", which revolutionized the idea that \"no concept is too basic\".\\n\r\n2007: Tengen Toppa Gurren Lagann makes lots of money and also Gainax starts remakes of Evangelion for a lot of money, too.\\n\r\n2010: Hanamaru Kindergarten becomes the perfect deconstruction of the \"I just got diabetes\" genre.\\n\r\nOctober 2010: Recreating the level of depth found in Neon Genesis Evangelion fifteen years prior, Gainax blesses planet Earth with a new anime by the name of \"Panty & Stocking with Garterbelt\".\\n\r\n2011: Dantalian takes a wildly refreshing concept and makes it even better, because it's Gainax.\\n\r\nApril 5th, 2012: An anime of pure legend comes to be. Essentially a magnum opus of not only the best company in the industry, but possibly a pinnacle of animation itself. A lovechild between \"Baked man gets artsy\" creator NisiOisiN and manga artist Shouji Saeki, Medaka Box is hands down the only anime you'll ever need to see.\\n\\n\r\nSo you might as well stop watching anime. Here's why:\\n\\n\r\nMedaka Box is the perfect parody of every anime ever. It manages to do this because it is an anime, and all other anime are anime. Therefore just by existing, Medaka Box is parodying all anime ever. If you didn't think that concept was suave, wait until you get a load of the setting. It's a school. That scenario right there perfectly satirizes Neon Genesis Evangelion (which in case you didn't know also had a school setting in it). \\n\\n\r\nSo what about the visuals? Let me start off by creating a metaphor. In the beginning, there was the alpha and omega. In 2012, there's Medaka's babycharmers. Capeesh? Let me end this section by creating another metaphor. I'm so hungry I could eat a horse. By horse I mean Medaka's chestnukes.\\n\\n\r\nWhat does a Medaka Box sound like? It sounds like the opposite of a really wet fart. Unless you like that the best, because then it sounds just like that. It's hard to describe the sound of Medaka Box other than unparalleled. There is indeed an opening and ending. I thought this was a nice touch. If you like music and sound, then you may end up enjoying Medaka Box very much.\\n\\n\r\nHow many characters can fit inside of a Medaka Box? Like more than Bleach. Oh my god there's like three new ones an episode. Are they complex human beings constantly developed by the pressure and situations constructed around them by a series of choices that affect the way they live? No. They're just character designs that sometime speak. Easily the best way to handle characters ever. Thank you, Gainax.\\n\\n\r\nPros:\\n\r\n+Medaka's rack. Just look at it. \\n\r\n+A lot of characters. If you like characters you can find them in this anime.\\n\r\n+There is an opening and ending song.\\n\r\n+Wacky random crazy zaniness\\n\r\n+There's a second season\\n\r\nCons:\\n\r\n-Medaka isn't real\\n\\n\r\nIf you care about anime you will watch Medaka Box. If you care about what it means to live you will watch Medaka Box. There will NEVER be another anime this excellent. It is actually impossible to be this systematically perfect, but leave it to Gaianx!\\n\\n\r\n^------v\\n\\n\r\nOkay, yeah, you got me, all that was sarcasm.\\n\\n\r\nMedaka Box takes a high seated position on my list for being extremely unmemorable. It's up there with a select few titles for being so dramatically dull that I really wish I didn't watch it. It's generic, which isn't always bad, but it's also mediocre. A level of mediocrity that I have never seen before watching Medaka Box. There's nothing offensive or out of place in Medaka Box. Somehow when you're being dragged along by this show, you are never surprised. Anything could happen, and because of that Medaka Box fails.\\n\\n\r\nIt fails as entertainment because there is no punch line. In its comedy genre it can't manage to pull out something truly wild because there are no rules to keep Medaka Box in check. When one character is considered so good at literally everything (I say this because she is written to be literal perfection) it is impossible to wow the audience. There's nothing a character does that isn't overshadowed by Medaka, and everything she does is just a positive extreme. If someone is fighting for a physical concept, she chastises that character and then fights for an abstraction. This can be a great technique in writing. Personifying an idea within a character is great, except Medaka does nothing with it. The talk about justice and righteousness is all just smoke to cover for the inadequate motivation the writers inability caused them to script. So yes, a bunch of crazy and unrealistic things happen in Medaka Box. Sadly, unlike some shows it does nothing with them other than present them to the viewer and move on. There are no timed gags and there are no running gags. There are no gags other than shock humor that really isn't even all that shocking. It's a comedy with no jokes.\\n\\n\r\nMedaka Box, primarily being a shounen, must have some unique set up right? Nope. It's a pure concept copy of The Melancholy of Suzumiya Haruhi. Apathetic boy doesn't want to do anything with his high school life, yet an eccentric and attractive female convinces him to do otherwise. They join a club together and there they meet many bizarre people. The one slight alteration between the two productions is that where Haruhi would diverge and create subplots and backplots with it's supernatural characters, Medaka Box just wants to make a battle arc. A character will come in with a problem, and then a battle takes place (sometimes over the course of a few episodes). A villain character is always introduced, and his goals are always blatantly evil. Power Rangers has more intricate villains than Medaka Box. I'd even say that the fights in Power Rangers have more suspense, despite knowing that the Red Ranger will use his super weapon or the Mega-Zord at some point to take down the boss and then everyone will go home happy. In Medaka Box, there really is no suspense. At some point, all you know, is that Medaka is going to win. Why? Because she does so every time. She's perfect.\\n\\n\r\nMary Sue. The impossible insert character or object of desire. In this case, its the desire. She has everything. Power, popularity, smarts, athletic skill, and so on. It is so easy to write this character. It is so hard to like it. There is nothing unpredictable Medaka will ever do in this anime (other than occasionally surprise the viewer with revealing clothing). Her male counterpart whose name I refuse to even look up because he's that stereotypical is no better. He's simply a self-insert. The writers want you to feel like you're on the adventure, and you live through the most logical choice in the anime - the average guy. If you're a guy, you'll immediately be able to resonate with this fellow. He's average at stuff, he's kinda smart in his own ways, and sometimes he gets angry when his friends are at a disadvantage. He's competitive with another guy who is very much like him. That's as far as the characters in this anime go. There's no interaction that's worthwhile or unique. Even the sound is pathetic, with nothing but pop tracks for it's opening and ending and all instrumental upbeat tracks for its main series. It's all paint-by-numbers.\\n\\n\r\nYou change the outfit colors, get new scenery, change the supernatural aspects, include a series of anime cliche episodes (pool etc.) and there you have it. A twelve episode series of nothing better than sleeping pills. The animation is clearly looped when present, otherwise it's stiff characters standing around talking. And there's a lot of talking. It's about whose abstractions are superior, semi-Freudian analysis', and whose most powerful attack really is more powerful. Of course everything has a jargon codename too, because having terminology is really \"cool\". For example Medaka's Forte #4 turns her hair pink and allows her to hit with the force of a dump truck. Really, why not watch Dragon Ball instead?\\n\\n\r\nIf you're interested in this series for its ecchi qualities, it's not even passable in that category. If you saw Medaka's cleavage and said \"Oh yes! Sign me UP!\" I recommend Queen's Blade, Seikon no Qwaser, and Manyuu Hikenchou instead. Even the fanservice is mediocre.\\n\\n\r\nPlease don't watch this anime. There is no way I could recommend this anime to anyone. Not to boys and not to girls. Not if you're ten or if you're twenty and up. Even out of irony I couldn't watch this series again. Anime like this doesn't deserve your time. There will always be something better to watch. If you're struggling between this anime and another one, pick the other one. Thank you.",
            "date": "2012-07-18T18:42:00+00:00",
            "helpful_count": 250,
            "mal_id": 67011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207137.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Detective",
                "username": "Detective"
            },
            "url": "https://myanimelist.net/reviews.php?id=67011"
        },
        {
            "content": "Perhaps one of the most hyped up anime of this Spring Season. Based off the popular manga Medaka Box, the shonen manga written by Nisio Isin (author of the Monogatari series including that oh yes, infamous toothbrush scene from the who can we forget, Nisemonogatari), has officially became an anime. Now, is that a good or bad thing? Hmm..with roughly half the series airing already, let's put our heads together and find out.\r\nFirst of all, there seems to be a trend of strong and unusual female leads this season. Koko from Jormungand, Yuuko from Dusk Maiden of Amnesia, Rea from Sankarea, just to name afew. Then, we have Medaka Kurokami, the beautiful and well-endowed student council president who has in her mind, no problem showing of that voluptuous body of hers which is right now, one of the main reasons some of us may be watching the show. Beyond that, she is nearly perfect and achieves what we can see as inhuman feats. But most curiously, she wishes to help the helpless and does so by creating a suggestion box. You can probably figure out where the title of the series comes by this point. Then, we have the other characters starting with her lucky or maybe not so lucky childhood friend Zenkichi Hitoyoshi. He reluctantly joins the council for the sake of his childhood friend despite the strange put-ups he has to endure daily. (such as Medaka stripping in front of him with little care) Then, we have the other characters. The student secretary Kouki Akune who became an instant fan boy of Medaka and the blue loli Hansode Shiranui who seems to have an eating habit that surpasses the hunger levels of a saiyan. Although these characters are all appealing and makes us anime fans watch further and learn more about them, what are their backgrounds? From here and out, I definitely wants to see more of that than what they do in the council everyday. Lately, another character by the name of Mogana Kikaijima is introduced and so far, we know that she is obsessed with money. To her, it's all about the money, money, and money.\\n\\n\r\nNow, the art and music seems to be alright from what's seen so far. However, I do realize that Gainax is NOT putting their effort into it as much as I originally hoped. The characters are blend, not original and not cutting edge. The absurd amount of fan-service seems to also seems to be thrown into our faces every 5 minutes. To me, that shows lack of effort on their behalf. I honestly expected more.\\n\\n\r\nSome of the music does mix in during the scenes but let's face it, it's not worth a Grammy Award. The OP for this series is somewhat catchy especially those Medaka cameos in nearly every scene. It makes sense after all to have our starring president in it as she's also the title character. However, \"Happy Box\"? The title of this seems a bit ambiguous. That suggestion box is filled with notes that expresses concerns that I highly doubt would be something \"happy\" for the council to read.\\n\\n\r\nBut beyond that, there are also those little stitches we pay attention in every episode such as the blue loli Hansode Shiranui eating 24/7, Medaka's random symmetrical poses with the other characters, and Kouki Akune's narcissism. Strangely enough, I found these little things to be quite amusing from time to time even though they are served as comic reliefs (or maybe not later?). I mean, after all so far, this series is mostly amusing and entertaining and not one of these deep emotional series like Clannad: Afterstory where we cry tears that will fill the Grand Canyon.\\n\\n\r\nHowever, in later episodes, Medaka Box lies the smackdown and delivers some unexpected action that some of us may have not expected. Yes, it still falls under the common cliches and fan-service but at this point, who really cares? This is one of those series where you expect the unexpected from our cast, ours truly the Student Council.\\n\\n\r\nThis series is something to keep an eye on (especially if you're into the comedy, shounen type genre) but NOT to hype over (especially for those who've read the manga beyond this point). It has its good but also the bad points. If you're a fan of comedy and entertainment, then this series is definitely for you. If not, then just sit back and watch this for the lulz. Later on though, you can expect Medaka lay some smackdown on those she sees as troublemakers to the academy. All in all, this is a busy series. Its first six episodes of half-stories may shun away viewers and make some hit that \"drop\" button. But if you can survive that, then you might be worth in for a little treat beyond the fan-service and cliches. If it's anything, this show does bring some entertainment especially in the middle of the week where you work your ass off at work or school. But hey, that's why we have anime like Medaka Box to kill reality.",
            "date": "2012-05-09T23:43:00+00:00",
            "helpful_count": 114,
            "mal_id": 60917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=60917"
        },
        {
            "content": "Oh the things this could have been. When one of my favorite manga became slated for an anime adaptation you can bet your ass I was jumping for joy, however the initial ecstasy was soon power-slammed into the ground and pissed on as time flew by. Penned by phenomenon known as Nisioisn, the Medaka Box manga started mediocre but eventually established itself as a wonderful clusterfuck combination of every genre known to man. The problem with the anime is that it didn't get past the mediocre part.\r\nStory - 6\r\nGainax produced a 1:1 adaptation of Medaka Box's first arc, but this faithfulness is one of theanime's fatal flaws. By choosing to animate the series with only 13 episodes Gainax trapped the show in its slice of life phase. The problem here is that Medaka Box wasn't meant to be slice of life, it was meant to be a jumbled mess of battle, romance, fourth wall breaking, screwed up villains, and character interaction. The series pretty much focuses on the introduction of the story, and introductions aren't really that stimulating.\\n\\n\r\nArt - 5\\n\\n\r\nThe inconsistency in quality is quite apparent, you can clearly tell the budget was saved to animate the last few episodes. One might mistake Medaka Box for an anime made in the early 2000's as the quality is far below the average series produced today. Rejoice though, for the budget can be found hiding in the final arc of the series! Unfortunately the first part was done so bad that I doubt many people even made it to the final arc, which is quite a shame really. In contrast to the questionable animation plaguing the opening sequences, the latter half of the series is animated quite nicely. It displays the vibrancy of Medaka, the immense power she wields, the emotion filled faces of her enemies, and all her splendor when what little sanity she has is substituted for the primal fury of a wild dog.\\n\\n\r\nSound - 3\\n\\n\r\nThere is no better way to start off a series than with a vapid J-pop song that doesn't compliment or tie into the story in any way, right? Thank god Medaka Box has one of these opening sequences to distract us from the generic ending song. All jokes aside though, the only thing memorable in Medaka Box's soundtrack is how unfitting the music is with some scenes.\\n\\n\r\nCharacters - 8\\n\\n\r\nEnough with the negativity! The characters of the series are depicted as well as I could have hoped, showing each persons unique traits in a flavorful way. Akune's aura of superiority, Kikaijima's aloofness, and Medaka's overbearing superiority are fleshed out skillfully in the narrative. If you enjoy watching overpowered characters accomplishing a myriad of insane tasks then I definitely recommend this series. Characters are the driving force of Medaka Box, and while there are many who dislike overpowered characters, for those who do this anime is a special treat.\\n\\n\r\nEnjoyment - 6\\n\\n\r\nMy views may be biased as a manga reader as I know the series should have been longer and had a quicker pace but I still enjoyed the show, if only for the ending. While the slice of life portion may have drudged on and on, the battle arc at the end nearly redeemed the series. Nearly.\\n\\n\r\nOverall - 6\\n\\n\r\nMany, many things could have done better but if you enjoy school life anime with a twist of battle shounen then I would recommend you at least try Medaka Box. Even if you're only a fighting anime fan then it may be worth it to marathon this series in preparation for season two which I predict will be MUCH better. Manga readers may be disappointed with the anime, but for a first time audience of the series this show may be quite the treat. All I have done is pointed out the major flaws afflicting the series, if you can deal with these gripes then by all means try a few episodes.After all it IS written by Nisioisin, the man who brought us beautiful works of fiction such as Katanagatari and the Monogatari series.",
            "date": "2012-06-26T23:12:00+00:00",
            "helpful_count": 79,
            "mal_id": 64517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287865.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Selsica",
                "username": "Selsica"
            },
            "url": "https://myanimelist.net/reviews.php?id=64517"
        },
        {
            "content": "Obviously it's not every year that Gainax pulls out a Gurren Lagann or a Panty and Stocking, but this latest offering is fairly dull and predictable.\r\nThe main problem with Medaka is that it's yet another Anime about high school, yet another Anime about some sort of school club, and the characters themselves are boring tropes of the genre. Everything about the show is so overplayed, and probably being done in any of the other 10 or so high school shows this season.\r\nCredit where it's due though, the voice work, sound design, and artwork is pretty good...even if there's a bit of OTT character designs forfanservice reasons.\\n\\n\r\nAdmittedly I've only seen two episodes, and it's not awful by any means. Just...boring",
            "date": "2012-04-21T15:00:00+00:00",
            "helpful_count": 38,
            "mal_id": 59371,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81878.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BudokaZ",
                "username": "BudokaZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=59371"
        },
        {
            "content": "Here is my review on Ahoge: the anime!\r\nWelcome to Hanokiwa Academy, where everything takes place. Right from the start you are told that first-year Medaka (the busty main character) is the new President of the Student Council. After she has got it established, Zenkichi (guy main character) joins her, followed by Akune. They have created a suggestion box, taking suggestions from fellow students to improve the school by solving problems, but also for personal help. I can't say it's original, but you can't judge a book by it's cover.\r\nHowever this anime keeps going and going in the same direction, going from the gymnasium to theindoor pool, the same shit ALL THE TIME.\\n\r\nYou shouldn't watch this for the ecchi either, you're better off going on danbooru and searching for Medaka or something. \\n\\n\r\nOne last thing i'd like to mention is that it's tolerable that Medaka is pretty much perfect as a person, but seriously how fucking far are you going to take this? On episode 1 with the space and everything I was lost, but Medaka also has superhuman strength, discipline, she even.. solved the worlds most problematic math problem... WHAT THE FUCK ARE YOU DOING IN A NORMAL HIGH SCHOOL THEN? \\n\\n\r\n'What the fuck am I watching' applies to this anime.\\n\\n\r\nStory: 3. Poor.\\n\r\nArt: 5. Mediocre art, not to mention weird anatomy but original to praise it a little.\\n\r\nSound: 5. Sounds normal?\\n\r\nCharacters: 4. Not memorable at all, except for Medaka. \\n\r\nEnjoyment: 5. \\n\r\nOverall: 5. I'm being generous here, because maybe it will get better. But it won't ever get a rating higher than a 5, so i'm set.",
            "date": "2012-05-04T09:29:00+00:00",
            "helpful_count": 33,
            "mal_id": 60489,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/767073.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/CynicalCrux",
                "username": "CynicalCrux"
            },
            "url": "https://myanimelist.net/reviews.php?id=60489"
        },
        {
            "content": "There is an abundance of people in the world considered enigmas. Un-explainable, insane and completely out on the outer rim. Their persona ultimately comes to be accepted or completely rejected, most cases swinging either way.\r\nMedaka Box or \"Suggestion Box\" sparked my interest by means of such an enigma known as Kurokami, Medaka but ended up just being another anime I couldn't really appreciate. I can't really say anything let me find a groove of enjoyment.\r\nBeing another school based setting this rather failed to bring much of anything called \"New\" to the table, its outright out done and gets boring after dozens of morbid failures. Ijust keep running flaws after flaws in my head but picking a few out of a handful is hard.\\n\\n\r\nFirst off, the art style just down right turned me off. I can't really say it was done very well at all, it felt almost low budget. The level of detail in anything was non existent and the thing that annoyed me the most were the character drawings. As we all know anything anime related is hardly comparable to real world applications, especially on the character sides. What I really want to touch on are the facial features, everything is low detail, everything overlaps and it just feels like a thrown together slop job. Unless you're into fan service I assume you were staring at \"Jugs\" a majority of the time.\\n\\n\r\nNow I felt that Medaka's character was out of place all over the map. Going from looking like the innocent school girl to a DragonBall Z parody was just appalling. I for one want to see more of the \"Character of interest and power\" show less empathy for the students or people around them. I can't really appreciate an overpowered character try and bring out the inner goodness of people then eliminate anything or anyone threatening the peace. Its just been done too much already, and in a school setting it just feels out of place.\\n\\n\r\nI really put this entire series off on weekly basis because it had it lacked substance. It was slow paced and put me off. I can't really say I enjoyed it at all. Maybe one day originality will be norm.\\n\\n\r\nDon't let me make you pass this though, if you're a fan of club based shows with a cute main lead you might give this a watch.\\n\\n",
            "date": "2012-06-21T22:28:00+00:00",
            "helpful_count": 31,
            "mal_id": 64029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/485265.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tzu",
                "username": "Tzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=64029"
        },
        {
            "content": "Gainax: they do great original series (Evangelion) but perhaps, never fantastic adaptations.\r\nStudio Shaft and Studio White Fox both had a splendid adaptation of Nisio Isin’s (NisiOisin) Bakemonogatari and Katanagatari respectively. Due to this, I’ve set my bars high for Medaka Box which is animated by another known-to-be-good animation studio—Gainax. I have seen quite a lot of original stories from Gainax and they’re all good. But when you talk about their adaptations, well, they’re badly narrated and fares mediocre at best. Unfortunately, Medaka Box is on the same line: run-of-the-mill (see section: Dialogue).\r\nSTORY (2/5):\r\nThe story follows a problem-of-the-day format and I don’t think this would changein the latter episodes. I would have been better if Gainax would incorporate some original ideas into their adaptation to spice up the dull format of the story. If not, they may also follow the Monogatari series’ three-to-four episode arc format so they will have room to build up the tension. But judging from the first episode—and much to my dismay—I think they will stick to the dull problem-of-the-day format.\\n\\n\r\nCHARACTERS (3/5):\\n\r\nCharacters are so-so. The main character is a tsundere, her leading man is a delinquent and the girl-in-blue is a hyperactive moe. I have seen these personalities in other series already. Gainax should add some unique and striking personas to set Medaka Box apart from the multitude of rip-offs and wanna-be’s.\\n\r\nOn the contrary, voice acting was good but not great. They can express the characters’ emotions reasonably but they still have a lot to go to actually leave a lasting impression—maybe in the next episodes they will do so.\\n\r\nOn a side note, I am VERY DISPLEASED with this: why does Medaka very much resemble Senjougahara Hitagi that even their hair color is the same?\\n\\n\r\nSOUND (2/5):\\n\r\nClassical music is good but not when it is out of place. A triumphant music to complement a casual conversation? Seriously. Why? All I could say is that the background music is usually unfit for the scenario it complements.\\n\\n\r\nART (3/5):\\n\r\nI see some imitation of SHAFT and Silver Link elements in their art.\\n\r\nImmediately in the first five seconds of the first episode, you’d see checkered accent in the clock tower. That is an art style made famous by Silver Link’s Baka to Test to Shoukanjuu series. Gainax could imitate it but to some extent  they fail and just proves that imitators cannot simply beat the creator of the original idea.\\n\r\nLikewise, SHAFT references are present in many scenes. You’d see how at times, characters are separated by two contrasting colors of the area they stand in—light and shadow for example. But, well, again, they can’t draw the contrast harmoniously—a feat that only the originator of the idea SHAFT can do.\\n\r\nOn a brighter side, they have a fluid smooth animation which is commendable. But that is all, nothing more.\\n\\n\r\nDIALOGUE (1/5):\\n\r\nTruncating conversations in a NisiOisin novel is like cutting the lifeline of the series itself. So why Gainax? Why did you truncate the conversations? It is the most essential element of the novel, and without it, the foundation of the whole story topples down.\\n\r\nI am severly displeased to how short their conversations are. They’re like throwing one-liner quotes at a time—and this is definitely not how it should be.\\n\\n\r\n***\\n\r\nGainax might not really be the suitable studio to animate Medaka Box. Isin’s novels always require this “bizarre air” in the adaptation to make the series shine. Gainax was too straight-forward and their style just contradict Isin’s.\\n\r\nEccentric anime studios like SHAFT, White Fox or Silver Link are better suited to man the helm of Medaka Box.\\n\\n\r\nFor now, Medaka Box still reeks of bad animation. But I'm still giving it a \"5\" to give it a chance to, perhaps, prove itself.",
            "date": "2012-04-08T00:13:00+00:00",
            "helpful_count": 26,
            "mal_id": 58237,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/172924.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/arcunhacked",
                "username": "arcunhacked"
            },
            "url": "https://myanimelist.net/reviews.php?id=58237"
        },
        {
            "content": "Hello!!!!!!!!everybody, as we near the last episode of this 12 episode anime, it is probably very  obvious that technically this anime ended on the 11th episode and the last episode is merely a filler, so let's cut the BS and let's proceed as to how I rate this anime. First of all, we are expecting that the Gainax will follow along  with the manga, but what we have instead is a lousy combination of \"Sket Dance/ Ōkami-san to Shichinin no Nakamatachi/ Kaichou wa Maidsama with a \"Dragon Ball Z\" element all  squeeze into just one character, the worse part is that theplot of this anime is loosely  focus on the character itself, so I can't help but give it a \"Poor\" number 3. Btw, I have yet to read more of this anime's manga.\\n\\n\r\nArt: Good 7. \\n\\n\r\nThe rating is for the fanservice of the main character, and her resemblance to  Rias Gremory from High school DxD.\\n\\n\r\nSound: Fair 6.\\n\\n\r\nNo comment here.\\n\\n\r\nCharacter: Pathetic 1.\\n\\n\r\nOk, so why such rating? Well the thing about the main character Medaka Kurokami, is that the anime's director Shouji Saeki  has project her so perfectly that I'd find her irritating, it is not what she's capable of that I dislike, it is what the author  don't want to make Medaka to go through that is a deal breaker, we all know that in any show there is a unwritten rule that the protagonist always win, however there is an provision in that rule that the protagonist has to undergo some kind of seemly hopeless ordeal, in this case Medaka is somewhat of  a character who is  excepted to under go such ordeal as any protagonist will go through which to me makes her an unlikable character, in fact I kind view her a an apex bully in Hakoniwa Academy, who uses the student council as her den.\\n\\n\r\nThere is also Medaka's childhood friend Zenkichi Hitoyoshi whom she assigns as her  Gen Affarirs Manager....more like she forces him to be one, according to available info, he's Medaks's dog so \"Ka Ching\" the role suits him, but it also says that he's good in Savate............ok, so does the author know what \"Savate\" is? Co'z the way he fights is no different than what other fight scene  in any other animes with an action and martial arts genre in it, IMAO the author should have just made Zenkichi a black belt in Karate.\\n\\n\r\nFor those of you who don't know what \"Savate\" is, it is basically a French version of Muay Thai, the differences are that in Muay Thai using the knee and elbow is legal while in Savate it is illegal, also, Savate is the only kick boxing contact sport were players wore shoes.  \\n\\n\r\nEnjoyment: Fair 6.\\n\\n\r\nTo me to the enjoyable part here is my sympathy for the antagonist who failed to give Medaka a good spanking. I kinda cheer for the antagonist of this anime hoping that anyone of them would give Medaka hell, but then again I also cheered that Medaka was able to whoop the antagonist's ass instead, as much as I wanna give this part a \"Good' rating, a 'fair\" rating will do instead, since I'm  pissed at Unzen for unable to kick Medaka's ass, but I do enjoy the fanservice as well as Shiranui and Mogana Kikaijima cutsy roles.\\n\\n\r\nOverall: Pathetic 1.\\n\\n\r\nWell, if you're after the moe and the fanservice of this anime, then enjoy, for me this is one can be considered as a rare lousy anime were the author place all the eggs in one basket particularly on Medaka where she can be classified as some kind of cuisine that has too many condiments and seasonings in it that it becomes inedible. Frankly, I'd advice to simply stick to the manga, and I hope that Gainax won't even think about making a season 2. \\n\\n",
            "date": "2012-06-16T13:53:00+00:00",
            "helpful_count": 23,
            "mal_id": 63583,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 1,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=63583"
        },
        {
            "content": "After finishing this series, there are just a few things I'd like to clear up. \r\nFirst of all, this series was adapted (quite faithfully, I must add) from a relatively popular shounen manga of the same name. It's not in any way complete, and a second season has just been confirmed. This first season served mainly as an introduction to the characters and setting.\r\nSecondly, if you haven't read the manga already, I suggest doing so. It's nearly exactly the same as this anime has been so far, so you won't be missing out on much if you skip over this in favor of the manga.\r\nAlright,on to the actual review!\\n\\n\r\nMedaka Box starts out as a typical school life story with supernatural/shounen elements. It's interesting to see a shounen series with the main fighting protagonist a female, although some may argue that Zenkichi is the true protagonist here.\\n\\n\r\nThe premise of this series is about a student council with an unbeatable president, Kurokami Medaka. Right off the bat, everything about this series seems like it should be completely unlikable. We've got a useless male lead, an overpowered big-breasted female lead, and a bunch of other seemingly annoying characters. But somehow, after just watching a few minutes of the first episode, I began to actually like them.\\n\\n\r\nHonestly, by itself, this anime is not very good. It just doesn't make sense unless you know what the manga will eventually be about, and that's never a good idea. My enjoyment came from the way this show made me laugh, and I really did like the characters a lot. Despite the fact that all the characters are overpowered archetypes, Medaka Box presents them in a way that is rather satirical. This show doesn't take itself seriously, which makes it very enjoyable to watch.\\n\\n\r\nOverall, I liked Medaka Box. The pacing was strange, but the ending left room for all of the events that have yet unfolded in this anime adaptation.\\n\\n",
            "date": "2012-04-28T21:25:00+00:00",
            "helpful_count": 22,
            "mal_id": 59911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/545777.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_mahoushoujos_",
                "username": "_mahoushoujos_"
            },
            "url": "https://myanimelist.net/reviews.php?id=59911"
        },
        {
            "content": "Medaka Box is an anime about Medaka Kurokami, a flawless girl and her childhood friend Hitoyoshi Zenkichi, who works hard to follow her, the story follows the two and more in the joining of high school while these two make up the Student Council, but one twist the president Medaka promised to solve everyone problems by the use of the Medaka Box.\r\nNote: This review contains light spoilers.\r\nDisclaimer: This is my own opinion. They are not facts.\r\nPerfection, this subject hasn't been touched a lot in the anime franchise, this anime: Medaka Box is not a real battle shounen and the action is very one sided, butit is neither a fail of a shounen, rather it could be called an anime which mocks these kind of anime. In a lot of shounen the good guy/girl overcomes hardships and in a life or death battle the bad guy gets transformed to the good side by seeing the light or something. Medaka doesn't have this life or death situation or the problems, well because the main character is perfect and flawless and a big physiological factor plays with this:\\n\r\nCan we stand someone who is completely better than anyone in everything? No, obviously we can't. We are humans who have pride, so we dislike the people who do everything right while being modest about it. This is called pride in a positive way and arrogance in a negative way. \\n\\n\r\nThe story itself consists of Medaka and Zenkichi solving problems around school, the latter episodes revolves around a fight between the Student Council and the Disciplinary Committee. I think this anime stopped at the point where it becomes somewhat more of a shounen and where the other characters actually get to do something.\\n\\n\r\nArt-wise it does differ a lot from recently aired anime, instead of going for a more realistic look it has a pretty shounen like look. The animation isn't anything special, nothing too be amazed over. Maybe even a bit skippy if you ask me.\\n\\n\r\nThe opening song \"Happy Crazy Box\" fits the anime well and the ending theme is a character song by Medaka's seiyuu. Which is good, again this anything really good, it is decent and that is it all.\\n\\n\r\nSince I already talked a lot about the character Medaka, you might notice that I think this is the anime's strongest point and I do think that. A character doesn't always need to be likeable to be a well done. Medaka's personality and actions might be disliked by a lot of people, but they probably made it so you would not like her and that is the point. On the other Zenkichi is a real typical shounen like protagonist, hard-working self-sacrificing and surprisingly a bit of a tsundere. Akune is more of a supporting character than a main, but still contributes to the story, Kikaijima, one of the many \"reformed\" enemies is a shy girl who only has money on her mind.\\n\\n\r\nOverall I though this was a very unique anime, which opened some people's eyes about the term \"perfect\".\\n\\n\r\nBest thing in this anime:\\n\r\n- The various range of characters and their personalities and the view it gave me on \"perfect\".\\n\r\nWorst thing in this anime:\\n\r\n- The art, animation and sound part were very lacking. The series might also have been a bit too episodic, but with only 12 episodes this probably could not have been helped.\\n\\n\r\nLife lesson learnt: People rather have a hard-working failure, than a talented, flawless person.",
            "date": "2012-06-29T09:50:00+00:00",
            "helpful_count": 19,
            "mal_id": 64743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1191455.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Karpman",
                "username": "Karpman"
            },
            "url": "https://myanimelist.net/reviews.php?id=64743"
        },
        {
            "content": "Your typical shounen hero is a saint. No doubt about it. Whether they are challenging the strongest guys in the universe on planet Namek, traveling the endless oceans on their way to become the pirate king or gathering the most exquisite ingredients to complete their full course menu, these perfect human beings will overcome any challenge by propagating the three golden principles of the Shounen Jump Magazine: friendship, effort and victory.\r\nThe main question is: do you really buy it?\r\n- The Story:\r\nAlthough it may at first glance look like a blatant Suzumiya Haruhi rip-off, Medaka Box actually deals with the afore-mentioned question. We follow the adventuresof the abnormally perfect Kurokami Medaka fulfilling her duties as the student council president. Accompanied by her more than sceptical childhoodfriend Zenkichi Hitoyoshi, Medaka dashes off to help every student on campus, whether they are really in need or not. There are no boundaries for this student council president as she resocializes even the most notorious delinquents. \\n\r\nThe storytelling is more or less character-centered and engages the consumer with its many humourous moments and crazy situations. The numerous student requests lead the student council to join wacky escapades while the audience discovers layer neath layer of what can be assumed to be Kurokami Medaka's psychological profile. Is she a saint or a monster...?\\n\\n\r\n- The Characters:\\n\r\nTo be honest, this is probably the most striking element of Medaka Box. While the scenario, as described above, the concept of an energetic girl forcing a cynical boy to join a club against his will, is not new, the characters that fill the roles of Suzumiya Haruhi, Kyon, Koizumi etc are very well written and invite you to actually understand their competing world views as well as their fascination with the main heroine. And that fascination is not without cause.\\n\r\nThis show stands and falls with its main character. Kurokami Medaka, the saint-like student council president, knows how to get what she wants, which is most likely something for the good of everyone. She definitely is one of the toughest female main characters in a Shounen franchise that I have ever seen. Talking personally here, after seeing countless of these pseudo-strong heroines fall to being protected by their male counterparts revealing themselves to be the actual strongest in the end (talking about Saber, Shana, etc), it was completely refreshing to see a female character taking the lead role in a Shounen Jump series, actually being in charge of most of the butt-kicking action while her male partners rather support than supress her power.\\n\\n\r\n- The Design:\\n\r\nAlthough its scenario appears as your typical highschool setting, the character design already underlines its actual focus. Most of the students are weird looking, starting by their unusual school uniform look and ending in their crazy hairstyles or extreme body shapes. Those differ from certain elementary school kid sized students to brawny muscle guys or girls like Kurokami Medaka herself being overly sexy. This style adds a more than trashy vibe to the already weird contents of the Medaka Box adventures and gives you an idea of how to really handle the show.\\n\\n\r\n- The Final Conclusion:\\n\r\nAlthough the first season of Medaka Box only covers a small percentage of the actual Shounen Jump Manga series, it really appears to be more or less complete within itself dealing with the simple matter of constructing and introducing Kurokami Medaka's saint-like character and posing the question of whether we trust our perfect Shounen heroes or not. \\n\\n\r\nIf you are sick of your typical pseudo-strong heroine please feel free to experience something different within this student council.\\n",
            "date": "2013-12-24T17:52:00+00:00",
            "helpful_count": 11,
            "mal_id": 125425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185483.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MikeOnHighway61",
                "username": "MikeOnHighway61"
            },
            "url": "https://myanimelist.net/reviews.php?id=125425"
        },
        {
            "content": "Oddly enough, I found myself enjoying this show more than I thought I would. Far from perfect, it still has it where it counts with its witty humor and “out there” characters.\r\n       According to fans of the manga, the anime really didn’t cover a lot of ground. More or less the majority of it was introducing the characters and developing them as they interact with each other in a case by case sort of way. The last, oh let’s say, third of the series is the first story arc.This character, Medaka, is too perfect. She has a way with getting anyone to see things her way and uses this to “convert” delinquents into upstanding people. Her methods are a little less than ideal as there tends to be violence involved at some point. In the end, however, she succeeds in accomplishing her goal, one way or another. While it is for the good of things, she’s a love/hate kind of character.\\n\\n\r\n       The comedic value of the show overall isn’t the best. But it has its moments. The general consensus says that it may be a better option to read the manga if you’re really looking to get into this series. I cannot confirm or deny that, as I have not read the manga.\\n\\n\r\n      Overall I give this show 6/10 , its a Decent for what it was, but nothing award winning. Sort of became an after thought when I was finished watching it. For a slice of life style anime, with decent humor and all around fun characters, it’s good to give a shot if you’re bored and need some comedy.",
            "date": "2014-11-27T07:54:00+00:00",
            "helpful_count": 11,
            "mal_id": 170091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4157753.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Monjoex",
                "username": "Monjoex"
            },
            "url": "https://myanimelist.net/reviews.php?id=170091"
        },
        {
            "content": "Medaka Box is one of the anime that has greatly let me down. Being a fan  of Nisio Isin, I hoped it to be a good anime. But it was nowhere near what I had hoped it to be. Please note that I didn't read the manga, so i am NOT gonna compare. Honestly the anime had a good potential, but unfortunately it ended up with more flaws then perks.\r\nThe first flaw of the anime is it's story. Story without any continuity is not that uncommon. In fact, it has become quite common it recently. To barely cover the setup and then burst offto some random events - I like that type since it's good refreshment from deep, complex storyline. But unfortunately it didn't work quite well for Medaka Box. The short 12 episodes tried to do a lot, yet did nothing than merely gathering the characters. I do realize that this acted as a mere setting before the second season, where it will hopefully get into the real story. However, even so, it could've tried to be not so boring.\\n\\n\r\nThe second, and the biggest problem of this series - is it's lack of character development. Honestly, the other members of the Student Council then Medaka got around as much screen time as a decorative foot soldier of a war movie. They did almost nothing. Zenkichi spent most of his time explaining Medaka's forte. they got episode 12 for themselves, that's all. Thinking about it, they didn't do much except speaking about Medaka. So, in the end, Medaka got all the spotlight. Even if she is the protagonist, it's overdoing it.\\n\\n\r\nThe third flaw would be its grandeur and exaggerations. Well, it's anime, so that is forgivable. But the \"pretentious appeal to innate goodness\" - well, it gets old. Things like that goes well once or twice in one anime, not one per episode.\\n\\n\r\nAs for the good sides, the art is quite good. The grandeur becomes quite bearable, in fact, it becomes normal looking thanks to the art. And I have no complaints in the sound department either.\\n\\n\r\nOverall, it's not a failure of an anime, but neither is one that may be considered very good. If you're not used to exaggerating actions and somewhat pointless stories, you're better off not seeing it.\\n\\n\r\nOh, and also, if you're familiar with Nisio Isin's works, then you might understand - this anime has that signature style of his. Honestly that was the only reason I ever started this anime.",
            "date": "2013-03-07T08:25:00+00:00",
            "helpful_count": 10,
            "mal_id": 88965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1140035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RFShahrear",
                "username": "RFShahrear"
            },
            "url": "https://myanimelist.net/reviews.php?id=88965"
        },
        {
            "content": "I want to start off by saying that this review is for both series of Medaka Box.  This anime had very much so it's strong points and it's weak points.  For the strong points my three favorite things in anime: the characters were amazing, Medaka and Zenkichi, I can't spell so do not get mad, there was contrast to the characters such as the overall change in how Medaka changed over the period of the series, and finally, the comedic relief was out of this world I liked that probably the most.  It definitely lacked in art because of the fact thatif the character had long hair, their eyes would go through the hair and in my opinion was tacky and also the soundtrack was not bad, but not memorable by any means. Overall though I loved this anime and I was contemplating on giving it a nine until the last episode which got way off topic.  Definitely a great watch and I encourage anyone who would want to watch the anime, you need to watch it really great.",
            "date": "2015-01-17T11:49:00+00:00",
            "helpful_count": 10,
            "mal_id": 178195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cloudff7",
                "username": "Cloudff7"
            },
            "url": "https://myanimelist.net/reviews.php?id=178195"
        },
        {
            "content": "I wish I could just say \"It's a series by Gainax. Enough said.\" Unfortunately, it is too early to make that statement for Medaka Box. The series is off to a good start but it is still unclear if the series will hit the mark that many expect out of Gainax.\r\nThe series revolves around Medaka, a first year that is elected as Student Council President with a staggering 98% of the vote, and more or less forces her childhood friend, Zenkichi, into joining the Student Council as its lowest ranking member.\r\nThe first thing she does is establish a suggestion box, later dubbed by students the\"Medaka Box\". Medaka encourages students to submit any problem to the box without hesitation and promises to take on any issue from anyone. The Student Council members then spend their days solving the problems submitted through the Medaka Box, whether they be hooligans in clubs where they don't belong or people who've lost their pets, gradually earning the respect and admiration of the entire school.\\n\\n\r\nMedaka has a very charismatic, hardworking, trustful and overwhelming personality that makes her seen as a 'superior human' which plays a huge role in the series as various characters continually point out, but she also has some very glaring human flaws that few see. She has a very large jealous side and can also be a tease to her friends. In a way she reminds me of Haruhi Suzumiya with the alien and supernatural obsession swapped out with an obsession to help others.\\n\\n\r\nMy favorite character at thie point, however, would have to be Shiranui. She is the comic relief character of the series. Zenkichi is apparently the only person who can get along with her and somewhat control her. Even though she is the smallest of the main characters, Shiranui has a very large appetite and is constantly seen eating. She has a knack for finding confidential information with ease, knowing about most things that would seem to be vague details, and is unusually perceptive. Normally, she is a very cheerful girl but she is shown to have a dark side and is brutally tactless.\\n\\n\r\nBackgrounds are well done. It's vivid and bright, reminded me of Baka to Test series. The character designs really remind me of High School DxD and the animation is very fluid and smooth.\\n\\n\r\nThe soundtracks do a pretty good job of blending into the anime's atmosphere, and while the opening and ending were quite good they are not all that memorable.\\n\\n\r\nThe series definitely show the elements to make a great show, but it all has yet to come together. Based on the first two episodes I would say...\\n\\n\r\nScore wise:\\n\r\nStory (7/10)\\n\r\nArt (9/10)\\n\r\nSound (7/10)\\n\r\nCharacter (9/10)\\n\r\nEnjoyment (8/10)\\n\r\nOverall (8/10)",
            "date": "2012-04-16T20:09:00+00:00",
            "helpful_count": 9,
            "mal_id": 59007,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tenko_Ranchi",
                "username": "Tenko_Ranchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=59007"
        },
        {
            "content": "I really enjoyed watching Medaka Box and I will review it for you in an easy to - read way. I seriously suggest watching it for a funny and entertaining anime!\r\nStory (no spoilers) - Medaka Box is about a nice yet bossy student council president who is OBSESSED with helping strangers when they're in need. She tries to get her childhood friend in the student council but he is totally against it. She tries to reform everybody who has done a bad deed and eventually comes up against difficult challenges. \r\nCharacters - The characters throughout the show are good with some great background stories. Thereare a lot of unique fighting styles between the characters and some interesting personalities. My favourite character would have to be Unzen, Myouri because I love his fighting style and bossy - childish personality.\\n\\n\r\nOverall the anime is great to watch when your bored or if your into a comedy, action and school anime.",
            "date": "2014-12-23T11:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 173815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4121779.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FlyingLasso",
                "username": "FlyingLasso"
            },
            "url": "https://myanimelist.net/reviews.php?id=173815"
        },
        {
            "content": "I want to say that this anime is good I love it but, I disappointed when listen tha only have 12 episodes and say Oh My God Why? Because is a good anime and in the manga have a long history. However, I wait more of this anime xDD I want more and I hope a excelent second season and all the members tha apper in the manga :3 Gainax thanks for your good work.",
            "date": "2012-06-24T21:20:00+00:00",
            "helpful_count": 9,
            "mal_id": 64357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1106669.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ecchiha",
                "username": "Ecchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=64357"
        },
        {
            "content": "Going into this I thought it would be a usual Ecchi anime, just fan service and not much story line at all. \r\nBut as soon as it starts, there's a story unfolding. Even if it is small, and not necessarily a proper story straight away, it's there which is what matters. \r\nThe plot lined out in the synopsis shows a pretty common way for Ecchi, but it has a twist that makes it interesting. It isn't the main focus so there's been effort put into other parts of the anime for people to enjoy if fan service isn't just what they want. There isn't reallymuch of it either, so if you're just looking for Ecchi, this isn't a good choice. \\n\\n\r\nIf you like romance, there's some of that and good comedy too. Little bits of action are put in as well. The anime has a nice feeling to it. The balance between genres and what happens in each episode has a nice flow. \\n\r\nWatching the dub, the voice to mouth sync is a little off at some points but it's not a big deal. \\n\\n\r\nOver all it's worth watching. It's entertaining and enjoyable. The action and plot quickly kicks in at the end, though in a bit of a weird way but it makes you excited to see what happens in the next season.",
            "date": "2016-10-24T02:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 232515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232515"
        },
        {
            "content": "[This review contains minor spoilers.]\r\n[This is a review of both seasons, together.]\r\nI am glad that I watched this.\r\nI probably wouldn't recommend this to others.\r\nI have watched this once, subtitled. Before watching the anime, I had read all the chapters of the manga, translated.\r\nI probably won't watch this again.\r\n---- Positives ----\r\nThe series does a relatively good job exploring special power strengths, weaknesses, and match-ups.\r\nAlthough there are too many special powers to be painstakingly explored, for the number of special powers that are encountered in the series, we learn a lot about each of them, of which their weaknesses and how they fair against other special powersare the most important and well-handled.\\n\\n\r\nThis series focuses on the intellectual aspect of battles.\\n\r\nCharacters win battles by outsmarting their opponents - discovering who their opponents are and using that to gain the upper hand, analyzing their opponents' abilities and finding a weakness, etc. Although every series that handles the meshing of different special powers is eventually doomed to trip on inconsistencies and not-quite-thought-through and overlooked applications of special powers, this series does a considerably good job at balancing powers and making sure that characters have a good grasp of their own limits. There really aren't any instances where you see the author in the characters - characters don't spontaneously apply their abilities in new ways as an afterthought. There seems to have been a large amount of thought that went into each character and their power beforehand.\\n\\n\r\nCharacters in this series have good chemistry within their groups.\\n\r\nWhen characters are grouped together in this series, such as being in a club, their personalities mesh really well despite being very different, generally.\\n\\n\r\nKurokami Medaka is voiced very well.\\n\r\nHer voice and dialect match her character.\\n\\n\r\nThe art looks particularly good, in bursts.\\n\r\nCertain scenes look really detailed and vibrant, mainly the early episodes before it turns into a battle series. Art is decent throughout.\\n\\n\r\nThere's a girl who's worried that her head is going to roll off unless she's constantly holding it in place.\\n\r\nBecause those scenes are adorable.\\n\\n\r\nGood Loser Kumagawa breaks the mold, so the negatives written below don't apply during that episode.\\n\r\nThe final episode of season 2 is a side story that conveys the general feel of the entire [manga] series better than the main episodes did. Kumagawa is the most interesting and complex character in Medaka Box, so at least the production staff threw him a bone even if only for a moment. On a basic level, the ways in which Kumagawa does and doesn't use his special power are central to his character, all the other characters, and why Medaka Box [manga] performs so well as a Special Powers series.\\n\\n\r\n---- Negatives ----\\n\\n\r\nThe genre shift is odd.\\n\r\nThis series starts out as a Student Council Slice of Life genre and changes into a Special Powers Intellectual Battle genre. This shift was also peculiar in the manga.\\n\r\nOpportunity for cancel: Yes, depending on who you are. If you're okay with both genres, this will be fine and you may not even notice it until someone else points it out for you, but if you don't like one of the genres, you'll definitely notice and you probably won't enjoy the shift.\\n\\n\r\nThe series never gets far enough off the ground to delve into the characters' life philosophies as successfully as the manga did.\\n\r\nYes, it's obvious that an anime series based on a manga series won't quite cover as many scenes. However, the life philosophies of characters, including, if you read into it, whether their views affected how they used their abilities or the way in which their abilities changed their lives changed their views along with it, was an extremely important part of the manga. Building that part of the story up takes a long time though, since you can't stop at simply dedicating a few pages/scenes to a character explaining their life and then expect it to have a profound effect on the viewer. The manga is long and the characters act out their views over a long time, so there's a strong, genuine feeling that develops regarding what types of people they are and how they view life. This is handled superbly in the manga.\\n\r\nOpportunity for cancel: Yes. For one, Kurokami Medaka gets decent coverage. Kumagawa gets a surprising amount of this sort of coverage even though he only has one-and-a-partial episode spent on him. Other characters such as Miyakonojou get decent coverage, though it's still slightly lacking.\\n\\n\r\nThe series didn't receive enough episodes in order to communicate its focus.\\n\r\n[This is related to the above negative, but examines how this aspect practically impacts viewers who haven't and won't read the manga.] As far as my opinion goes, the manga's focus is really on differing life philosophies coming together and enjoying both the positives and negatives of the result. Instead, based on how far the anime got, it appears to the viewer that Medaka Box is about inter-club battles and the Flask Plan and ... and actually, I'm not sure that there is any overarching focus. The series doesn't get far enough along. Someone who only watches the anime and doesn't read the manga will walk away with a very different impression of this series.\\n\r\nOpportunity for cancel: Yes, because the production team did a good job with the episode count that they had. There simply wasn't enough time to focus on what the manga focused on. I don't mean that there weren't enough scenes for monologue - there were. --but monologues wouldn't have cut it here. What I mean is that you'd need enough scenes that demonstrate the characters' views in order to properly cement those views in the story, but there just weren't enough minutes to show all those scenes without unacceptably rushing. So, the team focused on all the right things for a brief anime series.",
            "date": "2016-12-09T22:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 235171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5753100.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sorata861",
                "username": "sorata861"
            },
            "url": "https://myanimelist.net/reviews.php?id=235171"
        },
        {
            "content": "The story is you're average slice of life it can be related to the God Harui Suzimia. At the beginning or any Student council slice of life anime. But the story does get stale as old bread [cough cough tournament arc] but PERSEVERE for those long episodes were meant to be only a few chapters but they decided to make them ARCS, for some reason! But Near the end it starts to get spicey :)\r\nI even almost put it forever on the \"ON HOLD\" list, but i took a nap and continued.  Now after watching I WANTED MORE! so I watched the second season.QUESTIONS ARE ANSWERED! and its so nice, it may have a stale beginning but dont worry.now its by favorite anime of all time \\n\\n\r\nSo please watch this, Give it chance. Once you pass the stale episodes you already know the full cast so you just watch the \"Cool\" parts",
            "date": "2018-02-20T20:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 272067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6427020.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Neko-Nini",
                "username": "Neko-Nini"
            },
            "url": "https://myanimelist.net/reviews.php?id=272067"
        }
    ],
    [
        {
            "content": "From reading what many users mentioned in their rewiews i decided to be clever. Hear me out :  Many users mentioned how the show is dissapointing after each episodes so here's what i did.  I just watched the first episode and dropped it. If you do so, it's almost the best anime ever.  The personality of the main character is from outter space. The art is my personal opinion fits well. The plot is great and you can learn some life's lesson from it. I enjoyed how as the episode progress bad guys turn into good guys, the energy and aura fromMedaka, earned my respect and fits a bit my personality in terms of seeking control, perfection and helping everyone\"s problems. The second main character (Medaka's friend since their were 2 years old) is caring, strong and obviously highly influenced by Medaka's personality. I will not watch the following episodes under no circumstances or okasan will be sad.",
            "date": "2019-03-15T11:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 303580,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7065522.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KiyomiAkimitsu",
                "username": "KiyomiAkimitsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=303580"
        },
        {
            "content": "Medaka Box is not quite like Pandora Box which brings doom to the user, but rather it's a box which bring happiness to the entire school.\r\nKurokami Medaka, the main protagonist, is a student council president who won 98% of the voting election, mainly because she promises the existence of Medaka Box : a box which everyone in the school can put in their problems, whether studies, love, family, or any other personal issues, and the student council team will solve it.\r\nAs you may have imagined, Kurokami Medaka is a 'superior human', which means that she can do ALMOST everything alone. She is charismatic, hardworking, trustful,but sometimes can also be a tease to her friends.\\n\\n\r\nMoving on the the aspects of review :\\n\r\nStory (7)\\n\r\n- Not quite a story plot for the first two episodes. Just Medaka receiving some requests from the students, and she completes it. The plot was only Zenkichi, Medaka's childhood friend, who joined Student Council to help Medaka doing things that she unable to do. I don't really agree blending ecchi on Medaka Box, since emphasizing the depth of each story would be a better selling point than fan services.\\n\\n\r\nArt (8)\\n\r\n- Really liked the drawings. Backgrounds are well done. It's vivid and bright, reminded me of Baka to Test series.\\n\\n\r\nSound (7)\\n\r\n- No special review on this part. The soundtracks pretty well blending inside of the anime's atmosphere. The opening and ending were quite good, but not as memorable as Accel World's Chase the World, Sankarea's Esoragoto, nor Fate/Zero's to the Beginning.\\n\\n\r\nCharacter (8)\\n\r\n- So far, character development goes well. Medaka and Zenkichi couples up nicely and they each covers their partner's weaknesses. Hope for more appearances of characters in the future.\\n\\n\r\nEnjoyment (7)\\n\r\n- Sometimes Medaka Box can be a little bit touching, but sometimes it can also bore you (I don't really know, but it happened to me). I don't really expect the third episode, but I think I'm going to continue watching Medaka Box since as we never know the contents of the next box, as there is always an element of surprise in each box, including Medaka Box.\\n\\n\r\nI hope you enjoyed reading my review.\\n\\n\r\nNB :\\n\r\nThis review was written upon seeing the second episode of the show, so some changes may apply in the future. I also didn't read the manga, which enabled me to give a neutral stand on reviewing Medaka Box by anime solely.\\n",
            "date": "2012-04-13T08:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 58687,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510991.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/frozenspades",
                "username": "frozenspades"
            },
            "url": "https://myanimelist.net/reviews.php?id=58687"
        },
        {
            "content": "Medaka box,lets see an interesting anime or rather an annoying one! Or maybe i am jumping to conclusion!!! probably thats it.That's what i thought at first but i am telling you this that at first glance it may seem boring but i suggest that have patience because the first season is probably the most boring one! I am telling you guys this anime is far interesting as the story develops!\r\nThat being said lets get back to the issue in hand! Medaka box is a school genre anime that goes as a shounen type but probably not! It centers around a girl who loves everything orrather i say everyone( goes far as kissing to). Her name is kurokami medaka, a popular student council president who is willing to see everyone in her own ideal! She has monstrous strength, big boobs and a habit of mimicking everyone! She has the power of transforming( i don't know how) and can change modes like war god mode etc.According to zenkichi since childhood she always butts into others problem without thinking but somehow always comes out successful.But she has a never failed to solve a problem except one that she still regrets( this will be revealed in due time in the following season). She is a good character that acts like a saint but can be devil for the sake of his close friends!\\n\\n\r\nakune kouki, known as the judo prince, is a handsome man popular with the girls but that is after coming to high school. Before he was a terrifying person that caused a whole gang being hospitalized! He was being reformed by nekomi his for Judo club captain.He has feelings for medaka chan and confessed to her and got rejected in a instant.He was accepted a student council secretary by medaka chan and doesn't get along with zenkichi.\\n\\n\r\nKikaijima mogona is a swimming club member rather a special swimming club member! She with two others can live or kill for a single yen! she was hired my medaka chan a treasurer and wats to be friend with zenkichi and medaka chan.Her dream is to fill a pool with money and swim in it with Yakushima and Tanegashima, his two close partners! she lost her first kiss to medaka chan.\\n\\n\r\nshiranui hansoda is little girls in outside but somehow she knows everything and has solution to every problem. She is a member of the 13th class with medaka and unzen the disciplinary committee chairman( this will be shown in due time)! She is granddaughter of the sandbox academy! She hates the student council president, like sweets, doesn't think about rules and the one person she get along with is zenkichi but is when she likes.\\n\\n\r\nIt may not seem like but Zenkichi Hitoyoshi is the main character of this story!You will see this maybe in the later seasons! Zenkichi is a kind of tsundere person who despises but has feeling for medaka chan at the same time! He has been known and befriends with her since age two! He was always forced to go and tag along with every medaka chan plans! He isn't kind like medaka chan at all! he can kill in order to protect her!He is also known as the guard dog of the student council, the club crushers and later he will known as more! He does everything as his president says like wearing a jacket under his shirt.He regards himself as normal but he has more power than he thinks! His power far surpasses medaka chans power but i believe is not shown in the first season.He is probably a useless main character in this season.\\n\r\nthere goes the long character details!rather than them their are many minor characters that i have no energy to describe!\\n\r\nThis anime isn't good in the beginning but has the potential to grow interesting. this anime is mainly a comedy,martial arts,echhi,romance type anime!  except martial arts i believe rest are not that well shown!\\n\r\nTo be honest i didn't enjoy it that much but still recommend that you watch it!But i am waiting to see the later seasons if they air!!! cause that i believe will be interesting!   \\n\\n\\n",
            "date": "2012-06-14T08:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 63405,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1301733.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ijen",
                "username": "ijen"
            },
            "url": "https://myanimelist.net/reviews.php?id=63405"
        },
        {
            "content": "Hunter X Hunter.\r\nDragon Ball Z.\r\nOne Piece.\r\nBleach.\r\nAttack On Titan.\r\nNaruto: Shippuden.\r\nThese were the anime that everyone was talking about, and for a while, I bought into the hype.\r\nAround last year, I had never heard of this series, up until I was browsing around a YouTube playlist on KaggyVA's channel, and saw the abridged series to this show, Medaka MENT. Ever the curious one, I decided to watch this anime, so I looked it up, and I instantly got hooked.\r\nStory - 7\r\nThe series stars Medaka Kurokami, as she is the 99th Student Council President at Haikoniwa Academy, and she instantly becomes a staple of the school, with herabnormal superhuman feats, and abilities to 'show the right path' to other students in order to make them better people. Accompanying her is her childhood friend, Zenkichi Hitoyoshi, who is basically, Medaka's very own errand boy. Among the others are Mogana Kikaijima, a member of the swim club obsessed with money, and Kouki Akune, who is a judo prodigy.\\n\\n\r\nCharacters - 7\\n\r\nI've been browsing around the internet, and hearing things like 'Medaka a complete Mary Sue!' And 'She's too one-dimensional!' To that I say, NOT SO FAST! Medaka is actually a pretty well-rounded character (in more ways than one, you know what I mean?) She's level headed, but is also naive to the simplest things. But she always comes through in a pinch, even when it doesn't help. The rest of the cast is a (literal) colorful bunch. You have Akune, the judo prodigy who's hopelessly in love with Medaka, Kikaijima, who is tough, yet at the same time, shy, and the resident Big-Eater, Hasode Shiranui, who somehow knows everything about everybody, at anyplace or time. The supporting cast is pretty entertaining to watch, too, as they are the ones who get changed without realizing it.\\n\\n\r\nOverall, Medaka Box is a fairly underrated anime, and should have more recognition that it already has.\\n\\n\r\nGrade: A-",
            "date": "2014-08-25T19:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 157937,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3674147.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OneTrueAce",
                "username": "OneTrueAce"
            },
            "url": "https://myanimelist.net/reviews.php?id=157937"
        },
        {
            "content": "Medaka Box is an anime I stumbled upon while just browsing around on YouTube at some parodies and abridged series. Little did I know I was in for a great experience.  I have seen both this and the Abnormal Sequel Series and yes my score is based around both as with this review. I won't spoil anything so go ahead and read the rest of this worry free.\r\nStory 9/10\r\nThe first series was all about what the anime was titled about: Medaka's Student Council Suggestion Box and her quest to reform the school and everyone around her. It is somewhat more light-hearted than the secondseasons immense amounts of violence  and blood because it revolves around most of the school life and Medaka's Student Council. This may not sound all too exciting for the first season but Medaka herself is an abnormal person being physically able to do anything presented to her. After first season, second season picks up and presents a conflict, The Flask Plan which I find relieving since it doesn't remain somewhat of mostly filler. Although, I did not personally enjoy the ending as it really didn't have any relation to the rest of the series except for back story of a character we didn't know about until the second to last episode. But its one of those you may have to read the manga so I somewhat understand the reasoning behind that.\\n\\n\r\nArt 8/10\\n\r\nThe art style presents a lot of fan-service but does it in a way you'll still like the way everything is drawn. Its not the most beautiful  anime but the way it presents itself is quite nice.\\n\\n\r\nSound 8/10\\n\r\nI liked all of the tracks except for the first season OP. It just didn't appeal to me and just felt generic. However every other theme in both seasons were very moving and I feel they fit the style and tone very well. I did watch in dub and I was very happy most of the voice actors cast consisted of Clannad actors.\\n\\n\r\nCharacter 10/10\\n\r\nI loved every character presented in this anime, especially Medaka. She may be abnormal but its a good light hearted abnormal with one goal, help everyone around her be happy. She herself goes through major development mostly occurring in the second season but you can see the seeds of it being planted at the end of this series. As I said above, I really enjoyed the Clannad party here in the dub, it makes them more recognizable to me. I also enjoyed the wide variety of troubled people in the anime.\\n\\n\r\nOverall 10/10\\n\r\nThis is not a perfect anime by any means though through it all, I really enjoyed what saw. Every bit was enjoyable to watch and if you are into school with some added effects, give this a watch. You may not feel like I do but I assure you, you will not be disappointed by this anime, except maybe for the ending. But hey, if you can put up with, it still makes an enjoyable experience.\\n",
            "date": "2014-12-10T04:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 171643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4131017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheAfroNinja",
                "username": "TheAfroNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=171643"
        },
        {
            "content": "Medaka Box...\r\nJust a small intro.. This is about a girl named Medaka Kurokami who is the newly elected student council president of her school Hakoniwa Academy.. As part of her platform/project she sets up a suggestion box wherein any request that will be placed will be put into motion.. That is the adventure of Medaka and her fellow student council recruits..\r\nThis is a kind of anime that will make you say \"what the hell\".. I mean it.. Why? It's because it presents a plot wherein you can't say if it is shonen anime or just an anime with an episodic format or those animes whereeach episodes differ from one another... \\n\\n\r\nWhen I first saw the poster, I put it in my to be watch list because it has a good poster.. My rule in watching anime is like this; when the drawing in the poster is good, I'm going to watch it.. Then, the watching starts... And as I watch it, there are times that I was surprised with the flow events.. For me, the whole thing is unpredictable.. I don't know if the scenes are to be considered shonen with awesome action scenes are some normal scenes.. That's my feelings..\\n\\n\r\nWell, to elaborate..\\n\\n\r\nStory (10)\\n\r\nWell.. I said that I was bit mislead at first but the concept that this series presented was good and interesting... First, they showed a concept wherein a student council acts like bounty hunters, gun for hire individuals or individuals that will do anything.. Well.. that's an exaggeration.. What I mean is.. the student council will do anything to help.. If that's what happening in real life student council, I think all of the schools in the whole world will live the best of their school lives...\\n\\n\r\nSecond, the structure of the school concept... They have a very huge school grounds, very sophisticated swimming pools.. what else can you say.. It's an awesome school.. It's just like you are entered in a school that surpasses the most  awesome school in the world.. HAHAHA.. just saying..\\n\\n\r\nThird, you may not know it but this anime will go into the path of sci-fi/fantasy and pure shonen.. Why? Because the main characters, especially the villain, are monsters... They have supernatural like abilities.. Also, as the story mentioned, there are this special class that have monster like individuals... I don't know yet the exact details but you will definitely sense that the series will be a real shonen..\\n\\n\r\nArt (9)\\n\r\nUh.. I have no issues with the art... Medaka is beautiful... The other characters are OK.. Very shonen like art..\\n\\n\r\nSound (7)\\n\r\nI have no issues with the sound... I can say that I enjoyed listening to the Ending theme more compared to the opening..\\n\\n\r\nCharacter (10)\\n\r\nI can say that the characters presented to us are the ones you can really call \"abnormal\".. Well their character traits are in the extremes.. Medaka is super good, like a saint.. Unzen is super justice bent, like an obsessed justiceman.. Mogana is super money obsessed... The good thing about this extreme characteristics is that you can clearly see that main conflict.. It is not hard to understand who is right and who is wrong.. The clash of ideas are clear..\\n\\n\r\nI'm going to talk about the character of Zenkichi for a while.. This guy is special... I like the way wherein he is giving bluffs, threats or advice.. If you will watch it, I think you will smile with the message... It's like the message is so badass or the message is very funny.. Just watch..\\n\\n\r\nAnother character that caught my attention is Shiranui.. Shiranui is very funny.. Not to mention that she is very cute.. She is like a chibi drawing because she is too small.. But the thing that sparked my interest is her mannerism.. She is like a secret villain that is planning the dirty works in the shadows and then her very cute face is the poker face..\\n\\n\r\nEnjoyment (10)\\n\r\nThe first parts of the series shows the different task or request.. It is fun to watch that absolute goodness will prevail in each task that are finished.. It's like you are watching a values show wherein each episode teaches a moral lesson in the end.. \\n\\n\r\nThen, here come the other part wherein the series starts to live up in its action genre.. There are opponents and there are action scenes.. DAMN, all of them are awesome... The balance is good.. There is comedy, action sometimes a little bit of drama..\\n\\n\r\nOverall\\n\r\nWell.. watch this.. This is not you ordinary type of school anime or slice of life anime... It had it all... I don't think that I have things that I hate in this one.. It's like I enjoyed the whole series... Take note.. this is a manga series, so I expect more seasons to come..\\n\\n\r\nThat's it.. Thank you\\n\\n\r\nLightningSnow...",
            "date": "2012-11-11T06:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 77229,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571221.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lightningsnow",
                "username": "lightningsnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=77229"
        },
        {
            "content": "The setup of this anime is not original one, it is of a high school prefect body taking care of the school issues which in here mostly involve odd requests from some students. How are they solved and more than that how wackily they are solved by an eccentric genius forms the plot of the story. The author has tried to marry wackiness and the usual theme of high school comedy, and I feel it hasn't worked out very fine in that regard. However I had fun just watching the possibilities pop up and surprise me though the surprise didn't always quiet meet up withmy expectations. The story is very fast moving and the author doesn't wait for much story to build. The action and comedy starts pretty soon which works fine for this kind of setup though you are left with astonishment which you wont find hard to let go. What stands out in this anime is some original characters and setups and the comedy elements. In the end the anime is a mix up of whole lot of things which don't quiet added up that well but you'd love to stick to it for memorable characters and some things that you can find only in this series..",
            "date": "2012-06-28T02:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 64627,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261710.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/puvijain",
                "username": "puvijain"
            },
            "url": "https://myanimelist.net/reviews.php?id=64627"
        },
        {
            "content": "I'm unusual in that I'm really not a fan of Gainax. I think they did a good job with Tengen Toppa Gurren Lagann, and to be fair, I did really enjoy that, but in general, the fact that their shows are so over-the-top puts me off watching something when I see they're producing it. Still, Medaka Box is by the author of Bakemonogatari, and as much as I hated Nisemonogatari, that still gave it enough weight for me to want to try it.\r\nIn general, though, I think they did a good job this time. I'm not actually a reader of the Medaka Box manga, soI can't say much about how closely it follows the manga. Still, I thought it was well-paced (both the individual arcs and the series's progress through them). The 'high school student council' setting isn't particularly original, but the suggestion box gives a really nice twist to it, and the fact that Medaka herself is so powerful makes it quite a good match for Gainax (although I'm glad to see they tone it down a bit in the few serious moments that there are).\\n\\n\r\nThe characters are generally pretty interesting, and a good match for each other. They're also pretty three-dimensional, with characters who initially seem two-dimensional becoming more willing to show their other sides as they get closer to the other characters as the show progresses. That's quite unusual in anime, and very unusual in this kind of action-packed romp. The co-dependent relationship between Medaka and her student council members is interesting and not terribly straightforward. Usually in anime, strength is better than weakness, but in Medaka Box, strength is also weakness, something that's touched on in the early episodes and explored in a little more depth later on in the series. I'd expect to see more of that in the next series.\\n\\n\r\nIt's not that I don't have my niggles about the show, of course. I know that Medaka is well-endowed in the manga, but that isn't really a reason to keep pointing the camera at her breasts and panties. This is more than a fanservice show; trying to make it into one to appeal to the teenage-boy demographic is going to put off the slightly more mature demographic who are more interested in watching it for what it is. I also felt like some of the comedy could have been a bit more subtle. Gainax really do always feel the need to stick humour right in front of one's face, but often that isn't as amusing as implication or sharp dialogue-based humour (hey there, Bakemonogatari), which there could have been more of with a cast of characters whose personalities clash so unusually.\\n\\n\r\nMedaka Box isn't a masterpiece (and it could have been). But it is very good, and I'd recommend giving it a try even if it doesn't look like your usual sort of thing.\\n\\n\r\nhttp://james-neve.com/blogposts/7-anime-review-medaka-box\\n",
            "date": "2012-08-27T01:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 70951,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160376.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Neve",
                "username": "Neve"
            },
            "url": "https://myanimelist.net/reviews.php?id=70951"
        },
        {
            "content": "Faster than several events supposedly taking place at the same time...  More powerful than strings that can hold several tons of weight...  Able to leap fleeing track team members in a single bound...  This strange visitor from class 13...  The Super Saiyan of our school...  Student Council President Medaka Kurokami!  Empowered with athletic superiority, possessing remarkable physical strength, Medaka fights a never-ending battle for truth, justice, and the pretentious appeal to the innate goodness inside of every living being!  Disguised as a normal teenage girl, and aided by the friends she’s met along the way, Medaka will stopat nothing to fulfill the hopes and dreams of any student bold enough to leave a request in her suggestion box!\\n\\n\r\nIn one of the most shocking upsets and complete landslides in Sandbox Academy history, the newest Student Council president is, surprisingly, a first year student named Medaka Kurokami...  Or, if you translate it, Black Spirit.  While most high schools would elect a student to each individual spot on their student council, but in this case, Medaka wastes no time occupying every slot herself, handing them out to people she interacts with whenever she meets somebody who she thinks will perform them well.  She gives the first spot to her childhood friend Zenkichi Hitoyoshi, and with his help, she immediately pledges to use him in her quest to respond to every request that the student body gives her.  But can even the over-powered Medaka stretch herself thin enough to keep to this promise without breaking, or has she broken off more than she can chew?\\n\\n\r\nMedaka Box was animated by...  Do I need to say it?  I mean, even if you’re not reading this on my blog during Studio Gainax Month, it doesn’t take long to figure out who the studio behind this show is.  If the color palette and intense focus on female fanservice don’t tip you off, the visual direction certainly will.  While Gainax isn’t normally one to use obscure angles and filters to distract from lengthy dialogue, it does have a nasty habit of using over-the-top, absurd visuals steeped in obvious metaphor to accentuate what’s supposed to be more thrilling dialogue.  Medaka’s speeches to people she’s reprimanded can often make her appeal God-like as they shrink away in her presence.\\n\\n\r\nHer power over others is also often expressed through the use of cheesy special effects like light beams and explosions, neither of which are actually happening in real time.  These effects are pretty cool looking, but unfortunately, it’s obvious that the bulk of the budget was spent on them.  That’s not to say the animation is ever bad, though...  Even at it’s worst, it’s at least executed passably.  These two elements of the aesthetic stand in stark contrast to each other for the first two thirds of the series, but when they finally collide in the final act, the animation becomes pure spectacle that could rival even Dragonball Z in terms of the presentation and scale of the destruction.\\n\\n\r\nIt’s nothing to call home about over-all, but it’s a pretty good looking show, and that last third alone earns serious points from me on the visual side of things.  What I can’t speak so highly of is the character designs.  The characters look like...  And I can’t believe I’m saying this...  A cross between Code Geass and Haruhi Suzumiya.  They’re over-designed, detailed in the weirdest of ways, and have haircuts that are somehow dull while still being strange-looking enough to rival Yugioh.  There’s really only one character in the show who I didn’t have a hard time looking at, but that was back when she had interesting expressions that hinted at inner turmoil, all of which disappeared when she donned some fetish glasses and joined the council.\\n\\n\r\nThe music, once again, isn’t really bad, but it’s pretty damn forgettable.  The few times I did notice it, it was because it was over-powering and in some cases even distracted from the dialogue.  When I try to listen to the individual tracks on youtube, there’s something about the synchronizing and the beat that just gives me a headache.  This sentiment is carried through to the opening.  Happy Crazy Box by Kuribayashi Minami is a moderately catchy song, but the visuals are so standard and effortless that I only really watched them once or twice.  It’s a standard Shounen opening by every possible definition.  You get god-like images of the main character, slightly more casual images of her clubmates, and each villain taking their turn to pose and mug for the camera.  On the one hand, this opening might spoil who’s going to be joining the council throughout the series, but on the other hand, they’re all fairly easy to spot through attention to the writing alone.\\n\\n\r\nThe English dub comes to us straight from Sentai Filmworks, care of ADR Director Stephen Foster...  Great!  Are we getting an inappropriate rewrite that effectively kills the show, or a faithful-to-the-letter translation that sounds horrible and doesn’t even both matching the characters’ lip flaps?  While neither option is particularly inviting, I’m still going to say it’s unfortunately the second one.  As I mentioned in my review of Kill Me Baby, Foster had a nasty habit of trying to avoid critics of his writing by not writing at all...  Just putting the direct English translations on screen, and letting his actors wing it.  Some of them try to make the speech look natural...  A few of the side characters manage to pull it off from time to time...  And some even try to reword their lines, but these efforts accomplish little and never last long.  Foster’s laziness hits in other ways as well, like how the ending credits are never updated in any episode.  The five most important actors are listed respectfully, and then every single other name involved is listed below.  In every episode.\\n\\n\r\nThe acting, for the most part, isn’t much better.  I’ve always found Shelley Callene-Black to be a very limited actor, as she’s a really talented performer when she’s playing a few certain types of characters...  I’ll spare you the list, but ‘teenage girl’ isn’t on it.  She’s even more awkward here than she was in Clannad, if you can believe it.  The same sentiment applies to Andrew Love, who does a great job playing adults and tough people...  Like, for example, he was awesome in Log Horizon.  So was Ms. Black, incidentally.  But as the Lego brick male lead of a romantic comedy, he just doesn’t bring anything to the role that a better actor couldn’t trump him on.\\n\\n\r\nHillary Haag plays a charming third wheel, and is one of the few actors who really seems to be trying to make the awkwardly translated dialogue work.  Greg Ayres is the other one, having a great time in his villainous role without even bothering to look for depth or complexity that just isn’t there.  Tyler Galindo and Maggie Flecknoe round out the rest of the Student Council, but if I’m being honest, they both did a pretty terrible job.  Galindo was stale and lifeless, while Flecknoe was just all over the place.  I know that in both cases you could say the same thing about their characters, but still, they should have at least tried to rise above the material they were given, like Ayres, Haag and Monica Rial did.\\n\\n\r\nI actually did listen to a few episodes in Japanese with subtitles, and I highly recommend that track instead of the dub.  Yuki Ono and Aki Toyosaki sound a lot more natural and down to earth than Love and Black do, and as much as I enjoyed Greg Ayres as a villain, the legendary Romi Park...  You know, the Seiyuu of Edward Elric?  Just sounds as slimy and blood-thirsty as a talking snake in the same role.  It’s easily sub-over-dub, which is kind of unfortunate because, considering the ridiculous nature of the series, I honestly wish Foster had gone with the first of the two options I listed earlier...  Rude, outlandish dialogue that offends everybody while making tongue-in-cheek jokes about it’s own story, especially since this story...  Eh-hehm...  This story...\\n\\n\r\nSay, who here loves the Rightstuf.com holiday sale?  I do!  I send Rightstuf obscene amounts of my disposable income in exchange for heavily discounted anime every year.  I ordered a bunch of titles last year, most of which I’ve never seen before, and among them was a quaint little title that I quickly realized was part of the eclectic school club genre...  A genre that was inspired by Haruhi Suzumiya before getting warped by harem influences.  I went in with apprehensions, but was pleasantly surprised by the engaging dialogue, rich characters, and what felt like a genuine attempt to deepen the main relationships and flesh out some of the side characters.  It ultimately failed to live up to it’s lofty ambitions and escape the trappings of it’s genre, but I still found it to be a breath of fresh air compared to similar titles like Haganai and Oreshura.  That title...  Was not Medaka Box.  It was My Teen Romantic Comedy SNAFU.  In contrast, Medaka Box didn’t do it’s genre ANY favors.\\n\\n\r\nTo start with, one of the first observations I made about this series...  That it just refused to try to prove me wrong on...  Is that it had, at most, two brain cells, and that they were completely incapable of rubbing up against each other long enough to form a coherent thought.  Yes, I’ve called anime stupid before, but this is on an entirely different level.  Every single moment in this series, from the plot twists to the decisions the characters make to the occasional details of backstory, is more stupid than the last.  To start, let’s take a quick glance at the characters.\\n\\n\r\nThe title character Medaka is so perfect at everything she does that it won’t take you very long to start thinking she isn’t really human.  She can run faster than the best member of the Track and Field team, jumping dozens of feet in the air while doing it.  She can stand on a pair of water wings in the middle of the pool without falling into the water, she won millions of dollars by answering the worlds’ hardest math problem when she was in middle school, and she can even strike multiple kendo opponents at once while a friend insists that she’s human.  Almost everything she does is explained to the audience via exposition from Hitoyoshi about why it makes sense according to her backstory.  That’s pretty much the only reason he exists, by the way.  Oh, and of course, Medaka is such a perfect fantasy girlfriend...  Excuse me, main character...  that she’s also an exhibitionist who doesn’t mind constantly stripping down to her undies, just for the hell of it. \\n\\n\r\nEven when a character is interesting upon their introduction, they quickly either lose all of their unique qualities, or just fade into the background, but leaving aside the characters and their development, the writing of this series is just unsalvageable.  Every single turn of the plot is random, often to the point of being self-contradictory.  To be honest, I wasn’t sure what example from the story I would use to demonstrate just how terribly written it is, as every time I thought I’d picked a winner, a new example would pop up, stunning the shit out of me.  I could not go a single episode without asking some variety of “What the fuck?” or “Are you kidding me?”  or to my ever increasing chagrin, “They can NOT be that stupid.”\\n\\n\r\nYou know what?  Instead of just picking one example, I’m going to go with three.  Yup.  I’m giving you some bonus nitpicking, you special people, you.  Don’t ever say I don’t love you.  To start, let’s examine just how much ADHD went into the thought process behind this show by examining a single episode...  No, it was half of an episode, I’m pretty sure.  We hear Medaka proclaim that her goal is to fulfill every request she gets, to the letter, without any regard to the consequences, and already, I can’t even tell you how many ways this promise could be abuse, but let’s get back on topic.  \\n\\n\r\nA girl hires her to help her write a love letter, claiming she has bad handwriting.  Medaka hands this job off to one of her council members, who then writes the entire letter for the client, and when Medaka hears about this, she’s pretty disappointed...  Not by the fact that he didn’t go the obvious route of simply dictating the letter, but because the letter was in his words, and thus would be meaningless to the receiver.  So how does he rectify his mistake?  I am not kidding about this...  He teaches the client to have better handwriting.  So this entire plot about coming up with your own words that are true to your heart is spawned from a request for HANDWRITING advice.  Which is great, because if they performed her request to the letter, there might have been long term consequences...  We can’t have that!\\n\\n\r\nOh, but it gets better.  In a later episode, Medaka and her council is trying to figure out how to allocate the school’s club funds to all the various school clubs.  Their solution?  Instead of analyzing the situation and coming up with a smart plan...  Remember, this chick won millions by answering an impossible math problem...  They decide to hold an athletics festival in the middle of a fucking swimming pool, while very vaguely stating that the results will decide the budget.  Now, some people complain that the swimming club will have an unfair advantage, but that’s okay, because the student council is entering too, just to fight them!\\n\\n\r\nMedaka says she’ll triple the budget of any team that surpasses hers out of her own pocket, but the details don’t matter...  You’re supposed to be focusing on the fact that the swim team is using reckless tactics to win, because they all grew up poor and they love money.  They chose an unsafe way to swim to the bottom of an over-twenty-foot pool and grabbing balls to throw in the weird sports fest basket thingies?  Oh no, they should have been rapidly submerging and resurfacing the safe way!  What’s that?  During the three-legged race through the shallow pool, they swam, kicking in harmony?  That’s just dangerous!  And then you have to get used to the idea that this whole debacle was written just to give them an excuse to have Medaka kiss the female swimmer.  Oh, and she gets recruited to the council, but don’t worry, we never have to explore her troubled backstory...  She loses almost all personality after this.\\n\\n\r\nBut you know what?  Those examples are just kid stuff.  Those aren’t all that bad.  Yeah, they’re incredibly freaking stupid and make no recognizeable version of sense, but those ultimately amount to little more than light complaints.  If a stupid show that couldn’t stay focused on it’s own plot was an immediate turn-off for me, I wouldn’t have such a big soft spot for Angel Beats.  No, to truly earn my fury, this show would have to royally shoot itself in the foot...  Which it soundly does.  So, we’re coming to the third example, and I have to warn you, it’s a bit of a spoiler, but only a bit.  It’s probably the most significant event in the entire series in my opinion, but it isn’t treated as anything more than the springboard for the show’s climax, so I’m not giving too much away by telling you about it.  Still, you’ve been warned.\\n\\n\r\nTowards the end of the show, the Student council has a run-in with the disciplinary committee, who are upset about the council’s wardrobe adjustments.  She hounds them for a bit, before realizing that she can just use the suggestion box to solve the problem(I won’t tell you what she requests, just know that it’s NOT “I request the Student Council dress more conservatively), and she’s eventually won over.  Well, the Chairman of the committee is a lot more hardcore than her.  Enter Greg Ayres’ villain, who gets called to the school’s orchestra club to deal with a noise complaint, and...  and...  He kills them.  Yup.  That’s all there is to it.  He slaughters all but two of them, and the fact that he’s a fucking mass murderer just gets glossed over for the rest of the three episode climax.\\n\\n\r\nThere have been plenty of anime that I thought should have, in some way, involved the police.  Characters take illegal actions, and I think “Call the police, problem solved.”  This is the first character I’ve ever seen that’s gotten away with literally murdering a whole club room full of teenaged boys and girls who have families, and friends, and HOW THE FUCK DOES THIS NOT GET MENTIONED AGAIN?!  This was the moment that I went from nitpicking to pass the time to full on hating the show and all it represented, and oh yeah, while we’re here, let’s talk about what it was that it represented.\\n\\n\r\nThe over-all message of Medaka box...  Yes, there’s a message it’s trying to tell us, and if Medaka constantly getting called pretentious isn’t a good enough clue, let me help you.  The message of Medaka box is that there is innate goodness in all people, and no matter what they do...  No matter what the crime, no matter what their behavior, no matter how sick and revolting they are...  You shouldn’t punish them, because through kindness and understanding, they can be reformed.  Scratch that, I know *EXACTLY* why the mass murder is never brought up again...  The sooner you forget about it, the less you’ll be compelled to ask if the families of all those slaughtered would be satisfied in knowing that the kid who left them grieving was beaten in battle, reformed, and then recruited to be the new vice president of the student council, instead of somebody’s lovely bunkmate in prison.  Oops, that was a spoiler, but you know what?  Here’s all you need to know about this show in order to spoil the whole damn thing:  Medaka is the mouthpiece of an extremely naive and ignorant worldview, and everything that happens, no matter how unlikely the event or how incomprehensible the decision, is made to support her grandstanding in one way or another.  There’s a chance she might get proven wrong in season 2, but I don’t know, and I never will know, because I’m never touching this series again with a sixty foot pole.\\n\\n\r\nMedaka Box is available from Sentai Filmworks in both DVD and Blu-ray formats, both of which are pretty expensive if you don’t find a good sale on them.  The manga, by author Nisioisin and illustrator Akira Akatsuki is available stateside through it’s run in Shounen Jump, but has unfortunately not been released in standalone paperback yet.  Unless of course you speak Spanish or French.  A Second season, which is called Medaka Box Abnormal, is also available from Sentai Filmworks, and from what I’ve heard, it runs on a premise that may actually redeem Medaka’s character...  The fact that she’s not human.\\n\\n\r\nI’ve been doing Studio Gainax month for three years now, and in that time, I’ve come across some huge disappointments.  I wasn’t a fan of Abenobashi, His and Her circumstances or Stella Women’s Academy, but Medaka Box is easily the worst Gainax show I’ve ever seen.  I didn’t enjoy a single second of this shallow excuse for fanservice exploitation.  I might have been more lenient on it if it were just stupid, and never left the boundaries of being laughably bad, but it didn’t...  It used a pointlessly grimdark tonal shift at the top of it’s third act to suddenly start pretending to take itself seriously just because it felt it had to.  I don’t know what it was building to, and I don’t care. I give Medaka Box a 1/10, and the only reason I’m giving it that much is because the animation was decent, and despite that ugly thing they did, the final act did have a lot of neat, enjoyable action in it.  Other than that, I’m done with this.",
            "date": "2016-01-03T10:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 207657,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=207657"
        },
        {
            "content": "Whenever there is a series that has the main characters depicted as members of the student council or the student council itself, they are often made to be not so serious or comic relief and they tend to be even rowdier than the delinquents in the school that they're in. Well... Medaka Box did not fail with that. \r\nTo be honest, I only came to for the ecchi. But somehow, I was given much more than that and what I found in this series was Action and Superpowers. From those two genres, I can already feel that with those two combined, there is a genrethat is commonly the result of those two... which is the widely popular genre.... Shounen. I was not really happy with that but since it's a genre that I used to watch, I don't really mind it at all. The story is somehow unique but my predictions don't come far from the actual things that would happen since it is a typical shounen plot style that has the main idea of the \"Resolve after Conflict\" situation.For the first season, it is a bit fast paced and it only highlights the important events but I can't really complain about that since I prefer that over series that drag it out too long. Since it's shounen, it would have cliche moments but the ones here are just so ridiculous since the main character is so ridiculously overpowered. The art is some kind of a failure and even if you're already watching at a high resolution, it just feels that the illustrations weren't given much effort and the animation is kind of cheesy. I'm going to say the same thing about the soundtrack and there isn't anything particularly good about it. The opening and ending themes are almost catchy but I just can't get a feel from it. For the characters... I just have one thing to say.... They are.. Dashing!!  But... they only have the typical mindset for shounen characters. I only enjoyed this series because the main character is so overpowered so I can't imagine continuing this series if that wasn't one of the elements. Well.. one thing I can say is that if you love the crazy shenanigans that happen in the not-so-typical Student Council members' life, then this is another series for you to watch.",
            "date": "2018-05-03T19:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 279728,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=279728"
        },
        {
            "content": "I personally loved the first 9 episodes. It was interesting to have a nearly 'perfect' character and refreshing. The dub made it out she wasn't perfect however and they let you deduce she has problems with animals. SHe isn't human or so you think after all of her self righteous acts. After awhile I will admit it gets boring. I feel that the battle arcs (sorry fans.) are yes unique maybe cool, but rather dull and uninteresting. I love the student council because it has a life to it and light-heartedness. There is a lot of cool things they could have used as the studentcouncil. I feel the author was running out of funding or something and then turned it into a battle manga when he was at first writing a romance, then changed to a average shounen, then changed again to a battle manga when he was desperate. After that the whole thing looses interest. I like the dub's personality and perfect humor. It's something which a lot of anime doesn't have. The jokes are actually funny. They have clever analogies but not over the top. They don't repeat awkward laughs...\\n\\n\r\nDoes anyone else see how this is somehow better?\\n\\n\r\nWho thinks they should return to a normal student council arc? Should they seperate the mangas into two seperate ones?\\n\\n\r\nWHY WHY? THE battle manga ruined the show. If I wanted to watch a battle manga I would watch a mecha or something interesting instead of a naruto/dragonball/death/Nagamai note parody.\\n\\n\r\nThe battle arc :( ruined it!",
            "date": "2013-12-10T11:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 123289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dgbug3",
                "username": "dgbug3"
            },
            "url": "https://myanimelist.net/reviews.php?id=123289"
        },
        {
            "content": "Medaka Box is a show that is highly generic but has it's own twist. However you can't help but fill like you've seen it before. I gave it a try, being a big fan of the 'monogatari' series(due to both having the same writer) but was disappointed, this show didn't meet my expectations, even with Nisio Isin. The artwork is vibrant but could be more refined. Overall, I'd say it's average. GOOD for what it is, just dont expect any sort of depth or overwhelming originality here.",
            "date": "2012-08-20T15:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 70425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1122461.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/angrystrawberry",
                "username": "angrystrawberry"
            },
            "url": "https://myanimelist.net/reviews.php?id=70425"
        },
        {
            "content": "Medaka Box has an original design and a good animation from Gainax. But the whole story is dysfunctional by Medaka, the perfect Mary Sue. I can't see a development if everything goes to the same thing always, throughout the whole story Medaka is always given the reason even for no apparent reason. When everything becomes predictable it becomes boring.I can't see any charisma on the part of the character or empathize with it even if the story tries to justify it.\r\nGood story about school and fights to hang out just that. Although the story tries to portray the way society is, the characters just donot give me any impression.",
            "date": "2019-02-13T18:57:00+00:00",
            "helpful_count": 0,
            "mal_id": 301617,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5605910.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Miyukichi",
                "username": "Miyukichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=301617"
        },
        {
            "content": "First review here. I'll try to keep it concise. There will be spoilers up ahead.\r\nI've watched a lot of anime, and I tend to give them pretty high scores, mostly because I'm pretty forgiving when it comes to thing I enjoy. But this anime is easily the least enjoyable thing I've had the displeasure of watching in a very long time.\r\nFor starters, if you're unfamiliar with the story, it's about Medaka Kurokami, a perfect and amazing girl with massive... charisma, and her objective is to solve the problems of the students of her academy with the help of the Student Council members, which she recruitsas the series goes on.\\n\\n\r\nIn theory, the character of Medaka is meant to be a parody of Shonen heroes, being overpowered and having all sorts of nonsensical abilities (most of which aren't showcased in this season, but if you've seen the later parts of the manga, you'd know how absurdly broken Medaka gets). However, the problem with being a parody is that you can't just expect people to laugh about the concept of a joke character, when the \"joke\" is played completely straight.\\n\r\nI hate comparisons like these, but I feel that it would make my point easier to understand. Take a look at Saitama from One Punch Man. Saitama takes the concept of an overpowered character in a universe full of characters below his league, and it uses that to show how dull and depressing it really is to be better than everyone.\\n\r\nOn the other hand, Medaka does the absolute opposite of this. Medaka and everyone else in the show knows about how wonderful and perfect she is, with only a few unfortunate fools having the guts to defy her. Needless to say, those foes tend to get instantly humiliated. There is one occasion in which Medaka is the one to lose, but it's played so poorly that even a kid would be able to predict it, and it does not even have negative repercussions for Medaka in the long run.\\n\\n\r\nAnd when you take a look at the supporting cast, they're not any better at all. You have your underdog companion that's totally not head over heels for Miss Perfect; the \"funny\" loli that's always eating stuff or messing with underdog-kun; the other boy who is in love with Medaka, but doesn't actually bother hiding it; and the female character who starts off as a rival but then joins the team after getting kissed by Medaka (yes, it's as stupid as it sounds). Oh, and let's not forget the myriad of one-off characters that don't actually have any contribution to the plot other than to add filler!\\n\r\nLastly, the main villain (whose name I didn't even bother to remember), is supposed to be menacing and strong enough to put an end to Medaka's reign, gets utterly humiliated after explaining his extremely boring and unmemorable motive. The worst part is that even after the overly-long speech about Medaka's \"ideals\", and the buildup for the villain's defeat, Medaka instantly forgives him and tells him to join the student council. I get that this is supposed to be \"funny\", but it just isn't. At all. It turns a somewhat valid antagonist into a zero.\\n\\n\r\nAfter the final battle is done, the last episode of the season is... a filler one about shogi (Japanese chess). And it was just as boring as it sounds.\\n\\n\r\nAnd even when considering all my gripes with the writing, I still can't find a reason to like this series.\\n\r\nThe designs were decent and flowed well in motion, but in comparison to other Gainax works, it feels cheap and mediocre. It looks more like something you'd expect out of A-1 Pictures.\\n\r\nNone of the designs really stood out, and some of them are so similar to each other that you can easily confuse the characters.\\n\\n\r\nThe sound design was not bad per se, but there's absolutely nothing memorable in it. The opening and endings were pretty generic and there's not even a sound effect that stuck with me.\\n\\n\r\nBut on the bright side, the show is pretty short, and the abundant fanservice is at least pleasant to the eye, as excessive as it may be at times.\\n\\n\r\nSo overall, I cannot recommend this series. It tries too hard to be a parody without actually being funny, and it lacks the self-awareness that could've saved that concept.\\n\\n\r\nPlease do yourself a favor and avoid watching this series at all costs.",
            "date": "2018-06-25T16:06:00+00:00",
            "helpful_count": 0,
            "mal_id": 282221,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5277274.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/NocturnBros",
                "username": "NocturnBros"
            },
            "url": "https://myanimelist.net/reviews.php?id=282221"
        }
    ]
]