[
    [
        {
            "content": "Nogizaka Haruka no Himitsu is the most fun and just plain entertaining series I have watched this year.  I don’t like to throw out 10s to shows that often and maybe I am rating this show a little high in comparison others.  But this is one of the few shows that had me from episode 1 and never let me down through the end. While the overall concept of this anime is not anything new and groundbreaking (though really what is anymore?), Nogizaka does everything exceptionally well.\r\nAt its heart, Nogizaka is a romantic comedy with some mild echiiness and a few harem elements.The story starts out with our protagonist Yuuto accidentally discovering the schools most idolized girl Haruka Nogizaka is a closet otaku when he bumps into her in the library with a manga called Innocent Smile.  After a bit of an overreaction on Haruka's part, Yuuta promises to keep her secret from everyone else.  Personally I thought this was an excellent concept for a story but in one of the few things that this series fails at a bit because it doesn’t quite deliver.  By episode 3 she’s already exposed her secret at school herself, but there doesn’t seem to be any consequences or reaction to this revelation.  The romance elements then take over as the story becomes more about Yuuto and Haruka developing their feelings for each other than her secret obsession.\\n\\n\r\nThe series also features a number of anime and manga references, mostly to Shakugan no Shana.  If you have seen that series and especially if you’re a fan like I am you will get some extra enjoyment out of Haruka cosplaying Shana.  One of my favorite moments was Haruka saying Shana's trademark \"Shut up! Shut up! Shut up!\" and replying that she had always wanted to say it (Haruka's voice actress played Hecate in the series).  Plenty of other references provided a lot of laughs such as a yaoi doujinshi featuring Inukami! characters Keita and Karina.  I also found the cameo by manga loving Japanese prime minister Taro Aso humorous.\\n\\n\r\nAs leads, Haruka and Yuuto are very enjoyable and fun to watch.  Yuuto reminds me of other anime males I like such as Tomoya and Yuichi from Clannad and Kanon.  He feels like a real guy to me, he isn’t perfect but he stands up for his friends and acts like a man.  One of the few anime males I would actually want to date myself.  Haruka is a bit more stereotypical of anime girls, she is very beautiful and seemingly unattainable on the surface.  She’s shy, clumsy, clueless, and very moe.  Despite this, I don’t think anyone will not find something to relate with her and she is just so funny and cute that you can’t help but love her.  Several of the supporting characters manage to be entertaining as well, in particular Haruka's younger sister Mika.  Though she is the most stereotypical of the group as the perverted wise above her years younger sister.  The Nogizaka house maids also provide a number of laughs as do the mother and father.  Yuuto's sister and her teacher friend are pretty boring though as they are the fairly boring half naked drunkards.  Shiina is a classmate who could be considered a rival for Yuuto but she never develops as a serious contender (rightly so I must say).  The characters are also kept to a minimum as well so we get to know most of the supporting characters pretty well.\\n\\n\r\nThe show really shines in the art and music.  The characters are beautifully rendered and the series as wonderfully vibrant colors and detailed backgrounds.  The voice acting is stellar and features a great overall cast.  I can’t say enough good things about the music.  It captured the charm and the tone of the series perfectly.  The OP/EN songs as a pair are probably my favorite anime songs to date.\\n\\n\r\nOverall there is little for me to complain about, because I found this show to be exceptional.  The length was a bummer because I didn’t want it to end!  While not everyone will find this show to be as great as I did,  I recommend it to all fans of romantic comedies and Shana lovers.\\n",
            "date": "2008-10-11T13:12:00+00:00",
            "helpful_count": 240,
            "mal_id": 8576,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=8576"
        },
        {
            "content": "Nogizaka Haruka no Himitsu (Haruka Nogizaka's Secret) is an Ecchi, Romantic, Comedy about a relationship formed from a secret shared between two high school students. This anime doesn’t offer anything remarkably different to your average Rom/Com; however it certainly has a refreshing feel to it.\r\nYuuto Ayase is a fairly normal guy and Haruka Nogizaka is the school idol but their separate lives soon intertwine when Yuuto discovers Haruka’s secret hobby (Anime). Hardcore anime fans may enjoy the concept because it’s easy to relate to the stigma that may comes along with being an ‘open anime fan’, even though it does go a bit overboard. Thoughwhat makes this anime worth watching is the sweet romance that develops. The story moves at a steady pace, dealing with one issue at a time however the problem with this is that the episodes feel very disjointed, as there’s no real flow between one episode and the next. Also once the major issue about Haruka is resolved, this ends up becoming yet another typical romance anime.\\n\\n\r\nLike in most romance anime, this one centres on the characters in the main relationship. Well unlike most protagonists in these kinds of Rom/Coms, Yuuto is quite the appealing guy and acts how a guy is supposed to be and is a welcome change from all the spineless loser-kuns. Then there’s the main attraction, Haruka who is seemingly perfect and has a cute timid personality, however she also comes with her own problems. The supporting characters do an alright job providing some comedy, but can be a real nuisance when it comes to the story.\\n\\n\r\nJust from looking at this series’ picture, anime fans can expect this anime to go for animation and music that we are used to. The art style is very typical for this type of anime, with very simple big-eyed character designs but the way it is animated is certainly better than some similar looking anime (Myself; Yourself, H20, etc.). On the other hand this series doesn’t perform too well in the sound department. The music is subpar and can easily go unnoticed during the non-dramatic scenes and the only thing that helps to bring it to a satisfactory level has to be the great voice actors (Mamiko Noto, banzai! ^^)\\n\\n\r\nOverall Nogizaka Haruka no Himitsu is one of the decent Rom/Com of its season, though I feel that there can be an unnecessary amount of fanservice (i.e. pantyshots). The comedy is okay, especially on the rare occasions that it includes some obvious anime references but it does get stale after a while. Nevertheless the endearing romance is the only real reason worth watching this anime. It’s a shame the romantic relationship lacks a sense of progression and is littered with trivial problems.\\n\\n\r\n^_^",
            "date": "2008-08-19T02:38:00+00:00",
            "helpful_count": 77,
            "mal_id": 7276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=7276"
        },
        {
            "content": "You know, for all the internet rage I've heard that this show is \"Too much Otaku wish fulfillment\", it failed to fulfill my wish of being entertained. ZONG! And now, ladies and germs, the actual review: \r\nActually, I wouldn't argue that the problem with this show is that it's a substance-less, extra generous heaping of Otaku wish fulfillment as some claim, because let's face it, KissxSis and Chocotto Sister REALLY have no critical quality to them, and instead only show me just what I want to see, and yet I'm still entertained by them. No, instead, I find that there are three major problems thatcause Himitsu to fall short of it's potential.\\n\\n\r\nThe first is that for an Otaku-centric comedy, Himitsu feels as though it were written by a non-Otaku. While many of the stereotypes and experiences that we have all become accustomed to through real life and other shows are present, they lack the personality that shows such as Genshiken capitalize on. For example, in Hayate no Gotoku, there's an extremely short scene (Not but a single panel in the Manga) in which Nagi exits the room in order to watch an anime DVD boxset she purchased on a whim. Every fan can relate to the scenario of buying (Or downloading) anime which we have never heard of, simply for the sake of owning it, or because the cover art looked cool. You can also take Genshiken, and the strained relations between the Otaku characters and the &quot;Normal&quot; characters. Undoubtably each viewer has had an experience of their own with someone who was less than accepting of their hobby. Through these shared experiences, the watcher relates the characters, and connects to them. However all of Haruka's adventures feel as though they went through a game of Bohemian Telephone before they were scripted into the show. Oh sure, all the major hallmarks of an Otaku life are there (Comiket, cosplaying, Akihabara, figurine obsession), but the personality and small details have been lost in the process. This lack of a personal touch makes the series seem like a second hand story, as though the author had heard about such experiences from a friend.\\n\\n\r\nThe next aspect holding the show back was that the secondary characters are better developed than the main characters. Yuuto, for example, is a total blank slate. While I understand that often lead male characters in such series are made bland so that the watcher can impose their own personalities on the the character, Yuuto has absolutely no personality at all. The only noticeable aspect of his personality is that he seems to mildly care about Haruka. Haruka herself, claims to be an Otaku, but shows a forced interest in everything Otaku related. Her character is just an amalgamation of various &quot;Moe&quot; characteristics, without any new flavoring. At the same time, the trio of Haruka's little sister Mika, and the family maids provided more entertainment and laughs than the rest of the characters combined. They were fresh and original, and quite entertaining to watch. However, this trio was given far less airtime than they deserved, and instead the focus of the series lied with the blander characters. Obviously it would have been absurd if these bit characters became the focus of the series, however I just wish that the same amount of love and dedication went into formulating the other characters.\\n\\n\r\nAt the same time that this show tries to be an Otaku-centric comedy, it also plays up romantic elements, which I have no problem with. My troubles however, lie with the fact that neither party seems to make any real effort at making the other like them. This may be due in part to the fact that for half of the show Haruka shows a mild, dispassionate interest in Yuuto, while the other half of the time she seems totally unaware that there are two genders.\\n\\n\r\nIn closing, while this series did provide me with a little fun, at best it was disposable entertainment, not to be remembered after it's 8 month relevancy. \\n\\n\r\nOne more thing: For an Otaku-centric comedy, I only picked up on like three references (The blatant Shana one from the Hazuki episode, the Doujin that they buy at Comiket was drawn by the person who illustrated the original Light Novels, and the person who voice Gento voiced Gendou from Evangelion, if that even is a reference.). WTF is up with that? I mean in Pani Poni Dash, there was a heaping of thirty references per episode.",
            "date": "2008-12-26T19:00:00+00:00",
            "helpful_count": 71,
            "mal_id": 10665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/117816.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Peterp",
                "username": "Peterp"
            },
            "url": "https://myanimelist.net/reviews.php?id=10665"
        },
        {
            "content": "Nogizaka Haruka no Himitsu, follows classmates Haruka and Yuuto. Haruka being the popular daughter of a an extremely wealthy and powerful family. Yuuto being......some guy.\r\nThe story picks up as Yuuto accidentally discovers that Haruka is a closet otaku, and, not believing it to be a flaw (though others do), he promises to keep it a secret from their schoolmates.\r\nActually, I didn't think otaku were quite so ostracised in Japan as is shown, but perhaps it's true of private schools. Anyway....\r\nWhat follows is your typical high-school romantic-comedy fare, but with some storylines having the otaku twist (eg. going to a convention) or the rich-girl twist. Thereare also some harem elements, but they don't overshadow the main relationship. The show does contain some ecchi-ness, but it's not constant enough to be much of a problem. The show generally moves along at a swift pace, and manages to get quite a bit done in each episode, but it doesn't feel rushed.\\n\\n\r\nThere are a fair few characters, though quite a few get swept aside before becoming anything more than a couple of lines of dialogue. The regulars are familiar sorts, including the loud drunks, and the teasing, adult-minded loli.\\n\\n\r\nSo yes, it has all the typical elements, but, I often got the feeling that something was different. I don't know for sure, but perhaps the show is focusing that bit more on the central relationship than is usual. Sure, there's a lot of noise, and silliness, but it just doesn't seem to be as overpowering as other shows, leaving more room for the main attraction.\\n\\n\r\nSo, the final verdict: Nogizaka Haruka no Himitsu, is a nice, typical, romantic comedy, that just nudges ahead of the pack, thanks to being just a little bit calmer, and more focused. Also, it differentiates itself somewhat via the otaku angle. If you're a fan of high-school romantic comedies, then this is definately worth a look.",
            "date": "2008-12-02T23:42:00+00:00",
            "helpful_count": 41,
            "mal_id": 10043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25782.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/alx222000",
                "username": "alx222000"
            },
            "url": "https://myanimelist.net/reviews.php?id=10043"
        },
        {
            "content": "Anime that focuses on and celebrates otaku culture is becoming increasingly rampant these days, but at the same time, it's important for anyone on the up-and-up with Japanese society to know that being an otaku is still one of the worst stigmas any one person can carry. Therefore, whoever though of making a series where a classy, rich girl loved by all is actually an otaku in secret was a genius.\r\nThis is where Nogizaka Haruka no Himitsu really flourishes in its delivery. The story, focusing on Haruka's love of anime, manga, and otaku culture is not merely another \"girl likes anime\" series, but rather atale of otaku empowerment. The series demonstrates the societal taboo by immersing \"normal\" people into Haruka's hobby, thus creating a window that gives the potential to both celebrate and/or villify the various extensions of the culture, which allows for many poignant moments in coming to understand why Haruka likes anime and manga, and why the taboo against anime fans is so unjust.\\n\\n\r\nOutside of the titular \"himitsu\", the series is a fairly average romance between the two leads. Misunderstandings happen, obstacles occur in predictable ways, but what keeps it moving is its incredibly likeable cast. You might think for a series where a guy and a girl are trying to get together there might be loads of rivals on both sides, but Haruka plays it surprisingly upbeat in that just about everyone in the main cast wants Haruka and Yuuto to be together and help them out with whatever trials come their way. This refreshing viewpoint really makes for a much more enjoyable cast where characters aren't driven by their love interests and can thus be utilized in multiple different ways that focus on who these characters really are.\\n\\n\r\nThe animation is gorgeous, coming from a very small but very underrated studio, Studio Barcelona (now Diomedia). The character designs are very cute, and the animation itself is smooth (especially in the ED sequence). Sound is kind of a moot point, because while all the characters sound great and have solid performances, the BGM is meh and the OP/ED songs are completely mediocre.\\n\\n\r\nOverall, Nogizaka Haruka no Himitsu was a welcome surprise in the latest flood of pro-otaku anime, taking a very hard look at the societal issues that being an anime fan consists of. It looks beautiful, sounds okay, and really sells itself not as just another otaku moe comedy, but as something with lasting value. Here's hoping the second season is more of the same.\\n\\n\r\nOverall, I give Nogizaka Haruka no Himitsu an 8 out of 10.\\n",
            "date": "2009-08-30T12:26:00+00:00",
            "helpful_count": 27,
            "mal_id": 18228,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8731.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Splitter",
                "username": "Splitter"
            },
            "url": "https://myanimelist.net/reviews.php?id=18228"
        },
        {
            "content": "Nogizaka Haruka no Himitsu \r\nNogizaka Haruka No Himitsu is an anime about two people from different classes.  On one hand you have Yuuto Ayase who is average and plain in every way, and on the other you have Haruka Nogizaka who is rich, famous pianist, and the most popular and sought after girl in the school.  These two cross paths in a set of unlikely coincidences at which time Yuuto discovers a deep dark secret which could crush the popular lifestyle of Haruka.  Haruka is an otaku.  To Haruka’s relief Yuuto, though average, is a very honest and caring person andhe promises to keep her secret, and support her with her hobby as anunwavering friend.\\n\\n\r\nIf the discription of Nogizaka Haruka No Himitsu sounds familiar it is becuase you are right “Ore No Imouto” has a VERY similar plot aside from the fact that Haruka and Yuuto are not blood related and the fact that “Ore no Imouto” was a far better series.  Though it is a generic plot at this point the series did have a sweet feel which makes you root for Yuuto and Haruka through all their ordeals.  The characters were well drawn, though the backgrounds felt stagnent and a little dreary for a slice of life romance anime.  Character progression was focused on emotional developments betwen the characters which left a linear feeling, until the end when these emotions were fully realized.  What was really lacking in this series was a love rival, which I originally thought would be played by Shiina Amamiya, however I was dreadfully disappointed. \\n\\n\r\nOverall the series was light hearted, sweet, and funny at times, but overall average for an anime.  Some competition, and perhaps earlier conflicts in the budding relationship would of added to the excitement around this series.  Due to this I give this anime a 5/10.  It was interesting, but average all around.\\n\\n\r\n@GameJok3r",
            "date": "2011-09-13T11:11:00+00:00",
            "helpful_count": 27,
            "mal_id": 43267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=43267"
        },
        {
            "content": "Story - 4\r\nThe initial premise for this series is interesting and is what drew me to watch this in the first place.  It starts out strong but by episode 6 or 7 the main reason for the story has been mostly wrapped up and the following episodes become an everyday romance story, except that even that is badly written.\r\nArt - 5\r\nThe art is generic and bland, with very little to distinguish characters in this anime from characters in others.  It doesn't have any particular flair to it and doesn't grab your attention, but on the other hand, it is also not bad tolook at.  It's just... average.\\n\\n\r\nSound - 4\\n\r\nThe OP and ED songs aren’t memorable or catchy at all, and have very little staying power.  They’re just... there, and that’s it.\\n\\n\r\nCharacter - 2\\n\r\nThe characters in this series are horrible.  In the first couple of episodes things seem as though they will be interesting, but as early as episode 4 things start getting hard to watch.  The main characters are extremely bland and their romance is more of the 'oh look, they're in love because the animators say so' rather than there being any real reason for them to be together other than the initial premise, and there is no chemistry between them.  This makes this series extremely hard to watch.  I found myself in the middle of episode 6, and having such a hard time watching the two mains that I closed the video and didn't watch it for a few days.  I found myself having to do the same thing for every episode after, because all of them had scenes that I found excruciatingly painful to watch.  There aren't really any redeeming characters in the series; they're all bland and hard to watch most of the time, making it extremely hard to sit through an episode, let alone this series.\\n\\n\r\nEnjoyment - 2\\n\r\nAs I stated in the above section, I had to spend days away from this anime to get the bad taste of certain scenes out of my mouth.  There were a few (make that very few) redeeming moments, but they were instantly washed away by the lack of good story, bland art and annoying characters, and there were nowhere near enough of them to make the series enjoyable.\\n\\n\r\nOverall - 3\\n\r\nIt's a bad anime, I didn't like it, and I honestly can't see why people would think it's good.  The romance is forced, as is the dialogue and situations, and it's got next to nothing in it that could redeem itself.  I don't know how I got through the entire anime, I hope I don't ever have to watch it again and I certainly won’t be watching the sequel.",
            "date": "2011-01-08T22:38:00+00:00",
            "helpful_count": 15,
            "mal_id": 33581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/chinlamp",
                "username": "chinlamp"
            },
            "url": "https://myanimelist.net/reviews.php?id=33581"
        },
        {
            "content": "I'm guessing everyone reads the short synopsis before reading the reviews, so this review will be very much free of any spoilers. \r\njust one thing before i start. the genre set for Nogizaka Haruka no Himitsu(NHnH) is Romance Comedy, but for me, it's more to Slice of Life, Parody, and pure Romance. Don't expect any serious harems from NHnH.\r\nStory (8/10)\r\nThe story for NHnH is very simplistic and very predictable. However, this is, rather than a disappointment, the best point in NHnH. From the beginning, we are told of the main character's (Nogizaka Haruka) secret. The series does not show any signs of surprising us orportraying an impressive plot twist. It just piles up cute, predictable scenarios which you will find in any Romance Comedy Harem anime you've seen. surprisingly, this is not a turn-off, because it's portrayed in a very cute and romantic way which will make you blush at every scene, even if you already know exactly what is going to happen next. The only thing different in NHnH's story is the anime-lover(otaku) point of view. if you love animes, but are always made fun of by friends, you would be able to relate to this anime a lot. \\n\\n\r\nArt (7/10)\\n\r\nThe art for NHnH is also very simple and not so impressive. It does show brilliance in the variation of character designs, however, since we usually see the main characters in casual clothes rather than only school uniforms. It's also beautiful enough to make you blush, so it's not really so bad even though it looks plain.\\n\\n\r\nSound (8/10)\\n\r\nThe OPED is not the most impressive I've seen, but it does its job in symbolizing the series. the bgms and effects are also quite plain.\\n\r\nWell, to be honest, the main reason I watched NHnH is because of Nogizaka Haruka's Voice Actor(seiyuu), Noto Mamiko. For Noto fans, this series is absolutely a must watch. The other seiyuus also perform very well and fit their characters perfectly. so there's no complains about the sound, and plus Noto Mamiko, it's worth it. \\n\\n\r\nCharacter (8/10)\\n\r\nThere are quite a few unique characters in NHnH, but don't expect much character development from them. The standard harem characters are all there, but it's safe to say that, other than the two main leads, the others are all side characters. Well, thanks to that, the series focuses on how the main leads develop and grow in their relationship, and this is very nice to watch. \\n\\n\r\nEnjoyment (9/10) and Overall (7/10)\\n\r\nAs i will say for any series, enjoyment really depends on mood and expectations. If you want to enjoy NHnH to the fullest, remember that this is more to a slice of life anime, so watch it with a light heart and don't expect too much from it. If you do, I'm sure you will be laughing at the jokes before they even happen, and blushing as much as the characters are. \\n\r\nOn the other hand, this anime is definitely not recommended for critics and those who prefer more dramatic romances. This is the only reason I lowered the overall rating to 7 for the review. It's not really a series which everyone will enjoy.",
            "date": "2009-02-21T00:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 12603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46781.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lonehunter88",
                "username": "lonehunter88"
            },
            "url": "https://myanimelist.net/reviews.php?id=12603"
        },
        {
            "content": "Story:  Not much to mention here, basically just your standard romance/comedy/harem kinda of plot, where one guy is surrounded by a bevy of perfect girls all vying for his attention.  I will mention though that while the basic plot is unremarkable, it doesn't become too cliche with too much fan service or ridiculous situations (there are some which stretch the imagination, but try watching say, Nagasarete Airantou, without wondering where reality went).  Anime's poking fun of otakus seems to be the \"new\" thing in anime recently, and Nogizaka Haruka no Himitsu does it as well, but the series quickly abandons the wholeakiba-kei stigma thing for a more lighthearted depiction of otakus.  \\n\\n\r\nArt: Characters and backgrounds are drawn with a lot of detail, but frankly are unremarkable.  This isn't because the art isn't any good, but rather because it seems like the quality of the artwork has improved drastically for most of the newer anime, so nothing really pops out (as opposed to say the backgrounds for Mahou no Tsukai ni Taisetsu no Koto ~Natsu no Sora~).  I haven't had a chance to compare the artwork from the anime and the manga; but overall, very decent\\n\\n\r\nSound:  I really have to give props to Haruka's seiyuu; it is kinda of refreshing to hear a different voice from the &quot;standard&quot; high-pitch female voice.  Haruka's pitch is considerably lower and mellower than most of the other girl's voices, and there this timbre that is a little gritty that I really like.  I think it also fits Haruka's personality perfectly.  Both the OP and ED are catchy, but I can't help but think that the ED is trying to emulate Suzumiya Haruhi no Yuutsu's ending with the dancing bit.\\n\\n\r\nCharacter:  For once, a guy who is not a total loser.  It seems like one of the foundations of this genre is that the dude must be a complete and abject loser, probably to contrast the perfectness of the girls (I really hope its not to relate to the fanbase o.O) Yuuto is just a regular guy who is pretty compassionate, so its not impossible to see why the &quot;perfect&quot; girl (Haruka) would fall for him.  The other characters are also very developed; Mika's character in particular adds a lot of humor and a little bit of ecchi-ness.  \\n\\n\r\nEnjoyment:  Heart-warming sums up this anime.  Unlike many anime's in this genre which are wholly forgettable, there is actual chemistry between the characters and while yes, there is a fair amount of the obligatory fan service, most of the story revolves the relationships between the characters.  I definitely will keep this anime and probably will watch it again.  \\n\\n\r\nOverall:  Basically, this is kinda of a &quot;fluff&quot; anime in the best sense of the term; if you really like a deep story, go watch Ghost in the Shell or Evangelion; if you like harem anime, then go watch love hina or Goshuushou-sama Ninomiya-kun; but if you want to watch an anime which is predictably heart-warming and just plain fun to watch then I would recommend this anime.",
            "date": "2008-09-03T14:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 7671,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68072.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/diaho",
                "username": "diaho"
            },
            "url": "https://myanimelist.net/reviews.php?id=7671"
        },
        {
            "content": "This is one of the best romance animes that I've seen. If not the best, in the top 2-to-3. And here's why:\r\nHere I am, in America, thinking that anime, manga, etc. was watched on a nationwide scale, and didn't hold any social repercussions for doing so. Well, I might be wrong. Although I don't know the social acceptance or tolerance of the aforementioned hobbies, this show's culture of Japan looks down upon the hobby itself, as well as the people who enjoy that hobby. Now, like above, in actual, real-life Japan, the mood could be quite different from what's given to us in the show,but this key change of normalcy in regards to the storyline had me reeling... in a good way.\\n\\n\r\nNow, if you've seen this and have read the above paragraph, and thought to yourself, \"Well, it's the typical 'normal boy-meets-girl'\", type of storyline. And to that I respond, yes; but how they get these isn't done through the overused plot we see so much in romantic animes. This one was different: they weren't childhood friends, (an encounter doesn't count! It had nothing to do with the progression of their relationship!) there wasn't an over-the-top ecchi moment in which they met, etc.\\n\\n\r\nIn reference to story arcs, the main one created in the first episode encompasses, is referenced to, and plays into, if not all, but a vast majority of the 12 episodes. The longest separate arc I saw was 2-episodes-long, which involved the final 2 episodes of the series. The lasting affect is pleasant and you walk away from each episode feeling like the story progressed in one form or another; and that's what a story should do: move the characters, plot, time line, etc. FORWARD with each passing episode - if you don't, that's when the viewer becomes bored. I, for one, was never bored. 10/10.\\n\\n\r\nI want to take the art director out for a dinner and just smother him/her with gifts of gratitude. It was that good. Every character is so exquisitely drawn, especially Haruka. But where my complements will ultimately hang their hat on will be the portrayal of Yuuto. \\n\\n\r\nToo many times have we seen the hero in animes be drawn as frail, insignificant, and completely shy. We see characters drawn like this because the creators of the anime want to attract more male viewers who think, \"Hey! He's just like me!\" Well, I feel, probably for the first time, that they captured (more-or-less), an average, high school fella. One who isn't arrogant in his womanizing abilities, looks like he could bench 400 lbs., but a guy who isn't either TOO frail or TOO weak. They somehow found one of the best balances between the two I've seen yet in a romance anime. 10/10. \\n\\n\r\nI really enjoyed the voice acting. If I had to give one of those big checks you see given out at golf tournaments to the voice actor of a character in this anime, I would somehow try to find a way to split it between Haruka's and Hazuki's voice actors, respectively. A job well done. 9/10.\\n\\n\r\nThe characters are, and always should be (I don't know why some haven't realized this, yet), an anime's (and all forms of media, for that matter) strongest point; the most enjoyable aspect. \\n\\n\r\nHere, I found a show which is so enveloped, and literally hinges on the success of the characters. Whether that be due to the fact that the show only lasts for 12 episodes may be a relevant factor, but who cares; it passes with flying colors. \\n\\n\r\nEach character falls into a relative category that you unconsciously create while watching the show: \"Oh, Hazuki, the soft-spoken funny one; Maki, the raunchy, over-the-top kid; etc.\" And it's so nice to have these characters that are so consistent with their roles that you don't get any unwelcome surprises or revelations. \\n\\n\r\nThe two mains' really shine here. Yuuto and Haruka seem to be a perfect couple and the show plays to that aspect: you know it, they know it, the characters know. There isn't a time they spend together that doesn't add a new layer to their relationship; it contains so much substance and viability that I'm extremely excited to start the next season as soon as possible. If you can create engrossing characters, that every moment spent together doesn't seem like a moment lost, means a huge success on behalf of the show's staff. 10/10.\\n\\n\r\nIf you couldn't tell already: I adored watching this show. A lot of romantic animes out there try to stray away from there own genre and have completely irrelevant episodes regarding some random, irrelevant secondary characters plopped together to work on helping each other how to cook. I don't care! I want as much time as possible focused on the reason I chose to watch this show in the first place: the love story! And they do such a good job of \"keeping the pedal to the metal\" and it's the best thing ever to finally get my prayers answered. Finally! 12/12 episodes (from what I can tell) that are majorly geared to the love story between the two main people that the love story is about. It just makes me want to send a memo to all the other future/past creators and say, \"Look - this is how it's done.\"\\n\\n\r\nThe only detriment to the series is the fact that there are no confessions of love. Sure, \"I'll be with you... forever\", is close, it doesn't hold the same resonance in the heart's of a viewer than saying, \"I love you.\" Although it may seem nit-picky, you find yourself waiting for the line to be uttered every time there together and it never happens is some sort of letdown. But! Thankfully this show has a second season! 9/10.\\n\\n\r\nThis show was spectacular. Period. I would love to defend my position over someone who, like me, enjoys romance animes more than any other genre, because, let's face it: maybe an sci-fi/action fan coming off of something like Cowboy Bebop to watch this show probably won't agree with me. Anyway, my overall grade is based on all of the previous main categories, but I'd like to leave you with one last complement of the series:\\n\\n\r\nThe show borrows from a lot of sub-genres out there (e.g. ecchi, harem, comedy, slice-of-life, etc.), and is so well balanced in each that the show is molded together virtually flawlessly. There are a few ecchi moments, but not too much to make uncomfortable a casual watcher, a harem aspect can be chose to be seen as present and relevant or not present and irrelevant, and there are a few comedy gems in there that got me to laugh and smile as I watched the next scene.\\n\\n\r\nYou can do no wrong here in picking up this series if you're a romance fan. I wouldn't be surprised if it acted like a transitory series for first-time romance watchers to get into the genre, either. It's so close to perfection. Literally three words away. I leave you with the words of an early Puritan coming to the shores of America; as this show has become something of a benchmark that all romance animes should strive for. 9.99/10.\\n\\n\r\nIn the words of John Winthrop: \"I envision this country, a city upon a hill.\"\\n\\n\r\nFeedback is appreciated!",
            "date": "2009-12-08T00:52:00+00:00",
            "helpful_count": 11,
            "mal_id": 21202,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=21202"
        },
        {
            "content": "I don't even know how anyone managed to write a story with such a fun-sounding plot and theme(similar to Oreimo, one of my favorite series), but make it so boring. This is one of the most painful series I've watched. Each episode is a battle, a long and strenuous walk through an enormous desert. It's about as fun as writing a twelve-page essay on the history of toilet paper. I, personally, am a huge fan of anime, figure collecting, et cetera, and though the characters' trips to Akihabara and Haruka's interests seemed like a promisingly exciting adventure at first, it wasn't. I'm currently, after afew months, on episode 11/12, and I am not looking forward to the next one. I have been procrastinating each episode of this anime. I kept watching this, hoping for it to get better, but it didn't, and here I am.\\n\r\nStory is 2/10. It's extremely predictable, from the very beginning of each episode. You can tell what is going to lead to a conflict, what the conflict will be, and pretty much everything following the conflict. I spent the entire time waiting for characters to do what they would obviously do, but took painstakingly long to. All of the relationships are predictable. You just know everything that will happen. \\n\r\nThe art, however, is quite good. 8/10, the characters are cute and the girls have very moe features. The costume design could be a bit more tasteful. Everything is very shiny and somewhat aesthetically pleasing, and the animation runs smoothly. I really love the character design for Haruka's little sister.\\n\r\nThe sound is 5/10. The opening song is a little boring, and sounds like it could have been from twenty years ago, but the ending theme is fun and the rest of the soundtrack is okay. Just okay.\\n\r\nCharacters, I rated 3/10, because they are all have very shallow, typical, predictable personalities. They are all very easy to read, to the point that it is pretty annoying. There is hardly any character development, I have only observed developments in their relationships with one another.\\n\r\nI rated the enjoyment factor a 3/10, because I did not enjoy it, save for a few short bursts of humor, cuteness, and fan service. Like I said, I have been procrastinating each episode, so that I have been watching this 12 ep series for several months. This is my first review, because I don't know how this got good ratings. It is so very, very bad. Overall a 3/10, would not watch again.",
            "date": "2012-09-08T16:59:00+00:00",
            "helpful_count": 11,
            "mal_id": 71875,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482412.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/pettaneko",
                "username": "pettaneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=71875"
        },
        {
            "content": "\"Nogizaka Haruka No Himitsu&rdquo; is a romantic comedy based on a series of light novels with the same title.\r\nThe series focuses on the relationship of its two main characters, high school students Haruka and Yuuto, how they meet, form a bond of friendship and perhaps more, all in a mix of comedy, romance and some fanservice type ecchi situations.\r\nAs the title suggest, the main plot centres around Haruka's secret, she's an otaku. While this would not be so shocking by itself, Haruka is the eldest daughter of an extremely wealthy and renowned family, she possesses great beauty, has excellent academic skills and is a talentedpiano player, which makes her a star and the object of admiration at the prestigious private school she attends. If such a person were to be exposed as an otaku, they would be ridiculed and ostracised, something that already befell Haruka at her previous school. Hence she carefully hides her hobby from the outside world.\\n\\n\r\nThis is soon undone when Yuuto bumps into Haruka at the library and discovers she's secretly borrowing anime magazines. Fearing her secret is exposed, Haruka is distraught but eventually  relieved when Yuuto tells her that he does not mind her being an otaku and will keep her secret safe.\\n\r\nWith Yuuto now sharing Haruka's secret, hence forms the main plot device to allow them to interact daily and become friends. Along the rest of the series both Haruka and Yuuto are faced with challenges that threaten their happiness, from Haruka's strict father, to a potential love interest for Yuuto, to the difference in status that comes with Haruka's wealth. Seeing this is a comedy, most of is done with plenty of funny scenes and off course it all ends well.\\n\\n\\n\r\nOne of the series' strong points is also its weakness, namely its characters. While most of the supporting characters are rather two dimensional and not much fleshed out, both Haruka and Yuuto are a paradoxical combination of some interesting traits as well as more generic character traits.\\n\\n\r\nHaruka being of wealthy descent, blessed with great beauty and academic skills and having several moe character traits such as shyness and clumsiness that are solely aimed to cater to the audience is nothing new in terms of character design. That such an unrealistically perfect persona has a passion for which one is ostracised in Japan, yet stands up for her beliefs and isn't free of normal human emotions such as doubt and jealousy makes her a more three dimensional character. A welcome surprise. \\n\r\nNo chance is missed to display Haruka's moe character traits and truth must be said, she is quite moe.\\n\\n\r\nYuuto too is such a mixed case, he has many traits of the classical romantic comedy or harem male protagonist, such as being shy around women yet desiring them, he is indecisive and well, he's rather plain. Nonetheless, Yuuto is also shown to be a very level-headed and open minded person, who accepts people's different interests and who will not ostracise anyone, even if he does not understand the things they are passionate about. Having such an adult, open minded character that does not succumb to blindly following the group mentality is interesting, especially if you see the majority of his peers will ostracise and judge someone like Nobunaga -Yuuto's otaku friend- or Haruka without any second thoughts.\\n\r\nWhile being rebellious is surely not an unknown phase to any young person, being open minded, willing to form one's own opinion that may not align with the public one in a positive fashion is more rare I gather.\\n\\n\r\nI also found Shiina to be a quite refreshing character. Transferring into Haruka and Yuuto's class, she develops a liking to Yuuto, but once she discovers that Yuuto and Haruka care deeply for each other, she takes a very adult stance and doesn't really fall prey to the usual anime clich&eacute;s. \\n\\n\\n\r\nThroughout the series some dramatic moments or events are generated but rarely does one have the impression anything really bad will occur, due to the colourful and comedic atmosphere the series carries. Everything is usually very upbeat and positive.\\n\\n\r\nEven though the theme of otaku being ostracised and publicly shunned is often mentioned, it's used more as a plot device and never really deeply delved into. Haruka and Nobunaga are shown to be normal people who just happen to be passionate about anime, manga, figurines,... but that does not make them any less human or valuable people than you and me. It's nicely brought on screen but lacks the depth, subtlety or realistic tone a series like &ldquo;Genshiken&rdquo; carries with it.\\n\\n\\n\r\nAnimation in &ldquo;Nogizaka Haruka No Himitsu&rdquo; is good, with most of the focus being on the girls like Haruka, with fanservice scenes and shots getting the best treatment. I did notice that some full body shot scenes where characters are in their regular appearance do look more simple and less elaborate, but this is never bothersome.\\n\\n\r\nThe soundtrack is quite nice, it supports most scenes well and the opening and ending theme songs are upbeat tracks, though the opening animation sequence leaves little to no doubts about the series' general direction.\\n\\n\\n\r\nSo for those looking for a cute romantic comedy that has a positive overtone and a moe female lead character, then you may certainly enjoy &ldquo;Nogizaka Haruka No Himitsu&rdquo;.",
            "date": "2008-10-04T06:32:00+00:00",
            "helpful_count": 10,
            "mal_id": 8405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=8405"
        },
        {
            "content": "This is definitely more than a little ecchi, and there's a large amount of gratuitous in-joking.  However, I like this show.\r\nBeyond the slick production values, this is a believable story.  There's a girl who has a lot of trouble opening up her emotions, and she meets a decent guy who happens to get past her defenses.\r\nI don't think I'll end up liking this as much as \"Zero no Tsukaima,\" but the basic ambiance seems to have a lot of similarities.",
            "date": "2008-08-07T04:46:00+00:00",
            "helpful_count": 7,
            "mal_id": 6904,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83256.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/formosan",
                "username": "formosan"
            },
            "url": "https://myanimelist.net/reviews.php?id=6904"
        },
        {
            "content": "Nogizaka Haruka no Himitsu is an anime that focuses on the peculiar world of interpersonal relationships and the misunderstandings of every day life. It is an oddball in that it has the capacity to be a masterpiece but due to the forced and often exaggerated drama it falls short of its true potential.\r\nThe central couple of the show, Yuuto and Haruka, go to the same school but seem to be on two different ends of the social spectrum. Yuuto is a plain and completely uninteresting guy with the resolve of a pigeon dropping. He's indifferent in life and often pushed around by his peers likea leaf in the wind. This personality supplemented by his plain looks make him unpopular with the ladies or just about anyone, to say the least. On the other hand we have Haruka, the beautiful highly accomplished student and a prodigy in various subjects and disciplines. And of course unlike Yuuto, she's from a rich and noble background. So you can pretty much see the massive disparity here. \\n\\n\r\nSo how is it that they get acquainted? They end up sharing a secret when Yuuto finds out that Haruka - the model student, is in fact a bit of an anime otaku. Forced to keep his mouth shut and make sure her secret is not revealed, the two get closer and various shenanigans begin to take place. \\n\\n\r\nNow this is not an inherently bad story, I'm all for the idea of a powerful girl falling for the average member of society but I personally felt that the romance component in this anime was lackluster. Despite the fact that we see some progression in the relationship of the two main characters, as they do go on numerous dates, the atmosphere surrounding them is way too infantile. They nearly faint at the idea of even holding hands and that's months after their initial meeting. So the makers tried to supplement this obvious cock up later on in the series by making them \"accidentally\" trip on each other every 5 minutes and it's so blatantly obvious they're trying to force this down your throat that you feel like throwing up. Same goes for the \"drama\". Haruka getting wobbly feet and nearly losing consciousness because a few books got sold out or Yuuto blowing his stack because he felt \"useless\" after carrying his pseudo-girlfriend all the way back home is so teeth-grittingly fake you want to beat yourself with a wrench to make the memory go away. They also try to make it look serious and authentic which only worsens the situation. \\n\\n\r\nOn the other hand there are moments of sheer brilliance in this anime such as the accurate portrayal of what goes on in a teenage boy's head when he's around girls. Yuuto often ends up thinking about perverted things at the most inappropriate moments and that's something I could actually relate to because it used to happen to me too when I was a teenager. Whether it'd be looking down a woman's cleavage or getting funny ideas while alone with a girl - that's all part of growing up and it was funny to step aside and see my own adolescent years from 3rd view. I'm sure some people will share the same sentiment.\\n\\n\r\nAnother great thing here is the supporting cast and the good execution of humour. Haruka's family is made up of the most hilarious bunch of eccentric individuals. Neurotic maid with a passion for chainsaws, perverted sister, overprotective father who happens to be carrying a katana everywhere... the list goes on. Now that in itself wouldn't be anything unusual because we see that in anime pretty often - but it's the way these characters interact that really makes you grin all the time. Though in the end they are motivated by the same thing - poking their eyes through the key hole to see if Haruka and Yuuto are not doing anything questionable.  \\n\\n\r\nAnd then we have Yuuto and Haruka's classmates. These characters I felt were nothing more than cardboard cut-outs and there's not much to talk about them. A couple of perverted guys, an otaku and of course every romance anime needs one - another female character with an interest in the male lead. However they all contributed in some way or another to the story and did their jobs as background characters pretty well. \\n\\n\r\nNow with most stuff out of the way we come to the art and sound departments. Personally I felt that the art was very good and precise with emphasis on the eye candy effect, especially when it came to female characters (being kinda obvious here). Sound was absolutely amazing, in part because the OST features piano/classical music and partly because I'm a sucker for classical-themed pieces. However there are also regular pop pieces too (opening; ending) so I suppose a wide range of viewers will be satisfied. \\n\\n\r\nAs for the enjoyment, strangely, I got a lot of it out of this anime. Despite the infantile romance, the forced and at times absolutely fake drama - I still think there is a lot to enjoy here. Whether it'd be the nostalgia inducing fantasies and day-dreaming of the male lead in the presence of other girls, the all too familiar shyness associated with interpersonal relationships or the refreshing humor provided by the supporting characters; there are plenty of points of interest here for the casual anime watcher. If one watches this not as a thought-provoking masterpiece but rather as something that's meant to provide entertainment, which is how it's meant to be, then enjoyment will be there.\\n\\n\r\nNogizaka Haruka no Himitsu gets 8 points from me.\\n\\n\\n\\n",
            "date": "2013-01-22T16:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 84553,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=84553"
        },
        {
            "content": "I thought this was a very well done anime, but everytime haruka and yuuto were about kiss each other, someone would just barge in and just interrupt their kiss alone and i just hated that and I like said again a pretty well done anime with a very pretty voice from the actress playing Haruka. I want this anime to go on for a 2nd season or even a 3rd season. So i'm giving Nogizaka Haruka no Himitsu a 11/10!!!!",
            "date": "2008-10-13T15:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 8680,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58709.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/animestarts99",
                "username": "animestarts99"
            },
            "url": "https://myanimelist.net/reviews.php?id=8680"
        },
        {
            "content": "Romance/Comedy Anime that's very funny and enjoyable. When i watch this for  the first time, i know that this anime will entertain me. Yeah, that' s absolutely right. Well, lets reviews it step by step.\r\nStory (7/10)\r\nNot so new in anime world where the MC (Yuuto Ayase) is a roundabout person and he meets the princess of his highschool that fits the perfectness (Nogizaka Haruka). But, eventually he accidentally know her secret as an otaku. The story itself is rather slow at first but faster when it comes to an end. But i think the supporting characters in this anime are rather too ordinary. Theirappearance are made like NPC in some game that needed to progress the story. Like for example, Amamiya Shiina. Her role as the main female character love rival is quite weak. But from episode 1 to the end, i was able to enjoy it and there are some episodes that will show you a cosplay of other anime. Shana fans must see this series :)\\n\\n\r\nArt (8/10)\\n\\n\r\nThe Art is smooth and the BG is nice. I like the art of nogizaka haruka, she's so cute and seiyuu mamiko noto fits really well for her\\n\\n\r\nSound (7/10)\\n\\n\r\nWell, not so much to be reviewed here but the sound itself is okay. But, it just can't bring the atmosphere of the scenes to the viewers.\\n\\n\r\nCharacter (8/10)\\n\\n\r\nThis is a reason why you will like this series. You will like the characters of Nogizaka Haruka no Himitsu. You will like haruka, shy but actually a honest and kind person. You will like Yuuto Ayase, honest and caring person especially to haruka. And Yuuto not a harem type MC that like to do ecchi things even to defenseless haruka (yeah, she beat the annoying guy to yuuto so bad). The downside is, i just see a little char development among the characters of this show.\\n\\n\r\nEnjoyment (9/10)\\n\\n\r\nWell, its also a reason why you will like this series. The enjoyment of this series is gonna to haunt you per episode. Although i was annoyed because the the progress of Yuuto and haruka's relationship were bothered by some trivial things. But to me, this show was entertaining.\\n\\n\r\nOverall (8)\\n\\n\r\nThe story itself is not so original, with good characters, beautiful art, comedy, fine sound and a sweet love relationship. Overall Nogizaka Haruka no Himitsu is a decent anime. For those who hate a lot of fanservice anime, they can relax and enjoy this anime. Because this anime has a little fanservice (not zero). Hope you find your enjoyable time watching this anime as i found a lot of enjoyable time watching this. And again, for Shana lovers, i recommend it for you to watch this anime :)",
            "date": "2012-05-29T05:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 62167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1189023.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blu3cru5ad3r",
                "username": "blu3cru5ad3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=62167"
        },
        {
            "content": "This is so bad. The only good scene was the Shana reference. This whole anime is just retarded beyond hope. It's so retarded that it's not even funny, I'm crying tears of blood from how bad this is. For anyone like me, browsing for anime to watch, I have some advice: DO NOT WATCH THIS! Try something else, seriously.\r\nStudents are learning to swim in the school pool and then suddenly there are maids with a watermelon and the main girls sister with a beach ball there to have fun. Also, the protagonist's sister is having a BBQ next to the pool. Etc etc etc. Whatis this I don't even",
            "date": "2012-02-14T16:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 53883,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39476.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Aphyxia",
                "username": "Aphyxia"
            },
            "url": "https://myanimelist.net/reviews.php?id=53883"
        },
        {
            "content": "DDAAAMMNN! This anime turned out to be much better than i expected it to be. I had this anime on my ' to watch list' for a while now, and i kept adding new anime just so that i can avoid watching the ones that seemed boring and average. I thought that i was going to get an anime that was tediously average but instead i got a hard boiled romance between Yuto and Haruka. Yeah sure we might have seen the average story but don't judge every thing by the cover. You might actually find that this anime can be quite enjoyable. The twothings that set this anime apart from the average anime was the the enjoyment(10) and the flowing relationship between the to main characters. Some romance anime skip the growth of relationships and try to force it in at the end. This anime made their relationship grow in every episode and you actually enjoy watching them go through all these embarrassing moments and conflicts.   \\n\r\nThe art was done okay for the time it was made and the story was actually fine. What annoyed me in this anime though was how poorly the side characters where developed and even the main characters at times. Even for an average story, they should have at least developed the side characters a bit more. some characters are only in for about 5 or 6 episodes and that was really annoying to me. I knew almost nothing about yuto's sister and his sensei other than they like to drink a lot. I would have loved to know more about yuto's sister, especially because how unique i find an alchoholic character to be. The next thing that kind of pulled my nerve was the character of Amamiya. We see a great development at the beginning but after she was introduced, it felt like she just started to fade away. She had a role to play after but i never understood her. i thought she was a character that needed a lot more development. \\n\r\nMy last problem in this anime is something that not everyone get. When you watch a certain amount of anime it becomes easy to predict things in average stories. After i watched the first episode i already new what would happen at the end and i new almost all the conflicts that they would have to face. The most predictable was Haruka's father. I would literally just watch an episode and call out scenes like every minute. Having said this, i would suggest this anime to veterinarians and not to people who have watch dozens of anime unless you're super into growing romance like me. Although i had many concerns this anime, i still very much enjoyed it and to me that is the key factor to an anime and that is why i gave this anime an overall rating of 8/10",
            "date": "2015-06-21T22:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 190891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4312659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Colorist",
                "username": "Colorist"
            },
            "url": "https://myanimelist.net/reviews.php?id=190891"
        },
        {
            "content": "Nogizaka Haruka no Himitsu\r\n\"This review is very short and lacks spoilers but its gives you a quick view on what i though of the series\"\r\nGood Points\r\n*Amazing Artwork and scenary\r\n*Great character style and voice acting really suits each other.\r\nBad Points\r\n*Weak Story\r\nStory\r\n*Really unique storyplot which is SHE is a OTAKU :), but apart from that nice touch the story is plain and somewhat a bit boring and predictable (Them becoming a couple) \r\n*Luckily the sub characters (Haruka's Lil Sister etc..) are fantastic and the dad reminds me of the dad in (Seto No Hanayome) \r\nMy View\r\n*I would say with this unique storyplot and great style and charactersit had the potential to be fantastic but the rest of the plot was lacking and made this into a disapointment, dont get me wrong i really like it but i can only give it a 7/10 not the 8.5/10 or 9/10 i thought i was going to.",
            "date": "2008-12-23T06:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 10584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gorskino10",
                "username": "gorskino10"
            },
            "url": "https://myanimelist.net/reviews.php?id=10584"
        },
        {
            "content": "story\r\ni would say that aside from having much of fanservice, i really liked the romance and development of Nogizaka Haruka's story. it may be a typical slice of life but it touches sensitive topics related to otakus especially that of discrimination and i gues that's the reason why i got myself hooked since the start of the series.\r\nalthough there are some cliched events troughout with the aspect of first-love and destiny and romance, i still liked how they developed every episode neatly. some episodes entertain the viewers with factual akiba-ke information while other deal with how people are to deal with their inner demons andface conflicts with society.\\n\\n\r\nas a general premise, yuuto would be haruka's knight in charge of protecting her secret from the rest of society so as she wouldn't be humiliated as what she experienced before when she was in middle grade. even though the story's plot revolved around that, it's fun that they still focused on fanservice rather than being serious all of a sudden. at the very least, they maintained consistency in their episodes.\\n\\n\r\nart\\n\\n\r\nthe story's not that to brag about but it's still worth mentioning that it mixes very well with the harem and fanservice theme. lotsa sexy characters from time to time and frilly clothes that would definitely pick on cosplayers everywhere\\n\\n\r\nsound\\n\\n\r\nthe opening and ending wasn't that catchy. it was entertaining but it was just at that. the slice of life an ero ero scenes are properly paired with BGM so i have no qualms regarding those things.\\n\\n\r\nit is to note however that some character singles are amusing. they dont give me the last song syndrome but still have an enchanting effect especially haruka's single, sung by mamiko noto. i also liked kana ueda and kaori shimitzu's duet.\\n\\n\r\ncharacter\\n\\n\r\nthis is definitely a typical romance where boy meets girl few years back then boy meets girl few years later and boy must protect girl at all costs. despite being a fanservice anime, everyone has still attitudes that's worth mentioning such as the imperfection of the perfect haruka in terms of clumsiness, yuuto's laid back attitude but determination, mika's abuse of her innocent look which definitely leads to various echi echi moments and other forms of chaos. yuuto's drunk sister and teacher which definitely services a complete set of incest harem.\\n\\n\\n\r\nenjoyment\\n\\n\r\ni really enjoyed the otaku fanservice though (episodes relating to otaku life) and has grasped the idea of otaku discrimination and oppression quite easily thanks to their episode conflicts. some episodes are simply senseless however yet still manages to progress in terms of plot development\\n\\n\r\noverall\\n\\n\r\neven though nogizaka haruka didnt give me a thrill in terms of action, i suppose slice of life fanatics wouldn't be disappointed watching this one. the same goes for those who love romance flicks and some ecchi here and there. however, if you really like to look into otaku popculture effects in the society, then nogizaka haruka wouldn't fail to boot",
            "date": "2008-09-29T05:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 8261,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29094.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/edgewalker00",
                "username": "edgewalker00"
            },
            "url": "https://myanimelist.net/reviews.php?id=8261"
        }
    ],
    [
        {
            "content": "Nogizaka Haruka no Himitsu is the most fun and just plain entertaining series I have watched this year.  I don’t like to throw out 10s to shows that often and maybe I am rating this show a little high in comparison others.  But this is one of the few shows that had me from episode 1 and never let me down through the end. While the overall concept of this anime is not anything new and groundbreaking (though really what is anymore?), Nogizaka does everything exceptionally well.\r\nAt its heart, Nogizaka is a romantic comedy with some mild echiiness and a few harem elements.The story starts out with our protagonist Yuuto accidentally discovering the schools most idolized girl Haruka Nogizaka is a closet otaku when he bumps into her in the library with a manga called Innocent Smile.  After a bit of an overreaction on Haruka's part, Yuuta promises to keep her secret from everyone else.  Personally I thought this was an excellent concept for a story but in one of the few things that this series fails at a bit because it doesn’t quite deliver.  By episode 3 she’s already exposed her secret at school herself, but there doesn’t seem to be any consequences or reaction to this revelation.  The romance elements then take over as the story becomes more about Yuuto and Haruka developing their feelings for each other than her secret obsession.\\n\\n\r\nThe series also features a number of anime and manga references, mostly to Shakugan no Shana.  If you have seen that series and especially if you’re a fan like I am you will get some extra enjoyment out of Haruka cosplaying Shana.  One of my favorite moments was Haruka saying Shana's trademark \"Shut up! Shut up! Shut up!\" and replying that she had always wanted to say it (Haruka's voice actress played Hecate in the series).  Plenty of other references provided a lot of laughs such as a yaoi doujinshi featuring Inukami! characters Keita and Karina.  I also found the cameo by manga loving Japanese prime minister Taro Aso humorous.\\n\\n\r\nAs leads, Haruka and Yuuto are very enjoyable and fun to watch.  Yuuto reminds me of other anime males I like such as Tomoya and Yuichi from Clannad and Kanon.  He feels like a real guy to me, he isn’t perfect but he stands up for his friends and acts like a man.  One of the few anime males I would actually want to date myself.  Haruka is a bit more stereotypical of anime girls, she is very beautiful and seemingly unattainable on the surface.  She’s shy, clumsy, clueless, and very moe.  Despite this, I don’t think anyone will not find something to relate with her and she is just so funny and cute that you can’t help but love her.  Several of the supporting characters manage to be entertaining as well, in particular Haruka's younger sister Mika.  Though she is the most stereotypical of the group as the perverted wise above her years younger sister.  The Nogizaka house maids also provide a number of laughs as do the mother and father.  Yuuto's sister and her teacher friend are pretty boring though as they are the fairly boring half naked drunkards.  Shiina is a classmate who could be considered a rival for Yuuto but she never develops as a serious contender (rightly so I must say).  The characters are also kept to a minimum as well so we get to know most of the supporting characters pretty well.\\n\\n\r\nThe show really shines in the art and music.  The characters are beautifully rendered and the series as wonderfully vibrant colors and detailed backgrounds.  The voice acting is stellar and features a great overall cast.  I can’t say enough good things about the music.  It captured the charm and the tone of the series perfectly.  The OP/EN songs as a pair are probably my favorite anime songs to date.\\n\\n\r\nOverall there is little for me to complain about, because I found this show to be exceptional.  The length was a bummer because I didn’t want it to end!  While not everyone will find this show to be as great as I did,  I recommend it to all fans of romantic comedies and Shana lovers.\\n",
            "date": "2008-10-11T13:12:00+00:00",
            "helpful_count": 240,
            "mal_id": 8576,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=8576"
        },
        {
            "content": "Nogizaka Haruka no Himitsu (Haruka Nogizaka's Secret) is an Ecchi, Romantic, Comedy about a relationship formed from a secret shared between two high school students. This anime doesn’t offer anything remarkably different to your average Rom/Com; however it certainly has a refreshing feel to it.\r\nYuuto Ayase is a fairly normal guy and Haruka Nogizaka is the school idol but their separate lives soon intertwine when Yuuto discovers Haruka’s secret hobby (Anime). Hardcore anime fans may enjoy the concept because it’s easy to relate to the stigma that may comes along with being an ‘open anime fan’, even though it does go a bit overboard. Thoughwhat makes this anime worth watching is the sweet romance that develops. The story moves at a steady pace, dealing with one issue at a time however the problem with this is that the episodes feel very disjointed, as there’s no real flow between one episode and the next. Also once the major issue about Haruka is resolved, this ends up becoming yet another typical romance anime.\\n\\n\r\nLike in most romance anime, this one centres on the characters in the main relationship. Well unlike most protagonists in these kinds of Rom/Coms, Yuuto is quite the appealing guy and acts how a guy is supposed to be and is a welcome change from all the spineless loser-kuns. Then there’s the main attraction, Haruka who is seemingly perfect and has a cute timid personality, however she also comes with her own problems. The supporting characters do an alright job providing some comedy, but can be a real nuisance when it comes to the story.\\n\\n\r\nJust from looking at this series’ picture, anime fans can expect this anime to go for animation and music that we are used to. The art style is very typical for this type of anime, with very simple big-eyed character designs but the way it is animated is certainly better than some similar looking anime (Myself; Yourself, H20, etc.). On the other hand this series doesn’t perform too well in the sound department. The music is subpar and can easily go unnoticed during the non-dramatic scenes and the only thing that helps to bring it to a satisfactory level has to be the great voice actors (Mamiko Noto, banzai! ^^)\\n\\n\r\nOverall Nogizaka Haruka no Himitsu is one of the decent Rom/Com of its season, though I feel that there can be an unnecessary amount of fanservice (i.e. pantyshots). The comedy is okay, especially on the rare occasions that it includes some obvious anime references but it does get stale after a while. Nevertheless the endearing romance is the only real reason worth watching this anime. It’s a shame the romantic relationship lacks a sense of progression and is littered with trivial problems.\\n\\n\r\n^_^",
            "date": "2008-08-19T02:38:00+00:00",
            "helpful_count": 77,
            "mal_id": 7276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=7276"
        },
        {
            "content": "You know, for all the internet rage I've heard that this show is \"Too much Otaku wish fulfillment\", it failed to fulfill my wish of being entertained. ZONG! And now, ladies and germs, the actual review: \r\nActually, I wouldn't argue that the problem with this show is that it's a substance-less, extra generous heaping of Otaku wish fulfillment as some claim, because let's face it, KissxSis and Chocotto Sister REALLY have no critical quality to them, and instead only show me just what I want to see, and yet I'm still entertained by them. No, instead, I find that there are three major problems thatcause Himitsu to fall short of it's potential.\\n\\n\r\nThe first is that for an Otaku-centric comedy, Himitsu feels as though it were written by a non-Otaku. While many of the stereotypes and experiences that we have all become accustomed to through real life and other shows are present, they lack the personality that shows such as Genshiken capitalize on. For example, in Hayate no Gotoku, there's an extremely short scene (Not but a single panel in the Manga) in which Nagi exits the room in order to watch an anime DVD boxset she purchased on a whim. Every fan can relate to the scenario of buying (Or downloading) anime which we have never heard of, simply for the sake of owning it, or because the cover art looked cool. You can also take Genshiken, and the strained relations between the Otaku characters and the &quot;Normal&quot; characters. Undoubtably each viewer has had an experience of their own with someone who was less than accepting of their hobby. Through these shared experiences, the watcher relates the characters, and connects to them. However all of Haruka's adventures feel as though they went through a game of Bohemian Telephone before they were scripted into the show. Oh sure, all the major hallmarks of an Otaku life are there (Comiket, cosplaying, Akihabara, figurine obsession), but the personality and small details have been lost in the process. This lack of a personal touch makes the series seem like a second hand story, as though the author had heard about such experiences from a friend.\\n\\n\r\nThe next aspect holding the show back was that the secondary characters are better developed than the main characters. Yuuto, for example, is a total blank slate. While I understand that often lead male characters in such series are made bland so that the watcher can impose their own personalities on the the character, Yuuto has absolutely no personality at all. The only noticeable aspect of his personality is that he seems to mildly care about Haruka. Haruka herself, claims to be an Otaku, but shows a forced interest in everything Otaku related. Her character is just an amalgamation of various &quot;Moe&quot; characteristics, without any new flavoring. At the same time, the trio of Haruka's little sister Mika, and the family maids provided more entertainment and laughs than the rest of the characters combined. They were fresh and original, and quite entertaining to watch. However, this trio was given far less airtime than they deserved, and instead the focus of the series lied with the blander characters. Obviously it would have been absurd if these bit characters became the focus of the series, however I just wish that the same amount of love and dedication went into formulating the other characters.\\n\\n\r\nAt the same time that this show tries to be an Otaku-centric comedy, it also plays up romantic elements, which I have no problem with. My troubles however, lie with the fact that neither party seems to make any real effort at making the other like them. This may be due in part to the fact that for half of the show Haruka shows a mild, dispassionate interest in Yuuto, while the other half of the time she seems totally unaware that there are two genders.\\n\\n\r\nIn closing, while this series did provide me with a little fun, at best it was disposable entertainment, not to be remembered after it's 8 month relevancy. \\n\\n\r\nOne more thing: For an Otaku-centric comedy, I only picked up on like three references (The blatant Shana one from the Hazuki episode, the Doujin that they buy at Comiket was drawn by the person who illustrated the original Light Novels, and the person who voice Gento voiced Gendou from Evangelion, if that even is a reference.). WTF is up with that? I mean in Pani Poni Dash, there was a heaping of thirty references per episode.",
            "date": "2008-12-26T19:00:00+00:00",
            "helpful_count": 71,
            "mal_id": 10665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/117816.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Peterp",
                "username": "Peterp"
            },
            "url": "https://myanimelist.net/reviews.php?id=10665"
        },
        {
            "content": "Nogizaka Haruka no Himitsu, follows classmates Haruka and Yuuto. Haruka being the popular daughter of a an extremely wealthy and powerful family. Yuuto being......some guy.\r\nThe story picks up as Yuuto accidentally discovers that Haruka is a closet otaku, and, not believing it to be a flaw (though others do), he promises to keep it a secret from their schoolmates.\r\nActually, I didn't think otaku were quite so ostracised in Japan as is shown, but perhaps it's true of private schools. Anyway....\r\nWhat follows is your typical high-school romantic-comedy fare, but with some storylines having the otaku twist (eg. going to a convention) or the rich-girl twist. Thereare also some harem elements, but they don't overshadow the main relationship. The show does contain some ecchi-ness, but it's not constant enough to be much of a problem. The show generally moves along at a swift pace, and manages to get quite a bit done in each episode, but it doesn't feel rushed.\\n\\n\r\nThere are a fair few characters, though quite a few get swept aside before becoming anything more than a couple of lines of dialogue. The regulars are familiar sorts, including the loud drunks, and the teasing, adult-minded loli.\\n\\n\r\nSo yes, it has all the typical elements, but, I often got the feeling that something was different. I don't know for sure, but perhaps the show is focusing that bit more on the central relationship than is usual. Sure, there's a lot of noise, and silliness, but it just doesn't seem to be as overpowering as other shows, leaving more room for the main attraction.\\n\\n\r\nSo, the final verdict: Nogizaka Haruka no Himitsu, is a nice, typical, romantic comedy, that just nudges ahead of the pack, thanks to being just a little bit calmer, and more focused. Also, it differentiates itself somewhat via the otaku angle. If you're a fan of high-school romantic comedies, then this is definately worth a look.",
            "date": "2008-12-02T23:42:00+00:00",
            "helpful_count": 41,
            "mal_id": 10043,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25782.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/alx222000",
                "username": "alx222000"
            },
            "url": "https://myanimelist.net/reviews.php?id=10043"
        },
        {
            "content": "Anime that focuses on and celebrates otaku culture is becoming increasingly rampant these days, but at the same time, it's important for anyone on the up-and-up with Japanese society to know that being an otaku is still one of the worst stigmas any one person can carry. Therefore, whoever though of making a series where a classy, rich girl loved by all is actually an otaku in secret was a genius.\r\nThis is where Nogizaka Haruka no Himitsu really flourishes in its delivery. The story, focusing on Haruka's love of anime, manga, and otaku culture is not merely another \"girl likes anime\" series, but rather atale of otaku empowerment. The series demonstrates the societal taboo by immersing \"normal\" people into Haruka's hobby, thus creating a window that gives the potential to both celebrate and/or villify the various extensions of the culture, which allows for many poignant moments in coming to understand why Haruka likes anime and manga, and why the taboo against anime fans is so unjust.\\n\\n\r\nOutside of the titular \"himitsu\", the series is a fairly average romance between the two leads. Misunderstandings happen, obstacles occur in predictable ways, but what keeps it moving is its incredibly likeable cast. You might think for a series where a guy and a girl are trying to get together there might be loads of rivals on both sides, but Haruka plays it surprisingly upbeat in that just about everyone in the main cast wants Haruka and Yuuto to be together and help them out with whatever trials come their way. This refreshing viewpoint really makes for a much more enjoyable cast where characters aren't driven by their love interests and can thus be utilized in multiple different ways that focus on who these characters really are.\\n\\n\r\nThe animation is gorgeous, coming from a very small but very underrated studio, Studio Barcelona (now Diomedia). The character designs are very cute, and the animation itself is smooth (especially in the ED sequence). Sound is kind of a moot point, because while all the characters sound great and have solid performances, the BGM is meh and the OP/ED songs are completely mediocre.\\n\\n\r\nOverall, Nogizaka Haruka no Himitsu was a welcome surprise in the latest flood of pro-otaku anime, taking a very hard look at the societal issues that being an anime fan consists of. It looks beautiful, sounds okay, and really sells itself not as just another otaku moe comedy, but as something with lasting value. Here's hoping the second season is more of the same.\\n\\n\r\nOverall, I give Nogizaka Haruka no Himitsu an 8 out of 10.\\n",
            "date": "2009-08-30T12:26:00+00:00",
            "helpful_count": 27,
            "mal_id": 18228,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8731.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Splitter",
                "username": "Splitter"
            },
            "url": "https://myanimelist.net/reviews.php?id=18228"
        },
        {
            "content": "Nogizaka Haruka no Himitsu \r\nNogizaka Haruka No Himitsu is an anime about two people from different classes.  On one hand you have Yuuto Ayase who is average and plain in every way, and on the other you have Haruka Nogizaka who is rich, famous pianist, and the most popular and sought after girl in the school.  These two cross paths in a set of unlikely coincidences at which time Yuuto discovers a deep dark secret which could crush the popular lifestyle of Haruka.  Haruka is an otaku.  To Haruka’s relief Yuuto, though average, is a very honest and caring person andhe promises to keep her secret, and support her with her hobby as anunwavering friend.\\n\\n\r\nIf the discription of Nogizaka Haruka No Himitsu sounds familiar it is becuase you are right “Ore No Imouto” has a VERY similar plot aside from the fact that Haruka and Yuuto are not blood related and the fact that “Ore no Imouto” was a far better series.  Though it is a generic plot at this point the series did have a sweet feel which makes you root for Yuuto and Haruka through all their ordeals.  The characters were well drawn, though the backgrounds felt stagnent and a little dreary for a slice of life romance anime.  Character progression was focused on emotional developments betwen the characters which left a linear feeling, until the end when these emotions were fully realized.  What was really lacking in this series was a love rival, which I originally thought would be played by Shiina Amamiya, however I was dreadfully disappointed. \\n\\n\r\nOverall the series was light hearted, sweet, and funny at times, but overall average for an anime.  Some competition, and perhaps earlier conflicts in the budding relationship would of added to the excitement around this series.  Due to this I give this anime a 5/10.  It was interesting, but average all around.\\n\\n\r\n@GameJok3r",
            "date": "2011-09-13T11:11:00+00:00",
            "helpful_count": 27,
            "mal_id": 43267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=43267"
        },
        {
            "content": "Story - 4\r\nThe initial premise for this series is interesting and is what drew me to watch this in the first place.  It starts out strong but by episode 6 or 7 the main reason for the story has been mostly wrapped up and the following episodes become an everyday romance story, except that even that is badly written.\r\nArt - 5\r\nThe art is generic and bland, with very little to distinguish characters in this anime from characters in others.  It doesn't have any particular flair to it and doesn't grab your attention, but on the other hand, it is also not bad tolook at.  It's just... average.\\n\\n\r\nSound - 4\\n\r\nThe OP and ED songs aren’t memorable or catchy at all, and have very little staying power.  They’re just... there, and that’s it.\\n\\n\r\nCharacter - 2\\n\r\nThe characters in this series are horrible.  In the first couple of episodes things seem as though they will be interesting, but as early as episode 4 things start getting hard to watch.  The main characters are extremely bland and their romance is more of the 'oh look, they're in love because the animators say so' rather than there being any real reason for them to be together other than the initial premise, and there is no chemistry between them.  This makes this series extremely hard to watch.  I found myself in the middle of episode 6, and having such a hard time watching the two mains that I closed the video and didn't watch it for a few days.  I found myself having to do the same thing for every episode after, because all of them had scenes that I found excruciatingly painful to watch.  There aren't really any redeeming characters in the series; they're all bland and hard to watch most of the time, making it extremely hard to sit through an episode, let alone this series.\\n\\n\r\nEnjoyment - 2\\n\r\nAs I stated in the above section, I had to spend days away from this anime to get the bad taste of certain scenes out of my mouth.  There were a few (make that very few) redeeming moments, but they were instantly washed away by the lack of good story, bland art and annoying characters, and there were nowhere near enough of them to make the series enjoyable.\\n\\n\r\nOverall - 3\\n\r\nIt's a bad anime, I didn't like it, and I honestly can't see why people would think it's good.  The romance is forced, as is the dialogue and situations, and it's got next to nothing in it that could redeem itself.  I don't know how I got through the entire anime, I hope I don't ever have to watch it again and I certainly won’t be watching the sequel.",
            "date": "2011-01-08T22:38:00+00:00",
            "helpful_count": 15,
            "mal_id": 33581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/chinlamp",
                "username": "chinlamp"
            },
            "url": "https://myanimelist.net/reviews.php?id=33581"
        },
        {
            "content": "I'm guessing everyone reads the short synopsis before reading the reviews, so this review will be very much free of any spoilers. \r\njust one thing before i start. the genre set for Nogizaka Haruka no Himitsu(NHnH) is Romance Comedy, but for me, it's more to Slice of Life, Parody, and pure Romance. Don't expect any serious harems from NHnH.\r\nStory (8/10)\r\nThe story for NHnH is very simplistic and very predictable. However, this is, rather than a disappointment, the best point in NHnH. From the beginning, we are told of the main character's (Nogizaka Haruka) secret. The series does not show any signs of surprising us orportraying an impressive plot twist. It just piles up cute, predictable scenarios which you will find in any Romance Comedy Harem anime you've seen. surprisingly, this is not a turn-off, because it's portrayed in a very cute and romantic way which will make you blush at every scene, even if you already know exactly what is going to happen next. The only thing different in NHnH's story is the anime-lover(otaku) point of view. if you love animes, but are always made fun of by friends, you would be able to relate to this anime a lot. \\n\\n\r\nArt (7/10)\\n\r\nThe art for NHnH is also very simple and not so impressive. It does show brilliance in the variation of character designs, however, since we usually see the main characters in casual clothes rather than only school uniforms. It's also beautiful enough to make you blush, so it's not really so bad even though it looks plain.\\n\\n\r\nSound (8/10)\\n\r\nThe OPED is not the most impressive I've seen, but it does its job in symbolizing the series. the bgms and effects are also quite plain.\\n\r\nWell, to be honest, the main reason I watched NHnH is because of Nogizaka Haruka's Voice Actor(seiyuu), Noto Mamiko. For Noto fans, this series is absolutely a must watch. The other seiyuus also perform very well and fit their characters perfectly. so there's no complains about the sound, and plus Noto Mamiko, it's worth it. \\n\\n\r\nCharacter (8/10)\\n\r\nThere are quite a few unique characters in NHnH, but don't expect much character development from them. The standard harem characters are all there, but it's safe to say that, other than the two main leads, the others are all side characters. Well, thanks to that, the series focuses on how the main leads develop and grow in their relationship, and this is very nice to watch. \\n\\n\r\nEnjoyment (9/10) and Overall (7/10)\\n\r\nAs i will say for any series, enjoyment really depends on mood and expectations. If you want to enjoy NHnH to the fullest, remember that this is more to a slice of life anime, so watch it with a light heart and don't expect too much from it. If you do, I'm sure you will be laughing at the jokes before they even happen, and blushing as much as the characters are. \\n\r\nOn the other hand, this anime is definitely not recommended for critics and those who prefer more dramatic romances. This is the only reason I lowered the overall rating to 7 for the review. It's not really a series which everyone will enjoy.",
            "date": "2009-02-21T00:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 12603,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46781.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lonehunter88",
                "username": "lonehunter88"
            },
            "url": "https://myanimelist.net/reviews.php?id=12603"
        },
        {
            "content": "Story:  Not much to mention here, basically just your standard romance/comedy/harem kinda of plot, where one guy is surrounded by a bevy of perfect girls all vying for his attention.  I will mention though that while the basic plot is unremarkable, it doesn't become too cliche with too much fan service or ridiculous situations (there are some which stretch the imagination, but try watching say, Nagasarete Airantou, without wondering where reality went).  Anime's poking fun of otakus seems to be the \"new\" thing in anime recently, and Nogizaka Haruka no Himitsu does it as well, but the series quickly abandons the wholeakiba-kei stigma thing for a more lighthearted depiction of otakus.  \\n\\n\r\nArt: Characters and backgrounds are drawn with a lot of detail, but frankly are unremarkable.  This isn't because the art isn't any good, but rather because it seems like the quality of the artwork has improved drastically for most of the newer anime, so nothing really pops out (as opposed to say the backgrounds for Mahou no Tsukai ni Taisetsu no Koto ~Natsu no Sora~).  I haven't had a chance to compare the artwork from the anime and the manga; but overall, very decent\\n\\n\r\nSound:  I really have to give props to Haruka's seiyuu; it is kinda of refreshing to hear a different voice from the &quot;standard&quot; high-pitch female voice.  Haruka's pitch is considerably lower and mellower than most of the other girl's voices, and there this timbre that is a little gritty that I really like.  I think it also fits Haruka's personality perfectly.  Both the OP and ED are catchy, but I can't help but think that the ED is trying to emulate Suzumiya Haruhi no Yuutsu's ending with the dancing bit.\\n\\n\r\nCharacter:  For once, a guy who is not a total loser.  It seems like one of the foundations of this genre is that the dude must be a complete and abject loser, probably to contrast the perfectness of the girls (I really hope its not to relate to the fanbase o.O) Yuuto is just a regular guy who is pretty compassionate, so its not impossible to see why the &quot;perfect&quot; girl (Haruka) would fall for him.  The other characters are also very developed; Mika's character in particular adds a lot of humor and a little bit of ecchi-ness.  \\n\\n\r\nEnjoyment:  Heart-warming sums up this anime.  Unlike many anime's in this genre which are wholly forgettable, there is actual chemistry between the characters and while yes, there is a fair amount of the obligatory fan service, most of the story revolves the relationships between the characters.  I definitely will keep this anime and probably will watch it again.  \\n\\n\r\nOverall:  Basically, this is kinda of a &quot;fluff&quot; anime in the best sense of the term; if you really like a deep story, go watch Ghost in the Shell or Evangelion; if you like harem anime, then go watch love hina or Goshuushou-sama Ninomiya-kun; but if you want to watch an anime which is predictably heart-warming and just plain fun to watch then I would recommend this anime.",
            "date": "2008-09-03T14:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 7671,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68072.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/diaho",
                "username": "diaho"
            },
            "url": "https://myanimelist.net/reviews.php?id=7671"
        },
        {
            "content": "This is one of the best romance animes that I've seen. If not the best, in the top 2-to-3. And here's why:\r\nHere I am, in America, thinking that anime, manga, etc. was watched on a nationwide scale, and didn't hold any social repercussions for doing so. Well, I might be wrong. Although I don't know the social acceptance or tolerance of the aforementioned hobbies, this show's culture of Japan looks down upon the hobby itself, as well as the people who enjoy that hobby. Now, like above, in actual, real-life Japan, the mood could be quite different from what's given to us in the show,but this key change of normalcy in regards to the storyline had me reeling... in a good way.\\n\\n\r\nNow, if you've seen this and have read the above paragraph, and thought to yourself, \"Well, it's the typical 'normal boy-meets-girl'\", type of storyline. And to that I respond, yes; but how they get these isn't done through the overused plot we see so much in romantic animes. This one was different: they weren't childhood friends, (an encounter doesn't count! It had nothing to do with the progression of their relationship!) there wasn't an over-the-top ecchi moment in which they met, etc.\\n\\n\r\nIn reference to story arcs, the main one created in the first episode encompasses, is referenced to, and plays into, if not all, but a vast majority of the 12 episodes. The longest separate arc I saw was 2-episodes-long, which involved the final 2 episodes of the series. The lasting affect is pleasant and you walk away from each episode feeling like the story progressed in one form or another; and that's what a story should do: move the characters, plot, time line, etc. FORWARD with each passing episode - if you don't, that's when the viewer becomes bored. I, for one, was never bored. 10/10.\\n\\n\r\nI want to take the art director out for a dinner and just smother him/her with gifts of gratitude. It was that good. Every character is so exquisitely drawn, especially Haruka. But where my complements will ultimately hang their hat on will be the portrayal of Yuuto. \\n\\n\r\nToo many times have we seen the hero in animes be drawn as frail, insignificant, and completely shy. We see characters drawn like this because the creators of the anime want to attract more male viewers who think, \"Hey! He's just like me!\" Well, I feel, probably for the first time, that they captured (more-or-less), an average, high school fella. One who isn't arrogant in his womanizing abilities, looks like he could bench 400 lbs., but a guy who isn't either TOO frail or TOO weak. They somehow found one of the best balances between the two I've seen yet in a romance anime. 10/10. \\n\\n\r\nI really enjoyed the voice acting. If I had to give one of those big checks you see given out at golf tournaments to the voice actor of a character in this anime, I would somehow try to find a way to split it between Haruka's and Hazuki's voice actors, respectively. A job well done. 9/10.\\n\\n\r\nThe characters are, and always should be (I don't know why some haven't realized this, yet), an anime's (and all forms of media, for that matter) strongest point; the most enjoyable aspect. \\n\\n\r\nHere, I found a show which is so enveloped, and literally hinges on the success of the characters. Whether that be due to the fact that the show only lasts for 12 episodes may be a relevant factor, but who cares; it passes with flying colors. \\n\\n\r\nEach character falls into a relative category that you unconsciously create while watching the show: \"Oh, Hazuki, the soft-spoken funny one; Maki, the raunchy, over-the-top kid; etc.\" And it's so nice to have these characters that are so consistent with their roles that you don't get any unwelcome surprises or revelations. \\n\\n\r\nThe two mains' really shine here. Yuuto and Haruka seem to be a perfect couple and the show plays to that aspect: you know it, they know it, the characters know. There isn't a time they spend together that doesn't add a new layer to their relationship; it contains so much substance and viability that I'm extremely excited to start the next season as soon as possible. If you can create engrossing characters, that every moment spent together doesn't seem like a moment lost, means a huge success on behalf of the show's staff. 10/10.\\n\\n\r\nIf you couldn't tell already: I adored watching this show. A lot of romantic animes out there try to stray away from there own genre and have completely irrelevant episodes regarding some random, irrelevant secondary characters plopped together to work on helping each other how to cook. I don't care! I want as much time as possible focused on the reason I chose to watch this show in the first place: the love story! And they do such a good job of \"keeping the pedal to the metal\" and it's the best thing ever to finally get my prayers answered. Finally! 12/12 episodes (from what I can tell) that are majorly geared to the love story between the two main people that the love story is about. It just makes me want to send a memo to all the other future/past creators and say, \"Look - this is how it's done.\"\\n\\n\r\nThe only detriment to the series is the fact that there are no confessions of love. Sure, \"I'll be with you... forever\", is close, it doesn't hold the same resonance in the heart's of a viewer than saying, \"I love you.\" Although it may seem nit-picky, you find yourself waiting for the line to be uttered every time there together and it never happens is some sort of letdown. But! Thankfully this show has a second season! 9/10.\\n\\n\r\nThis show was spectacular. Period. I would love to defend my position over someone who, like me, enjoys romance animes more than any other genre, because, let's face it: maybe an sci-fi/action fan coming off of something like Cowboy Bebop to watch this show probably won't agree with me. Anyway, my overall grade is based on all of the previous main categories, but I'd like to leave you with one last complement of the series:\\n\\n\r\nThe show borrows from a lot of sub-genres out there (e.g. ecchi, harem, comedy, slice-of-life, etc.), and is so well balanced in each that the show is molded together virtually flawlessly. There are a few ecchi moments, but not too much to make uncomfortable a casual watcher, a harem aspect can be chose to be seen as present and relevant or not present and irrelevant, and there are a few comedy gems in there that got me to laugh and smile as I watched the next scene.\\n\\n\r\nYou can do no wrong here in picking up this series if you're a romance fan. I wouldn't be surprised if it acted like a transitory series for first-time romance watchers to get into the genre, either. It's so close to perfection. Literally three words away. I leave you with the words of an early Puritan coming to the shores of America; as this show has become something of a benchmark that all romance animes should strive for. 9.99/10.\\n\\n\r\nIn the words of John Winthrop: \"I envision this country, a city upon a hill.\"\\n\\n\r\nFeedback is appreciated!",
            "date": "2009-12-08T00:52:00+00:00",
            "helpful_count": 11,
            "mal_id": 21202,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=21202"
        },
        {
            "content": "I don't even know how anyone managed to write a story with such a fun-sounding plot and theme(similar to Oreimo, one of my favorite series), but make it so boring. This is one of the most painful series I've watched. Each episode is a battle, a long and strenuous walk through an enormous desert. It's about as fun as writing a twelve-page essay on the history of toilet paper. I, personally, am a huge fan of anime, figure collecting, et cetera, and though the characters' trips to Akihabara and Haruka's interests seemed like a promisingly exciting adventure at first, it wasn't. I'm currently, after afew months, on episode 11/12, and I am not looking forward to the next one. I have been procrastinating each episode of this anime. I kept watching this, hoping for it to get better, but it didn't, and here I am.\\n\r\nStory is 2/10. It's extremely predictable, from the very beginning of each episode. You can tell what is going to lead to a conflict, what the conflict will be, and pretty much everything following the conflict. I spent the entire time waiting for characters to do what they would obviously do, but took painstakingly long to. All of the relationships are predictable. You just know everything that will happen. \\n\r\nThe art, however, is quite good. 8/10, the characters are cute and the girls have very moe features. The costume design could be a bit more tasteful. Everything is very shiny and somewhat aesthetically pleasing, and the animation runs smoothly. I really love the character design for Haruka's little sister.\\n\r\nThe sound is 5/10. The opening song is a little boring, and sounds like it could have been from twenty years ago, but the ending theme is fun and the rest of the soundtrack is okay. Just okay.\\n\r\nCharacters, I rated 3/10, because they are all have very shallow, typical, predictable personalities. They are all very easy to read, to the point that it is pretty annoying. There is hardly any character development, I have only observed developments in their relationships with one another.\\n\r\nI rated the enjoyment factor a 3/10, because I did not enjoy it, save for a few short bursts of humor, cuteness, and fan service. Like I said, I have been procrastinating each episode, so that I have been watching this 12 ep series for several months. This is my first review, because I don't know how this got good ratings. It is so very, very bad. Overall a 3/10, would not watch again.",
            "date": "2012-09-08T16:59:00+00:00",
            "helpful_count": 11,
            "mal_id": 71875,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482412.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/pettaneko",
                "username": "pettaneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=71875"
        },
        {
            "content": "\"Nogizaka Haruka No Himitsu&rdquo; is a romantic comedy based on a series of light novels with the same title.\r\nThe series focuses on the relationship of its two main characters, high school students Haruka and Yuuto, how they meet, form a bond of friendship and perhaps more, all in a mix of comedy, romance and some fanservice type ecchi situations.\r\nAs the title suggest, the main plot centres around Haruka's secret, she's an otaku. While this would not be so shocking by itself, Haruka is the eldest daughter of an extremely wealthy and renowned family, she possesses great beauty, has excellent academic skills and is a talentedpiano player, which makes her a star and the object of admiration at the prestigious private school she attends. If such a person were to be exposed as an otaku, they would be ridiculed and ostracised, something that already befell Haruka at her previous school. Hence she carefully hides her hobby from the outside world.\\n\\n\r\nThis is soon undone when Yuuto bumps into Haruka at the library and discovers she's secretly borrowing anime magazines. Fearing her secret is exposed, Haruka is distraught but eventually  relieved when Yuuto tells her that he does not mind her being an otaku and will keep her secret safe.\\n\r\nWith Yuuto now sharing Haruka's secret, hence forms the main plot device to allow them to interact daily and become friends. Along the rest of the series both Haruka and Yuuto are faced with challenges that threaten their happiness, from Haruka's strict father, to a potential love interest for Yuuto, to the difference in status that comes with Haruka's wealth. Seeing this is a comedy, most of is done with plenty of funny scenes and off course it all ends well.\\n\\n\\n\r\nOne of the series' strong points is also its weakness, namely its characters. While most of the supporting characters are rather two dimensional and not much fleshed out, both Haruka and Yuuto are a paradoxical combination of some interesting traits as well as more generic character traits.\\n\\n\r\nHaruka being of wealthy descent, blessed with great beauty and academic skills and having several moe character traits such as shyness and clumsiness that are solely aimed to cater to the audience is nothing new in terms of character design. That such an unrealistically perfect persona has a passion for which one is ostracised in Japan, yet stands up for her beliefs and isn't free of normal human emotions such as doubt and jealousy makes her a more three dimensional character. A welcome surprise. \\n\r\nNo chance is missed to display Haruka's moe character traits and truth must be said, she is quite moe.\\n\\n\r\nYuuto too is such a mixed case, he has many traits of the classical romantic comedy or harem male protagonist, such as being shy around women yet desiring them, he is indecisive and well, he's rather plain. Nonetheless, Yuuto is also shown to be a very level-headed and open minded person, who accepts people's different interests and who will not ostracise anyone, even if he does not understand the things they are passionate about. Having such an adult, open minded character that does not succumb to blindly following the group mentality is interesting, especially if you see the majority of his peers will ostracise and judge someone like Nobunaga -Yuuto's otaku friend- or Haruka without any second thoughts.\\n\r\nWhile being rebellious is surely not an unknown phase to any young person, being open minded, willing to form one's own opinion that may not align with the public one in a positive fashion is more rare I gather.\\n\\n\r\nI also found Shiina to be a quite refreshing character. Transferring into Haruka and Yuuto's class, she develops a liking to Yuuto, but once she discovers that Yuuto and Haruka care deeply for each other, she takes a very adult stance and doesn't really fall prey to the usual anime clich&eacute;s. \\n\\n\\n\r\nThroughout the series some dramatic moments or events are generated but rarely does one have the impression anything really bad will occur, due to the colourful and comedic atmosphere the series carries. Everything is usually very upbeat and positive.\\n\\n\r\nEven though the theme of otaku being ostracised and publicly shunned is often mentioned, it's used more as a plot device and never really deeply delved into. Haruka and Nobunaga are shown to be normal people who just happen to be passionate about anime, manga, figurines,... but that does not make them any less human or valuable people than you and me. It's nicely brought on screen but lacks the depth, subtlety or realistic tone a series like &ldquo;Genshiken&rdquo; carries with it.\\n\\n\\n\r\nAnimation in &ldquo;Nogizaka Haruka No Himitsu&rdquo; is good, with most of the focus being on the girls like Haruka, with fanservice scenes and shots getting the best treatment. I did notice that some full body shot scenes where characters are in their regular appearance do look more simple and less elaborate, but this is never bothersome.\\n\\n\r\nThe soundtrack is quite nice, it supports most scenes well and the opening and ending theme songs are upbeat tracks, though the opening animation sequence leaves little to no doubts about the series' general direction.\\n\\n\\n\r\nSo for those looking for a cute romantic comedy that has a positive overtone and a moe female lead character, then you may certainly enjoy &ldquo;Nogizaka Haruka No Himitsu&rdquo;.",
            "date": "2008-10-04T06:32:00+00:00",
            "helpful_count": 10,
            "mal_id": 8405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=8405"
        },
        {
            "content": "This is definitely more than a little ecchi, and there's a large amount of gratuitous in-joking.  However, I like this show.\r\nBeyond the slick production values, this is a believable story.  There's a girl who has a lot of trouble opening up her emotions, and she meets a decent guy who happens to get past her defenses.\r\nI don't think I'll end up liking this as much as \"Zero no Tsukaima,\" but the basic ambiance seems to have a lot of similarities.",
            "date": "2008-08-07T04:46:00+00:00",
            "helpful_count": 7,
            "mal_id": 6904,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83256.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/formosan",
                "username": "formosan"
            },
            "url": "https://myanimelist.net/reviews.php?id=6904"
        },
        {
            "content": "Nogizaka Haruka no Himitsu is an anime that focuses on the peculiar world of interpersonal relationships and the misunderstandings of every day life. It is an oddball in that it has the capacity to be a masterpiece but due to the forced and often exaggerated drama it falls short of its true potential.\r\nThe central couple of the show, Yuuto and Haruka, go to the same school but seem to be on two different ends of the social spectrum. Yuuto is a plain and completely uninteresting guy with the resolve of a pigeon dropping. He's indifferent in life and often pushed around by his peers likea leaf in the wind. This personality supplemented by his plain looks make him unpopular with the ladies or just about anyone, to say the least. On the other hand we have Haruka, the beautiful highly accomplished student and a prodigy in various subjects and disciplines. And of course unlike Yuuto, she's from a rich and noble background. So you can pretty much see the massive disparity here. \\n\\n\r\nSo how is it that they get acquainted? They end up sharing a secret when Yuuto finds out that Haruka - the model student, is in fact a bit of an anime otaku. Forced to keep his mouth shut and make sure her secret is not revealed, the two get closer and various shenanigans begin to take place. \\n\\n\r\nNow this is not an inherently bad story, I'm all for the idea of a powerful girl falling for the average member of society but I personally felt that the romance component in this anime was lackluster. Despite the fact that we see some progression in the relationship of the two main characters, as they do go on numerous dates, the atmosphere surrounding them is way too infantile. They nearly faint at the idea of even holding hands and that's months after their initial meeting. So the makers tried to supplement this obvious cock up later on in the series by making them \"accidentally\" trip on each other every 5 minutes and it's so blatantly obvious they're trying to force this down your throat that you feel like throwing up. Same goes for the \"drama\". Haruka getting wobbly feet and nearly losing consciousness because a few books got sold out or Yuuto blowing his stack because he felt \"useless\" after carrying his pseudo-girlfriend all the way back home is so teeth-grittingly fake you want to beat yourself with a wrench to make the memory go away. They also try to make it look serious and authentic which only worsens the situation. \\n\\n\r\nOn the other hand there are moments of sheer brilliance in this anime such as the accurate portrayal of what goes on in a teenage boy's head when he's around girls. Yuuto often ends up thinking about perverted things at the most inappropriate moments and that's something I could actually relate to because it used to happen to me too when I was a teenager. Whether it'd be looking down a woman's cleavage or getting funny ideas while alone with a girl - that's all part of growing up and it was funny to step aside and see my own adolescent years from 3rd view. I'm sure some people will share the same sentiment.\\n\\n\r\nAnother great thing here is the supporting cast and the good execution of humour. Haruka's family is made up of the most hilarious bunch of eccentric individuals. Neurotic maid with a passion for chainsaws, perverted sister, overprotective father who happens to be carrying a katana everywhere... the list goes on. Now that in itself wouldn't be anything unusual because we see that in anime pretty often - but it's the way these characters interact that really makes you grin all the time. Though in the end they are motivated by the same thing - poking their eyes through the key hole to see if Haruka and Yuuto are not doing anything questionable.  \\n\\n\r\nAnd then we have Yuuto and Haruka's classmates. These characters I felt were nothing more than cardboard cut-outs and there's not much to talk about them. A couple of perverted guys, an otaku and of course every romance anime needs one - another female character with an interest in the male lead. However they all contributed in some way or another to the story and did their jobs as background characters pretty well. \\n\\n\r\nNow with most stuff out of the way we come to the art and sound departments. Personally I felt that the art was very good and precise with emphasis on the eye candy effect, especially when it came to female characters (being kinda obvious here). Sound was absolutely amazing, in part because the OST features piano/classical music and partly because I'm a sucker for classical-themed pieces. However there are also regular pop pieces too (opening; ending) so I suppose a wide range of viewers will be satisfied. \\n\\n\r\nAs for the enjoyment, strangely, I got a lot of it out of this anime. Despite the infantile romance, the forced and at times absolutely fake drama - I still think there is a lot to enjoy here. Whether it'd be the nostalgia inducing fantasies and day-dreaming of the male lead in the presence of other girls, the all too familiar shyness associated with interpersonal relationships or the refreshing humor provided by the supporting characters; there are plenty of points of interest here for the casual anime watcher. If one watches this not as a thought-provoking masterpiece but rather as something that's meant to provide entertainment, which is how it's meant to be, then enjoyment will be there.\\n\\n\r\nNogizaka Haruka no Himitsu gets 8 points from me.\\n\\n\\n\\n",
            "date": "2013-01-22T16:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 84553,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=84553"
        },
        {
            "content": "I thought this was a very well done anime, but everytime haruka and yuuto were about kiss each other, someone would just barge in and just interrupt their kiss alone and i just hated that and I like said again a pretty well done anime with a very pretty voice from the actress playing Haruka. I want this anime to go on for a 2nd season or even a 3rd season. So i'm giving Nogizaka Haruka no Himitsu a 11/10!!!!",
            "date": "2008-10-13T15:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 8680,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58709.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/animestarts99",
                "username": "animestarts99"
            },
            "url": "https://myanimelist.net/reviews.php?id=8680"
        },
        {
            "content": "Romance/Comedy Anime that's very funny and enjoyable. When i watch this for  the first time, i know that this anime will entertain me. Yeah, that' s absolutely right. Well, lets reviews it step by step.\r\nStory (7/10)\r\nNot so new in anime world where the MC (Yuuto Ayase) is a roundabout person and he meets the princess of his highschool that fits the perfectness (Nogizaka Haruka). But, eventually he accidentally know her secret as an otaku. The story itself is rather slow at first but faster when it comes to an end. But i think the supporting characters in this anime are rather too ordinary. Theirappearance are made like NPC in some game that needed to progress the story. Like for example, Amamiya Shiina. Her role as the main female character love rival is quite weak. But from episode 1 to the end, i was able to enjoy it and there are some episodes that will show you a cosplay of other anime. Shana fans must see this series :)\\n\\n\r\nArt (8/10)\\n\\n\r\nThe Art is smooth and the BG is nice. I like the art of nogizaka haruka, she's so cute and seiyuu mamiko noto fits really well for her\\n\\n\r\nSound (7/10)\\n\\n\r\nWell, not so much to be reviewed here but the sound itself is okay. But, it just can't bring the atmosphere of the scenes to the viewers.\\n\\n\r\nCharacter (8/10)\\n\\n\r\nThis is a reason why you will like this series. You will like the characters of Nogizaka Haruka no Himitsu. You will like haruka, shy but actually a honest and kind person. You will like Yuuto Ayase, honest and caring person especially to haruka. And Yuuto not a harem type MC that like to do ecchi things even to defenseless haruka (yeah, she beat the annoying guy to yuuto so bad). The downside is, i just see a little char development among the characters of this show.\\n\\n\r\nEnjoyment (9/10)\\n\\n\r\nWell, its also a reason why you will like this series. The enjoyment of this series is gonna to haunt you per episode. Although i was annoyed because the the progress of Yuuto and haruka's relationship were bothered by some trivial things. But to me, this show was entertaining.\\n\\n\r\nOverall (8)\\n\\n\r\nThe story itself is not so original, with good characters, beautiful art, comedy, fine sound and a sweet love relationship. Overall Nogizaka Haruka no Himitsu is a decent anime. For those who hate a lot of fanservice anime, they can relax and enjoy this anime. Because this anime has a little fanservice (not zero). Hope you find your enjoyable time watching this anime as i found a lot of enjoyable time watching this. And again, for Shana lovers, i recommend it for you to watch this anime :)",
            "date": "2012-05-29T05:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 62167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1189023.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blu3cru5ad3r",
                "username": "blu3cru5ad3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=62167"
        },
        {
            "content": "This is so bad. The only good scene was the Shana reference. This whole anime is just retarded beyond hope. It's so retarded that it's not even funny, I'm crying tears of blood from how bad this is. For anyone like me, browsing for anime to watch, I have some advice: DO NOT WATCH THIS! Try something else, seriously.\r\nStudents are learning to swim in the school pool and then suddenly there are maids with a watermelon and the main girls sister with a beach ball there to have fun. Also, the protagonist's sister is having a BBQ next to the pool. Etc etc etc. Whatis this I don't even",
            "date": "2012-02-14T16:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 53883,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39476.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Aphyxia",
                "username": "Aphyxia"
            },
            "url": "https://myanimelist.net/reviews.php?id=53883"
        },
        {
            "content": "DDAAAMMNN! This anime turned out to be much better than i expected it to be. I had this anime on my ' to watch list' for a while now, and i kept adding new anime just so that i can avoid watching the ones that seemed boring and average. I thought that i was going to get an anime that was tediously average but instead i got a hard boiled romance between Yuto and Haruka. Yeah sure we might have seen the average story but don't judge every thing by the cover. You might actually find that this anime can be quite enjoyable. The twothings that set this anime apart from the average anime was the the enjoyment(10) and the flowing relationship between the to main characters. Some romance anime skip the growth of relationships and try to force it in at the end. This anime made their relationship grow in every episode and you actually enjoy watching them go through all these embarrassing moments and conflicts.   \\n\r\nThe art was done okay for the time it was made and the story was actually fine. What annoyed me in this anime though was how poorly the side characters where developed and even the main characters at times. Even for an average story, they should have at least developed the side characters a bit more. some characters are only in for about 5 or 6 episodes and that was really annoying to me. I knew almost nothing about yuto's sister and his sensei other than they like to drink a lot. I would have loved to know more about yuto's sister, especially because how unique i find an alchoholic character to be. The next thing that kind of pulled my nerve was the character of Amamiya. We see a great development at the beginning but after she was introduced, it felt like she just started to fade away. She had a role to play after but i never understood her. i thought she was a character that needed a lot more development. \\n\r\nMy last problem in this anime is something that not everyone get. When you watch a certain amount of anime it becomes easy to predict things in average stories. After i watched the first episode i already new what would happen at the end and i new almost all the conflicts that they would have to face. The most predictable was Haruka's father. I would literally just watch an episode and call out scenes like every minute. Having said this, i would suggest this anime to veterinarians and not to people who have watch dozens of anime unless you're super into growing romance like me. Although i had many concerns this anime, i still very much enjoyed it and to me that is the key factor to an anime and that is why i gave this anime an overall rating of 8/10",
            "date": "2015-06-21T22:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 190891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4312659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Colorist",
                "username": "Colorist"
            },
            "url": "https://myanimelist.net/reviews.php?id=190891"
        },
        {
            "content": "Nogizaka Haruka no Himitsu\r\n\"This review is very short and lacks spoilers but its gives you a quick view on what i though of the series\"\r\nGood Points\r\n*Amazing Artwork and scenary\r\n*Great character style and voice acting really suits each other.\r\nBad Points\r\n*Weak Story\r\nStory\r\n*Really unique storyplot which is SHE is a OTAKU :), but apart from that nice touch the story is plain and somewhat a bit boring and predictable (Them becoming a couple) \r\n*Luckily the sub characters (Haruka's Lil Sister etc..) are fantastic and the dad reminds me of the dad in (Seto No Hanayome) \r\nMy View\r\n*I would say with this unique storyplot and great style and charactersit had the potential to be fantastic but the rest of the plot was lacking and made this into a disapointment, dont get me wrong i really like it but i can only give it a 7/10 not the 8.5/10 or 9/10 i thought i was going to.",
            "date": "2008-12-23T06:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 10584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gorskino10",
                "username": "gorskino10"
            },
            "url": "https://myanimelist.net/reviews.php?id=10584"
        },
        {
            "content": "story\r\ni would say that aside from having much of fanservice, i really liked the romance and development of Nogizaka Haruka's story. it may be a typical slice of life but it touches sensitive topics related to otakus especially that of discrimination and i gues that's the reason why i got myself hooked since the start of the series.\r\nalthough there are some cliched events troughout with the aspect of first-love and destiny and romance, i still liked how they developed every episode neatly. some episodes entertain the viewers with factual akiba-ke information while other deal with how people are to deal with their inner demons andface conflicts with society.\\n\\n\r\nas a general premise, yuuto would be haruka's knight in charge of protecting her secret from the rest of society so as she wouldn't be humiliated as what she experienced before when she was in middle grade. even though the story's plot revolved around that, it's fun that they still focused on fanservice rather than being serious all of a sudden. at the very least, they maintained consistency in their episodes.\\n\\n\r\nart\\n\\n\r\nthe story's not that to brag about but it's still worth mentioning that it mixes very well with the harem and fanservice theme. lotsa sexy characters from time to time and frilly clothes that would definitely pick on cosplayers everywhere\\n\\n\r\nsound\\n\\n\r\nthe opening and ending wasn't that catchy. it was entertaining but it was just at that. the slice of life an ero ero scenes are properly paired with BGM so i have no qualms regarding those things.\\n\\n\r\nit is to note however that some character singles are amusing. they dont give me the last song syndrome but still have an enchanting effect especially haruka's single, sung by mamiko noto. i also liked kana ueda and kaori shimitzu's duet.\\n\\n\r\ncharacter\\n\\n\r\nthis is definitely a typical romance where boy meets girl few years back then boy meets girl few years later and boy must protect girl at all costs. despite being a fanservice anime, everyone has still attitudes that's worth mentioning such as the imperfection of the perfect haruka in terms of clumsiness, yuuto's laid back attitude but determination, mika's abuse of her innocent look which definitely leads to various echi echi moments and other forms of chaos. yuuto's drunk sister and teacher which definitely services a complete set of incest harem.\\n\\n\\n\r\nenjoyment\\n\\n\r\ni really enjoyed the otaku fanservice though (episodes relating to otaku life) and has grasped the idea of otaku discrimination and oppression quite easily thanks to their episode conflicts. some episodes are simply senseless however yet still manages to progress in terms of plot development\\n\\n\r\noverall\\n\\n\r\neven though nogizaka haruka didnt give me a thrill in terms of action, i suppose slice of life fanatics wouldn't be disappointed watching this one. the same goes for those who love romance flicks and some ecchi here and there. however, if you really like to look into otaku popculture effects in the society, then nogizaka haruka wouldn't fail to boot",
            "date": "2008-09-29T05:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 8261,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/29094.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/edgewalker00",
                "username": "edgewalker00"
            },
            "url": "https://myanimelist.net/reviews.php?id=8261"
        }
    ],
    [
        {
            "content": "I truely enjoyed watching this show, In fact i have watched the entire show a few times. There are many good things to say about this show. Although the plot is kind of predictable most of the time it is still fun to watch. The personalities of the main and secondary characters are very well thought out. They are portrayed in an excellent manner and is what really makes me want to watch it over and over again. One of the only things i didn't really like about the show is how the two main characters never admitted their feelings to each other although theyknow how the other feels about them. Its almost like a common love story but not so much love is shown. Still the show will leave some inpact on the person watching it and you will want to continue on watching the second season of the show which is much better. I recommend this show to anyone who likes romance with some comedy.",
            "date": "2012-12-21T08:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 80776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=80776"
        },
        {
            "content": "this anime based on princes other side of life, who likes anime, manga, doujinshi and she doesn't want her hobby to be founded by others because it will change her images towards those who hates otaku.\r\nharuka is a silly girl, clumsy, simple minded, but Beautiful likes a princes ( although she lives exactly as a princes of nogizaka family ). and one day she heard about the release of  innocent smile new magazine in her school library and intent to borrow it after the school... but her hobby was being founded by yuuto, a male student who will become her secret keeper in thefuture but it doesn't last long until her father gave a permission about her hobby.....\\n\\n\r\nin time being it telsl us about the differences of nogizaka house holds and ayase, yuuto as an ordinary person who trapped in their activities, but actually haruka's father, haruka's mother, and even haruka's Grandfather seen something wonderful and rare to find in yuuto personalities......",
            "date": "2008-12-03T21:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 10075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/120275.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/4ngs4u",
                "username": "4ngs4u"
            },
            "url": "https://myanimelist.net/reviews.php?id=10075"
        },
        {
            "content": "I watched part of this series when it was first coming out several years ago, but did not finish it.  I got around to it again recently as I wanted to see how it finally ended.   \r\nI enjoyed the first season and most of the second season-- but by the end of the second season I could not stand the main character yuuto or the same joke over and over again.  \r\nThe biggest problem I had with this shows is that yuuto the MC is completely useless and doesn't have the slightest courage to do anything serious to help the girlhe cares about until he gets a pep talk from all of his friends.  By the end of the second season he alone ruined it for me.  \\n\\n\r\nIt had the cliche of a guy and a girl falling over and landing in a perverted position too many times.   \\n\\n\r\nI also had the same joke that any time the two main characters go somewhere everyone goes with them.  \\n\\n\r\nIt also took an unbearably long time to get a real development for the two main characters, since they are always interrupted by something or someone even though they have a chance probably every other episode.  \\n\\n\r\nI started off liking the anime decently but by the end I was fighting to finish it just to see how it ends.  I think most of the \"problems\" that these two face could be fixed very easily if yuuto had a backbone.",
            "date": "2018-11-03T20:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 293278,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ryanq214",
                "username": "ryanq214"
            },
            "url": "https://myanimelist.net/reviews.php?id=293278"
        },
        {
            "content": "Neko here, and.. when did I wrote review like that?\r\nOkay I'll rewrite this review from my point of view today.\r\nThe secret is Nogizaka Haruka, rich lady, is actually an otaku. You keep her secret from others, and set some flag higher than any other men. You get her, date her, and get on top of her. That's the kind of anime is this.\r\nThis anime is for you. Yes. You who want another dream-comes-true situation. Date someone rich who actually likes anime. And she did some parodies! It's shana! I laughed since I like that kind of parody.\r\nLucky Bastard, I want flag like that too! -isthe first impression of this anime.\\n\r\nWell, this anime isn't quite good. You may pick another anime.",
            "date": "2009-09-20T00:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 18946,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/169109.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nekoyaki",
                "username": "nekoyaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=18946"
        },
        {
            "content": "I feel bad for Nogizaka-san. Not only is your secret is exposed to some guy, you gradually fall for him too. Will he stay loyal to you by not blowing your secret to everybody else? or will fate just play on and ruin everybody's lives? It is a very long wait for the climax because season 1 is just half of the story. Anybody that likes cheesy romance comedies, akiba things, and just want to be a knight and shining armor to their girl will love this series. I prefer the pacing of the story on the light novels though as this anime adaptation didnot reach my expectations. I personally am not quite amused with the art as I've first seen this series as a light novel and we all know how cover art of light novels are godly moe and drawn really well. Soundtracks are your usual anison which is nice and safe. All characters are interesting as well especially Nogizaka's parents XD. Though i prefer the novels, I did enjoy this anime as this was a great feat seeing this characters move and come to life not only on my imagination bun on my TV/PC screen as well.",
            "date": "2012-08-04T00:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 68657,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1312665.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/aiou",
                "username": "aiou"
            },
            "url": "https://myanimelist.net/reviews.php?id=68657"
        },
        {
            "content": "(SPOILERS)\r\nWhen I went into this anime, I did not expect it to go the way that it did. Besides having one of my favorite Japanese voice actresses as the lead, I was not too optimistic about it at first glance. I will keep the synopsis a little short since there's not too much to write about anyway.\r\nThe anime starts off with Yuuto, your everyday nerd character with glasses to boot, stumbling around and trying to avoid his otaku friend that insists he try out the hobby. He hears about a girl named Haruka, who is wealthy, popular and talented. Naturally, he fears he won't getanywhere with her as a friend, so he backs off from the idea right away and things go about normally. But, obviously we all knew that was not going to happen since her NAME is in the title of the anime.\\n\\n\r\nAnyway, the prim and proper Haruka (as the viewer currently knows her as based on the description given about her earlier) overhears that a certain manga is in the library by a loudmouthed Nobunaga (the otaku friend of Yuuto), stands straight up from her desk in an overbearing fashion, blushes in embarrassment over the ruckus and stumbles to the library. Naturally, our male lead has to get to the library for his own reasons as well.\\n\\n\r\nSo on, so forth, some plot stuff happens some more and, naturally, she bumps into Yuuto. Now, by this point, the viewer is well aware she is an otaku since she did walk over to the library earlier after hearing of the manga. The way that Yuuto finds out, however, is just bizarre and it feels so much like a plot device that it hurts to watch. She manages to trip around him several (yes several) times before they both fall over and knock all the books in the library down. Oddly enough, there was no comedy gag about the librarian making Yuuto clean it up, which I anticipated as soon as that occurred. Haruka naturally freaks out when Yuuto sees her manga and runs off. And through a chain of events, Yuuto promises to keep her secret and the rest of the anime begins as the romantic comedy you were waiting for.\\n\\n\r\nOkay, maybe that took a bit longer than I expected to elaborate on, but there you go. I will come clean here and say that this anime will throw a ton of \"romance\" moments at you that will go absolutely nowhere, so don't get your hopes up at all of them establishing a relationship here, cause it is only friendship in this season. Speaking of, right as I finished this up, I found out it had another season. Otherwise, I was fully ready to write them off as friends, but now there's more to look forward to since their relationship has built up from this season. And as such, I simply can't write anything concrete here. I was a bit surprised this even lasted another season, considering how bare boned the plot is.\\n\\n\r\nAnd speaking of, I would like to go over that for a bit. I do admire that this anime takes a very real approach on how fans of anime and manga would be treated if they go to a rough school and their hobbies are discovered. I still question how Nobunaga was never mistreated, considering how enthusiastic and loud he is about his hobby, but maybe he will have more development later on, so I can't judge for sure.\\n\\n\r\nOne thing is for sure, though, when the other classmates did find out that someone liked these things, things got really dark. As in, dark even for a comedy. Tons of insults, disrespect and treating their hobbies, as well as the individual, worse than trash itself. I was quite surprised at how dark it got, but only one episode truly got this bad. The other ones that did cover the topic in this manner simply did so in explanation, so it is mildly dark at most. I have to give them credit for tackling the hobby in such a serious fashion, since it reminds me of how I felt before my friends discovered I loved the stuff. I really did think they would demoralize me similar to how Yuuto's classmates disowned him when rumors spread about him being an otaku.\\n\\n\r\nOther positives about the anime are that it had a real good flow of comedy, characters were bubbly, yet simple enough to be very likable. I wound up liking Ruko the most, despite how she came off as being a stereotype that I dislike in anime the most at first. That being the kind that just has their way all the time without punishment. But, she is always wasted, so it's easily forgivable. For the fewer times that she is sober, she actually works a very high-class job and is quite intelligent. But of course, she comes off as dopey most of the time cause she is always wasted. She also has that hairline that I love so much, which earned her immediate bonus points on her character, even though I'm well aware that's a pretty poor bias to judge a character on.\\n\\n\r\nThe other characters may take too much time for me to explain here since they were all unique in their own way. Of course, they also had their fair share of stereotypes, but their personalities weren't as overbearing as I expected them to be, which was nice. I never felt like any of the female characters were a bother to me, which is very rare for me to experience in anime. They normally always treat the male characters like garbage a lot of the time, even when they do things on accident. And speaking of, he had quite a few of those with Haruka, but she somehow respected him regardless and did not mind.\\n\\n\r\nThough, I do dislike how the other women treated this, as they called her \"dense\" for not being angry with him, further reminding me how Japan treats men. It irritates me that an accidental sexual situation is considered punishable and that you're \"dense\" for simply acknowledging it as an accident. And no, Haruka is not the one that is fell on top of. She is the one that witnesses it, though, and considering the placement of one of the hands, she had every right to run away in confusion.\\n\\n\r\nAnd speaking of these situations, I would just like to point out that this is the very first anime I have ever seen where the usual \"male falls on female\" accident happened and the girl did not get upset at all. I am not kidding, this actually happened and everything was fine. He even had one of his hands land on one of her breasts, clearly grasping it, and she was okay with it and treated it as an accident. Just take that in for a moment.\\n\\n\r\nNo \"I am going to exploit this,\" no \"you are a pervert\" followed by her running away and misjudging the boy for the rest of the anime. None of this occurred after the accident. And to clarify, yes, it was the kind where he somehow landed a hand on one of her boobs, grabbing it, and nothing happened. Sorry for bringing so much emphasis on this one scene, but for many anime fans out there, it's quite significant for the scene to end as what it originally was in the first place. You know, an accident. I clearly spoiled this whole scene for you, hence my warning earlier, but if you have already seen it, then you must have been as shocked as I was.\\n\\n\r\nI could cover this season a little more if I want to, but I feel I should save those thoughts for after I have seen the entire anime. And, you know, I clearly dedicated a good chunk of it just talking about how it treats sexual scenes. And I may not even be done with that yet. And if you are reading this after watching, and I am assuming you are since I have a visible warning on the top; and you enjoyed this season, then I suggest watching the next. That is the plan for me since I actually enjoyed this anime quite a bit. I liked the music, the backgrounds and the setting is strangely relaxing. I love how Haruka, alongside most of the women in this anime, follow the usual stereotypes in a less chaotic manner.\\n\\n\r\nVery few \"misunderstandings\" that are treated with arbitrary punishments. In fact, I can't recall a single time where Yuuto received a punishment for any of his accidental sexual acts. Haruka just said it was alright and they moved on. Even for a comedy, it is quite unusual for them not to milk those scenes, but I am happy that they did not since it may have effected how I felt about the anime. I appreciate it more for not going through those comedy measures and I very much look forward to the next season and hope it retains the style of the first and does not try to etch in unnecessary comedy elements that it did not do before. Or at least, I hope they try to make it original if they do go about this path. Preferably, no \"you glanced at my panties once, prepare to receive an awful punishment\" moments. All I can do is hope.",
            "date": "2017-08-13T01:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 255323,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=255323"
        },
        {
            "content": "I went into this expecting to hate it and i've been surprised!  I actually don't know what it is but this was outlandishly fun to watch!  I'll concede that Yutou is a total idiot but the show compensates by having the exceedingly compelling Haruka at its helm and she is just...outstanding.  The fanservice is actually tasteful which is a fairly rare thing it has to be said.  All in all, this is perfect relaxation material!",
            "date": "2010-07-14T02:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 28389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/354939.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Witchkae",
                "username": "Witchkae"
            },
            "url": "https://myanimelist.net/reviews.php?id=28389"
        },
        {
            "content": "Story-\\n\\n\r\nIts mainly about a rich girl being happy with a guy that isn't of her status.\\n\r\nThis was pretty interesting, because there was no bullshit. There were no parts where there was suspense to the point where it get annoying.\\n\\n\r\nArt-\\n\\n\r\nThe art was pretty nice for the most part but i feel that it could have been a little better.\\n\\n\r\nCharacter-\\n\\n\r\nThe characters were pretty unique but i would say they lean more to ward the cute side even though most of the characters are adults.\\n\\n\r\nEnjoyment-\\n\\n\r\nThis anime was actually pretty unique because it shows the two kinds of Otaku. It shows that not all anime lovers are people with no life as many would think which is what made the anime so interesting to watch. The character types matched well making this anime pretty fun to watch.\\n\\n\r\nOverall\\n\\n\r\nI would say that this anime leans from 7.5-8 range. I thought the grand scheme of the anime was pretty nice, but i still feel that the art and plot could have been a little better.\\n\\n\r\nIf you are reading this review, please note that i have a lot of experience when it comes to watching anime and I hope you gain a good sense of this anime through reading this review. I highly reccomend  you guys watch this because its pretty unique and something worth while.",
            "date": "2012-10-30T13:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 76289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1490451.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Emperor_Eye",
                "username": "Emperor_Eye"
            },
            "url": "https://myanimelist.net/reviews.php?id=76289"
        },
        {
            "content": "The anime starts with the opening, that is really cool (photoshop or something like that), and the song is awesome!\r\nTrue, the first season of \"Nogizaka Haruka No Himitsu\" in the opening video they DON'T show if they are going to kiss or not. Me like! Because most of the anime shows in the opening what is going to happen in the anime, and in this anime they don't. So we don't know if they are going to kiss or not. (I promist, it's exciting!)\r\nSo just for judgeing this right now: I'll give the opening: 10/10 !",
            "date": "2011-10-12T06:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 45389,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/336572.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sachoza",
                "username": "Sachoza"
            },
            "url": "https://myanimelist.net/reviews.php?id=45389"
        }
    ]
]