[
    [
        {
            "content": "In my opinion this show is just bad.  Before you dislike my review hear me out on this.  I don't think this show is bad because it isn't at all modest or subtle or because the content is made to appeal to \" the lowest common denominator\", if that were the case I wouldn't have kept watching to begin with.  While some may find what I say questionable that's honestly not my problem , but as far as \"PROBLEMS\" go, there are a lot.\r\nFirst of all half the show is un-watchable.  Half of the show is white bars of light coveringthe screen during the more sexual oriented scenes.  Sure the light bars are for censoring and I don't necessarily have a problem with that, but it happens so frequently that you wonder why they bothered to add even more scenes that REQUIRE them towards the end of the series.  I don't know about anyone else, but I don't like staring at nothing for (sometimes) almost 3 to 5 minutes at a time, with an occasional face or backside appearing in a shot.\\n\r\nSecond the animation is just piss poor and sad.  I know that this is a fan-service first, story and animation second type deal, but how can anyone get invested into a scene that has little to no detail and cares so little that fulfilling its purpose-- to give the viewer good fan-service--is now apparently too much to ask? Look at other shows like Freezing or High School DxD, which are made for almost exactly the same type of audience, you have to admit those shows look amazing, whether you like them or not.  What is present HERE all looks lazy to me. \\n\r\nThird the story is just so messy and all over the place.  Most of the story makes little to no sense, due to plot holes or things just never utilized.  You may argue that it isn't about the story and to some extent I might agree with you, but the point is the story tries to bring in characters and world building it didn't even need, to somehow try to flesh out the world they don't even do enough to make you care about to begin with.\\n\r\nLet's look at some of the problems that were poorly dealt with within the story as vaguely as possible: \\n\\n\r\n- Okay so there are clans, that are generically called \" Hero\" \" Demon\", whatever, already the story shows me it doesn't care. \\n\r\n- Where do they come from?\\n\r\n- Why do they exist?\\n\r\n- Why were they formed?\\n\r\n- Why are they fighting? \\n\r\n- Why is there little to no history on any of this, when this is potentially important knowledge? \\n\r\n- How does the magic in this world work?\\n\r\n- And what about the curse on Mio that helps Basara gain strength, for reasons? For \"reasons\", you can also be sure that all of that will be hell of useless when plots involved. \\n\\n\r\nSo the answer to all of those questions and why those things do or do not exist are       \"WHO KNOWS?\".  \\n\\n\r\nAside from that it's just pet peeves:\\n\\n\r\nAnnoying catchphrases? (I.E: \" I'll kill you a hundred times\") You bet.  \\n\\n\r\nRandom mood swings from the girls to get the scene more sexual?  Can't go without it.  \\n\\n\r\nCharacters with unexplained purposes or even backgrounds?  Of course, this is borderline hentai, who the hell cares about the world we're trying to create?  Not us.\\n\\n\r\nOverall, feel free to disagree, but there is so much holding this series back. There are some interesting ideas sprinkled here and there, but not a single one of them were represented properly here. The story is pathetic. The art is horrible. How's the sound?Simply forgettable.  Hell I don't even remember a single track, the opening song is an exceptional track however.  The characters, much like everything else, aren't even worth mentioning since none of them have any emotional complexity or defined personality to begin with.   If you're the type of person who is used to expecting more than the bare minimum when it comes to characters ( though coming into this you really shouldn't in the first place) and not just archetypes scattered all over the place..... .....I don't know what to say, just don't expect a miracle.  This is simply put a mediocre show, not offensive, but just not worth anyone's time, not even the most hardcore of ecchi anime fans.  \\n\\n",
            "date": "2015-03-26T15:59:00+00:00",
            "helpful_count": 233,
            "mal_id": 183517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955439.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GhostStorm",
                "username": "GhostStorm"
            },
            "url": "https://myanimelist.net/reviews.php?id=183517"
        },
        {
            "content": "This is the closest harem to Highschool DxD that I've seen yet. That is a plus in my opinion although everyone seems to either hate or like this series. \r\nThe story is rather simplistic but overall interesting to see the relationships between the demons and hero clan. I think there is much more depth to be mined in future seasons. \r\nThe OP and ED are very reminiscent of Highschool DxD in both the style of animation and type of music used. The music is good and fits the show. \r\nThe characters are underdeveloped which is to be expected for a harem that consists of only12 episodes. I think more complexity will be added in following seasons especially with the revelations of the last episode which does hint at a greater depth than previously seen.\\n\\n\r\nI enjoyed this series. It's very humorous and entertaining. The anime is heavily censored which is to be expected. I'm sure an uncensored version will be released eventually. If you like Highschool DxD, give it a try. \\n\\n\r\nStory - 6\\n\r\nArt - 7\\n\r\nSound - 7 \\n\r\nCharacter - 6\\n\r\nEnjoyment - 9\\n\r\nOverall - 8",
            "date": "2015-03-26T13:11:00+00:00",
            "helpful_count": 108,
            "mal_id": 183490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3437971.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DeadlySilvers",
                "username": "DeadlySilvers"
            },
            "url": "https://myanimelist.net/reviews.php?id=183490"
        },
        {
            "content": "Shinmai Maou no Testament... man this show was ALL OVER THE PLACE\r\nOne minute I'm watching and it feels like a pretty darn good action anime...which then falls apart into a mediocre \"comedy\" ecchi harem that borderlines hentai... \r\nSo basically the story is...\r\nBasara is moving into his new home with his newly adopted sisters Mio and Maria. Basara is told by his father to protect his \"sisters\" because they are now family. All seems well until all 3 \"siblings\" discover that none of them are who they appear to be.  Basara and his father are actually exiles from the \"Hero Clan\" and are natural bornfighters whose mission is to stop and destroy evil demons. Meanwhile Mio is actually the daughter of the former Demon Lord, and Maria is a succubus who is protecting her. Basara decides to keep his promise with his father and protect his \"sisters\", which being that Mio is a demon lord's daughter, means that many other powerful demons are trying to get a hold of her. \\n\r\n...Oh! and Maria has Mio and Basara perform a master-servant contract that backfires causing Mio to become Basara's servant, who if she ever disobeys will be overcome with lustful desires until such time that he sexually pleasures her and calms her down...yeah... I know... \\n\\n\r\nAnimation and sound quality aside...which were fine by the way, I thought. Definitely the least of my problems with this show. \\n\r\nMy issue with Testament is it just couldn't seem to decide what it wanted to be. Now there is no problem with mixing ecchi harem comedy with action... but the thing is Testament just did it so poorly, or rather I should say didn't mix them at all. They are almost like two completely separate entities to the same show... I mean here you have an awesome set up to a plot with an actually really great male MC. As a matter of fact I thought character wise he was so good I felt bad that he was wasted in this show. Then you add the concept of Maria being a playful succubus obviously calls out the ecchi in this (if you don't know what a succubus is it's a demon whose powers revolve completely around sex)... but to the extent that it does so and it's reasoning behind it is just completely unjustified. It just seems really out of place... \\n\r\nNot to mention I feel it is extremely necessary to warn you that when an ecchi...or really ill say soft-core hentai scene takes place... be prepared for over half of your screen to be beamed with white or have a ridiculous picture covering up half the screen distracting you completely from whatever was supposed to be happening. Now DON'T BE ALARMED! that's not your computer screwing up, it's just the animation company's idea of \"censoring\". Now I don't know if they did that on purpose for \"humor\"... but it was definitely annoying.\\n\\n\r\nIn terms of enjoyment I would have to split it into two different categories. \\n\r\nAs an action anime, honestly I loved it. I'd give it a 8/10. It had really cool fight scenes with high intensity that really drew me in.\\n\r\nHowever as a ecchi comedy I'd say It was mediocre. 6/10 maybe. I thought all that stuff only took away from the story itself and just distracted me from what was important. \\n\\n\r\nWould I recommend this show? Maybe... depends on what you're looking for. Action? Yes if you can deal with the poor comedy and ecchi parts in between.\\n\r\nEcchi Harem? I mean... honestly no, simply because you won't be able to enjoy it because of the ridiculous censors...",
            "date": "2015-03-26T13:30:00+00:00",
            "helpful_count": 68,
            "mal_id": 183491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4365561.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aubzstein",
                "username": "Aubzstein"
            },
            "url": "https://myanimelist.net/reviews.php?id=183491"
        },
        {
            "content": "It’s quite an achievement to stumble across something so unfathomably bad that you struggle to find the right words to sum up how awful it can be. The okatu-pandering, aimless and empty Shinmai Maou no Testament fits the bill and is the latest offering to leave me speechless for the wrong reasons. It’s a self-insert power fantasy featuring a sad excuse for a cast, the bulk of which whose sole purpose is attempting to procreate with a main character who has the charisma of beige wallpaper. Perhaps the most laughably bad aspect of Testament is that there is an attempt to weave a plot intothe show, because the sole purpose of the events that take place is to force characters into cringe-inducing sexual acts with each other. It’s repulsive. Not a skerrick of Testament is memorable and not one facet of it gives it any redeeming qualities. It is an example of the dregs of what the anime industry has to offer.\\n\\n\r\nShinmai Maou no Testament follows the story of Basara who has two “step-sisters” (you be the judge of that), Mio and Maria, move into his house. When Basara’s father departs overseas it leaves the three alone in the house and who knows what wacky adventures our trio will get up to! There’s more than meets the eye when it comes to the new arrivals and Basara gets caught up in a world of boobs, magic, swords, boobs, heroes, demons and more boobs quicker than you can say “Oh god why did I start watching this train wreck?”. There is honestly little more that can actually be said for the story. Seriously. That synopsis I gave you might actually be myself overselling the complexity of it. Some opposing force shows up against our characters but there’s little to ever worry about because you know that fanservice is number one on the agenda – not story – meaning there is no way the ‘writers’ (a term I’d use loosely) would risk doing anything to put a dint in the harem. \\n\\n\r\nI have no sense of what the characters are even fighting for. There’s some ham-fisted backstory plus a generic ‘redemption’ driving force for our main character. Apparently we’re supposed to empathise with a group of people we know practically nothing about. That’ll work, for sure. \\n\\n\r\nThe solution to every complication is predictable. Literally every female character in the show is eye candy and nothing more. Any attempt at the storyline in becoming more ‘serious’ is instantly cancelled out by a laughable plot point that leaves every female character degraded and at the mercy of our MC’s libido. All Shinmai Maou no Testament does is act as a lowest-of-the-low sexual fantasy that positions men as an all-conquering force, who without women cannot function or find their own sense of direction. It’s demeaning and insulting. Many anime have been guilty of such a thing in the past but this show has found a way to kick it up to a new level. \\n\\n\r\nSpeaking of those female characters, they’re all there to fulfil a particular fetish that exists in the audience. Hair colours, statue, breast size, personality traits – all of which feel cookie cutter and like you’ve seen them 57 times before. The fact that there’s not an inch of depth to them only makes this laziness in their design all the more prominent. Make sure you include the infallible MC to really sell how much effort you put into making something of merit!\\n\\n\r\nI did not have a single positive experience upon viewing Shinmai Maou no Testament.\\n\\n\r\nDo not watch Shinmai Maou no Testament.",
            "date": "2015-12-11T04:53:00+00:00",
            "helpful_count": 41,
            "mal_id": 205239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3966203.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Tozzy",
                "username": "Tozzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=205239"
        },
        {
            "content": "Story\r\nThe story reminded me of High School DxD, i felt it has a feeling to it. in this story there are Demons and Heroes that fight eachother, heroes to erradicate demons and demons enslave humanity, this is where Basara meets a girl in normal circumstances where they are going to be brothers in-law but later on is discovered that this was a lie because she is the Demon Princess and is going to have his memory erased by his other new little ''sister'' Maria who is a Succubus, but turns out to be that Basara has his own secret...\r\nArt & Animation\r\nI liked a lot theart style, really detailed, the color, the bewbs etc.\\n\\n\r\nSound\\n\r\nIt has a great voice acting, great OP, great backround music.\\n\\n\r\nCharacter\\n\r\nThey were very well developed, we go deep on their backstories, i liked Yuki since i saw her, just like Mio and tought Maria was a funny pervert succubus and i liked how the MC Basara is not a wuss in those situations (if you know what i mean) like other MCs and Takigawa was very interesting.\\n\\n\r\nEnjoyment\\n\r\nI really liked this anime, i enjoyed it, i would have enjoyed it more if there wasn't censorship, but yeah i wasn't bored with this.",
            "date": "2015-08-03T02:08:00+00:00",
            "helpful_count": 27,
            "mal_id": 195053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195053"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nThe Testament of Sister New Devil seems like a rather generic anime. And for the most part, it is: there is no shortage of magic, nakedness, and harems within it. But it at least attempts to play with the theme of protection. Which is funny when you think about it; in an anime whose strongest aspect is the very “ecchi” it thrives on, you’d think that “protection” would be the furthest idea from its mind. Regardless, this is what the show hones in on. Protecting the things you love, especially those people dearest to you, issomething that we all do whether we know it or not. And while this one tries its best to flaunt this motif, the majority is mediocrity that suppresses any sense of worth it may have.\\n\\n\\n\r\nSTORY\\n\\n\r\nTestament pits Basara Toujou as the male lead. One day, he obtains two new “relatives,” Mio Naruse and Maria Naruse. As events pile up and paths cross, it’s revealed that Mio holds the greatest demonic power within her, Maria is her succubus servant, and Basara is an exiled man of the Hero Clan.\\n\\n\r\nIf Testament does anything correctly, it is in the “ecchi” service that it provides. While nearly all of it is censored, what is shown and what can be inferred is some of the greatest to grace the medium. The show refuses to hold back; it never shows full-blown genitalia but it gets rather close to crossing that line, making the anime nearly pornographic in its presentation. Not just kissing but make-out sessions; not just showing breasts but fervently fondling them; and not just holding hands but hip grinding, butt squeezing, and even orgasms. Testament revels in the sex that permeates the show, going so far as to make one of its key plot points follow down this path. This plot point of course being the “master-servant” pacts that cause a disobedient servant to undergo immense pleasure. And then, in order to strengthen said pact, going through with these perverted actions “deepens” the relationship, making both people come out for the better. Literal and figurative hot shower scenes, body-on-food eating, a succubus whose proportions grow; the diversity of the “ecchi” scenes and the originality of many of them easily demonstrate its overall execution in the genre it itself made a pact with.\\n\\n\r\nAs talked about in the introduction, Testament’s prominent – and only – theme is the idea of protection. Or more specifically, protecting the ones you love. Many of the characters have this sense of righteousness about them: Yuki wishes to protect Basara, Maria wishes to protect her mother, and Basara wishes to protect everyone. Surprisingly, the show here as well showcases quite the range in relation to its theme. Protecting someone sometimes means doing what has to be done as opposed to what is the right thing to do. Maria’s betrayal to save her mother is an easy example. It may also involve a sense of self-lost protection; Basara, through his actions, protects those around him but makes others incapable of returning the favor. The structure of the series follows essentially three separate arcs, each focusing on one of the main girls and their reason for protecting. The developments therein always lead to the same outcome – Basara adding one more woman to his ever-growing harem – and the actual exploration of the theme isn’t expansive – the morality mentioned previously isn’t discussed nor is there ever any “bad” conclusions – but Testament is at least consistent in its thematic presence from start to finish.\\n\\n\r\nANIMATION\\n\\n\r\nTestament’s art is a testament to boringness. While the protection theme was inching towards the generic field, it’s here where the anime begins to fully find itself in. Many of the locations visited are typical, tried, and tired: a school classroom here, a dark forest there; the anime, despite having all of these characters from various backgrounds, never provides the audience with a look at anything even remotely interesting. And while the “ecchi” moments are top-tier, most of them are sadly censored. Not so much that it is impossible to discern what is occurring behind the miniature caricatures they use to hide it, but enough to make you frustrated that all of the goodness is being kept just out of reach.\\n\\n\r\nThe character designs fair a bit better in comparison to the art style that surrounds them. Sticking to its sexy roots, the women are often clad in such a way as to make their signature assets that much more appealing to look at. Mio’s black-and-white school outfit with long, red hair helps to magnify her breasts that much further. Yuki’s skirt is just short enough to reveal her butt when needed. And adult Maria’s garb is black-and-pink – a sultry combo – that doesn’t leave much room for the imagination. Basara’s design – cuts and scars across his entire body – provides him with the physical evidence needed to demonstrate just how much he is willing to protect those he loves.\\n\\n\r\nWhen looking at the show’s actual animation, it’s a tougher call. The anime can bring its game during certain action sequences, and especially so during the “ecchi” material. But since these are usually seen about once or twice per episode, the majority of what the anime offers in terms of movement is average.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhen it comes to Testament’s cast, many don’t see a huge amount of development. Basara is far and away the weakest character and isn’t an interesting person in the slightest. He’s the super strong, super nice, and super gung-ho guy who exists as nothing more than the leader of the harem. He’s the same from start to finish, seeing only minimal investigation in the form of a small flashback. Meaning, while he exemplifies the theme that the anime focuses on, his actual character suffers through monotony and severe lack of development. The majority of the cast is treated the same way; that is, as not really changing over the course of the season despite having their own “arcs.” Part of the problem is due to the segmentation of the season itself and due to their overall powers. The characters being a trained succubus, a renowned sword fighter, a daughter of the Devil, and a man who is capable of reversing any attack against him are unfortunately written into the corner of “no improvement” rather early on. However, all is not completely lost on the girls, for Basara does aide each of them in becoming a better person.\\n\\n\r\nMaria is a mommy’s girl; she is conflicted given the position she was forced to take, and attempts to do everything on her own. But Basara proves that sometimes, it is necessary to rely on others, because it just isn’t possible for us to do everything by our lonesome. Yuki fights the demons due to her Hero Clan status, but she isn’t blind. She’s honorable, following her own heart when dealing with the situations she faces instead of mindlessly following the “rules” set around her. This thinking was directly inspired by Basara who, as her role model, does the same; fights for what is right as opposed for what is “correct.” And Mio starts off pretty dependent, leveraging other people’s good-will to get her through the day, but still refrains from connecting with anyone too seriously due to her own dark past and familial loss. So through Maria’s guidance, Yuki’s friendship, and Basara’s love, she realizes that she doesn’t have to be alone. In essence, she “opens up” to those around her, becoming closer to those who had been close to her the entire time.\\n\\n\r\nWhile the show doesn’t put too much thought into nearly all of its characters, it still manages to inject a bit of direction when looking at each of their move-sets. In essence, their outward actions symbolize their inner person. Maria uses hand-to-hand combat because she’s very hands on in her dealings with people as a succubus. Instead of fists, Yuki uses a sword that mirrors her personality: sharp, direct, yet extremely elegant. Mio’s fiery magic is easy to see; it reflects not just the immense power she has within her, but also the passion she has for her closest friends. And Basara’s “Banishing Shift,” his ultimate move, defines who he is deep down. That is, his ability to completely give back any move thrown his way matches how much he gives back to others through his constant need to protect the ones around him. The rest of the cast can be looked at in a similar fashion, demonstrating that the anime can appeal not only to our hormones but to our brains, too.\\n\\n\r\nSOUND\\n\\n\r\nTestament’s weakest component is arguably the sound that makes up nearly all that it does. The opening theme isn’t so much grating on the ears as it is just painfully boring. And it knows this; it tries to make it more enticing by adding in faux-nakedness here and there, but the visuals aren’t enough to distract the audience from having to listen to the generic beat and overdone guitar playing. The ending theme is even worse, containing a lot of singing, choirs, and drums that all mash together in such a way that nothing seems to be working. In other words, it’s at this point that the anime’s inability to focus on what it does well – the “ecchi” and sexiness – begins to easily show.\\n\\n\r\nMuch of the original soundtrack contains pieces that are mired in heavy use of “powerful” instruments and group singing, in order to give everything a grandiose feel. It could even be said that the direction of the music is meant to sound “church-like,” given that the anime is entitled after portions of the Bible. At the same time, many of the tracks contain guitars, saxophones, and other, ambient instrumental effects that heighten “the mood” and therefore the sense of sexuality that permeates the anime during most scenarios. There are sad piano pieces for the melancholic times, flute arrangements for the laidback ones, and mysterious string tracks that fill those unknown moments. Unfortunately, like the OP and ED it finds itself between, nothing within the OST is memorable, let alone impactful, making much of what it sets out to do go unappreciated and therefore ends up unappealing.\\n\\n\r\nAnd in order to round it all out, the voice acting for the show is average at best. There are no special shout-outs to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one is all about the “ecchi” content. Being a fan of such material myself, it was definitely a pleasant surprise when the show decided to go as far as they were going with nearly all of its offerings. It was nice to witness not just the daringness of the show but also the uniqueness of the content, contrasting hard with the rest of the generic aspects of the anime. I’m a big fan of Mio, adult Maria, and especially Yuki, so watching them on-screen being lewd every now and again was never a sight for sore eyes.\\n\\n\r\nBut while such promiscuity is very well-done, I never found myself to like anything else. The action sequences are a lot of explosions here and there, the emotional events never moved me, and while it tries to be comedic at times, it isn’t that funny, with maybe an elicited laugh at very specific moments. A large portion of the anime are long stretches where these kinds of developments occur, and when they were going on, I really just wanted it to back to doing what it did best – employing Yuki and the other girls in the “ecchi” antics.\\n\\n\r\nWhile The Testament of Sister New Devil finds itself muddied by mediocrity, not everything within is entirely lost. The sexual content is executed nicely, its theme remains relevant both with the narrative and the development of the characters, and the designs of the girls are enticing to see. But it’s all dragged down by a less-than-stellar main male lead, an uninspired art style, and lackluster music that, when all combined, concocts a show that is simply run-of-the-mill.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, fantastic “ecchi” elements, and consistent yet unexplored theme\\n\\n\r\nAnimation: Fine, boring art style, very nice character designs, average actual animation\\n\\n\r\nCharacters: Fine, Basara is bad, Maria, Yuki, and Mio experience some development, and everyone has purposeful abilities\\n\\n\r\nSound: Bad, lame OP and ED, below average soundtrack, average VA work\\n\\n\r\nEnjoyment: Fine, the “ecchi” is great to watch but nothing else is\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-05-16T13:08:00+00:00",
            "helpful_count": 26,
            "mal_id": 187985,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=187985"
        },
        {
            "content": "WARNING: This review contains spoilers. You have been warned.\r\nAlso, this review is a review for the whole series uptill now (Season 1 and OVA + Season 2 and OVA)\r\nWhere do I even start with this anime...\r\nStory: 2/10\r\nSeason 1: It's been about a week since I've finished this series, so I don't remember the exact story very well. Here's what I know. Mio's (MC) parents (apparently Demon Lords) abandon her to keep her safe from threats and let their friends(?) raise her. Things go on smoothly until some devil finds out that Mio is being raised by someone else. They find out who and kill them.Mio is once again left alone, and runs away, but this time with the help of a newly met servant. After that, she meets a guy who knows who she is and agrees to raise her along with Basara (his son). From then on, there's a nude scene in almost every episode. And don't blame me for getting some parts of the story wrong. I'm a guy. How the hell can I concentrate on the story with the show these 'siblings' put on.\\n\\n\r\nOVA 1: Oh boy, shit gets real here. Basara is invited home by his hot teacher. She tries to seduce him, both get into the bath and you know what happens next. \"But wait Ryan, I am pretty sure I've heard a story like this before\" - You, the reader say. Yes you have. It's the story of every teacher/student porn.\\n\\n\r\nSeason 2: 13 episodes in and I thought I knew what to expect from the series in season 2. But they still surprise you. In episode 7, they have a full-fledged orgy before battle. As if the anime wasn't hentai enough already.\\n\\n\r\nOVA 2: OVAs nowadays exist for fanservice. That's all this OVA was. Except that it was extremely close to being a hentai, as was the whole franchise.\\n\\n\r\nArt: 3/10\\n\r\nSound: 2/10\\n\r\nThe art and animation were pretty mediocre, except in Season 2 and it's OVA. They put little to no effort in animating the Giant Spirits well. And in some scenes in the OVA, Mio's face was distorted.\\n\\n\r\nCharacter: 1/10\\n\r\nI dislike many Harem characters, but this series takes the cake. Every harem has girls trying to seduce the guy. But this one.... it has them butt naked trying to do so. The girls were so dense. Everytime they have an orgy, they call it 'getting stronger'... It sounds absolutely pathetic imo.\\n\\n\r\nEnjoyment: 2/10\\n\r\nOverall: 1/10\\n\r\nI guess this was more of a rant than a review. Anyways, the excessive nudity and borderline hentai in this anime makes it one of the worst anime out there. You would be better off watching real hentai.",
            "date": "2016-04-27T16:20:00+00:00",
            "helpful_count": 23,
            "mal_id": 217310,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960422.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/One",
                "username": "One"
            },
            "url": "https://myanimelist.net/reviews.php?id=217310"
        },
        {
            "content": "\"I can't abandon a girl when people are after her life just because she's the previous demon lord's daughter. I'm going to protect her! But... Am I allowed to have only one precious thing to me? Must I limit myself to one?\"\r\nNo, that's not me pretentiously attempting to attach some meaning or something -- Those are a few lines of dialog that summarize Shinmai Maou no Testament. It's all you need to know about the show, as it is about just as much as the show cares to let us know. \r\nSo yeah, Shinmai Maou no Testament is another harem whose sole purpose forexisting is to fill out a time-slot. A show that makes you wonder if the people behind the scenes are engaging in copyright wars from making such an uninspired amalgamation of several elements from other shows put together to make the same harem you've seen a dozen times over. It's so lacking in creativity that it uses the \"I accidentally walked into you when you're undressed\" cliché four or five times. -- said shows that come to mind are: Inuyasha, Bleach, Highschool DxD, and perhaps Tokyo Ghoul for Takigawa, Yahiro and it's EDGE. \\n\\n\r\n\"Basacchi\". Oh lord, pls no. \\n\\n\r\nBasara is your typical self-righteous \"hero\" devoid of personality; an indecisive, apologetic asshat, whom let's himself go wild on the girl's tits when he damn well pleases. When his sexuality reaches points where it can be brought under question, he gives in to his urges then he seeks to be comforted by said tits from having gone too far with his manhandling. By the shows end he's only a few notches away from being another despicable Itou, Makoto. If only. If only that would have actually been the case, at least he would have been less forgettable. All the girls in the show line up to feed the ego of whomever uses Basara as their surrogate. They exist just to get their breasts fondled or consistently refer to him as \"onii-chan\" or \"B-baka\". \\n\\n\r\nA little too delusional, but not to the point of aggravation. \\n\\n\r\nMost of the ecchi is constricted to a single gimmick — the partner binding spell crap — the rest pretty much revolves around it. The art design is easy on the eyes, yes, but still quite forgettable. And while surely not tame, the ecchi is presented in a very boring fashion.  Though it may \"look\" nice, it still might as well be some dude in an ad testing Tenga products. Or perhaps sadder still, are the junkies who will rush in to buy the blue-rays. \\n\\n\r\nAs for the sound or even action? Nothing stands out, everything about this show just screams \"routine\". ...You might be familiar with a seiyuu who I believe goes by the name of Nomura, Kenji. You know, in bleach, that hot headed bulky bald bitch of a subordinate that follows Ulquiura? Well, Kenji plays that same bulky bald bitch here, same powers and everything, except skin tone. He suddenly appears out of nowhere for a fight and is just as briefly tossed aside so that Basara and galls can go back to breast fondling. *sarcastic cheerful claps* He stacks up a grand total of 5 seconds of screen time. Talk about pointlessly anti-climatic. \\n\\n\r\nInitially tolerable even with the rather harmless tonal shifts, but then it becomes increasingly irritable as the series progresses from schizophrenic harem to obnoxious shounen.  \\n",
            "date": "2015-04-03T21:43:00+00:00",
            "helpful_count": 18,
            "mal_id": 184670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1226209.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Gotanon",
                "username": "Gotanon"
            },
            "url": "https://myanimelist.net/reviews.php?id=184670"
        },
        {
            "content": "How to easily earn money without putting much story into it:\r\nStep 1) Make your anime with a shit load of ecchi (this anime is borderline hentai) and put harem in there.\r\nStep 2) ??????\r\nStep 3) Profit.\r\nStory: 6/10\r\nThe story isn't that original, mainly because I've seen other successful ecchi anime that have this story. Not only was the story unoriginal, but they also made the anime before Highschool DxD BorN's first episode. Though, a lot of people do enjoy these types of stories (mainly because of the fan-service and harem, duh) and personally I do too, but without too much fan-service. The ecchi was basically borderline-hentai andoverdone. If you want to watch ecchi, you might as well just watch a hentai. The action was actually quite decent, because the main character had a special ability. I do wish that the dad had more screen-time, because he's a total badass. The anime doesn't just start with a massive harem, but it starts to progress throughout the anime.\\n\\n\r\nArt: 7/10\\n\\n\r\nTo me, the art looked like it was illustrated back in 2006 and someone found them in the drawers and decided to make that into an anime in 2015. Though, the animation was quite smooth and one thing that bothered me was how similar Issei and Basara looked a like. Mio looked a bit like Rias, but  Mio looks younger. Also, there was one part where they censored a FUCKING TONGUE-KISSING SCENE. What the actual fuck? \\n\\n\r\nSound: 7/10\\n\\n\r\nThe OST was quite nice, sometimes it made the scene epic or made it more sad (or even more erotic). It fit the scenes nicely and wasn't overused or loud. I actually liked both OP and ED, but the OP more so than the ED. The OP is rock mixed with piano that fit the theme of the anime. The ED has a very calm and happy tune mixed in with rock. The episodes I didn't watch had subs for the ED but I'm sure they were talking about dreams and love (also, the ED animation had titties without nipples. If you're putting titties at the end, then you might as well either censor it or put nipples on it, or else they look like some hybrid alien.)\\n\\n\r\nCharacter: 5/10\\n\\n\r\nToujou Basara, the hero and the protagonist of the story. A very cliche character for a harem anime. If you're a hero and the protagonist, then you're likely to have 5 million chicks sucking you off every minute. Basara is a man who does anything to protect his 'sisters', thus making him a very kind person. As the anime progresses, he gets stronger. '\\n\\n\r\nNaruse Mio, the soon-to-be Demon Lord. Well well well, another cliche character. I've seen a lot of anime where the demon lord and the hero aren't fighting each other. In fact, sometimes they both fall in love with each other. She relies on Maria a lot, thus making her weak, even though she's a Demon Lord. Sometimes, whenever she's enraged, she does use her real strength. She grows much more attached to Basara as the anime progresses. Mio is really fucking useless though.\\n\\n\r\nNaruse Maria, the loli-succubus. Aren't succubus supposed to have the desired body to attract male?? Why does Maria have a childish figure? Maria is a very strong and helpful character, fighting along side Basara to fend off against enemies, whilst protecting Mio. She likes to tease Basara a lot when they're both alone.\\n\\n\r\nNonaka Yuki, the female hero and the childhood friend of Basara.  Yuki is very attached to Basara and has a lot of feelings for him, to the point where she hugs Basara on their reunion. She is ok in combat, at least not making herself useless. \\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nThe story was unoriginal and the characters were eh, but I still enjoyed this anime somehow. Even though half the time I was watching this anime there were white lines censoring the sexual activities, it was still ok. I enjoyed the actions scenes quite a bit.\\n\\n\r\nOverall: 7/10\\n\\n\r\nIf you're planning on watching this, then please watch to the very last seconds of episode 12. After the ED, it's pretty epic. Would I re-watch this? Well, season 2 has been confirmed and if I like that, then maybe I will.\\n\\n",
            "date": "2015-04-10T07:13:00+00:00",
            "helpful_count": 17,
            "mal_id": 185294,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=185294"
        },
        {
            "content": "According to me, this is High School DxD on steroids. Don't get me wrong, I really like High School DxD. But I like this one better. Why, you ask?\r\nStory is okay. It makes more sense to me than the HS DxD one. There are demons, the demon world and the hero clan. The MC is from the hero clan, and his dad has once been known all across the world as the \"god of war\" and feared like that. And out of the blue, he tells him that he got with a new woman and that she has two daughters and now he has twosisters. Tell me whatever you want, but that's a more \"believable\" story than DxD one.\\n\\n\r\nAnyway, the MC is like Issei, but gets way more ass than him. Be warned though that unlike DxD here ---- there is censoring. I hate this anime for that and I've read that others hate it too. For a good reason. That's the one part I feel they made a critical mistake.\\n\\n\r\nThere is more action, WAY more ecchi and *cough* bdsm. I loved it.\\n\r\nWay way way more than in DxD. I know, I shouldn't compare the two\\n\r\nbut IMO I like both the female lead and the male lead way more than\\n\r\nDxD and they are very similar. I like Mio way more than Rias. That's just me.\\n\\n\r\nThe sound is great, the art is great. Hell, just watch it and figure it out.\\n\\n\r\nFYI, there is season 2 coming in october I believe, so fear not there is more coming. Hopefully without censoring, but don't hold your horses.\\n\\n\r\nI recommend it, especially after you watched Highschool DxD.",
            "date": "2015-04-04T12:49:00+00:00",
            "helpful_count": 15,
            "mal_id": 184726,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=184726"
        },
        {
            "content": "Story: 5/10\r\nBoobs. That's like the only thing that really POPS in my mind after seeing this anime. So guys... if you like that sorta stuff, then watch it cause trust me you'll  be seeing a LOT of it. And if you don't like that kinda stuff, then you're in luck! There are two versions of if online. One is censored and one is uncensored (ep. 1-6, ep. 7-12 as far as I know, still aren't uncensored). Although when you're watching it censored, I hope you like looking at white bars cause that's one of their censoring methods. But anyways, the story. It's really notall that special. The story starts off slow and once it picks up it sorta just goes nowhere. Much of the story it seems happens in Basara's (main character's house), an area outside near Basara's house, or at school and very rarely does it deviate from those places. Sure occasionally there would be some plot twist that arises like a traitor within the group, but it was never like \"omg what is this?!?!\" shocking and in the end everything would somehow turn up all peachy. All in all bland and boring.\\n\\n\r\nArt: 9/10\\n\r\nWell there's nothing wrong here. The fights looked nice, especially with the details that was put on the magic circles when there was magic being used. And honestly the only things that was really needed to sell this anime (boobs) was drawn out well. No real complaints here.\\n\\n\r\nSound: 8/10\\n\r\nThe sound was alright. There's nothing really memorable about the soundtrack, but it wasn't bad. There are sometimes where there are two conversations going on at once and one is overpowering the other so you can't hear it. \\n\\n\r\nCharacter: 3/10\\n\r\nOk. To give you an idea of how original these characters were, let me just tell you that watching Dora would be more enjoyable. Every single thing is so cliche for an ecchi/harem/hentai (borderline) anime. Basara's just another main character that wants to protect everyone he cares about and the three girls that become his \"buddies\" (wink wink) are in total love with him because of that. And to top it off, every single one of them is as perverted as the last. It's really quite boring watching them.\\n\\n\r\nOverall: 4/10\\n\r\nTo be honest, I was so close to dropping this anime. I kept thinking \"oh it'll get better\", but it never did. The only reason I didn't was because I'm trying to never drop an anime. There were so many times where I just had to roll my eyes because Basara was talking about how he really wanted to protect his family or something cliche like that.",
            "date": "2015-06-25T12:45:00+00:00",
            "helpful_count": 13,
            "mal_id": 191237,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554963.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/King_Of_Light",
                "username": "King_Of_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=191237"
        },
        {
            "content": "Just read the review...\r\nSTORY\r\nIf I were to guess at first, this show is basically a HighSchool DxD clone. Down to the presentation, character design and, to some extent, the storyline.  As such, Shinmai Maou no Testament basically includes devils, a harem for the MC, and the obligatory fan service.\r\nI would be lying if I say that I didn't enjoy the show it its entirety, there were some aspects of the show that were noteworthy at most. But overall, the story is just generic, bland and predictable. The fan-service, though obligatory in this kind of anime, does somewhat annoy me. There are even scenes that'sjust borderline hentai! Speaking of which, I can't really blame the producers of the show of the amount of hentai present, since it is an 'indirect' element in the story. There are some decently presented fight scenes, but that alone just can't put this show in good light.\\n\\n\r\nCHARACTERS\\n\r\nI don't know if it's the author's intentions to base of the show's characters to that of High School DxD, down to their designs. Either way, the characters are flat and are nothing really noteworthy, except for the fact that it's really similar to that of High School DxD's.\\n\\n\r\nAESTHETICS AND AUDIO\\n\r\nThe visuals for the show are decent, to say the least. The characters are designed nice and the animation is mostly good. Overall just great.\\n\\n\r\nSame goes for the soundtrack. It complements well into the scenes, but on it's own, it's rather bland if not forgettable. Voice acting is also decent, fitting well into each respective character.\\n\\n\r\nCONCLUSION\\n\r\nI mention High School DxD numerous times in this review because that's the overall impression I had before and even after I watched Shinmai Maou no Testament, but to the lesser extent after watching since it has some originality. You won't find any serious storyline and interesting characters, but for what it is, Shinmai Maou no Testament is a show that exists to entertain to people for its content. And I even admire it for having planned a second season.",
            "date": "2015-05-03T08:27:00+00:00",
            "helpful_count": 13,
            "mal_id": 187035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JonBort",
                "username": "JonBort"
            },
            "url": "https://myanimelist.net/reviews.php?id=187035"
        },
        {
            "content": "For the past couple years, the idea of Ecchi has changed dramatically, and what anime is allowed to showcase over the course of their runtime.  As the years went on, the idea of what is ecchi and what is hentai has been blurred to the point of almost crossing over into one another.  And here, I believe that we have an example of that right here.  Here it is, a review of Shinmai Maou no Testament, or The Testament of Sister New Devil, a show that I believe, like many others, could've done better as hentai.  \r\nStory (6.11/10): The story ofSister Testament as I call it, follows the life of a boy named Toujou Basara, a boy who has a father who is remarried, gaining two little stepsisters in the process.  However, not is all that it seems, as it is later revealed that the two \"sisters\" that he now has is the budding demon lord, and a succubus.  In addition, Basara is hiding his own secret, hiding the fact that he is from the hero village, a place where they regulate the demons of the world.  With the two sides now coming together, what challenges will they face with demons seeking the demon lord's power?\\n\\n\r\nAt first glance, sister testament seemed to be a little bit more than what the synopsis led one to believe.  The first episode wows you and honestly, surprised me with a complete 180 on the show's comedic feel by putting in an action scene that made me for a moment, rethink the entire series altogether.  It was that value of shock factor that really made me think for a moment that this was going to be a good show, and that I was in for one hell of a ride.  Quickly though, that idea became less and less prominent as the holes began filling up with regret rather than joy.\\n\\n\r\nWhile not only a series about action and the conflicts between protecting the new demon lord, Mio, Sister testament proudly shows itself (quite shamelessly might I add) to be an ecchi show in the worst possible way.  In the show, there is a technique or plot device known as the \"succubus curse\", where one person becomes the \"master\" over the other, allowing the two to become bonded and grow stronger together.  This one little detail manages to completely screw over the show plain and simple.  Because this plot device exists as the basis for the show, the actual plot for the series I feel becomes jaded more than anything.  Basically, the show makes it so that character strength is equal to the intensity and frequency of any kind of sexual act (as pointed out by the show's own characters) which can lead to, well...you get the idea.\\n\\n\r\nThe biggest flaw that I felt about this series was just purely about how frequent and how starkingly intense this show's ecchi moments actually were.  They were done in such a way that they had to do a Tokyo Ghoul-style censorship involving censor bars that basically blocked so much of the screen that you can't see anything, and above all, made any sense of the actual storyline completely disappear.  In this show, it seemed like the perverted moments took priority over anything, and for a show that actually seemed to have a decent plotline and story elements, it just really felt disappointing cause all of that stuff that makes a good anime is put in the trunk.  (Not in the backseat, the trunk.)  In terms of actual story, the progression was moderately well done.  Because of just how often you'll see fanservice, ranging from a casual stripping of the clothes to full-on foreplay, the story won't come as often as one might think, and just isn't fleshed out as well as it should've been.\\n\\n\r\nOverall, sister testament just failed to be any sort of proper story.  Because of its way of \"getting more powerful\", the show showcased sexual foreplay more than anything, making that the first thing anyone thinks of whenever they talk about this show.  In fact, I strongly believe that this series could've done better, and should've been a hentai more than anything.  In the end, the story suffered a lot from the show's \"other half\" and would've done better had it not had the amount of fanservice that it did have.\\n\\n\r\nOverview:\\n\r\n+  Decent story idea\\n\r\n-   Story suffered greatly\\n\r\n-   Fanservice overpowers the show GREATLY\\n\\n\r\nCharacters (5.55/10): The characters in sister testament similar to the story, don't really feel as fleshed out as they possibly could've.  Rather, each one of them except a couple few don't get what they should've gotten.\\n\\n\r\nFirst, we have Toujou Basara, our harem/main protagonist of the series.  As a member of the hero clan, Basara has the ability to summon down a weapon that he himself can wield, and uses it to fight the demons if need be.  Basara is more or less your standard harem protagonist.  While he does get a sort of backstory to explain his overpowered ability (cause every harem protagonist these days is either useless, or OP), Basara follows your cookie cutter troupe of the \"nice/good guy.\"  Even though the girls he now lives with deceived him, he, throughout the series, makes a VERY conscious effort to protect them as their older brother.  (Even though that idea becomes completely redundant and useless by episode 2.)  He gets nervous in ecchi moments, he tries to protect his loved ones, you get the shtick.  Moving on.\\n\\n\r\nNaruse Mio is the main female protagonist in this series, aka the tsundere (cause main girl ALWAYS is one)/damsel in distress/one with the big breasts.  As the upcoming demon lord who had her throne taken after having to run away when her father was usurped, Mio serves more of the Zelda/princess Peach character of this series because she very often can't fend for herself, relying more on Basara for that job.  Since Mio follows the tsundere troupe to a certain degree, there really isn't much to say about her since it's such a stale troupe.  \\n\\n\r\nApart from these two, we have the succubus character, Maria, who is both one of the better characters in the series for having some slight character development, and the ultimate reason why this series went down the drain so fast.  (That's cause the curse was suggested and inflicted by her, ergo, it's her fault.)  In addition, we also have Yuki, the character who serves as the childhood friend of the MC with a stone cold face, as well as Takamine, the one character who I thought was really the only shining glory in this cast of tired, old troupes regardless of how little he shows up.  \\n\\n\r\nIn the end though, the cast of characters for Sister testament were more like a troupefest more than anything.  Characters aside from the ones I have already mentioned barely get any substantial screentime, so there's not much to mention there.  Because of this, aside from Takamine, the characters in this show really aren't anything special aside from being called what they are, troupes.  \\n\\n\r\nOverview:\\n\r\n+  One decent side character\\n\r\n-   Tired anime troupes for characters\\n\\n\r\nArt and Sound (6.50/10 and 7.00/10): The art for this series isn't really much to write home about.  There really isn't any standout animation for this series aside from maybe the magic casting circles, and the series overall doesn't really have much of an impact art-wise.  \\n\\n\r\nWhat the art does have an impact on is simply how much of the series you can watch.  Because this show is so ecchi centered, the show wants to tell you that, a lot, like at least ten minutes per episode.  As I have mentioned before, the fanservice in this show is REALLY fanservicy to the point of it actually being sexual foreplay and should be considered hentai more than anything.  Yes, my dear readers.  This isn't ecchi, this...is hentai.  And because of this, the show as of right now blocks any form of watching it because you get censors, flashes of light, and darkened areas that essentially cover up the whole screen, not allowing you to witness of what is going on behind the chibi versions of the characters.  Because of this, watching this show can be quite frustrating because half of the time, you won't even get a clear picture as to what is going on.\\n\\n\r\nSound for me was a sort of solace for this series, as we have Sweet Arms make the opening for this series, which is a track that I feel like was rather good.  While the show that it was tied to isn't really all that good, the opening itself is actually a rather good and actually somewhat memorable.  Of course, upon mentioning this, the rest of the soundtrack is mediocre at best and really doesn't stand up too much.\\n\\n\r\nOverview:\\n\r\n+     Good Opening\\n\r\n+/-  Standard animation\\n\r\n-      Ecchi.  (Normally, I don't complain all that much about fanservice, but this is just simply too much.)\\n\r\n-      OST didn't stand up on its own\\n\\n\r\nPersonal enjoyment (5.00/10):  While I admit that I was wowed in the first 23 minutes of the series, the next 5.5 hours didn't really prove to be anything that I would bother rewatching or care for.  As the weeks went on, I was more disappointed in this show than anything because without all of the foreplay, this show actually could've done really well.  It had groundwork that it could've used, and a curse that was more of a curse on the show more than anything.  \\n\\n\r\nWhat did I like about this show?\\n\\n\r\nIf anything, it would have to be 1.  Takamine (cause honestly, he's the only character in this show I give a damn about).  And 2.  The action sequences.  While the animation was standard at best, the action sequences managed to for a moment, forget that you're watching a show that about a guy molesting his stepsisters (wait a second...that sounds familiar.), but rather one that also centers around the idea of action and heroes vs. demons, to some degree.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nThe bland characters and the execution were really some big issues.  The story was never fleshed out enough for it to be different than any other hero vs. demon story, and the idea of the damsel in distress was really more of a bore than anything cause it just added another member to the useless female group, a group that we seriously don't need to add more characters into.  Above all though, I have to say, like what I've been saying this entire review, the fanservice by far is the worst thing to come out of this series.  Not only is it prominent, so prominent that it's both ruined the story and my viewing experience, but because of the way it's presented, you probably won't be able to see it until a blu-ray release.  \\n\\n\r\nWould I recommend this show?\\n\\n\r\nHonestly, I feel like this show is a waste of time.  Throughout its runtime, there wasn't anything that stood out.  The story wasn't made to be interesting enough, the characters were bland to all hell, and there wasn't anything fantastic aesthetic-wise.  Because of how strong the fanservice was, there really wasn't much to make note of, thus creating this series' downfall.  (I still don't know why they're making a second season.  It boggles me.)  If you want some hentai-esque material, go ahead and watch this.  Make sure to get the DVD uncensored version because if you're watching for ecchi, I can guarantee that you that as of this review, you won't be able to anything but censor bars.\\n\\n\r\nOverview:  5.00/10",
            "date": "2015-03-25T22:13:00+00:00",
            "helpful_count": 11,
            "mal_id": 183404,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=183404"
        },
        {
            "content": "(reposted because I apparently forgot to update my episode count to show as complete. Derp)\r\nTL:DR: Testament of Sister New Devil is ecchi at its most ecchi & not in the least bit ashamed of it. It's the kind of show that validates every criticism & concern non-ecchi fans have of the genre & non-anime fans have about Japanese cartoons in general. But aside from that, it's pretty fun, albeit in a masochistic, I can't believe what I'm watching but I can't look away kind of way. Not to be watched with other people in the room...or within hearing distance.\r\nBoobs. If there is one thing teenageboys &amp; lonely authors love, it's boobs. Boobs can be big; they can be small; sometimes they're not there at all. But one thing is for sure, where there are women, there are boobs. &amp; where there are boobs, there are good times to be had.\\n\\n\r\nOur story begins with one Basara Toujou. For reasons that don't matter, he is accompanying his father to a restaurant to meet his two new stepsisters, yet only one of them seems to be waiting at the table. Needing to pee, he excuses himself &amp; makes his way to the toilet, where he shockingly encounters a busty red head mid business. As you would expect of someone whose just been walked in on while on the toilet, she makes to scream, &amp; being a male of strong character &amp; morals, he does the reasonable thing of pinning her against the wall to stop her doing so, for fear that they might cause a scene in a public place.\\n\\n\r\nIt only gets better from here.\\n\\n\r\nTo cut a long story short, said red head is by hilarious coincidence his other new stepsister. Only they're not really his stepsisters, as that was just a story contrived by his father for no reason. In fact, red headed Mio is the daughter of the recently deceased Demon Lord &amp; is on the run from those within the Demon realm who want to capture or kill her for her power. Maria, her loli goth companion, is actually Mio's succubus bodyguard. A rather pointless attempt by them to get rid of Basara reveals him to actually be a Hero, the enemies of Demons (but in that yin yang kind of way where they're more concerned with keeping each others powers in balance than defeating each other) with magic powers of his own. This awkward business out of the way, it's time for the show to get what it's really about, a guy &amp; several girls who all insist on calling him onii-chan while the line between ecchi &amp; hentai gets pushed to its limits.\\n\\n\r\nYes, Testament is one of those shows that, to put it in a sentence, basically takes the setting, characters &amp; general plot of High school DxD &amp; sets about seeing how far they can push it before the censers tell them to go straight to DVD. The story is your basic angels (heroes) vs demons affair with the main characters caught in the middle while they just try to live normal teenage lives. The characters are barely worth mentioning for anything but their aesthetic qualities. In addition to the main trio, we also have Yuki, Basara's aloof childhood friend who apparently hasn't been talking to him until now but boy is she going to be a third wheel in his &amp; Mio's \"romance.\" Takigawa fills the role of the one other male character who isn't a one episode antagonist or parent. Would it surprise you to know he likes talking about girls? Actually that's selling his character a bit short as he does play a more significant role in the story that most token guy friends do in anime. Oh &amp; I guess there is Basara's aforementioned father, but he makes his excuses to leave his son alone with Mio &amp; Maria in the first episode so we need not mention him again.\\n\\n\r\nBut lets face it, we're not here for the characters or indeed the story. We're watching for that other kind of “plot” that hides behind clouds of steam &amp; light beams, &amp; boy does Testament have that in spades. One of the more contrived ideas introduced early on is the master – servant contract Maria convinces Basara &amp; Mio to sign in the second episode. Nominally, the idea is that it will let them know where each other are &amp; help them both get more powerful, but there's a sexy twist. You see, because Maria's a succubus, &amp; because the contract goes a bit wrong &amp; makes Basara the master (they never actually properly agree to the contract, but lets not sweat the small stuff), Mio now finds herself cursed to go like your mum did at fraternity parties whenever she thinks mean thoughts about him. The only prescription for this fever, it turns out, is for Basara to molest her repeatedly. He doesn't want to, of course, but his manly man duties as both a male &amp; her brother (seriously he makes that point about them being family a lot) mean he has no choice but to grope &amp; grapple with her cleavage until the curse is lifted. The first time this happens, we fade to black (with many a “no onii-chan” screamed) only to see Maria cleaning up a puddle on the floor while commenting about how many times Mio came. 10/10 IGN best plot ever.\\n\\n\r\nThe show feels like it's constantly trying to one up itself as its ecchi scenes come ever closer to crossing into hentai as the series progresses. Yuki, naturally given this is anime we're talking about, upon learning about the contract between Basara &amp; Mio decides she wants in on that too. So once again poor old Basara has to go through the oh so unhappy job of finding her erogenous zone as well. In case you were expecting it to also be her breasts, more fool you. She's relatively flat chested you see, but she got da booty &amp; that's where the booty be stowed, so to speak. You can imagine how little of that scene was viewable. Weirdly (or not), Yuki signing a contract with Basara is not so much a source of jealously to Mio as it is the start of Mio &amp; Yuki becoming friends, or at least frenemies, I guess due to their both being in bondage together. Porn logic, I guess. &amp; if you were worried the final episode might try to take the high road, fear not. I won't go into details, suffice to say we get hentai's favourite motif: sexual assault that turns into consensual fun times because she totally wants it, really.\\n\\n\r\nIt's hard for me to really explain what watching Testament is like. The best I can come up with is that it's a bit like reading The Tale of Scrotie McBoogerballs from South Park. The ecchi scenes are so...well ecchi &amp; so creepy that it's impossible to watch without audibly groaning in discomfort. Yet watch I do, cursing myself for it but doing it all the same. It isn't erotic in any sense, although I think it's supposed to be &amp; I might think it was if I was 14 &amp; hadn't discovered internet porn yet. The censorship is pretty heavy, as you'd expect, &amp; pretty in your face about it, especially after the first few episodes when they introduce chibi versions of the characters to cover up the goods. Some people may find that annoying but personally I actually prefer that kind of censorship. It's funny to me when the makers pretty much cock-block the audience with a “buy the Blu-Rays, perverts” chibi stamp. It's not like you don't know what breasts drawn by someone whose never seen a real pair look like, anyway.\\n\\n\r\nOf course you don't just want to know what the show has, but how it looks. Well the art itself is pretty good, if nothing beyond standard. I have seen others comment on characters going off model at times but tbh I've not really noticed it yet. What I have noticed is that the overall animation quality is pretty poor. Jerky movements, apparent jumps between key frames with no in betweens, reused footage &amp; other little things occur with enough frequency to make me question the editorial skills or resources of whoever was in charge of proofing everything. It stands out in particular when compared to the opening animation, which is surprisingly well made, with smooth character movements &amp; a rare sight of characters slowly rotating without looking jerky or weird as their perspective changes. It is perhaps unfair to compare an opening credits sequence with the show as a whole, but the difference in quality between them is noticeable.\\n\\n\r\nSo there you have it. Thus far (&amp; I don't expect anything to change) Testament is an ecchi for the sake of ecchi high school fantasy with no real redeeming qualities beyond cheap titillation &amp; attempts to push the boundaries between what is &amp; isn't allowed on TV. That it's the most popular new show of the winter season according to Crunchy Roll doesn't fill me with confidence of the anime fandom, but then again shows like this have been bizarrely popular since at least the 90s, so it's not like its anything new. It doesn't try anything new but it also doesn't ask its audience to think with anything but their genitals, which makes it pretty easy viewing if you can switch your brain off enough to get past the really creepy when you think about it context to a lot of the ecchi stuff going on. There's much better ecchi shows out there, but you could do worse than watch this one.",
            "date": "2015-03-27T17:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 183660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4095221.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lancehot",
                "username": "Lancehot"
            },
            "url": "https://myanimelist.net/reviews.php?id=183660"
        },
        {
            "content": "This anime is very similar to Highschool DxD. My review might be biased because I loved Highschool DxD, but this anime fulfill my beliefs. As a Junior in High School, I can tell you that this anime is the best. The main characters are really well developed and viewers get to see each characters background. The second season to this anime fulfills that even further. The battle scenes aren't that bad, and the music isn't half bad. I liked the animation quality because I found it to be fluid. The story is similar to DxD and the Enjoyment is definitely there. Overall, to me thisa 10/10.",
            "date": "2018-12-07T08:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 295385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7361363.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SunnyB0y",
                "username": "SunnyB0y"
            },
            "url": "https://myanimelist.net/reviews.php?id=295385"
        },
        {
            "content": "Shinmai Maou no Testament is definitely an interesting series. Evidently, a range of inconsistent reviews render it to the category of \"you either hate it or love it\".\r\nThe overall story is simplistic at best. The character development offers nothing unique; a hot red-head is presented as the primary love interest, a long lost childhood friend is introduced almost immediately after, former enemies develop feelings for the main character, and so on. Most of these clichés are now well-established fragments of the harem genre. \r\nThe battle scenes are not exactly terrible, nonetheless they offer nothing special. The overall animation and sound quality are also quite ordinaryand not memorable.\\n\\n\r\nWell then, it begs the question; why is an average, mediocre series rather interesting? Bluntly speaking, the sexuality in this series is beyond over the top – make no mistake, if you happen to be watching the uncensored version, the ecchi and fan service scenes turn into borderline hentai. I found myself questioning whether I was watching an ecchi/comedy or hentai on numerous occasions. Further, the show takes itself very seriously into catering the “step-sister” fetish. By the 3rd episode, I realised it was a guarantee that a serious scene will be followed by “onii-chan I need you touch me” scene.\\n\\n\r\nAnd this reviewer feels the poor juxtaposition of such two scenes is the downfall of Shinmai Maou no Testament. The willingness to push into hentai boundaries leaves little in the comedy to be desired. The attempt to connect the sexuality into the story is rushed and poorly executed. Granted, the story is neither thought-provoking nor original, however at least the comedy could have been much better appreciated overall if the show didn’t emphasize the “I must pleasure my sisters” element so seriously. \\n\\n\r\nNevertheless, much of the series is entertaining enough for harem/fantasy fans. If you can tolerate borderline hentai, I would encourage you to check out at least the first 3 episodes and see the interesting juxtapositioning for yourself. \\n\\n\r\nFor what it’s worth, here’s a summary:\\n\\n\r\nDO WATCH IF:\\n\\n\r\n- Enjoy watching a likeable MC slowly acquire a harem\\n\r\n- Enjoy demon – fantasy settings that are not gloomy but rather comedic\\n\r\n- Interested to see an ecchi series pushing the borders into hentai",
            "date": "2015-11-25T00:11:00+00:00",
            "helpful_count": 9,
            "mal_id": 204140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4914587.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/cTilki",
                "username": "cTilki"
            },
            "url": "https://myanimelist.net/reviews.php?id=204140"
        },
        {
            "content": "Shinmai Maou no Testament - or the Testament of SIster New Devil is another one of this season's battle harems. With focus on powers, ecchi and girls, this is the typical classic harem, just better. Definitely recommended for everyone who likes a good story.\r\nStory: 7/10\r\nSurprisingly, this is one of the stronger parts of this show. While many harems tend to have a very brainless story, the plot is just secondary and mostly disappoints. However Shinmaoi Maou manages to introduce quite a lot of interesting plot twists and introduce mysterious characters masterfully, while still keeping faith to the usual harem tropes. It also set a goodbasis for the second season. Sadly, the big picture of the storyline remains predictable and a tad generic.\\n\\n\r\nArt: 9/10\\n\r\nWhile mainly used to animate boobs and censor unwanted body ares, I was pleasantly surprised by the art style. Especially the MC and his father had some badass looking scars and overall style. The enemys and monsters aswell were quite an improvement from certain other shows who decide to simply not animate those. Ecchi is all censored, but imagination is the best artstyle amirite?\\n\\n\r\nSound: 8/10\\n\r\nWith fitting male voices, good battle music and really good OP, this department also did their work. I didnt quite like the battle effects and the exaggerated moaning, it mostly felt unnecessary and out of place.\\n\\n\r\nCharacter: 9/10\\n\r\nWhat? A harem gets 9 in character? Yes, its true. For the first time ever, we have a quite intelligent and not just plain dense MC who annoys the hell out of us, he actually takes the initiative and gets to town himself. THe girls of course are simpler, but more independant and powerful than what you'd actually expect.\\n\\n\r\nEnjoyment: 10/10\\n\r\nYes,I love harems. But this show has so many good things. We finally see some damn villain die, we see an MC that does dirty things with his harems and we get the feeling of a more natural approach to the whole ecchi theme. Of course, in the censored version we get to miss a lot of the interesting things - if you know what I mean - but as soon as the blu-ray is released this will turn to the better side. \\n\\n\r\nOverall: 8/10\\n\r\nHonestly, a quite funny and well done show who's also suited for a non-harem lover. While this may not apply to everyone, I'd suggest waiting for the uncensored version - like with Highschool DXD, while its pointless, it somehow just makes it better.\\n\\n\r\nThe next season is gonna start in october, so I'd suggest everyone to have watched it until then - with an appearant high budget and big fandom, we can only expect that the second season is even better!",
            "date": "2015-03-26T12:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 183486,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4221129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Urbanophiler",
                "username": "Urbanophiler"
            },
            "url": "https://myanimelist.net/reviews.php?id=183486"
        },
        {
            "content": "Gods I don't know why I watched this anime as long as I did... I probably would've dropped it so SO much earlier if it weren't for the amount of censoring that was in it... The problem is that with anime like No Game No Life (which is still fairly ecchi without going over the top... might be a bit of a stretch to say) and this being the same rating on here (R+ Mild Nudity), I was going in expecting not to have the shock that I actually got...\r\nThen I realised how f***ed up this anime actually was around episode six or seven... I'mone of those people who impulse skip certain moments to forget that they ever happened, so it took me a while to realise how many moments I was impulse skipping before I went 'okay, this is over the top.\"\\n\\n\r\nThe story starts out with a premise that tries to be unique, but, when I look back on it, it really was quite f***ed up to begin with. Extremely awkward moment where the two main characters meet (And like Leonard from the Big Bang Theory when meeting Sheldon for the first time, this should have been my first warning to how the anime would go.)\\n\\n\r\nI will admit that the story was interesting. A runaway demon lord, a hero exiled from his village, some people on both sides who don't want them to live in peace... Sounds familiar, but the execution was done poorly. There is a different anime that has a similar plot that is much more interesting. The main detraction from the story has to do with the fact that one of the main characters is a succubus who puts the two characters in this awkward bond that doesn't let any moment in the anime stay normal for more than three minutes...\\n\\n\r\nThe character designs and art, not much I can say about it. Generic, but not terrible. Music a bit less than good. Once again, the awkward scenes really detract from the rest.\\n\\n\r\nCharacters are interesting in my opinion, except for those awkward moments that really detract a lot of value from the characters... and little miss succubus who just grates on my nerves... Hero who was exiled from his hometown after unleashing an epic power who is trying to be normal. Demon lord who is trying to be normal. Succubus who is trying to f*** up both their lives. A childhood friend who wants to help them but has a code of honour to uphold... In any other situation, I would like 3/4 of these characters... the third one being the one I'd hate under any circumstances.\\n\\n\r\nMy Enjoyment with the anime was a it awkward. As I mentioned before, I unconsciously skip past any scene to any scene that is either an awesome fight scene or some scene with some slight comedy... Then after the episode I would remember there were those scenes and I would suddenly hate myself for enjoying the other parts of the anime... It was weird...\\n\\n\r\nIn all honesty, I think there is a good concept in this anime, but the huge amount of ecchi really brings down the quality of this anime. As I've said, there were moments that would've shined had it not been for the unnecessary amount of ecchi throughout this show. Sure, there are those weird people out there who would enjoy this sort of stuff, but the rest of you, I would say that this anime is not worth watching.",
            "date": "2015-04-29T04:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 186736,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3598913.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sachi_shimazu",
                "username": "sachi_shimazu"
            },
            "url": "https://myanimelist.net/reviews.php?id=186736"
        },
        {
            "content": "A lot of people havent enjoyed this anime, the score is honesty much lower then I think it should be. People have their own reasons for not liking it, but if I had to say what one big reason for why people didnt like it, it would be the DAMN CENSORSHIP OVERLOAD.\r\nI actually started watching this series when it aired, I watched the first episode then immediately gave it a 4 and dropped it.\r\nWhy?\r\nBecause the censorship was so ridiculous I couldnt take this anime seriously, the censors ruin any mood that is built up.\r\nBut then the uncensored version was released, and so I gave itanother try and was not disappointed.\\n\\n\r\nStory: 6\\n\r\nIts fine, protagonist protects girl from baddies. Honestly not much, pretty generic but done right.\\n\\n\r\nArt: 7\\n\r\nThe characters look good, the backrounds are solid, but nothing overly eye popping. Except for, you know, \"Those\" scenes. Animation in \"those\" scenes very smooth. The fight animations are well, what you would expect, theres nothing top notch but still good.\\n\\n\r\nSound: 8\\n\r\nThe OP and ED are okay, nothing special, after seeing it once I would then proceed to skip them in other episodes.\\n\r\nThe ost however, fits the  mood in whatever is happening. \\n\r\nA silly scene, a catchy upbeat theme.\\n\r\nAn intense scene, a badass serious theme\\n\r\nHere we go, the VA's are top notch.\\n\r\nMio's squeals are refreshing, its not the usual \"Kyaa\" it actually sounds like a woman screaming.\\n\r\nBasara's voice definitely fits, a nice manly voice which changes to the situation. I know his VA as characters who are silly, so it was surprising how well it fit in the serious scenes.\\n\r\nAnother I would like to mention is Takigawa's voice, his VA I never would think would suit him but I was wrong as he thoroughly pulled it off. I underestimated his abilities as he did a beautiful job doing him.\\n\\n\r\nCharacter: 7\\n\r\nBasara is a great harem protagonist. When compared to others such as Rito (To-Love-Ru) or Issei (High School DxD), this guys in a league of his own.\\n\r\nHe acts just as a normal man would when a hot chick comes on to him. \\n\r\nHe has self control but also a realistic breaking point.\\n\r\nAnd one great thing about him is he's not one of those characters who would defeat a really trashy enemy and not kill him. Like \"Oh yeah, im not gonna kill you so you can come back and cause more trouble that could potentially harm someone important to me\" \\n\r\nBasara gets stuff done.\\n\\n\r\nIm not going to review all the girls but I will say that none of them are unlikable.\\n\r\nUsually in a harem, there will always be one girl that annoys the hell out of me, but not here. Every girl here is great in her own way.\\n\\n\r\nEnjoyment: 8\\n\r\nI enjoyed it a lot. To the action packed scenes to their daily lives theres not a dull moment. The last episode didnt end badly either like some other series im thinking of.\\n\\n\r\nOverall: 8\\n\r\nIn conclusion, \\n\r\nWith censorship: 4\\n\r\nWithout censorship: 8\\n\\n\r\nDONT WATCH IT CENSORED.\\n\r\nIT WILL RUIN IT.\\n",
            "date": "2015-10-25T22:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 202008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2216395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raydnt",
                "username": "Raydnt"
            },
            "url": "https://myanimelist.net/reviews.php?id=202008"
        },
        {
            "content": "Very similar to HS DxD, but with more ecchiness. I mean, the intimate sexual acts are really great, you either would call this hentai but its not but it looks like one.\r\nGod/Angels vs. Demons vs. Humans and within them thier own faction issues like betrayal and forming new alliances.\r\nAnd the master servant pact.... its both a curse & benefit, depends on which side you are.\r\nBasara's personality drastically changes during the master-servant initiation ceremony and the side effectsafter pact was made. From a gentalmanly calm, naive, innocent seemly clueless teenage boy on how to make his servants happy by making them moan in ectasy, he begnto make sexual acts (ala hentai way) towards them and for a moment he was ashamed and refuse to do so..... talk about playing it hard to get.....\\n\r\nMio seems to be the most ecchi character next to Chisato, She appears to be a average 11-12 y/o girl but she hidden locked her real form (as a mature teenage succubus, her powers increases) and can be unlocked if she wants to.\\n\r\nThe story is not bad but lacks other character participations, the story revolves mostly on the main casts daily lives on how to live everyday filled with mischiefs that leads to having sex due to various reasons. Only the last 4 eps. where the story finally picks up..... but many questions still remained unanswered. Hopefully season 2 can answer and most character inter relations and more action but still maintain the hot moments as those are the anime's trump.",
            "date": "2015-10-06T15:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 200665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3392897.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animatopia",
                "username": "animatopia"
            },
            "url": "https://myanimelist.net/reviews.php?id=200665"
        }
    ],
    [
        {
            "content": "In my opinion this show is just bad.  Before you dislike my review hear me out on this.  I don't think this show is bad because it isn't at all modest or subtle or because the content is made to appeal to \" the lowest common denominator\", if that were the case I wouldn't have kept watching to begin with.  While some may find what I say questionable that's honestly not my problem , but as far as \"PROBLEMS\" go, there are a lot.\r\nFirst of all half the show is un-watchable.  Half of the show is white bars of light coveringthe screen during the more sexual oriented scenes.  Sure the light bars are for censoring and I don't necessarily have a problem with that, but it happens so frequently that you wonder why they bothered to add even more scenes that REQUIRE them towards the end of the series.  I don't know about anyone else, but I don't like staring at nothing for (sometimes) almost 3 to 5 minutes at a time, with an occasional face or backside appearing in a shot.\\n\r\nSecond the animation is just piss poor and sad.  I know that this is a fan-service first, story and animation second type deal, but how can anyone get invested into a scene that has little to no detail and cares so little that fulfilling its purpose-- to give the viewer good fan-service--is now apparently too much to ask? Look at other shows like Freezing or High School DxD, which are made for almost exactly the same type of audience, you have to admit those shows look amazing, whether you like them or not.  What is present HERE all looks lazy to me. \\n\r\nThird the story is just so messy and all over the place.  Most of the story makes little to no sense, due to plot holes or things just never utilized.  You may argue that it isn't about the story and to some extent I might agree with you, but the point is the story tries to bring in characters and world building it didn't even need, to somehow try to flesh out the world they don't even do enough to make you care about to begin with.\\n\r\nLet's look at some of the problems that were poorly dealt with within the story as vaguely as possible: \\n\\n\r\n- Okay so there are clans, that are generically called \" Hero\" \" Demon\", whatever, already the story shows me it doesn't care. \\n\r\n- Where do they come from?\\n\r\n- Why do they exist?\\n\r\n- Why were they formed?\\n\r\n- Why are they fighting? \\n\r\n- Why is there little to no history on any of this, when this is potentially important knowledge? \\n\r\n- How does the magic in this world work?\\n\r\n- And what about the curse on Mio that helps Basara gain strength, for reasons? For \"reasons\", you can also be sure that all of that will be hell of useless when plots involved. \\n\\n\r\nSo the answer to all of those questions and why those things do or do not exist are       \"WHO KNOWS?\".  \\n\\n\r\nAside from that it's just pet peeves:\\n\\n\r\nAnnoying catchphrases? (I.E: \" I'll kill you a hundred times\") You bet.  \\n\\n\r\nRandom mood swings from the girls to get the scene more sexual?  Can't go without it.  \\n\\n\r\nCharacters with unexplained purposes or even backgrounds?  Of course, this is borderline hentai, who the hell cares about the world we're trying to create?  Not us.\\n\\n\r\nOverall, feel free to disagree, but there is so much holding this series back. There are some interesting ideas sprinkled here and there, but not a single one of them were represented properly here. The story is pathetic. The art is horrible. How's the sound?Simply forgettable.  Hell I don't even remember a single track, the opening song is an exceptional track however.  The characters, much like everything else, aren't even worth mentioning since none of them have any emotional complexity or defined personality to begin with.   If you're the type of person who is used to expecting more than the bare minimum when it comes to characters ( though coming into this you really shouldn't in the first place) and not just archetypes scattered all over the place..... .....I don't know what to say, just don't expect a miracle.  This is simply put a mediocre show, not offensive, but just not worth anyone's time, not even the most hardcore of ecchi anime fans.  \\n\\n",
            "date": "2015-03-26T15:59:00+00:00",
            "helpful_count": 233,
            "mal_id": 183517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955439.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GhostStorm",
                "username": "GhostStorm"
            },
            "url": "https://myanimelist.net/reviews.php?id=183517"
        },
        {
            "content": "This is the closest harem to Highschool DxD that I've seen yet. That is a plus in my opinion although everyone seems to either hate or like this series. \r\nThe story is rather simplistic but overall interesting to see the relationships between the demons and hero clan. I think there is much more depth to be mined in future seasons. \r\nThe OP and ED are very reminiscent of Highschool DxD in both the style of animation and type of music used. The music is good and fits the show. \r\nThe characters are underdeveloped which is to be expected for a harem that consists of only12 episodes. I think more complexity will be added in following seasons especially with the revelations of the last episode which does hint at a greater depth than previously seen.\\n\\n\r\nI enjoyed this series. It's very humorous and entertaining. The anime is heavily censored which is to be expected. I'm sure an uncensored version will be released eventually. If you like Highschool DxD, give it a try. \\n\\n\r\nStory - 6\\n\r\nArt - 7\\n\r\nSound - 7 \\n\r\nCharacter - 6\\n\r\nEnjoyment - 9\\n\r\nOverall - 8",
            "date": "2015-03-26T13:11:00+00:00",
            "helpful_count": 108,
            "mal_id": 183490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3437971.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DeadlySilvers",
                "username": "DeadlySilvers"
            },
            "url": "https://myanimelist.net/reviews.php?id=183490"
        },
        {
            "content": "Shinmai Maou no Testament... man this show was ALL OVER THE PLACE\r\nOne minute I'm watching and it feels like a pretty darn good action anime...which then falls apart into a mediocre \"comedy\" ecchi harem that borderlines hentai... \r\nSo basically the story is...\r\nBasara is moving into his new home with his newly adopted sisters Mio and Maria. Basara is told by his father to protect his \"sisters\" because they are now family. All seems well until all 3 \"siblings\" discover that none of them are who they appear to be.  Basara and his father are actually exiles from the \"Hero Clan\" and are natural bornfighters whose mission is to stop and destroy evil demons. Meanwhile Mio is actually the daughter of the former Demon Lord, and Maria is a succubus who is protecting her. Basara decides to keep his promise with his father and protect his \"sisters\", which being that Mio is a demon lord's daughter, means that many other powerful demons are trying to get a hold of her. \\n\r\n...Oh! and Maria has Mio and Basara perform a master-servant contract that backfires causing Mio to become Basara's servant, who if she ever disobeys will be overcome with lustful desires until such time that he sexually pleasures her and calms her down...yeah... I know... \\n\\n\r\nAnimation and sound quality aside...which were fine by the way, I thought. Definitely the least of my problems with this show. \\n\r\nMy issue with Testament is it just couldn't seem to decide what it wanted to be. Now there is no problem with mixing ecchi harem comedy with action... but the thing is Testament just did it so poorly, or rather I should say didn't mix them at all. They are almost like two completely separate entities to the same show... I mean here you have an awesome set up to a plot with an actually really great male MC. As a matter of fact I thought character wise he was so good I felt bad that he was wasted in this show. Then you add the concept of Maria being a playful succubus obviously calls out the ecchi in this (if you don't know what a succubus is it's a demon whose powers revolve completely around sex)... but to the extent that it does so and it's reasoning behind it is just completely unjustified. It just seems really out of place... \\n\r\nNot to mention I feel it is extremely necessary to warn you that when an ecchi...or really ill say soft-core hentai scene takes place... be prepared for over half of your screen to be beamed with white or have a ridiculous picture covering up half the screen distracting you completely from whatever was supposed to be happening. Now DON'T BE ALARMED! that's not your computer screwing up, it's just the animation company's idea of \"censoring\". Now I don't know if they did that on purpose for \"humor\"... but it was definitely annoying.\\n\\n\r\nIn terms of enjoyment I would have to split it into two different categories. \\n\r\nAs an action anime, honestly I loved it. I'd give it a 8/10. It had really cool fight scenes with high intensity that really drew me in.\\n\r\nHowever as a ecchi comedy I'd say It was mediocre. 6/10 maybe. I thought all that stuff only took away from the story itself and just distracted me from what was important. \\n\\n\r\nWould I recommend this show? Maybe... depends on what you're looking for. Action? Yes if you can deal with the poor comedy and ecchi parts in between.\\n\r\nEcchi Harem? I mean... honestly no, simply because you won't be able to enjoy it because of the ridiculous censors...",
            "date": "2015-03-26T13:30:00+00:00",
            "helpful_count": 68,
            "mal_id": 183491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4365561.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aubzstein",
                "username": "Aubzstein"
            },
            "url": "https://myanimelist.net/reviews.php?id=183491"
        },
        {
            "content": "It’s quite an achievement to stumble across something so unfathomably bad that you struggle to find the right words to sum up how awful it can be. The okatu-pandering, aimless and empty Shinmai Maou no Testament fits the bill and is the latest offering to leave me speechless for the wrong reasons. It’s a self-insert power fantasy featuring a sad excuse for a cast, the bulk of which whose sole purpose is attempting to procreate with a main character who has the charisma of beige wallpaper. Perhaps the most laughably bad aspect of Testament is that there is an attempt to weave a plot intothe show, because the sole purpose of the events that take place is to force characters into cringe-inducing sexual acts with each other. It’s repulsive. Not a skerrick of Testament is memorable and not one facet of it gives it any redeeming qualities. It is an example of the dregs of what the anime industry has to offer.\\n\\n\r\nShinmai Maou no Testament follows the story of Basara who has two “step-sisters” (you be the judge of that), Mio and Maria, move into his house. When Basara’s father departs overseas it leaves the three alone in the house and who knows what wacky adventures our trio will get up to! There’s more than meets the eye when it comes to the new arrivals and Basara gets caught up in a world of boobs, magic, swords, boobs, heroes, demons and more boobs quicker than you can say “Oh god why did I start watching this train wreck?”. There is honestly little more that can actually be said for the story. Seriously. That synopsis I gave you might actually be myself overselling the complexity of it. Some opposing force shows up against our characters but there’s little to ever worry about because you know that fanservice is number one on the agenda – not story – meaning there is no way the ‘writers’ (a term I’d use loosely) would risk doing anything to put a dint in the harem. \\n\\n\r\nI have no sense of what the characters are even fighting for. There’s some ham-fisted backstory plus a generic ‘redemption’ driving force for our main character. Apparently we’re supposed to empathise with a group of people we know practically nothing about. That’ll work, for sure. \\n\\n\r\nThe solution to every complication is predictable. Literally every female character in the show is eye candy and nothing more. Any attempt at the storyline in becoming more ‘serious’ is instantly cancelled out by a laughable plot point that leaves every female character degraded and at the mercy of our MC’s libido. All Shinmai Maou no Testament does is act as a lowest-of-the-low sexual fantasy that positions men as an all-conquering force, who without women cannot function or find their own sense of direction. It’s demeaning and insulting. Many anime have been guilty of such a thing in the past but this show has found a way to kick it up to a new level. \\n\\n\r\nSpeaking of those female characters, they’re all there to fulfil a particular fetish that exists in the audience. Hair colours, statue, breast size, personality traits – all of which feel cookie cutter and like you’ve seen them 57 times before. The fact that there’s not an inch of depth to them only makes this laziness in their design all the more prominent. Make sure you include the infallible MC to really sell how much effort you put into making something of merit!\\n\\n\r\nI did not have a single positive experience upon viewing Shinmai Maou no Testament.\\n\\n\r\nDo not watch Shinmai Maou no Testament.",
            "date": "2015-12-11T04:53:00+00:00",
            "helpful_count": 41,
            "mal_id": 205239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3966203.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Tozzy",
                "username": "Tozzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=205239"
        },
        {
            "content": "Story\r\nThe story reminded me of High School DxD, i felt it has a feeling to it. in this story there are Demons and Heroes that fight eachother, heroes to erradicate demons and demons enslave humanity, this is where Basara meets a girl in normal circumstances where they are going to be brothers in-law but later on is discovered that this was a lie because she is the Demon Princess and is going to have his memory erased by his other new little ''sister'' Maria who is a Succubus, but turns out to be that Basara has his own secret...\r\nArt & Animation\r\nI liked a lot theart style, really detailed, the color, the bewbs etc.\\n\\n\r\nSound\\n\r\nIt has a great voice acting, great OP, great backround music.\\n\\n\r\nCharacter\\n\r\nThey were very well developed, we go deep on their backstories, i liked Yuki since i saw her, just like Mio and tought Maria was a funny pervert succubus and i liked how the MC Basara is not a wuss in those situations (if you know what i mean) like other MCs and Takigawa was very interesting.\\n\\n\r\nEnjoyment\\n\r\nI really liked this anime, i enjoyed it, i would have enjoyed it more if there wasn't censorship, but yeah i wasn't bored with this.",
            "date": "2015-08-03T02:08:00+00:00",
            "helpful_count": 27,
            "mal_id": 195053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195053"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nThe Testament of Sister New Devil seems like a rather generic anime. And for the most part, it is: there is no shortage of magic, nakedness, and harems within it. But it at least attempts to play with the theme of protection. Which is funny when you think about it; in an anime whose strongest aspect is the very “ecchi” it thrives on, you’d think that “protection” would be the furthest idea from its mind. Regardless, this is what the show hones in on. Protecting the things you love, especially those people dearest to you, issomething that we all do whether we know it or not. And while this one tries its best to flaunt this motif, the majority is mediocrity that suppresses any sense of worth it may have.\\n\\n\\n\r\nSTORY\\n\\n\r\nTestament pits Basara Toujou as the male lead. One day, he obtains two new “relatives,” Mio Naruse and Maria Naruse. As events pile up and paths cross, it’s revealed that Mio holds the greatest demonic power within her, Maria is her succubus servant, and Basara is an exiled man of the Hero Clan.\\n\\n\r\nIf Testament does anything correctly, it is in the “ecchi” service that it provides. While nearly all of it is censored, what is shown and what can be inferred is some of the greatest to grace the medium. The show refuses to hold back; it never shows full-blown genitalia but it gets rather close to crossing that line, making the anime nearly pornographic in its presentation. Not just kissing but make-out sessions; not just showing breasts but fervently fondling them; and not just holding hands but hip grinding, butt squeezing, and even orgasms. Testament revels in the sex that permeates the show, going so far as to make one of its key plot points follow down this path. This plot point of course being the “master-servant” pacts that cause a disobedient servant to undergo immense pleasure. And then, in order to strengthen said pact, going through with these perverted actions “deepens” the relationship, making both people come out for the better. Literal and figurative hot shower scenes, body-on-food eating, a succubus whose proportions grow; the diversity of the “ecchi” scenes and the originality of many of them easily demonstrate its overall execution in the genre it itself made a pact with.\\n\\n\r\nAs talked about in the introduction, Testament’s prominent – and only – theme is the idea of protection. Or more specifically, protecting the ones you love. Many of the characters have this sense of righteousness about them: Yuki wishes to protect Basara, Maria wishes to protect her mother, and Basara wishes to protect everyone. Surprisingly, the show here as well showcases quite the range in relation to its theme. Protecting someone sometimes means doing what has to be done as opposed to what is the right thing to do. Maria’s betrayal to save her mother is an easy example. It may also involve a sense of self-lost protection; Basara, through his actions, protects those around him but makes others incapable of returning the favor. The structure of the series follows essentially three separate arcs, each focusing on one of the main girls and their reason for protecting. The developments therein always lead to the same outcome – Basara adding one more woman to his ever-growing harem – and the actual exploration of the theme isn’t expansive – the morality mentioned previously isn’t discussed nor is there ever any “bad” conclusions – but Testament is at least consistent in its thematic presence from start to finish.\\n\\n\r\nANIMATION\\n\\n\r\nTestament’s art is a testament to boringness. While the protection theme was inching towards the generic field, it’s here where the anime begins to fully find itself in. Many of the locations visited are typical, tried, and tired: a school classroom here, a dark forest there; the anime, despite having all of these characters from various backgrounds, never provides the audience with a look at anything even remotely interesting. And while the “ecchi” moments are top-tier, most of them are sadly censored. Not so much that it is impossible to discern what is occurring behind the miniature caricatures they use to hide it, but enough to make you frustrated that all of the goodness is being kept just out of reach.\\n\\n\r\nThe character designs fair a bit better in comparison to the art style that surrounds them. Sticking to its sexy roots, the women are often clad in such a way as to make their signature assets that much more appealing to look at. Mio’s black-and-white school outfit with long, red hair helps to magnify her breasts that much further. Yuki’s skirt is just short enough to reveal her butt when needed. And adult Maria’s garb is black-and-pink – a sultry combo – that doesn’t leave much room for the imagination. Basara’s design – cuts and scars across his entire body – provides him with the physical evidence needed to demonstrate just how much he is willing to protect those he loves.\\n\\n\r\nWhen looking at the show’s actual animation, it’s a tougher call. The anime can bring its game during certain action sequences, and especially so during the “ecchi” material. But since these are usually seen about once or twice per episode, the majority of what the anime offers in terms of movement is average.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhen it comes to Testament’s cast, many don’t see a huge amount of development. Basara is far and away the weakest character and isn’t an interesting person in the slightest. He’s the super strong, super nice, and super gung-ho guy who exists as nothing more than the leader of the harem. He’s the same from start to finish, seeing only minimal investigation in the form of a small flashback. Meaning, while he exemplifies the theme that the anime focuses on, his actual character suffers through monotony and severe lack of development. The majority of the cast is treated the same way; that is, as not really changing over the course of the season despite having their own “arcs.” Part of the problem is due to the segmentation of the season itself and due to their overall powers. The characters being a trained succubus, a renowned sword fighter, a daughter of the Devil, and a man who is capable of reversing any attack against him are unfortunately written into the corner of “no improvement” rather early on. However, all is not completely lost on the girls, for Basara does aide each of them in becoming a better person.\\n\\n\r\nMaria is a mommy’s girl; she is conflicted given the position she was forced to take, and attempts to do everything on her own. But Basara proves that sometimes, it is necessary to rely on others, because it just isn’t possible for us to do everything by our lonesome. Yuki fights the demons due to her Hero Clan status, but she isn’t blind. She’s honorable, following her own heart when dealing with the situations she faces instead of mindlessly following the “rules” set around her. This thinking was directly inspired by Basara who, as her role model, does the same; fights for what is right as opposed for what is “correct.” And Mio starts off pretty dependent, leveraging other people’s good-will to get her through the day, but still refrains from connecting with anyone too seriously due to her own dark past and familial loss. So through Maria’s guidance, Yuki’s friendship, and Basara’s love, she realizes that she doesn’t have to be alone. In essence, she “opens up” to those around her, becoming closer to those who had been close to her the entire time.\\n\\n\r\nWhile the show doesn’t put too much thought into nearly all of its characters, it still manages to inject a bit of direction when looking at each of their move-sets. In essence, their outward actions symbolize their inner person. Maria uses hand-to-hand combat because she’s very hands on in her dealings with people as a succubus. Instead of fists, Yuki uses a sword that mirrors her personality: sharp, direct, yet extremely elegant. Mio’s fiery magic is easy to see; it reflects not just the immense power she has within her, but also the passion she has for her closest friends. And Basara’s “Banishing Shift,” his ultimate move, defines who he is deep down. That is, his ability to completely give back any move thrown his way matches how much he gives back to others through his constant need to protect the ones around him. The rest of the cast can be looked at in a similar fashion, demonstrating that the anime can appeal not only to our hormones but to our brains, too.\\n\\n\r\nSOUND\\n\\n\r\nTestament’s weakest component is arguably the sound that makes up nearly all that it does. The opening theme isn’t so much grating on the ears as it is just painfully boring. And it knows this; it tries to make it more enticing by adding in faux-nakedness here and there, but the visuals aren’t enough to distract the audience from having to listen to the generic beat and overdone guitar playing. The ending theme is even worse, containing a lot of singing, choirs, and drums that all mash together in such a way that nothing seems to be working. In other words, it’s at this point that the anime’s inability to focus on what it does well – the “ecchi” and sexiness – begins to easily show.\\n\\n\r\nMuch of the original soundtrack contains pieces that are mired in heavy use of “powerful” instruments and group singing, in order to give everything a grandiose feel. It could even be said that the direction of the music is meant to sound “church-like,” given that the anime is entitled after portions of the Bible. At the same time, many of the tracks contain guitars, saxophones, and other, ambient instrumental effects that heighten “the mood” and therefore the sense of sexuality that permeates the anime during most scenarios. There are sad piano pieces for the melancholic times, flute arrangements for the laidback ones, and mysterious string tracks that fill those unknown moments. Unfortunately, like the OP and ED it finds itself between, nothing within the OST is memorable, let alone impactful, making much of what it sets out to do go unappreciated and therefore ends up unappealing.\\n\\n\r\nAnd in order to round it all out, the voice acting for the show is average at best. There are no special shout-outs to be had.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one is all about the “ecchi” content. Being a fan of such material myself, it was definitely a pleasant surprise when the show decided to go as far as they were going with nearly all of its offerings. It was nice to witness not just the daringness of the show but also the uniqueness of the content, contrasting hard with the rest of the generic aspects of the anime. I’m a big fan of Mio, adult Maria, and especially Yuki, so watching them on-screen being lewd every now and again was never a sight for sore eyes.\\n\\n\r\nBut while such promiscuity is very well-done, I never found myself to like anything else. The action sequences are a lot of explosions here and there, the emotional events never moved me, and while it tries to be comedic at times, it isn’t that funny, with maybe an elicited laugh at very specific moments. A large portion of the anime are long stretches where these kinds of developments occur, and when they were going on, I really just wanted it to back to doing what it did best – employing Yuki and the other girls in the “ecchi” antics.\\n\\n\r\nWhile The Testament of Sister New Devil finds itself muddied by mediocrity, not everything within is entirely lost. The sexual content is executed nicely, its theme remains relevant both with the narrative and the development of the characters, and the designs of the girls are enticing to see. But it’s all dragged down by a less-than-stellar main male lead, an uninspired art style, and lackluster music that, when all combined, concocts a show that is simply run-of-the-mill.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Good, fantastic “ecchi” elements, and consistent yet unexplored theme\\n\\n\r\nAnimation: Fine, boring art style, very nice character designs, average actual animation\\n\\n\r\nCharacters: Fine, Basara is bad, Maria, Yuki, and Mio experience some development, and everyone has purposeful abilities\\n\\n\r\nSound: Bad, lame OP and ED, below average soundtrack, average VA work\\n\\n\r\nEnjoyment: Fine, the “ecchi” is great to watch but nothing else is\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-05-16T13:08:00+00:00",
            "helpful_count": 26,
            "mal_id": 187985,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=187985"
        },
        {
            "content": "WARNING: This review contains spoilers. You have been warned.\r\nAlso, this review is a review for the whole series uptill now (Season 1 and OVA + Season 2 and OVA)\r\nWhere do I even start with this anime...\r\nStory: 2/10\r\nSeason 1: It's been about a week since I've finished this series, so I don't remember the exact story very well. Here's what I know. Mio's (MC) parents (apparently Demon Lords) abandon her to keep her safe from threats and let their friends(?) raise her. Things go on smoothly until some devil finds out that Mio is being raised by someone else. They find out who and kill them.Mio is once again left alone, and runs away, but this time with the help of a newly met servant. After that, she meets a guy who knows who she is and agrees to raise her along with Basara (his son). From then on, there's a nude scene in almost every episode. And don't blame me for getting some parts of the story wrong. I'm a guy. How the hell can I concentrate on the story with the show these 'siblings' put on.\\n\\n\r\nOVA 1: Oh boy, shit gets real here. Basara is invited home by his hot teacher. She tries to seduce him, both get into the bath and you know what happens next. \"But wait Ryan, I am pretty sure I've heard a story like this before\" - You, the reader say. Yes you have. It's the story of every teacher/student porn.\\n\\n\r\nSeason 2: 13 episodes in and I thought I knew what to expect from the series in season 2. But they still surprise you. In episode 7, they have a full-fledged orgy before battle. As if the anime wasn't hentai enough already.\\n\\n\r\nOVA 2: OVAs nowadays exist for fanservice. That's all this OVA was. Except that it was extremely close to being a hentai, as was the whole franchise.\\n\\n\r\nArt: 3/10\\n\r\nSound: 2/10\\n\r\nThe art and animation were pretty mediocre, except in Season 2 and it's OVA. They put little to no effort in animating the Giant Spirits well. And in some scenes in the OVA, Mio's face was distorted.\\n\\n\r\nCharacter: 1/10\\n\r\nI dislike many Harem characters, but this series takes the cake. Every harem has girls trying to seduce the guy. But this one.... it has them butt naked trying to do so. The girls were so dense. Everytime they have an orgy, they call it 'getting stronger'... It sounds absolutely pathetic imo.\\n\\n\r\nEnjoyment: 2/10\\n\r\nOverall: 1/10\\n\r\nI guess this was more of a rant than a review. Anyways, the excessive nudity and borderline hentai in this anime makes it one of the worst anime out there. You would be better off watching real hentai.",
            "date": "2016-04-27T16:20:00+00:00",
            "helpful_count": 23,
            "mal_id": 217310,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960422.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/One",
                "username": "One"
            },
            "url": "https://myanimelist.net/reviews.php?id=217310"
        },
        {
            "content": "\"I can't abandon a girl when people are after her life just because she's the previous demon lord's daughter. I'm going to protect her! But... Am I allowed to have only one precious thing to me? Must I limit myself to one?\"\r\nNo, that's not me pretentiously attempting to attach some meaning or something -- Those are a few lines of dialog that summarize Shinmai Maou no Testament. It's all you need to know about the show, as it is about just as much as the show cares to let us know. \r\nSo yeah, Shinmai Maou no Testament is another harem whose sole purpose forexisting is to fill out a time-slot. A show that makes you wonder if the people behind the scenes are engaging in copyright wars from making such an uninspired amalgamation of several elements from other shows put together to make the same harem you've seen a dozen times over. It's so lacking in creativity that it uses the \"I accidentally walked into you when you're undressed\" cliché four or five times. -- said shows that come to mind are: Inuyasha, Bleach, Highschool DxD, and perhaps Tokyo Ghoul for Takigawa, Yahiro and it's EDGE. \\n\\n\r\n\"Basacchi\". Oh lord, pls no. \\n\\n\r\nBasara is your typical self-righteous \"hero\" devoid of personality; an indecisive, apologetic asshat, whom let's himself go wild on the girl's tits when he damn well pleases. When his sexuality reaches points where it can be brought under question, he gives in to his urges then he seeks to be comforted by said tits from having gone too far with his manhandling. By the shows end he's only a few notches away from being another despicable Itou, Makoto. If only. If only that would have actually been the case, at least he would have been less forgettable. All the girls in the show line up to feed the ego of whomever uses Basara as their surrogate. They exist just to get their breasts fondled or consistently refer to him as \"onii-chan\" or \"B-baka\". \\n\\n\r\nA little too delusional, but not to the point of aggravation. \\n\\n\r\nMost of the ecchi is constricted to a single gimmick — the partner binding spell crap — the rest pretty much revolves around it. The art design is easy on the eyes, yes, but still quite forgettable. And while surely not tame, the ecchi is presented in a very boring fashion.  Though it may \"look\" nice, it still might as well be some dude in an ad testing Tenga products. Or perhaps sadder still, are the junkies who will rush in to buy the blue-rays. \\n\\n\r\nAs for the sound or even action? Nothing stands out, everything about this show just screams \"routine\". ...You might be familiar with a seiyuu who I believe goes by the name of Nomura, Kenji. You know, in bleach, that hot headed bulky bald bitch of a subordinate that follows Ulquiura? Well, Kenji plays that same bulky bald bitch here, same powers and everything, except skin tone. He suddenly appears out of nowhere for a fight and is just as briefly tossed aside so that Basara and galls can go back to breast fondling. *sarcastic cheerful claps* He stacks up a grand total of 5 seconds of screen time. Talk about pointlessly anti-climatic. \\n\\n\r\nInitially tolerable even with the rather harmless tonal shifts, but then it becomes increasingly irritable as the series progresses from schizophrenic harem to obnoxious shounen.  \\n",
            "date": "2015-04-03T21:43:00+00:00",
            "helpful_count": 18,
            "mal_id": 184670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1226209.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Gotanon",
                "username": "Gotanon"
            },
            "url": "https://myanimelist.net/reviews.php?id=184670"
        },
        {
            "content": "How to easily earn money without putting much story into it:\r\nStep 1) Make your anime with a shit load of ecchi (this anime is borderline hentai) and put harem in there.\r\nStep 2) ??????\r\nStep 3) Profit.\r\nStory: 6/10\r\nThe story isn't that original, mainly because I've seen other successful ecchi anime that have this story. Not only was the story unoriginal, but they also made the anime before Highschool DxD BorN's first episode. Though, a lot of people do enjoy these types of stories (mainly because of the fan-service and harem, duh) and personally I do too, but without too much fan-service. The ecchi was basically borderline-hentai andoverdone. If you want to watch ecchi, you might as well just watch a hentai. The action was actually quite decent, because the main character had a special ability. I do wish that the dad had more screen-time, because he's a total badass. The anime doesn't just start with a massive harem, but it starts to progress throughout the anime.\\n\\n\r\nArt: 7/10\\n\\n\r\nTo me, the art looked like it was illustrated back in 2006 and someone found them in the drawers and decided to make that into an anime in 2015. Though, the animation was quite smooth and one thing that bothered me was how similar Issei and Basara looked a like. Mio looked a bit like Rias, but  Mio looks younger. Also, there was one part where they censored a FUCKING TONGUE-KISSING SCENE. What the actual fuck? \\n\\n\r\nSound: 7/10\\n\\n\r\nThe OST was quite nice, sometimes it made the scene epic or made it more sad (or even more erotic). It fit the scenes nicely and wasn't overused or loud. I actually liked both OP and ED, but the OP more so than the ED. The OP is rock mixed with piano that fit the theme of the anime. The ED has a very calm and happy tune mixed in with rock. The episodes I didn't watch had subs for the ED but I'm sure they were talking about dreams and love (also, the ED animation had titties without nipples. If you're putting titties at the end, then you might as well either censor it or put nipples on it, or else they look like some hybrid alien.)\\n\\n\r\nCharacter: 5/10\\n\\n\r\nToujou Basara, the hero and the protagonist of the story. A very cliche character for a harem anime. If you're a hero and the protagonist, then you're likely to have 5 million chicks sucking you off every minute. Basara is a man who does anything to protect his 'sisters', thus making him a very kind person. As the anime progresses, he gets stronger. '\\n\\n\r\nNaruse Mio, the soon-to-be Demon Lord. Well well well, another cliche character. I've seen a lot of anime where the demon lord and the hero aren't fighting each other. In fact, sometimes they both fall in love with each other. She relies on Maria a lot, thus making her weak, even though she's a Demon Lord. Sometimes, whenever she's enraged, she does use her real strength. She grows much more attached to Basara as the anime progresses. Mio is really fucking useless though.\\n\\n\r\nNaruse Maria, the loli-succubus. Aren't succubus supposed to have the desired body to attract male?? Why does Maria have a childish figure? Maria is a very strong and helpful character, fighting along side Basara to fend off against enemies, whilst protecting Mio. She likes to tease Basara a lot when they're both alone.\\n\\n\r\nNonaka Yuki, the female hero and the childhood friend of Basara.  Yuki is very attached to Basara and has a lot of feelings for him, to the point where she hugs Basara on their reunion. She is ok in combat, at least not making herself useless. \\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nThe story was unoriginal and the characters were eh, but I still enjoyed this anime somehow. Even though half the time I was watching this anime there were white lines censoring the sexual activities, it was still ok. I enjoyed the actions scenes quite a bit.\\n\\n\r\nOverall: 7/10\\n\\n\r\nIf you're planning on watching this, then please watch to the very last seconds of episode 12. After the ED, it's pretty epic. Would I re-watch this? Well, season 2 has been confirmed and if I like that, then maybe I will.\\n\\n",
            "date": "2015-04-10T07:13:00+00:00",
            "helpful_count": 17,
            "mal_id": 185294,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=185294"
        },
        {
            "content": "According to me, this is High School DxD on steroids. Don't get me wrong, I really like High School DxD. But I like this one better. Why, you ask?\r\nStory is okay. It makes more sense to me than the HS DxD one. There are demons, the demon world and the hero clan. The MC is from the hero clan, and his dad has once been known all across the world as the \"god of war\" and feared like that. And out of the blue, he tells him that he got with a new woman and that she has two daughters and now he has twosisters. Tell me whatever you want, but that's a more \"believable\" story than DxD one.\\n\\n\r\nAnyway, the MC is like Issei, but gets way more ass than him. Be warned though that unlike DxD here ---- there is censoring. I hate this anime for that and I've read that others hate it too. For a good reason. That's the one part I feel they made a critical mistake.\\n\\n\r\nThere is more action, WAY more ecchi and *cough* bdsm. I loved it.\\n\r\nWay way way more than in DxD. I know, I shouldn't compare the two\\n\r\nbut IMO I like both the female lead and the male lead way more than\\n\r\nDxD and they are very similar. I like Mio way more than Rias. That's just me.\\n\\n\r\nThe sound is great, the art is great. Hell, just watch it and figure it out.\\n\\n\r\nFYI, there is season 2 coming in october I believe, so fear not there is more coming. Hopefully without censoring, but don't hold your horses.\\n\\n\r\nI recommend it, especially after you watched Highschool DxD.",
            "date": "2015-04-04T12:49:00+00:00",
            "helpful_count": 15,
            "mal_id": 184726,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=184726"
        },
        {
            "content": "Story: 5/10\r\nBoobs. That's like the only thing that really POPS in my mind after seeing this anime. So guys... if you like that sorta stuff, then watch it cause trust me you'll  be seeing a LOT of it. And if you don't like that kinda stuff, then you're in luck! There are two versions of if online. One is censored and one is uncensored (ep. 1-6, ep. 7-12 as far as I know, still aren't uncensored). Although when you're watching it censored, I hope you like looking at white bars cause that's one of their censoring methods. But anyways, the story. It's really notall that special. The story starts off slow and once it picks up it sorta just goes nowhere. Much of the story it seems happens in Basara's (main character's house), an area outside near Basara's house, or at school and very rarely does it deviate from those places. Sure occasionally there would be some plot twist that arises like a traitor within the group, but it was never like \"omg what is this?!?!\" shocking and in the end everything would somehow turn up all peachy. All in all bland and boring.\\n\\n\r\nArt: 9/10\\n\r\nWell there's nothing wrong here. The fights looked nice, especially with the details that was put on the magic circles when there was magic being used. And honestly the only things that was really needed to sell this anime (boobs) was drawn out well. No real complaints here.\\n\\n\r\nSound: 8/10\\n\r\nThe sound was alright. There's nothing really memorable about the soundtrack, but it wasn't bad. There are sometimes where there are two conversations going on at once and one is overpowering the other so you can't hear it. \\n\\n\r\nCharacter: 3/10\\n\r\nOk. To give you an idea of how original these characters were, let me just tell you that watching Dora would be more enjoyable. Every single thing is so cliche for an ecchi/harem/hentai (borderline) anime. Basara's just another main character that wants to protect everyone he cares about and the three girls that become his \"buddies\" (wink wink) are in total love with him because of that. And to top it off, every single one of them is as perverted as the last. It's really quite boring watching them.\\n\\n\r\nOverall: 4/10\\n\r\nTo be honest, I was so close to dropping this anime. I kept thinking \"oh it'll get better\", but it never did. The only reason I didn't was because I'm trying to never drop an anime. There were so many times where I just had to roll my eyes because Basara was talking about how he really wanted to protect his family or something cliche like that.",
            "date": "2015-06-25T12:45:00+00:00",
            "helpful_count": 13,
            "mal_id": 191237,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4554963.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/King_Of_Light",
                "username": "King_Of_Light"
            },
            "url": "https://myanimelist.net/reviews.php?id=191237"
        },
        {
            "content": "Just read the review...\r\nSTORY\r\nIf I were to guess at first, this show is basically a HighSchool DxD clone. Down to the presentation, character design and, to some extent, the storyline.  As such, Shinmai Maou no Testament basically includes devils, a harem for the MC, and the obligatory fan service.\r\nI would be lying if I say that I didn't enjoy the show it its entirety, there were some aspects of the show that were noteworthy at most. But overall, the story is just generic, bland and predictable. The fan-service, though obligatory in this kind of anime, does somewhat annoy me. There are even scenes that'sjust borderline hentai! Speaking of which, I can't really blame the producers of the show of the amount of hentai present, since it is an 'indirect' element in the story. There are some decently presented fight scenes, but that alone just can't put this show in good light.\\n\\n\r\nCHARACTERS\\n\r\nI don't know if it's the author's intentions to base of the show's characters to that of High School DxD, down to their designs. Either way, the characters are flat and are nothing really noteworthy, except for the fact that it's really similar to that of High School DxD's.\\n\\n\r\nAESTHETICS AND AUDIO\\n\r\nThe visuals for the show are decent, to say the least. The characters are designed nice and the animation is mostly good. Overall just great.\\n\\n\r\nSame goes for the soundtrack. It complements well into the scenes, but on it's own, it's rather bland if not forgettable. Voice acting is also decent, fitting well into each respective character.\\n\\n\r\nCONCLUSION\\n\r\nI mention High School DxD numerous times in this review because that's the overall impression I had before and even after I watched Shinmai Maou no Testament, but to the lesser extent after watching since it has some originality. You won't find any serious storyline and interesting characters, but for what it is, Shinmai Maou no Testament is a show that exists to entertain to people for its content. And I even admire it for having planned a second season.",
            "date": "2015-05-03T08:27:00+00:00",
            "helpful_count": 13,
            "mal_id": 187035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JonBort",
                "username": "JonBort"
            },
            "url": "https://myanimelist.net/reviews.php?id=187035"
        },
        {
            "content": "For the past couple years, the idea of Ecchi has changed dramatically, and what anime is allowed to showcase over the course of their runtime.  As the years went on, the idea of what is ecchi and what is hentai has been blurred to the point of almost crossing over into one another.  And here, I believe that we have an example of that right here.  Here it is, a review of Shinmai Maou no Testament, or The Testament of Sister New Devil, a show that I believe, like many others, could've done better as hentai.  \r\nStory (6.11/10): The story ofSister Testament as I call it, follows the life of a boy named Toujou Basara, a boy who has a father who is remarried, gaining two little stepsisters in the process.  However, not is all that it seems, as it is later revealed that the two \"sisters\" that he now has is the budding demon lord, and a succubus.  In addition, Basara is hiding his own secret, hiding the fact that he is from the hero village, a place where they regulate the demons of the world.  With the two sides now coming together, what challenges will they face with demons seeking the demon lord's power?\\n\\n\r\nAt first glance, sister testament seemed to be a little bit more than what the synopsis led one to believe.  The first episode wows you and honestly, surprised me with a complete 180 on the show's comedic feel by putting in an action scene that made me for a moment, rethink the entire series altogether.  It was that value of shock factor that really made me think for a moment that this was going to be a good show, and that I was in for one hell of a ride.  Quickly though, that idea became less and less prominent as the holes began filling up with regret rather than joy.\\n\\n\r\nWhile not only a series about action and the conflicts between protecting the new demon lord, Mio, Sister testament proudly shows itself (quite shamelessly might I add) to be an ecchi show in the worst possible way.  In the show, there is a technique or plot device known as the \"succubus curse\", where one person becomes the \"master\" over the other, allowing the two to become bonded and grow stronger together.  This one little detail manages to completely screw over the show plain and simple.  Because this plot device exists as the basis for the show, the actual plot for the series I feel becomes jaded more than anything.  Basically, the show makes it so that character strength is equal to the intensity and frequency of any kind of sexual act (as pointed out by the show's own characters) which can lead to, well...you get the idea.\\n\\n\r\nThe biggest flaw that I felt about this series was just purely about how frequent and how starkingly intense this show's ecchi moments actually were.  They were done in such a way that they had to do a Tokyo Ghoul-style censorship involving censor bars that basically blocked so much of the screen that you can't see anything, and above all, made any sense of the actual storyline completely disappear.  In this show, it seemed like the perverted moments took priority over anything, and for a show that actually seemed to have a decent plotline and story elements, it just really felt disappointing cause all of that stuff that makes a good anime is put in the trunk.  (Not in the backseat, the trunk.)  In terms of actual story, the progression was moderately well done.  Because of just how often you'll see fanservice, ranging from a casual stripping of the clothes to full-on foreplay, the story won't come as often as one might think, and just isn't fleshed out as well as it should've been.\\n\\n\r\nOverall, sister testament just failed to be any sort of proper story.  Because of its way of \"getting more powerful\", the show showcased sexual foreplay more than anything, making that the first thing anyone thinks of whenever they talk about this show.  In fact, I strongly believe that this series could've done better, and should've been a hentai more than anything.  In the end, the story suffered a lot from the show's \"other half\" and would've done better had it not had the amount of fanservice that it did have.\\n\\n\r\nOverview:\\n\r\n+  Decent story idea\\n\r\n-   Story suffered greatly\\n\r\n-   Fanservice overpowers the show GREATLY\\n\\n\r\nCharacters (5.55/10): The characters in sister testament similar to the story, don't really feel as fleshed out as they possibly could've.  Rather, each one of them except a couple few don't get what they should've gotten.\\n\\n\r\nFirst, we have Toujou Basara, our harem/main protagonist of the series.  As a member of the hero clan, Basara has the ability to summon down a weapon that he himself can wield, and uses it to fight the demons if need be.  Basara is more or less your standard harem protagonist.  While he does get a sort of backstory to explain his overpowered ability (cause every harem protagonist these days is either useless, or OP), Basara follows your cookie cutter troupe of the \"nice/good guy.\"  Even though the girls he now lives with deceived him, he, throughout the series, makes a VERY conscious effort to protect them as their older brother.  (Even though that idea becomes completely redundant and useless by episode 2.)  He gets nervous in ecchi moments, he tries to protect his loved ones, you get the shtick.  Moving on.\\n\\n\r\nNaruse Mio is the main female protagonist in this series, aka the tsundere (cause main girl ALWAYS is one)/damsel in distress/one with the big breasts.  As the upcoming demon lord who had her throne taken after having to run away when her father was usurped, Mio serves more of the Zelda/princess Peach character of this series because she very often can't fend for herself, relying more on Basara for that job.  Since Mio follows the tsundere troupe to a certain degree, there really isn't much to say about her since it's such a stale troupe.  \\n\\n\r\nApart from these two, we have the succubus character, Maria, who is both one of the better characters in the series for having some slight character development, and the ultimate reason why this series went down the drain so fast.  (That's cause the curse was suggested and inflicted by her, ergo, it's her fault.)  In addition, we also have Yuki, the character who serves as the childhood friend of the MC with a stone cold face, as well as Takamine, the one character who I thought was really the only shining glory in this cast of tired, old troupes regardless of how little he shows up.  \\n\\n\r\nIn the end though, the cast of characters for Sister testament were more like a troupefest more than anything.  Characters aside from the ones I have already mentioned barely get any substantial screentime, so there's not much to mention there.  Because of this, aside from Takamine, the characters in this show really aren't anything special aside from being called what they are, troupes.  \\n\\n\r\nOverview:\\n\r\n+  One decent side character\\n\r\n-   Tired anime troupes for characters\\n\\n\r\nArt and Sound (6.50/10 and 7.00/10): The art for this series isn't really much to write home about.  There really isn't any standout animation for this series aside from maybe the magic casting circles, and the series overall doesn't really have much of an impact art-wise.  \\n\\n\r\nWhat the art does have an impact on is simply how much of the series you can watch.  Because this show is so ecchi centered, the show wants to tell you that, a lot, like at least ten minutes per episode.  As I have mentioned before, the fanservice in this show is REALLY fanservicy to the point of it actually being sexual foreplay and should be considered hentai more than anything.  Yes, my dear readers.  This isn't ecchi, this...is hentai.  And because of this, the show as of right now blocks any form of watching it because you get censors, flashes of light, and darkened areas that essentially cover up the whole screen, not allowing you to witness of what is going on behind the chibi versions of the characters.  Because of this, watching this show can be quite frustrating because half of the time, you won't even get a clear picture as to what is going on.\\n\\n\r\nSound for me was a sort of solace for this series, as we have Sweet Arms make the opening for this series, which is a track that I feel like was rather good.  While the show that it was tied to isn't really all that good, the opening itself is actually a rather good and actually somewhat memorable.  Of course, upon mentioning this, the rest of the soundtrack is mediocre at best and really doesn't stand up too much.\\n\\n\r\nOverview:\\n\r\n+     Good Opening\\n\r\n+/-  Standard animation\\n\r\n-      Ecchi.  (Normally, I don't complain all that much about fanservice, but this is just simply too much.)\\n\r\n-      OST didn't stand up on its own\\n\\n\r\nPersonal enjoyment (5.00/10):  While I admit that I was wowed in the first 23 minutes of the series, the next 5.5 hours didn't really prove to be anything that I would bother rewatching or care for.  As the weeks went on, I was more disappointed in this show than anything because without all of the foreplay, this show actually could've done really well.  It had groundwork that it could've used, and a curse that was more of a curse on the show more than anything.  \\n\\n\r\nWhat did I like about this show?\\n\\n\r\nIf anything, it would have to be 1.  Takamine (cause honestly, he's the only character in this show I give a damn about).  And 2.  The action sequences.  While the animation was standard at best, the action sequences managed to for a moment, forget that you're watching a show that about a guy molesting his stepsisters (wait a second...that sounds familiar.), but rather one that also centers around the idea of action and heroes vs. demons, to some degree.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nThe bland characters and the execution were really some big issues.  The story was never fleshed out enough for it to be different than any other hero vs. demon story, and the idea of the damsel in distress was really more of a bore than anything cause it just added another member to the useless female group, a group that we seriously don't need to add more characters into.  Above all though, I have to say, like what I've been saying this entire review, the fanservice by far is the worst thing to come out of this series.  Not only is it prominent, so prominent that it's both ruined the story and my viewing experience, but because of the way it's presented, you probably won't be able to see it until a blu-ray release.  \\n\\n\r\nWould I recommend this show?\\n\\n\r\nHonestly, I feel like this show is a waste of time.  Throughout its runtime, there wasn't anything that stood out.  The story wasn't made to be interesting enough, the characters were bland to all hell, and there wasn't anything fantastic aesthetic-wise.  Because of how strong the fanservice was, there really wasn't much to make note of, thus creating this series' downfall.  (I still don't know why they're making a second season.  It boggles me.)  If you want some hentai-esque material, go ahead and watch this.  Make sure to get the DVD uncensored version because if you're watching for ecchi, I can guarantee that you that as of this review, you won't be able to anything but censor bars.\\n\\n\r\nOverview:  5.00/10",
            "date": "2015-03-25T22:13:00+00:00",
            "helpful_count": 11,
            "mal_id": 183404,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=183404"
        },
        {
            "content": "(reposted because I apparently forgot to update my episode count to show as complete. Derp)\r\nTL:DR: Testament of Sister New Devil is ecchi at its most ecchi & not in the least bit ashamed of it. It's the kind of show that validates every criticism & concern non-ecchi fans have of the genre & non-anime fans have about Japanese cartoons in general. But aside from that, it's pretty fun, albeit in a masochistic, I can't believe what I'm watching but I can't look away kind of way. Not to be watched with other people in the room...or within hearing distance.\r\nBoobs. If there is one thing teenageboys &amp; lonely authors love, it's boobs. Boobs can be big; they can be small; sometimes they're not there at all. But one thing is for sure, where there are women, there are boobs. &amp; where there are boobs, there are good times to be had.\\n\\n\r\nOur story begins with one Basara Toujou. For reasons that don't matter, he is accompanying his father to a restaurant to meet his two new stepsisters, yet only one of them seems to be waiting at the table. Needing to pee, he excuses himself &amp; makes his way to the toilet, where he shockingly encounters a busty red head mid business. As you would expect of someone whose just been walked in on while on the toilet, she makes to scream, &amp; being a male of strong character &amp; morals, he does the reasonable thing of pinning her against the wall to stop her doing so, for fear that they might cause a scene in a public place.\\n\\n\r\nIt only gets better from here.\\n\\n\r\nTo cut a long story short, said red head is by hilarious coincidence his other new stepsister. Only they're not really his stepsisters, as that was just a story contrived by his father for no reason. In fact, red headed Mio is the daughter of the recently deceased Demon Lord &amp; is on the run from those within the Demon realm who want to capture or kill her for her power. Maria, her loli goth companion, is actually Mio's succubus bodyguard. A rather pointless attempt by them to get rid of Basara reveals him to actually be a Hero, the enemies of Demons (but in that yin yang kind of way where they're more concerned with keeping each others powers in balance than defeating each other) with magic powers of his own. This awkward business out of the way, it's time for the show to get what it's really about, a guy &amp; several girls who all insist on calling him onii-chan while the line between ecchi &amp; hentai gets pushed to its limits.\\n\\n\r\nYes, Testament is one of those shows that, to put it in a sentence, basically takes the setting, characters &amp; general plot of High school DxD &amp; sets about seeing how far they can push it before the censers tell them to go straight to DVD. The story is your basic angels (heroes) vs demons affair with the main characters caught in the middle while they just try to live normal teenage lives. The characters are barely worth mentioning for anything but their aesthetic qualities. In addition to the main trio, we also have Yuki, Basara's aloof childhood friend who apparently hasn't been talking to him until now but boy is she going to be a third wheel in his &amp; Mio's \"romance.\" Takigawa fills the role of the one other male character who isn't a one episode antagonist or parent. Would it surprise you to know he likes talking about girls? Actually that's selling his character a bit short as he does play a more significant role in the story that most token guy friends do in anime. Oh &amp; I guess there is Basara's aforementioned father, but he makes his excuses to leave his son alone with Mio &amp; Maria in the first episode so we need not mention him again.\\n\\n\r\nBut lets face it, we're not here for the characters or indeed the story. We're watching for that other kind of “plot” that hides behind clouds of steam &amp; light beams, &amp; boy does Testament have that in spades. One of the more contrived ideas introduced early on is the master – servant contract Maria convinces Basara &amp; Mio to sign in the second episode. Nominally, the idea is that it will let them know where each other are &amp; help them both get more powerful, but there's a sexy twist. You see, because Maria's a succubus, &amp; because the contract goes a bit wrong &amp; makes Basara the master (they never actually properly agree to the contract, but lets not sweat the small stuff), Mio now finds herself cursed to go like your mum did at fraternity parties whenever she thinks mean thoughts about him. The only prescription for this fever, it turns out, is for Basara to molest her repeatedly. He doesn't want to, of course, but his manly man duties as both a male &amp; her brother (seriously he makes that point about them being family a lot) mean he has no choice but to grope &amp; grapple with her cleavage until the curse is lifted. The first time this happens, we fade to black (with many a “no onii-chan” screamed) only to see Maria cleaning up a puddle on the floor while commenting about how many times Mio came. 10/10 IGN best plot ever.\\n\\n\r\nThe show feels like it's constantly trying to one up itself as its ecchi scenes come ever closer to crossing into hentai as the series progresses. Yuki, naturally given this is anime we're talking about, upon learning about the contract between Basara &amp; Mio decides she wants in on that too. So once again poor old Basara has to go through the oh so unhappy job of finding her erogenous zone as well. In case you were expecting it to also be her breasts, more fool you. She's relatively flat chested you see, but she got da booty &amp; that's where the booty be stowed, so to speak. You can imagine how little of that scene was viewable. Weirdly (or not), Yuki signing a contract with Basara is not so much a source of jealously to Mio as it is the start of Mio &amp; Yuki becoming friends, or at least frenemies, I guess due to their both being in bondage together. Porn logic, I guess. &amp; if you were worried the final episode might try to take the high road, fear not. I won't go into details, suffice to say we get hentai's favourite motif: sexual assault that turns into consensual fun times because she totally wants it, really.\\n\\n\r\nIt's hard for me to really explain what watching Testament is like. The best I can come up with is that it's a bit like reading The Tale of Scrotie McBoogerballs from South Park. The ecchi scenes are so...well ecchi &amp; so creepy that it's impossible to watch without audibly groaning in discomfort. Yet watch I do, cursing myself for it but doing it all the same. It isn't erotic in any sense, although I think it's supposed to be &amp; I might think it was if I was 14 &amp; hadn't discovered internet porn yet. The censorship is pretty heavy, as you'd expect, &amp; pretty in your face about it, especially after the first few episodes when they introduce chibi versions of the characters to cover up the goods. Some people may find that annoying but personally I actually prefer that kind of censorship. It's funny to me when the makers pretty much cock-block the audience with a “buy the Blu-Rays, perverts” chibi stamp. It's not like you don't know what breasts drawn by someone whose never seen a real pair look like, anyway.\\n\\n\r\nOf course you don't just want to know what the show has, but how it looks. Well the art itself is pretty good, if nothing beyond standard. I have seen others comment on characters going off model at times but tbh I've not really noticed it yet. What I have noticed is that the overall animation quality is pretty poor. Jerky movements, apparent jumps between key frames with no in betweens, reused footage &amp; other little things occur with enough frequency to make me question the editorial skills or resources of whoever was in charge of proofing everything. It stands out in particular when compared to the opening animation, which is surprisingly well made, with smooth character movements &amp; a rare sight of characters slowly rotating without looking jerky or weird as their perspective changes. It is perhaps unfair to compare an opening credits sequence with the show as a whole, but the difference in quality between them is noticeable.\\n\\n\r\nSo there you have it. Thus far (&amp; I don't expect anything to change) Testament is an ecchi for the sake of ecchi high school fantasy with no real redeeming qualities beyond cheap titillation &amp; attempts to push the boundaries between what is &amp; isn't allowed on TV. That it's the most popular new show of the winter season according to Crunchy Roll doesn't fill me with confidence of the anime fandom, but then again shows like this have been bizarrely popular since at least the 90s, so it's not like its anything new. It doesn't try anything new but it also doesn't ask its audience to think with anything but their genitals, which makes it pretty easy viewing if you can switch your brain off enough to get past the really creepy when you think about it context to a lot of the ecchi stuff going on. There's much better ecchi shows out there, but you could do worse than watch this one.",
            "date": "2015-03-27T17:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 183660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4095221.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lancehot",
                "username": "Lancehot"
            },
            "url": "https://myanimelist.net/reviews.php?id=183660"
        },
        {
            "content": "This anime is very similar to Highschool DxD. My review might be biased because I loved Highschool DxD, but this anime fulfill my beliefs. As a Junior in High School, I can tell you that this anime is the best. The main characters are really well developed and viewers get to see each characters background. The second season to this anime fulfills that even further. The battle scenes aren't that bad, and the music isn't half bad. I liked the animation quality because I found it to be fluid. The story is similar to DxD and the Enjoyment is definitely there. Overall, to me thisa 10/10.",
            "date": "2018-12-07T08:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 295385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7361363.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SunnyB0y",
                "username": "SunnyB0y"
            },
            "url": "https://myanimelist.net/reviews.php?id=295385"
        },
        {
            "content": "Shinmai Maou no Testament is definitely an interesting series. Evidently, a range of inconsistent reviews render it to the category of \"you either hate it or love it\".\r\nThe overall story is simplistic at best. The character development offers nothing unique; a hot red-head is presented as the primary love interest, a long lost childhood friend is introduced almost immediately after, former enemies develop feelings for the main character, and so on. Most of these clichés are now well-established fragments of the harem genre. \r\nThe battle scenes are not exactly terrible, nonetheless they offer nothing special. The overall animation and sound quality are also quite ordinaryand not memorable.\\n\\n\r\nWell then, it begs the question; why is an average, mediocre series rather interesting? Bluntly speaking, the sexuality in this series is beyond over the top – make no mistake, if you happen to be watching the uncensored version, the ecchi and fan service scenes turn into borderline hentai. I found myself questioning whether I was watching an ecchi/comedy or hentai on numerous occasions. Further, the show takes itself very seriously into catering the “step-sister” fetish. By the 3rd episode, I realised it was a guarantee that a serious scene will be followed by “onii-chan I need you touch me” scene.\\n\\n\r\nAnd this reviewer feels the poor juxtaposition of such two scenes is the downfall of Shinmai Maou no Testament. The willingness to push into hentai boundaries leaves little in the comedy to be desired. The attempt to connect the sexuality into the story is rushed and poorly executed. Granted, the story is neither thought-provoking nor original, however at least the comedy could have been much better appreciated overall if the show didn’t emphasize the “I must pleasure my sisters” element so seriously. \\n\\n\r\nNevertheless, much of the series is entertaining enough for harem/fantasy fans. If you can tolerate borderline hentai, I would encourage you to check out at least the first 3 episodes and see the interesting juxtapositioning for yourself. \\n\\n\r\nFor what it’s worth, here’s a summary:\\n\\n\r\nDO WATCH IF:\\n\\n\r\n- Enjoy watching a likeable MC slowly acquire a harem\\n\r\n- Enjoy demon – fantasy settings that are not gloomy but rather comedic\\n\r\n- Interested to see an ecchi series pushing the borders into hentai",
            "date": "2015-11-25T00:11:00+00:00",
            "helpful_count": 9,
            "mal_id": 204140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4914587.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/cTilki",
                "username": "cTilki"
            },
            "url": "https://myanimelist.net/reviews.php?id=204140"
        },
        {
            "content": "Shinmai Maou no Testament - or the Testament of SIster New Devil is another one of this season's battle harems. With focus on powers, ecchi and girls, this is the typical classic harem, just better. Definitely recommended for everyone who likes a good story.\r\nStory: 7/10\r\nSurprisingly, this is one of the stronger parts of this show. While many harems tend to have a very brainless story, the plot is just secondary and mostly disappoints. However Shinmaoi Maou manages to introduce quite a lot of interesting plot twists and introduce mysterious characters masterfully, while still keeping faith to the usual harem tropes. It also set a goodbasis for the second season. Sadly, the big picture of the storyline remains predictable and a tad generic.\\n\\n\r\nArt: 9/10\\n\r\nWhile mainly used to animate boobs and censor unwanted body ares, I was pleasantly surprised by the art style. Especially the MC and his father had some badass looking scars and overall style. The enemys and monsters aswell were quite an improvement from certain other shows who decide to simply not animate those. Ecchi is all censored, but imagination is the best artstyle amirite?\\n\\n\r\nSound: 8/10\\n\r\nWith fitting male voices, good battle music and really good OP, this department also did their work. I didnt quite like the battle effects and the exaggerated moaning, it mostly felt unnecessary and out of place.\\n\\n\r\nCharacter: 9/10\\n\r\nWhat? A harem gets 9 in character? Yes, its true. For the first time ever, we have a quite intelligent and not just plain dense MC who annoys the hell out of us, he actually takes the initiative and gets to town himself. THe girls of course are simpler, but more independant and powerful than what you'd actually expect.\\n\\n\r\nEnjoyment: 10/10\\n\r\nYes,I love harems. But this show has so many good things. We finally see some damn villain die, we see an MC that does dirty things with his harems and we get the feeling of a more natural approach to the whole ecchi theme. Of course, in the censored version we get to miss a lot of the interesting things - if you know what I mean - but as soon as the blu-ray is released this will turn to the better side. \\n\\n\r\nOverall: 8/10\\n\r\nHonestly, a quite funny and well done show who's also suited for a non-harem lover. While this may not apply to everyone, I'd suggest waiting for the uncensored version - like with Highschool DXD, while its pointless, it somehow just makes it better.\\n\\n\r\nThe next season is gonna start in october, so I'd suggest everyone to have watched it until then - with an appearant high budget and big fandom, we can only expect that the second season is even better!",
            "date": "2015-03-26T12:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 183486,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4221129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Urbanophiler",
                "username": "Urbanophiler"
            },
            "url": "https://myanimelist.net/reviews.php?id=183486"
        },
        {
            "content": "Gods I don't know why I watched this anime as long as I did... I probably would've dropped it so SO much earlier if it weren't for the amount of censoring that was in it... The problem is that with anime like No Game No Life (which is still fairly ecchi without going over the top... might be a bit of a stretch to say) and this being the same rating on here (R+ Mild Nudity), I was going in expecting not to have the shock that I actually got...\r\nThen I realised how f***ed up this anime actually was around episode six or seven... I'mone of those people who impulse skip certain moments to forget that they ever happened, so it took me a while to realise how many moments I was impulse skipping before I went 'okay, this is over the top.\"\\n\\n\r\nThe story starts out with a premise that tries to be unique, but, when I look back on it, it really was quite f***ed up to begin with. Extremely awkward moment where the two main characters meet (And like Leonard from the Big Bang Theory when meeting Sheldon for the first time, this should have been my first warning to how the anime would go.)\\n\\n\r\nI will admit that the story was interesting. A runaway demon lord, a hero exiled from his village, some people on both sides who don't want them to live in peace... Sounds familiar, but the execution was done poorly. There is a different anime that has a similar plot that is much more interesting. The main detraction from the story has to do with the fact that one of the main characters is a succubus who puts the two characters in this awkward bond that doesn't let any moment in the anime stay normal for more than three minutes...\\n\\n\r\nThe character designs and art, not much I can say about it. Generic, but not terrible. Music a bit less than good. Once again, the awkward scenes really detract from the rest.\\n\\n\r\nCharacters are interesting in my opinion, except for those awkward moments that really detract a lot of value from the characters... and little miss succubus who just grates on my nerves... Hero who was exiled from his hometown after unleashing an epic power who is trying to be normal. Demon lord who is trying to be normal. Succubus who is trying to f*** up both their lives. A childhood friend who wants to help them but has a code of honour to uphold... In any other situation, I would like 3/4 of these characters... the third one being the one I'd hate under any circumstances.\\n\\n\r\nMy Enjoyment with the anime was a it awkward. As I mentioned before, I unconsciously skip past any scene to any scene that is either an awesome fight scene or some scene with some slight comedy... Then after the episode I would remember there were those scenes and I would suddenly hate myself for enjoying the other parts of the anime... It was weird...\\n\\n\r\nIn all honesty, I think there is a good concept in this anime, but the huge amount of ecchi really brings down the quality of this anime. As I've said, there were moments that would've shined had it not been for the unnecessary amount of ecchi throughout this show. Sure, there are those weird people out there who would enjoy this sort of stuff, but the rest of you, I would say that this anime is not worth watching.",
            "date": "2015-04-29T04:47:00+00:00",
            "helpful_count": 8,
            "mal_id": 186736,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3598913.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sachi_shimazu",
                "username": "sachi_shimazu"
            },
            "url": "https://myanimelist.net/reviews.php?id=186736"
        },
        {
            "content": "A lot of people havent enjoyed this anime, the score is honesty much lower then I think it should be. People have their own reasons for not liking it, but if I had to say what one big reason for why people didnt like it, it would be the DAMN CENSORSHIP OVERLOAD.\r\nI actually started watching this series when it aired, I watched the first episode then immediately gave it a 4 and dropped it.\r\nWhy?\r\nBecause the censorship was so ridiculous I couldnt take this anime seriously, the censors ruin any mood that is built up.\r\nBut then the uncensored version was released, and so I gave itanother try and was not disappointed.\\n\\n\r\nStory: 6\\n\r\nIts fine, protagonist protects girl from baddies. Honestly not much, pretty generic but done right.\\n\\n\r\nArt: 7\\n\r\nThe characters look good, the backrounds are solid, but nothing overly eye popping. Except for, you know, \"Those\" scenes. Animation in \"those\" scenes very smooth. The fight animations are well, what you would expect, theres nothing top notch but still good.\\n\\n\r\nSound: 8\\n\r\nThe OP and ED are okay, nothing special, after seeing it once I would then proceed to skip them in other episodes.\\n\r\nThe ost however, fits the  mood in whatever is happening. \\n\r\nA silly scene, a catchy upbeat theme.\\n\r\nAn intense scene, a badass serious theme\\n\r\nHere we go, the VA's are top notch.\\n\r\nMio's squeals are refreshing, its not the usual \"Kyaa\" it actually sounds like a woman screaming.\\n\r\nBasara's voice definitely fits, a nice manly voice which changes to the situation. I know his VA as characters who are silly, so it was surprising how well it fit in the serious scenes.\\n\r\nAnother I would like to mention is Takigawa's voice, his VA I never would think would suit him but I was wrong as he thoroughly pulled it off. I underestimated his abilities as he did a beautiful job doing him.\\n\\n\r\nCharacter: 7\\n\r\nBasara is a great harem protagonist. When compared to others such as Rito (To-Love-Ru) or Issei (High School DxD), this guys in a league of his own.\\n\r\nHe acts just as a normal man would when a hot chick comes on to him. \\n\r\nHe has self control but also a realistic breaking point.\\n\r\nAnd one great thing about him is he's not one of those characters who would defeat a really trashy enemy and not kill him. Like \"Oh yeah, im not gonna kill you so you can come back and cause more trouble that could potentially harm someone important to me\" \\n\r\nBasara gets stuff done.\\n\\n\r\nIm not going to review all the girls but I will say that none of them are unlikable.\\n\r\nUsually in a harem, there will always be one girl that annoys the hell out of me, but not here. Every girl here is great in her own way.\\n\\n\r\nEnjoyment: 8\\n\r\nI enjoyed it a lot. To the action packed scenes to their daily lives theres not a dull moment. The last episode didnt end badly either like some other series im thinking of.\\n\\n\r\nOverall: 8\\n\r\nIn conclusion, \\n\r\nWith censorship: 4\\n\r\nWithout censorship: 8\\n\\n\r\nDONT WATCH IT CENSORED.\\n\r\nIT WILL RUIN IT.\\n",
            "date": "2015-10-25T22:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 202008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2216395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raydnt",
                "username": "Raydnt"
            },
            "url": "https://myanimelist.net/reviews.php?id=202008"
        },
        {
            "content": "Very similar to HS DxD, but with more ecchiness. I mean, the intimate sexual acts are really great, you either would call this hentai but its not but it looks like one.\r\nGod/Angels vs. Demons vs. Humans and within them thier own faction issues like betrayal and forming new alliances.\r\nAnd the master servant pact.... its both a curse & benefit, depends on which side you are.\r\nBasara's personality drastically changes during the master-servant initiation ceremony and the side effectsafter pact was made. From a gentalmanly calm, naive, innocent seemly clueless teenage boy on how to make his servants happy by making them moan in ectasy, he begnto make sexual acts (ala hentai way) towards them and for a moment he was ashamed and refuse to do so..... talk about playing it hard to get.....\\n\r\nMio seems to be the most ecchi character next to Chisato, She appears to be a average 11-12 y/o girl but she hidden locked her real form (as a mature teenage succubus, her powers increases) and can be unlocked if she wants to.\\n\r\nThe story is not bad but lacks other character participations, the story revolves mostly on the main casts daily lives on how to live everyday filled with mischiefs that leads to having sex due to various reasons. Only the last 4 eps. where the story finally picks up..... but many questions still remained unanswered. Hopefully season 2 can answer and most character inter relations and more action but still maintain the hot moments as those are the anime's trump.",
            "date": "2015-10-06T15:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 200665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3392897.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animatopia",
                "username": "animatopia"
            },
            "url": "https://myanimelist.net/reviews.php?id=200665"
        }
    ],
    [
        {
            "content": "Well, this has been the biggest roller-coaster of lewdness and perversity i've watched since DxD, but that doesn't mean it's good, nor does it mean it's bad, but, eh, this show just hits some buttons right and some very wrong, and i'm not even sure which ones, well, this should be fun...\r\nStory: 7\r\nSo, Shinmai Maou no Testament follows our lovely MC Toujou Basara, as he is suddenly thrown in the deep end with his two brand-spanking new step sisters being demons, and what's that?!? Basara is actually a former hero from the opposing clan?!? WHAA-? As you can see, these *cough* innovative *cough* introductions basicallyplot out the course of the show, with the introduction of new characters at frequent intervals, and the big finale practically writing itself. The story isn't bad by any means, but the depth is worse than the shallow end of the kiddy pool. I can't say a huge amount more without spoiling the outcomes for some characters and how they fit into the final battle but I will say that plot-wise, it kept me watching, and probably will keep you watching as well, that it because 90% of your attention will be set on the abundant fan-service scenes with lots of uncensored boobies!  \\n\\n\r\nArt: 6\\n\\n\r\nSo the art is average, characters are very generic looking, and as much as it looks alright, it's easy to get bored looking at it. If you've seen any other magical, demon, supernatural, ecchi show like this, then you'll instantly recognise the magic insignia's that appear when attacks are launched, the sparkling effects of weapons appearing and dissipating, stuff like that. Not to say it hinders the art style, but it's not hard to say it's overused. Animation is about on par with a lot of shows involving a story such as this one, it's good enough, but won't blow your mind. Also boob jiggle physics animation is on point.\\n\\n\r\nSound: 8\\n\\n\r\nSo the opening of this show is fucking amazing, absolutely loved it, the ending is fairly good as well so you've got that to look forward to when you start each episode. SFX is as expected, metal clanging sounds and magic blasting sounds can be picked out and heard in various other anime but really it still sounds good and adds the intended effect. Voicing for most characters was fitting, one character though I wish had more dialogue simply for his voice actor is Jin Toujou, Basara's father. Keiji Fujiwara's voice is music to my ears. His voice and the OP managed to bump the sound up to a solid 8.\\n\\n\r\nCharacters: 7\\n\\n\r\nWell, shall we go through the list of generic characters that populate this and hundreds of similar shows? Yes? OK THEN! We have the shy, yet totally in love with MC girl. Perverted girl, who happens to be the loli character AND the comedic relief character. We have the cold-monotone voiced character who also plays the role of childhood-friend character. There's the hot sensei who gives MC advice. And there's a few more I really shouldn't have to list just because you know them already. These persona's respectively belong to Mio, Maria, Yuuki and Hasegawa. Oh, and there's the main character, Basara. Who is a lot like other MC's in that he would NEVER, EVER do anything lewd to his harem members, and gets all embarassed and what not when walking in on them, but he is very powerful from the beginning of the show, something that is used nowhere near as much as the good old \"weak at the beginning and then gets stronger as more and more women begin to appear and fall in love with him\" strategy most harem, ecchi, action, magical anime use. But it does work for our MC Basara in this case as he is actually a very good character with a mildly tragic backstory with a lot of experience, and they do show his experience throughout the show, which I did enjoy very much.\\n\\n\r\nEnjoyment: 7\\n\\n\r\nI'm gonna explain my enjoyment of this show with an analogy, imagine your really hungry, like starving, like about to keel over due to your stomach attempting to digest itself. You spot a fast food outlet, and next to it, a gourmet restaurant. They both cost the same amount of money. you can either go to the fast food place and get a quick, alright meal that tastes pretty good and satisfies your hunger, or you can go to the restaurant and order a magnificent 3 course smorgasbord of food that will take you to another world, but it will take a long time to prepare, and your hunger is getting worse with every passing second. You opt for the first option, this show is the first option. Shinmai Maou will satisfy your hunger for lovely pairs of uncensored boobs and fan-service, you'll get it quick and easy because they're in almost every episode, and in the end you know you could have gotten something better. But you don't regret getting the fast food, because it did it's job, it could have done it much better, but you are no longer hungry. Hopefully that made an ounce of sense to some of you reading this because I really do think it was a viable option in judging my enjoyment of this show. \\n\\n\r\nOverall: 7\\n\\n\r\nAll in all this show was good, but it wasn't very good, or great, or a masterpiece, just good. I enjoyed watching this show and I am going to watch the second season simply because I don't regret watching yet another tit-filled harem with generic characters, as odd as that may be, i've seen a fair amount already. If your looking for something like what the synopsis describes, and don't mind the bountiful fan-service, then watch it, but for those who can look at the cover art, the characters and the synopsis and can already predict the story of each episode, this show might not be for you, unless of course you're into this kind of thing then by all means watch away with pride. Like I said at the beginning of this now much longer than I intended review, this show hits some buttons well, and others not so much. And it won't resonate well with everyone regardless of how many similar shows you may have seen already. But for what it's worth, Shinmai Maou no Testament will make you laugh at it's stupidity, and then make you laugh more at it's boob physics. And once it achieves that smile from you, it's done it's job well enough I say. \\n\\n\r\n~Xeno156",
            "date": "2015-10-13T19:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 201201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3628979.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xeno156",
                "username": "xeno156"
            },
            "url": "https://myanimelist.net/reviews.php?id=201201"
        },
        {
            "content": "FULL DISCLOSURE: I have not read the manga/light novel. If you like going into anime without knowing anything specific about them, I suggest skipping the STORY and CHARACTER sections, and go straight to ENJOYMENT after reading ART+ANIMATION.\r\nART+ANIMATION: \r\nAnimation is good, but nothing to put it in its own category. A few scenes were notably lacking in smoothness while a few others were noticeably smoother than average. One or two scenes were worthy of being called epic.\r\nArt is good, interesting real use of shadows on characters that I haven’t noticed in the genre before - its a really little thing, but it made it feel slightlyhigher quality. The ultra-form-fitting clothing and lifted chests is no big surprise, but is not overdone. \\n\\n\r\nThe in-show music is good and matches the theme and mood. Sound effects are good but not amazing. Theme song is standard-issue.\\n\\n\r\nThe version I watched was heavily censored to the point of being annoying. Some uncensored scenes were arguably more worthy of being censored than ones that were. Considering the audience and purpose of the show, I don’t really see the point of rays of light or chibi characters covering half the screen whenever those scenes occur. With all the moaning and other noises, the censored version isn’t all that more appropriate than the uncensored for those below the maturity level. Uncensored version shows all the tongue action, nips, and panties.\\n\\n\r\nSTORY: \\n\r\nCould be best described as a demon-ecchi-harem with above average plot and battle sequences. The concept itself isn’t all that interesting. The focus on ecchi thankfully isn’t so strong that everything feels stupid or forced. There are quite a few generic motives used but they are not unrealistic or rampant. \\n\\n\r\nThere is some BS for the sake of sexual humor and fan service. Basara has some pretty strong plot armor. For a light-hearted anime such as this one I’m willing to overlook some of the BS. There are no major discontinuities, but there is some withheld information in the beginning that made the lead’s easy acceptance of the events to be hard to believe. At the end of the season it is still not certain what that information is.\\n\\n\r\nIt was never made clear why some demons choose to be peaceful, but one can assume it is because there are non-violent ways to obtain magic or power. As in other series, the demons may just be a magical race that exists in the world of humans but aren’t necessarily evil.\\n\\n\r\nBattle choreography is good, but surprisingly communication within battles is better than most. The mood of battles is done much better than others in the genre that focus mainly on putting the hotties in the most compromising viewing angles possible. Characters in the battles are not simply forgotten about or wasting opportunities like in some less thought-out series. \\n\\n\r\nThe scene to scene mood shifts are handled pretty well and there is a good feeling of tension in the right parts.\\n\\n\r\nThere are some meaningful quotes made throughout the show. By the end, it feels as though almost every interaction had a story-driven purpose behind it.\\n\\n\r\nBasara makes a strange turn of character towards the very end – maybe to avoid showing that side to the others. Thankfully the season ends overall in a light-hearted way, with a perfect draw-in to a second season.\\n\\n\r\nCHARACTERS:\\n\r\nOP hero lead, tsundere demon girl, loli succubus, and hero girl are the main characters. They are not flat, with a decent amount of proper backstory and justifications for their actions and feelings. The overly-conscious male, tsundere, and pusher dynamic is nothing new but considering their roles and backstories it doesn’t seem too unreasonable. Being a mix of heroes and demons, the main characters are subject to enemies from both sides.\\n\\n\r\nThe lead and his father have been exiled from their hero village due to the son – strongest boy in the village – causing a huge accident. This allows some other hero characters to come in later holding grudges against him. This doesn’t, however, explain why one particular hero he is reunited with doesn’t hold a grudge but instead is quite cozy with him. The lead is inexplicably able to free himself from even the strongest mind control or sleep agents, and has the ability to nullify or deflect close to all magic with enough yelling and face-scrunching.\\n\\n\r\nThe demon girls are attractively designed without being too overwrought. Male demon designs seem underwhelming. The heroes all have a similar uniform but otherwise look like more normal people.\\n\\n\r\nVoice acting is good but nothing special.\\n\\n\r\nENJOYMENT: \\n\r\nMy inner 15-year old likes ecchi-harems with action, so I enjoyed this. There were moments where I was rolling my eyes from the lack of justification or plot armor, but the humor allowed me to overlook many of those. Helping to prevent it from feeling tedious is a decent balance between the everyday lives with humor and fan service, the character development, and the battle scenes \\n\\n\r\nThe battle scenes are nothing compared to my absolute favorites, but they are enjoyable enough here. The characters change enough during the season to feel invested in them.\\n\\n\r\nOVERALL:\\n\r\nMost of this anime’s traits lie just above average for the genre. The concept is a little weak in my opinion, but the story aside from its occasional unrealistic justifications is enjoyable as long as you aren’t looking for a psychological thriller masterpiece. \\n\\n\r\nThe story is ever so slightly too fast-paced but care is taken to properly portray the moods.\\n\\n\r\nTL;DR:\\n\r\nAll around better than average action-ecchi-harem about demons and heroes. Feels slightly forced as is the norm, but is light-hearted and still full of fan service – especially uncensored.\\n\\n",
            "date": "2016-12-11T11:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 235270,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235270"
        },
        {
            "content": "This is my first review so please don't hold a grudge.\r\nIt is a harem anime, so if you like harems i would recommend you to watch this anime if not DON'T.\r\nThis Anime has a lot of mixed feelings, some are scoring it a 6 and some an 8. The anime that is a lot like is Hischool DxD, though in my opinion it is better. It has better fights and the MC isn't an annoying horny kid who isn't getting any stronger after 2 seasons but the characters are in both anime's equally good.\r\nStory: 7\r\nThe story is good but don't expect anything from it. Inthis world exists demons and a clan that is called the heroes clan. A girl that is the daughter of the former demon lord is being chased after by the new demon lord. The MC right in the beginning of the first episode is told that he is getting 2 step sisters. And right from there is your typical \"I have to protect them\" thing. But I don't dislike these sort of stories. \\n\\n\r\nArt: 7\\n\r\nThe art isn't anything special but the character models are pretty cute so that's why i give it a 7. BUT the one thing that annoyed me was that when they where \"having sex\" the frrikking screen was overloaded with censored prictures. They could have just uncensored it like DxD or just throw the echhi part away. It was pretty pointless to watch it when the only thing you could see where the characters faces.\\n\\n\r\nSound: 7\\n\r\nI never really draw my attention to the music, but sometimes when i did pay attention it did have a pretty good soundtrack and the opening is also pretty good. Most of the characters voices do fit with the charaters imo, but the only VA I wasn't really fond of was the MC's. I think it is because I hear in a lot of anime's and have become tired of his voice (that is just what i think). \\n\\n\r\nCharaters: 8\\n\r\nThe characters are pretty good. The MC isn't a wuss like the MC of DxD so that is a +1 in my book. There are 3 main girls. One is the former demon lord's daughter who is you typical tsundere BUT she isn't annoying like most tsundere characters in most anime. Tsundere characters are one of the most annoying type of characters in anime's because they most of the time are valiant who are always abusing the MC of beating the crap out of him, luckily it isn't the case in this one. The other girl is a succubus who is always scheming to get the MC in a horny situation. And the last one is the girl of the Hero clan who happens to be the MC's childhood friend.\\n\\n\r\nEnjoyment: 9\\n\r\nI did enjoy myself pretty good.\\n\\n\r\nOverall: 8",
            "date": "2015-04-09T13:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 185228,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/340953.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/burnit_117",
                "username": "burnit_117"
            },
            "url": "https://myanimelist.net/reviews.php?id=185228"
        },
        {
            "content": "Another review from yours truly watched this yesterday but didnt really feel like reviewing it but just broke my promise and gonna do it anyway.\r\nLiked the anime but wasn't great due to terrible hit or miss comedy scenes and the worst censors I've seen in anime\r\nStory- The story in a nutshell is basically the main character named basara moves into a new home with 2 girls who are his adopted sisters and his father tells him to protect them at all costs so the story revolves around basara trying to protect his family but one of his sisters are demons one the daughter of ademon lord and the other a succubus a succubus is basically a demon that makes you do lewd things so sexual and perverted stuff in a sense..... To add on without spoiling it too much they make a pact and it kinda is if she acts in a weird way or what not lust takes over her body and he has to calm her down..... thats the main fanservice in all of this a decent story not really good but good enough the really bad censoring ruins alot of the story and makes what was something serious a stupid funny matter even though its not gonna make you laugh.\\n\\n\r\nArt- As far as everything visually its really decent and by that i mean good nothing out of the oridnary good fight visuals just nothing bad about that but... because this is an ecchi and it has the dxd type of feel you expect those awkward weird kinda perverted moments which you do get you really wanna see em but then the ridiculous damn censorship ruins it i mean like really ruins it just a giant chibi version of a character blocking the screen a blinding white light or a giant caution tape with pictures of the characters faces on it i mean its so damn ridiculous why make it like a Soft H-anime and then ruin it by the ridiculous censors at least make the censors smaller or just do what kiss x sis did..... like really it ruins alot of the scenes in the show\\n\\n\r\nSound- Nothing bad like at all decent opening meh ending song good background songs during the fight scenes it was good no complaints.\\n\\n\r\nCharacter- The main character is good as far as im concerned but no character development but what can you do its a harem all the dude main characters are usually the same..... Mio the daughter of the demon lord is cute.... to say the least her character kinda changes in certain scenes when shes angry or when the effect of the contract between her and basara occur shes likeable and maria the succubus is also likable does super lewd things but thats what she does thats the type of demon she is nothing about the main characters turn you off but as you get deeper in the show you will find more you like and more you hate and others your unsure about.\\n\\n\r\nEnjoyment- i guess as a fan of anime like dxd this caters to my liking i dont hate this anime i mean its got its goods and bads.... Decent story, good art, nice battle music, likable characters but the bads or should i say bad* being the censorship kills the pure enjoyment that you are hoping to get from the show id love to give this show a review of  8/10 - 9/10 based on my enjoyment but the dang censorship is way to much and absolutely ruins the ecchi experience of the show its just disappointing to see the ANIMATION company really were trying to troll the viewers with how bad the censorship were and how much they blocked too much just too much.....\\n\\n\r\nOverall- A decent show killed by The animation Company's censorship thats all that really killed the show if the censorship wasnt in the show it would be quite good if it didn't have the hit or miss comedy it would be a good show but the hit or miss comedy and terrible censorship hinders it from being a good show so i think a 6/10 is fair..... especially for an ecchi lover the animation company failed with the terrible censorship so i cant blame the makers of the anime only the people who decided to make the censorship so bad.....\\n\\n\r\nFinal judgement- would have made for a good harem action anime with decent characters but terrible comedy that is hit or miss and just bad censorship it made the show just fair so a 6/10 is fair as for me. 2nd season later this year lets hope the censors arent as terrible\\n\\n",
            "date": "2015-03-28T20:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 183860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4511312.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Joel-Baxter",
                "username": "Joel-Baxter"
            },
            "url": "https://myanimelist.net/reviews.php?id=183860"
        },
        {
            "content": "MOD NOTE: May contain spoilers.\r\nWatching a car rust is more interesting than this show.\r\nDripping with excessive fanservice, Shinmai Maou no Testament (The Testament of Sister New Devil) is a failure beyond words. Enter Basara, a seemingly \"normal\" high school student, who, in reality, is an ex-member of the Hero Clan. Two demons enter his life - Mio and Maria - who will forever change the course of his life.\r\nSeems pretty straightforward, right? Not.\r\nThe Testament of Sister New Devil's plot is foremost its weakest point. Without going into too much detail, there are too many plot elements that are unexplained or weakly developed. For instance, wedo not know much about the Hero Clan except how it centers around Basara and his father. Its purpose is briefly mentioned, but the anime doesn't go into any further detail beyond that - which then makes it seem like the Hero Clan is only there for no particular purpose but to establish a dichotomy among multiple warring factions.\\n\\n\r\nFurthermore, this show has way too much fan service - up to the point where it significantly detracts from the enjoyment of this show. Fan service is practically present in every single episode, and it is usually presented in some overly exaggerated fashion that is completely unnecessary. Additionally, the censoring is done horribly - it mostly consists of patches of light or some random drawings/figures/animations to block out nudity - but you can still kind of infer what is going on. Don't get me wrong - some fan service is generally okay, especially if there is a reason behind it - but this is just beyond disgusting. All in all, pretty much every female character is treated as more or less a sex object in this show. Which is absolutely horrible.\\n\\n\r\nLastly, the theme is poorly incorporated into the story. If you've been carefully paying attention to this anime (or if you're about to start watching this, which I don't recommend to), there is one common theme that unites the plot: family. Everything Basara does in this series is to protect his family - again, which is a pretty good reason for someone to act the way he does. However, given this, this theme is constantly being shoved into the viewer's face. Every time after Basara does anything, he literally stops and then takes a second to explain that \"it's to protect my family.\" By the time you hear this the second or third time, you can basically figure the pattern out.\\n\\n\r\nEverything about this show is poor. Don't watch this. Please. I watched this garbage so that you don't have to. Save your sanity, I'm sure you have a lot of better things to do.\\n\\n\r\ntl;dr\\n\\n\r\nPros\\n\r\n- Can't really think of any, lol, unless you're really into fan service I guess...\\n\\n\r\nCons\\n\r\n- Horrible character development\\n\r\n- Poor thematic incorporation - themes should unite a plot, not be randomly thrown into the plot when the main character feels like it\\n\r\n- Inconsistencies within the plot line\\n\r\n- Plot does not flow well\\n\r\n- Excessive fan service that treats the female leads horribly and detracts from the plot",
            "date": "2015-11-15T17:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 203449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882647.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/-Remix-",
                "username": "-Remix-"
            },
            "url": "https://myanimelist.net/reviews.php?id=203449"
        },
        {
            "content": "When an actual plot can over weigh the trashiness you get SHINMAI MAOU NO TESTAMENT !\r\nSo this was a very interesting watch for me and for most people i could imagine the same. I always try not to look into an anime too much before deciding to watch it and Shinmai Maou No Testament is no exception. \r\nHoly moly as if I was watching High School DxD but with force intent to actually enjoy it. I can honestly say that I did ENJOY and emphasis on enjoy I might add however I literally thought this was complete hentai I and to my appeal there wassome kind of nice balance to all this. \\n\\n\r\nWe go from this weird two episodes of sacrifice (Protect the president) type of scenes to the extremely lewdy (please put the volume levels down so your family does know how much a perverted person you are which is completely unintentional). I swear I jump out of bed just to do so. However further through the series it became expected of me to do so. \\n\\n\r\nOne must transcend lewdness and accept oneself to accept Shinmai Maou No Testament and on that note thank Gawd for an actually plot to follow. I mean on a real the only reason this show scores low is because of the crazy lewdness, most end up stopping in the middle or completely skip through to the lewdness to reenjoy it if that a word. \\n\\n\r\nYeah so what you'll are some fun action moments accompanied by an lowkey OP protagonist trying to protect his little sister (please note that they are not blood related!) in a honest and pure way but ends up a little more than what that kind of relationship should be. \\n\\n\r\nHowever it is worth a watch to appreciate some crazy oppai sister and brother love you'll won't experience in any step-incest romcom fest. \\n",
            "date": "2018-01-02T10:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 267198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6811131.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Moytramai",
                "username": "Moytramai"
            },
            "url": "https://myanimelist.net/reviews.php?id=267198"
        },
        {
            "content": "For now I'll rate this anime as just fine... It's ok, story and plot are very good, character design and visual aspects are good too. Why 6/10 then? While enjoying story and visuals there were a lots of censorship covering almost whole screen. Censorship in ecchi souhld be banned. Especialy in this one. Even kiss was censored... Please, it's ecchi for purpose. In this way my enjoyment fell from 8-9 to 2... If that was just a trick forcing to buy DVD/BD version producers failed all the way. I can change my opinion when DVD/BD ver will be released.\r\nEDIT:\r\nAfter 2 uncensored eps I can saythat there are things that makes me enjoy this anime. Now \"PLOT\" is better if you know what I mean, So uncensored version scores 8/10 because there finally is ecchi in ecchi part of this anime, still I hope that 2nd season will be better than this and all signs are trying to show us that late autumn will bring quite good continuation of Shinmai Maou no Testament",
            "date": "2015-04-01T05:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 184367,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4508109.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hulek46",
                "username": "Hulek46"
            },
            "url": "https://myanimelist.net/reviews.php?id=184367"
        },
        {
            "content": "Testament is an action-based ecchi that caters to all tastes in every sense of the word. Need a dosage of hero? Check. Need a loli succubus? Check. Need a childhood friend? Check. Need a horny little sister? Check. Need a cleavage upgrade? Check. Need contractual weapons/relationships? Check. Need an overtly aggressive school nurse? Check. Need a demon world? Check. The list goes on but I'd rather not bore you further. In comparison to other shows, it is closest in my mind to High School DxD in terms of setting as well as ecchi levels. It does borrow heavy from numerous other shows such as Touma'snullification power (Index), the hero with demon theme that we've seen in numerous other shows (Yusibu, Hataraku Maou-sama, Maoyuu), and the need of a hero to check heroines' powers (Date a Live).\\n\\n\r\nOur protagonist, Basara, has always wanted a little sister and so his father goes and finds him two before taking off.Unfortunately, for Basara, these are no ordinary sisters and soon they soon use magical powers to try to kick him out of the house. Unfortunately, for them, Basara is a former hero and the son of virtually a war god and thus puts them in their place. However, learning of their true past, he decides to cave in and live the life of a harem king instead. This is the story of that harem and how Barasa continues to defeat foes in order to earn the right to continue fondling girls. Yes, because this is a TV show this is as far as it goes folks- granted it amounts to what is essentially soft core porn with just as much pleasure-based groans and orgasms.\\n\\n\r\n[b]Animation:[/b]\\n\r\nThe show is drawn in a rather saturated palette for a modern piece and features average backgrounds and shading. It's a typical setting for this type of a show so expect a fair amount of scenes in the house, city, and school. Characters are pretty well drawn though you shouldn't expect too many emotions other than embarrassment, elation, and anger.\\n\\n\r\nThere is a fair amount of action in the show ranging from melee to swords and magic. The effects are pretty good overall and you'll see multiple characters emit colorful auras. All of the characters in the show have distinct abilities and styles so you'll see a good mix in the fights. There is definitely a fair amount of blood and implied gore scenes, though they spare the viewer from the juicier details. With a perverted succubus as one of the main characters and a protagonist who's not too ashamed of putting his hands to action, you're sure to get a season's worth of ecchi. You pretty much get your full range of ecchi here from accidental peeping to seriously trying to dominate a partner. Surprisingly, considering the sheer amount of cliches here, there is no beach scene so a swimsuit scene will have to suffice.\\n\\n\r\n[b]Sound:[/b]\\n\r\nThe show starts with a light-rock OP with a fair melody. The ED is by a different artist though maintains the same feel as the OP. The BGM is fairly wide in instrumentation and ranges from orchestral to rock to vocals. It's a fairly active BGM though it stands out the most during tension-building and action scenes; there is one theme in particular that's pretty good.\\n\\n\r\nThe VA cast is rather mixed in experience, as there are relative newcomers such as Mio's VA Ayaka Asai working alongside VAs rising in popularity such as Sarah Emi Bridcutt. Regardless of prior experience, Ayaka Asai does a pretty good tsundere and an especially effective \"oniii-chan\" in dere mode. An above average performance overall, helped in part by strong, veteran male VAs as well.\\n\\n\r\n[b]Story:[/b]\\n\r\nAs in Hagure Yuusha, the former demon lord has died and now the vulnerable daughter needs protecting. Thus, our protagonist Basara steps in to fill in the role of protector, as well as abuser; as for some rather aloof reason they need to fondle each other to gain trust and grow stronger. However, Mio's former succubus guardian, Maria, wants in on the action too. And not before long, a childhood friend, Yuki, likewise seems to want to join in on the action.\\n\\n\r\nThe main strength of the show in my opinion is the same as that in Taimadou, the show is able to successfully develop the characters without sacrificing plot fluidity. There are rather intricate relationships built through the course of the show, which are really the intellectual's only haven in this show that is more meant for the carnally-inclined. The show follows a single progressive storyline where our protagonists face a series of ever-growing threats from various groups. This ultimately culminates in a multi-episode long battle involving a rather lecherous antagonist.\\n\\n\r\nDespite the impressive use of multiple cliches and plot fluidity, there are some issues in the execution. For one, there are way too many \"gotcha\" moments used as a plot device to get characters out of sticky situations; whether it's a secret alliance or a hidden power it's just overly abused. The larger issue for me is that the show attempts to paint a very bleak picture with our protagonists facing virtually insurmountable odds. However, this serious and rather dire mood is broken constantly by scenes of fondling; almost as if to say oh well we're screwed we might as well screw each other (soft core style) in the meantime. This greatly reduces the tension that was used very effectively in other successful shows such as Shana, FSN, and the first half of SAO; what I'm trying to say is that the show could have been much more entertaining plot wise if it had toned down the frequency of the ecchi.\\n\\n\r\n[b]Character:[/b]\\n\r\nIf catfights between harem members are your thing, this show has a lot of it. Testament has a rather limited harem compared to many other shows in the category but you get more development with each harem member. Despite this, Mio is really the only dynamic character in the group, going from a defensive and dismissive stepsister to a dependant and loving imouto. Despite not really being dynamic, Maria is probably the most interesting  character in terms of her ability to manipulate others be it Mio or Basara.\\n\\n\r\nSpeaking of our protagonist, expect him to take a beating repeatedly for his harem members. I'd liken this to Unbreakable Machine Doll in the sense of constantly getting near-fatal wounds and yet magically recovering enough to resume fighting only moments later. He's a mix between the overly-perverse Issei from DxD and the levelheaded Raul from Yusibu. It's a pretty good mix actually and a great step up from the throwaway protagonists of the last decade.\\n\\n\r\nThere are a fair amount of supporting characters that don't really seem to matter outside of their particular plot sequence. However, a good number  of them eventually take on roles that are more significant in the second season.\\n\\n\r\n[b]Value:[/b]\\n\r\nThough definitely at the high end of the spectrum ecchi-wise, Testament is a fairly entertaining show in its own right notwithstanding the ecchi. It combines a fairly intricate plot with a good dosage of character interaction. If you're looking for a fun, action-oriented ecchi-based harem and don't mind either ridiculous amounts of censored screens or almost constant topless nudity if you go Blu-Ray then definitely give this a shot.",
            "date": "2016-02-21T23:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 211452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=211452"
        },
        {
            "content": "The story, Art, Sound track, and characters were all great and besided a few hiccups, I hold no bar against them.\r\nI hate shows that blatantly pander to boyish fantasies of sex with no regard for subtly, then turn around and don't have the stuff to go through with it. With The Qwaser of Stigmata, while I found the show unwatchible, I have to give it the credit of sticking to its guns (or breast rather) and not flirting with the fence about weither it'd be a watch with friends show or a guilty pleasure show. But This show gave no attempt that I could findto do so, bait and switching from watch with friends ecchi to watch alone smutty. The second episode set a tone that all the sexual scenes would be off camera but strongly implied and I was mildly annoyed when the show betrayed that expectation. \\n\\n\r\nThe major problem I have with the anime is that it was sitting on the fence for the entire run and wouldn't commit itself to either side. The fence I am referring to is of course it's execution of the more ecchi aspects of the show. If it had taken a less perverse route with less censorship but less sex to censor, it would have benefited greatly. \\n\r\nWhile the chibi [censored] blocks were adorable, they were overused and either the show needed a greater variety of methods to obscure the unairable scenes or it needed it needed to have fewer to begin with. Then there's the fact that the rules regarding the censorship seemed arbitrary or worse, random. I found myself trying to rationalize the schema for bowdlerizing when I should have be teen-boying the scene. I came to the conclusion that the show was using censorship as an excuse to cut corners in some harder to draw scenes.\\n\\n\r\nSo while the story, art, sound, characters, and my personal enjoyment of the show were all deserving of a higher overall score, this nagging offense in the back of my head prevents me from giving the show a higher score. I'll be watching the second season hopeful to award it a higher score but I doubt that will happen.",
            "date": "2015-10-11T23:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 201064,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 3,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DoudechaChromata",
                "username": "DoudechaChromata"
            },
            "url": "https://myanimelist.net/reviews.php?id=201064"
        },
        {
            "content": ">tfw the art department is paid more than the story/scripting department\r\nI watched the first season and I thought it wasn't so bad. Im not into incest, but I kept myself into thinking it wasn't really incest, because they are not really related. SMNT is more of a \"guilty pleasure\" of mine. I stopped seeing it as anime midway and after season two, and started to see it as a porn with a weak plot, I couldnt really understand what was going on with the plot in the second season. I watched the SMNT Burst OVA, that came out 24 or so days ago, and thatwas straight up porn. I rate SMNT a 7 as of only the first season, but the rest is like a 5. I hope there isnt going to be anymore seasons to it anyway, it had a well made ending, I guess.\\n",
            "date": "2016-02-19T19:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 211286,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5069488.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Camoprime",
                "username": "Camoprime"
            },
            "url": "https://myanimelist.net/reviews.php?id=211286"
        },
        {
            "content": "I am of the male sex. I am a man. I am only human... and thus I am enticed by the images of attractive women. Almost all other men are the same as I am in this regard  and thus, the genre of \"ecchi\" is highly successful. Generally, ecchi anime, whether blended with action, mystery, comedy or anything else will lean heavily on the ecchi side and disregard story, setting and characters. \r\nShinmai Maou no Testament is not one of those anime titles.\r\nI will not spoil details of it so I will give a general summary;\r\nThe story revolves around the main character and histwo female acquaintances who become his 'little sisters'. Their interactions are the basis of the entire show, but this is supplemented by surprisingly good animation/action scenes and strong characterization (Ex: The Maria character is a great example of a multi-faceted , unique character the serves as a microcosm for the whole show;  A lot of ecchi but can keep it serious when it needs to... with a lot more to it than the superficial aspects).  The plot moves at a brisk pace, not too quickly , not too slowly but just right. The dialogue is effective and there are twists/turns that are legitimately well executed as the show progresses. \\n\\n\\n\\n\r\nTo put it in simple terms;\\n\r\nThis is a show HEAVILY mired in ecchi situations (Borderline Hentai) but if you removed the ecchi entirely, you'd still be left with a fairly good  show, not great but good. \\n\\n\\n\\n\\n\\n\r\nIf you like  ecchi (Sexual situations/content minus the actual sex) this goes highly recommended. The ecchi is very effective.\\n\r\nIf you like action, this is recommended; The action is good and has a lot of variety.\\n\r\nIf you want plot/story/setting, this is recommended; The plot is deeper/more intriguing than the average ecchi anime.\\n\r\nIf you dislike ecchi, disregard show entirely.\\n\\n\\n\r\nOne more observation;\\n\r\nI have found that a surprisingly high amount of women like this show, I have no idea why that is... because I was originally going to end this review with \"If you're a woman don't even bother\" but that would be wrong. Apparently a lot of women like to watch Mio/Maria/Yuki get ecchi'd. \\n\r\n/Boggle, sometimes I do not understand.",
            "date": "2016-01-16T10:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 208660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061511.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dominick_Destine",
                "username": "Dominick_Destine"
            },
            "url": "https://myanimelist.net/reviews.php?id=208660"
        },
        {
            "content": "Fuck this shit.  it sucks my massive bull testicles\r\ndo not fucking watch if you still have even the slightest bit of self-respect.  I thought the characters were as useless as a broken pencil.  The main character looked like someone tried to force him into a paper shredder but failed.  The story is also bad. WHOEVER WROTE THIS CRAP, SHOULD BE BURNED AT THE STAKE.  I would rather have sexual intercourse with an illegal mexican than watch this shit again.  The only slightly amusing part is the flashback where the mio persons dad had no arms then blew up.Why does the white haired chick have no breasts what-so-ever.  I have seen flat chested and occasionally liked it but no cardboard is the only thing comparable to her breasts.  GOD DAMN THIS SHIT ASS ANIME!",
            "date": "2016-08-20T17:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 227227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Alabama_wigger",
                "username": "Alabama_wigger"
            },
            "url": "https://myanimelist.net/reviews.php?id=227227"
        },
        {
            "content": "(This review covers both seasons as it was meant to be seen and will be on both seasons review section.)\r\nShinmai Maou no Testament comes to a close on this final season. I think is fair to say that it excelled as a successful \"Ecchi\". The Succubus factor not only delivered mind blowing fan service but assimilated well the action elements as well as to rid the common problem of the Hero vs Demon premise suffers from. Locations of peers when kidnapped as well as growth of our protagonist on a steady pace thanks to the aforementioned succubus factor.\r\nWe are left with many questions and Icertainly feel compelled to check out the Light Novel. The story is standard given spice and the elements thrown by the author are very creative, Made use of many cliches and some ideas found on other Light Novels and boosted them to his advantage.\\n\\n\r\nArt  = 8\\n\r\nThe art is very good on regards to the cast, not so much on the enemies. The animation was very good however it didn't steal much.\\n\\n\r\nSound = 8\\n\r\nThe sound is very good and the OP / ED were among the best I may add.\\n\\n\r\nCharacters = 5\\n\r\ni was a bit disappointed on characters since they seem a bit robotic at times and the personality of the villains was a tad cringy.\\n\\n\r\nEnjoyment = 10\\n\r\nDespite it's flaws I very much enjoyed this anime as a whole. The Ecchi factor which is the heavy weight on this installation came through flying colors and was done unusually and well as some high level Fan Service. If you're an Ecchi fan this is for you, I may warn you it's more extreme than DxD and not as good.\\n\\n\r\nOverall = 8\\n\\n\r\n8 + 8 + 8 + 5 + 10 = 39 / 5 = 7.80 rounding up to the nearest 10th. Overall 8.",
            "date": "2016-07-03T19:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 223025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=223025"
        },
        {
            "content": "Oh heck, what did I stumble upon. At the time, I had finished all the seasonal anime that I wanted to see, I had no more recommendations from friends, and I wanted some sweet action fights.\r\nThen I ran into some...action play fighting. Bed play. Skin snuggling.\r\nAlright fine, I admit, this is some straight up soft-core porn like animation.\r\nThe most 'ecchi' thing I've ever watched beforehand was No Game No Life, so this was quite the upset to what I'm used to.\r\nI watched on for the action that was actually fun to see, it wasn't highly choreographed scenes or heavily impactful, but it was enjoyable.\r\nThe eyecandy was both stupid and hilarious. I ended up showing my best friend a few episodes on how silly it would get. Physics of the movements and the choice of positions were poked fun of.\\n\\n\r\nThat's probably the first of two reasons why I kept watching. The second was that I actually loved seeing the two who I thought should've been a full on couple.\\n\\n\r\nIt's probably because I love seeing couples being couples and this was another view of couples being couples. Everytime I'd see Mio and Barasa together, I'd cheer out loud.\\n\\n\r\nHoly smokes when there was a maple syrup scene, the Canadian in me had made a vow that I would try that sometime.\\n\\n\r\nThis was just a stupid fun sort of entertainment, and I was totally fine with it. Turn off your mind and just laugh along. Otherwise, don't watch it, it is of course, distasteful and bad to a serious watcher.",
            "date": "2016-07-02T18:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 222866,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5091665.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ChoocoboYao",
                "username": "ChoocoboYao"
            },
            "url": "https://myanimelist.net/reviews.php?id=222866"
        },
        {
            "content": "Welcome to Robert's Too Late Reviews! Today we're going to be doing, as always, the dubbed version of this anime, and of note is the fact this review covers season 1, the extra episode (OVA, what have you) and the second season, subtitled 'Burst'. The quick of it is if you need more boobs in your anime life, or are like me and dig the supernatural angle, then go watch (or rewatch, whatever the case may be) Highschool DxD, as this is nothing but a cookie cutter rip of that series. Nevertheless, there might be a new entry on the RTLR wall of sexy 2dgals, read on to find out more!\\n\\n\r\nStory: 4\\n\r\nAs I said, this is probably literally as close as one can legally get to outright copying another, somewhat better, series. They lift insane amounts of material directly from DxD's playbook and just slightly alter it and serve it back to us. I'm going to run down some of the similarities for ya here, beyond of course the fact that they are both ecchi harems. Both feature a male lead that has a weapon that disappears when not in use, and starts as only covering part of their arm. Later both has the male lead developing his weapon and arm protection into a full blown body transformation. Both times we have the full body transformation being very dangerous to the guy, with them nearly losing control and injuring members of the harem, specifically the primary female. Both are saved from making this terrible mistake by the power of love (or tits, one of the two I guess) and both come back from the edge at the nick of time, of course not before beating the ever loving shit out of the bad guy. \\n\\n\r\nThe primary female is a redhead, and related to the Devil/Lucifer/Demon King, basically demon royalty in some manner or the other. Both redheads have insane levels of power inside themselves that is only tapped when the male is in extreme danger. Both are built like porn stars and seem to have an irrational love of the male lead for reasons that aren't ever really explained all that well. The primary female is desired by otherworldly forces, particularly to exploit her power and standing. \\n\\n\r\nThere are present in both series characters that are in diametric opposition to the demon forces who turn and end up joining the hero's cause. In fact both shows come to a point where they both have two of these girls in each. To clarify because this is perhaps less obvious, the church exorcists in DxD, and the hero village girls in Testament. All four girls from both series are swordsmen, and know powerful techniques. They are also all in lust for the male lead. In a slightly different but yet same characterization, both the primary female from the opposing force (the first hero girl and the former nun in DxD) feel like they are in competition with the demon princess for the affections of the male lead. They both will follow the princess' lead and try to get the male to do to them what he is (or appears to be) doing to the princess. \\n\\n\r\nRandom similarities being that there's another male in the series, yet they are not in competition with the male lead for the interest of any of the girls, and is always around to lend the male lead a hand when the cards seem to be down. Of course they both are kind of mysterious in their backgrounds. There is a character that joins the harem because her original allegiance to another person/group is broken, Asia in DxD with the church, and Zest in Testament from the other demon dude. Both feature a character that has issues with their older sister (Koneko and Maria). \\n\\n\r\nThis is just a VERY small start on the similarities, there's lots more to be found throughout both seasons. I mean, I'm surprised they didn't have to drop this show from ever being made due to intellectual infringement. Let's cover the primary difference between the two series: in DxD the male lead wants to have sex with his harem members but totally wimps out before anything happens, whereas in Testament, the male lead basically bangs every member, and sometimes all of them at once. While only breast groping and ass (through their panties) is explicitly is shown, it is *heavily* implied that there's full penetration sex happening and even some hints of oral sex going down as well. The characters are all put into several different sexual positions and are making all the correct movements for doing the nasty yet either the camera never pans down, or when it does, they toss on a token pair of undies on everyone. Make no mistake, this show is MUCH dirtier in my opinion than DxD. And of course, conveniently, having sex with his harem not only powers up the hero, it also increases the power of the girls as well. Therefore 'training' is nothing more than an excuse to get some more sexy time onscreen. \\n\\n\r\nThe basic lay is that the primary female has some demon power in her that everyone wants, and the male has to fight off those that wish to harm her. They even take a trip into the demon realm and face down enemies there. The male lead also has multiple references to a difficult past, something about an accident that happened when he was a good bit younger that either hurt or killed some of his fellow members of the hero clan. This is repeatedly referenced yet there's no satisfactory explanation as to exactly what happened, what the direct results were (beyond his obvious exile) and why it happened to him. It's implied, and easily assumed, that this is a power he has inherited from his father, who is referred to repeatedly as being the 'war god' and being shown to posses a power level that would warrant such a title.\\n\\n\r\nThere's also a few remarks about the power the male lead carries being related to Brunhildr, which made me interested in hearing more about this power and the mythology surrounding it, similar again to DxD's Red Dragon Emperor power, which of course we get lots of info on, but for Testament, we never really explore the lore around Brunhildr. There's some kind of throw away stuff about it being the power the Valkyries used to gather souls, but it's basically mentioned in one or two lines in one episode, and basically that's all we get. I was left wanting to know more about the lore and mythology of the show. Instead we get like a third to sometimes nearly half of the show focusing on nothing more than sex. While titillation has it's place, and can be enjoyable, we really don't need every last episode just about featuring extended sequences of naughtiness. Yes, we get it, you bang the girls to get everyone stronger. Tell me about more about the gods/devils/powers related to the occultic and/or supernatural elements of the anime. No dice, really, on that point.\\n\\n\r\nThe story just basically falls a few inches from hentai and seems to think that's all anyone wants to see. There is better hentai out there that isn't so contrived and convoluted, and there are better ecchi series that balance the fanservice with interesting details and world building. Instead we get one of two basic version in each episode: either they have sex to power up, beat bad guy or lose to baddie, sex to power up, beat baddie. Really that's about all we get overall. Disappointing. \\n\\n\r\nArt: 8\\n\r\nThe show looks really good, as one might expect, and one might even say that's another aspect aped from DxD, but I'd like to think quality is something that everyone works towards. The characters are well drawn, though the breasts are, as usual, a little on the ridiculous side most of the time, especially during the ecchi sequences. Overall we have lots of detail and smooth animation, and some of the fights are pretty nice. Of course we get the usual sword problem that I just hate, the idiotic shooting of energy from melee weapons. If you're going to shoot each other, manifest guns, not swords. Getting to be a pet peeve of mine. This show does better than most in that for the most part, swords are used as swords, but when the power levels go through the roof, we get powers deployed through energy beams and waves. Otherwise I have no complaints, it looks like what you expect masturbation material for young men to look like. Beware the censored version, however, as I've seen it reported that they are a bit heavy handed in covering the objectionable material. And with the amount of tit onscreen a lot of the times, I can see why they had to cover most of the screen during those shots. \\n\\n\r\nSound: 7\\n\r\nThe themes are not bad, but not really very catchy, less so for Burst compared to the first season. They serve their purpose and have an appropriate 'rock' sound to them. The music in show is properly dramatic in battle sequences and such, and is I guess properly 'chika umm bow wow' during the ecchi scenes as well. \\n\\n\r\nThe voice acting is pretty well done, for the most part. The princess sounds pretty good, and the nurse, oh goodness, the nurse sounds amazing in the dub. The succubus' voice is a bit annoying a fair amount of the time. She's a big part of the knock on the score, and the fact that both the first hero girl and the 'rescued' demon girl both sound about as interested in what was going on as a rather bored rock. Also the obvious problem, the over the top moaning and carrying on, which while expected in the sex scenes, still seemed way over the top for me. I can't imagine how it must be like to record those sounds. I would be embarrassed to even be part of the audio crew during those sessions, let alone the VA in there hamming it up. So yeah, there's a fair bit of the time that it sounds like a straight porno. I'd recommend headphones. \\n\\n\r\nCharacter: 6\\n\r\nI found the characters mildly interesting, but every time I wanted to know more about them, the show would stop for an obligatory 10 minutes of bouncing boobs. They could have expounded a bit more on the characters themselves and still fit in enough nakedness to get the point across. Why does the hero girls fall for the male lead? They were supposedly resentful, and rightly so, of the guy and the dangerous/deadly incident that happened years beforehand. If he accidentally released his powers and killed a bunch of people (which I believe is what they say between the sessions of moaning) why would they forgive him so easily? Why is there a reference here and there to the succubus being a virgin (seriously) when she's well, firstly, a sex demon, and secondly obsessed with porn and getting the various characters into banging? In one episode she literally masturbates (and orgasms) with a towel in front of the male lead. Virgin, yeah right. \\n\\n\r\nI also wanted to know more about how the princess got her demon powers. They offer that she's inherited them from the previous Demon Lord who was her father, but how did that work? How was the upstart lord vying for power over the demon realm able to do so without a comparable power? Why did she get the power if she wasn't prepared to take over rule of the demon realm? How did daddy die? There's a million neat details about the operation of the demon lore and such that they could have given us that they just leave out. \\n\\n\r\nThere's a good foundation for the characters (for the most part) laid, but they never follow through, opting instead to jump to the 'training sessions' instead. \\n\\n\r\nEnjoyment: 5\\n\r\nI'm a sucker for anything that has demons/angels/gods/devils or mythology in it (send recommends if you know of any good ones, please!) and I wanted to like this series so much, but they just went overboard with the sex. Now I don't mind naughtiness in the least, I might be middle aged, but boobs is one of those topics that I think is absolutely ageless (heh) yet they had me groaning when the porn music started, and I knew it was about to go into yet another extended ecchi sequence. I think I actually enjoyed DxD's system much better, where the male lead is a bit bumbling and is too awkward to actually accomplish getting it on, this version where the guy easily and frequently bangs the girls just smacks of some kind of softcore hentai. It's like watching Cinemax at 2 a.m., sure there's boobs, but the rest of the fun isn't actually shown. Forget that noise, if I wanted actual porn, I'd go watch it. Make the point about the connection between sex and their power levels and move onto cool fights or something. I don't need endless softcore crap as long as the internet exists, ya know?\\n\\n\r\nAs I said, I don't mind the sexual element at all, but if you're going to offer a story along with it, make sure the story is actually *good*. Either that or go the route of those '70's pornos where they speak two lines \"Here's your pizza\" \"do me good big boy\" and off to the races. They tease much more with copying the interesting elements of other shows than they do with the fanservice. Basically it fails at being actual porn, and then fails at being a story as well. We're left wanting all around. \\n\\n\r\nBest Girl: The nurse Chisato, in the dub at least is one damn sexy sounding woman. Yeah, they give her corny lines, but damn if she don't sound good delivering them. \\n\\n\r\nYour time would be better served finding the shows that they ripped off (primarily DxD) and watching them instead. If you need 'gratification' material, there's better versions of that out there as well. I was irritated that it was just interesting enough that I wouldn't drop it. I kept thinking 'well next episode they'll skip the lewd time and do more character development' and was let down over and over. Mediocre at best. Nonetheless the nurse makes the RTLR of nastiness, just cuz I loved her voice actress. I don't think it's worth the bother.",
            "date": "2019-03-18T04:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 303789,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6918726.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/captjoe213",
                "username": "captjoe213"
            },
            "url": "https://myanimelist.net/reviews.php?id=303789"
        },
        {
            "content": "Well, before the review I'll say that this series has 2 versions, censored and uncensored, so if you plan to watch the censored, you may skip the part where I'll review the sex and nudity.\r\nEven though the censored isn't recommended since they just put a large ray of light or large chibi stickers so you won't see their nipples or something.\r\nThis anime lacked many things, it feels like there was a concept, but as the concept developed, it lost its meaning and the creator lost his ideas.\r\nThere are clans of heroes and devils, you know NOTHING about them, they just exist and are enemies.\r\nAbout theromance in the series- it looked like the creators tried really hard to put romance in it, but the Harem was too overwhelming, so it was really hard to make a good romantic scene between two characters.\\n\\n\r\nEvery episode had the same routine, which I found tiring after a bit.\\n\\n\r\nImportant thing about the Action- the fights weren't exciting at all, each character had maximum of 2 skills, while the MC had only one, same weapons to everyone, not a lot of skills, and the skills that exist are lame.\\n\\n\r\nEcchi- the whole anime idea was with Ecchi in the center, which was fine, but every Ecchi scene was the same, over and over again, you'll just see a lot of breast rubbing and massaging. \\n\\n\r\nStory was given 6/10, since many things weren't explained and were just thrown at us, and the story was predictable and nothing special.\\n\\n\r\nArt with 6/10\\n\r\nThe art felt lame- hastened and rushed,  but I've seen worse.\\n\\n\r\nSound with 6/10\\n\r\nNothing that I could remember but the battle soundtrack was... fine I guess \\n\r\nThe OP and ED weren't good.\\n\\n\r\nCharacter 6/10\\n\r\nSince I got disappointed with the romance part (which affects the development of characters ) and their fighting skills, I found thw characters unoriginal and boring.\\n\r\nThe Male MC, Basara, showed us some spine at the beginning but he became lame afterwards, a pathetic idiot with no spine.\\n\r\nThis anime didn't have the character who \"supports \".\\n\r\nLike in MOBA games, when every team should have a Support, this anime didn't have one [Side note, look at the end], so much help was given to the red haired MC- Mio, but she doesn't support Basara back? Who is supporting her the whole time? I expected her to at least show him some love, which we couldn't see at the beginning and the middle, and well, since it's a Harem anime, even when they could do a romance-supporting scene, the harem had to push itself in.\\n\\n\r\nEnjoyment- 7/10 and I would give about 5.5/10 if I watched the CENSORED one, the Ecchi was pretty much the only good thing in it.\\n\\n\r\n[Side note- a supporting character in my opinion can be the girl that sees the MC is fighting for her, so she supports him as well, always checks on him, loves him, hugs him, I won't go far to kissing and things like that (even though the supporting lover is the best character in my opinion, and this anime didn't have it.)]\\n\\n\r\nBottom Line: I would recommend to those who seek for cheap Ecchi scenes and want a bit of cheap action with it.\\n\r\nAnd for those who don't, I don't recommend. \\n\r\nThank you for reading :D",
            "date": "2016-04-27T21:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 217325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262007.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dadnaya",
                "username": "dadnaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=217325"
        },
        {
            "content": "Seems like this anime divides opinions and for some reason most other reviews seem to be dropping things about the story in the review which is kind of idiotic.\r\nThis anime at it's most basic form is pretty good, its sexual references are so over the top they are quite funny.  The story is pretty weak but is enough to go a long with and the characters are pretty standard but in a good way.\r\nOverall so long as you don't mind heavy ecchi in the anime you will enjoy this, if you don't like ecchi then you probably won't as this is a borderline hentaiat times just heavily censored.\\n\\n\r\nIf you are debating watching this or not then it's probably worth watching as it's not massively long but is quite enjoyable so long as you are not expecting to be blown away by a deep story that makes you wish the world was real.",
            "date": "2015-10-10T18:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 200935,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/chrisps89",
                "username": "chrisps89"
            },
            "url": "https://myanimelist.net/reviews.php?id=200935"
        },
        {
            "content": "Story : 6/10 -  The story is pretty much like an average fantasy-magic-demon anime.\r\nArt : 7/10  - Action scenes are average. Bonus points for bounciness.\r\nSound : 7/10 - The moaning sounds will never get out of your head. The music is not so bad.\r\nCharacter : 2/10 - Oh boy oh boy these female characters. The female characters are mostly denser than the core of a black hole and are weirdly attracted to the main character without any good reason (excluding magic of course). The main character is an overprotective big brother and the only sane person in the household. They never have intimatemoments to improve character developpement, instead they all go full retard harem mode.\\n\\n\r\nEnjoyement 5/10 - Most of this anime is fanservice but being someone who doesn't really care about that, this anime wasn't really entertaining without the epic sides of fight scenes. \\n\\n\r\nOverall 4/10 - I didn't really count the art and sound for the overall score because it isn't really something I look for in an anime, but because of the awful character developpement, my overall score is low.\\n\\n\r\nThe main plot had a lot of potential but they completely ruined this potential by putting in too much fan service and not enough character developpement. Most female characters are annoying as hell but they compensated this error with a badass and \"haremous\" main character.\\n\r\nIf you are looking for a hentai-like anime with a lot of breasts (a lot like high school dxd but less entertaining) then this is a good anime for you. But if you are looking for a fantasy action anime with some romance, you will be disappointed.",
            "date": "2018-05-01T13:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 279502,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7062473.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MiniLink",
                "username": "MiniLink"
            },
            "url": "https://myanimelist.net/reviews.php?id=279502"
        },
        {
            "content": "This is a fine example of what's wrong with the vast majority of light novels.  It's nowhere near as bad as other titles but the shoe horned cliches make it obvious this series lacks any substance. Basara Toujou meets his two new step sisters who turn out to be demons. Basara himself comes from a tribe of heroes but went Rouge after a freak accident and now heroes and demons alike have a vendetta against the family.  With that premise, you'd expect something great but this show rather have otaku pandering than well written story .\r\n  The amount of easilyavoidable cliches in here is just ridiculous.  Mio is the basic red headed agressive tsundere who is prone to perverted misunderstandings. Maria is a loli character who is constantly sexualized.  The fact that she's a succubus doesn't give the author an excuse for placing his perverted fetishes on a underage girl.  Yuki is a better childhood friend. There's also the incestuous moments between Basara and his sisters. It's clear the demographic for Shinmai Maou no Testament is the depraved deadbeat otaku variety.\\n\\n\r\n  The excuse of a story is obviously an after though here. A few demons attack the basara family,  they have a perverted moment,  basara swears to protect them and repeat.  Things do get interesting once the past of the hero tribe comes into play but it doesn't last long.  The author clearly has no creativity and fails to properly expand on his own story.  He's much more interested in pleasing the lowest common denominator.\\n\\n\r\n  One thing this show actually manages to do correctly is the music and character design.  The soundtrack is composed  by Yasuharu Takahashi  who is responsible for a plethora of outstanding songs over the years  The original character design Is done by ookuma nekosuke who despite his extreme amount of ecchi work, his art is still great.  Its a shame their talents went to waste here.The last positive statement I have for this crap is that basara toujou has above average characterization for a light novel protagonist.",
            "date": "2016-08-26T16:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 227670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4374209.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lazyking88",
                "username": "lazyking88"
            },
            "url": "https://myanimelist.net/reviews.php?id=227670"
        },
        {
            "content": "Pros:\r\n-The idea behind this anime is great.\r\n-There is room for character development as there is a second season.\r\nCons:\r\n-Half a step away from a hentai.\r\n-The current characters are half-baked/unrealistic for their age.\r\nI would love this anime to bits if the MC didn't have to sexualize his 'little sisters' I know they are not blood-related, but if you're going with the sentiment of his feelings either make this a little more comical (A bashful MC? Less 'I know how to relieve you without trying' more I'm a young teenagger who gets to touch boobs nosebleeds) to ease off the sexual or just full on dub this onea hentai as you're going to be muting your sound a lot to get through this without hearing underage girls moaning.\\n\r\nI would have dropped this early on if the plot wasn't so engaging. It could be just as engaging without all the big brother borderline brother scenes.",
            "date": "2018-03-06T22:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 273248,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5441583.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MissMilli",
                "username": "MissMilli"
            },
            "url": "https://myanimelist.net/reviews.php?id=273248"
        }
    ],
    [
        {
            "content": "If you're a seasoned anime watcher, and you read the synopsis, maybe did the 3-episode rule, YOU KNOW HOW THIS IS GOING TO BE.\r\nUnless you actually like non-unique trash ecchi shows, then don't even bother with this! I'm not saying all ecchi anime is bad, I'm just saying a lot of it is all the same garbage re-skinned with different neon-hair colored anime girls and plain protags.\r\nSo, to sum this up,\r\nOverpowered MC gets ditched by dad, left with two stepsisters that do not know  what going too far is with siblings. They try to juke him, he jukes them, randomly says to protect them,and now he's protecting them.\\n\\n\r\nExtras may include: (especially if you watch the uncensored version)\\n\\n\r\n-MC pulling salvation out of his ass\\n\r\n-Pretty much incest\\n\r\n-Lots of switching between saving the imoutos and imouto bath time\\n\r\n-Rituals that if done wrong give you neck tatoos that make you horny\\n\r\n-nipple sucking\\n\r\n-Dense MC\\n\r\n-thirsty childhood friend\\n\r\n-MC is perfect and apparently has no human personality flaws\\n\r\n-MORE nipple sucking! (one part even with maple syrup :D)\\n\\n\r\nYou see right there, what a package!\\n\\n\r\nHonestly, this is the most borderline hentai anime I have ever watched, MC trying to create a stronger \"bond\" with his step-sister and also \"slave\" technically.\\n\\n\r\nYou know this anime trash, when the only reason you watch it, is because your bro would give you a crispy $5.\\n\\n\r\nBut anyway, enough ranting, (well maybe a little bit more)\\n\r\nOpening, ok, not memorable though.\\n\r\nI actually liked the art style, but some of the animation was lazy (especially in some fight scenes)\\n\r\nI actually did find the MC attractive, till I saw his steadily growing and competitive harem along with his Mary Sue personality. Though I did want to know more about him and childhood friend's backstory.\\n\\n\r\nDidn't get much of course tho :P\\n\\n\r\nI won't lie, the last couple of episodes had me actually interested and \"into it\" but still, the anime leaves you unsatisfied, as we find out Naruse Mio AKA No-Life-No-Bra Maple tits and Naruse Maria AKA ProcreateWithYouInACorner loli are still being sought after.\\n\\n\r\nAnd OTP Nonaka Yuki AKA KuudereChildhoodfriendWithThatBootyTho and MC never sailed, OBVIOUSLY. \\n\\n\r\nOverall, not really anything special. You really, really, don't need to watch this.\\n\\n\\n",
            "date": "2018-02-03T22:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 270595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6005625.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Jersie",
                "username": "Jersie"
            },
            "url": "https://myanimelist.net/reviews.php?id=270595"
        },
        {
            "content": "Personagens superficiais, não memoráveis e não desenvolvidos. \r\nRoteiro cheio de conveniências e que não se importa em explicar motivações, passado ou mesmo regras do mundo em que o anime se passa.\r\nRitmo muito rushado, jogando um acontecimento em cima do outro sem qualquer desenvolvimento ou tempo pra digerirmos o que está acontecendo, porque tudo é apenas uma desculpa pra mostrar lutas e fanservice.\r\n Bem, poderia citar mais um bocado de defeitos, mas vou parar por aqui e citar as únicas poucas coisas que o anime tem de razoável, que é a animação, com alguns efeitos de magia e lutas legais (por mais que falte fluidez nospersonagens) e o fato de que o protagonista não é um bunda mole e faz o que é preciso ser feito.",
            "date": "2018-01-29T18:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 270069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5813170.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/_Kady_",
                "username": "_Kady_"
            },
            "url": "https://myanimelist.net/reviews.php?id=270069"
        },
        {
            "content": "Naruse Mio—red-haired girl & Naruse Maria—silver-haired loli on the right, come from the Demon world to the peaceful human world with the desire to gain powers while escaping from Demon other parties who are trying to catch 'em. The fact that Naruse Mio is the daughter of former Demon Lord with incredible power lures any Demons who want powers to be the Demon Lord looking for Mio continuously. Then, these two meet our main hero, Toujou Basara & his father (the brown-haired men). From this meeting, the story starts off, the survival of Naruse Mio & Naruse Maria in the protection of her new familywith Toujou Basara & Toujou Jin, such tremendous powers in an awkward collaboration of Heroes and Demons.\\n\\n\r\n    The story is not something new. Things like Hero, Demons, survival, chasing, protection, something like that plus severe harem to add. The story aspect is not the charm of the show, I can't feel the story is attracting me for continuing it. Maybe I would say it's entertaining enough to keep me here. The feeling when you just want to keep watching it 'til the end because the show is good enough to watch. At first, the story pumped my curiosity but as the time flew by, the show true colour of heavy ecchi-ness sometimes makes me sick (eventho' not pure fanservice like To LOVE-Ru series). If you really appreciate the plot rather than the pleasant things such as fanservices, then do not pick this one, you'll just drop it instantly I bet (I can't even imagine what the BD ver will be since I watched the TV ver with tons of censored scenes).\\n\\n\r\n    The ecchi-ness is the key for character development in this case. Master-Servant contract for the sake of protecting and supporting each other power that Basara makes with Mio and other girls helped by the succubus, Naruse Maria, involved aphrodisiac effect. Once the Servant does something or even just thinking something that lead to unloyalty, the punishment reacts. Unfortunately the way to stop it just by \"the touch of the Master\", this is where you can relate the punishment and fanservices. The characters begin to know each other better with that way and obtain more power to claim their victory.\\n\\n\r\n    I mentioned before, the series has something to keep me watching it even if the fanservices horrifying me. I think about it twice and maybe that's because the animation. The visual aspect pleases me, not above average but surely pleasing enough. Now to recall the time I watch this series, in my point of view, the character design is nothing special.\\n\\n\r\n    I'm grateful, \"Blade of Hope\" by sweet ARMS & \"Still Sis\" by Kaori Sadohara as the OP & ED theme songs are nice! These two songs were on my most-wanted-song list, The thumping heart rhythm is outstanding and somehow represented the hardship of the battle and complicated burdens the characters have on their shoulders.\\n\\n\\n\r\n    Hmmm.. for the rate, well ±7.5  ˁ˙͡˟˙ˀ\\n\r\nPros:\\n\r\nI think.. animation and songs\\n\\n\r\nCons:\\n\r\nAverage plot. I was shocked in few parts that the story is unpredictable and amaze me, but it wasn't enough to judge the whole plot\\n\r\nFanservices everywhere ---===Σ[▓▓]ε¦) I'm not against it but sometimes it's out of place",
            "date": "2016-07-21T23:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 224632,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224632"
        },
        {
            "content": "If you mix Highschool DxD and Maoyuu, you basically get this anime. It's pretty much your typical ecchi/harem anime, but it did bring something new to offer.\r\nLet's start off with the plot. There's not much to say because it's too generic. It pretty much goes the same way any ecchi/harem series go:\r\n\"A boy meets an extraordinary girl and they work together to bring down anything that breaks them apart, all while meeting other girls along the way and doing pervy stuff...\"\r\nThis is the one sentence that helps me in analyzing if the show is unique in any way. Unfortunately, I only found one unique characteristic,it's the MC and heroine being siblings. But other than that, it's generic.\\n\\n\r\nThere's not much to say about the characters either because hardly any of them stood out. The only memorable character was Maria because she had more personality than our generic MC and heroine.\\n\\n\r\n The art style was... Okay. The BGM and OP/ED was... okay.  Did I enjoy myself? Well, it was okay. But since it's an ecchi/harem anime, I liked it. But I really don't recommend it to those who dislike fanservice (believe me, there are a lot). I just hope the second season would bring more to its previous testament.",
            "date": "2016-06-30T17:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 222485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=222485"
        },
        {
            "content": "It's been about a year since I watched this show, but I remember it very clearly. It was the most... intriguing echii series I have ever seen in my entire life. \r\nI've grown up watching a lot of harem echii shows and I'm pretty accustomed to the amount of fanservice that they provide, but Shinmai Maou no Testament is a different beast all together. I remember the scene where they use maple syrup and... I was actually disturbed by it. It's the first echii show where I felt like I was watching some actually messed up stuff, and that made me very uncomfortable. That's onlyabout half of the fanservice though, so it wasn't absolutely bad. \\n\\n\r\nPlot wise it's about a dude who's a hero protecting his adopted sister (who also happens to be the demon lord, who knew?) from other heroes, demons, and whatever else happens to be coming out today. Basically, It's like Highschool DxD, but the fanservice is much more... extreme, if I'm going to be honest. \\n\\n\r\nThe protagonist is pretty generic and bland, to the point where I don't remember his name, so I'm just gonna call him Kirito because well... what's the difference. His main role is to break the show's villains over his knee due to plot convenience, and touch his sister in various... ways. He gets all the ladies (because this is a harem show), and he's got them traditionally good protagonist morals. \\n\\n\r\nHis sister, the demon lord, is a tsundere red-head who usually gets kidnapped. She's the protagonist's servant due to stuff involving a succubus, and is the main fanservice character for the entire show. She's also generic, so let's just call her Asuna. \\n\\n\r\nLook, if you haven't figured it out already, this show is painfully generic. The only thing that sticks out is the over the top fanservice... but, why did I give it a 5 and not something lower? Well, for one thing, it looks nice. The aesthetics aren't too special, but they were relatively nice. But also, I just plain enjoyed the action. I know it's not the main calling card of the show, but when the action pops up, it is pretty fun to see. \\n\\n\r\nSo there you have it folks, Shinmai Maou no Testament. It's a generic show, with a little bit of action to spice things up, but a lot of disturbing fanservice to bring it way down.",
            "date": "2017-11-12T15:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 263093,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6731128.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Gomi-kun",
                "username": "Gomi-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=263093"
        },
        {
            "content": "Here's what you need to know about this show: there are a lot of Ecchi anime out there today. they generally fall into one of two categories. \r\n1. Ecchi that have a decent plot and or character development and use the ecchi as a hook or gimmick to get more views.\r\n2. Ecchi that use the ecchi part as a suppliment to replace a good plot and character development. \r\nThis anime is the second category. a more in depth review would be pointless as the show is basically a really bad hentai. Thats all.\r\nThe characters are horribly horribly bland and generic, mio is basically a boringversion of Lala/Rara from To love-ru. in fact the show is basically a bland more unoriginal version of To love-Ru. Do yourself a favor and skip",
            "date": "2017-11-02T01:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 262317,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/gendoikari87",
                "username": "gendoikari87"
            },
            "url": "https://myanimelist.net/reviews.php?id=262317"
        },
        {
            "content": "Perfect thing for anyone who wants hentai feeling within good action anime.  Its far better and uncensored than Highschool DxD, will make you cum just by watching XD\r\nStory? Could be better, but we watch it only for PLOT(if you know what I mean).\r\nArt? Classic.\r\nSound? Perfect for AV action.\r\nCharacter? Plot explains everything. Although enemies are poorly made. No worries, right corners of body are bolded enough.\r\nEnjoyment? ;) Guaranteed.\r\nOverall? 8. Setting and action could be better, if they really tried to.\r\nOVA is kinda well made, made dream of us students true :D\r\nMan, I have to write this line of text only because text box for reviewcontent is too short. Seriously.",
            "date": "2016-03-26T03:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 214187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2406179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TokyoGhost",
                "username": "TokyoGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=214187"
        },
        {
            "content": "Story: so the story is that basara's dad got basara 2 new sisters in Mio and Maria but what happens at night that they aren't just ordinary girls that Mio is the demon lords daughter and that Maria is a succubus but what they didn't expect from Basara is the he used to be apart of the hero clan until something happened with it (watch the anime to find out) basically now he has to protect Mio and also Maria at the same time aswell.\r\nArt: art is very good the parts with the action and yes the nipples were very good for this anime.\r\nSound: theOP and ED were meh at best i personally wont download them but the voice actors were definitely really good.\\n\\n\r\nCharacter: Basara is the main guy of the anime and well he is pretty shy when it comes to the pervy parts but in action he is a total bad ass. Mio one of the main girls she is the demon lords daughter and honestly she can be a perv and also not she is pretty sweet and what not. Maria is another main girl of the anime and the succubus of the anime and she basically like Mio in a sense but she is like hella pervy in the anime and even recording the lewd thing happening. Yuki is the last main girl form the anime and is also basara long time friend she is pretty sweet she really doeskin show that much emotion most of the time unless really in battle but still she does.\\n\\n\r\nEnjoyment: now with this anime yes i did like it that comedy when it was there was good and the action was easily really good for sure. My gripe with this anime is that the comedy really for me at times just wasnt there really like at all my really only gripe with the anime.\\n\\n\r\nOverall: ill be giving this a 7 for sure the comedy was good at times and sometimes wasn't there but was good the action was easily the spotlight for the anime yes im actually say that or maybe the harem and nipples no idea actually lol \\n\\n",
            "date": "2017-06-08T23:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 249550,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=249550"
        },
        {
            "content": "So... yeah... this is basically the poor man's Highschool DxD. Whereas that series had fan service and excess nudity, it also had a wicked story plot, excellent characters and mixed in raw emotion and logical fan service into their story. This on the other hand, is frustrating.\r\nThe good:\r\nArt looks amazing, this is on par with some of the best looking modern anime. \r\nIf you're a fan of essentially softcore porn, this is the closest thing you're going to find.\r\nThe plot can be OK at times, the main characters are likeable enough and the voice acting is done well.\r\nThe fight scenes are cool and diverse.\r\nThe bad:\r\nIfyou're not a fan of softcore porn, you will find the ecchi scenes weird and uncomfortable; if I wanted porn I would watch porn, this was just silly and weird.\\n\r\nThe way the ecchi is rammed into the story made me frustrated; it is trite and annoying and the fact that MC is so quick to just accept that he needs to \"service\" his harem makes him unlikable.\\n\r\nThe way characters gain power and can always be strong enough at the right times didn't make sense; it was too convenient.\\n\\n\r\nStory 7, Art 9, Sound 7, Character 5, Enjoyment 7, Overall 6/10",
            "date": "2016-07-02T01:52:00+00:00",
            "helpful_count": 0,
            "mal_id": 222728,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=222728"
        }
    ]
]