[
    [
        {
            "content": "At first, I was trying to find some mediocre romance comedy harem anime, which can give me tons of boobs and laugh for example, Ichiban Ushiro no Dai Mao or Hagure Yuusha no Aesthetica to name a few. I mean it's Christmas now, and I am still single, watching anime at home. All by myself.......... I needed anime to comfort me. :(\r\nAnyway, I then came across this oddly under rated anime Koi to Senkyo to Chocolate :3\r\nStory:\r\n   At first glance, the plot might be one of your normal, slice of life school anime. I first thought so too, but thenthe 1st ep just cracks me up. I won't go into those spoiler details but I can say, I immediately got hooked by this anime. At that moment I knew that this is my destined one. I give HUGE credits to anime which can piqued my interest this much right in the first episode, only a few could do this to me. eg. Sakurasou.\\n\\n\r\n   Anyway, this anime is based on a VN, and from the past few years anime adopted from VN hadn't been satisfying. I wouldn't say its bad, but a lot of them are rushed or just focused on the wrong heroine - for example: Angel Beats, I mean I love AB a lot, I cried watching its last few eps too, but overall it just felt a bit rushed. It left a lot of things unexplained i guess.  \\n\\n\r\n   However, I believe this is adaptation had done an excellent job.I think it had a pretty steady pace. At least, I didn't feel its rushed, like AB does. So, I think it did a great job here. \\n\\n\r\nCharacter:\\n\r\n   Well, here the good part. We have a very diverse and intriguing character casts here. They all have different personalities and motives and such that it didn't feel like they are cardboard cut out characters or at least most of them.\\n\r\n    I mean we have have 2 oppai girls ( Shinonome Satsuki, Shinonome, Hazuki)\\n\r\n    A super kawaii pentako (Michiru Morishita)\\n\r\n    A bit annoying tsundere, childhood friend girl (Sumiyoshi  Chisato)\\n\r\n    A kouhai full of feels (Aomi Isara)\\n\r\n    At last, but not least the ultimate, always cumming yaoi kouhai (Yumeshima Oboro) \"Senpai, I want your stick!\"\\n\\n\r\n    With these characters, I bet you're gonna have a lot of fun watching this anime. The reason why I love this anime is because of its diverse characters. The interaction between the characters intricately weaved out the whole story. Most of the characters have been explained properly, and have pretty well development. Moreover, it totally didn't feel as confusing as Angel Beats were (in the last few episodes :/ ) . Everything nice and good.\\n\\n\r\nArt:\\n\r\n    Well, I don't have much to say about Koichoco's art. The animation was fluent and clear, nothing super fancy extravagant like Fate Zero or Kara No Kyoukai, but I was satisfied with it. It's got a bright colour and overall gave a cheerful atmosphere. It kinda feel like Amagami SS i guess..... \\n\\n\r\nSound:\\n\r\n    I am not much of a soundtrack guy, so I will keep it short.\\n\r\n    Sound is good. Voice-acting good too. OP & ED good good. \\n\\n\r\nEnjoyment+Overall:\\n\r\n   After watching Koichoco, it lifted my mood a lot and I really really enjoyed it, I don't know why it is so under-rated but I think it should rank higher and more people should be watching this. \\n\r\n   I recommend this to anyone who are looking for a good romance, comedy. And I promise, you're gonna laugh so much in the first ep (at least, I did)\\n\r\n   I think you guys to give this a shot, you might be surprised. :)\\n\\n\r\nI hope this review helped you and that you guys would like Koi to Senkyo to Chocolate :3\\n",
            "date": "2014-12-29T10:22:00+00:00",
            "helpful_count": 150,
            "mal_id": 175035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3710831.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kilodragon",
                "username": "Kilodragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=175035"
        },
        {
            "content": "Hey, you ever been to a party and noticed that there is all the food you want in the world but somehow, some way it just doesn't satisfy you? That's sort of the same feeling I got when I finished watching this series. No, I don't mean it in a way that is unsatisfying. I mean it as the series missing something. Like the chocolate is missing an ingredient or the series itself is lacking something. However, Koi to Senkyo to Chocolate does have some of its good flavors. So, let's break this down, shall we?\r\nKoi to Senkyo to Chocolate/Koichoco (also known as Love, Election,and Chocolate) is an anime series produced by AIC Build (Haganai, Oremio) and directed by Tōru Kitahata. The anime is also based off an adult visual novel developed by Sprite. Now what a minute. Did I see the word “adult” in that statement? One might expect some ecchi or or specifically, “adult scenes” in this series, right? Well, not all the case because  in the anime world today, censorship and limitations holds this series at its limit. \\n\\n\r\nJudging by the title of the series, it can be quite easy to predict what the anime may be about especially the given three parts. First, we got the four letter forbidden word: love. From there, one can imply that the series will have romance. And you're right because Koi to Senkyo to Chocolate does have that especially between the main male and female protagonist in the series. The second part, election consists of what the drama takes place at the school in the series. Election is for leadership, to lead a student body, and more importantly to represent themselves. Finally, we have the chocolate. Beyond the sweets and flavor, the chocolate here seem to symbolize the sweetness of life. It is every moment of  life that the students at the academy enjoy with their friends and the memories they create to make their lives worthwhile.\\n\\n\r\nKoi to Senkyo to Chocolate takes place at the setting of Takafuji Private Academy, a rather large school composed of over 6000 students. Within these group of students is the Food Research Club (Shokken) and here we are introduced the main protagonist, Yuki Ojima of the series. The club doesn't do much during their everyday boring lives till the shocking news of that their club will be abolished. Anyone hearing that sort of news definitely wouldn't be happy. Well, the FRC definitely has a few things to say about that. As such, Ojima takes the election of the title and runs for president.\\n\\n\r\nNow, Yuki Ojima seems to be the type of guy who is lazy and avoids doing work. It's bothersome for him and like some of us, tries to procrastinate and put things off as long as possible. His childhood friend, Chisato is there for him though and the two duo makes a strange couple of sorts in the series. The problem here is that these two seems to have a weak chemistry at first. They don't seem to connect and neither do their personalities match. It seems that Yuki is more compatible with some of the other characters, well almost anyone except that guy with the yaoi stick. I mean, that's just not right. But all jokes aside, Chisato and Yuki starts off the series in a bizarre way. With the election coming up, it's time to kill that laziness and say hello to some responsibility. \\n\\n\r\nBeing part of a large school also means allies, friends, and rivals. Satsuki seems to serve as the sort of antithesis in the series who not only play as Yuki's main opponent in the election, but also sort of his outer image. She is like the vanilla flavor of a chocolate and becomes an obstacle of the FRC.\\n\\n\r\nThe story itself have a lot of drama in them. From the very beginning, there is a head and run and later on follows a similar fashion. And of course, election is all about drama especially for those who can win the favors from the students at the academy. It is strange though that in this series, the drama depicted often shifts to different focuses. It intertwines drama between the characters or personal relationships occasionally but at other times, focuses on the topic of elections. Employing this style of story is risky but thankfully in this series, it works out somewhat well. Drama is never easy to employ and with an academy of over 6000 students, just imagine all the possibilities.\\n\\n\r\nThe artwork of Koi to Senkyo to Chocolate is pretty generic to say the least. There is a lot of stereotypes here including Hazuki oniisama who is portrayed as an older woman with tits and the bossy attitude. The school setting itself is also normal despite its large size. The outer settings are those of at typical school in the modern ages and nothing special about that. In fact, the series doesn't take place at much elsewhere besides school. After all, school is where love, elections, and drama are born. On the characters' design side, there seems to be some similarities between this series and Amagami SS; even the drama is there.\\n\\n\r\nAs for the music, the series employs a rather soft melody of school like tunes. It employs both soft rhythm (during calm and comedic scenes) to more dramatic music during scenes that are more emotional. It does mixes in well though and some might even give some credit to Elements Garden, the folks responsible for orchestrating the themes. The OP song, \"Signal Graph\" by Annabel is orchestrated peacefully but also with feeling that depicts the drama in the series. The montage of characters are shown in sequences and even little bits of drama between Yuki x Chisato and what's to come later. Don't forget the election part though as that's what keeps the drama in within the series. The ED song \"Kaze no Naka no Primrose\" by Ceui follows a similar fashion and presents that school like feeling courtesy of Koi to Senkyo to Chocolate.\\n\\n\r\nThis series is actually not bad and has plenty of interesting points. The elections are one of the major themes and throughout the series focuses on it quite well with minimal fillers. Even when the fillers are present occasionally (that are usually short), they still stick with the overall drama theme and how people develop relationships, form bonds, and overcome obstacles together. Like the large cast of school, there is a large cast of characters who each (although some less than others) get their own little spotlights. The oniisama Hazuki, the competitive Satsuki, the black haired loli Michiru, the hyper genius Non-chan, and even that guy with the yaoi stick all get their little moments in. It's amusing and in some ways wants us to be there with them to join the fun and help with the election wars. \\n\\n\r\nUltimately, this series is peculiar. In one way, it's generic and so predictable of the eventual outcome. In another, it is entertaining to watch with all the characters and the drama going around at the huge academy. Just imagine yourself there and trying to become a leader of a student body of that magnitude. It would be like a living hell to handle that sort of responsibility. Despite this though, the series does adapt well and presents drama at its finest with both the elections and personal relationships. The music and artwork focuses on the typical school life and that each day we get by is another day to learn about the world around us. The content of the story has little fillers so it can all be watchable at once in a marathon for those who are fans into that sort of thing. \\n\\n\r\nKoi to Senkyo to Chocolate is a series to enjoy like an extra curricular activity and not stress over yourself of the eventual outcome. School is filled with drama so loosen up a bit as elections are not never easy. To enjoy this series at your fullest isn't easy either but just look at it like a drama play. \\n",
            "date": "2012-09-28T22:38:00+00:00",
            "helpful_count": 101,
            "mal_id": 73555,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=73555"
        },
        {
            "content": "Tthis anime is very much like it's in the respect that it doesn't make any sense whatsoever. The plot is broken and feels  rushed to say the least. The score is lackluster and the characters are little more than boring stereotypes. Almost  everything about this show screams 'average'. To be honest, I would've been happy if it was indeed average. But i was terribly disappointed.\r\nThe biggest problem with Senkyo is it's setting. it is simply put, laughable. Students control EVERYTHING in Takafuji Academy from staff appointment to budget management. in fact, there is no sane adult to be seen during the course ofthe entire anime. It really is preposterous to even assume that 17 year olds have the requisite knowledge to manage a large educational institution. As if this were not enough, the politics surrounding the student council elections is grossly exaggerated. Backstabbing, scheming and attempted murder are what this show considers 'real politics'. Wait a minute, did the writers forget that the story is set in a high school? \\n\\n\r\nThe plot doesn't do anything to ameliorate the boneheadedness of the setting . in fact there is almost nothing apart from the dull politicking to the plot. of course, it is dull because it isn't done right. We don't see Oojima making  valid points to support his cause, instead we see him giving supposedly inspirational speeches while forgettable music plays  in the background. To be fair to the anime, it is worth mentioning that it does bring to the fore serious issues such as student harassment. But it doesn't go anywhere with it. No solutions are provided to the problems the show points out. I'm inclined to believe that the writers never even tried to come with any solutions. This is because the show turns into  a lame thriller around the 10th episode. It seems as if all the drama was placed there just so that the anime could avoid discussing the more serious issues that it had brought up.\\n\\n\r\nMost of Senkyo's characters are boring one-dimensional stereotypes of the worst sort. There are several females surrounding the protagonist as is to be expected from a harem. But only two of them are worth writing in any detail about. Chisato, the childhood friend is probably one of the most self-centered,  whiny and psychologically unstable females in anime I've had the misfortune to witness. Unfortunately, she is the main heroine of the show. It really is a shame because Satsuki, Chisato's competitor and Oojima's political rival is so much better than her in every conceivable way. Satsuki's back-story although cliched, is incomparably better than chisato's, which is laughable to say the least. Speaking of back stories, did I mention that they are the only form of character development there is? And to be absolutely honest, these little splashes of character development feel quite prefunctory and often have no bearing on the plot whatsoever.\\n\\n\r\nThe art, animation, ost and voicework are all pretty average. Nothing much to write about here.\\n\\n\r\nSome people might excuse the myriad flaws of this horrendously blighted excuse for an anime due to the fact that it is a mainstream harem. But there are a lot of mainstream anime out there with a more cohesive plot and better fanservice.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2012-10-23T08:17:00+00:00",
            "helpful_count": 58,
            "mal_id": 75727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/RyugaHellsing",
                "username": "RyugaHellsing"
            },
            "url": "https://myanimelist.net/reviews.php?id=75727"
        },
        {
            "content": "Koi to Senkyo to Chocolate.\r\nThe story of a boy yearning for true love and a girl hating chocolate.\r\nWhen I first caught a glimpse of Koi to Senkyo to Chocolate, I was deeply intrigued by its title. Love and chocolate are all very well in anime nowadays, but elections? Seriously, how could anyone spin a good yarn out of an election?\r\nDue to me having limited time, and also because there were many other anime titles seemingly worthy of my time and attention, I initially put KoiChoco on my on-hold list. However, as the pretenders faded away from my attention, I decided to give KoiChoco a try,to see whether the anime could possibly be good enough to expound upon the dark, deep world of politics, yet be able to maintain the audience's attention over the span of a 1-cour show.\\n\\n\r\nThe premise that the anime offers us is an interesting one. There are few anime which can delve into politics and still come away with a decent fanbase. However, I can confidently say that KoiChoco succeeds well in that aspect.\\n\\n\r\nLet me begin with our protagonist, Oojima Yuuki. He's not exactly the type of perfect person everyone loves to hate, yet he also isn't the whiny loser that has recently become a common occurrence in anime. In other words, one word can describe Yuuki. Decidedly average. He has a childhood friend, Sumiyoshi Chisato, who is the president of the Food Research Club, of which he is a member of. He goes to the prestigious Takafuji Academy, where the student body is responsible for autonomy, but slacks off with his fellow members of the Food Research Club and Chisato, spending their free time in the club room enjoying snacks rather than getting involved in any useful activities. Heck, the entire club is so laid back that even their advisor gets into the act, guzzling beer whenever she has a chance to sneak into the club room.\\n\\n\r\nYuuki's comfortable school life with the FRC could have continued interminably until their eventual graduation, but no. Fate conspires to throw them the prospect of dealing with the disbandment of the FRC. A radical candidate, and the overwhelming favourite for the school council presidency announces her intention to disband clubs that do not carry out any activities that could be deemed useful. At first, the future looks bleak for our FRC members.\\n\\n\r\nThat is, until someone manages to come up with a brilliant yet outrageous idea. Yuuki should run for the student council presidency himself! Rather than waiting to be crushed by the iron fist of the school council president, the members of the FRC proactively decide to support Yuuki's campaign and try their best to prevent the FRC's disbandment. However, Yuuki's campaign team face a mountain of difficulties. Yuuki practically has no acquaintances outside the FRC which he can rely upon, he does not have any political manifesto, ideologies or affiliations and has absolutely no ambition or desire to become one of the leaders of the school council. And here's the ultimate clincher. Yuuki isn't even willing to run for the post himself!\\n\\n\r\nEnough of that. If I write any more I'll be revealing the whole plot of the anime. We don't want to spoil people that have yet to watch KoiChoco!\\n\\n\r\nRating this anime is kind of tough, as it is a jumble of concepts that are so radically different as to be almost irreconcilable. One would be forgiven for thinking that KoiChoco is an anime series that tries the impossible and fails miserably in the process, leaving the viewer with a bitter taste. However, I can guarantee that the story is actually quite well presented and executed throughout the anime. The premise of an election is surprisingly excellently done, with a set of rules governing the election that are actually feasible instead of a load of claptrap, and the show manages to convey the suspenseful atmosphere of an election to the audience very well. An added bonus is that KoiChoco is able to do a fantastic presentation of the dark, murky side of elections.  Throw in a couple of well placed plot twists and cliffhangers and you have the framework of KoiChoco. When I finished watching the show, the first thing I thought was \"Wow. Elections sure are serious stuff.\" \\n\\n\r\nNothing is completely flawless though, and KoiChoco is not an exception to the rule. One major mistake that the studio made is trying to convey too many concepts at once without giving a thought for the overall continuity of the anime. One example being the transition between the first and second half of the anime. The first half is completely geared towards the FRC's preparation for the primary election and their recruitment for help. Smooth sailing so far, up to this point. But after the primaries are over, the anime violently transitions to a romance story, with hardly a mention of the elections that were looming.\\n\r\nThis particular fault made the story seem unreal, disconnected; it could have been two different arcs of two different anime, yet is melded and shaped into the form that is KoiChoco. Frankly, I feel the anime would have merited an even higher score if the studio had competently handled this portion of the anime. \\n\\n\r\nAnother problem is the excessive focus on the Yuuki-Chisato pair. The supporting characters are quite the diverse bunch, but they all fade into the background while the limelight shines on Yuuki and Chisato. Essentially, they are there merely to provide support for Yuuki in his election campaign, as they are all pictured doing their bit to help Yuuki win and so prevent disbandment of the FRC. A couple of the supporting cast actually do play an important role in the course of the anime, but those are few and far between. Granted, the anime is a adult visual novel adaptation which focuses on the Chisato arc of the game. Taking into account the time constraints presented by a 1-cour show, it is indeed logical that the studio turn their attentions and energies to one particular arc rather than trying to adapt everything and end up with a half-assed story.\\n\\n\r\nThe artwork in this anime is very solid and excellently done. Given that KoiChoco is a school-oriented anime, we shouldn't expect dazzling graphics or breathtaking scenes of snow-capped mountains and lush green meadows on par with the likes of 5 Centimetres per Second. For a school setting, the art is comparable to the best, and frankly, there are some scenes that are breathtaking in its own way, such as the bridge in the OP which features prominently throughout the anime.\\n\\n\r\nThe studio certainly deserves some measure of praise for their handling of the  sound portion of the anime. They have got an intuition for the types of music that fit the mood of the anime and are likely to resonate with the viewer, thus enriching the experience even more. For example, when a supporting character is rushing to try and prevent Yuuki from committing a potentially election-ending blunder, the slow piano piece that is played in the background complements the scene and brings out the emotional undertones that are hinted at. On the other hand, the OP of KoiChoco, signal graph, smacks of a plain and generic song. The performance from the singer, Annabel doesn't improve it any further either. The ED, Kaze no Naka no Primrose by Ceui, makes a better hash of things, as it is deeply emotional in nature and able to touch viewers with its enchantingly beautiful melody. I have been told that my taste in music deviates wildly from the opinions of many, so feel free to disagree with me on this count.\\n\\n\r\nOh boy. Next up is the Achilles' heel of KoiChoco, which is sadly its characters. Normally the meat of an anime that complements its story, KoiChoco has let the audience down very badly here, especially considering that it's a harem story. Among the wild variation of characters, we have among others a chocolate hating girl, a guy that is openly gay for Yuuki (comic relief?), a chibi inventor who seems to have a few screws loose, an undercover spy for the student council and a dude whose face is a henohenomoheji. Well, that isn't a major problem on its own. The real trouble with the characters of KoiChoco is that it gives its primary focus to the couple of Yuuki and Chisato. As mentioned above, the supporting cast are simply along for the ride with the exception of a couple of them. Moreover, Chisato morphs from a great character in the first half of the anime into a whining crybaby that hankers after Yuuki for no reason other than Yuuki being admitted into hospital for outpatient treatment. She literally refuses to let him out of her grasp, even going so far as to cling on Yuuki in his own home. I understand the logic behind the studio wishing to portray Chisato as being reliant on Yuuki. It's explained further in the anime. However, I think they could have at least altered the story a bit to prevent Chisato from degrading into such an annoying character. Even if the adaptation were true to the original source material, I feel that this is one example where a measure of artistic licence should be applied in order to prevent the characters from becoming sub-par. The majority of the supporting cast barely get any screen time, and when they appear they're either doing things to help Yuuki in his election, lazing around the FRC club room or making subtle advances towards Yuuki. There are certainly exceptions to this, but their appearances are relatively sparse compared to Yuuki and Chisato. The lack of organisation in allotting screen time to the various characters becomes a major failing of KoiChoco.\\n\\n\r\nWell, for all my criticism I have to admit that I enjoyed KoiChoco very much. From the interesting interactions between the characters, the fresh breath of air that was its premise of elections, and the marvellous art and character design, I can honestly say that KoiChoco is an anime that I have enjoyed very much in comparison to the other titles in the industry. Although it certainly does not reach the dizzy heights of some, KoiChoco can certainly hold its own against other generic anime that have flooded the anime market in recent years. Moreover, it offers us a more in-depth view in the world of politics, something which I have never seen in an anime before, excepting the odd student council election that isn't the main focus of the anime. Since I enjoyed all the aspects of KoiChoco fairly well, I will say that KoiChoco has afforded me great enjoyment, particularly because I retain a certain interest in politics.\\n\\n\r\nIn conclusion, KoiChoco has its share of flaws and failings, however I can safely conclude that it is a decent anime which manages to capture the audience's attention and hold it through its airing. If you are intrigued by the premise of KoiChoco, I would certainly recommend that you give it a spin. Who knows, you might be amazed by what KoiChoco brings to the table.",
            "date": "2012-12-19T02:17:00+00:00",
            "helpful_count": 50,
            "mal_id": 80556,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1909180.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KiraMikoto",
                "username": "KiraMikoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=80556"
        },
        {
            "content": "A big problem with visual novel adaptations these days is that most of them stick to this formula where nothing really happens, there's a lot of attempts at humor, they explore each (or most) character(s) and the protagonist picks a girl. Koi to Senkyo to Chocolate is different, although it still shares some similarities with most visual novel adaptation, it separates itself by having a pretty interesting plot, which makes the series enjoyable.\r\nWhat really makes the plot interesting is the twists and turns that happen along the way. The plot may seem simple at first, the main character trying to win an election to bestudent body president so his club would not be disbanded. But as the series progressed and as they started to give us a deeper look into the election, a number of darker and more serious things start to surface. For a 13 episode series it does a real good job at making an interesting plot because it has depth to it.The series does leave some things unexplained and the series certainly has it's flaws but given the time frame, Koi to Senkyo to Chocolate executes the story really well.\\n\\n\r\nThe art was nothing too spectacular but it is really well drawn. The animations are very fluent and there's no major errors.\\n\\n\r\nThe sound was good too, the opening is very lighthearted and has a very happy mood, which fits the series very well. The ending is a very soft song, which has this farewell feel (if that makes any sense at all), very fitting for an ending. The voice acting is also done pretty well as they make the feelings of the characters believable.\\n\\n\r\nFor the short time frame that this anime was given, the series did a fair job with the characters. The main male protagonist Yuuki Oojima is a lot like many main male protagonists in other harems, except he isn't useless. He doesn't really get much development but instead he helps the other characters develop. He is also very likeable much like many of the other characters. The girl he ends up with, Chisato Sumiyoshi, is not very well received by others, but personally, I don't hate her. She goes through some nice development such as finally overcoming the loss of her brother which is more than expected from a series of this length. The supporting characters get little development, some get some development and others aren't even touched. However they are still all likable and you will almost always be finding yourself rooting for somebody.\\n\\n\r\nAs a whole Koi to Senkyo to Chocolate is one of the more enjoyable harems for a number of reasons. One of the main reasons is because it has an interesting plot. Another reason may be because of it's comedy, which is well-placed at some times but misplaced at others but when the comedy is well-placed, it can be down right hilarious.\\n\\n\r\nOverall Koi to Senkyo to Chocolate is a nice change from many other visual novel adaptations these days because it can be very entertaining. This also shows that not all harem animes are that bad.",
            "date": "2012-09-30T18:11:00+00:00",
            "helpful_count": 30,
            "mal_id": 73753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=73753"
        },
        {
            "content": "Well this is my first review, so I hope you would be satisfied.Well firstly, this is your typical ''club and student council'' type of anime.The art is well done,very similar to amagami ss.So far the series is going pretty well and yes there's some romance and a bit of harem here and there,There's also a dash of comedy which makes it enjoyable.The story itself isn't unique,since there are some anime with the same concept,of student coucils and clubs.The chocolate-candy concept is kinda new though.Hopefully, this series wouldn't turn into  your typical ''harem''.",
            "date": "2012-07-20T13:45:00+00:00",
            "helpful_count": 29,
            "mal_id": 67159,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1402787.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/joshy-joshy-san",
                "username": "joshy-joshy-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=67159"
        },
        {
            "content": "To start of Koi to Senkyo to Chocolate looks like your typical slice of life anime where the club is having problems. However, this one is different because it incorporates 3 elements that I feel make it unique or special. The first element that I liked was the drama because on the outside you have the typical slice of life vibe, but once the action gets going especially towards the end that is where drama is released. Dialogue is the second element that makes this Koi to Senkyo to Chocolate different because with having presidential elections one would expect to have a lot of dialogueto present their points or objectives. the third element which is comedy incorporated well since it was kept at a minimal level and mostly done from the side or supporting characters.\\n\\n\r\nStory: The story was ok, but I feel like it was rushed. There was some parts during the story that just felt ignored or not fully explained. Still what makes the story have a higher score is the drama part because it is nicely done. The last couple of episodes really make up for the lack of drama at first. Comedy wise that didn't hurt the story, and the characters all brought the story together even more.\\n\\n\r\nSound: The OP and ED are very nice and worth watching every time. Not much to say here besides saying that during those serious scenes the background music really enhances the scene even more. The main song that is the highlight of this anime is the song played by one of the characters who use a harmonica.\\n\\n\r\nCharacter: The score really doesn't reflect on most of the characters but rather on some of them. Chisato from my perspective had a very complex personality that helped relate or understand her. Michiru another character is one that I liked the most based on how she behaved. Her appearance really makes her stand out from the rest of the characters because she carries that mysterious presence whenever scene shows her by herself pondering. \\n\\n\r\nEnjotment/Overall: I sure wish this anime had a second season because some things could be explained better there, and it would be nice to see maybe time skips of how the school is doing as well. Overall I really enjoyed Koi to Senkyo to Chocolate and the ending really helped bring the number up even more. Despite the low passing score that the story has the characters make up for that and really help make the anime worth watching. the comedy also made me burst into laughter at times so that also incorporated into the overall score.\\n\\n\r\nI'd say for those who want to watch an anime that will make you laugh, yet have a serious tone then Koi to Senkyo to Chocolate is one to watch. Just be prepared for the moderate dialogue. Other than that I will sure remember this anime and the amazing characters it had. \\n\\n\r\nHopefully you all found my review helpful and I hope you all like Koi to Senkyo as well.",
            "date": "2014-03-22T07:42:00+00:00",
            "helpful_count": 27,
            "mal_id": 136433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2084755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SweetKiichigo",
                "username": "SweetKiichigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=136433"
        },
        {
            "content": "“Nothing ventured nothing gained” That is one of the quotes that came to my mind after starting this anime. The main protagonist Yuuki Oojima has the option to run for an election to save his precious club, he starts his election after hearing similar words from people around him. \r\nAt first I thought Choi to Senkyo to Chocolate would be your typical school club romance type anime. For me it ended up becoming so much more. It starts out with a dramatic event that honestly makes hardly any sense until you get quite a ways into the anime. Once things start to make sense thoughthis anime seems too really shine. One of the things it portrays is that politics aren’t always what they seem on the surface.  There is always a struggle behind the scenes and this is one of the topics this anime tackles in a very interesting fashion. Throughout the anime it confronts the things that happen on the surface and behind the scenes in politics. \\n\\n\r\nKoi to Senkyo to Chocolate also has the drama and romance to go with it that makes it all the more intriguing. Each character has their own story and their own reasons for doing things. They are all unique and make the story come together wonderfully. \\n\\n\r\nAs for Koi to Senkyo to Chocolates flaws, it definitely does have them, though most are easy to look over. One of it’s biggest flaws I think is that it sometimes feels rushed sometimes. I would have liked to see this anime more around 23 episodes. It also has it’s cliché’s like most anime, things seem to always work out for the better. Oh and they never explain some things like how Oojima seems to see some people in a strange way, though it’s easy to make speculations.\\n\\n\r\nOverall I was very impressed, especially considering I wasn’t expecting much of anything of this anime. It has all the factors to make it a very enjoyable watch. I also don’t know of many anime’s that present politics and romance in the way this anime does, which made it even more enjoyable.  Either way whether you enjoy drama, romance, or politics this is a good watch!",
            "date": "2012-09-28T01:49:00+00:00",
            "helpful_count": 23,
            "mal_id": 73467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/490993.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Alarisia",
                "username": "Alarisia"
            },
            "url": "https://myanimelist.net/reviews.php?id=73467"
        },
        {
            "content": "Love, Elections, Chocolate.\r\nOn the surface it seems like a typical highschool drama. There's a boy, he's part of a club, and that club is going to be disbanded if they don't do something! When I see a story like this what it comes down to typically is how enjoyable the characters are to watch. Coming into this I knew the anime wasn't my typical selection: It's not in the top 1000, and it's rated 7.4. But I found the anime to be enjoyable overall.\r\nIf you're trying to decide whether or not to give this a try, I'd say be ready to accept a certain amountof tropes and cliches. I'd say it's not a masterpiece, it's not great. It had a lot of flaws. But I found it enjoyable, and it has a happy and romantic ending.\\n\\n\r\nTo begin, this is based off of a visual novel by the same name. As such, it suffers a quite a bit from \"all sorts of females are inexplicably in love with the main character\" syndome (ironically not so much the club members). It feels very scatter brained because you can tell where there would've been multiple routes for different heroines in the visual novel; however these are not pursued in the anime. This leaves the Main Character feeling rather weak and indecisive at times. For the majority of the episodes though you have a slice of life show about a guy trying to get elected, with occasional bits of drama sprinkled in. The plot and drama really heat up in the last stretch of episodes, and this is when the show is at it's best in my opinion.\\n\\n\r\nThe art/sound were both well done but nothing to be amazed at. They don't detract from the storytelling, and the music does a good job of setting the mood at the right times (mostly).\\n\\n\r\nThe anime would've been better if it had focused on one primary female heroine, and if the main character felt a bit stronger and decisive. It did feel like the story had gaps, it was as if there was too much story to fit into 12 episodes (again, probably because it's based on a visual novel in which all of this could be explained in more detail). Still, it did something I find few animes doing these days and that's end happily. And I liked the fact that it didn't try to spring a new romance into the fray mid way through. Despite the fact that the M.C. feels pretty weak in his convictions (towards potential romantic interests) at times, the anime ended romantically as I think it should've. \\n\\n\r\nBased on enjoyment alone I'd give it a 7, but I think overall I have to go with a 6. I by no means feel like this was a bad show, but you've gotta be ready to accept it for what it is: a nice little story about a club trying to get their friend elected president with a little bit of plot to intensify the romance at the end.",
            "date": "2013-07-26T10:04:00+00:00",
            "helpful_count": 15,
            "mal_id": 106943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1954238.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ExOsc2",
                "username": "ExOsc2"
            },
            "url": "https://myanimelist.net/reviews.php?id=106943"
        },
        {
            "content": "Love, Elections and Chocolate. I think that's the textual english translation for this title. And it pretty much sums the whole anime up. That's it for this review, see you in the next one! :D\r\nThat's what I would really had liked to say because of the first impression this anime gave me. It has all the elements that make it look like your typical harem - slice of life - high school anime. It even has all of the archetypical characters, and most of them have to be female, of course. However, this anime achieves a lot more than what you might think.\r\nThe setup isa rather large private school, composed of about 9999 (or all of the 9's you can imagine for a single number) students, and thus, the student council is taken pretty seriously. You could say that the students themselves are the ones who rule this academy. It's kind of an utopic school, where the democracy has a huge roll and it's executed perfectly. \\n\\n\r\nEnter our main character, Yuuki Ojima: A rather lazy student who attends to this school and belongs to the \"food research\" club that does virtually nothing more than eating. He belongs to it just because there's something that tells him that he must be in a club, and of course, to be with his childhood friend, Chisato Sumiyoshi.\\n\\n\r\nAs the student council gets serious about clubs literally wasting and throwing money away in order to keep doing nothing, our main characters and the rest of the club decide to protect it, and the only way is that one of them becomes the council student president.\\n\\n\r\nAs our main character becomes more and more popular every time because of the elections, he starts to realize that there's a lot more to do than saving his own club. He starts to develop selfless-ness, and he becomes some sort of a pro-active guy, caring about what happens around him, leaving his laziness behind. And this is where the well executed drama (specially with his childhood friend, Chisato) begins.\\n\\n\r\nI never thought I'd say this about an anime, but there's a honorable mention that I want to give to the comedy aspect. which was not abused nor it was totally absent either. Somehow they put this when the times were right and it helps you release some tension that the story builds up as it progresses. It just comes naturally, and even if you dont think it's funny, it helps you to recover your pace and catch some air. Alright i'm exaggerating :D \\n\\n\r\nI give the story a solid 8, as it  has different \"areas\" where it develops itself, but it does in a pretty convincing fashion, without losing any of its focus. \\n\\n\r\nI would say 12 episodes weren't enough, as the development kind of required some more depth to it. However, I think pretty much everything was very well executed plot-wise. Nothing was rushed nor over-extended either. \\n\\n\\n\r\nThe characters, as I mentiones before, are nothing that blow your imagination away, for they are these archetypical characters. However, the characters' development is notably one of the strong point of this anime. It was really good to see these people not hesitating to take mature decisions to support the ones they care about, as well as leaving some stuff about their regretable past behind. When you start do develop some sort of love/hate relationship with one or more characters, that's the moment you will know they were well executed and have an impact.\\n\\n\r\nThe art in this anime was ok. it reminded me a lot of Amagami SS, specially on the characters design (although this aspect is a little more exagerated in Koi to Senkyo). Everything was pleasant to see and is well detailed too.\\n\\n\r\nWhen it comes to the sound, i found it awesome for an anime of this type. I was really immersed into the general feeel and atmosphere of each scene because of the background music solely. It really invites you to become one with the plot.\\n\\n\r\nVoice acting was also good enough. Not outstanding, but it was well done for my taste. Emotions were convincing.\\n\\n\r\nI would say that I enjoyed this wayy much mure than I thought I would, even if the three first episodes were full of \"OMFG not this again\". If it catches you from that moment, you will not be able to stop it. Even tho some of the arcs were over the top, it made me experience a lot of empathy towards the characters. I recommend you to give this one a try and see where it takes you :D\\n\\n",
            "date": "2014-09-15T09:52:00+00:00",
            "helpful_count": 15,
            "mal_id": 160433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3685101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DolbyThX",
                "username": "DolbyThX"
            },
            "url": "https://myanimelist.net/reviews.php?id=160433"
        },
        {
            "content": "Hi people. This will be my first review ever and it is mainly to defend the low ranking and low points this anime has for its rating..\r\nKoi to Senkyo to Chocolate started out with something like a comedy but in the later episodes it starts to develop a story. It is about a Boy and Girl and some other schoolmates as they chat and laugh together in a club. It is something like Haruhi Suzumiya and Boku wa Tomodachi ga Sukunai. However more similar to Haruhi as Koi Choco has a somewhat deeper story behind it. \r\n~Story~9/10 - Okay, the story is good to acertain extent. Firstly please don't judge a book by its cover. Basically, this anime is not what it looks like in the picture on the left. It is also not what it IS like in the first 3 episodes. BUT, the whole anime is quite rushed. It would be better if it was stretched to 24 episodes or something. But overall its good :)\\n\\n\r\n~Art~9/10 - I like the art. The design is nice. Similar to Boku wa Tomodachi ga Sukunai.\\n\\n\r\n~Sound~8/10 - The OP and ED fit the show. At the first 2 episodes i was like \"Why the hell is the ED so sad when this is a comedy anime?\" And now it all makes sense. Going later into the episodes, you will start to like the songs used as it starts to fit better into the story. \\n\\n\r\n~Character~7/10 - All is well except for a few characters. There are some characters that just don't fit well. The story is mainly about a club. So there must be people in it. But because it is a club where they do nothing but chat, laugh, play and EAT lots of food everyday, there must be club members in it to make it lively. So, there is these pair of similar female characters that just acts like some wild monkeys and they say the same thing all the time and etc..\\n\r\nThere is this other female character, an inventor who would invent the right stuff at the right time. Invents all sorts of machines that serves no purpose (Except for a couple at the ending). BASICALLY, these 3 characters makes no impact on me. After watching everything, I still don't feel a bit for them. Its like they were just there to make the club LOOK lively with more people. \\n\\n\r\n~Enjoyment~9/10 - Because the genres are Drama and Romance, I expected some story but the first impressions shows a comedy-liked anime. After awhile when things start to get serious in the story, there were moments where my heart just raced super fast and all. Like you know the feeling when you feel \"Touched\". Yea that. I am a male and usually when I see other animes and there is this \"OMG SO SAD\" part of an anime where it is supposed to make the viewers feel \"Touched\" or make them cry, I will feel like \"This is not even sad why should I feel sad?\" But KoiChoco made my heart feel sad and touched 4 times. Especially the one on episode... haha no spoilers \\n\\n\r\n~Overall~9/10 - Okay just to sum up, it is supposed to be a 7 at first because I thought it was just an ordinary harem anime with comedy. Then somewhere in the middle I upped it to 8/10 because there was more focus on romance. Then at the end, because of the nice background story there is to the anime, I decided to make it a 9/10. 1 thing I do not like is, it is still only a 12 eps anime and not a 24 eps one. \\n\\n\r\nOkay hoped I helped.\\n\\n\r\nI know there are quite some few who dislikes the main female lead character because they find her annoying.. But she is actually not.. People who haven yet to watch the anime, please try to like her as fast as possible. Yea her name is Chisato.",
            "date": "2012-09-28T09:41:00+00:00",
            "helpful_count": 15,
            "mal_id": 73499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Notthatfasthuh",
                "username": "Notthatfasthuh"
            },
            "url": "https://myanimelist.net/reviews.php?id=73499"
        },
        {
            "content": "I love chocolate, wtf am I saying? Ok, so this sweet anime has ended and I glad that it becomes a Yuuki X Chisato arc, so let's get down to business:\r\nStory: Good 7.\r\nI say even though the story is a mixed up arc, I like the way where is was going,co'z everything about this anime revolves around love, elections and chocolate. The love part are the occasional arcs where the muchacho (Yuuki) encounters, though it still has that guy is oblivious to girl's feeling kind of thing. The story kinda misdirects us audience as to whom will the muchacho (Yukki) will end up with, evenif the muchacho (Yuuki) has told the chiquita( Chisato) that he'll never leave her side, we sort of ignore it hoping that it'll be whom we hope for. Needless to say that the \"Love\" thingy of this anime's title refers to Yuuki X Chisato's arc, in fact the romance genre revolves around it. The \"Election\" thingy of this anime's title is more of a  mystery genre that surround the bureaucracy of the student council in particular the \" Public Safety Commission\"  and the Katahira Faction, and as for the \"Chocolate\" thingy ( I love chocolate), that is where the drama genre is and it is all about the chiquita's (Chisato) hatred  of chocolate and Daikin her hermano (brother).\\n\\n\\n\r\nArt: Fair 6.\\n\\n\r\nOk for the girl's school uniform, I really can't dig the illustrator's idea as to why most students don a 4 layer dress, which btw is the cropped jacket which the 4th layer and worn by most girls and why do some girls only have 3 layered uniform, wtf do I mean? Ok most girls have the follow layer of school uniform which is compose of the following; camisole, shirt, skirt and cropped jacket....btw the ribbon is not included. on the other hand Michiru, Ai Ki, and Isara don a 3 layer uniform, which only includes the camisole, shirt and skirt. If this is the illustrator's way of distinguishing the freshmen from the older students then that is a a very cheesy concept. I'd rather see them girls wearing an ordinary sailor's outfit than having to discriminate certain character's outfit.\\n\\n\r\nSound: Good 7.\\n\\n\r\nI like the both the opening and ending theme, but I mostly prefer the opening theme. Which is titled \" Signal Graph\" sung by Annabel:\\n\\n\r\nSignal Graph, English translated:\\n\\n\r\nMy hand can reach you as you stand smiling in front of me.\\n\r\nBut although I’m so close to you I can touch you,\\n\\n\r\nI put up a front and close off my feelings\\n\r\nand pretend I don’t notice the emotions flowing out of my heart.\\n\\n\r\nBut even beyond the cloudy sky blurred by my tears,\\n\r\nthe bright blue sky spans across.\\n\r\n“The signal telling me I can change.”\\n\\n\r\nI’ll raise my hands high up\\n\r\nso take me from the past I feared\\n\r\nand into the future I thought\\n\r\nI’ve let go.\\n\\n\r\nI just noticed you and that\\n\r\nwhich shines brightly within you.\\n\r\nI’ll look straight ahead\\n\r\nand walk forward together with you.\\n\\n\r\nI knocked down one of my dreams I thought I could reach.\\n\r\nAnd I sat there looking out the window…\\n\\n\r\nWhen our eyes meet, I can’t say anything.\\n\r\nSo I smile hoping my smile will convey these overflowing feelings.\\n\\n\r\nAccepting each other is not because of weakness,\\n\r\nso teach me how to have a stronger heart.\\n\r\n“The signal telling me I can change.”\\n\\n\r\nSpeeding up my pace along with yours,\\n\r\nI’ll take the tailwind\\n\r\nand go towards the future I thought I’ve let go\\n\r\none more time.\\n\\n\r\nI keep the strength you gave me deep in my heart.\\n\r\nOne day I’ll be sure\\n\r\nto shine brightly and shine over\\n\r\nothers and the roads they take.\\n\r\nThe bright light, gives me a push on my back, and spreads far.\\n\\n\r\nI’ll raise my hands high up\\n\r\nso take me from the past I feared\\n\r\nand into the future I thought\\n\r\nI’ve let go.\\n\\n\r\nI just noticed you and that\\n\r\nwhich shines brightly within you.\\n\r\nLet’s walk forward holding hands.\\n\\n\r\n“Given enough time, everything will change.”\\n\r\nI won’t ever say that anymore\\n\r\nand go towards the future I thought I’ve let go\\n\r\none more time.\\n\\n\r\nEven against the wind raising its speed,\\n\r\nI won’t close nor avert my eyes.\\n\r\nI’ll look straight ahead\\n\r\nand walk forward together with you.\\n\\n\r\nWalk forward.\\n\\n\\n\r\nCharacter: Good 7.\\n\\n\r\nYuuki Ojima- The thing about him, is that he's a kind of guy who is aware that the girls have feelings for him, but seems to be of a block head as what to do next, ok so he's a bit of a Mr. Heroic when he tries to save Isara from being builled and when he also mends Satsuki and Hazuki's differences. But he kind looks like this soon to be reluctant philandering husband where he searches for love only to find out that his real heart belongs to Chisato.\\n\\n\r\nChisato Sumiyoshi- everyone kind get's irritated when she seemly dominates Yuuki and seem to relies a lot on Yuuki for emotional support. But it is that emotional dependence  that gives her character that dramatic climax.\\n\\n\r\nMifuyu Kiba- Well, if you were to ask me, she actually my 2nd choice if ever the Chisato X Yuuki arc didn't come about, I like the way she has that gentleness about her, but I can never understand as wtf is a big deal about Japanese teenage girls on being insecure about having a scar? When in her case she had it co'z she had underwent surgery, now it is not like that she lost her virginity co'z she was raped or something.\\n\\n\r\nIsara Aomi- I kind pity her, and I could have wish that she wasn't being buiiled.\\n\\n\r\nMichiru Morishita- If only if this anime wasn't being censored, I would have seen her panty. But I can never understand as to why is she sooo passive and yet sooo deadly. I really hate it that she's an S-agent though, but she one moe that you'll find interesting. \\n\\n\r\nSatsuki Shinonome- Whoa, she one hell of a refine lady with both beauty and brains.\\n\\n\r\nNozomi Edagawa- or 'Non Chan, ........I have nothing to say.\\n\\n\r\nAi Sarue and Kii Monzennaka- I guess if this anime should have a tsundere character, they are it.\\n\\n\\n\r\nOboro Yumeshima - Yaoi? EEEEWWWWW! ( No offends to the members of LGBT society)\\n\\n\r\n Hazuki Shinonome - What I like about her is that she's one Milf that everyone will love............to be Yuuki's cougar that is. \\n\\n\r\nAs for the rest of the cast, If there will be a character that best describes as the mystery genre of this anime, then it'll be Yakumo Mōri and Kana Ōgibashi and as the antagonist it'll be Moheiji Tatsumi in which I can never understand as to why he has to be in a henohenomoheji-like mask and Yuina Ōsawa. I really find it irritating that teens like them seems to be in control of  Takafuji Academy.\\n\\n\r\nEnjoyment and overall: Good 7.\\n\\n\r\nWell, if one is to enjoy watching this anime, then it is really enjoyable to watch, especially when one is hoping for someone to be Yuuki's love interest, in which I'm glad that it ended with Chisato. Overall I find it irritating that  Takafuji Academy seems to be controlled by the student council and the student council itself in embroiled in such bureaucracy where such mystery genre  was formed in particular as to who ran over Kana, what anomalies does each commission of the student council is in to and why does the Public Safety welds such authority not only over the students but also with the faculty and the school administration. Such things are ill fitting to the overall of this anime, but it does provide such curiosity as to how things will go about, so it is only limited to have a 7 for its overall score.\\n\\n\\n\r\nI love chocolate.  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2012-09-29T09:17:00+00:00",
            "helpful_count": 15,
            "mal_id": 73597,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=73597"
        },
        {
            "content": "Love, Election and Chocolate is pretty much another anime based off a dating sim game with our male lead Yuki being surrounded with several girls he interacts with in his school club. To a good extent, the anime essentially milks the typical cliches and archetypes of dating sims, harems and high school-based anime, which include even a student council that has more authority over school issues than the staff to go along with its \"election\" premise.\r\nIt does have some refreshing story elements to its dating sim roots. Yuki isn't made into a hapless lead dealing with unwanted attention from the girls surrounding him as heis a level headed guy trying to get a handle on all the situations surrounding him in the school as he runs for student council president and has clear thoughts on the feelings he has for the girls surrounding him within the club or around the school. While the anime has some fan service and double-entendre moments, they don't pop up often nor do they get in the way of developments with the show's plot. The first half also has some potential with its election plot as Yuki tries to gain support for his electoral run and understand the ropes of being a student council leader.\\n\\n\r\nThe series quality starts to degrade in the show's second half when elements to the show's dating sim roots start to rear their ugly head. The sub-plot that Yuki is dragged into involving hostilities between two characters got decent focus and genuine drama out of the affair. However, Love Election and Chocolate's attempts at adding romantic developments in its second half are rather underwhelming as they are rather unconvincing and poorly mixed into the ongoing developments Yuki has with the election. The election bits even degrade in quality as well when things get way too overly serious over the stakes of the election when things such as secret groups, conspiracies and scandals get added to the mix with such students treating the election as if they were trying to win a campaign to run a country. It's perhaps the poorest example I've seen of the \"Absurdly Powerful Student Council\" trope getting milked from an anime to date.\\n\\n\r\nVisual quality for this is a bit on the plain side for a 2012 title. There are sharp details and bright colors incorporated for character designs and scenery to compliment the cheerful mood the anime wants to give off. However, nothing with it particularly stuck out in comparison to other impressively visual titles animated from that time such as Eureka Seven AO and Fate/Zero's second half.\\n\\n\r\nMuch like many other dating sim knockoffs I've come across, I'm rather indifferent towards Love, Election and Chocolate. Despite having some decent elements to its premise, the series still mostly milks off story cliches and character archetypes typical of the genre and the election story gets rather ridiculous in its second half when it tries to act like its making a statement about politics. Unless you're a sap for dating sims, I'd pass on this.",
            "date": "2015-01-11T19:16:00+00:00",
            "helpful_count": 14,
            "mal_id": 177477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=177477"
        },
        {
            "content": "One of the most common ailments of VNs-turned-anime is that it's easy for the romance to overwhelm the story.  Integrating a game with multiple routes with multiple leads into one single storyline often ends with a anime that, at best, seems like a harem anime that lacks the courage to actually make it a harem (Clannad) or, at worst, a mess of routes that fails to flesh out characters well and butchers the plot (i.e. Studio DEEN's adaptation of Fate/Stay Night).  Koi to Senkyou to Chocolate manages to find a tenuous, if workable balance, between plot and characters in this adaptation of theoriginal Eroge.\\n\\n\r\n=Story: 9=\\n\\n\r\nAt the beginning of the season, Koi to Senkyou to Chocolate started out near the bottom of my priorities list, fulfilling the spot of stereotypical-harem-with-a-plot that just manages to stay good enough to avoid being dropped.  The first episode certainly reinforced it, with a club with seven females and two males, one of whom is also apparently heads-over-heels over the other, the protagonist.  The originally chilling prologue of the first episode seemed to have been completely forgotten, and the whole election was going to be a happy but uninteresting frolick of cuteness and relationships.  However, KoiChoco (Koi to Senkyou to Chocolate is a bit too much of a mouthful) does in fact develop from a harem with a plot. \\n\\n\r\n As is the case with apparently all Japanese High Schools, the Student Council holds vasts amounts of power.  In the case of Takafuji Private Academy, an academy whose finances are almost completely managed by the students, the Student Council controls the (as mentioned in Episode 11, \"tens of billions of yen-strong\") expenditures of the  school.  The Preisdency usually is fought over by three major factions within the school: the Finance Committee, the General Affairs department and the Public Safety Commission.  With the current incumbent plagued by allegations of corruption, the projected winner, Finance Commissioner Satsuki Shinonome, campaigns on a platform of austerity, starting with the elimination of clubs that do not appear to be doing anything productive with their funding.  Into this is thrown protagonist Oojima (often mistaken as Ooshiima due to the Kanji) Yuki, who is nominated by the members of his club (the Food Research) to run as a third-party candidate in order to save his club, all the while confronting the many interpersonal issues that emerge through the course of the campaign.\\n\\n\r\nDon't get me wrong, KoiChoco does not neglect the character-side of the story--much of the election (and much of the routes in the VN) are bound to interpersonal relations--the past traumas of Election Manager, Club President and Childhood friend Chisato Sumiyoshi, the family struggles of Finance Commissioner Satsuki Shinonome, the personal struggle of Isara Aomi, a beneficiary of a controversial financial aid program, and the enigmatic motivations of Yuki's backer and incumbent president, former Public Safety Commissioner Yakumo Mori. However, what makes KoiChoco an exceptional adaptation is its focus also on the main plot.  Through the story, Yuki and the Food Club must confront many of the problems faced by Third Party Candidates in a field dominated by large, well-funded parties, while also delving into the behind-the-scenes politics behind Yuki's backer, the Public Safety Commission, and the two other commissions.  Sometimes I found that the actual story at times seemed more appealing than the interpersonal struggles of the characters, though the opposite also occurred.  Overall, KoiChoco's best point was its ability to both bring out the interpersonal interactions of the cast while also maintaining an interesting and absorbing main plot.\\n\\n\r\n=Art: 7=\\n\\n\r\nWhile nothing bad can be said of the art--it is certainly cute, and there are no major drops in animation quality, the art comes off as unexceptional--good but not much different from anything else out there.  The anime frequently uses soft, pastel-like colors that help maintain a warm atmosphere to the anime in general, which does contribute to the atmosphere, but not in any noteworthy way.\\n\\n\r\n=Sound: 8=\\n\\n\r\nKoiChoco's Openings and Endings start out generic, but grow on you very quickly.  Signal Graph, the OP by Annabel, a departure from the generally soft, rather quiet Ending themes the Artist usually does (as in Sankarea, Canaan and Another's Endings), is an upbeat, enjoyable song that conveys the mood of the anime quite well, while the ED, Kaze no Naka no Primrose by Ceui, is also pleasant, but not quite as noteworthy.  The soundtrack music is certainly good, with a lot of synth, string and piano themes that would be expected of a romantic anime.  While nothing is lacking in the OST, there is nothing that would really come out as exceptional.  \\n\\n\r\n=Character: 8=\\n\\n\r\nThe main issue with many of the characters in KoiChoco is that they seem underused.  Many of them (Chisato and Yuki's friend Mifuyu, Michiru, Satsuki), while itneresting and well-fleshed out characters, do not seem to be used to the best extent they could, for the very reason that adapting their whole route into an anime of only twelve episodes would be difficult.  Other characters that probably held much more potential (i.e. the abrasive and strange Moheiji Tatsumi, whose mask apparently only Yuuki can see, Satsuki's sister and Yuki's adviser Hazuki, and Aomi) are also left seemingly without much elaboration.  Once again, the limits of a twelve-anime show should be brought into consideration, but the underutilization of some very interesting characters was a bit of a disappointment that reduced the score from 9 to 8.  On the other hand, other characters seemed pointless and unimportant--the cutely generic child genius Non-chan, Ai Sarue and her other-colored-twin Kii Monzennaka all seemed forgettable, with no seeming purpose apart from filling the club with people.  While that, too, should be expected of minor characters, they could have been replaced with less generic characters.\\n\\n\r\n=Enjoyment: 9=\\n\\n\r\nFor me, KoiChoco was a pleasant surprise in that it simply broke my expectations of a generic harem show and turned out to be a not-quite-riveting but certainly very interesting story that combined both interpersonal relationships with some of the actual politics and pressure behind an election.  The fact that at times my heart did race is certainly enough to elevate it to a 9.\\n\\n\r\n=Overall: 8=\\n\\n\r\nKoiChoco should honestly be deserving of a 9 - I really do want to play the Visual Novel now, and its plot probably covered most of the spots that made me dissatisfied with the anime.  The characters were pleasant, the story was excellent, and though the arts and sounds were unexceptional, they were certainly not detrimental to the story.  The only obstacle to getting a 9 in my book would be unavoidable specter of the 12-episode limit, which probably prevented many of the scenes from being employed to their best effect.  Overall, though, I thoroughly enjoyed KoiChoco in its 11-episode run, and look forwards to the last episode.",
            "date": "2012-09-23T12:56:00+00:00",
            "helpful_count": 14,
            "mal_id": 73073,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304909.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TimChan",
                "username": "TimChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=73073"
        },
        {
            "content": "People say \"never judge a book by its cover\" and I cannot expresses how it is true for this anime when it caught me off guard. Some may think this anime is like any generic and stereotypical anime about schools and how any stereotypical characters interact with each other. Well you're half right but you are also wrong. This anime is more than that, it doesnt follow the general dogma as some of you might say it and it will drawn you into a world of politics, revenge, violence, discrimination, and dramatizations. If you are into school, comedy, romance and drama, this anime is justfor you.\\n\\n\r\nArt/graphic -  The art is beautiful, all I'd have to say is its better than most anime I've seen so far including the more recent ones. Although I do feel that they could have done so much more with the art, I think this amount of work was the right choice for this anime. \\n\\n\r\nSound - This one is especially my favorite, I was instantly hooked with the OP as well as the first song in the beginning of episode one. \\n\\n\r\nCharacter -  I'm not going to talk about the character because people have different interpretation on what is a good or what is a horrible character.\\n\\n\r\nStory - This is what really drawn me into this anime. Unlike any other orthodox   short series comedy, romance anime where the plot (or no plot at all) come after 6 or 7 episode of the anime. (I know how frustrating it can be) The plot in this anime immediately present itself after one or two episode. Although this anime have many characters, it seem only to revolved around the main protagonist and his girl. Although this anime have a harem feel to it, it definitely going a different path than what it was meant for. What really makes me loved this anime was that the ending unlike any other thousands of anime, did not have a half ass ending. Im sure many of you have encounter many of these anime where the main character do not end up with anyone or the ending wasnt to your satisfaction. Well, I wont spoil any ending but the main character actually do choose a girl at the end and had over come many obstacle to be able to achieved his goal and love life unlike other protagonist where they are too \"pussy\" or weak and had to let the girl do everything. \\n\\n\r\nThis anime definitely caught me off guard as I was looking for something enjoyable to watch in my spare time. \\n\\n\r\nEnjoyment - 9",
            "date": "2013-03-08T23:43:00+00:00",
            "helpful_count": 14,
            "mal_id": 89133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1994010.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Noir0",
                "username": "Noir0"
            },
            "url": "https://myanimelist.net/reviews.php?id=89133"
        },
        {
            "content": "This series might have some solid stuff. The series is made intellectually pleasing but tries to keep other kind of folks interested too by the usual harem school club setup and it has worked decently though not brilliantly. The art doesn't help out much in favor of ma king it anymore attractive. The strong points of the series are I think, the characters and the dialogues. The first episode gives the air of an espionage thriller and political feel which has been heavily normalised for a high school setting and how the author uses this theme creatively is to be seen and I would likeit to work out well since it seems very interesting and hoping it wont lose its momentum and become just another excuse for a harem. I can draw parallel to the series \"Kyoukai Senjou no Horizon\" which was just too brilliant in story and style. Considering the fact that there are a lot of double meanings and that it uses a serious topic such as election politics, censoring and that too the just mild ecchi contents is very irritating and counter intuitive.",
            "date": "2012-07-05T22:35:00+00:00",
            "helpful_count": 12,
            "mal_id": 65451,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261710.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/puvijain",
                "username": "puvijain"
            },
            "url": "https://myanimelist.net/reviews.php?id=65451"
        },
        {
            "content": "Short version: While not well executed, this series has a unique approach to its story, which is why I do recommend you to watch it despite its low rating. I can't say whether you'll enjoy it or not, but it's worth to see nevertheless.\r\nOne can easily list multiple stories, novels, movies, which portray how elections work (or more precisely, not work). Most of them ironically portray an incompetent, money-driven candidate who running his unfair and corrupted campaign.\r\nLove, Election, Chocolate! portrays Ojima Yuki, a member of the Food Research (a.k.a. Eating) Club, which, of course, gets school funds for its activities. However, the elections for StudentCouncil president are approaching, and the popular candidate wishes to disband clubs that don't deserve their funds, including Yuki's. Not knowing anything about politics and PR, Yuki decides to run against her.\\n\r\nThen what's the difference, then, between Love, Election, Chocolate! and all the other works you mentioned above? Once again we have an incompetent candidate who's running for president for money!\\n\r\nUnlike other similar political shows or novels, there's no irony in LEC! Instead, Yuki is the person who is about to lose the club, which is the place at school he really belongs to, and simply tries to protect it. We are also shown interesting personal dramas of the other members of the Food Club and the opposing candidates, political (and not only) intrigues by the people who currently have power, and much more.\\n\r\nFor this unique approach I give the story  8/10 (which is good, coming from me), despite the filler and supposedly comical silly scenes.\\n\r\nThe art, however, I didn't like. While its quality is good, I care a lot more about character designs than the quality of the art. And them didn't like: strange hairs, big boobs, and a face which looks like a mask. Thus I give 3/10 for the art.\\n\r\nThe music was OK. I liked the opening and ending a lot, and the the soundtracks were good and appropriate.\\n\r\nAs well as the character designs, the characters themselves also draw the show back. While appropriate (for example, we have Yuki's opponent, the perfect, honest, fair candidate; we have two comical relief characters), they are nothing special or original.\\n\r\nCharacters which are \"nothing special\", bad art, fuller scenes, manages, in my case, to \"compensate\" for the unique approach to the story, and thus I give 5 for enjoyment. Nevertheless, I do recommend you to give a try to this series.\\n\\n\r\nPS: Could you send me some feedback if you find thid unhelpful?",
            "date": "2012-09-28T15:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 73509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Togop",
                "username": "Togop"
            },
            "url": "https://myanimelist.net/reviews.php?id=73509"
        },
        {
            "content": "Koi to Senkyo to Chocolate is one of those anime that you don’t really expect much from but by the time the curtains closed you had gotten more than you bargained for. Don't you love it when that happens?\r\nThe Short Version:\r\n(+)The art is alright for the time.\r\n(+)The main characters are a bit more tolerable than the normal given the genre.\r\n(-)There’s way too many characters for this show to focus on.\r\n(-)The shift of tone towards the end is so sudden it’s jarring.\r\n(-)The sound, save for one part, is easily missable.\r\nThe Story (6/10): The story is about the main characters trying to stop their club from beingdisbanded, and they think up that the best way to do this is to have the male lead run for president, because on the day a new president is founded they immediately get to allocate the budget for all the clubs instantly. Because that’s totally how that shit works. One of the things that I really didn’t enjoy with the story is that the first 5 minutes are entirely misleading, then at the end of the show they bring back that tone for some reason. I was so confused towards the last 4 or so episode because the show changes from a light-hearted rom-com thing, to a drama piece that has something to do with political movement for the presidency. That is not a good shift of tone for a show like this, if it kept the feel from the first half of the show I probably would’ve enjoyed this just a bit more.\\n\\n\r\nThe Characters (6/10): I’ll say this quickly about the characters, there’s way too many for a show this small. You want to know why? Because it’s a VN adaptation, that’s why there’s something like 10 characters all in the club room at any given time, 24 characters over the entirety of the show, that’s way too fucking many for a 24 episode show, especially when you’re trying to tell the backstory to one of the main characters but keep cutting back to the side characters because hey, club members are important. Now take everything I just said about the characters and accept it when I say that the main characters aren’t that bad, not as bad as you’d think they’d be for a VN adaptation of a rom-com, speaking of mains.\\n\\n\r\nYuuki Oojima: The main guy of the show and the one running for the presidency.\\n\\n\r\nSatsuki Shinonome: Yuuki’s biggest opponent for the chair and not the biggest asshole of the show.\\n\\n\r\nChisato Sumiyoshi: Childhood bestie to Yuuki and the one who is mildly damaged to say the least.\\n\\n\r\nMichiru Morishita: Let’s say she’s ‘loyal’ to a particular someone and the pandering character.\\n\\n\r\nThere are other characters listed as main on MAL but these are the one’s you’ll be spending most of the show with, and again they’re not as unbearable as you’d think. And don’t even bother getting invested in any of the romance, because it doesn’t get any sort of conclusion.\\n\\n\r\nThe Art & Sound (6/10) & (7/10): Considering this show came out in 2012 the art is pretty standard, everything isn’t eye gougingly bad, but it’s so standard to the point where the only real response I have for it is, “meh.” It’s not bad yet not great either.\\n\\n\r\nThe sound is mostly the same across the board, the voice acting, OST, OP & ED, they’re all fine. “But you rated the sound higher than the art.” Yeah I did, because there’s a scene with a harmonica at the end that’s just so damn good, also the violin was exceptionally good.\\n\\n\r\nWhat do you think of this show?\\n\\n\r\nIt’s not necessarily a horrible show, it just trips over itself towards the end.\\n\\n\r\nWould you recommend this show?\\n\\n\r\nIf you’ve played the VN or want to kill some time yeah, otherwise nah you don’t really need to bother with this.\\n\\n\r\nGoodbye my brethren, see you in the next.",
            "date": "2015-06-23T02:11:00+00:00",
            "helpful_count": 8,
            "mal_id": 190999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=190999"
        },
        {
            "content": "Hello guys~ This would be my first MAL review. Please forgive me for any grammatical errors and awkward wordings.\r\nAnyways, the main reason I'm writing this review is to defend the low rating/low popularity, and to also encourage other anime lovers to enjoy this anime.\r\nThe main problems others state for this anime are excessive amount of characters and plot rush. However, I don't really blame the anime for that. First of all, this anime bases off of Visual Novel, so the amount of characters can't really be blamed. The plot kind of rushes because of the length of the anime. I believe if the anime hasmore episodes and focuses more on main characters' past, then the anime can be as emotionally powerful as popular anime such as Clannad and Little Busters. \\n\\n\r\n-Story- 9/10\\n\r\nThe story is really great. The idea of student-governing school is really refreshing. The plot progresses well and the anime does not lack emotionally powerful stories. You would want to watch the next episode after each episode. The political struggles within the student government really interest me. Just as I mentioned above, if the anime has more episodes, this anime can easily get 10/10.\\n\\n\r\n-Art- 10/10\\n\r\nReally great art. The characters are beautiful and designed well. The setting is really great, so does the environment in the anime.\\n\\n\r\n-Sound-  10/10\\n\r\nReally love the OP and ED. Soundtracks are not bad as well.\\n\\n\r\n-Character- 9/10\\n\r\nCharacters have different personalities and roles, with different back-stories. The amount of characters is a problem though; however, I don't really blame the producer for that. The main male lead progresses throughout the anime. The relationship between main male lead and main female lead progresses as well.\\n\\n\r\n-Enjoyment- 10/10\\n\r\nThis anime can really move people. The stories are great and the interactions between characters are interesting. \\n\\n\r\n-Overall- 10/10\\n\r\nReally good one for me. Reminds me of clannad and little busters. I really love these emotionally powerful anime, especially if they revolve around school. I would gladly recommend this anime to anyone who loves Clannad/Little Buster or anyone who loves anime with school, romance, and slice-of-life settings.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-02-28T22:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 181431,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4110235.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kou_Keiki",
                "username": "Kou_Keiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=181431"
        },
        {
            "content": "**I have only seen the anime of Koi to Senkyo to Chocolate and this review is only based on that.\r\nRomance comedys with high school settings are by far my favorite anime series, so keep that in mind. \r\nKoi to Senkyo to Chocolate/Love, Election and Chocolate/恋と選挙とチョコレート ; 12 episodes a 20 minutes, aired from July to September 2012 ; Comedy, Drama, SoL, Romance, School ; licensed by Sentai Filmworks \r\nKoi to Senkyo to Chocolate appears like a generic romance school story who wants to be different from mindless harems, to then develop into a thrilling election battle with very interesting subparts to the main plot. Itfollows the happenings in a student-reigned school where the Studen Council basically reigns it like a small state. \\n\\n\r\nStory: 9/10\\n\r\nIf you have already read the synopsis, you know that the story is something fresh and new. Running for student council president normally is not part of the ideal Anime MC character, so it's interesting to see something new. Apart from this main plot a big part of the series is also the romances and relationships around the male MC, to an extent that sometimes almost make it seem like youre watching a harem series, but these are minor appearances. It is almost impossible to analyze the story without spoilering it all, but in the end, it fades out to have been a very complex storyline with important and diverse subplots, which make the biggest of the good part of the series. I would have given a 10 if it werent for some unnecessary exaggerations, but its still good. You will never be annoyed or not pleasantly surprised.\\n\\n\r\nArt: 8/10\\n\r\nThe art is nothing special, but good nonetheless. Sentai Filmworks is a good studio and clearly lives up to the expectations. Sadly, I only gave an 8 because of often very unnecessary and out of place fanservice, which mostly just ruined the scene. Nothing to complain about the art though, the girls are diverse and beautiful, animation is well done.\\n\\n\r\nSound: 10/10\\n\r\nThe OP isnt generic but still awesome. ED is extremely fitting to the vibe that the episodes emit, well chosen. ANd the background music is just perfect. I have seen few anime whose background sound was just so perfect, especially when there are so many different styles to chose music from, since the story subplots are so different. The voices are mostly very good.\\n\\n\r\nCharacter: 10/10\\n\r\nThis anime does not at all have your generic dere-character types. Most characters appear to have so in the beginning though, but then receive decent to great parts of character development which explains their diverse and unique characters to the viewer. The way they act appears very realistic and understandable because of their characters. The life crisis and psychologial problems of the single persons are also well executed. It creates a remaining bond to the viewer which makes this show so good.\\n\\n\r\nEnjoyment: 9/10\\n\r\nCoupled with an complex and intriguing story, excellent character portrayal and well executed comedy scenes here and there makes this show extremely enjoyable. After overcoming my post anime depression of binge-finishing this series yesterday I still think its awesome and heavily underrated. Everyone who watches this will be pleased by the diverse storyline and the appealing circumstances. Its worth watching this, believe me.\\n\\n\r\nOverall: 9/10\\n\r\nIf it werent for the sometimes out of place scenes - as mentioned before - I would have given this show a 10. It also is while realistic in some aspects, extremely unrealistic in some others. The displayal of childhood love, post-traumatic problems, teamwork and even touching important aspects of modern definition of democratic state systems, the show makes a staying impact on the viewer. This all coupled with good comedy really made this show for me.\\n\\n\r\nForecast: There wont be a second season, since the story is more or less finished. There were some OVA's that add a lot to the romance and battling over Oujima's love, plus a whole bunch of fanservice - if youre a fan of that, go ahead and watch them.\\n\\n\r\n**This is my second review, so please keep that in mind. If you have any suggestions or feedback PLEASE tell me so I can improve my reviews. I plan on writing one for every finished anime from now on, and I want em to be good. Thanks for reading!!",
            "date": "2015-02-26T03:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 181238,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4221129.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Urbanophiler",
                "username": "Urbanophiler"
            },
            "url": "https://myanimelist.net/reviews.php?id=181238"
        }
    ],
    [
        {
            "content": "At first, I was trying to find some mediocre romance comedy harem anime, which can give me tons of boobs and laugh for example, Ichiban Ushiro no Dai Mao or Hagure Yuusha no Aesthetica to name a few. I mean it's Christmas now, and I am still single, watching anime at home. All by myself.......... I needed anime to comfort me. :(\r\nAnyway, I then came across this oddly under rated anime Koi to Senkyo to Chocolate :3\r\nStory:\r\n   At first glance, the plot might be one of your normal, slice of life school anime. I first thought so too, but thenthe 1st ep just cracks me up. I won't go into those spoiler details but I can say, I immediately got hooked by this anime. At that moment I knew that this is my destined one. I give HUGE credits to anime which can piqued my interest this much right in the first episode, only a few could do this to me. eg. Sakurasou.\\n\\n\r\n   Anyway, this anime is based on a VN, and from the past few years anime adopted from VN hadn't been satisfying. I wouldn't say its bad, but a lot of them are rushed or just focused on the wrong heroine - for example: Angel Beats, I mean I love AB a lot, I cried watching its last few eps too, but overall it just felt a bit rushed. It left a lot of things unexplained i guess.  \\n\\n\r\n   However, I believe this is adaptation had done an excellent job.I think it had a pretty steady pace. At least, I didn't feel its rushed, like AB does. So, I think it did a great job here. \\n\\n\r\nCharacter:\\n\r\n   Well, here the good part. We have a very diverse and intriguing character casts here. They all have different personalities and motives and such that it didn't feel like they are cardboard cut out characters or at least most of them.\\n\r\n    I mean we have have 2 oppai girls ( Shinonome Satsuki, Shinonome, Hazuki)\\n\r\n    A super kawaii pentako (Michiru Morishita)\\n\r\n    A bit annoying tsundere, childhood friend girl (Sumiyoshi  Chisato)\\n\r\n    A kouhai full of feels (Aomi Isara)\\n\r\n    At last, but not least the ultimate, always cumming yaoi kouhai (Yumeshima Oboro) \"Senpai, I want your stick!\"\\n\\n\r\n    With these characters, I bet you're gonna have a lot of fun watching this anime. The reason why I love this anime is because of its diverse characters. The interaction between the characters intricately weaved out the whole story. Most of the characters have been explained properly, and have pretty well development. Moreover, it totally didn't feel as confusing as Angel Beats were (in the last few episodes :/ ) . Everything nice and good.\\n\\n\r\nArt:\\n\r\n    Well, I don't have much to say about Koichoco's art. The animation was fluent and clear, nothing super fancy extravagant like Fate Zero or Kara No Kyoukai, but I was satisfied with it. It's got a bright colour and overall gave a cheerful atmosphere. It kinda feel like Amagami SS i guess..... \\n\\n\r\nSound:\\n\r\n    I am not much of a soundtrack guy, so I will keep it short.\\n\r\n    Sound is good. Voice-acting good too. OP & ED good good. \\n\\n\r\nEnjoyment+Overall:\\n\r\n   After watching Koichoco, it lifted my mood a lot and I really really enjoyed it, I don't know why it is so under-rated but I think it should rank higher and more people should be watching this. \\n\r\n   I recommend this to anyone who are looking for a good romance, comedy. And I promise, you're gonna laugh so much in the first ep (at least, I did)\\n\r\n   I think you guys to give this a shot, you might be surprised. :)\\n\\n\r\nI hope this review helped you and that you guys would like Koi to Senkyo to Chocolate :3\\n",
            "date": "2014-12-29T10:22:00+00:00",
            "helpful_count": 150,
            "mal_id": 175035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3710831.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kilodragon",
                "username": "Kilodragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=175035"
        },
        {
            "content": "Hey, you ever been to a party and noticed that there is all the food you want in the world but somehow, some way it just doesn't satisfy you? That's sort of the same feeling I got when I finished watching this series. No, I don't mean it in a way that is unsatisfying. I mean it as the series missing something. Like the chocolate is missing an ingredient or the series itself is lacking something. However, Koi to Senkyo to Chocolate does have some of its good flavors. So, let's break this down, shall we?\r\nKoi to Senkyo to Chocolate/Koichoco (also known as Love, Election,and Chocolate) is an anime series produced by AIC Build (Haganai, Oremio) and directed by Tōru Kitahata. The anime is also based off an adult visual novel developed by Sprite. Now what a minute. Did I see the word “adult” in that statement? One might expect some ecchi or or specifically, “adult scenes” in this series, right? Well, not all the case because  in the anime world today, censorship and limitations holds this series at its limit. \\n\\n\r\nJudging by the title of the series, it can be quite easy to predict what the anime may be about especially the given three parts. First, we got the four letter forbidden word: love. From there, one can imply that the series will have romance. And you're right because Koi to Senkyo to Chocolate does have that especially between the main male and female protagonist in the series. The second part, election consists of what the drama takes place at the school in the series. Election is for leadership, to lead a student body, and more importantly to represent themselves. Finally, we have the chocolate. Beyond the sweets and flavor, the chocolate here seem to symbolize the sweetness of life. It is every moment of  life that the students at the academy enjoy with their friends and the memories they create to make their lives worthwhile.\\n\\n\r\nKoi to Senkyo to Chocolate takes place at the setting of Takafuji Private Academy, a rather large school composed of over 6000 students. Within these group of students is the Food Research Club (Shokken) and here we are introduced the main protagonist, Yuki Ojima of the series. The club doesn't do much during their everyday boring lives till the shocking news of that their club will be abolished. Anyone hearing that sort of news definitely wouldn't be happy. Well, the FRC definitely has a few things to say about that. As such, Ojima takes the election of the title and runs for president.\\n\\n\r\nNow, Yuki Ojima seems to be the type of guy who is lazy and avoids doing work. It's bothersome for him and like some of us, tries to procrastinate and put things off as long as possible. His childhood friend, Chisato is there for him though and the two duo makes a strange couple of sorts in the series. The problem here is that these two seems to have a weak chemistry at first. They don't seem to connect and neither do their personalities match. It seems that Yuki is more compatible with some of the other characters, well almost anyone except that guy with the yaoi stick. I mean, that's just not right. But all jokes aside, Chisato and Yuki starts off the series in a bizarre way. With the election coming up, it's time to kill that laziness and say hello to some responsibility. \\n\\n\r\nBeing part of a large school also means allies, friends, and rivals. Satsuki seems to serve as the sort of antithesis in the series who not only play as Yuki's main opponent in the election, but also sort of his outer image. She is like the vanilla flavor of a chocolate and becomes an obstacle of the FRC.\\n\\n\r\nThe story itself have a lot of drama in them. From the very beginning, there is a head and run and later on follows a similar fashion. And of course, election is all about drama especially for those who can win the favors from the students at the academy. It is strange though that in this series, the drama depicted often shifts to different focuses. It intertwines drama between the characters or personal relationships occasionally but at other times, focuses on the topic of elections. Employing this style of story is risky but thankfully in this series, it works out somewhat well. Drama is never easy to employ and with an academy of over 6000 students, just imagine all the possibilities.\\n\\n\r\nThe artwork of Koi to Senkyo to Chocolate is pretty generic to say the least. There is a lot of stereotypes here including Hazuki oniisama who is portrayed as an older woman with tits and the bossy attitude. The school setting itself is also normal despite its large size. The outer settings are those of at typical school in the modern ages and nothing special about that. In fact, the series doesn't take place at much elsewhere besides school. After all, school is where love, elections, and drama are born. On the characters' design side, there seems to be some similarities between this series and Amagami SS; even the drama is there.\\n\\n\r\nAs for the music, the series employs a rather soft melody of school like tunes. It employs both soft rhythm (during calm and comedic scenes) to more dramatic music during scenes that are more emotional. It does mixes in well though and some might even give some credit to Elements Garden, the folks responsible for orchestrating the themes. The OP song, \"Signal Graph\" by Annabel is orchestrated peacefully but also with feeling that depicts the drama in the series. The montage of characters are shown in sequences and even little bits of drama between Yuki x Chisato and what's to come later. Don't forget the election part though as that's what keeps the drama in within the series. The ED song \"Kaze no Naka no Primrose\" by Ceui follows a similar fashion and presents that school like feeling courtesy of Koi to Senkyo to Chocolate.\\n\\n\r\nThis series is actually not bad and has plenty of interesting points. The elections are one of the major themes and throughout the series focuses on it quite well with minimal fillers. Even when the fillers are present occasionally (that are usually short), they still stick with the overall drama theme and how people develop relationships, form bonds, and overcome obstacles together. Like the large cast of school, there is a large cast of characters who each (although some less than others) get their own little spotlights. The oniisama Hazuki, the competitive Satsuki, the black haired loli Michiru, the hyper genius Non-chan, and even that guy with the yaoi stick all get their little moments in. It's amusing and in some ways wants us to be there with them to join the fun and help with the election wars. \\n\\n\r\nUltimately, this series is peculiar. In one way, it's generic and so predictable of the eventual outcome. In another, it is entertaining to watch with all the characters and the drama going around at the huge academy. Just imagine yourself there and trying to become a leader of a student body of that magnitude. It would be like a living hell to handle that sort of responsibility. Despite this though, the series does adapt well and presents drama at its finest with both the elections and personal relationships. The music and artwork focuses on the typical school life and that each day we get by is another day to learn about the world around us. The content of the story has little fillers so it can all be watchable at once in a marathon for those who are fans into that sort of thing. \\n\\n\r\nKoi to Senkyo to Chocolate is a series to enjoy like an extra curricular activity and not stress over yourself of the eventual outcome. School is filled with drama so loosen up a bit as elections are not never easy. To enjoy this series at your fullest isn't easy either but just look at it like a drama play. \\n",
            "date": "2012-09-28T22:38:00+00:00",
            "helpful_count": 101,
            "mal_id": 73555,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=73555"
        },
        {
            "content": "Tthis anime is very much like it's in the respect that it doesn't make any sense whatsoever. The plot is broken and feels  rushed to say the least. The score is lackluster and the characters are little more than boring stereotypes. Almost  everything about this show screams 'average'. To be honest, I would've been happy if it was indeed average. But i was terribly disappointed.\r\nThe biggest problem with Senkyo is it's setting. it is simply put, laughable. Students control EVERYTHING in Takafuji Academy from staff appointment to budget management. in fact, there is no sane adult to be seen during the course ofthe entire anime. It really is preposterous to even assume that 17 year olds have the requisite knowledge to manage a large educational institution. As if this were not enough, the politics surrounding the student council elections is grossly exaggerated. Backstabbing, scheming and attempted murder are what this show considers 'real politics'. Wait a minute, did the writers forget that the story is set in a high school? \\n\\n\r\nThe plot doesn't do anything to ameliorate the boneheadedness of the setting . in fact there is almost nothing apart from the dull politicking to the plot. of course, it is dull because it isn't done right. We don't see Oojima making  valid points to support his cause, instead we see him giving supposedly inspirational speeches while forgettable music plays  in the background. To be fair to the anime, it is worth mentioning that it does bring to the fore serious issues such as student harassment. But it doesn't go anywhere with it. No solutions are provided to the problems the show points out. I'm inclined to believe that the writers never even tried to come with any solutions. This is because the show turns into  a lame thriller around the 10th episode. It seems as if all the drama was placed there just so that the anime could avoid discussing the more serious issues that it had brought up.\\n\\n\r\nMost of Senkyo's characters are boring one-dimensional stereotypes of the worst sort. There are several females surrounding the protagonist as is to be expected from a harem. But only two of them are worth writing in any detail about. Chisato, the childhood friend is probably one of the most self-centered,  whiny and psychologically unstable females in anime I've had the misfortune to witness. Unfortunately, she is the main heroine of the show. It really is a shame because Satsuki, Chisato's competitor and Oojima's political rival is so much better than her in every conceivable way. Satsuki's back-story although cliched, is incomparably better than chisato's, which is laughable to say the least. Speaking of back stories, did I mention that they are the only form of character development there is? And to be absolutely honest, these little splashes of character development feel quite prefunctory and often have no bearing on the plot whatsoever.\\n\\n\r\nThe art, animation, ost and voicework are all pretty average. Nothing much to write about here.\\n\\n\r\nSome people might excuse the myriad flaws of this horrendously blighted excuse for an anime due to the fact that it is a mainstream harem. But there are a lot of mainstream anime out there with a more cohesive plot and better fanservice.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2012-10-23T08:17:00+00:00",
            "helpful_count": 58,
            "mal_id": 75727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/RyugaHellsing",
                "username": "RyugaHellsing"
            },
            "url": "https://myanimelist.net/reviews.php?id=75727"
        },
        {
            "content": "Koi to Senkyo to Chocolate.\r\nThe story of a boy yearning for true love and a girl hating chocolate.\r\nWhen I first caught a glimpse of Koi to Senkyo to Chocolate, I was deeply intrigued by its title. Love and chocolate are all very well in anime nowadays, but elections? Seriously, how could anyone spin a good yarn out of an election?\r\nDue to me having limited time, and also because there were many other anime titles seemingly worthy of my time and attention, I initially put KoiChoco on my on-hold list. However, as the pretenders faded away from my attention, I decided to give KoiChoco a try,to see whether the anime could possibly be good enough to expound upon the dark, deep world of politics, yet be able to maintain the audience's attention over the span of a 1-cour show.\\n\\n\r\nThe premise that the anime offers us is an interesting one. There are few anime which can delve into politics and still come away with a decent fanbase. However, I can confidently say that KoiChoco succeeds well in that aspect.\\n\\n\r\nLet me begin with our protagonist, Oojima Yuuki. He's not exactly the type of perfect person everyone loves to hate, yet he also isn't the whiny loser that has recently become a common occurrence in anime. In other words, one word can describe Yuuki. Decidedly average. He has a childhood friend, Sumiyoshi Chisato, who is the president of the Food Research Club, of which he is a member of. He goes to the prestigious Takafuji Academy, where the student body is responsible for autonomy, but slacks off with his fellow members of the Food Research Club and Chisato, spending their free time in the club room enjoying snacks rather than getting involved in any useful activities. Heck, the entire club is so laid back that even their advisor gets into the act, guzzling beer whenever she has a chance to sneak into the club room.\\n\\n\r\nYuuki's comfortable school life with the FRC could have continued interminably until their eventual graduation, but no. Fate conspires to throw them the prospect of dealing with the disbandment of the FRC. A radical candidate, and the overwhelming favourite for the school council presidency announces her intention to disband clubs that do not carry out any activities that could be deemed useful. At first, the future looks bleak for our FRC members.\\n\\n\r\nThat is, until someone manages to come up with a brilliant yet outrageous idea. Yuuki should run for the student council presidency himself! Rather than waiting to be crushed by the iron fist of the school council president, the members of the FRC proactively decide to support Yuuki's campaign and try their best to prevent the FRC's disbandment. However, Yuuki's campaign team face a mountain of difficulties. Yuuki practically has no acquaintances outside the FRC which he can rely upon, he does not have any political manifesto, ideologies or affiliations and has absolutely no ambition or desire to become one of the leaders of the school council. And here's the ultimate clincher. Yuuki isn't even willing to run for the post himself!\\n\\n\r\nEnough of that. If I write any more I'll be revealing the whole plot of the anime. We don't want to spoil people that have yet to watch KoiChoco!\\n\\n\r\nRating this anime is kind of tough, as it is a jumble of concepts that are so radically different as to be almost irreconcilable. One would be forgiven for thinking that KoiChoco is an anime series that tries the impossible and fails miserably in the process, leaving the viewer with a bitter taste. However, I can guarantee that the story is actually quite well presented and executed throughout the anime. The premise of an election is surprisingly excellently done, with a set of rules governing the election that are actually feasible instead of a load of claptrap, and the show manages to convey the suspenseful atmosphere of an election to the audience very well. An added bonus is that KoiChoco is able to do a fantastic presentation of the dark, murky side of elections.  Throw in a couple of well placed plot twists and cliffhangers and you have the framework of KoiChoco. When I finished watching the show, the first thing I thought was \"Wow. Elections sure are serious stuff.\" \\n\\n\r\nNothing is completely flawless though, and KoiChoco is not an exception to the rule. One major mistake that the studio made is trying to convey too many concepts at once without giving a thought for the overall continuity of the anime. One example being the transition between the first and second half of the anime. The first half is completely geared towards the FRC's preparation for the primary election and their recruitment for help. Smooth sailing so far, up to this point. But after the primaries are over, the anime violently transitions to a romance story, with hardly a mention of the elections that were looming.\\n\r\nThis particular fault made the story seem unreal, disconnected; it could have been two different arcs of two different anime, yet is melded and shaped into the form that is KoiChoco. Frankly, I feel the anime would have merited an even higher score if the studio had competently handled this portion of the anime. \\n\\n\r\nAnother problem is the excessive focus on the Yuuki-Chisato pair. The supporting characters are quite the diverse bunch, but they all fade into the background while the limelight shines on Yuuki and Chisato. Essentially, they are there merely to provide support for Yuuki in his election campaign, as they are all pictured doing their bit to help Yuuki win and so prevent disbandment of the FRC. A couple of the supporting cast actually do play an important role in the course of the anime, but those are few and far between. Granted, the anime is a adult visual novel adaptation which focuses on the Chisato arc of the game. Taking into account the time constraints presented by a 1-cour show, it is indeed logical that the studio turn their attentions and energies to one particular arc rather than trying to adapt everything and end up with a half-assed story.\\n\\n\r\nThe artwork in this anime is very solid and excellently done. Given that KoiChoco is a school-oriented anime, we shouldn't expect dazzling graphics or breathtaking scenes of snow-capped mountains and lush green meadows on par with the likes of 5 Centimetres per Second. For a school setting, the art is comparable to the best, and frankly, there are some scenes that are breathtaking in its own way, such as the bridge in the OP which features prominently throughout the anime.\\n\\n\r\nThe studio certainly deserves some measure of praise for their handling of the  sound portion of the anime. They have got an intuition for the types of music that fit the mood of the anime and are likely to resonate with the viewer, thus enriching the experience even more. For example, when a supporting character is rushing to try and prevent Yuuki from committing a potentially election-ending blunder, the slow piano piece that is played in the background complements the scene and brings out the emotional undertones that are hinted at. On the other hand, the OP of KoiChoco, signal graph, smacks of a plain and generic song. The performance from the singer, Annabel doesn't improve it any further either. The ED, Kaze no Naka no Primrose by Ceui, makes a better hash of things, as it is deeply emotional in nature and able to touch viewers with its enchantingly beautiful melody. I have been told that my taste in music deviates wildly from the opinions of many, so feel free to disagree with me on this count.\\n\\n\r\nOh boy. Next up is the Achilles' heel of KoiChoco, which is sadly its characters. Normally the meat of an anime that complements its story, KoiChoco has let the audience down very badly here, especially considering that it's a harem story. Among the wild variation of characters, we have among others a chocolate hating girl, a guy that is openly gay for Yuuki (comic relief?), a chibi inventor who seems to have a few screws loose, an undercover spy for the student council and a dude whose face is a henohenomoheji. Well, that isn't a major problem on its own. The real trouble with the characters of KoiChoco is that it gives its primary focus to the couple of Yuuki and Chisato. As mentioned above, the supporting cast are simply along for the ride with the exception of a couple of them. Moreover, Chisato morphs from a great character in the first half of the anime into a whining crybaby that hankers after Yuuki for no reason other than Yuuki being admitted into hospital for outpatient treatment. She literally refuses to let him out of her grasp, even going so far as to cling on Yuuki in his own home. I understand the logic behind the studio wishing to portray Chisato as being reliant on Yuuki. It's explained further in the anime. However, I think they could have at least altered the story a bit to prevent Chisato from degrading into such an annoying character. Even if the adaptation were true to the original source material, I feel that this is one example where a measure of artistic licence should be applied in order to prevent the characters from becoming sub-par. The majority of the supporting cast barely get any screen time, and when they appear they're either doing things to help Yuuki in his election, lazing around the FRC club room or making subtle advances towards Yuuki. There are certainly exceptions to this, but their appearances are relatively sparse compared to Yuuki and Chisato. The lack of organisation in allotting screen time to the various characters becomes a major failing of KoiChoco.\\n\\n\r\nWell, for all my criticism I have to admit that I enjoyed KoiChoco very much. From the interesting interactions between the characters, the fresh breath of air that was its premise of elections, and the marvellous art and character design, I can honestly say that KoiChoco is an anime that I have enjoyed very much in comparison to the other titles in the industry. Although it certainly does not reach the dizzy heights of some, KoiChoco can certainly hold its own against other generic anime that have flooded the anime market in recent years. Moreover, it offers us a more in-depth view in the world of politics, something which I have never seen in an anime before, excepting the odd student council election that isn't the main focus of the anime. Since I enjoyed all the aspects of KoiChoco fairly well, I will say that KoiChoco has afforded me great enjoyment, particularly because I retain a certain interest in politics.\\n\\n\r\nIn conclusion, KoiChoco has its share of flaws and failings, however I can safely conclude that it is a decent anime which manages to capture the audience's attention and hold it through its airing. If you are intrigued by the premise of KoiChoco, I would certainly recommend that you give it a spin. Who knows, you might be amazed by what KoiChoco brings to the table.",
            "date": "2012-12-19T02:17:00+00:00",
            "helpful_count": 50,
            "mal_id": 80556,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1909180.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KiraMikoto",
                "username": "KiraMikoto"
            },
            "url": "https://myanimelist.net/reviews.php?id=80556"
        },
        {
            "content": "A big problem with visual novel adaptations these days is that most of them stick to this formula where nothing really happens, there's a lot of attempts at humor, they explore each (or most) character(s) and the protagonist picks a girl. Koi to Senkyo to Chocolate is different, although it still shares some similarities with most visual novel adaptation, it separates itself by having a pretty interesting plot, which makes the series enjoyable.\r\nWhat really makes the plot interesting is the twists and turns that happen along the way. The plot may seem simple at first, the main character trying to win an election to bestudent body president so his club would not be disbanded. But as the series progressed and as they started to give us a deeper look into the election, a number of darker and more serious things start to surface. For a 13 episode series it does a real good job at making an interesting plot because it has depth to it.The series does leave some things unexplained and the series certainly has it's flaws but given the time frame, Koi to Senkyo to Chocolate executes the story really well.\\n\\n\r\nThe art was nothing too spectacular but it is really well drawn. The animations are very fluent and there's no major errors.\\n\\n\r\nThe sound was good too, the opening is very lighthearted and has a very happy mood, which fits the series very well. The ending is a very soft song, which has this farewell feel (if that makes any sense at all), very fitting for an ending. The voice acting is also done pretty well as they make the feelings of the characters believable.\\n\\n\r\nFor the short time frame that this anime was given, the series did a fair job with the characters. The main male protagonist Yuuki Oojima is a lot like many main male protagonists in other harems, except he isn't useless. He doesn't really get much development but instead he helps the other characters develop. He is also very likeable much like many of the other characters. The girl he ends up with, Chisato Sumiyoshi, is not very well received by others, but personally, I don't hate her. She goes through some nice development such as finally overcoming the loss of her brother which is more than expected from a series of this length. The supporting characters get little development, some get some development and others aren't even touched. However they are still all likable and you will almost always be finding yourself rooting for somebody.\\n\\n\r\nAs a whole Koi to Senkyo to Chocolate is one of the more enjoyable harems for a number of reasons. One of the main reasons is because it has an interesting plot. Another reason may be because of it's comedy, which is well-placed at some times but misplaced at others but when the comedy is well-placed, it can be down right hilarious.\\n\\n\r\nOverall Koi to Senkyo to Chocolate is a nice change from many other visual novel adaptations these days because it can be very entertaining. This also shows that not all harem animes are that bad.",
            "date": "2012-09-30T18:11:00+00:00",
            "helpful_count": 30,
            "mal_id": 73753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=73753"
        },
        {
            "content": "Well this is my first review, so I hope you would be satisfied.Well firstly, this is your typical ''club and student council'' type of anime.The art is well done,very similar to amagami ss.So far the series is going pretty well and yes there's some romance and a bit of harem here and there,There's also a dash of comedy which makes it enjoyable.The story itself isn't unique,since there are some anime with the same concept,of student coucils and clubs.The chocolate-candy concept is kinda new though.Hopefully, this series wouldn't turn into  your typical ''harem''.",
            "date": "2012-07-20T13:45:00+00:00",
            "helpful_count": 29,
            "mal_id": 67159,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1402787.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/joshy-joshy-san",
                "username": "joshy-joshy-san"
            },
            "url": "https://myanimelist.net/reviews.php?id=67159"
        },
        {
            "content": "To start of Koi to Senkyo to Chocolate looks like your typical slice of life anime where the club is having problems. However, this one is different because it incorporates 3 elements that I feel make it unique or special. The first element that I liked was the drama because on the outside you have the typical slice of life vibe, but once the action gets going especially towards the end that is where drama is released. Dialogue is the second element that makes this Koi to Senkyo to Chocolate different because with having presidential elections one would expect to have a lot of dialogueto present their points or objectives. the third element which is comedy incorporated well since it was kept at a minimal level and mostly done from the side or supporting characters.\\n\\n\r\nStory: The story was ok, but I feel like it was rushed. There was some parts during the story that just felt ignored or not fully explained. Still what makes the story have a higher score is the drama part because it is nicely done. The last couple of episodes really make up for the lack of drama at first. Comedy wise that didn't hurt the story, and the characters all brought the story together even more.\\n\\n\r\nSound: The OP and ED are very nice and worth watching every time. Not much to say here besides saying that during those serious scenes the background music really enhances the scene even more. The main song that is the highlight of this anime is the song played by one of the characters who use a harmonica.\\n\\n\r\nCharacter: The score really doesn't reflect on most of the characters but rather on some of them. Chisato from my perspective had a very complex personality that helped relate or understand her. Michiru another character is one that I liked the most based on how she behaved. Her appearance really makes her stand out from the rest of the characters because she carries that mysterious presence whenever scene shows her by herself pondering. \\n\\n\r\nEnjotment/Overall: I sure wish this anime had a second season because some things could be explained better there, and it would be nice to see maybe time skips of how the school is doing as well. Overall I really enjoyed Koi to Senkyo to Chocolate and the ending really helped bring the number up even more. Despite the low passing score that the story has the characters make up for that and really help make the anime worth watching. the comedy also made me burst into laughter at times so that also incorporated into the overall score.\\n\\n\r\nI'd say for those who want to watch an anime that will make you laugh, yet have a serious tone then Koi to Senkyo to Chocolate is one to watch. Just be prepared for the moderate dialogue. Other than that I will sure remember this anime and the amazing characters it had. \\n\\n\r\nHopefully you all found my review helpful and I hope you all like Koi to Senkyo as well.",
            "date": "2014-03-22T07:42:00+00:00",
            "helpful_count": 27,
            "mal_id": 136433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2084755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SweetKiichigo",
                "username": "SweetKiichigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=136433"
        },
        {
            "content": "“Nothing ventured nothing gained” That is one of the quotes that came to my mind after starting this anime. The main protagonist Yuuki Oojima has the option to run for an election to save his precious club, he starts his election after hearing similar words from people around him. \r\nAt first I thought Choi to Senkyo to Chocolate would be your typical school club romance type anime. For me it ended up becoming so much more. It starts out with a dramatic event that honestly makes hardly any sense until you get quite a ways into the anime. Once things start to make sense thoughthis anime seems too really shine. One of the things it portrays is that politics aren’t always what they seem on the surface.  There is always a struggle behind the scenes and this is one of the topics this anime tackles in a very interesting fashion. Throughout the anime it confronts the things that happen on the surface and behind the scenes in politics. \\n\\n\r\nKoi to Senkyo to Chocolate also has the drama and romance to go with it that makes it all the more intriguing. Each character has their own story and their own reasons for doing things. They are all unique and make the story come together wonderfully. \\n\\n\r\nAs for Koi to Senkyo to Chocolates flaws, it definitely does have them, though most are easy to look over. One of it’s biggest flaws I think is that it sometimes feels rushed sometimes. I would have liked to see this anime more around 23 episodes. It also has it’s cliché’s like most anime, things seem to always work out for the better. Oh and they never explain some things like how Oojima seems to see some people in a strange way, though it’s easy to make speculations.\\n\\n\r\nOverall I was very impressed, especially considering I wasn’t expecting much of anything of this anime. It has all the factors to make it a very enjoyable watch. I also don’t know of many anime’s that present politics and romance in the way this anime does, which made it even more enjoyable.  Either way whether you enjoy drama, romance, or politics this is a good watch!",
            "date": "2012-09-28T01:49:00+00:00",
            "helpful_count": 23,
            "mal_id": 73467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/490993.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Alarisia",
                "username": "Alarisia"
            },
            "url": "https://myanimelist.net/reviews.php?id=73467"
        },
        {
            "content": "Love, Elections, Chocolate.\r\nOn the surface it seems like a typical highschool drama. There's a boy, he's part of a club, and that club is going to be disbanded if they don't do something! When I see a story like this what it comes down to typically is how enjoyable the characters are to watch. Coming into this I knew the anime wasn't my typical selection: It's not in the top 1000, and it's rated 7.4. But I found the anime to be enjoyable overall.\r\nIf you're trying to decide whether or not to give this a try, I'd say be ready to accept a certain amountof tropes and cliches. I'd say it's not a masterpiece, it's not great. It had a lot of flaws. But I found it enjoyable, and it has a happy and romantic ending.\\n\\n\r\nTo begin, this is based off of a visual novel by the same name. As such, it suffers a quite a bit from \"all sorts of females are inexplicably in love with the main character\" syndome (ironically not so much the club members). It feels very scatter brained because you can tell where there would've been multiple routes for different heroines in the visual novel; however these are not pursued in the anime. This leaves the Main Character feeling rather weak and indecisive at times. For the majority of the episodes though you have a slice of life show about a guy trying to get elected, with occasional bits of drama sprinkled in. The plot and drama really heat up in the last stretch of episodes, and this is when the show is at it's best in my opinion.\\n\\n\r\nThe art/sound were both well done but nothing to be amazed at. They don't detract from the storytelling, and the music does a good job of setting the mood at the right times (mostly).\\n\\n\r\nThe anime would've been better if it had focused on one primary female heroine, and if the main character felt a bit stronger and decisive. It did feel like the story had gaps, it was as if there was too much story to fit into 12 episodes (again, probably because it's based on a visual novel in which all of this could be explained in more detail). Still, it did something I find few animes doing these days and that's end happily. And I liked the fact that it didn't try to spring a new romance into the fray mid way through. Despite the fact that the M.C. feels pretty weak in his convictions (towards potential romantic interests) at times, the anime ended romantically as I think it should've. \\n\\n\r\nBased on enjoyment alone I'd give it a 7, but I think overall I have to go with a 6. I by no means feel like this was a bad show, but you've gotta be ready to accept it for what it is: a nice little story about a club trying to get their friend elected president with a little bit of plot to intensify the romance at the end.",
            "date": "2013-07-26T10:04:00+00:00",
            "helpful_count": 15,
            "mal_id": 106943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1954238.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ExOsc2",
                "username": "ExOsc2"
            },
            "url": "https://myanimelist.net/reviews.php?id=106943"
        },
        {
            "content": "Love, Elections and Chocolate. I think that's the textual english translation for this title. And it pretty much sums the whole anime up. That's it for this review, see you in the next one! :D\r\nThat's what I would really had liked to say because of the first impression this anime gave me. It has all the elements that make it look like your typical harem - slice of life - high school anime. It even has all of the archetypical characters, and most of them have to be female, of course. However, this anime achieves a lot more than what you might think.\r\nThe setup isa rather large private school, composed of about 9999 (or all of the 9's you can imagine for a single number) students, and thus, the student council is taken pretty seriously. You could say that the students themselves are the ones who rule this academy. It's kind of an utopic school, where the democracy has a huge roll and it's executed perfectly. \\n\\n\r\nEnter our main character, Yuuki Ojima: A rather lazy student who attends to this school and belongs to the \"food research\" club that does virtually nothing more than eating. He belongs to it just because there's something that tells him that he must be in a club, and of course, to be with his childhood friend, Chisato Sumiyoshi.\\n\\n\r\nAs the student council gets serious about clubs literally wasting and throwing money away in order to keep doing nothing, our main characters and the rest of the club decide to protect it, and the only way is that one of them becomes the council student president.\\n\\n\r\nAs our main character becomes more and more popular every time because of the elections, he starts to realize that there's a lot more to do than saving his own club. He starts to develop selfless-ness, and he becomes some sort of a pro-active guy, caring about what happens around him, leaving his laziness behind. And this is where the well executed drama (specially with his childhood friend, Chisato) begins.\\n\\n\r\nI never thought I'd say this about an anime, but there's a honorable mention that I want to give to the comedy aspect. which was not abused nor it was totally absent either. Somehow they put this when the times were right and it helps you release some tension that the story builds up as it progresses. It just comes naturally, and even if you dont think it's funny, it helps you to recover your pace and catch some air. Alright i'm exaggerating :D \\n\\n\r\nI give the story a solid 8, as it  has different \"areas\" where it develops itself, but it does in a pretty convincing fashion, without losing any of its focus. \\n\\n\r\nI would say 12 episodes weren't enough, as the development kind of required some more depth to it. However, I think pretty much everything was very well executed plot-wise. Nothing was rushed nor over-extended either. \\n\\n\\n\r\nThe characters, as I mentiones before, are nothing that blow your imagination away, for they are these archetypical characters. However, the characters' development is notably one of the strong point of this anime. It was really good to see these people not hesitating to take mature decisions to support the ones they care about, as well as leaving some stuff about their regretable past behind. When you start do develop some sort of love/hate relationship with one or more characters, that's the moment you will know they were well executed and have an impact.\\n\\n\r\nThe art in this anime was ok. it reminded me a lot of Amagami SS, specially on the characters design (although this aspect is a little more exagerated in Koi to Senkyo). Everything was pleasant to see and is well detailed too.\\n\\n\r\nWhen it comes to the sound, i found it awesome for an anime of this type. I was really immersed into the general feeel and atmosphere of each scene because of the background music solely. It really invites you to become one with the plot.\\n\\n\r\nVoice acting was also good enough. Not outstanding, but it was well done for my taste. Emotions were convincing.\\n\\n\r\nI would say that I enjoyed this wayy much mure than I thought I would, even if the three first episodes were full of \"OMFG not this again\". If it catches you from that moment, you will not be able to stop it. Even tho some of the arcs were over the top, it made me experience a lot of empathy towards the characters. I recommend you to give this one a try and see where it takes you :D\\n\\n",
            "date": "2014-09-15T09:52:00+00:00",
            "helpful_count": 15,
            "mal_id": 160433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3685101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DolbyThX",
                "username": "DolbyThX"
            },
            "url": "https://myanimelist.net/reviews.php?id=160433"
        },
        {
            "content": "Hi people. This will be my first review ever and it is mainly to defend the low ranking and low points this anime has for its rating..\r\nKoi to Senkyo to Chocolate started out with something like a comedy but in the later episodes it starts to develop a story. It is about a Boy and Girl and some other schoolmates as they chat and laugh together in a club. It is something like Haruhi Suzumiya and Boku wa Tomodachi ga Sukunai. However more similar to Haruhi as Koi Choco has a somewhat deeper story behind it. \r\n~Story~9/10 - Okay, the story is good to acertain extent. Firstly please don't judge a book by its cover. Basically, this anime is not what it looks like in the picture on the left. It is also not what it IS like in the first 3 episodes. BUT, the whole anime is quite rushed. It would be better if it was stretched to 24 episodes or something. But overall its good :)\\n\\n\r\n~Art~9/10 - I like the art. The design is nice. Similar to Boku wa Tomodachi ga Sukunai.\\n\\n\r\n~Sound~8/10 - The OP and ED fit the show. At the first 2 episodes i was like \"Why the hell is the ED so sad when this is a comedy anime?\" And now it all makes sense. Going later into the episodes, you will start to like the songs used as it starts to fit better into the story. \\n\\n\r\n~Character~7/10 - All is well except for a few characters. There are some characters that just don't fit well. The story is mainly about a club. So there must be people in it. But because it is a club where they do nothing but chat, laugh, play and EAT lots of food everyday, there must be club members in it to make it lively. So, there is these pair of similar female characters that just acts like some wild monkeys and they say the same thing all the time and etc..\\n\r\nThere is this other female character, an inventor who would invent the right stuff at the right time. Invents all sorts of machines that serves no purpose (Except for a couple at the ending). BASICALLY, these 3 characters makes no impact on me. After watching everything, I still don't feel a bit for them. Its like they were just there to make the club LOOK lively with more people. \\n\\n\r\n~Enjoyment~9/10 - Because the genres are Drama and Romance, I expected some story but the first impressions shows a comedy-liked anime. After awhile when things start to get serious in the story, there were moments where my heart just raced super fast and all. Like you know the feeling when you feel \"Touched\". Yea that. I am a male and usually when I see other animes and there is this \"OMG SO SAD\" part of an anime where it is supposed to make the viewers feel \"Touched\" or make them cry, I will feel like \"This is not even sad why should I feel sad?\" But KoiChoco made my heart feel sad and touched 4 times. Especially the one on episode... haha no spoilers \\n\\n\r\n~Overall~9/10 - Okay just to sum up, it is supposed to be a 7 at first because I thought it was just an ordinary harem anime with comedy. Then somewhere in the middle I upped it to 8/10 because there was more focus on romance. Then at the end, because of the nice background story there is to the anime, I decided to make it a 9/10. 1 thing I do not like is, it is still only a 12 eps anime and not a 24 eps one. \\n\\n\r\nOkay hoped I helped.\\n\\n\r\nI know there are quite some few who dislikes the main female lead character because they find her annoying.. But she is actually not.. People who haven yet to watch the anime, please try to like her as fast as possible. Yea her name is Chisato.",
            "date": "2012-09-28T09:41:00+00:00",
            "helpful_count": 15,
            "mal_id": 73499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Notthatfasthuh",
                "username": "Notthatfasthuh"
            },
            "url": "https://myanimelist.net/reviews.php?id=73499"
        },
        {
            "content": "I love chocolate, wtf am I saying? Ok, so this sweet anime has ended and I glad that it becomes a Yuuki X Chisato arc, so let's get down to business:\r\nStory: Good 7.\r\nI say even though the story is a mixed up arc, I like the way where is was going,co'z everything about this anime revolves around love, elections and chocolate. The love part are the occasional arcs where the muchacho (Yuuki) encounters, though it still has that guy is oblivious to girl's feeling kind of thing. The story kinda misdirects us audience as to whom will the muchacho (Yukki) will end up with, evenif the muchacho (Yuuki) has told the chiquita( Chisato) that he'll never leave her side, we sort of ignore it hoping that it'll be whom we hope for. Needless to say that the \"Love\" thingy of this anime's title refers to Yuuki X Chisato's arc, in fact the romance genre revolves around it. The \"Election\" thingy of this anime's title is more of a  mystery genre that surround the bureaucracy of the student council in particular the \" Public Safety Commission\"  and the Katahira Faction, and as for the \"Chocolate\" thingy ( I love chocolate), that is where the drama genre is and it is all about the chiquita's (Chisato) hatred  of chocolate and Daikin her hermano (brother).\\n\\n\\n\r\nArt: Fair 6.\\n\\n\r\nOk for the girl's school uniform, I really can't dig the illustrator's idea as to why most students don a 4 layer dress, which btw is the cropped jacket which the 4th layer and worn by most girls and why do some girls only have 3 layered uniform, wtf do I mean? Ok most girls have the follow layer of school uniform which is compose of the following; camisole, shirt, skirt and cropped jacket....btw the ribbon is not included. on the other hand Michiru, Ai Ki, and Isara don a 3 layer uniform, which only includes the camisole, shirt and skirt. If this is the illustrator's way of distinguishing the freshmen from the older students then that is a a very cheesy concept. I'd rather see them girls wearing an ordinary sailor's outfit than having to discriminate certain character's outfit.\\n\\n\r\nSound: Good 7.\\n\\n\r\nI like the both the opening and ending theme, but I mostly prefer the opening theme. Which is titled \" Signal Graph\" sung by Annabel:\\n\\n\r\nSignal Graph, English translated:\\n\\n\r\nMy hand can reach you as you stand smiling in front of me.\\n\r\nBut although I’m so close to you I can touch you,\\n\\n\r\nI put up a front and close off my feelings\\n\r\nand pretend I don’t notice the emotions flowing out of my heart.\\n\\n\r\nBut even beyond the cloudy sky blurred by my tears,\\n\r\nthe bright blue sky spans across.\\n\r\n“The signal telling me I can change.”\\n\\n\r\nI’ll raise my hands high up\\n\r\nso take me from the past I feared\\n\r\nand into the future I thought\\n\r\nI’ve let go.\\n\\n\r\nI just noticed you and that\\n\r\nwhich shines brightly within you.\\n\r\nI’ll look straight ahead\\n\r\nand walk forward together with you.\\n\\n\r\nI knocked down one of my dreams I thought I could reach.\\n\r\nAnd I sat there looking out the window…\\n\\n\r\nWhen our eyes meet, I can’t say anything.\\n\r\nSo I smile hoping my smile will convey these overflowing feelings.\\n\\n\r\nAccepting each other is not because of weakness,\\n\r\nso teach me how to have a stronger heart.\\n\r\n“The signal telling me I can change.”\\n\\n\r\nSpeeding up my pace along with yours,\\n\r\nI’ll take the tailwind\\n\r\nand go towards the future I thought I’ve let go\\n\r\none more time.\\n\\n\r\nI keep the strength you gave me deep in my heart.\\n\r\nOne day I’ll be sure\\n\r\nto shine brightly and shine over\\n\r\nothers and the roads they take.\\n\r\nThe bright light, gives me a push on my back, and spreads far.\\n\\n\r\nI’ll raise my hands high up\\n\r\nso take me from the past I feared\\n\r\nand into the future I thought\\n\r\nI’ve let go.\\n\\n\r\nI just noticed you and that\\n\r\nwhich shines brightly within you.\\n\r\nLet’s walk forward holding hands.\\n\\n\r\n“Given enough time, everything will change.”\\n\r\nI won’t ever say that anymore\\n\r\nand go towards the future I thought I’ve let go\\n\r\none more time.\\n\\n\r\nEven against the wind raising its speed,\\n\r\nI won’t close nor avert my eyes.\\n\r\nI’ll look straight ahead\\n\r\nand walk forward together with you.\\n\\n\r\nWalk forward.\\n\\n\\n\r\nCharacter: Good 7.\\n\\n\r\nYuuki Ojima- The thing about him, is that he's a kind of guy who is aware that the girls have feelings for him, but seems to be of a block head as what to do next, ok so he's a bit of a Mr. Heroic when he tries to save Isara from being builled and when he also mends Satsuki and Hazuki's differences. But he kind looks like this soon to be reluctant philandering husband where he searches for love only to find out that his real heart belongs to Chisato.\\n\\n\r\nChisato Sumiyoshi- everyone kind get's irritated when she seemly dominates Yuuki and seem to relies a lot on Yuuki for emotional support. But it is that emotional dependence  that gives her character that dramatic climax.\\n\\n\r\nMifuyu Kiba- Well, if you were to ask me, she actually my 2nd choice if ever the Chisato X Yuuki arc didn't come about, I like the way she has that gentleness about her, but I can never understand as wtf is a big deal about Japanese teenage girls on being insecure about having a scar? When in her case she had it co'z she had underwent surgery, now it is not like that she lost her virginity co'z she was raped or something.\\n\\n\r\nIsara Aomi- I kind pity her, and I could have wish that she wasn't being buiiled.\\n\\n\r\nMichiru Morishita- If only if this anime wasn't being censored, I would have seen her panty. But I can never understand as to why is she sooo passive and yet sooo deadly. I really hate it that she's an S-agent though, but she one moe that you'll find interesting. \\n\\n\r\nSatsuki Shinonome- Whoa, she one hell of a refine lady with both beauty and brains.\\n\\n\r\nNozomi Edagawa- or 'Non Chan, ........I have nothing to say.\\n\\n\r\nAi Sarue and Kii Monzennaka- I guess if this anime should have a tsundere character, they are it.\\n\\n\\n\r\nOboro Yumeshima - Yaoi? EEEEWWWWW! ( No offends to the members of LGBT society)\\n\\n\r\n Hazuki Shinonome - What I like about her is that she's one Milf that everyone will love............to be Yuuki's cougar that is. \\n\\n\r\nAs for the rest of the cast, If there will be a character that best describes as the mystery genre of this anime, then it'll be Yakumo Mōri and Kana Ōgibashi and as the antagonist it'll be Moheiji Tatsumi in which I can never understand as to why he has to be in a henohenomoheji-like mask and Yuina Ōsawa. I really find it irritating that teens like them seems to be in control of  Takafuji Academy.\\n\\n\r\nEnjoyment and overall: Good 7.\\n\\n\r\nWell, if one is to enjoy watching this anime, then it is really enjoyable to watch, especially when one is hoping for someone to be Yuuki's love interest, in which I'm glad that it ended with Chisato. Overall I find it irritating that  Takafuji Academy seems to be controlled by the student council and the student council itself in embroiled in such bureaucracy where such mystery genre  was formed in particular as to who ran over Kana, what anomalies does each commission of the student council is in to and why does the Public Safety welds such authority not only over the students but also with the faculty and the school administration. Such things are ill fitting to the overall of this anime, but it does provide such curiosity as to how things will go about, so it is only limited to have a 7 for its overall score.\\n\\n\\n\r\nI love chocolate.  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2012-09-29T09:17:00+00:00",
            "helpful_count": 15,
            "mal_id": 73597,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=73597"
        },
        {
            "content": "Love, Election and Chocolate is pretty much another anime based off a dating sim game with our male lead Yuki being surrounded with several girls he interacts with in his school club. To a good extent, the anime essentially milks the typical cliches and archetypes of dating sims, harems and high school-based anime, which include even a student council that has more authority over school issues than the staff to go along with its \"election\" premise.\r\nIt does have some refreshing story elements to its dating sim roots. Yuki isn't made into a hapless lead dealing with unwanted attention from the girls surrounding him as heis a level headed guy trying to get a handle on all the situations surrounding him in the school as he runs for student council president and has clear thoughts on the feelings he has for the girls surrounding him within the club or around the school. While the anime has some fan service and double-entendre moments, they don't pop up often nor do they get in the way of developments with the show's plot. The first half also has some potential with its election plot as Yuki tries to gain support for his electoral run and understand the ropes of being a student council leader.\\n\\n\r\nThe series quality starts to degrade in the show's second half when elements to the show's dating sim roots start to rear their ugly head. The sub-plot that Yuki is dragged into involving hostilities between two characters got decent focus and genuine drama out of the affair. However, Love Election and Chocolate's attempts at adding romantic developments in its second half are rather underwhelming as they are rather unconvincing and poorly mixed into the ongoing developments Yuki has with the election. The election bits even degrade in quality as well when things get way too overly serious over the stakes of the election when things such as secret groups, conspiracies and scandals get added to the mix with such students treating the election as if they were trying to win a campaign to run a country. It's perhaps the poorest example I've seen of the \"Absurdly Powerful Student Council\" trope getting milked from an anime to date.\\n\\n\r\nVisual quality for this is a bit on the plain side for a 2012 title. There are sharp details and bright colors incorporated for character designs and scenery to compliment the cheerful mood the anime wants to give off. However, nothing with it particularly stuck out in comparison to other impressively visual titles animated from that time such as Eureka Seven AO and Fate/Zero's second half.\\n\\n\r\nMuch like many other dating sim knockoffs I've come across, I'm rather indifferent towards Love, Election and Chocolate. Despite having some decent elements to its premise, the series still mostly milks off story cliches and character archetypes typical of the genre and the election story gets rather ridiculous in its second half when it tries to act like its making a statement about politics. Unless you're a sap for dating sims, I'd pass on this.",
            "date": "2015-01-11T19:16:00+00:00",
            "helpful_count": 14,
            "mal_id": 177477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=177477"
        },
        {
            "content": "One of the most common ailments of VNs-turned-anime is that it's easy for the romance to overwhelm the story.  Integrating a game with multiple routes with multiple leads into one single storyline often ends with a anime that, at best, seems like a harem anime that lacks the courage to actually make it a harem (Clannad) or, at worst, a mess of routes that fails to flesh out characters well and butchers the plot (i.e. Studio DEEN's adaptation of Fate/Stay Night).  Koi to Senkyou to Chocolate manages to find a tenuous, if workable balance, between plot and characters in this adaptation of theoriginal Eroge.\\n\\n\r\n=Story: 9=\\n\\n\r\nAt the beginning of the season, Koi to Senkyou to Chocolate started out near the bottom of my priorities list, fulfilling the spot of stereotypical-harem-with-a-plot that just manages to stay good enough to avoid being dropped.  The first episode certainly reinforced it, with a club with seven females and two males, one of whom is also apparently heads-over-heels over the other, the protagonist.  The originally chilling prologue of the first episode seemed to have been completely forgotten, and the whole election was going to be a happy but uninteresting frolick of cuteness and relationships.  However, KoiChoco (Koi to Senkyou to Chocolate is a bit too much of a mouthful) does in fact develop from a harem with a plot. \\n\\n\r\n As is the case with apparently all Japanese High Schools, the Student Council holds vasts amounts of power.  In the case of Takafuji Private Academy, an academy whose finances are almost completely managed by the students, the Student Council controls the (as mentioned in Episode 11, \"tens of billions of yen-strong\") expenditures of the  school.  The Preisdency usually is fought over by three major factions within the school: the Finance Committee, the General Affairs department and the Public Safety Commission.  With the current incumbent plagued by allegations of corruption, the projected winner, Finance Commissioner Satsuki Shinonome, campaigns on a platform of austerity, starting with the elimination of clubs that do not appear to be doing anything productive with their funding.  Into this is thrown protagonist Oojima (often mistaken as Ooshiima due to the Kanji) Yuki, who is nominated by the members of his club (the Food Research) to run as a third-party candidate in order to save his club, all the while confronting the many interpersonal issues that emerge through the course of the campaign.\\n\\n\r\nDon't get me wrong, KoiChoco does not neglect the character-side of the story--much of the election (and much of the routes in the VN) are bound to interpersonal relations--the past traumas of Election Manager, Club President and Childhood friend Chisato Sumiyoshi, the family struggles of Finance Commissioner Satsuki Shinonome, the personal struggle of Isara Aomi, a beneficiary of a controversial financial aid program, and the enigmatic motivations of Yuki's backer and incumbent president, former Public Safety Commissioner Yakumo Mori. However, what makes KoiChoco an exceptional adaptation is its focus also on the main plot.  Through the story, Yuki and the Food Club must confront many of the problems faced by Third Party Candidates in a field dominated by large, well-funded parties, while also delving into the behind-the-scenes politics behind Yuki's backer, the Public Safety Commission, and the two other commissions.  Sometimes I found that the actual story at times seemed more appealing than the interpersonal struggles of the characters, though the opposite also occurred.  Overall, KoiChoco's best point was its ability to both bring out the interpersonal interactions of the cast while also maintaining an interesting and absorbing main plot.\\n\\n\r\n=Art: 7=\\n\\n\r\nWhile nothing bad can be said of the art--it is certainly cute, and there are no major drops in animation quality, the art comes off as unexceptional--good but not much different from anything else out there.  The anime frequently uses soft, pastel-like colors that help maintain a warm atmosphere to the anime in general, which does contribute to the atmosphere, but not in any noteworthy way.\\n\\n\r\n=Sound: 8=\\n\\n\r\nKoiChoco's Openings and Endings start out generic, but grow on you very quickly.  Signal Graph, the OP by Annabel, a departure from the generally soft, rather quiet Ending themes the Artist usually does (as in Sankarea, Canaan and Another's Endings), is an upbeat, enjoyable song that conveys the mood of the anime quite well, while the ED, Kaze no Naka no Primrose by Ceui, is also pleasant, but not quite as noteworthy.  The soundtrack music is certainly good, with a lot of synth, string and piano themes that would be expected of a romantic anime.  While nothing is lacking in the OST, there is nothing that would really come out as exceptional.  \\n\\n\r\n=Character: 8=\\n\\n\r\nThe main issue with many of the characters in KoiChoco is that they seem underused.  Many of them (Chisato and Yuki's friend Mifuyu, Michiru, Satsuki), while itneresting and well-fleshed out characters, do not seem to be used to the best extent they could, for the very reason that adapting their whole route into an anime of only twelve episodes would be difficult.  Other characters that probably held much more potential (i.e. the abrasive and strange Moheiji Tatsumi, whose mask apparently only Yuuki can see, Satsuki's sister and Yuki's adviser Hazuki, and Aomi) are also left seemingly without much elaboration.  Once again, the limits of a twelve-anime show should be brought into consideration, but the underutilization of some very interesting characters was a bit of a disappointment that reduced the score from 9 to 8.  On the other hand, other characters seemed pointless and unimportant--the cutely generic child genius Non-chan, Ai Sarue and her other-colored-twin Kii Monzennaka all seemed forgettable, with no seeming purpose apart from filling the club with people.  While that, too, should be expected of minor characters, they could have been replaced with less generic characters.\\n\\n\r\n=Enjoyment: 9=\\n\\n\r\nFor me, KoiChoco was a pleasant surprise in that it simply broke my expectations of a generic harem show and turned out to be a not-quite-riveting but certainly very interesting story that combined both interpersonal relationships with some of the actual politics and pressure behind an election.  The fact that at times my heart did race is certainly enough to elevate it to a 9.\\n\\n\r\n=Overall: 8=\\n\\n\r\nKoiChoco should honestly be deserving of a 9 - I really do want to play the Visual Novel now, and its plot probably covered most of the spots that made me dissatisfied with the anime.  The characters were pleasant, the story was excellent, and though the arts and sounds were unexceptional, they were certainly not detrimental to the story.  The only obstacle to getting a 9 in my book would be unavoidable specter of the 12-episode limit, which probably prevented many of the scenes from being employed to their best effect.  Overall, though, I thoroughly enjoyed KoiChoco in its 11-episode run, and look forwards to the last episode.",
            "date": "2012-09-23T12:56:00+00:00",
            "helpful_count": 14,
            "mal_id": 73073,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304909.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TimChan",
                "username": "TimChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=73073"
        },
        {
            "content": "People say \"never judge a book by its cover\" and I cannot expresses how it is true for this anime when it caught me off guard. Some may think this anime is like any generic and stereotypical anime about schools and how any stereotypical characters interact with each other. Well you're half right but you are also wrong. This anime is more than that, it doesnt follow the general dogma as some of you might say it and it will drawn you into a world of politics, revenge, violence, discrimination, and dramatizations. If you are into school, comedy, romance and drama, this anime is justfor you.\\n\\n\r\nArt/graphic -  The art is beautiful, all I'd have to say is its better than most anime I've seen so far including the more recent ones. Although I do feel that they could have done so much more with the art, I think this amount of work was the right choice for this anime. \\n\\n\r\nSound - This one is especially my favorite, I was instantly hooked with the OP as well as the first song in the beginning of episode one. \\n\\n\r\nCharacter -  I'm not going to talk about the character because people have different interpretation on what is a good or what is a horrible character.\\n\\n\r\nStory - This is what really drawn me into this anime. Unlike any other orthodox   short series comedy, romance anime where the plot (or no plot at all) come after 6 or 7 episode of the anime. (I know how frustrating it can be) The plot in this anime immediately present itself after one or two episode. Although this anime have many characters, it seem only to revolved around the main protagonist and his girl. Although this anime have a harem feel to it, it definitely going a different path than what it was meant for. What really makes me loved this anime was that the ending unlike any other thousands of anime, did not have a half ass ending. Im sure many of you have encounter many of these anime where the main character do not end up with anyone or the ending wasnt to your satisfaction. Well, I wont spoil any ending but the main character actually do choose a girl at the end and had over come many obstacle to be able to achieved his goal and love life unlike other protagonist where they are too \"pussy\" or weak and had to let the girl do everything. \\n\\n\r\nThis anime definitely caught me off guard as I was looking for something enjoyable to watch in my spare time. \\n\\n\r\nEnjoyment - 9",
            "date": "2013-03-08T23:43:00+00:00",
            "helpful_count": 14,
            "mal_id": 89133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1994010.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Noir0",
                "username": "Noir0"
            },
            "url": "https://myanimelist.net/reviews.php?id=89133"
        },
        {
            "content": "This series might have some solid stuff. The series is made intellectually pleasing but tries to keep other kind of folks interested too by the usual harem school club setup and it has worked decently though not brilliantly. The art doesn't help out much in favor of ma king it anymore attractive. The strong points of the series are I think, the characters and the dialogues. The first episode gives the air of an espionage thriller and political feel which has been heavily normalised for a high school setting and how the author uses this theme creatively is to be seen and I would likeit to work out well since it seems very interesting and hoping it wont lose its momentum and become just another excuse for a harem. I can draw parallel to the series \"Kyoukai Senjou no Horizon\" which was just too brilliant in story and style. Considering the fact that there are a lot of double meanings and that it uses a serious topic such as election politics, censoring and that too the just mild ecchi contents is very irritating and counter intuitive.",
            "date": "2012-07-05T22:35:00+00:00",
            "helpful_count": 12,
            "mal_id": 65451,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/261710.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/puvijain",
                "username": "puvijain"
            },
            "url": "https://myanimelist.net/reviews.php?id=65451"
        },
        {
            "content": "Short version: While not well executed, this series has a unique approach to its story, which is why I do recommend you to watch it despite its low rating. I can't say whether you'll enjoy it or not, but it's worth to see nevertheless.\r\nOne can easily list multiple stories, novels, movies, which portray how elections work (or more precisely, not work). Most of them ironically portray an incompetent, money-driven candidate who running his unfair and corrupted campaign.\r\nLove, Election, Chocolate! portrays Ojima Yuki, a member of the Food Research (a.k.a. Eating) Club, which, of course, gets school funds for its activities. However, the elections for StudentCouncil president are approaching, and the popular candidate wishes to disband clubs that don't deserve their funds, including Yuki's. Not knowing anything about politics and PR, Yuki decides to run against her.\\n\r\nThen what's the difference, then, between Love, Election, Chocolate! and all the other works you mentioned above? Once again we have an incompetent candidate who's running for president for money!\\n\r\nUnlike other similar political shows or novels, there's no irony in LEC! Instead, Yuki is the person who is about to lose the club, which is the place at school he really belongs to, and simply tries to protect it. We are also shown interesting personal dramas of the other members of the Food Club and the opposing candidates, political (and not only) intrigues by the people who currently have power, and much more.\\n\r\nFor this unique approach I give the story  8/10 (which is good, coming from me), despite the filler and supposedly comical silly scenes.\\n\r\nThe art, however, I didn't like. While its quality is good, I care a lot more about character designs than the quality of the art. And them didn't like: strange hairs, big boobs, and a face which looks like a mask. Thus I give 3/10 for the art.\\n\r\nThe music was OK. I liked the opening and ending a lot, and the the soundtracks were good and appropriate.\\n\r\nAs well as the character designs, the characters themselves also draw the show back. While appropriate (for example, we have Yuki's opponent, the perfect, honest, fair candidate; we have two comical relief characters), they are nothing special or original.\\n\r\nCharacters which are \"nothing special\", bad art, fuller scenes, manages, in my case, to \"compensate\" for the unique approach to the story, and thus I give 5 for enjoyment. Nevertheless, I do recommend you to give a try to this series.\\n\\n\r\nPS: Could you send me some feedback if you find thid unhelpful?",
            "date": "2012-09-28T15:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 73509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Togop",
                "username": "Togop"
            },
            "url": "https://myanimelist.net/reviews.php?id=73509"
        },
        {
            "content": "Koi to Senkyo to Chocolate is one of those anime that you don’t really expect much from but by the time the curtains closed you had gotten more than you bargained for. Don't you love it when that happens?\r\nThe Short Version:\r\n(+)The art is alright for the time.\r\n(+)The main characters are a bit more tolerable than the normal given the genre.\r\n(-)There’s way too many characters for this show to focus on.\r\n(-)The shift of tone towards the end is so sudden it’s jarring.\r\n(-)The sound, save for one part, is easily missable.\r\nThe Story (6/10): The story is about the main characters trying to stop their club from beingdisbanded, and they think up that the best way to do this is to have the male lead run for president, because on the day a new president is founded they immediately get to allocate the budget for all the clubs instantly. Because that’s totally how that shit works. One of the things that I really didn’t enjoy with the story is that the first 5 minutes are entirely misleading, then at the end of the show they bring back that tone for some reason. I was so confused towards the last 4 or so episode because the show changes from a light-hearted rom-com thing, to a drama piece that has something to do with political movement for the presidency. That is not a good shift of tone for a show like this, if it kept the feel from the first half of the show I probably would’ve enjoyed this just a bit more.\\n\\n\r\nThe Characters (6/10): I’ll say this quickly about the characters, there’s way too many for a show this small. You want to know why? Because it’s a VN adaptation, that’s why there’s something like 10 characters all in the club room at any given time, 24 characters over the entirety of the show, that’s way too fucking many for a 24 episode show, especially when you’re trying to tell the backstory to one of the main characters but keep cutting back to the side characters because hey, club members are important. Now take everything I just said about the characters and accept it when I say that the main characters aren’t that bad, not as bad as you’d think they’d be for a VN adaptation of a rom-com, speaking of mains.\\n\\n\r\nYuuki Oojima: The main guy of the show and the one running for the presidency.\\n\\n\r\nSatsuki Shinonome: Yuuki’s biggest opponent for the chair and not the biggest asshole of the show.\\n\\n\r\nChisato Sumiyoshi: Childhood bestie to Yuuki and the one who is mildly damaged to say the least.\\n\\n\r\nMichiru Morishita: Let’s say she’s ‘loyal’ to a particular someone and the pandering character.\\n\\n\r\nThere are other characters listed as main on MAL but these are the one’s you’ll be spending most of the show with, and again they’re not as unbearable as you’d think. And don’t even bother getting invested in any of the romance, because it doesn’t get any sort of conclusion.\\n\\n\r\nThe Art & Sound (6/10) & (7/10): Considering this show came out in 2012 the art is pretty standard, everything isn’t eye gougingly bad, but it’s so standard to the point where the only real response I have for it is, “meh.” It’s not bad yet not great either.\\n\\n\r\nThe sound is mostly the same across the board, the voice acting, OST, OP & ED, they’re all fine. “But you rated the sound higher than the art.” Yeah I did, because there’s a scene with a harmonica at the end that’s just so damn good, also the violin was exceptionally good.\\n\\n\r\nWhat do you think of this show?\\n\\n\r\nIt’s not necessarily a horrible show, it just trips over itself towards the end.\\n\\n\r\nWould you recommend this show?\\n\\n\r\nIf you’ve played the VN or want to kill some time yeah, otherwise nah you don’t really need to bother with this.\\n\\n\r\nGoodbye my brethren, see you in the next.",
            "date": "2015-06-23T02:11:00+00:00",
            "helpful_count": 8,
            "mal_id": 190999,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=190999"
        },
        {
            "content": "Hello guys~ This would be my first MAL review. Please forgive me for any grammatical errors and awkward wordings.\r\nAnyways, the main reason I'm writing this review is to defend the low rating/low popularity, and to also encourage other anime lovers to enjoy this anime.\r\nThe main problems others state for this anime are excessive amount of characters and plot rush. However, I don't really blame the anime for that. First of all, this anime bases off of Visual Novel, so the amount of characters can't really be blamed. The plot kind of rushes because of the length of the anime. I believe if the anime hasmore episodes and focuses more on main characters' past, then the anime can be as emotionally powerful as popular anime such as Clannad and Little Busters. \\n\\n\r\n-Story- 9/10\\n\r\nThe story is really great. The idea of student-governing school is really refreshing. The plot progresses well and the anime does not lack emotionally powerful stories. You would want to watch the next episode after each episode. The political struggles within the student government really interest me. Just as I mentioned above, if the anime has more episodes, this anime can easily get 10/10.\\n\\n\r\n-Art- 10/10\\n\r\nReally great art. The characters are beautiful and designed well. The setting is really great, so does the environment in the anime.\\n\\n\r\n-Sound-  10/10\\n\r\nReally love the OP and ED. Soundtracks are not bad as well.\\n\\n\r\n-Character- 9/10\\n\r\nCharacters have different personalities and roles, with different back-stories. The amount of characters is a problem though; however, I don't really blame the producer for that. The main male lead progresses throughout the anime. The relationship between main male lead and main female lead progresses as well.\\n\\n\r\n-Enjoyment- 10/10\\n\r\nThis anime can really move people. The stories are great and the interactions between characters are interesting. \\n\\n\r\n-Overall- 10/10\\n\r\nReally good one for me. Reminds me of clannad and little busters. I really love these emotionally powerful anime, especially if they revolve around school. I would gladly recommend this anime to anyone who loves Clannad/Little Buster or anyone who loves anime with school, romance, and slice-of-life settings.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-02-28T22:57:00+00:00",
            "helpful_count": 8,
            "mal_id": 181431,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4110235.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kou_Keiki",
                "username": "Kou_Keiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=181431"
        },
        {
            "content": "**I have only seen the anime of Koi to Senkyo to Chocolate and this review is only based on that.\r\nRomance comedys with high school settings are by far my favorite anime series, so keep that in mind. \r\nKoi to Senkyo to Chocolate/Love, Election and Chocolate/恋と選挙とチョコレート ; 12 episodes a 20 minutes, aired from July to September 2012 ; Comedy, Drama, SoL, Romance, School ; licensed by Sentai Filmworks \r\nKoi to Senkyo to Chocolate appears like a generic romance school story who wants to be different from mindless harems, to then develop into a thrilling election battle with very interesting subparts to the main plot. Itfollows the happenings in a student-reigned school where the Studen Council basically reigns it like a small state. \\n\\n\r\nStory: 9/10\\n\r\nIf you have already read the synopsis, you know that the story is something fresh and new. Running for student council president normally is not part of the ideal Anime MC character, so it's interesting to see something new. Apart from this main plot a big part of the series is also the romances and relationships around the male MC, to an extent that sometimes almost make it seem like youre watching a harem series, but these are minor appearances. It is almost impossible to analyze the story without spoilering it all, but in the end, it fades out to have been a very complex storyline with important and diverse subplots, which make the biggest of the good part of the series. I would have given a 10 if it werent for some unnecessary exaggerations, but its still good. You will never be annoyed or not pleasantly surprised.\\n\\n\r\nArt: 8/10\\n\r\nThe art is nothing special, but good nonetheless. Sentai Filmworks is a good studio and clearly lives up to the expectations. Sadly, I only gave an 8 because of often very unnecessary and out of place fanservice, which mostly just ruined the scene. Nothing to complain about the art though, the girls are diverse and beautiful, animation is well done.\\n\\n\r\nSound: 10/10\\n\r\nThe OP isnt generic but still awesome. ED is extremely fitting to the vibe that the episodes emit, well chosen. ANd the background music is just perfect. I have seen few anime whose background sound was just so perfect, especially when there are so many different styles to chose music from, since the story subplots are so different. The voices are mostly very good.\\n\\n\r\nCharacter: 10/10\\n\r\nThis anime does not at all have your generic dere-character types. Most characters appear to have so in the beginning though, but then receive decent to great parts of character development which explains their diverse and unique characters to the viewer. The way they act appears very realistic and understandable because of their characters. The life crisis and psychologial problems of the single persons are also well executed. It creates a remaining bond to the viewer which makes this show so good.\\n\\n\r\nEnjoyment: 9/10\\n\r\nCoupled with an complex and intriguing story, excellent character portrayal and well executed comedy scenes here and there makes this show extremely enjoyable. After overcoming my post anime depression of binge-finishing this series yesterday I still think its awesome and heavily underrated. Everyone who watches this will be pleased by the diverse storyline and the appealing circumstances. Its worth watching this, believe me.\\n\\n\r\nOverall: 9/10\\n\r\nIf it werent for the sometimes out of place scenes - as mentioned before - I would have given this show a 10. It also is while realistic in some aspects, extremely unrealistic in some others. The displayal of childhood love, post-traumatic problems, teamwork and even touching important aspects of modern definition of democratic state systems, the show makes a staying impact on the viewer. This all coupled with good comedy really made this show for me.\\n\\n\r\nForecast: There wont be a second season, since the story is more or less finished. There were some OVA's that add a lot to the romance and battling over Oujima's love, plus a whole bunch of fanservice - if youre a fan of that, go ahead and watch them.\\n\\n\r\n**This is my second review, so please keep that in mind. If you have any suggestions or feedback PLEASE tell me so I can improve my reviews. I plan on writing one for every finished anime from now on, and I want em to be good. Thanks for reading!!",
            "date": "2015-02-26T03:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 181238,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4221129.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Urbanophiler",
                "username": "Urbanophiler"
            },
            "url": "https://myanimelist.net/reviews.php?id=181238"
        }
    ],
    [
        {
            "content": "Story:\r\nThe story of Koi to Senkyo to Chocolate was pretty good until about the eleventh episode. It was funny, there was a little bit of romance, some drama between the main character Oojima and his childhood friend Chisato whose brother died at a young age.\r\nBut at the eleventh episode things started to get way out of hand, it turned unrealistic and melodramatic, and I kind of sat there with a \"WTF\" face.\r\nOther than that it has a great story :)\r\nArt:\r\nFantstic art, I loved everything about the art. The outfits were cool and I love how they draws the faces. The eyes remind of the charactersfrom Tsuritama and I think that's really cool.\\n\\n\r\nSound:\\n\\n\r\nThe opening theme is very pretty and matches the anime well, it's sort of peaceful like something you would fall asleep to, but at the same time it's kind of fast-paced.\\n\\n\r\nThe ending is great as well.\\n\\n\r\nAs for the character voices, they did a fantastic job on voices matching the characters, unlike some other animes I've watched where they are completely off.\\n\\n\r\nCharacter:\\n\\n\r\nI think Oojima is awesome, he is fair, kind, and overall a nice guy.\\n\\n\r\nChisato on the other hand is sometimes whiny and confusing. I liked her a bunch, but sometimes I just wanted her to shut up and stop complaining and being so clingy.\\n\\n\r\nAnother character, the last President at the highschool almost never opens his eyes. And usually in animes like Gin in Bleach or Lao from Kuroshitsuji, I don't mind and it matches their character, but for some reason every time I saw this characer it really made me mad that he always kept his eyes closed apart from a couple of occasions.\\n\\n\r\nEnjoyment:\\n\\n\r\nOther than the big melodramatic climax where I was seriously wondering why it was so dramatic when it was only highschool, I enjoyed it very much. Especially the green haired club memeber, Yume, who was a great comedic relief from all the drama and always tried to get with Oojima and made 'Yaoi Sticks.'\\n\\n\r\nOverall:\\n\\n\r\nEven with the pretty strange storyline and dramatic scenes that shouldn't have been so dramatic and some unexplained envents, this anime was pretty cute and if you're a fan of harem or romance animes you should watch it.\\n\\n",
            "date": "2012-10-20T13:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 75437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1411219.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GeekyH",
                "username": "GeekyH"
            },
            "url": "https://myanimelist.net/reviews.php?id=75437"
        },
        {
            "content": "Koi to Senkyo to Chocolate was kind of a recipe for disaster. When you put too much stuff into one thing, it never ends well.\r\nStory 6/10: This series is a drama, I do like dramas but the drama presented in this show is almost laughable, like a really bad soap opera. At the beginning of the show they show you some kind of car accident, which is interesting, but that is actually not what the show is about. Instead, you are presented with the story of a boy who runs for student body president to save his club from being cut. Ok, I'll go withthat. But as the show goes on, the plot gets way over-complicated. There is some random bullying, super-secret stuff, suspicious alliances, secret hospital visits, traumatic experiences, weird backstories, a strange aversion to chocolate, and a season finale that is so ridiculous you would never guess it. It will leave you asking yourself, what happened to the simple story of a kid running for president to save his club?\\n\\n\r\nArt 7/10: Not too shabby if you ask me.\\n\\n\r\nSound 8/10: Can't complain about the music either, opening song is pretty catchy the ending song is pretty.\\n\\n\r\nCharacter 6/10: I don't think the characters were all that well-done. Most of the characters didn't really have any depth to them. Some did have potential but they didn't quite cut it, at least not for me anyway. The main girl, Chisato, I just kind of thought she was crazy, and she was supposed to be the character with depth. Also her relationship between her and Oojima seems pretty forced, I actually was more interested in the relationship between Mouri and Kana, for some reason, even though they were supporting characters. The other characters, particularly the girls, bothered me. The page for the show doesn't say that it's harem, but that is the vibe I got from this show. Oojima is basically surrounded by a bunch of girls, most of which fight over him! Even a guy character (Yume) has a thing for him! By the way that Yume guy constantly flirts with Oojima, at first I thought he was just trying to be funny but then I realized he was serious. I was mad, the characters could have been so much better.\\n\\n\r\nEnjoyment 6/10: I mean the show is ok, and will entertain you for a while with it's ridiculousness, but I just felt that it fell a little short of what it could have been. Also, the page doesn't really say it is ecchi either, which I guess technically it isn't, but I kind of got a weird ecchi vibe off of this show.\\n\\n\r\nOverall 6/10: This show kind of left a bad taste in my mouth. Haha, sorry I couldn't resist, food was an important part of the show after all!",
            "date": "2014-08-07T09:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 155655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1253781.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/shouj0panda",
                "username": "shouj0panda"
            },
            "url": "https://myanimelist.net/reviews.php?id=155655"
        },
        {
            "content": "OK. After playing through the visual novel I decided to watch the anime.\r\nAnd I have to say. I was severely disappointed.\r\nIf you like the characters after the first episode I'd HIGHLY recommend playing the VN instead.\r\nIf you don't want to or don't have the time to go through all the routes, but want to experience the story that is in this anime I'd recommend to at least play through Chisato's, Satsuki's, and Michiru's routes \r\n(those are the top 3 routes in my opinion anyway (not in that order)) .\r\nThe characters and just the plot itself is much better developed, built up, and explained.\r\nThe anime ispretty much just following a checklist of events and CG-s with not enough buildup and little to no emotional impact.\\n\\n\r\nIt's still not a bad anime don't get me wrong. but instead of it being 7-8-9/10 (depending on the route) it's a 6 at best.",
            "date": "2019-04-20T05:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 306735,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/waszner13",
                "username": "waszner13"
            },
            "url": "https://myanimelist.net/reviews.php?id=306735"
        },
        {
            "content": "I feel that this anime deserves a better score. This isn't a detailed review, so if you're looking for one just skip this. However, if you're reading this review, wondering whether or not you should watch this show, I'm hoping that I can get you to ease your mind and give this show a chance.\r\nStory= 8\r\nThe story wasn't anything special, but it was very enjoyable in my opinion. I failed to understand why winning the school election was so important that the antagonists would do what they were doing, which is the only thing that bothered me. However, I never found myself bored watching thisshow.\\n\\n\r\nArt = 8\\n\r\nThe art wasn't amazing, but it's very difficult to give a 2012 anime anything less than an 8 unless if the art bothered me. Very close to giving it a 7, but I felt that it wouldn't be doing the show justice.\\n\\n\r\nSound = 7\\n\r\nThe sound was good. It never really made any impact on me. The only reason I'm not giving this show a 6 in the sound department is because a certain character's harmonica playing made me actually want to buy a harmonica.\\n\\n\r\nCharacters = 8\\n\r\nThe characters were great. I felt that certain characters needed more show time and revelations, but I don't think it would've been possible with the shows limited time. I feel that the main characters had great background stories to them.\\n\\n\r\nEnjoyment = 8\\n\r\nLike what I have stated in the beginning, this show doesn't deserve its low score. Anything less than a 7.8 would've been an insult. My personal opinion is that this show deserves an 8.06 rating.",
            "date": "2012-12-11T19:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 79968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1493663.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lolipedophin",
                "username": "Lolipedophin"
            },
            "url": "https://myanimelist.net/reviews.php?id=79968"
        },
        {
            "content": "Well this is my first review do I'm just going to make it short and sweet(joke about title,pretty cheesy ik)Well anyway let me get started by saying that even though this is fairly new show I'm surprised it's not all that very popular, I would not go as far to say its the best anime of the summer but it's memorable.\r\nStory-8\r\nOnce in a land far away a highschooler named Oojima that decided that he will save his club by running for student body president, little did he know that this journey he was about to take was a hard one.Alrighty so this plot sounds completelyunoriginal,but where other shows get sidetracked easily,Koi to senkyo to Chocolate STAYS ON MAIN STORY LINE. Sure every so often it goes of into the romance aspect of the show.but for the most part it's about himreaching his goal. \\n\r\nCharcthers-6\\n\r\nBasically there are a handful of charcthers surronded by talking manikins,only a few of the charcthers seem to have any story while the rest are just kind of there.But in my opinion I think it kind of works for this anime because since it is unfourtenly only 12 episodes it needs to get to the meat of the story and there is some to no need for background charcthers stories.\\n\r\nSound-5\\n\r\nEasily forgettable,I just finished it and can't even remember the opening,just another harem opening.\\n\r\nArt-9\\n\r\nAll the art this season has looked the same,but this seems to add the seasons art with a few unique elements.It al looked clean and there wasn't much lacking in the art department.\\n\r\nEnjoyment-9\\n\r\nPretty good,just seemed it was rushed a little.I dont have any complaints about it other than it kind of being unrealistic seeing how serious the student body government was at this school xD kind of over the top.\\n\\n",
            "date": "2012-10-09T17:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 74547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1370961.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ozzey",
                "username": "Ozzey"
            },
            "url": "https://myanimelist.net/reviews.php?id=74547"
        },
        {
            "content": "for the story, it was awful. just the worst thing i have ever seen. at first it just looks like a anime about someone who trys to become student council president just to save his club that is only about eating snacks. but it gets so much worse. after that you find out that there are serious bully issues, factions within the school (good and bad), conspiracys, bad romance, dreadful backstorys and on top of it all it will introduce characters in the anime that where never there in the first place then they are some who really close to the characters. and they mixall of these ideas without any order so really you spend most of the time wondering, \"who's that?\" or \"wait what about....\"\\n\\n\r\nthe art was good it had the sense of something that you would see in a serious anime which at times does work for it but other times not so much.\\n\\n\r\nthe sound was also good if you watched subbed then i would say that the voices are great for the characters if you watched dubbed then they were good voices. but over all the sound quality on things like any OST's, music, and sound effects were very good.\\n\\n\r\nthe enjoyment is not very good. you will continuesly question why he is doing that or how this didnt get canceled before it even started. it is poor and that is saying it nicely.\\n\\n\r\noverall this anime was one of the worst things i have ever watched. it is not worth your time to watch it at all.",
            "date": "2013-07-30T20:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 107569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028135.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/jackfat87",
                "username": "jackfat87"
            },
            "url": "https://myanimelist.net/reviews.php?id=107569"
        },
        {
            "content": "I have noticed far too many drawn out reviews of this show I just finished, and though I am just about to watch the special and ova, I am reminded of my quest to never see such a time wasting anime again (true 7 or better).\r\nAnyways to cut to the chase this show could be seen as an allegory to government and political intrigue in the real world (but most could sadly only equate that idea to James bond instead of the factual, shady organisations those spy dramas are loosely based upon). The show tries to masquerade most of the time as a late highschool romance/harem and just gets in over its own head, not really achieving much. Many situations in this show that were meant to be serious were more comical than the actual humorous moments peppered about. \\n\\n\r\nReally its just a sloppy harem/ mystery that seems like it was written by a soft core novelist, but just D**k teases people ( whether they are straight, or gay or what have you), not only with the romance at slight sexual tension, but teases those with a lust for a decent plot. There have been plenty of short anime shows out there that have done much better. But c'est la vie. \\n\\n\r\nAvoid if possible, its just not worth it.",
            "date": "2014-02-10T00:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 132111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/129090.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnchientProphet2",
                "username": "AnchientProphet2"
            },
            "url": "https://myanimelist.net/reviews.php?id=132111"
        },
        {
            "content": "This is the anime you're looking for if: You like slice of life animes but with some twists and drama. It may seem light and funny at firtst, but towards the second half it gets more serious in a really enjoyable way.\r\nWhat I liked about this anime:\r\n- The character development was really well handled for most characters. I would say it is the main thing going on in this anime.\r\n- The humour and drama were well balanced. It started off as nice and made me laugh sometimes, but once the drama started to kick in it got me really interested.\r\n- The slow development at first(I would say nothing really happens before the second half) made me care about the characters and want to know more. It may not be an action-packed anime from start to end, but you actually care about what happens later on the story, something some animes lack.\\n\\n\r\nWhat I disliked about the anime:\\n\r\n- It started off with a really slow pace to be replaced by episodes full of action and I felt like that part was rushed. This anime should have had 25 episodes to really tell the story well\\n\r\n- Because it is so short, some things like a deeper look in the main character's past were overlooked and I would have liked to know more. There are a lot of great characters in this anime and it's a shame we couldn't learn more about them.\\n\r\n- There was some fanservice in this serie and I feel like it didn't need to have it. It was kept to a minimal though.\\n\\n\r\nOverall: I really enjoyed this anime. I found it didn't go deep enough for some parts because of its shortness, but other than that it was really fun. It is a good mix between slice of life, action, drama and including a lot of characters.",
            "date": "2014-06-04T19:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 145841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2231733.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/flaming-moltres",
                "username": "flaming-moltres"
            },
            "url": "https://myanimelist.net/reviews.php?id=145841"
        },
        {
            "content": "At the beginning, I wasn't sure why I was bothering with Koi to Senkyo to Chocolate, it just seemed like a pretty shallow story about a guy running to be president to save his beloved club. But when you start seeing the depth to the characters and when the story starts to develop, you really start to see that this apparently cute and funny anime is more than just about saving a school snack club.\r\nStory: 8/10\r\nThe plot is pretty standard, Yuki being an ordinary guy (whose only good trait is that he's good at baking lol) running for school president to save his club; andthe story focuses on how he rises to that challenge. Whilst the main story might be simple, I think the other characters really add to the drama of the series and make the elections super fun to watch. There are hints of romance between pretty much every character and Yuki (even the only other guy in the snack club is in love with Yuki), and it's just hilarious to watch how Yuki reacts to it.\\n\\n\r\nCharacter: 7/10\\n\r\nAlthough I honestly did not like Yuki's character at the beginning of the anime (he seemed so lost and dependent), as I followed Yuki's journey through the election process and his interactions with all the different characters, I could see him grow into a character with more definition and purpose, which made me like the anime even more. Overall, I just really enjoyed the concept of the story and discovering more about all the characters, particularly because even the supporting characters in the club and some of Yuki's rivals in the elections are well showcased and important to the story.\\n\\n\r\nArt: 9/10\\n\r\nI think the art in this show is typically girly, and the characters all look very cute, which for me is important when I watch this type of anime (if the anime is supposed to be cute/funny, I prefer cute-looking characters). Plus, Chisato (the president of the snack club) is sooo pretty!\\n\\n\r\nSound: 8/10\\n\r\nDidn't really pay much attention here, but the mood/music was fine the whole way through.\\n\\n\r\nOverall Enjoyment: 7/10\\n\r\nI think the winning part about this story is that in one episode, I'll be laughing my head off over the silly things that the club members do in order to get votes for Yuki, but in the next episode, I'll be sympathising with the same characters and their background stories. This mix of emotions as a result of the characters and plot is what makes me think this anime is worth a watch.\\n\\n\r\nFor those people who like watching or have experienced some sort of election process, for those people who like light-hearted shows with slightly bitter-sweet undertones and for those of you who like harem-style anime, I'm sure you will end up liking this show, so definitely give it a try! \\n",
            "date": "2012-12-03T15:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 79086,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1842680.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tish92",
                "username": "tish92"
            },
            "url": "https://myanimelist.net/reviews.php?id=79086"
        },
        {
            "content": "Normally i wouldn't dream of reviewing something after just one episode, especially when there are two more episodes beckoning for me yet to watch. This anime however, has already met many of my 'criteria' to keep me coming back. In this case, i think i'll have this serve as a prediction, or educated guess if you will, of things to come. So far, i've observed the following:\r\n1. A mysterious event, resulting in murder\r\n2. Modern Japan\r\n3. The protagonist being woken up by his female childhood friend in bed with him\r\n4. A high school\r\n5. Schoolgirls\r\n6. Panty-shots (censored, so not ideal, but dvd's will remedy that)\r\n7. A randomhot looking teacher that begins the school day by drinking beer in front of students, and proclaiming 'if it was a problem, they'd have fired me by now'\\n\r\n8. The protagonist seeing 'things' on people nobody else can see\\n\r\n9. Girls are cute looking, clingy, clumsy, and clearly all interested in the protagonist to some degree\\n\r\n10. Most female anime character stereotypes are met - the cute junior who refers to herself in the 3rd person, the quiet wierd looking socially inept one, the calm and beautiful sociopath, the posessive but dismissive childhood friend etc etc.\\n\\n\r\nSo far nothing spectacular has happened, but it's hard to think that after the above, at the very least this show would not be worth seeing through to the end. Realistically it doesn't even take half of the above points to keep me interested - the drunken teacher alone is sufficient for that.\\n\\n\r\n------\\n\\n\r\nJust updating here, 5 mins into episode 2, I can say without a doubt this show looks to be entertaining. If the above points sound appealing to you then it looks like this one is another winner :P\\n",
            "date": "2012-07-23T12:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 67481,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1409693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/me-262",
                "username": "me-262"
            },
            "url": "https://myanimelist.net/reviews.php?id=67481"
        },
        {
            "content": "Lets get right into it\r\n[Adaptation]\r\nBeing someone who played the original VN, i could say that this is a not bad adaptation. Okay yeah they didn't follow everything that happened in the VN and changed some of the events. But if they did follow exactly the same, i think it would hinder the pacing. So i understand why they feel the need to change some aspects. Too bad i didn't finish the game until the end considering i lost the game data and save file. Oh well i got pretty far though at least until just before the final election, or around 10 hours of gameplay,in the anime it's equivalent  to around episode 9/10.\\n\\n\r\nOk so maybe the story is kinda hard to catch to those who didn't play the game considering so many details they left out. But then there's a reason to play the game yourselves. Plus you get to see some H-sce-. \\n\\n\r\nMoving on\\n\\n\r\n[Story]\\n\r\nIThe amount of plot conveniences in this anime is SO many. I'm not gonna get into detail because that would lead to some spoilers. Some things just didn't make sense but that turned into the comedy aspect of this anime. Things like \"wtf how does that work lol\", so i don't mind little things like this. \\n\\n\r\nBut the general story of a school, a prestigious school SO big, of over 6000 students (?), in one city, having an official fully fledged presidential campaign run by highschool students? Even one of the biggest Japanese highschools irl only has ±1800 students.\\n\\n\r\nBillions of yen run through this school and they entrust all that money to the students? a HIGHSCHOOL students in their teenage years handle that amount of money and handle the scale of the campaign? It's almost like Takafuji is not a highschool, but an entire town/nation. \\n\\n\r\nNot to mention the dark side of campaign like bribery, threatening, abduting, taking hostage, spies, even harming others to the point that they are hospitalized. All of that done by highschool students? \\n\\n\r\nPlease correct me if i'm wrong but this aspect doesn't make sense to me. But i still liked the story of an election. It's definitely not your typical romance anime.\\n\\n\r\n[Art]\\n\r\nI feel like i talked too much in the story & adaptation aspect so i'm, keeping the rest short. The art is not the best, but it does the job. Moving on.\\n\\n\r\n[Sound] \\n\r\nGood sound, good op/ed. I noticed they add a lot of little sound effects like when the characters move their head, or their eye twitches. Kinda overdid it to be honest but meh. Didn't ruin the experience.\\n\\n\r\n[Character]\\n\r\nHmmm, i wanna talk about this part too, but it'll make this review too long. The character i feel like they are too focused on Chisato and Yuuki and didn't touch the other characters. So if you want to know about the others you'll have to play the game and get their route. They are all charming to say the least, and very lovable.\\n\\n\r\n[Overall Enjoyment]\\n\r\nHmm, this anime certainly made me smile. It has some fan service here and there but coming from a company that made an R-18 game, it's understandable. It's one of those anime where in the end you feel like you want to watch more. And the game do is there to do just that. \\n\\n\r\nAll in all, i liked this anime and the game. Worth the watch\\n\\n\r\nPlay the game yourself. ;) \\n\r\nI play it for the H-sce-  erhm i mean the story. \\n\r\nHaha, haha, ha...\\n\\n",
            "date": "2016-12-26T08:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 236552,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5412770.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AgentJames",
                "username": "AgentJames"
            },
            "url": "https://myanimelist.net/reviews.php?id=236552"
        },
        {
            "content": "\"i won't dissapear\"\r\nI've seen quitte some slice of life/comedy/romance series but i never expected i would enjoy this one so much! Koi to Senky To chocolate really suprised me in a good way! \r\nStory(8): At first glace the story might seem kind of plain (one of the reasons why i waited so long with watching this series) but right after the first episode it took my interest, which doesn't happen often... \r\nPersonally i think the story was really original! \r\neventhough this serie might seem kind of plain it has it's own way of doing things different than other slice of life anime's which enjoys me.\\n\\n\r\nArt(7): Nothing special, but enjoyable to watch. \\n\\n\r\nSound(7): Sound is good, personally really liked the ED and the insert song in ep 11 if i am correct.  \\n\\n\r\nCharacters(8): This anime has a really diverse cast and finally not a love dense MC. The characters are dealing with their emotional breakdowns in a logical way. I personally really liked Yume who harbors romantical feelings for the mc he made me laugh a lot with his blunt comments! \\n\\n\r\nEnjoyment(8): i would definitly recommend this to people who like slice of life and comedy. I really had a great time watching it! \\n\\n\r\nOverall score: 8",
            "date": "2016-10-19T12:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 232090,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4490149.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Illumine",
                "username": "Illumine"
            },
            "url": "https://myanimelist.net/reviews.php?id=232090"
        },
        {
            "content": "I'm a sucker for romantic comedies and after seeing how many users watched Koi to Senkyo to Chocolate I just had to watch it despite it's somewhat low rating. And to my surprise, I enjoyed this anime. It's based on a visual novel so I knew that with 12 episodes this anime would definitely feel very fast paced and I was right. The main flaw of this anime is just the fact that many details and relationships are really fast forwarded. We get introduced to many different characters and the anime spends maybe 10 minutes on them and we get introduced to another character. \r\nStory:The story is about a school based on a democratic system that students are the ones who make the important decisions regarding budget, security, and etc. It's basically a tiny America within a school. And to go off on that, to put it simple the MC decides to run for president because his club will get shut down if he doesn't. The story premise is nothing out of the ordinary but it definitely is interesting because there are a lot of secrets within the school and as you progress through the story you find out what they are but other than that, I liked the relationship between the characters the most and I believe that is the strong point of this anime but I will discuss that more in the character section.\\n\r\nArt: I'm not a fan of the big eyed character art, in fact I really hate it but the background art and just the setting makes me give this art a 7. The school is really pretty and ignoring the fact that they have big eyes, the art really isn't bad. It's not bad nor is it special in my opinion so I give it a solid 7.\\n\r\nSound: I really like the opening and ending. All the characters sound fine to me and nothing really nags me about the sound so I give it a solid 9.\\n\r\nCharacter: Now the characters are what makes this anime special BUT we only really get to know maybe 2 characters really well in this anime. I enjoyed many of the side characters and wanted to know their whole back story but as I said before it's based on a visual novel so unfortunately they can only do so much in 12 episodes. \\n\r\nOverall this anime isn't anything too special. If you like romance and a good ending this this anime is for you. Although I'm sad that they didn't make this anime adaptation follow the best girl route I still enjoyed it. It's a solid anime but no more than that.",
            "date": "2017-08-20T11:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 255882,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6462984.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DrYumYum",
                "username": "DrYumYum"
            },
            "url": "https://myanimelist.net/reviews.php?id=255882"
        },
        {
            "content": "Alright guys, this is gonna be the first review i've ever done, but here we go!\r\nStory: The story and the plot was really good, it actually surprised me that it was this good, because my expectations were actually a bit low. The anime in itself is about a couple of students trying to save their beloved club. Their \"Food club\" was going to be disbanded because they didn't get any achievements done and therefor wasted the schoolfunds. Oojima Yuuki and his friends wants to prevent this from happening, so they decide to enter the school president election.\r\nComing this far into the plot i just thoughtit was gonna be your average typical school/slice of life anime, but boy i was wrong! When the drama kicked in i got so hooked and excited i almost fell out my chair. I wont spoil anything from here, but you will understand me after you watch it. The drama is so intense, and filled with emotions. I marathoned the entire thing, spent an entire day watching all of the episodes because of this. It's been a long time since an anime got me on the hook like this. It's really something special, and differs a bit from other animes(Atleast what i can tell from my experience).\\n\\n\r\n Summing it up, the story is really really awesome and truly admirable, and if you ask me, it has a lot of aspects for those who enjoy romane/drama. But give it a few episodes, because it starts kinda sloppy. Trust me, it's worth it.\\n\\n\r\nCharacters: The character development was really something. the character background was really good. Yuuki and his childhood friend Chisato go back to a certain accident that kinda traumatized Chisato, i wont go further than that. A bit of a dark past, and it's really something to see them develop through the show, and how they get past all these obstacles to find harmony. As for the other characters, there's quite a detailed background for most of them, but not as much as with Yuuki and Chisato. \\n\\n\r\nWith all the mixed characters that has so different personalities i really think you will enjoy getting yourself indulged in all of it, there's even a pentako, extra cuteness points!\\n\\n\r\nArt: Well i'm not an expert, but i thought the animation was good, i felt like i didn't need to get used to it, because some animes requires that you get used to the not so good animation, well it depends on how you like it. But i enjoyed it and it felt like it didn't need many improvements at all.\\n\\n\r\nSound: I liked it, the voice actors were good, the sound effects on certain objects were completely in sync and sounded cool, and the interaction between characters had no sound problem at all(referring to when someone for example grabbes another person or such.)\\n\\n\r\nEnjoyment/Overall: This anime is really underrated, i dont understand why, because i loved it. This anime is definetly one of my favorites, it had many things i look for in an anime. It had a lot of romance, and when you combine that with the drama, it's really intense and really interesting. As i said before, i haven't been this excited about an anime for a long time, so i really hope you take your time and watch it.\\n\\n\r\nWell that about concludes my review, i hope you found it helpful and i also hope you enjoy this anime. thanks for reading!\\n\\n",
            "date": "2015-07-09T17:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 192836,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4414789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mroriginal",
                "username": "Mroriginal"
            },
            "url": "https://myanimelist.net/reviews.php?id=192836"
        },
        {
            "content": "Please don't judge this anime by it's cover or first 2 episodes. At the beginning, this anime seemed to be a typical boring slice of life anime with a stupid plot, but actually turned out to be an interesting show to the point I felt the need to right this review. Reason I write reviews is for the people out there like me who are indecisive about starting a show and wasting 4 hours of their lives without knowing the potential of whether it's good or not because ratings can be deceiving. Well let me tell you, it's not a bad show, very different thanany other school drama, and in my honest opinion worth a watch. I'm surprised no one compared this to an anime version or House of Cards. It's basically the political aspect of the show with a lighter anime tone to it. My only wish was that the ending was a little more fulfilling I guess? is the best way I could put it, but that's just me personally.",
            "date": "2015-11-22T02:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 203926,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ExilixE",
                "username": "ExilixE"
            },
            "url": "https://myanimelist.net/reviews.php?id=203926"
        },
        {
            "content": "TL;DR Koi to Senkyo to Chocolate, just as scatterbrained the titles is, the anime proves to be just as unrefined and broken. \r\nStory: 3\r\nLove, Elections, Chocolate tackles each subject in one one way shape or form. \r\nLove appears as how the female characters discover their feelings for the main character. However, like any anime derived from a \"route\" system, none of the girls ever are fleshed out in their entirety. This has come to be expected from a 12 episode series but even with the episode restriction, the plot and interrelations come off as convoluted and unwarranted. While for a choice few main characters, itis hard to pinpoint why Oojima is a likeable person besides him being shown as caring, charismatic, and driven by his ideals. As a show that attempts to take itself seriously, Oojima's appeal does not make itself apparent with each girl and as a result makes it difficult to be emotionally invested into the character. Many shows can make the main character appear to be powerful and attractive beyond belief as the reason for their harem, but as a show with an emphasis on the character's believable personalities, the show definitely falls short.\\n\\n\r\nThe short's elections element is proven to be interesting and unique to separate this show from the pack. The elections and its backstory try to emulate real political strife with underhanded tactics within a show focusing on a boy scoring quite a few ladies. Here, Koi to Senkyo to Chocolate is just as laughable as it sounds in that regard, with the dark tones and gritty story failing to leave an impact on the audience if we see the main character both trying to stop the corruption within the student governing body as well as make more ladies that he can count fall for him. Not to say that a innocent looking show cannot exemplify dark or more mature themes but the manner in which Koi to Senkyo to Chocolate does this is poor at best.\\n\\n\r\nFinally Chocolate is meant to display Oojima's relationship with Sumiyoshi (Chisato) and how he tackles his identity and relationship with her throughout the story. Cliche as it is, I felt that this portion of the story was honest and quite well done comparative to the rest of the story. It is a shame that some of the gem within the anime were overshadowed by the comically bad mis-mash of story arcs.\\n\\n\r\nArt: 7\\n\\n\r\nAIC build produces yet another well made artwork reminiscent of what they had produced in Oreimo and Haganai. Although the art was well done, it was uninspired and unoriginal with no redeeming value besides aesthetic. I cannot distinguish this anime for many others I have seen which is not helping in Koi to Senkyo to Chocolate's case in becoming an anime that breaks the norm.\\n\\n\r\nSound: 6\\n\\n\r\nThe ambient soundtrack proves to be fitting and true to the scene with nothing appearing out of place. The lyrical portions sang during emotional events in the story were able to pull heartstrings however briefly before they appeared forgettable. Many of the failings in the sound department were due to the joke of a storyline, for which it sadly takes damage for. \\n\\n\r\nCharacters: 5\\n\\n\r\nCharacter Archetypes are cliche as your usual harem style anime. \\n\\n\r\nOojima is remarkably adept and self aware but his role in the story makes him appear jarring as his switches from one female character route to another. I can however speak to his integrity as a character, which proves above average for the usual male main character.\\n\\n\r\nOn the other hand the female characters all are predictable and overdone, coming at exactly face value. What you see is what you get.\\n\\n\r\nSumiyoshi, Chisato: Needy Childhood Friend who faces the future of her relationship with main character\\n\\n\r\nShinonome, Satsuki: Proud Confident President to be \\n\\n\r\nMorishita, Michiru: Standard Moe Character who has an edgy streak\\n\\n\r\nKiba, Mifuyu: Strong silent type who struggles with her feelings\\n\\n\r\nShinonome, Hazuki: Drunk and wild teacher (A teacher we never had growing up)\\n\\n\r\nAomi, Isara: Kind girl with a golden heart.\\n\\n\r\nIf character can be described so easily in an anime where the story tries to be serious, your characters have failed to be immersive and make it even harder to empathize with when they only have one memorable trait.\\n\\n\r\nEnjoyment: 4\\n\\n\r\nHonestly speaking, quite awful. I feel that if either the story chose to be a gritty school government thriller (hard to do but can be pulled off) or a usual school harem, it would have been a good anime. Nothing likely to rise to greatness but would definitely make it a diamond in the rough. The story, characters, and media translation all had a few positive points, but they were barely enough to keep me watching, much less entertained.\\n\\n\r\nOverall: 5\\n\\n\r\nKoi to Senkyo to Chocolate is a story that tries to have it all, but in the end has nothing. If you choose to watch this anime, try to take the story as seriously as you can (and hold in the laughs when the tension becomes comical) and try to enjoy the few things it gets right. If you expectations are not held too high, the lovable nature of the food research club and its many members begin to rub off on you, and you cannot help to have a good time.\\n\\n\r\nRecommended?: No\\n\\n\r\nRewatched?: No\\n\\n",
            "date": "2016-08-19T19:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 227162,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3558581.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DatOneUser",
                "username": "DatOneUser"
            },
            "url": "https://myanimelist.net/reviews.php?id=227162"
        },
        {
            "content": "Koi to Senkyo to Chocolate is a harem anime, happens in a crazy big school and could be better.\r\nGood...\r\nSome good characters, fun in most part of time.\r\nBut...\r\n Weak Plot , dramatic and unnecessary situations.\r\nAnd...\r\nThe author tries to make the whole situation bigger than that really is, by placing exaggerated (and unnecessary) dramatic factors. The dramatic situations simply do not work in most part of time. To be honest, works for me only once. Some characters are complexed without a good motives, or a really small motives, that are not enough to justify all this drama.\r\n If were just one more harem ecchi romance, would bebetter. Some good situations and characters were wasted.\\n\\n\r\nKoi to Senkyo to Chocolate isn't terrible. In the end, its funnny. \\n",
            "date": "2017-04-06T19:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 244888,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6143489.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MasterDio",
                "username": "MasterDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=244888"
        },
        {
            "content": "I really really love this anime it's ben 5 months since i finished it but could never forget about it\r\nstill missing it alot the story was 10/10 art 10/10 characters 10/10 romance is 10/10 in my opinion for me better than sakurasou or \r\nangel beats and other animes\r\nI watched the same episode over and over and over again that's how much i loved it still pretty sad that they won't make a season 2 my number 1 favourite I highly recommend it for people who love emotional animes since it really is emotional.\r\nbad sides:in the end it get's too emotional too like too much andthan you'll probably be sad that it ended that's what i did atleast",
            "date": "2017-02-28T14:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 241607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5988637.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlpTheKiddoPlays",
                "username": "AlpTheKiddoPlays"
            },
            "url": "https://myanimelist.net/reviews.php?id=241607"
        },
        {
            "content": "I'm just going to start off by saying that this series, Love, Elections and Chocolate, is fairly underwhelming. I actually came in with normal romance expectations and came out a bit disappointed. I wasn't... satisfied. This series started off on a great note; Good characters, a somewhat unique twist on the slice of life genre, and some good and light-hearted comedy mixed in there. I'd say starting around episode 10 is where it started to go downhill for me. Things were starting to get extremely ridiculous, to the point where I began feeling stressed out with this show because of what it was doing. Or,I should say, what the characters were doing. \\n\r\nStory: 7\\n\r\nLove, Elections and Chocolate is about a club named the Food Research Club who's activities involve eating snacks, such as Yaoi Sticks. Enter main character, Oojima Yuuki. Not to be mistaken with Ooshima, Yuuki and his childhood friend, Chisato, are part of this Food Research Club, and devastating news arises as they learn that with the new presidential election for the Student Council, one candidate is deciding to cut the Food Research Club due to funds and pointless activities. Yuuki and the others will not stand for this! Thus, Yuuki is chosen by the clubs to run as Student Council President himself for the sole purpose of avoiding the loss of the Food Research Club. There you have it. \\n\r\nNow, I have no issue with the basis of the plot whatsoever. None at all. I do have an issue, though, with how this election is portrayed. Understand that this is a Student Council Presidential Election, not an actual presidential election for the entire country. Students are running everything, only one teacher is in sight and she's a drunkard who slobs around in the Food Research Club all day! What could possibly happen? Apparently, students and the student council have much, MUCH more power than you'd expect. This gets to the point where it's extremely ridiculous and kind of, well, stupid. Things like espionage, \"Governmental\" cover-ups on events that could negatively effect the president's campaign and impression, or even death threats involving hostages. Yes, this presidential campaign is taken to the extreme, despite the fact that it's all for the mere student council. \\n\r\nThis may make the show sound more exciting... but it's honestly not. Actually, it's more aggravating than anything. Why do the students have so much power over everything? Why are they the security for a hospital, believing they can control what nurses can and can't do there? Why didn't the main character call the police when a certain someone is taken hostage and he's being threatened with death by said kidnapper? The student council doesn't control the police too, right? Right? It's not like calling the police won't work on them because the student council has more power, and what they're doing isn't illegal, right? It's just... stupid. Why is it taken to such extremes and why isn't the police called when you can easily fix everything by doing so? It bothered me to the point where I just really didn't care what happened with the election anymore. I just wanted to see the romance, which in itself wasn't too satisfying either. There's almost no closure in the end whatsoever. It just kind of... ends. I can't say how it ends, obviously, but I'll tell you right now it was barely satisfying. And I'm all for romance, too! Romance is one of my favorite genres! This show was great until the end. Really that's all I should have said. I have too many complaints about how ridiculous the measures taken in this story was. Let's move on. \\n\r\nArt: 9\\n\r\nThe animation was great and the art style was extremely appealing. Honestly, the art is one of my favorite aspects of the show. It's smooth and detailed nicely. Emotional scenes, although there aren't many, are emphasized as they should be. Other than that there isn't much to say about it. \\n\r\nSound: 8\\n\r\nNot really much to say here, either. The soundtrack was nice and fit well. I like cello and piano. It's a nice mix. Didn't care for the opening or ending, though, as they were kind of... bland. The main character's voice actor did an outstanding job, though, as he always does. (He's very recognizable... he did Kyousuke in Oreimo, Gray in Fairy Tail, and so on and so forth. He's great. That's all you need to know.) \\n\r\nCharacter: 9 \\n\r\nThis is one of the better aspects of the series. As you get a group of characters together for the main cast, you'd at least hope they're all enjoyable. Really the only character I can point out is the main one, Oojima. He's not painfully dense, and he doesn't show a hint of denseness whatsoever. He actually shows romantic interest in certain girls and actually takes the chances he can get to get closer to them. He's not afraid to confront certain characters on issues, and he knows exactly what's wrong. He slapped a girl once and yelled at her about a certain issue. That was refreshing. \\n\r\nThe other characters range from fun to bland. The main love interest was cursed by trauma, afraid to eat chocolate and very attached to Oojima. I didn't really care for her, she didn't really have anything interesting going for her. Honestly, I liked Satsuki more, who was a rival candidate against Oojima. He spends a lot of time with her and her character development is much better than Chisato, who was the main love interest. \\n\r\nEnjoyment: 7\\n\r\nYou already know my woes with the storyline. The extreme measures that are taken and the stupid choices the main character makes near the end. (Seriously man, get the damned police!) Though, for the first 9 and a half episodes I really enjoyed this series. The ending was O.K. but it needed more. I won't be watching the OVA seeing as it most likely doesn't continue the story and I didn't enjoy the series enough to really care for the OVA. I'd say to just try it out. If you don't like it, fine. I want to tell you now, don't expect anything amazing. Don't expect the following; \\n\r\nEmotional drama that is complicated (In a good way) and done very well as seen in shows like Toradora, The Pet Girl of Sakurasou, Golden Time, Honey and Clover, Hell, even Waiting in the Summer! I understand those are all J.C. Staff and this is not, but they've basically set my standards for romances like this. And I have seen great romances that meet their levels by other companies, but J.C. Staff still does it best. \\n\r\nDon't expect anything hilarious either. The humor is good but nothing more and nothing less. \\n\\n\r\nAgain, just give it a shot. If you don't like it, fine by me. It honestly wasn't really worth watching, in my opinion, but I suppose I had a good time... most of the time. I am disappointed, but it certainly was a... different, experience and twist on the romantic comedy genre.",
            "date": "2014-05-15T19:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 143413,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3671701.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hime-In-A-Box",
                "username": "Hime-In-A-Box"
            },
            "url": "https://myanimelist.net/reviews.php?id=143413"
        },
        {
            "content": "Now this is going to be my biased view of the anime after watching it, and then playing the Visual Novel in the Chisato and Satsuki Route. (!Possible Spoilers!)\r\nNow this review is not going to be long. The anime is good, compared to other Romance Anime, this one actually reminds me of Golden Time. The Art was OK, I'm not an art expert, so take that with a grain of salt. The Sound was also OK, but I'm also not a sound/music expert. All the music fit in fine to me. \r\nThe story is great. Romance, and an election. Kudos to the writer that pulledthis off. But this does not mean I agree with the story specifically in the anime. The anime was basically a mixture of the Satsuki Route in the beginning of the anime, and then it uses the Chisato route in the end of the anime. This confused me and I really hated that since they started off with Satsuki route (Best Grill).\\n\\n\r\nNow this is where I get mad. This is actually one of the few anime that adopt the Childhood Friend Route of the Visual Novel. But, I HATE Chisato. She has some sort of Physiological issues. After playing the VN, I can only support this claim more. If some of you were like me, and wanted a Yuuki x Satsuki, I highly recommend you play the Visual Novel.\\n\\n\r\nTL;DR: All in all the Anime Adaption was good, 6/10 for sure. I didn't like how they used the Satsuki route in the beginning of the anime, and ended with the Chisato Route. Chisato has some obvious issues. If the anime issues the Satsuki Route, 8/10 for sure!",
            "date": "2016-04-05T18:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 215620,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4474278.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Spinder5",
                "username": "Spinder5"
            },
            "url": "https://myanimelist.net/reviews.php?id=215620"
        }
    ],
    [
        {
            "content": "If you've watched this, I recommend watching Ao no Kanata 4 rhythm as well.  Both were written by Sprite.  And both are fairly enjoyable.\r\nNow, Koi to Senkyo to Chocolate, a.k.a Love, elections and chocolate.  As the title suggests, all three things are involved in this show.  But they all seem to conflict each other.  There is no love in politics, and it's definitely not sweet. (Unless it's dark chocolate). So how can this work?  \r\nVery simply, it's an adaptation of a VN, so it will work itself out somehow.  And trust me, IT works.  I'm about towatch it again, for the 4th time.\\n\\n\r\nStory.  THERE IS A PLOT!!!  And no, not \"plot\".  You can actually take this show seriously and still enjoy it as much as you want.  It has quite an original plot despite it's insanely common setting, a high school.  What do you do when something precious to you is about to be taken away from your everyday life?  Naturally, you'd fight and protect it as much as you can.  And following the anime tradition, this show does not hesitate.  And the drama involved definitely enhances this show a lot.  And there is something for everyone in this show.\\n\\n\r\nArt.  Fairly simple, but effective.  Not like moe or Love Live like.  Just simple.  Kinda like SAO, but simpler.\\n\\n\r\nSound.  If you've read my Ao no Kanata review, then it'll be more or less the same.  This show was adapted from a VN, and naturally, it would re-use its osts from the VN itself.  And there's no problem.  It has heart-breaking osts, cheerful osts, calm but happy ones.  The lot.  (Annoyingly, they don't exist any more on Youtube)\\n\\n\r\nCharacters.  Again, very VN tradition.  The childhood friend with a scar, the one out of your reach by will some how make its way, the quiet one and the friendly one.  I like them all.  But they're not very memorable characters, which is a bit disappointing.  Like, when you watch it, you will have your favourite, but when you finish the show, they tend to fade away.  Other than that, they are very unique and well designed characters.  \\n\\n\r\nEnjoyment.  Very enjoyable, but it's like a B-list / C-list celebrity.  You know they exist, they are very good actors/ actresses, but no matter how they try, they can't jump out of that pool.  That's what this show is like.  Maybe it has something with the plot/characters/art.  I don't know.  But it will be the best show in its class.\\n\r\nYou can compare this with, maybe Nisekoi, but ultimately, Nisekoi is the A-list celeb, so that will get noticed before this does.  But if you comapre this to like, maybe Rakudai Kishi, then it stands a chance in being the superior anime.  (In terms of plot, not \"plot\")\\n\r\nAnd again, this show can be taken seriously or light-heartedly, which is one reasons why I love this show.\\n\\n\r\nOverall, it is possibly the best VN adapted anime in its class.  Very cool plot, fair art, fantastic sound, great characters and very good fun.  And I would recommend people to watch it.  And thankfully, it does have a happy ending!\\n\\n\r\nAnd do give Ao no Kanata 4 rhythm a go if you've watched/finished this show.  They are somewhat similar to an extent.",
            "date": "2016-04-02T05:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 215163,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3806395.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Conor_Styles",
                "username": "Conor_Styles"
            },
            "url": "https://myanimelist.net/reviews.php?id=215163"
        },
        {
            "content": "Koi no Senkyo to Chocolate This review may contain spoilers Anime score: 6\r\nI don’t write any reviews whether the anime was bad or great, but this anime was so average and it could have been better that I wanted to tell everyone my thoughts. So how can I talk about this anime, well one thing is that the anime is exactly as what you would expect from a romance, drama school life anime. Obvious love with the two main characters obvious melodrama and all that other shit. This anime was so far so good from episode 1, it made me think that this anime wouldn’tbe so bad, but was I so wrong. From episode 6 to episode 8 this anime fell flat, not flat like falling to the floor flat on its face but Blanc’s washboard chest flat. It had many moments that should have just been skipped over, leaving a dry taste on your mouth as thanks to the, oh so fast way it went to end all the problems. \\n\\n\r\nThe story is very simple two childhood friends who have feelings for each other but some traumatic indecent is stopping them from realizing it. With a lot of side characters that are constantly around the main characters, but have had some episodes to explain more about their stories, but the producers decided that that was unessacary and just put stupid and unessacry episodes only developing them slightly. Many of the characters including the main and the side characters with not much of character development made me want to bitch slap most of them majority of the time. \\n\\n\r\nThis anime story was so simple and could have been done easily, but they had to include complex and dark sinister plots into it. This anime includes the Prison School: School problems in it with the common happy fun times atmosphere. A school, where scandals, shady people and bargains and the crazy committees in this school group up. \\n\\n\r\nThis anime tries too hard to make it seem like under all the happy daily school life is dark and dangerous activates are happening. Well this anime fails at it, in fact the anime does it so poorly that I no longer cared who was on the bad side or who was good all I cared about is Oojima is running for student council president. The opening was good as well as the ending. One of the reasons the anime fell flat was because it was trying to juggle with two main plots while it added another plot to it making it hard for them to balance it all out. One was Oojima running for student council president to save his club, and the relationship and tensions between Oojima and Chisato and the third was the fight between the student council committees. The anime was doing well  until this third plot came in and became another main plot, then the anime started to fall apart. It couldn’t handle it so they had to end the first and third plot as soon as possible, which made the plot with their relationship also fall apart. In fact it made the anime very bland and uninteresting. So yea pretty much this anime falls flat on its face due to the unessaceary plots and development.  \\n",
            "date": "2015-12-15T18:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 205656,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1474161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/suigintou101",
                "username": "suigintou101"
            },
            "url": "https://myanimelist.net/reviews.php?id=205656"
        },
        {
            "content": "Ah yes, another one of those super amazing fancy rich schools that japan seems to be absolutely overflowing in, at least according to their anime/manga directors.\r\nSo, the direction of this story is.. DUH DUH DUH, love, or rather several different loves, for one guy... YES A HAREM, HOW AMAZINGLY FANTASTIC, o but wait, you see this harem is different, the lucky and wonderful young man who is in the center of this harem, has actually.. ALREADY CHOSEN A GIRL, but, a big but, the girl in question has some deep and personal issues, so indeed the plot does thicken!\r\nI'm not going to bother writing whatthis anime is about, if you want to know that read the synopsis, I am simply going to express my feel towards this anime and its delights, or rather its non-delights, quite possibly both actually.\\n\\n\r\nSo, in short, there are these 5 or 6 sets of boobs, chasing after this boy (note when i say boobs i mean unrealistic sized chests formed by our completely un-perverted and totally not desperate Japanese editors), Now there is obviously, a special pair of boobs amongst the other boobs, that has the boys attention more than anything, but like i said due to some hard and totally unpredictable circumstance, the boobs in question are not treating the boy as wishes to be treated (personally i think he was just being picky).\\n\\n\r\nSo anyway that is it, that is the story, their is some other side school election and borderline politics crap which does not even remotely render as being anything interesting nor realistic, but then I suppose the reason your watching anime is so you can ponder what life would of been like it had been run by these super amazing rich kids who do little naughty things like run people over because they caught someone taking pictures of them acting all fishy like.... please give me a break.\\n\\n\r\nSo please do pick this anime up, if you feel that your IQ isn't low enough, I'm sure this anime will help.",
            "date": "2013-02-04T09:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 85813,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373255.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lithik",
                "username": "Lithik"
            },
            "url": "https://myanimelist.net/reviews.php?id=85813"
        },
        {
            "content": "This anime is by no means a godsend, but, it ain't a waste of time. I'll give you the rundown.\r\nIt has so much going on all at once, in fact, I would argue too much going on. They rushed a 24-26 ep anime into 12 episodes. All the romance and drama elements were done extremely well, but they didn't have enough time to formulate. Also, they created too many \"potential\" love interests. It was like they wanted it to have the sense of a harem but it was clearly not happening. There were too many tragic backstories in too short a period of time.I'll reiterate, the characters are well designed and their stories worth telling but the stories are all chucked in the middle of the anime and are half-forgotten by the time the main story is put into action. This could've been much better if given more time to actually appreciate each individual character and their depth. I will say that the way the tied together many of their backstories into what was going on was pretty well done but AGAIN, NEEDS MORE TIME.\\n\\n\r\nTL;DR Characters and Story have depth and are done well but aren't given enough time to fully develop.",
            "date": "2018-10-06T21:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 291098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ExEbba",
                "username": "ExEbba"
            },
            "url": "https://myanimelist.net/reviews.php?id=291098"
        },
        {
            "content": "This is not anime that will set the world on fire. This is actually more of an anime that you watch to broaden your reference base. That 7.3 composite score should be an indicator of that. Figure out what you like or what you don't like. It's a filler show. Not every anime can be a Soul Eater or a Fullmetal Alchemist or a Familiar of Zero, a game-changer. \r\nLet me start with the characters:\r\nThe main guy: Yuki Ojima is nothing special. He runs because he wants to keep his club from being shut down. Along the way, he learns some stuff, yadah, yadah, yadah.\r\nThemain girl: Chisato. Best friends since childhood with Ojima. Are you seeing anything familiar?\\n\r\nThe rest of the club fills out archetypes. You've got your small girl and your brainiac. (Who happen to be the same character.) The duo of comic relief. The older-sister type. The weirdo. The 'proper lady' who happens to be Ojima's running rival. The teacher that dotes on our main character. Etc.\\n\\n\r\nYou're wondering why I gave the characters a 9 when they're all so generic. Because they strike a chord and resonant with the audience. It's the archetypes in motion as they're supposed to be done. Done well, and they can be satisfying to watch, even for a short span of 12 episodes. But the main engine is the interpersonal relationship between Chisato and Ojima, and well, you have to watch the show because if I were to say here, it would ruin the impact.\\n\\n\r\nThe weakest element of this show is the story. It's not a very strong premise, but there are no loose ends. The sound is okay. \\n\\n\r\nMoving onto the animation...clearly there must have been a very small, very dedicated group of animators working on this show because while each frame individually looks gorgeous and well put together, the actual motion is disjointed. Often times, the only motion will be lip-flaps. But since this show isn't a big-budget action anime, it can get away with it. It's a unique characteristic of this show that I've never seen before. Good frames, lousy animation.",
            "date": "2016-09-03T19:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 228240,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208224.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnotherStatsGuy",
                "username": "AnotherStatsGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=228240"
        },
        {
            "content": "What I thought I was watching was mediocre rom com where a guy does something to save their club and his friends along with it... But then.. I'll just tell you in the review so here we go..\r\nStory 8/10: So this 'rom com, slice of life' series ended up turning into an Illuminati series of some sort to the end. I got very confused at some points in the series.. My main questions were like \"Why are they going through all this just so save a club where you taste food for fun? Why would anyone vote for these guys? When did this become soconfusing? It's looking like a james bond movie now? Where the hell did this person come from and who is he/she?\" Towards the end was like playing a game which you've never played before and no one's explained the rules.. You never know what's going to happen. All together I thought the plot was good.. even though they were trying to save a food tasting club I still followed with it and still enjoyed it. I can see why they'd want to save a club.. But a food tasting one? Who am I to judge right? Even though the plot got messy at sometimes I still found it enjoyable all together.\\n\\n\r\nArt 9/10: I enjoy art styles like these in animes and didn't really find anything that stood out as to painfully obvious to judge.\\n\\n\r\nSound 9/10: Music and sound seemed to be in the right place and it all sounded good together.\\n\\n\r\nCharacter 9/10: I enjoyed these characters alot better than some of the other ones.. There wasn't constant arm waving at embarrassing/romantic moments, the MC wasn't to awkward with females, He even could of had a great harem.. Maybe one day >:) Overall characters were really fun to watch as it carried on.. I didn't really care much for their backstories as they seemed generic at sometimes though.\\n\\n\r\nEnjoyment 8/10: Enjoyed the series and would watch again.. I enjoyed some parts a little to much and it was a really nice watch altogether",
            "date": "2018-03-30T18:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 275811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7073275.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RainbowSlowmo",
                "username": "RainbowSlowmo"
            },
            "url": "https://myanimelist.net/reviews.php?id=275811"
        },
        {
            "content": "Takafuji Private Academy is a huge school, it has prodigious students and ton of clubs as places for students to expand their hobbies and skills. No need to doubt there must be some clubs with lazy members in it, rarely to join event nor participate in everyday club activities. Then, here is Food Research Club/FRC (食品研究部), abbreviated to Shokken (ショッケン), as concern of the story. The members of FRC do nothing but only slacking off even if it gets fund given by the school. This FRC is threatened by the next strong candidate of student council president whose proposes to eradicate certain unbeneficial clubs ifshe get elected. Therefore, Yuuki Oojima, our hero who doesn't want his club to get wiped out, makes a move to stand as opponent of this next candidate, Satsuki Shinonome, in the election. What kind of battle they will have there? There are some tainted-truths concealed behind the election. It isn't just a plain election...\\n\\n\\n\r\n    With such potential by its 12 eps, the anime was worth watching than few other anime series with the same genres. It might sounds weird how come the school life anime series like KoiChoco can turn into an amusing story if its compared with other common school life animes. KoiChoco involves some politic aspects, it made us explore the fight of characters in the election. Begins from a simple-minded intention to only keep the club running and able to get budget, a penny-in-line wish paves the way to intrigue behind the election. That's how the show captivated audience.\\n\\n\r\n    Eventhough I mentioned politic aspects before, the show won't make us suffer from serious actions related to pure political activity. Tricky characters do their job perfectly for the show. KoiChoco doesn't focus on election only but the relationship amongst them too. The election problem still keep on track with the plot to reinforce each characters bond one to another. Since there are few characters, on the top of that minor characters appear quite much, the development characters weren't felt much better than the major characters itself. Their emotions are involved, such as love, discomfort, fear, and concern, but with less development.\\n\\n\r\n    I like bright colour and soft shading and the line, it's quite thinner and made characters movement looks more flexible. Overall, this show had good visualization, it's more than just decent. You can love its art, feel the depth of beauty from its intensifying colours. I attached to this show in the first place because of its visualization then fell in love with its story.\\n\\n\r\n    One of my favorite parts of KoiChoco is its music, includes the theme songs, insert songs, and compatible seiyuu. Annabel is sung the OP theme, Signal Graph (シグナルグラフ). It has melodious tone, its soothing tones are sweet, as well as the ED theme Kaze no Naka no Primrose (風のなかのプリムローズ) by Ceui. I can enjoy my supper with these two as backsound of my deserted time.\\n\\n\r\n​\\n\r\nPros:\\n\r\nNice visualization, match with its seiyuu. Nice combooo~\\n\r\nStory is worth to watch omnomnom\\n\\n\r\nCons:\\n\r\nin-depth development (for characters) needed",
            "date": "2016-07-05T15:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 223236,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=223236"
        },
        {
            "content": "First off this anime has a very unique story in my opinion. Like usually in a typical romance anime they waste  episodes on some useless stuff. This anime really put the 12 episodes they got to good use and strung them together well, to make a fantastic romance anime. Like I just love this different kind of story and the love story is just amazing. They also have very good suspenseful parts in the anime too!\r\nNext, the characters are great in this anime. Like the girls that he is around aren't annoying and i really like all them. The girls are kinda funny attimes and they all have some unique traits. Then the main guy character isnt just some pervert or annoying guy. He has a wonderful personality and he is really sweet/caring. Then he has a few funny moments as well and i just really like the male protagonist.\\n\\n\r\nThen the art work and sound of the story are both superb. In my opinion the art of a romance anime is pretty important and the sound that is played is great.\\n\\n\r\nIn the end i really enjoyed this anime and it has became one of my favorites. If you like romance anime's and want a REALLY GOOD LOVE STORY then i really suggest you pick this one up. It has different aspects then a usual love story and i really liked it!!",
            "date": "2013-04-19T17:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 94287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/370740.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zzSorazz",
                "username": "zzSorazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=94287"
        },
        {
            "content": "overall i hated this anime.  aat first i thought chisato was going to be nice and all since she looked to pretty but after the first minute of hearing her voice. god it was the most annoying voice ive ever heard in an anime. all she was was an attention seeker. we all  knew from  the begginning that oojima was going to end up with her seriously did they have to make her this bad??!! im so disapointed i even gave up before the last episode it really boring and disapointing! i love shoujo and romantic anime but this! youve got tobe kidding me! id wish hed ended up with at least a sweeter girl! all the girls we so nice and sweet except chisato.  if youre thinking in watching this anime . then think again. i love girls that have long hair and end up with the cute guy but chisato has to be one of the most annoying ones. im sorry for all those people wo pity for chisato i honestly dont like her one bit.",
            "date": "2015-05-24T13:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 188722,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4579659.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xx_nekochan_xx",
                "username": "xx_nekochan_xx"
            },
            "url": "https://myanimelist.net/reviews.php?id=188722"
        },
        {
            "content": "Harem adaptations are inherently difficult endeavours. Especially when one needs to squeeze 4-5 haremettes into 13 episodes while managing a coherent plot. To get around the limited airtime, many series either focus on the individual haremette's tale making the show an character omnibus of sorts with a weak or non-existent central plot; or drive the story with the key conflict in the harem but in so, sacrificing much of the remaining cast. Both routes resulted in their share of rotting carcasses littered in the memory of harem history. Which was why I was so delighted to have stumbled upon KoiChoco.\r\nThe premise of KoiChoco is, unsurprisingly,the election which surprisingly grew with importance as the series progressed. While this would have crowded out the 'romance' aspect in a lesser harem show, KoiChoco rises above other harem pretenders with excellent amalgamation of the central plot (election) with consistent character growth for almost all the haremettes. Such symbiosis of plot and character development allows for the simultaneous development of story and character giving the series a shot at a satisfactory closure for all story fronts. And KoiChoco is one such example of symbiotic writing.\\n\\n\r\nI came away marveling at how the key characters matured, overcame their romantic hurdles and generally became stronger/wiser people because of the election. The primary romance was also not comprised of the run-of-the-mill \"She loves you/he loves you not\" haremic-filibusters but a multi-faceted relationship with a tinge of darker elements. Despite juggling all that, I love how coherently the series was wrapped when the final credits rolled; even though it had become somewhat predictable - a small kink in an otherwise masterful storytelling.\\n\\n\r\nIn conclusion, borrowing from the dessert reference in its title, KoiChoco is like a well-made fruitcake where the individual ingredients meld together to give an exquisite taste that is greater than the sum of its parts. A true gem amongst harem offerings.",
            "date": "2013-05-04T02:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 95907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/13315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stripey",
                "username": "Stripey"
            },
            "url": "https://myanimelist.net/reviews.php?id=95907"
        },
        {
            "content": "Koi to Senkyo to Chocolate at first glance is a typical harem, romance, school and slice of life. Don't be deceived by it's cover. The anime is pretty deep. It focuses on psychological scars of the main characters, deception and the hardships that you go through as an officer of a whole small nation.\r\nThe character development is really not the best in this show but the way they interact with each other is vivid. Compare it to real life and the results show that they look identical.\r\nThe music is great, on comedic/relaxing scenes, a smooth violin melody brightens up the mood. While in depression/unnerving scenesit applies distortion of music and sometimes bass, it helps you immerse yourself as you were in the event.\\n\\n\r\nThe plot, and the characters are very memorable, and I really enjoyed it. 8.5/10\\n\\n\r\nI don't know about you but if you like Romance, Mystery and change of events or any of the three, I definitely recommend the show to you",
            "date": "2014-08-16T03:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 156743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Zaeros",
                "username": "Zaeros"
            },
            "url": "https://myanimelist.net/reviews.php?id=156743"
        },
        {
            "content": "Auu~ this anime started off, as any other, without any greater commitment to any of the characters from the aspect of the viewer, such as myself, but in time grew to become something that enclosed my very soul into its plot and evolution of characteristics!\r\nWhen the actual plot started to finally kick in, after many a doubtfull moment of sadness, bitterness, doubt, and a faint whim of hopelessness, the sun started to dawn upon my heart as it started to turn in the totally right direction! ^^,\r\nThe more the series strived toward its final climax the more I started to recognize Yosuga no Sora withinthe main characters and their daily struggles.\\n\r\nOh, how it pushed down on my heart like a hammer when I realized that Chisato-chan was the very same as poor Sora-chan except the sibling part. Auu~ everything started to come back to me, all the tragedy, the drama, the feelings of defeat, and all the tears that once flooded my eyes and drowned my heart caused by the broken heart of Sora-chan returned to me in the most brisk of moments when I started to see Chisato-chan and Sora-chans connection! >__",
            "date": "2013-04-09T15:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 93209,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1743227.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Silendris",
                "username": "Silendris"
            },
            "url": "https://myanimelist.net/reviews.php?id=93209"
        },
        {
            "content": "So what can be expected from this show you may ask?\r\nThe title sums it up pretty well;\r\nThere's Love/Romance and the conflict that comes with that. Don't worry, there isn't a lot of stupid harem drama here. The MC is kinda bland so it;'s hard to get behind the girls since it's hard to see what they see in this guy though. Thankfully you do see the relationship Yuuki (MC) and the girl he does pick in the end develops through the show.  Still, there's nothing too special about the love story here itself. Through the harem routes  in this show you also getdevelopment for the different characters you probably would not have gotten otherwise which is kind of rare, and a big plus. The love drama is made even more complex/ intriguing as it's mixed in with the show's central conflict: SENKYO!\\n\\n\r\nElection:\\n\\n\r\nSo I'm sure you saw that this show has \"Election\" in it's title and if you read the synopsis you'd know that there is, indeed, an election in this show, and it is the central driving force for most of the show's conflicts.  This is also the area where the show surprised me the most. Going into this show, I was just expecting a simple election where each candidate makes a simple speech and then ballets were submitted and the rest of the show would center around Yuuki's self journey through the short process . I was correct about the latter part but blown away at just how elaborate this election turned out to be! This election was like a miniature version of an election for a political office in a country. You had primaries, fundraising, bribing, scandals, and so much more, all being ran completely by high school students! This was insane and incredible at the same time! The political party analogies were awesome and the way the Food Research Club, the club our MC is trying to save by running , overcomes the odds stacked against them was really crazy and so fun. This is a full on game of strategic politics with each side having their own agenda- handled by high school students. Handled in a similar fashion to how real high schoolers would handle things.  You'l find at least one character to love here, and the direct and satirical humor found here is some of the best.\\n\\n\r\nThere is a bit of a suspenseful conflict thrown in at the end which isn't so realistic for high schoolers however it was still fun to watch through out, and got a bit motional toward the end too.\\n\\n\r\nChocolate\\n\r\nI can't say too much about this part because it's spoiler territory but how this chocolate is used in this story as a catalyst  to push the relationship between certain characters was very interesting and, -sigh- sweet. -Escorts self out the door now-  Through the chocolate and what it means to one of the characters,  you get a bit of psychological drama here and get into some dark and psychological themes which was pretty cool.\\n\\n\r\nKoi to Senkyo to Chocolate takes all three of the things in it's title and blends them all together to give you a fun crazy heartfelt tale about a ragtag bunch of friends teaming up to stand up for what they believe in and earn what they want. You'l encounter some surprises along the way too. The show has a slow start however it picks up gradually and you'll be glad you stuck with it by the end.\\n\\n\r\nWell that was my first review. It's format is a bit unconventional  . .. Hope you got something out of it.\\n\\n",
            "date": "2015-12-30T11:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 207315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665195.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/StardustNyako",
                "username": "StardustNyako"
            },
            "url": "https://myanimelist.net/reviews.php?id=207315"
        },
        {
            "content": "The reason I see this anime was when I saw his pictures were nice.\r\nbut for all, I enjoyed the story, it is full of hot intrigue elections.\r\none great advantage is rare anime using political elements involved in love.\r\nmaybe this is the right decision because most anime does not take politics as the main dish in the making anime.\r\nto get involved with love, the audience may be confused because the two contrary elements.\r\nbut this is different, the producer was able to combine both simultaneously.",
            "date": "2012-10-07T11:46:00+00:00",
            "helpful_count": 0,
            "mal_id": 74365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1328161.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shinji_Furukawa",
                "username": "Shinji_Furukawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=74365"
        },
        {
            "content": "Let me start off with stating that i will be making this review as spoiler free as possible, i will be reviewing this in way for someone to read and get an idea whether they wish to watch the show or not.\r\nnote: This anime is based on a game(Dating simulator)\r\nFirst off the story: In the very beginning we have a very basic structure, normal students that are spurred into action do to a shocking event that will \"rock their world\" or change something important to their life. As stated in the synopsis this event is the closing or threat of closing of their club namedthe \"Food research club\". The Club amounts to a group of friends eating snacks of any kind for free at the schools expense. Logically it makes sense for it to be closed down. But for the sake of friendship and bonds and the like the Main character spurs into action to prevent this.\\n\\n\r\nOverall that sort of beginning is pretty generic and nothing overly special.  You can get a similar \"call to action\" from any anime within arm's reach.\\n\\n\r\nProgression of the story - Pacing wise the story seemed to get off its buns and start walking at a good pace, there was no needless time really wasted and all scenes and interactions show had some sort of meaning. Now On that same point, there are very important aspects of the story that are mentioned, ignored and then re-visited when it is their time. They are not built on, justifying this as \"behind the curtains\" events. BUT there is some redemption, i say some very loosely.\\n\\n\r\nStory Overall - It seemed interesting enough in the beginning and continued to offer good entertainment value, the story continues to a point where one could say it begins to shine and break tropes and normal storyline patterns, for me this was very refreshing. But the studio reminds us that this is a Dating sim and ultimately backtracks(somehow) to a very generic, expected and just unsatisfying ending. The story also has its twists that come out of no where but are expected simply because when everything is going great, something needs to ruin the party. BUT if you are thinking of not watching it because of what you just read. WAIT.\\n\\n\r\nCharacters - This is what makes this show more entertaining, a specific cast of characters(and a specific number of them) that fit their role. They say the actor makes the play and this holds true for this show, the plot being what it is becomes MUCH better because of who is in the roles.\\n\\n\r\nCharacters by name: Brief overview\\n\\n\r\nYuuki Oojima(Ooshima -> in show run on joke) - This is the main protagonist. As if by law this story starts with him in his club with nothing but pretty cute girls(and on guy who is obsessed with making him eat his \"yaoi stick\" which is a snack product he made, more on this later) As a character he comes of in the beginning as very normal,polite and kindhearted BUT what sets him apart is that when push comes to shove, unlike most Main characters he SHOVES back. He has a backbone and grit not seen very often. This trait is seen in many aspects of the show as it continues. The studio screws him over though and him take the fall for their choice, i will not elaborate on how or why but my advice is remember him as who he was not for who he became/how he ended.\\n\\n\r\nChisato Sumiyoshi - This character is the MC(Main character)'s childhood friend, we see early on that they stick together like glue, although you can see early on the Main character is independent of her but not vice versa(this will develop into something i personally loved about this show)  She follows the mold of her character to the T, annoying, needy but with a twist of having a trauma that dictates most of her actions(apparently). My issue with the twist is that is doesn't effect her character at ALL until suddenly it becomes like a plague. one second normal then BAM. Not a fan of this or her character because she was very forced and scripted, unnatural and it seemed like she was just a cut out. This is the main female lead.\\n\\n\r\nSatsuki Shinonome - This character is the most redeeming character in the animated show and not because of character design, if that was a criteria the aforementioned childhood friend could fight for best character but she is ranked very lowly.  As a character with a story she is well written, i wouldn't go so far to say superbly written but you can feel authenticity from her and her actions. She an important member of the school council and also a rival for the protagonist who is running for president. This could lead to very cliched moments of \"you are my enemy but you have shown me the error of my ways\" but those never happened and not because the protagonist didn't try but because the character stayed firm on her ideals. The development of her character did feel slightly off but her personally overall makes up for it. I also can't claim that she is generic or cut out since she has her unique points unlike many of the other characters. She strangely enough receives the MOST legitimate development in the series. Unlike the forced development other characters get. \\n\\n\r\nAll the other female characters recieve very little exposition and have other minor details that are added in for a few shots to give a way for the plot to advance. Specifically coincidences like OH this and this because of that person. I would write about them but they receive very little screen time or noteworthy backgrounds, mostly acting as comedic relief for the audience and gears to keep things going.\\n\\n\r\nArt: The art was very normal, nothing special, as well as the animation, very basic and some places looked rough, some places had bad frames but it was run of the mill and normal. The opening animation was enjoyable to watch but again the animation or drawing was nothing special.\\n\\n\r\nSound: The sound is very easy to miss, in fact if you aren't paying attention you will not catch any of the music actively. For this reason i can say the sound was subpar because it did not compliment the show but rather stuck in the far background . Almost as if the studio was like \"well...music needs to be in anime for ambiance i guess...\" And threw something out there.\\n\\n\r\nEnjoyment - It was fun to watch which is whats important, the interactions were interesting, again nothing outstanding or unique but they will give you your laugh or moments of WTF face as you fail to comprehend the foolishness of the situation. For better or for worse...\\n\\n\r\nOverall - i give it a solid 6 fair rating, i think rating it any lower would be brutal and undeserved. It did its job, it entertained me. They made bad decisions on where to take the story in my opinion but just because my own wishes were not met does not mean i will rate it lower. This show could have earned a much higher rating if not for the few final episodes where everything quite literally flipped on itself. \\n\\n",
            "date": "2017-01-17T19:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 238545,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5598340.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Addonexus23",
                "username": "Addonexus23"
            },
            "url": "https://myanimelist.net/reviews.php?id=238545"
        }
    ]
]