[
    [
        {
            "content": "Neon Genesis Evangeli- I mean, Devil Survivor 2 the Animation, is a great example of an adaptation from a video game to television gone wrong. Having beaten the video game myself, this anime adaptation was a severe disappointment from start to finish in many off-putting ways. The writing in this anime is childish as it constantly uses well-known clichés, character archetypes who never develop past their cardboard cut-out selves, spills melodrama all over the floor, and everything feels rushed and unconvincing. It is rather, to put it simply, a monstrosity. Now, the story of the video game wasn’t exactly original nor was it interesting, soI wasn’t expecting the anime to have a storyline to be on a whole different tier. However the anime definitely could had improved on the overarching story in various ways. Unfortunately, the anime never really improves anything throughout its entirety and leaves off a trail of poor writing everywhere.\\n\\n\r\nThe story starts out when a colossal, unnatural disaster hits Japan which pushes civilians and society into desperation, as any major disaster in real life would. Soon, invaders called Septentriones appear and humans must defeat every one of them using demons they can summon in order to survive. Wait a minute, doesn’t this premise sound a bit familiar? Devil Survivor 2 borrows a lot of the same concept from Neon Genesis Evangelion. However the video game managed to blend in its own traditional and original aspects of the Megami Tensei franchise, (Devil Survivor belongs to the Megami Tensei franchise), thereby allowing the game to hold onto its charm. The same can’t be said for the anime adaptation. Unlike the video game, the anime sheds off every inch of strategy in every battle, and replaces it with random attacks that seem to serve no purpose other than for eye-candy and to weakly move the plot forward. The result is mainly dull action and boring battle scenes.\\n\\n\r\nOne of the first problems that appear in the anime is that it never really genuinely shows how such a monumental impact is affecting the civilians and society. In Devil Survivor 2’s case, world-building is essential in order to allow the viewer to sink in the necessary details so that important aspects such as pacing and plot and character development feel natural. World-building in this anime’s case could had provided more details on the nature of the post-apocalyptic setting, what the order of society is currently like, how various civilians are holding up, the government’s reaction, etc. Unfortunately, the viewer gets none of this in a genuine manner but gets instead various plot devices that jump out of nowhere which feel jarring, unnatural, and in certain cases, make for unconvincing writing in both story and character-wise. \\n\\n\r\nEnter Hibiki, the main protagonist. He encompasses everything that many other battle shounen protagonists there ever were. He is the hero who jumps straight into action without rational thought. He is the hero who has to save everyone simply because he has the power to summon stronger demons than anyone else. By the way, why Hibiki has been granted this special power while almost everyone else has been left with much weaker demons is never explained until the last remaining few episodes. Even then, the reasoning for this special power is as cliché as it can get. The unexplained unique powers he acquires acts as plenty of plot devices, as Hibiki manages to defeat foes left and right with the help of his powerful demons, and without any convincing struggles. To hurt the writing further, for the first few episodes, this power is the only reason that drives him to become the typical hero that he is and jumps into every battle he can get his hands on. When Hibiki lacks such motivation for his heroic behaviors, he comes off as a very unconvincing character and becomes hard for the viewer to sympathize or understand with. Other characters beside Hibiki also never properly develop, and this makes for much unfruitful viewing containing melodrama and rushed events. In fact, the majority of the characters are hardly even realized, it’s as if they were put into the anime simply to fill up more cast and time and amount to nothing more.\\n\\n\r\nOn top of this, well-known clichés pretty much plague many parts of the anime. One notable cliché and theme used throughout the anime is… the power of emotions. Yes, screaming out loud while also screaming cliché lines can save the day in this anime.\\n\\n\r\nDevil Survivor 2 the Animation was very disappointing. There is not much of a single redeeming aspect about this anime. Cliches, bland characters, overdramatic scenes due to poor development, weak narratives and overall plot really plague this anime, ultimately coming off childish and dull. And to those who played the game and hoped for a faithful adaptation in terms of story, you will be disappointed. To make it worse for the video game fans as well as for the rest of the Megami Tensei franchise fans, a lot of the Megami Tensei aspects seen in this anime are terribly realized. The anime breaks the laws of the MegaTen universe, such as how Hibiki can somehow summon Byakko as his first demon in the first episode, a high-level demon in the video game. It was also disappointing how the Demon Fusion was actually introduced in the last episode, and it didn’t help that it was intertwined with horrifying writing. Also, did I mention that Jungo is the most awkward character I’ve ever seen in any anime?\\n\\n\r\nThe video game is very fun and addicting. This adaptation can leave one with the impression of the exact opposite.",
            "date": "2013-07-01T10:39:00+00:00",
            "helpful_count": 210,
            "mal_id": 103311,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/566985.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GaryFrost",
                "username": "GaryFrost"
            },
            "url": "https://myanimelist.net/reviews.php?id=103311"
        },
        {
            "content": "I was very excited when I heard a Devil Survivor 2 anime was in the works, having recently played and loved the DS game on which it's based. Watching it now, I can say that my feelings for the anime are overall good, if somewhat more mixed than I had anticipated. I'm certainly enjoying it, but there are a few places it seems to fall a little flat.\r\nThe anime looks and sounds great. The art is solid; the characters and demons look exactly as they do in the game and the animation is never not satisfying in the action sequences. The voice actors all fitthe characters, who were unvoiced in the game, well. Nothing too jarring. The music doesn't do anything wrong and the OP and ED are both pleasant if not overwhelmingly memorable.\\n\\n\r\nThe story and the characters are where it falters some, and it's largely because it has too much to do in too little time. The game on which it's based is a 50 or so plus hour RPG that takes multiple playthroughs to explore everything. To fit it all into 13 24 minute episodes means gutting out so much of the build up and character development that the game had going for it. This makes the characters seem rather lifeless compared to how energetic and enjoyable they are in the game and also limits the scope of the story some. Devil Survivor 2 could be a surprisingly lighthearted and often humorous game, something that made the stark revelations about the fate of the world and characters hold more gravity. Without the time to build all that, the story becomes somewhat deflating. It's just not as much fun as it should be.\\n\\n\r\nI love the characters in Devil Survivor 2, and seeing them fully animated is a lot of fun. Without something like the Fate system in the game to develop them and make their bonds with the main character mean something, a lot of what makes them fun is left out though. It's not just that though; the anime changed a few things it probably shouldn't have. Joe, who is a part of the group since day one in the game and provides so much refreshing whimsy is reduced to a minor supporting role. Io seems completely different; she smiled a lot more and just came across as a lot less weak. Other characters who can get fully developed in the game are simply killed off prematurely. \\n\\n\r\nWorst somehow is Hibiki though, surprisingly. He was your ordinary silent protagonist in the game, but how events unfolded did depend on how he acted. In my first playthrough he never missed an opportunity to joke around, was brash, aloof and quick to side with JP's. The anime version could be different from that though, and probably picked the worst way possible to play him, reducing him to your average mopey shounen protagonist. To make matters worse, the anime decided to make him more powerful than his friends and the other characters from the start. In the game, he and his friends are noticed because they're resourceful and because it's a Strategy RPG and he's able to use his intelligence to win difficult fights and become stronger for them. Having him become the focus from the start because he's \"the one\" seems much more hollow and moreover pushes his friends more out of focus than they should be, especially since they were the focus of the game. \\n\\n\r\nAll that said, the anime is certainly not torture for fans of the game. No, it's actually quite enjoyable to see all the familiar demons pop up and fight. It's especially satisfying to see how the very familiar Septentrion fights, the boss fights in the game, are handled. It's not difficult to enjoy the anime, even as I see where it goes wrong and some of the places where it decides to diverge from the game's story are interesting. \\n\\n\r\nIf you haven't played Devil Survivor 2, I would definitely recommend that over the anime. The anime on it own isn't bad though. For a non-fan, I'd probably deduct 1-3 points from my overall score, depending on tastes. The characters aren't going to come across as what they could be not having the time they needed to grow, and the same goes for a lot of the plot development. Still, there's a lot to like, I think. The animation is nice, the action satisfying and the core plot intriguing enough. I've yet to be bored with it at the least.\\n\\n\r\nUpdate: Having seen the series to completion now, I had to dock a point from my initial score. I still think the anime looks great and has more than enough moments to justify a watch, but it really just kept making increasingly poor decisions in regards to story progression. There came a point where I found it harder to separate out the experience I had with the anime from that of the game and it cut into my overall enjoyment. Characters and even whole important themes and events from the game are discarded with increasing frequency just leaving it feeling fractured, while the mood is kept more grim than it needed to be, the amusing sequences of the game cut short, skipped over or drained of fun. Meanwhile, the cool stuff it does do slows down considerably--the last few Septentrion fights aren't as interesting or involving and for some reason the show decides to keep the number of unique demons we see in action very limited. \\n\\n\r\nI said before that fans would enjoy this, but I don't know anymore. If you can effectively separate out the good experience of the game as you watch, the anime can still be rewarding with the right expectations. If not, I can see this being a quite frustrating watch. And for non-fans, who don't know how the characters should have properly been developed, the experience is still probably worse. I almost want to say a seven is being generous, but at the same time I'm glad a great game like Devil Survivor 2 got an anime adaption. I just really wish it had been a better one.",
            "date": "2013-05-25T18:49:00+00:00",
            "helpful_count": 107,
            "mal_id": 98423,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=98423"
        },
        {
            "content": "I had my share of problems with Persona 4's anime adaptation. Actually, I had a truckload of problems with it. Scratch that, I was finding stuff to complain about every single episode. And yet, I look back on it and think \"oh wow they actually didn't do that badly, considering they condensed a 70-hour RPG into 25 episodes\". Indeed, Devil Survivor 2: The Animation served to put Persona 4 into perspective for me. In spite of all its issues, it really didn't do that much wrong. The story was well developed, the characters all got their moments to shine, and there was still time leftover for fluffy social linkage.\\n\\n\r\nYeah, uh, DeSu 2 doesn't do any of that. What we have here is the boring parts of Mirai Nikki with the basic premise of Neon Genesis Evangelion tacked on, infused with Megami Tensei lore. P4 wasn't exactly a paragon of originality, but the tricks it played to stay above the typical worked well. Here, however, everything is strictly by-the-numbers. Chosen one, blah blah blah, pointless friends, sexy rival, blah blah blah, end of the world, boss battles, mysterious otherworldly ally, this has literally all been done before. Even worse, this show is as predictable as it is boring. I could see all the plot \"twists\" coming, -especially- the ending. Oh, wow, the ending. Don't even try to pretend you were shocked. It was so, so obvious.\\n\\n\r\nOne of my biggest problems with this is the cast. If your name isn't Hibiki Kuze, you're shit out of luck. This show doesn't care about you, and you won't get to do anything, ever. The only other characters to get any screentime are Hibiki's two friends, his sexy rival, and the mysterious otherwordly ally. Everyone else is mere decoration, which is extremely sad, because the minor characters happen to also be the most interesting ones. I was charmed by Jungo and Airi from the first moment they appeared, but \"Jungo = chef, likes cats; Airi = kind of a bitch\" is the only thing we ever get to know about them here. This is a huge problem, because when the show starts killing characters off and treats it as a huge deal, I was unable to care. They weren't killing -people-, they were killing concepts. None of these characters were developed enough for their deaths to have any sort of impact. Speaking of development, though, not even Hibiki gets that. Indeed, his only privilege is the vast amounts of screentime. He starts the show as a generic, personality-free protagonist, and ends it the exact same way. The protagonist, Yu Narukami, was one of the things the P4 anime did extremely well, so seeing them utterly fail here was kind of sad. Perhaps 13 episodes just wasn't enough for such a large cast of characters. Wait, perhaps? There's no \"perhaps\" here.\\n\\n\r\nI suppose the show being short kinda starts making up for it being incredibly boring. Hey, let's be positive some more! Electropop magician kz of one-person music \"group\" livetune composed the opening, and he has, of course, delivered a total jam once again. It may not be a complete banger like his other op of the season, OreImo's Reunion, but more kz is good kz. I cherish kz's compositions. On a similar note, the ending song (Be by Song Riders) isn't bad, either. Both songs eventually found their way into my playlist, where they both got their heavy rotation. Oh and the animation is kinda nice I guess.\\n\\n\r\nLet's have a bottom line, a line at the bottom. Devil Survivor 2 is boring. Really boring. Uninteresting and bland, even, and I can't think of this as anything other than a failure. I suppose it's a bit better than Mirai Nikki, one of my least favourite anime of all time, on account of this just being dull, as opposed to face-breakingly bad.\\n\\n\r\nAlthough, technically, isn't making a bad impact better than making no impact at all? Mirai Nikki -did- have some absolutely fantastic stupidity...\\n\\n\r\nEr, yeah. To close this review, I can't recommend this to anyone. To fans of the game, this is a shitty adaptation. Don't bother. To fans of the genre, Evangelion is there for a reason. To fans of SMT, just rewatch Persona 4. To everyone else, this is one boring piece of work. I suppose the best way to describe it would be \"mediocre\", but it's -so- mediocre that it crosses into being god-awful. After all, aren't the worst shows the ones you can't even enjoy for their badness?\\n\\n\r\nYour anime's death clip has been uploaded. This outcome cannot be avoided. Have a nice day!",
            "date": "2013-07-10T19:11:00+00:00",
            "helpful_count": 101,
            "mal_id": 104797,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118640.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Keirik",
                "username": "Keirik"
            },
            "url": "https://myanimelist.net/reviews.php?id=104797"
        },
        {
            "content": "You know you're in for a ride when you read that first line of the synopsis and realize that the world is about to end thanks to some mysterious invaders. These invaders are called Septentriones want one thing: your life. It all takes place on the holy day of Sunday where the lives of the main characters are in danger. Why? Because the world is about to end and their only chance now is to survive. That's right....\r\nWelcome to the world of Devil Survivor 2, where survival is a word that you'll be hearing more than meets the eye.\r\nThe series is based off the videogame, Devil Survivor 2 of the same name. It is based off of the Megami Tensei so expect some similar themes to its other products such as Persona 4. Otherwise, this series is not a sequel despite being labeled seemingly as such. Rather, Devil Survivor 2: The Animation is an animated series that brings out survival at its finest. Hmm, or does it....\\n\\n\r\nTaken from a survival standpoint, the series begins off with a strong promise. In fact, the subway station and the threat of being exterminated after a faithful event seemingly sets the course on its scale. It is on rail as we can tell that the mysterious invaders known as the Septentriones aren't messing around. As a matter of fact, anything coming in contact with them will likely end up a quick journey to the next world; aka death. It presents it visually well too. The way the characters panics in the beginning as well as the deaths of innocent people makes the series seem gruesome. It's not realistic but keeps up with its pace in terms of 'survival'. It holds true to the extent of its main tagline that features two prominent words:\\n\\n\r\nLet's Survive.\\n\\n\r\nThe series follows main male protagonist Hibiki Kuze. The guy is seemingly who attends a normal high school with his normal friends until that not-so-normal day. To me, the character seems just like any other typical boy with no special qualities of notice. Well, except perhaps by that distracting hood he often wears with the funny ears, he is just a student. However, it is noticeable that the boy is fearless against certain situations and is able to make crucial decisions that can potentially lead to important outcomes. Then, there are his friends Io Nitta, the school beauty who comes with a package of both brain and looks. Unfortunately, she too gets caught with the events from the beginning of the story. But hey, friends can conquer all right? Wrong. Well, not entirely they need a little help from the supernatural. This comes in the form of cell phones. If you think today's cell phones are flashy with the latest gadgets, just get a load of the ones in this series. \\n\\n\r\nThe cell phones from this series comes with a special feature you won't find anywhere. That feature is the prominent device known as a demon APP. Luckily, this APP isn't just for decoration but an important tool to fight off the mysterious Septentriones. Thus, the APP functions as both a tool and weapon for the protagonists to use. They are able to summon demons for assistance, creatures who are not just badass looking but also packs powerful abilities that makes the characters awe of their appearances. \\n\\n\r\nAs for the demons themselves, they seemingly serve for no other purpose other than obeying their master's commands. In other words, this isn't' a friend/partner relationship between the summoners but rather as master/servant. At the same time, these demons are designed in the way that shows off how powerful they are. Take for example, Byakko the demon that Hibiki commands. He represents the ferocity of his nature through his sabertooth-like appearance. On the other hand, the Septentriones are designed to reflect their strange nature. Most of them are difficult to relate with in terms of realistic nature because of their odd appearances. They don't seem to have any personalities but rather surrounded by mystery. What we do know is that they are the executioners of mankind. Their appearances resembles otherworldly beings being perhaps comparable to Vividred Operation's Alones or Eureka Seven: AO's Secrets. In other words, they serve as the most mysterious factor of the series as they threaten the very existence of humanity.\\n\\n\r\nThe series takes off with a good start but quickly loses its interest after its memorable first episode. The premise is easy to follow with the key word 'survival' being a central part of the series. However, it's the pacing that causes the problem here. Unless you're a fan of the original game series, it's quick to pick out what happens and its upcoming events. Needless to say, this series follows the more of mindless fun in terms of action rather than anything serious. It's honestly hard to take this series seriously despite the given premise as well. I mean, the characters use cell phones, a tool that should be used for communication rather than summoning. In this series though, we see these kids using them as a tool of war. However, the way it employs it is rather blend. Most of the time, the kids themselves relies too much on their summonings rather than themselves. I mean, they rarely comes up with the thought of 'what happens if I lose my demon?' It's pretty lame to see their summoners just sit back and let their partner do the job. \\n\\n\r\nDevil Survivor 2 does pull out some unusual events through the appearances of 'death clips', scenes that depicts a characters' outcomes in the series. Then again, there's the Septentriones flying around causing panic to everywhere with a seemingly lack of explanation of their origins. Although it seems fun to dig clues about the series, it just seems blend through their certain appearances. As for a animated series of only 13 episodes, Devil Survivor 2 is one of those adapted anime that is crammed by its game material. This leads to problems with character development, relationships, world building, and the story itself. To make matters worse, there are even episodes where hardly anything happens but creates a setup of what's to come. It creates barriers that prevents the series to succeed in this way and doesn't help the fact that not every characters gets to shine in the spotlight.\\n\\n\r\nThe bright side of this series though (I don't mean this literally) with its idea of survival. Characters do actually die off rather than being a tease, at least for the time being. Even the credits played after each episode presents this visually as it removes characters after they are killed. There's also an unusual relationship between Yamato and Hibiki that is hard to paint later on. Yamato is one of the most mysterious figures. Despite seeing Hibiki as a friend at times, he is also brutally honest and makes decisions with cruel outcomes. Speaking of outcomes though, the story comes out as perhaps quite weak. It's problem again lies in its adaptation of being a condensed 13-episode series. It also pulls out the deus ex machina when the opportunities come. Furthermore, it even has bits of fan service by the characters' designs such as Airi and Hinako. To present material like this in a demonic series such as DS2 makes the show more messy than it already is. \\n\\n\r\nAs for the series' visuals, it represents both a gruesome nature and also one that is hard to take serious at times. Well, there's the way that Hibiki is designed along with other characters such as 'The Anguished One'. The way the characters look doesn't make them look like survivors of anything. They look like people out of a video game. However, there are a few characters who are dressed in an unusual way that may raise a few eyebrows. Our mysterious Septentriones also are presented in a way that is completely out of this world. The apocalyptic nature of the series does fit though so I give some praise to that.\\n\\n\r\nPerhaps one of the stronger points of the series is the soundtrack. The OP song, “Take Your Way” takes the stance of an artistic way of presenting the series. We can see the characters digitally with enhanced features of their profiles as well as some depictions of the events. The OST is hardly noticeable though except during more of the crucial or more emotional scenes. Otherwise, the ED song as mentioned before shows the survival theme as when characters dies off, they are removed from the credits. It's all about survival people.\\n\\n\r\nAll in all, this series is fun for some full shock violence and action. It reflects the idea of survival and gives it away immediately. However, its story is dry as paint and its cast of characters seems unbalanced with their weak development or structure. Furthermore, the series seems to be rushed and has some nonsense as it loses energy. The first episode had my eyes glued to the screen but quickly changed my mind afterwards. It's one of those series where patience is a key to getting it through. If not, then tough luck. It's just like the main characters too where they need everything to survive whether it's strategy, power, and luck. Well, for luck, they're going to need it.",
            "date": "2013-06-27T17:33:00+00:00",
            "helpful_count": 83,
            "mal_id": 102709,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=102709"
        },
        {
            "content": "This anime seems to be getting a lot of hate but the anime itself is pretty credible and somewhat enjoyable. As someone that hasn't played the Devil Survivor games I was somewhat pulled into this anime but it still feels like it is lacking something. By reading this review I have only seen 6 episodes and so this review wouldn't be valid but can be credible to the anime itself. \r\nStory\r\nThe story is fine and there isn't too much to complain about. The anime presents itself with our usual high school protagonist with his high school friends. It's pretty basic and isn't anything new orground breaking. Long version is that our main character Hibiki and friends download an app that allows him to summon demons and also see other peoples predicted deaths. The apocalypse happens and since our main character is the one with the powerful demons it's up to him to make sure no one gets killed. Pretty basic plot but watchable. \\n\\n\r\nArt \\n\r\nI can't really judge artwork to me it looks pretty and there's no complaints just normal anime art style for the anime but set in 2013 standards. \\n\\n\r\nSound\\n\r\nThe sound is good but the only thing I like out of sound is the opening and the ending but osts aren't memorable for me and so it doesn't have much of an impact but the opening and ending are enjoyable to listen and watch. \\n\\n\r\nCharacters \\n\r\nThe only problem with the main character at this point is that there is no defining feature for him (except for his bunny hoodie) he's just your typical shounen character in which once he realises his power he thinks he needs to be the hero in which can protect everyone. There's nothing wrong with it as it does play in the story, who should Hibiki work for, for the greater good, the JP's or the resistance but it's just your typical shounen protagonist. The other problem is just with the side characters. I have trouble in remembering their names and Hibiki's best friend is just annoying. Overall characters aren't the best part of the show but it's still watchable. \\n\\n\r\nOverall as someone that has not played the game I say that the anime itself is still watchable the story itself is fine and the struggle with what the main character is going through is interesting but side characters bring the anime down but it's still watchable and I would recommend it as just an anime to watch and put on the list.\\n\\n",
            "date": "2013-05-10T03:10:00+00:00",
            "helpful_count": 35,
            "mal_id": 96601,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1207071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OtaCon-TJO",
                "username": "OtaCon-TJO"
            },
            "url": "https://myanimelist.net/reviews.php?id=96601"
        },
        {
            "content": "Devil Survivor 2 aired from April to June of 2013. What starts off seeming to be similar to Mirai Nikki as the characters’ cell phones are given a “future sight” ability quickly turns into a “save the world from demons” kind of show. Unfortunately, DS2 has many problems with pacing, characters, and just an overall confusing plot. It is based off of a game by the same name, which I have heard is much better.\r\nFirst I want to mention one thing. Whenever I say anything is bad in this show, it excludes Jungo and Airi who are two supporting characters and who are gems thatreally stand out in this mess of a show.\\n\\n\r\nStory – 4/10\\n\\n\r\nThe story begins with Kuze Hibiki and Shijima Daichi, two best friends in high school who are preparing for college. One day as they are about to board the subway, a strange message comes onto their cellphones. It shows a video to them of the subway train derailing and crashing into the station they are standing on killing everyone around them. As they stand there freaked out at the video, the train comes into the station and proceeds to do exactly as the video showed. The two boys barely avoid being crushed by the crumbling station and were much more fortunate than the people around them. Still, they’re not safe yet. Strange monsters have appeared and are attacking a classmate of theirs who also happened to survive the incident, Nitta Io. Nitta and the two guys all saw the same video and all soon find out that that’s not the only thing their phones are now capable of doing. They somehow manage to fight off the monsters surrounding them by summoning demons from their phones, much to their surprise.\\n\\n\r\nAfter escaping from the subway, they learn that similar events have happened in other places. Everything starts to turn chaotic as monsters appear in the streets and start attacking. Still inexperienced with the new abilities of their phones, the three somehow manage to survive with their own strength before being found by members of an organization named “JP’s.” They learn all about the demons which are called “Septentriones” and that the world will be destroyed in a week by these Septentriones. JP's was created in order to fight the Septentriones and try to protect the world. However, the leader of JP’s, Yamato Houtsuin, seems a little untrustworthy to the trio.\\n\\n\r\nWhile I admit it is a good setup, the plot is heavily confusing. It is never explained very well what the Septentrione are and only adds more confusion later on. All I can figure is they are similar to the Angels from Evangelion (one even resembles humans). The characters jump around between sides a lot as well. By that I mean that the people surrounding Yamato never really understand his reasoning for things, and he is one of the most confusing parts of the story. The show is very indecisive on whether it wants to portray him as a villain or a hero. Yamato, while apparently trying to protect the world from the Septentriones, will use any means necessary to stop them, and he sacrifices people without showing a single ounce of regret.\\n\\n\r\nOne last major issue is the disconnection you have with the important fighting demons of the main characters. Aside from Hibiki’s, Yamato’s and Daichi’s main demons (just one from each), I don’t remember a thing about any of the other characters demons (even Jungo and Airi’s). Having not played the DS2 game, I don’t really know how important they are, but I really wish more focus had been given to the powers and abilities of each of the demons. As similar as they are to Pokémon or the “box-weapon animals” from Katekyo Hitman Reborn, there’s just nothing in the show that helps make them memorable like in those other shows.\\n\\n\r\nThe first two episodes of DS2 are pretty good, but from there, the story just dive-bombs lower and lower and never recovers. Even at the very final episode, I have no clue what this Polaris thing is or whether it's good or bad, and the ending itself is weak.\\n\\n\r\nArt – 7/10\\n\\n\r\nAside from some scenes being a little too dark and difficult to follow, the art is fairly standard. While it has some great moments, the action scenes are nothing special. In addition to the poor explanations of the demons, in many cases, the characters send them out to fight and then the story focuses on the drama between Yamato, Hibiki, and everyone else instead of showing the action in detail. The character designs (excluding Jungo and Airi) are not very original. There’s one woman, Hinako, who kind of takes a motherly towards Nitta and the other characters. Her design (which I really did not like) is just bizarre as I have no idea how the two flaps that are her shirt stay on her breasts.\\n\\n\r\nSound – 6/10\\n\\n\r\nI noticed in Episode 12 that there were a few great songs playing during the action scenes, but other than that I hardly noticed the music at all. The voice actors for the most part are decent at best. Daichi’s voice is really annoying, but at least the VA cast has Sawashiro Miyuki as Makoto who is one of my favorite voice actors (she also voices Celty in Durarara!!). I also found Hibiki’s voice to be sub-par for a main protagonist. As much emotion as he shows, he never really sounded the part to me during those scenes.\\n\\n\r\nCharacter – 5/10\\n\\n\r\nThis would probably be a 3/10 if not for Jungo and Airi. Despite being supporting characters who are not even introduced until around episode four or five, to me Jungo and Airi were really the best characters in DS2. Their relationship was more of a big brother (Jungo) and little sister (Airi) relationship than anything romantic. Jungo is a fairly quiet, tall man while Airi is kind of a brat who talks a lot and gets embarrassed easily. When I first saw them, I thought they were kind of similar to Jesse and James from Pokémon (they’re first seen sneaking into a rebel building), but they quickly show that they are much more than that. Like every other named character in this show, they have cellphones which can summon demons to fight.\\n\\n\r\nNow onto the main cast. The main cast greatly resembles the cast of Durarara!! (main trio who look very similar, long-time rivals, and Makoto and Celty have the same VA and similar roles). I thought Hibiki was a pretty weak and stereotypical protagonist. He’s thrust into a supernatural world he doesn’t understand with an unusual amount of power and he is basically forced to save the world with said power. Daichi is just annoying. He’s Hibiki’s best friend who can only summon small useless demons at first. Nitta is a girl who has trouble comprehending everything at first as she is thrust into this world while worrying about her family. She also has a strong desire to protect everyone. I already talked about Yamato so now I’ll talk about his “rival” who he has known for years, Alcor (Ureu Mono). Alcor is a Septentrione who has the form of a human (though what’s up with his huge white eyelashes?). He is interested in Hibiki and wants to help him save the world (I think, like Yamato, Alcor’s motives are a little confusing).\\n\\n\r\nOne thing about this show (which you’ll notice as you watch the ED after a few episodes) is that it is not afraid to kill characters. I already mentioned that Yamato sacrifices people (tens of background characters get wiped out from a single attack from Septentriones many times), but this show does not give you much time to grow attached to a few characters.\\n\\n\r\nEnjoyment – 5/10\\n\\n\r\nI just barely enjoyed it enough to finish all 13 episodes. To me, this show is a butchered mix between Neon Genesis Evangelion and Mirai Nikki for the plot and Durarara!! for the characters. It’s confusing, only has two strong characters with a weak main cast, and does not even have the art or sound to really back up these huge faults.\\n\\n\r\nPros:\\n\r\n+ Jungo and Airi\\n\r\n+ The first two episodes are not bad\\n\\n\r\nCons:\\n\r\n- Weak main characters\\n\r\n- Confusing plot\\n\r\n- Music is never very strong\\n\r\n- Weak action scenes\\n\r\n- Demons are forgettable due to lack of screen time\\n\\n\r\nI would recommend avoiding this anime. Similar things such as Neon Genesis Evangelion and the Yumekui Merry manga did the “save the world from mysterious creatures” concept better, and I would recommend them over DS2.",
            "date": "2013-06-27T12:34:00+00:00",
            "helpful_count": 30,
            "mal_id": 102651,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=102651"
        },
        {
            "content": "Overall the anime was good I enjoyed it, I watched it in one day which may skew my perception of it.  Probably if I had to wait week by week for this anime I would have dropped it at episode 3.  I do not know anything about the game, nor did I read the synopsis of the anime beforehand, so I had no expectations.\r\nStory (7/10) The story was very shounen like, if I could compare it, the 13 episodes seemed fairly similar to a first arc in a shounen manga.  The characters are introduced, the main character is more awesome that theothers, and has to rise to the occasion to battle it out against the \"evil\".  \\n\\n\r\nArt (7/10) The characters were pleasing to the eye.  There were alot of scenes in which spoke volumes in terms of the story.  While Alcor and Hibiki are talking on the bridge the scene of the void taking over was pretty meaningful especially with the dialogue.  The fights in episode 10-13 were a bit different.  I felt like some of the fights were reminiscent of Neon Genesis and also GANTZ. \\n\\n\r\nSound (8/10) I am just rating this on feelings.  I liked the theme song a lot.  The ending songs were okay, but I didn't listen to them every episode or anything.  The sound during the anime was good, although I am not an elite on sound, so I wouldn't be sure.\\n\\n\r\nCharacters (8/10) I really feel Hibiki, Daichi, Io were lacking in this series as far characterization goes.  We get a flashback of the reason why Hibiki is such a do-gooder, but the director I feel did not direct it properly because it did not come off as either sentimental or that you knew more about the person.  You just came away with the feeling that he use to go with the flow of his parents expectations than one day his friend was talking about what he wanted to do in high school and BAM he changed? I don't get it. Io is the archetypical girl that you feel sorry for and gets lured into traps etc so the main character can create a miracle for her (she doesn't cry that much though so that's good).  Daichi well what can I say he is like the idiot friend that has good intentions but is just not as strong or intelligent as the main and merely becomes comedic relief.  The other characters are better, Alcor was by far the most interesting.  Some of the characters I felt were purely fan service and could have been done away with, though I am sure they appeared in the game so they had to be included.\\n\\n\r\nEnjoyment (9/10) I enjoyed it, I think it was good that it was not made into a 24 episodes.  In fact I think it would have been better as movie or 3 part OVA.  Since there are 13 episodes I expected more either character development or fight scenes, but instead air time was wasted on useless character to character dialogue on food or building up supporting characters like the Airi and Jungo, and the person with barely there clothing.  While fans of the game probably liked this, I thought it was worthless and had no point in anime adaptation.  I also liked the philosophical aspect of it, I felt that it could have been done better rather than spelling it out, it could have been symbolic but, I guess it fits shounen-like genre to spell it out for people.\\n\\n",
            "date": "2013-07-02T00:08:00+00:00",
            "helpful_count": 26,
            "mal_id": 103423,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/evelynie",
                "username": "evelynie"
            },
            "url": "https://myanimelist.net/reviews.php?id=103423"
        },
        {
            "content": "Well,this anime has it all. Lame story(basically nonexistent, its just one boss figth after another),boring characters, with no motivation, no interest and no development and mediocre music thah really wears off after one time. Even the animation, its strongest aspect, its nothing special and you can not even enjoy it because is lost from all the stupidity of the above.\r\nHowever, that its not this anime's biggest problem.The thing that really bugged me it is the fact the show never escapes from its gaming origin. It keeps remind you that its a game: the hero receives quests from the director, performs them and then returns formore. The graphics, the pauses(which by the way are just plain stupid), even the opening, they all feel like i am playing a computer game. Even the title for god's shake!I do not have a problem with animes that come from games, i even love some of them, but it becomes a problem when the staff just want to animate a game and simply do not care about anything else. The Devil Survivor 2 The animation is an anime for those that wanted to see the game animated and NOONE ELSE.Maybe not even them.\\n\\n\r\noverall i give it a 3,a poor choice to watch.",
            "date": "2013-05-09T06:50:00+00:00",
            "helpful_count": 23,
            "mal_id": 96519,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2454389.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/njjn",
                "username": "njjn"
            },
            "url": "https://myanimelist.net/reviews.php?id=96519"
        },
        {
            "content": "This is a great series, people need to understand Shin Megami Tensei is a non-casual and non-mainstream rpg series. \r\nThis was clearly made for fans of the SMT saga. But it is still enjoyable for people who actually want an anime that doesn't revolve around Friendship Power > everything. The characters are varied and likable but that's not what the anime is about.\r\nThis anime is about a group of NORMAL teenagers who end up involved in an Apocalyptic survival of the fittest scenario. This is a realistic what-if series.\r\n-What if demons suddenly appeared in your city? \r\n-What if you had an app on your phoneto summon demons?\\n\r\n-What if you were given a chance to change the world?\\n\r\n-What if you saw a clip of your friends death and he's standing right next to you?\\n\\n\r\nDropping this anime because you don't have all the answers before episode 4 is just silly. Watch the series if you want answers.\\n",
            "date": "2013-05-25T17:20:00+00:00",
            "helpful_count": 23,
            "mal_id": 98401,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1633733.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Democracy",
                "username": "Democracy"
            },
            "url": "https://myanimelist.net/reviews.php?id=98401"
        },
        {
            "content": "I picked up Devil Survivor 2 because the summary sounded interesting and not because I've played the game it is supposed to be adapted off of. The series is similar to Mirai Nikki and the two Persona adaptations. Unlike said series the plot of DS2 doesn't flow well at all, so I know the problem doesn't lie with it being an adaption off a game, particularly since both Persona adaptations turned out well despite being a game. I've also seen a few other series with a similar plot line and I was quite fond of said series. This though I was not, and that isnot a reflection on the game at all.\\n\\n\r\nGoing into the series I didn't realize that the series' plot line involved tricking fate, but after the first episode I knew that it shared a similar plot line as quite a few other series I had seen involving tricking fate. The problem is, unlike the other series the characters are not actually able to trick fate and everything turns into an over blown blood fest with no sense of direction. Interesting characters would appear, only to be killed off shortly after they appeared, thus there was no getting to know said characters beyond the basic quirks that they were shown to have in the series.\\n\\n\r\nThe plot line was also overly depressing as was the ending. My enjoyment for the series had been high at the beginning, but quickly dropped as the series progressed. It felt like the show was missing something and over all it was very bland. The art work and sound really were the only thing going for this series.",
            "date": "2013-06-27T14:18:00+00:00",
            "helpful_count": 21,
            "mal_id": 102671,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=102671"
        },
        {
            "content": "I'm a fan of Atlus games as well, including Devil Survivor series. What I like in the second game, is that it is more light-hearted than the first one. The first one is the exact definition of horror. I still love the first one though.\r\nStory 7, Art 8, Sound 9, Chara 6, Enjoy 8, Overall 8\r\nThe story is quite simple, so I won't comment much. What I like about the story in the anime and the game, is because the anime diverts itself from the game. Lots of different dead clips and events differ very much. I actually like that, since it makes me wonderwho's gonna die next, and what kind of ending will take place.\\n\\n\r\nThe art is good. It is so very like \"2013\"-ish. I like Suzuhito Yasuda from Durarara!!, so I can enjoy the art.\\n\\n\r\nI don't really pay attention to the sound, but I love the opening and the ending.\\n\\n\r\nCharacters are usually the main reasons I watched an anime. Aside from art. The characters don't develop that much, and I must say that I was quite disappointed by the developments. Hibiki's actions are actually from your typical shounen protagonists. Though I can relate and forgive it, since I thought his actions are perfectly normal for a normal high school students who were suddenly brought to the end of the world. \\n\\n\r\nStill, because I'm an ATLUS fan, I can't stop watching this anime.\\n\\n\r\nI would've put the overall as 7.5, since the core point of the anime was struck down.\\n\\n\r\nAs a bonus, I finally realized that this anime is actually very interesting. You need to watch this further deeper into the episodes to know its quality. I admit, that the few first episodes are utterly disappointing. But I can't say that again to the later episodes. It's getting more and more interesting.",
            "date": "2013-06-07T07:05:00+00:00",
            "helpful_count": 20,
            "mal_id": 100121,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/353371.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archdaine",
                "username": "Archdaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=100121"
        },
        {
            "content": "booooringgg. the first episode was quite enjoyable and i had quite the expectations for this series. the intro and outro were also quite good, so my initial  impression was quite high. however, the coming episodes (i've watched 6 so far) have led the anime astray and I'm left with easily predictable scenes and cheesy dialogue that bores me like no other anime. since the first episode my impression for this anime has exponentially dropped and unfortunately, I don't see it getting much better. 6/10",
            "date": "2013-05-15T15:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 97295,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2093215.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nevetsgnow",
                "username": "nevetsgnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=97295"
        },
        {
            "content": "I'm playing the game while watching the animation just to compare them and the two can't even be compared. The reason for the 5 on the story is that the anime feels so rushed. I know it is 24 episodes but they could have filled those episodes with the \"conversations\" the protagonist has with various characters from the anime. And worse, the animators just keep killing off the various characters that I find interesting like Otome who loves teasing Makoto about her \"crush\" on the protagonist, Joe who is so whimsical, it makes the gameplay fun, and Keita who is such a lone wolf heis funny. Not only that, some characters are so out of OOC like Yamato who is cynical and sarcastic instead of being a total grunting guy, Fumi who is suppose to be crazy, and the protagonist who is suppose to be cool instead of a normal guy. The biggest fail is the character deaths because each character is awesome with a lot put into them so killing them off with no character development is just stupid, especially considering the fact that fans of the game will definitely watch this and will hate it for destroying their hopes. The fight scenes are too short and superficial, and the characters don't seem to be able to learn demon powers, which is a turn-off. The graphics and animation itself is good but that can only improve the anime by so much. All in all, not really satisfying but watch it if you like.",
            "date": "2013-05-26T10:50:00+00:00",
            "helpful_count": 15,
            "mal_id": 98491,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/trannon1",
                "username": "trannon1"
            },
            "url": "https://myanimelist.net/reviews.php?id=98491"
        },
        {
            "content": "When the preview for this anime came out, I practically fangirled like crazy because I played the game version of this. I actually didn't finish it because I didn't like spoilers, so I decided to finish the anime before I continue playing. I seriously thought it would be awesome. The first game was pretty nice and I expected the anime of the second game to be just as good. BUT BOY WAS I WRONG. Most of the characters were lame, story was predictable, and everything was just plain boring. Seriously, Hibiki's actions are SUUUUUPPPERRRR predictable, I had to fast forward the anime just so Ican see if I'm right. And I was. Boy was I let down.\\n\\n\r\nThey should've animated the first one instead. The storyline and premise were better in DS1. It got the \"survivor\" part quite well and it was also much darker than DS2.\\n\\n\r\nGave it a 5 because OP and ED were cool.",
            "date": "2013-05-20T03:17:00+00:00",
            "helpful_count": 14,
            "mal_id": 97771,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/406941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gumi-tan",
                "username": "gumi-tan"
            },
            "url": "https://myanimelist.net/reviews.php?id=97771"
        },
        {
            "content": "Oh man, going into this anime I honesty had high hopes. I really should have known better.\r\nStory\r\nThe start of the anime was pretty good. It starts with two normal high school living their normal lives, while going to someplace somewhere to do something they see a beautiful girl by herself. While talking about her, they get a video showing their own deaths and the show begins. It starts somewhat strong and interesting but as the story continues it starts making less sense and becomes extremely boring to watch. \r\nCharacters\r\nAll the characters are bland and weak except for Hibiki (he's boring, just not weak) the protagonist.All other characters play unimportant roles (except for the guys with white hair), HECK the other two that were with Hibiki were only there to try and be characters who the audience could sympathize with and to be a \"reason\" for the protagonist to fight. Hibiki is honestly no better than any other character, the only reason why he's more likeable than the others is he's strong and the others aren't. He's the VERY DEFINITION of a generic main character, but hey it is a game adaptation.\\n\\n\r\nArt & Sound\\n\r\nThe only thing that saves this anime is it's good art and animation. The characters look nice and the battles are nicely animated but very boring to watch after the first few fights. The music didn't really stand out much except for the ending.\\n\\n\r\nEnjoyment\\n\r\nI really forced myself to watch this anime often going into a trance like state causing me to miss most of what happened in the current episode.\\n\\n\r\nOverall\\n\r\nI really forced myself to watch this anime often going into a trance like state causing me to miss most of what happened in the episode. This is a really big reason why I try my best to not get hyped for anything (I still don't know why I was even hyped for this anime).\\n\\n",
            "date": "2014-05-11T19:42:00+00:00",
            "helpful_count": 10,
            "mal_id": 143043,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3372655.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/EyeBall1844",
                "username": "EyeBall1844"
            },
            "url": "https://myanimelist.net/reviews.php?id=143043"
        },
        {
            "content": "Devil Survivor 2 is an adaptation of the game developed by Atlus. Opinions about this anime will be different from person to person \r\nThis review shall be made taking into account the game, I played it long before seeing this adaptation.\r\nThe anime had potential to become one of the best of this year 2013 if the creators had taken more seriously the game, in my opinion i believe that neither they played it and only guided themselves by summaries of the game (who knows? Seems like it to me).\r\nI'll start by comparing the anime and the game in several areas:\r\nStory: The story in this animegoes way too fast.\\n\r\nThe game had many missions that didn't belong to the main story but that affected the course of history and all of them were not shown in this animation.\\n\r\nThe anime is just 13 episodes and that affected the character/character development and the moste important, the finale ! I would not mind if the anime had 2 seasons if that meant covering all parts of the game.\\n\r\nI still don't believe they skipped the battle beetwen Hibiki and Polaris (major flaw!).\\n\\n\r\nCharacters: The characters are not well developed and some even only appear in 2 or 3 episodes and the relationships between some are a bit forced due to the reduced number of episodes. In the game, you have the opportunity to socialize and get to know better each character and their problems and their life before the invasion but the reduced number of episodes made it impossible.\\n\\n\r\nSound: In my opinion the soundtrack from the anime meets the recommended and has a great ending (better ending in this summer for me), as well as the OST fits well.\\n\\n\r\nBattles: The battles in this anime were good but could have been more and better, if the anime had traversed the whole game we would have the opportunity to see more demons and various attacks.\\n\\n\r\nThe final battle (i do not want to spoil) is too short in my opinion and could have more drama and more action.\\n\\n\r\nThe games of the saga shin megami tensei are famous for having a great story to develop and its interaction with all the characters and addictive battles but the anime was slightly below expectations but i disagree when people say it was a failure because i found it nice to see one my favorite games adapted for television.\\n\\n\r\nWho knows  if they do not make the adaptation of the first game Devil Survivor, but this time done by taking better account of the game.\\n\\n\r\nI hope this review helped you in some way and always remeber :\\n\\n\r\nLET'S SURVIVE !",
            "date": "2013-08-14T06:25:00+00:00",
            "helpful_count": 10,
            "mal_id": 109579,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2469971.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Goukakyo",
                "username": "Goukakyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=109579"
        },
        {
            "content": "I am in love with this anime at the moment! The use of supernatural powers and the characters who are so easy to fall in love with. The story line is like a breath of fresh air and its not too difficult to follow as the events unfold. \r\nTo begin with i assumed it would be yet another predictable anime but as each episode is aired something unexpected turns out. There is a strong theme of power and hierarchy, although it is not overwhelming as it has the portrayal that the power would be easily taken away.  \r\nThis anime is one that you canfall into, you lose yourself in the story and it's not very often that an anime can actually do that for me. As the anime spans out over seven days it is very short but not lacking when it comes to action, not only that but the feeling of self sacrifice is almost overpowering, but it is a brilliant anime. I recommend this to anybody who enjoys action packed animes.",
            "date": "2013-06-15T14:32:00+00:00",
            "helpful_count": 9,
            "mal_id": 101177,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2427129.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ajlashleigh",
                "username": "ajlashleigh"
            },
            "url": "https://myanimelist.net/reviews.php?id=101177"
        },
        {
            "content": "Note: Spoilers are in this review. I tried my best, but I can't really give a good critique without implementing them. \r\nFurthermore, I could not avoid comparing this to the game. Still, I reviewed this on its own merits. I have played Devil Survivor 2: Record Breaker for the 3DS for 100+ hours, so I have a good grasp on the game’s strengths and weaknesses.\r\nI’ve sometimes wondered why Shin Megami Tensei games don’t get adaptations, but then a bit of thinking always leads me to the answer: many of them would be the same. See, since the core SMT series typically boasts multiple endings, thestudio would have to adapt one, and the one it chooses to adapt would be the Neutral route, as that would probably have the most story. This is why we see more linear games (plotwise) like Persona 4 get adaptations. Devil Survivor 2, the second in the Devil Survivor branch of SMT games, has a tone right in between SMT and Persona. The game is considerably more lighthearted than its parent series and its predecessor, and even though it has multiple routes, they’re very similar to each other. So, how does the anime adaptation work out? Not well, I’m afraid.\\n\\n\r\nDevil Survivor 2 the Animation is based on a manga that is based on the game. It follows the main character, renamed Hibiki Kuze, a bunny-eared hoodie wearing high schooler. After signing up for a macabre site, Nicaea, that promises to show death videos, or clips of people dying, the world seems to turn upside down; a subway train crashes, monsters only describable as demons pop out of peoples phones, and mysterious invaders called the Septentriones threaten the balance of the world itself. Hibiki, who has a greater potential than others, can summon stronger demons like Byakko; as a result, he and his friends are forcibly enlisted into the government agency JP’s (pronounced Jips) to fight against these monsters. Hibiki often comes into conflict with the cold and ruthless leader of JP’s, Yamato Hotsuin. He also comes into contact with a number of different people, most noticeably the Anguished One, an enigmatic being who knows more than he’s letting on and is decidedly not human.\\n\\n\r\nThe plot of the original game was never its strong suit (with plenty of dumb anime tropes and stuff like \"The Dragon Stream\"), and for the most part, the anime doesn’t strengthen it. Urgency and despair are rarely felt, despite it being a Shin Megami Tensei title; honestly, this doesn’t play out as anything other than a disaster-based anime, much like films such as Twister and San Andreas. Where the game did excel, however, was with its characters. A total of 14 main characters rounded out a robust cast in the game, and each character had enough time to be fleshed out. Even Hibiki bucked the trend by being a rather witty hero, calling people tsundere, nicknaming them, and flirting with everyone to no end. The cast was creative.\\n\\n\r\nThe anime doesn’t do that. Almost every character is reduced to a singular trait or trope, or even less so. \\n\\n\r\nDaichi? Good friend of Hibiki, and dumb comic relief (A recurring gag has him yelling \"My Demons are weak!\" which gets old fast). \\n\r\nIo? Dandere who seems to like Hibiki. \\n\r\nMakoto? Serious. \\n\r\nFumi? Uncaring.\\n\r\nRonaldo? Justice. \\n\\n\r\nCharacters like Joe, Otome, Airi, Jungo, Hinako, and Keita don’t even get an iota of development to make you give half a shit about them. Joe's a guy, Otome's a doctor, Hinako dances, whatever. Not a shred of their personality or motivations are retained from the game. The most we get is maybe one or two stills (quite literally stills, not even a scene) worth of flashback for Airi and a short scene for Makoto. Hibiki might be one of the worst off; after having such a creative personality in the game, and then having the voice actor to be able to match (Hiroshi Kamiya, who also did the manic Araragi from the Monogatari series). Hibiki is reduced to nothing more than a serious shounen hero who wants to save everyone. Hooray for a generic hero. \\n\\n\r\nAnd, well, it also doesn’t really help that pretty much everyone dies in an extremely haphazard manner. In the game, Death Videos were supposed to be avoided by arriving in a timely fashion. And while the game had time to let you feel the weight of your incompetence, no such element exists in the anime other than Hibiki beating himself about it, as you can't connect to many, if any, of the characters. In one of the early episodes, the character Keita is introduced, only to die in that same episode. The end of the series gets particularly dumb, when pretty much everyone dies in rapid succession.\\n\\n\r\n(Incidentally, during a fight with the Anguished One, Yamato avoids getting killed. Somehow. Despite being exploded upon. Never explained.)\\n\\n\r\nAs far as characterization goes, it’s not an entire wash. The Anguished One is roughly the same as his game counterpart, but the clear “winner” is definitely Yamato, who’s roughly the same as he is in the game. However, he’s significantly more ruthless in this anime than he is in the game, and that produces mixed results. On the one hand, Yamato is permitted extra development even over the game, especially through his childhood and his interactions with politicians that led him to his meritocracy beliefs. On the other hand, Yamato is hard to sympathize with on almost any level; the game, which allowed you to join him in his quest for a meritocracy, included a few light moments, made him a much less “evil” character than he is in the anime. \\n\\n\r\nIt’s because of this overall weak characterization that prevents the extremely talented voice cast from reaching their full potential. There’s a dynamite Japanese voice cast featuring a very strong list of A-list seiyuus, but bland characters can’t really be saved by good voice acting. No one performance is bad (far from it!), but the only one who stands out is Junichi Suwabe as Yamato, even if his great performance only serves to make Yamato more unlikable. \\n\\n\r\nUltimately, all of this can be attributed to rushing, only highlighting the plot points. A playthrough of a route, even quickly, can take around 15 hours, and while not all of that is plot all the time, everything feels stuffed into this 6 and a half hour adaptation which focuses only on the major plot points. If I had to appreciate the plot in any way (besides them somehow paying a lot of attention to the fusion recipes: they were all correct!) it would be the fight with Lugh, which was much plainer in the game.\\n\\n\r\nThankfully, we have some strong animation here. Maybe after seeing a bunch of semi-static sprites all of the time in the game lowered my standards, but the animation is always clean and consistent. A-1 manages to make the demons look terrifying, and the character models by Durarara!! and Danmachi artist Suzuhito Yasuda are brought to life here, with a focus on details. While other aspects of the anime may be suspect, Seiji Kishi does a great job of directing this series, and the cinematography is quite well done. \\n\\n\r\nThe fight scenes are a mixed bag, much like the Persona 4 animation; like that, it feels like glorified Pokemon, which is definitely not what Shin Megami Tensei is. To its credit, the fight scenes look pretty enough, but their length, choreography, and character interactions (which is mostly reduced to yelling stuff like “Go Byakko!”) leaves plenty to be desired.\\n\\n\r\nYou shouldn’t have much of a reason, if any at all, to watch this anime unless you’ve played the game (or fall into a group where you don’t own a 3DS but like the SMT and Persona series). Maybe for morbid curiosity, but not much else. My main reason to watch this was to experience the Japanese cast, which is unavailable to me unless I buy a Japanese 3DS and a Japanese version of Record Breaker, but thanks to the uninspired characters, even that isn’t a good enough reason. I’d recommend you skip this series. It has its strengths, but its weaknesses far outstrip them. But buy Record Breaker if you have a 3DS.\\n\\n\r\nScore:\\n\r\nStory - 4\\n\r\nArt/Animation - 7\\n\r\nSound - 7\\n\r\nCharacter - 3\\n\r\nEnjoyment - 5\\n\\n\r\nOverall: 5.1 (Rounded to 5)\\n\\n\r\nEDIT 6/29/2015: Made a dumbass mistake that Otome was a nurse. Sexism is alive, folks. Corrected to doctor.",
            "date": "2015-06-22T12:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 190932,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3362033.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SNaG21",
                "username": "SNaG21"
            },
            "url": "https://myanimelist.net/reviews.php?id=190932"
        },
        {
            "content": "Devil Survivor 2: Dubious Massacre Too\r\nAfter Seiji Kishi's wildly successful anime adaptation of Persona 4, it was only natural we would see him tackle another popular Atlus video game franchise, right? That's what we got with Devil Survivor 2, a 13 episode series produced by a relative unknown in the anime industry, Studio Bridge. Considering the success Kishi had with Persona 4, we could expect the same great things with Devil Survivor 2...ah expectations...how you never cease to fail me.\r\nThis series is the very definition of the phrase \"all style and no substance.\" Devil Survivor 2 is a GORGEOUSLY animated series with production values throughthe roof. However, Kishi faces the same problem he had with Angel Beats...he tried to cram way too much into too little of space. Devil Survivor 2 is supposed to be a character driven series with well fleshed out characters to drive a dark, horrifically bleak plot. However, since Kishi only had 13 episodes to work with, this series felt rushed in its character development (or lack there of) and it resulted in the series not having the \"impact\" it should've had. I will warn you right now (as if you couldn't tell from the title), there is a lot of death in this series. However, like I stated, due to the characters not being fleshed out, their deaths have very little impact, at least not as much impact as they should've had. \\n\\n\r\nAs far as the story is concerned, it revolves around a graduating high school student named Hibiki Kuze, who is hanging out with his best friend Daichi Shijima after college entrance exams. While hanging out, Daichi shows Hibiki a phone app that shows people their faces when they die. While waiting for their ride in the subway, they encounter a girl from another class named Io Nitta, someone Daichi has a crush on. While waiting for their ride, they all get messages of their dead face clip of the train derailing and killing all of them, and all given the choice by the app if they want to live or die. By choosing to live, they avoid a near death experience when the train does derail, but their worlds will never be the same after this event as they discover that the end of the world is at hand and they'll have to fight to survive. Overall, I did find it to be an interesting plot that at least kept me interested in how this world was coming to an end. However, in my opinion, a story is only as good as the characters that drive it...and that's where this series took a turn for the worst.\\n\\n\r\nThe characters were so underdeveloped that it was sad. While I don't think the cast nor the characters themselves were necessarily terrible or unlikable, the problem was ALL of them were underdeveloped. After the first few episodes, Kishi gives us the impression that we need to be invested in Hibiki, Nitta, and Daich and their growing friendshipi. However, other than learning about all three of them trying to get into college, we learn next to nothing about them. We don't learn anything about what shaped their personalities or their motivations, and other than a short flashback later on in the series, there is absolutely nothing displayed about Hibiki's back story. That's where the problem with this series lies. The nature of Shin Megami Tensei games for the most part, is the choices you make to develop your character. However, when you have a contained anime series, the choices need to be made by the production staff...but in this instance, Kishi didn't make any choices and left the characters open for the viewer to make their own interpretation about them. That sort of practice works fine for a video game, but not when you're telling a story, especially in an anime series format. It was an odd choice because in Kishi's prior work (Persona 4), Yu Narukami, the series lead was fleshed out and the production staff did choose how to develop him. I'd say this is one instance where Kishi should've followed his own prior example. While I mentioned it earlier, this series had way too many notable characters to completely cover in a 13 episode format. There were 14 notable characters that were either main characters or incredibly important supporting characters. However, when you only have 13 episodes to work with, it's impossible to flesh out every single one and when you have a story as active as this one, there just wasn't enough time to cover both bases. I'll give this series a little bit of credit though. Alcor was one hell of a memorable character due to his bizarre appearance and unorthodox behavior...but even that feels like a drag considering how forgettable all the rest of the characters are.\\n\\n\r\nThe MAJOR saving grace for this series should come as no surprise. It's the animation and music. The production value of this series was incredible. The animation was crisp and provided a dreary setting and the high-quality music provided a bleak mood (even if the characters didn't). While this series only had 13 episodes to work with, I'll at least admit Studio Bridge went all out with it. I found the demon designs and the fight scenes to be incredibly fascinating and certainly does justice to the wonderful universe Shin Megami Tensei has to offer. My one complaint (albeit minor) is I found the character designs, primarily the costume designs, to be rather silly for a series of this magnitude. While I know it's probably derived from the series directly, I found some of the character costumes to be downright hilarious, from Kuze's rabbit eared hoodie, to Hinako's breast flop top, to Fumi's swimsuit with a full-length cape. It's pretty sad when a series this ominous can make you chuckle from just mere costume designs.\\n\\n\r\nAll-in-all, I can't help but feel disappointed by this series. This was one series I was looking forward to the most when this season started and it left me feeling discontent. When a character driven series has really shallow character development, you have problems. It's just hard to get invested in a series where there is such little development between the characters throughout. I will say this series did have a pretty strong finish with its last two episodes, however, by then, the damage was done. While I thought the final episode was a strong finish to a weak series, some people might get a little turned off by its Mai-Hime-esque conclusion. I'm not sure how this series works as an adaptation since I've never played the video game, but as an anime series, it failed to deliver in a lot of ways. Now, the question is, who would I recommend this to? Well, I'd say if you liked other video game adapted or inspired anime like Persona 4 or Persona: Trinity Soul, you might enjoy this. However, a viewer that loves being invested in character over plot is more than likely going to find this to be a difficult watch. I hate to say it, but I have a feeling that I'm going to say by the end of the year that Devil Survivor 2 was unfortunately one of the more disappointing anime of 2013.",
            "date": "2013-06-27T14:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 102679,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=102679"
        },
        {
            "content": "I honestly cried at the end because even when everything was sad during the story, they made the ending a super happy one and I seriously think this is one of the best Anime about Devils ever made. I liked it because the art was cool, the story plot was weird yet amazing, in the English version the voices weren't bad, and the characters had new surprises in every episode with great personalities fitting each of their looks. I loved and enjoyed it so I hope you will watch it and feel the same way I did watching Devil Survivor 2: The Animation!!!",
            "date": "2015-03-01T16:37:00+00:00",
            "helpful_count": 7,
            "mal_id": 181486,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4123057.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shiro-tama",
                "username": "Shiro-tama"
            },
            "url": "https://myanimelist.net/reviews.php?id=181486"
        }
    ],
    [
        {
            "content": "Neon Genesis Evangeli- I mean, Devil Survivor 2 the Animation, is a great example of an adaptation from a video game to television gone wrong. Having beaten the video game myself, this anime adaptation was a severe disappointment from start to finish in many off-putting ways. The writing in this anime is childish as it constantly uses well-known clichés, character archetypes who never develop past their cardboard cut-out selves, spills melodrama all over the floor, and everything feels rushed and unconvincing. It is rather, to put it simply, a monstrosity. Now, the story of the video game wasn’t exactly original nor was it interesting, soI wasn’t expecting the anime to have a storyline to be on a whole different tier. However the anime definitely could had improved on the overarching story in various ways. Unfortunately, the anime never really improves anything throughout its entirety and leaves off a trail of poor writing everywhere.\\n\\n\r\nThe story starts out when a colossal, unnatural disaster hits Japan which pushes civilians and society into desperation, as any major disaster in real life would. Soon, invaders called Septentriones appear and humans must defeat every one of them using demons they can summon in order to survive. Wait a minute, doesn’t this premise sound a bit familiar? Devil Survivor 2 borrows a lot of the same concept from Neon Genesis Evangelion. However the video game managed to blend in its own traditional and original aspects of the Megami Tensei franchise, (Devil Survivor belongs to the Megami Tensei franchise), thereby allowing the game to hold onto its charm. The same can’t be said for the anime adaptation. Unlike the video game, the anime sheds off every inch of strategy in every battle, and replaces it with random attacks that seem to serve no purpose other than for eye-candy and to weakly move the plot forward. The result is mainly dull action and boring battle scenes.\\n\\n\r\nOne of the first problems that appear in the anime is that it never really genuinely shows how such a monumental impact is affecting the civilians and society. In Devil Survivor 2’s case, world-building is essential in order to allow the viewer to sink in the necessary details so that important aspects such as pacing and plot and character development feel natural. World-building in this anime’s case could had provided more details on the nature of the post-apocalyptic setting, what the order of society is currently like, how various civilians are holding up, the government’s reaction, etc. Unfortunately, the viewer gets none of this in a genuine manner but gets instead various plot devices that jump out of nowhere which feel jarring, unnatural, and in certain cases, make for unconvincing writing in both story and character-wise. \\n\\n\r\nEnter Hibiki, the main protagonist. He encompasses everything that many other battle shounen protagonists there ever were. He is the hero who jumps straight into action without rational thought. He is the hero who has to save everyone simply because he has the power to summon stronger demons than anyone else. By the way, why Hibiki has been granted this special power while almost everyone else has been left with much weaker demons is never explained until the last remaining few episodes. Even then, the reasoning for this special power is as cliché as it can get. The unexplained unique powers he acquires acts as plenty of plot devices, as Hibiki manages to defeat foes left and right with the help of his powerful demons, and without any convincing struggles. To hurt the writing further, for the first few episodes, this power is the only reason that drives him to become the typical hero that he is and jumps into every battle he can get his hands on. When Hibiki lacks such motivation for his heroic behaviors, he comes off as a very unconvincing character and becomes hard for the viewer to sympathize or understand with. Other characters beside Hibiki also never properly develop, and this makes for much unfruitful viewing containing melodrama and rushed events. In fact, the majority of the characters are hardly even realized, it’s as if they were put into the anime simply to fill up more cast and time and amount to nothing more.\\n\\n\r\nOn top of this, well-known clichés pretty much plague many parts of the anime. One notable cliché and theme used throughout the anime is… the power of emotions. Yes, screaming out loud while also screaming cliché lines can save the day in this anime.\\n\\n\r\nDevil Survivor 2 the Animation was very disappointing. There is not much of a single redeeming aspect about this anime. Cliches, bland characters, overdramatic scenes due to poor development, weak narratives and overall plot really plague this anime, ultimately coming off childish and dull. And to those who played the game and hoped for a faithful adaptation in terms of story, you will be disappointed. To make it worse for the video game fans as well as for the rest of the Megami Tensei franchise fans, a lot of the Megami Tensei aspects seen in this anime are terribly realized. The anime breaks the laws of the MegaTen universe, such as how Hibiki can somehow summon Byakko as his first demon in the first episode, a high-level demon in the video game. It was also disappointing how the Demon Fusion was actually introduced in the last episode, and it didn’t help that it was intertwined with horrifying writing. Also, did I mention that Jungo is the most awkward character I’ve ever seen in any anime?\\n\\n\r\nThe video game is very fun and addicting. This adaptation can leave one with the impression of the exact opposite.",
            "date": "2013-07-01T10:39:00+00:00",
            "helpful_count": 210,
            "mal_id": 103311,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/566985.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GaryFrost",
                "username": "GaryFrost"
            },
            "url": "https://myanimelist.net/reviews.php?id=103311"
        },
        {
            "content": "I was very excited when I heard a Devil Survivor 2 anime was in the works, having recently played and loved the DS game on which it's based. Watching it now, I can say that my feelings for the anime are overall good, if somewhat more mixed than I had anticipated. I'm certainly enjoying it, but there are a few places it seems to fall a little flat.\r\nThe anime looks and sounds great. The art is solid; the characters and demons look exactly as they do in the game and the animation is never not satisfying in the action sequences. The voice actors all fitthe characters, who were unvoiced in the game, well. Nothing too jarring. The music doesn't do anything wrong and the OP and ED are both pleasant if not overwhelmingly memorable.\\n\\n\r\nThe story and the characters are where it falters some, and it's largely because it has too much to do in too little time. The game on which it's based is a 50 or so plus hour RPG that takes multiple playthroughs to explore everything. To fit it all into 13 24 minute episodes means gutting out so much of the build up and character development that the game had going for it. This makes the characters seem rather lifeless compared to how energetic and enjoyable they are in the game and also limits the scope of the story some. Devil Survivor 2 could be a surprisingly lighthearted and often humorous game, something that made the stark revelations about the fate of the world and characters hold more gravity. Without the time to build all that, the story becomes somewhat deflating. It's just not as much fun as it should be.\\n\\n\r\nI love the characters in Devil Survivor 2, and seeing them fully animated is a lot of fun. Without something like the Fate system in the game to develop them and make their bonds with the main character mean something, a lot of what makes them fun is left out though. It's not just that though; the anime changed a few things it probably shouldn't have. Joe, who is a part of the group since day one in the game and provides so much refreshing whimsy is reduced to a minor supporting role. Io seems completely different; she smiled a lot more and just came across as a lot less weak. Other characters who can get fully developed in the game are simply killed off prematurely. \\n\\n\r\nWorst somehow is Hibiki though, surprisingly. He was your ordinary silent protagonist in the game, but how events unfolded did depend on how he acted. In my first playthrough he never missed an opportunity to joke around, was brash, aloof and quick to side with JP's. The anime version could be different from that though, and probably picked the worst way possible to play him, reducing him to your average mopey shounen protagonist. To make matters worse, the anime decided to make him more powerful than his friends and the other characters from the start. In the game, he and his friends are noticed because they're resourceful and because it's a Strategy RPG and he's able to use his intelligence to win difficult fights and become stronger for them. Having him become the focus from the start because he's \"the one\" seems much more hollow and moreover pushes his friends more out of focus than they should be, especially since they were the focus of the game. \\n\\n\r\nAll that said, the anime is certainly not torture for fans of the game. No, it's actually quite enjoyable to see all the familiar demons pop up and fight. It's especially satisfying to see how the very familiar Septentrion fights, the boss fights in the game, are handled. It's not difficult to enjoy the anime, even as I see where it goes wrong and some of the places where it decides to diverge from the game's story are interesting. \\n\\n\r\nIf you haven't played Devil Survivor 2, I would definitely recommend that over the anime. The anime on it own isn't bad though. For a non-fan, I'd probably deduct 1-3 points from my overall score, depending on tastes. The characters aren't going to come across as what they could be not having the time they needed to grow, and the same goes for a lot of the plot development. Still, there's a lot to like, I think. The animation is nice, the action satisfying and the core plot intriguing enough. I've yet to be bored with it at the least.\\n\\n\r\nUpdate: Having seen the series to completion now, I had to dock a point from my initial score. I still think the anime looks great and has more than enough moments to justify a watch, but it really just kept making increasingly poor decisions in regards to story progression. There came a point where I found it harder to separate out the experience I had with the anime from that of the game and it cut into my overall enjoyment. Characters and even whole important themes and events from the game are discarded with increasing frequency just leaving it feeling fractured, while the mood is kept more grim than it needed to be, the amusing sequences of the game cut short, skipped over or drained of fun. Meanwhile, the cool stuff it does do slows down considerably--the last few Septentrion fights aren't as interesting or involving and for some reason the show decides to keep the number of unique demons we see in action very limited. \\n\\n\r\nI said before that fans would enjoy this, but I don't know anymore. If you can effectively separate out the good experience of the game as you watch, the anime can still be rewarding with the right expectations. If not, I can see this being a quite frustrating watch. And for non-fans, who don't know how the characters should have properly been developed, the experience is still probably worse. I almost want to say a seven is being generous, but at the same time I'm glad a great game like Devil Survivor 2 got an anime adaption. I just really wish it had been a better one.",
            "date": "2013-05-25T18:49:00+00:00",
            "helpful_count": 107,
            "mal_id": 98423,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=98423"
        },
        {
            "content": "I had my share of problems with Persona 4's anime adaptation. Actually, I had a truckload of problems with it. Scratch that, I was finding stuff to complain about every single episode. And yet, I look back on it and think \"oh wow they actually didn't do that badly, considering they condensed a 70-hour RPG into 25 episodes\". Indeed, Devil Survivor 2: The Animation served to put Persona 4 into perspective for me. In spite of all its issues, it really didn't do that much wrong. The story was well developed, the characters all got their moments to shine, and there was still time leftover for fluffy social linkage.\\n\\n\r\nYeah, uh, DeSu 2 doesn't do any of that. What we have here is the boring parts of Mirai Nikki with the basic premise of Neon Genesis Evangelion tacked on, infused with Megami Tensei lore. P4 wasn't exactly a paragon of originality, but the tricks it played to stay above the typical worked well. Here, however, everything is strictly by-the-numbers. Chosen one, blah blah blah, pointless friends, sexy rival, blah blah blah, end of the world, boss battles, mysterious otherworldly ally, this has literally all been done before. Even worse, this show is as predictable as it is boring. I could see all the plot \"twists\" coming, -especially- the ending. Oh, wow, the ending. Don't even try to pretend you were shocked. It was so, so obvious.\\n\\n\r\nOne of my biggest problems with this is the cast. If your name isn't Hibiki Kuze, you're shit out of luck. This show doesn't care about you, and you won't get to do anything, ever. The only other characters to get any screentime are Hibiki's two friends, his sexy rival, and the mysterious otherwordly ally. Everyone else is mere decoration, which is extremely sad, because the minor characters happen to also be the most interesting ones. I was charmed by Jungo and Airi from the first moment they appeared, but \"Jungo = chef, likes cats; Airi = kind of a bitch\" is the only thing we ever get to know about them here. This is a huge problem, because when the show starts killing characters off and treats it as a huge deal, I was unable to care. They weren't killing -people-, they were killing concepts. None of these characters were developed enough for their deaths to have any sort of impact. Speaking of development, though, not even Hibiki gets that. Indeed, his only privilege is the vast amounts of screentime. He starts the show as a generic, personality-free protagonist, and ends it the exact same way. The protagonist, Yu Narukami, was one of the things the P4 anime did extremely well, so seeing them utterly fail here was kind of sad. Perhaps 13 episodes just wasn't enough for such a large cast of characters. Wait, perhaps? There's no \"perhaps\" here.\\n\\n\r\nI suppose the show being short kinda starts making up for it being incredibly boring. Hey, let's be positive some more! Electropop magician kz of one-person music \"group\" livetune composed the opening, and he has, of course, delivered a total jam once again. It may not be a complete banger like his other op of the season, OreImo's Reunion, but more kz is good kz. I cherish kz's compositions. On a similar note, the ending song (Be by Song Riders) isn't bad, either. Both songs eventually found their way into my playlist, where they both got their heavy rotation. Oh and the animation is kinda nice I guess.\\n\\n\r\nLet's have a bottom line, a line at the bottom. Devil Survivor 2 is boring. Really boring. Uninteresting and bland, even, and I can't think of this as anything other than a failure. I suppose it's a bit better than Mirai Nikki, one of my least favourite anime of all time, on account of this just being dull, as opposed to face-breakingly bad.\\n\\n\r\nAlthough, technically, isn't making a bad impact better than making no impact at all? Mirai Nikki -did- have some absolutely fantastic stupidity...\\n\\n\r\nEr, yeah. To close this review, I can't recommend this to anyone. To fans of the game, this is a shitty adaptation. Don't bother. To fans of the genre, Evangelion is there for a reason. To fans of SMT, just rewatch Persona 4. To everyone else, this is one boring piece of work. I suppose the best way to describe it would be \"mediocre\", but it's -so- mediocre that it crosses into being god-awful. After all, aren't the worst shows the ones you can't even enjoy for their badness?\\n\\n\r\nYour anime's death clip has been uploaded. This outcome cannot be avoided. Have a nice day!",
            "date": "2013-07-10T19:11:00+00:00",
            "helpful_count": 101,
            "mal_id": 104797,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118640.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Keirik",
                "username": "Keirik"
            },
            "url": "https://myanimelist.net/reviews.php?id=104797"
        },
        {
            "content": "You know you're in for a ride when you read that first line of the synopsis and realize that the world is about to end thanks to some mysterious invaders. These invaders are called Septentriones want one thing: your life. It all takes place on the holy day of Sunday where the lives of the main characters are in danger. Why? Because the world is about to end and their only chance now is to survive. That's right....\r\nWelcome to the world of Devil Survivor 2, where survival is a word that you'll be hearing more than meets the eye.\r\nThe series is based off the videogame, Devil Survivor 2 of the same name. It is based off of the Megami Tensei so expect some similar themes to its other products such as Persona 4. Otherwise, this series is not a sequel despite being labeled seemingly as such. Rather, Devil Survivor 2: The Animation is an animated series that brings out survival at its finest. Hmm, or does it....\\n\\n\r\nTaken from a survival standpoint, the series begins off with a strong promise. In fact, the subway station and the threat of being exterminated after a faithful event seemingly sets the course on its scale. It is on rail as we can tell that the mysterious invaders known as the Septentriones aren't messing around. As a matter of fact, anything coming in contact with them will likely end up a quick journey to the next world; aka death. It presents it visually well too. The way the characters panics in the beginning as well as the deaths of innocent people makes the series seem gruesome. It's not realistic but keeps up with its pace in terms of 'survival'. It holds true to the extent of its main tagline that features two prominent words:\\n\\n\r\nLet's Survive.\\n\\n\r\nThe series follows main male protagonist Hibiki Kuze. The guy is seemingly who attends a normal high school with his normal friends until that not-so-normal day. To me, the character seems just like any other typical boy with no special qualities of notice. Well, except perhaps by that distracting hood he often wears with the funny ears, he is just a student. However, it is noticeable that the boy is fearless against certain situations and is able to make crucial decisions that can potentially lead to important outcomes. Then, there are his friends Io Nitta, the school beauty who comes with a package of both brain and looks. Unfortunately, she too gets caught with the events from the beginning of the story. But hey, friends can conquer all right? Wrong. Well, not entirely they need a little help from the supernatural. This comes in the form of cell phones. If you think today's cell phones are flashy with the latest gadgets, just get a load of the ones in this series. \\n\\n\r\nThe cell phones from this series comes with a special feature you won't find anywhere. That feature is the prominent device known as a demon APP. Luckily, this APP isn't just for decoration but an important tool to fight off the mysterious Septentriones. Thus, the APP functions as both a tool and weapon for the protagonists to use. They are able to summon demons for assistance, creatures who are not just badass looking but also packs powerful abilities that makes the characters awe of their appearances. \\n\\n\r\nAs for the demons themselves, they seemingly serve for no other purpose other than obeying their master's commands. In other words, this isn't' a friend/partner relationship between the summoners but rather as master/servant. At the same time, these demons are designed in the way that shows off how powerful they are. Take for example, Byakko the demon that Hibiki commands. He represents the ferocity of his nature through his sabertooth-like appearance. On the other hand, the Septentriones are designed to reflect their strange nature. Most of them are difficult to relate with in terms of realistic nature because of their odd appearances. They don't seem to have any personalities but rather surrounded by mystery. What we do know is that they are the executioners of mankind. Their appearances resembles otherworldly beings being perhaps comparable to Vividred Operation's Alones or Eureka Seven: AO's Secrets. In other words, they serve as the most mysterious factor of the series as they threaten the very existence of humanity.\\n\\n\r\nThe series takes off with a good start but quickly loses its interest after its memorable first episode. The premise is easy to follow with the key word 'survival' being a central part of the series. However, it's the pacing that causes the problem here. Unless you're a fan of the original game series, it's quick to pick out what happens and its upcoming events. Needless to say, this series follows the more of mindless fun in terms of action rather than anything serious. It's honestly hard to take this series seriously despite the given premise as well. I mean, the characters use cell phones, a tool that should be used for communication rather than summoning. In this series though, we see these kids using them as a tool of war. However, the way it employs it is rather blend. Most of the time, the kids themselves relies too much on their summonings rather than themselves. I mean, they rarely comes up with the thought of 'what happens if I lose my demon?' It's pretty lame to see their summoners just sit back and let their partner do the job. \\n\\n\r\nDevil Survivor 2 does pull out some unusual events through the appearances of 'death clips', scenes that depicts a characters' outcomes in the series. Then again, there's the Septentriones flying around causing panic to everywhere with a seemingly lack of explanation of their origins. Although it seems fun to dig clues about the series, it just seems blend through their certain appearances. As for a animated series of only 13 episodes, Devil Survivor 2 is one of those adapted anime that is crammed by its game material. This leads to problems with character development, relationships, world building, and the story itself. To make matters worse, there are even episodes where hardly anything happens but creates a setup of what's to come. It creates barriers that prevents the series to succeed in this way and doesn't help the fact that not every characters gets to shine in the spotlight.\\n\\n\r\nThe bright side of this series though (I don't mean this literally) with its idea of survival. Characters do actually die off rather than being a tease, at least for the time being. Even the credits played after each episode presents this visually as it removes characters after they are killed. There's also an unusual relationship between Yamato and Hibiki that is hard to paint later on. Yamato is one of the most mysterious figures. Despite seeing Hibiki as a friend at times, he is also brutally honest and makes decisions with cruel outcomes. Speaking of outcomes though, the story comes out as perhaps quite weak. It's problem again lies in its adaptation of being a condensed 13-episode series. It also pulls out the deus ex machina when the opportunities come. Furthermore, it even has bits of fan service by the characters' designs such as Airi and Hinako. To present material like this in a demonic series such as DS2 makes the show more messy than it already is. \\n\\n\r\nAs for the series' visuals, it represents both a gruesome nature and also one that is hard to take serious at times. Well, there's the way that Hibiki is designed along with other characters such as 'The Anguished One'. The way the characters look doesn't make them look like survivors of anything. They look like people out of a video game. However, there are a few characters who are dressed in an unusual way that may raise a few eyebrows. Our mysterious Septentriones also are presented in a way that is completely out of this world. The apocalyptic nature of the series does fit though so I give some praise to that.\\n\\n\r\nPerhaps one of the stronger points of the series is the soundtrack. The OP song, “Take Your Way” takes the stance of an artistic way of presenting the series. We can see the characters digitally with enhanced features of their profiles as well as some depictions of the events. The OST is hardly noticeable though except during more of the crucial or more emotional scenes. Otherwise, the ED song as mentioned before shows the survival theme as when characters dies off, they are removed from the credits. It's all about survival people.\\n\\n\r\nAll in all, this series is fun for some full shock violence and action. It reflects the idea of survival and gives it away immediately. However, its story is dry as paint and its cast of characters seems unbalanced with their weak development or structure. Furthermore, the series seems to be rushed and has some nonsense as it loses energy. The first episode had my eyes glued to the screen but quickly changed my mind afterwards. It's one of those series where patience is a key to getting it through. If not, then tough luck. It's just like the main characters too where they need everything to survive whether it's strategy, power, and luck. Well, for luck, they're going to need it.",
            "date": "2013-06-27T17:33:00+00:00",
            "helpful_count": 83,
            "mal_id": 102709,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=102709"
        },
        {
            "content": "This anime seems to be getting a lot of hate but the anime itself is pretty credible and somewhat enjoyable. As someone that hasn't played the Devil Survivor games I was somewhat pulled into this anime but it still feels like it is lacking something. By reading this review I have only seen 6 episodes and so this review wouldn't be valid but can be credible to the anime itself. \r\nStory\r\nThe story is fine and there isn't too much to complain about. The anime presents itself with our usual high school protagonist with his high school friends. It's pretty basic and isn't anything new orground breaking. Long version is that our main character Hibiki and friends download an app that allows him to summon demons and also see other peoples predicted deaths. The apocalypse happens and since our main character is the one with the powerful demons it's up to him to make sure no one gets killed. Pretty basic plot but watchable. \\n\\n\r\nArt \\n\r\nI can't really judge artwork to me it looks pretty and there's no complaints just normal anime art style for the anime but set in 2013 standards. \\n\\n\r\nSound\\n\r\nThe sound is good but the only thing I like out of sound is the opening and the ending but osts aren't memorable for me and so it doesn't have much of an impact but the opening and ending are enjoyable to listen and watch. \\n\\n\r\nCharacters \\n\r\nThe only problem with the main character at this point is that there is no defining feature for him (except for his bunny hoodie) he's just your typical shounen character in which once he realises his power he thinks he needs to be the hero in which can protect everyone. There's nothing wrong with it as it does play in the story, who should Hibiki work for, for the greater good, the JP's or the resistance but it's just your typical shounen protagonist. The other problem is just with the side characters. I have trouble in remembering their names and Hibiki's best friend is just annoying. Overall characters aren't the best part of the show but it's still watchable. \\n\\n\r\nOverall as someone that has not played the game I say that the anime itself is still watchable the story itself is fine and the struggle with what the main character is going through is interesting but side characters bring the anime down but it's still watchable and I would recommend it as just an anime to watch and put on the list.\\n\\n",
            "date": "2013-05-10T03:10:00+00:00",
            "helpful_count": 35,
            "mal_id": 96601,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1207071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OtaCon-TJO",
                "username": "OtaCon-TJO"
            },
            "url": "https://myanimelist.net/reviews.php?id=96601"
        },
        {
            "content": "Devil Survivor 2 aired from April to June of 2013. What starts off seeming to be similar to Mirai Nikki as the characters’ cell phones are given a “future sight” ability quickly turns into a “save the world from demons” kind of show. Unfortunately, DS2 has many problems with pacing, characters, and just an overall confusing plot. It is based off of a game by the same name, which I have heard is much better.\r\nFirst I want to mention one thing. Whenever I say anything is bad in this show, it excludes Jungo and Airi who are two supporting characters and who are gems thatreally stand out in this mess of a show.\\n\\n\r\nStory – 4/10\\n\\n\r\nThe story begins with Kuze Hibiki and Shijima Daichi, two best friends in high school who are preparing for college. One day as they are about to board the subway, a strange message comes onto their cellphones. It shows a video to them of the subway train derailing and crashing into the station they are standing on killing everyone around them. As they stand there freaked out at the video, the train comes into the station and proceeds to do exactly as the video showed. The two boys barely avoid being crushed by the crumbling station and were much more fortunate than the people around them. Still, they’re not safe yet. Strange monsters have appeared and are attacking a classmate of theirs who also happened to survive the incident, Nitta Io. Nitta and the two guys all saw the same video and all soon find out that that’s not the only thing their phones are now capable of doing. They somehow manage to fight off the monsters surrounding them by summoning demons from their phones, much to their surprise.\\n\\n\r\nAfter escaping from the subway, they learn that similar events have happened in other places. Everything starts to turn chaotic as monsters appear in the streets and start attacking. Still inexperienced with the new abilities of their phones, the three somehow manage to survive with their own strength before being found by members of an organization named “JP’s.” They learn all about the demons which are called “Septentriones” and that the world will be destroyed in a week by these Septentriones. JP's was created in order to fight the Septentriones and try to protect the world. However, the leader of JP’s, Yamato Houtsuin, seems a little untrustworthy to the trio.\\n\\n\r\nWhile I admit it is a good setup, the plot is heavily confusing. It is never explained very well what the Septentrione are and only adds more confusion later on. All I can figure is they are similar to the Angels from Evangelion (one even resembles humans). The characters jump around between sides a lot as well. By that I mean that the people surrounding Yamato never really understand his reasoning for things, and he is one of the most confusing parts of the story. The show is very indecisive on whether it wants to portray him as a villain or a hero. Yamato, while apparently trying to protect the world from the Septentriones, will use any means necessary to stop them, and he sacrifices people without showing a single ounce of regret.\\n\\n\r\nOne last major issue is the disconnection you have with the important fighting demons of the main characters. Aside from Hibiki’s, Yamato’s and Daichi’s main demons (just one from each), I don’t remember a thing about any of the other characters demons (even Jungo and Airi’s). Having not played the DS2 game, I don’t really know how important they are, but I really wish more focus had been given to the powers and abilities of each of the demons. As similar as they are to Pokémon or the “box-weapon animals” from Katekyo Hitman Reborn, there’s just nothing in the show that helps make them memorable like in those other shows.\\n\\n\r\nThe first two episodes of DS2 are pretty good, but from there, the story just dive-bombs lower and lower and never recovers. Even at the very final episode, I have no clue what this Polaris thing is or whether it's good or bad, and the ending itself is weak.\\n\\n\r\nArt – 7/10\\n\\n\r\nAside from some scenes being a little too dark and difficult to follow, the art is fairly standard. While it has some great moments, the action scenes are nothing special. In addition to the poor explanations of the demons, in many cases, the characters send them out to fight and then the story focuses on the drama between Yamato, Hibiki, and everyone else instead of showing the action in detail. The character designs (excluding Jungo and Airi) are not very original. There’s one woman, Hinako, who kind of takes a motherly towards Nitta and the other characters. Her design (which I really did not like) is just bizarre as I have no idea how the two flaps that are her shirt stay on her breasts.\\n\\n\r\nSound – 6/10\\n\\n\r\nI noticed in Episode 12 that there were a few great songs playing during the action scenes, but other than that I hardly noticed the music at all. The voice actors for the most part are decent at best. Daichi’s voice is really annoying, but at least the VA cast has Sawashiro Miyuki as Makoto who is one of my favorite voice actors (she also voices Celty in Durarara!!). I also found Hibiki’s voice to be sub-par for a main protagonist. As much emotion as he shows, he never really sounded the part to me during those scenes.\\n\\n\r\nCharacter – 5/10\\n\\n\r\nThis would probably be a 3/10 if not for Jungo and Airi. Despite being supporting characters who are not even introduced until around episode four or five, to me Jungo and Airi were really the best characters in DS2. Their relationship was more of a big brother (Jungo) and little sister (Airi) relationship than anything romantic. Jungo is a fairly quiet, tall man while Airi is kind of a brat who talks a lot and gets embarrassed easily. When I first saw them, I thought they were kind of similar to Jesse and James from Pokémon (they’re first seen sneaking into a rebel building), but they quickly show that they are much more than that. Like every other named character in this show, they have cellphones which can summon demons to fight.\\n\\n\r\nNow onto the main cast. The main cast greatly resembles the cast of Durarara!! (main trio who look very similar, long-time rivals, and Makoto and Celty have the same VA and similar roles). I thought Hibiki was a pretty weak and stereotypical protagonist. He’s thrust into a supernatural world he doesn’t understand with an unusual amount of power and he is basically forced to save the world with said power. Daichi is just annoying. He’s Hibiki’s best friend who can only summon small useless demons at first. Nitta is a girl who has trouble comprehending everything at first as she is thrust into this world while worrying about her family. She also has a strong desire to protect everyone. I already talked about Yamato so now I’ll talk about his “rival” who he has known for years, Alcor (Ureu Mono). Alcor is a Septentrione who has the form of a human (though what’s up with his huge white eyelashes?). He is interested in Hibiki and wants to help him save the world (I think, like Yamato, Alcor’s motives are a little confusing).\\n\\n\r\nOne thing about this show (which you’ll notice as you watch the ED after a few episodes) is that it is not afraid to kill characters. I already mentioned that Yamato sacrifices people (tens of background characters get wiped out from a single attack from Septentriones many times), but this show does not give you much time to grow attached to a few characters.\\n\\n\r\nEnjoyment – 5/10\\n\\n\r\nI just barely enjoyed it enough to finish all 13 episodes. To me, this show is a butchered mix between Neon Genesis Evangelion and Mirai Nikki for the plot and Durarara!! for the characters. It’s confusing, only has two strong characters with a weak main cast, and does not even have the art or sound to really back up these huge faults.\\n\\n\r\nPros:\\n\r\n+ Jungo and Airi\\n\r\n+ The first two episodes are not bad\\n\\n\r\nCons:\\n\r\n- Weak main characters\\n\r\n- Confusing plot\\n\r\n- Music is never very strong\\n\r\n- Weak action scenes\\n\r\n- Demons are forgettable due to lack of screen time\\n\\n\r\nI would recommend avoiding this anime. Similar things such as Neon Genesis Evangelion and the Yumekui Merry manga did the “save the world from mysterious creatures” concept better, and I would recommend them over DS2.",
            "date": "2013-06-27T12:34:00+00:00",
            "helpful_count": 30,
            "mal_id": 102651,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=102651"
        },
        {
            "content": "Overall the anime was good I enjoyed it, I watched it in one day which may skew my perception of it.  Probably if I had to wait week by week for this anime I would have dropped it at episode 3.  I do not know anything about the game, nor did I read the synopsis of the anime beforehand, so I had no expectations.\r\nStory (7/10) The story was very shounen like, if I could compare it, the 13 episodes seemed fairly similar to a first arc in a shounen manga.  The characters are introduced, the main character is more awesome that theothers, and has to rise to the occasion to battle it out against the \"evil\".  \\n\\n\r\nArt (7/10) The characters were pleasing to the eye.  There were alot of scenes in which spoke volumes in terms of the story.  While Alcor and Hibiki are talking on the bridge the scene of the void taking over was pretty meaningful especially with the dialogue.  The fights in episode 10-13 were a bit different.  I felt like some of the fights were reminiscent of Neon Genesis and also GANTZ. \\n\\n\r\nSound (8/10) I am just rating this on feelings.  I liked the theme song a lot.  The ending songs were okay, but I didn't listen to them every episode or anything.  The sound during the anime was good, although I am not an elite on sound, so I wouldn't be sure.\\n\\n\r\nCharacters (8/10) I really feel Hibiki, Daichi, Io were lacking in this series as far characterization goes.  We get a flashback of the reason why Hibiki is such a do-gooder, but the director I feel did not direct it properly because it did not come off as either sentimental or that you knew more about the person.  You just came away with the feeling that he use to go with the flow of his parents expectations than one day his friend was talking about what he wanted to do in high school and BAM he changed? I don't get it. Io is the archetypical girl that you feel sorry for and gets lured into traps etc so the main character can create a miracle for her (she doesn't cry that much though so that's good).  Daichi well what can I say he is like the idiot friend that has good intentions but is just not as strong or intelligent as the main and merely becomes comedic relief.  The other characters are better, Alcor was by far the most interesting.  Some of the characters I felt were purely fan service and could have been done away with, though I am sure they appeared in the game so they had to be included.\\n\\n\r\nEnjoyment (9/10) I enjoyed it, I think it was good that it was not made into a 24 episodes.  In fact I think it would have been better as movie or 3 part OVA.  Since there are 13 episodes I expected more either character development or fight scenes, but instead air time was wasted on useless character to character dialogue on food or building up supporting characters like the Airi and Jungo, and the person with barely there clothing.  While fans of the game probably liked this, I thought it was worthless and had no point in anime adaptation.  I also liked the philosophical aspect of it, I felt that it could have been done better rather than spelling it out, it could have been symbolic but, I guess it fits shounen-like genre to spell it out for people.\\n\\n",
            "date": "2013-07-02T00:08:00+00:00",
            "helpful_count": 26,
            "mal_id": 103423,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/evelynie",
                "username": "evelynie"
            },
            "url": "https://myanimelist.net/reviews.php?id=103423"
        },
        {
            "content": "Well,this anime has it all. Lame story(basically nonexistent, its just one boss figth after another),boring characters, with no motivation, no interest and no development and mediocre music thah really wears off after one time. Even the animation, its strongest aspect, its nothing special and you can not even enjoy it because is lost from all the stupidity of the above.\r\nHowever, that its not this anime's biggest problem.The thing that really bugged me it is the fact the show never escapes from its gaming origin. It keeps remind you that its a game: the hero receives quests from the director, performs them and then returns formore. The graphics, the pauses(which by the way are just plain stupid), even the opening, they all feel like i am playing a computer game. Even the title for god's shake!I do not have a problem with animes that come from games, i even love some of them, but it becomes a problem when the staff just want to animate a game and simply do not care about anything else. The Devil Survivor 2 The animation is an anime for those that wanted to see the game animated and NOONE ELSE.Maybe not even them.\\n\\n\r\noverall i give it a 3,a poor choice to watch.",
            "date": "2013-05-09T06:50:00+00:00",
            "helpful_count": 23,
            "mal_id": 96519,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2454389.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/njjn",
                "username": "njjn"
            },
            "url": "https://myanimelist.net/reviews.php?id=96519"
        },
        {
            "content": "This is a great series, people need to understand Shin Megami Tensei is a non-casual and non-mainstream rpg series. \r\nThis was clearly made for fans of the SMT saga. But it is still enjoyable for people who actually want an anime that doesn't revolve around Friendship Power > everything. The characters are varied and likable but that's not what the anime is about.\r\nThis anime is about a group of NORMAL teenagers who end up involved in an Apocalyptic survival of the fittest scenario. This is a realistic what-if series.\r\n-What if demons suddenly appeared in your city? \r\n-What if you had an app on your phoneto summon demons?\\n\r\n-What if you were given a chance to change the world?\\n\r\n-What if you saw a clip of your friends death and he's standing right next to you?\\n\\n\r\nDropping this anime because you don't have all the answers before episode 4 is just silly. Watch the series if you want answers.\\n",
            "date": "2013-05-25T17:20:00+00:00",
            "helpful_count": 23,
            "mal_id": 98401,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1633733.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Democracy",
                "username": "Democracy"
            },
            "url": "https://myanimelist.net/reviews.php?id=98401"
        },
        {
            "content": "I picked up Devil Survivor 2 because the summary sounded interesting and not because I've played the game it is supposed to be adapted off of. The series is similar to Mirai Nikki and the two Persona adaptations. Unlike said series the plot of DS2 doesn't flow well at all, so I know the problem doesn't lie with it being an adaption off a game, particularly since both Persona adaptations turned out well despite being a game. I've also seen a few other series with a similar plot line and I was quite fond of said series. This though I was not, and that isnot a reflection on the game at all.\\n\\n\r\nGoing into the series I didn't realize that the series' plot line involved tricking fate, but after the first episode I knew that it shared a similar plot line as quite a few other series I had seen involving tricking fate. The problem is, unlike the other series the characters are not actually able to trick fate and everything turns into an over blown blood fest with no sense of direction. Interesting characters would appear, only to be killed off shortly after they appeared, thus there was no getting to know said characters beyond the basic quirks that they were shown to have in the series.\\n\\n\r\nThe plot line was also overly depressing as was the ending. My enjoyment for the series had been high at the beginning, but quickly dropped as the series progressed. It felt like the show was missing something and over all it was very bland. The art work and sound really were the only thing going for this series.",
            "date": "2013-06-27T14:18:00+00:00",
            "helpful_count": 21,
            "mal_id": 102671,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66270.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Yemi_Hikari",
                "username": "Yemi_Hikari"
            },
            "url": "https://myanimelist.net/reviews.php?id=102671"
        },
        {
            "content": "I'm a fan of Atlus games as well, including Devil Survivor series. What I like in the second game, is that it is more light-hearted than the first one. The first one is the exact definition of horror. I still love the first one though.\r\nStory 7, Art 8, Sound 9, Chara 6, Enjoy 8, Overall 8\r\nThe story is quite simple, so I won't comment much. What I like about the story in the anime and the game, is because the anime diverts itself from the game. Lots of different dead clips and events differ very much. I actually like that, since it makes me wonderwho's gonna die next, and what kind of ending will take place.\\n\\n\r\nThe art is good. It is so very like \"2013\"-ish. I like Suzuhito Yasuda from Durarara!!, so I can enjoy the art.\\n\\n\r\nI don't really pay attention to the sound, but I love the opening and the ending.\\n\\n\r\nCharacters are usually the main reasons I watched an anime. Aside from art. The characters don't develop that much, and I must say that I was quite disappointed by the developments. Hibiki's actions are actually from your typical shounen protagonists. Though I can relate and forgive it, since I thought his actions are perfectly normal for a normal high school students who were suddenly brought to the end of the world. \\n\\n\r\nStill, because I'm an ATLUS fan, I can't stop watching this anime.\\n\\n\r\nI would've put the overall as 7.5, since the core point of the anime was struck down.\\n\\n\r\nAs a bonus, I finally realized that this anime is actually very interesting. You need to watch this further deeper into the episodes to know its quality. I admit, that the few first episodes are utterly disappointing. But I can't say that again to the later episodes. It's getting more and more interesting.",
            "date": "2013-06-07T07:05:00+00:00",
            "helpful_count": 20,
            "mal_id": 100121,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/353371.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archdaine",
                "username": "Archdaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=100121"
        },
        {
            "content": "booooringgg. the first episode was quite enjoyable and i had quite the expectations for this series. the intro and outro were also quite good, so my initial  impression was quite high. however, the coming episodes (i've watched 6 so far) have led the anime astray and I'm left with easily predictable scenes and cheesy dialogue that bores me like no other anime. since the first episode my impression for this anime has exponentially dropped and unfortunately, I don't see it getting much better. 6/10",
            "date": "2013-05-15T15:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 97295,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2093215.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nevetsgnow",
                "username": "nevetsgnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=97295"
        },
        {
            "content": "I'm playing the game while watching the animation just to compare them and the two can't even be compared. The reason for the 5 on the story is that the anime feels so rushed. I know it is 24 episodes but they could have filled those episodes with the \"conversations\" the protagonist has with various characters from the anime. And worse, the animators just keep killing off the various characters that I find interesting like Otome who loves teasing Makoto about her \"crush\" on the protagonist, Joe who is so whimsical, it makes the gameplay fun, and Keita who is such a lone wolf heis funny. Not only that, some characters are so out of OOC like Yamato who is cynical and sarcastic instead of being a total grunting guy, Fumi who is suppose to be crazy, and the protagonist who is suppose to be cool instead of a normal guy. The biggest fail is the character deaths because each character is awesome with a lot put into them so killing them off with no character development is just stupid, especially considering the fact that fans of the game will definitely watch this and will hate it for destroying their hopes. The fight scenes are too short and superficial, and the characters don't seem to be able to learn demon powers, which is a turn-off. The graphics and animation itself is good but that can only improve the anime by so much. All in all, not really satisfying but watch it if you like.",
            "date": "2013-05-26T10:50:00+00:00",
            "helpful_count": 15,
            "mal_id": 98491,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/trannon1",
                "username": "trannon1"
            },
            "url": "https://myanimelist.net/reviews.php?id=98491"
        },
        {
            "content": "When the preview for this anime came out, I practically fangirled like crazy because I played the game version of this. I actually didn't finish it because I didn't like spoilers, so I decided to finish the anime before I continue playing. I seriously thought it would be awesome. The first game was pretty nice and I expected the anime of the second game to be just as good. BUT BOY WAS I WRONG. Most of the characters were lame, story was predictable, and everything was just plain boring. Seriously, Hibiki's actions are SUUUUUPPPERRRR predictable, I had to fast forward the anime just so Ican see if I'm right. And I was. Boy was I let down.\\n\\n\r\nThey should've animated the first one instead. The storyline and premise were better in DS1. It got the \"survivor\" part quite well and it was also much darker than DS2.\\n\\n\r\nGave it a 5 because OP and ED were cool.",
            "date": "2013-05-20T03:17:00+00:00",
            "helpful_count": 14,
            "mal_id": 97771,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/406941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gumi-tan",
                "username": "gumi-tan"
            },
            "url": "https://myanimelist.net/reviews.php?id=97771"
        },
        {
            "content": "Oh man, going into this anime I honesty had high hopes. I really should have known better.\r\nStory\r\nThe start of the anime was pretty good. It starts with two normal high school living their normal lives, while going to someplace somewhere to do something they see a beautiful girl by herself. While talking about her, they get a video showing their own deaths and the show begins. It starts somewhat strong and interesting but as the story continues it starts making less sense and becomes extremely boring to watch. \r\nCharacters\r\nAll the characters are bland and weak except for Hibiki (he's boring, just not weak) the protagonist.All other characters play unimportant roles (except for the guys with white hair), HECK the other two that were with Hibiki were only there to try and be characters who the audience could sympathize with and to be a \"reason\" for the protagonist to fight. Hibiki is honestly no better than any other character, the only reason why he's more likeable than the others is he's strong and the others aren't. He's the VERY DEFINITION of a generic main character, but hey it is a game adaptation.\\n\\n\r\nArt & Sound\\n\r\nThe only thing that saves this anime is it's good art and animation. The characters look nice and the battles are nicely animated but very boring to watch after the first few fights. The music didn't really stand out much except for the ending.\\n\\n\r\nEnjoyment\\n\r\nI really forced myself to watch this anime often going into a trance like state causing me to miss most of what happened in the current episode.\\n\\n\r\nOverall\\n\r\nI really forced myself to watch this anime often going into a trance like state causing me to miss most of what happened in the episode. This is a really big reason why I try my best to not get hyped for anything (I still don't know why I was even hyped for this anime).\\n\\n",
            "date": "2014-05-11T19:42:00+00:00",
            "helpful_count": 10,
            "mal_id": 143043,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3372655.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/EyeBall1844",
                "username": "EyeBall1844"
            },
            "url": "https://myanimelist.net/reviews.php?id=143043"
        },
        {
            "content": "Devil Survivor 2 is an adaptation of the game developed by Atlus. Opinions about this anime will be different from person to person \r\nThis review shall be made taking into account the game, I played it long before seeing this adaptation.\r\nThe anime had potential to become one of the best of this year 2013 if the creators had taken more seriously the game, in my opinion i believe that neither they played it and only guided themselves by summaries of the game (who knows? Seems like it to me).\r\nI'll start by comparing the anime and the game in several areas:\r\nStory: The story in this animegoes way too fast.\\n\r\nThe game had many missions that didn't belong to the main story but that affected the course of history and all of them were not shown in this animation.\\n\r\nThe anime is just 13 episodes and that affected the character/character development and the moste important, the finale ! I would not mind if the anime had 2 seasons if that meant covering all parts of the game.\\n\r\nI still don't believe they skipped the battle beetwen Hibiki and Polaris (major flaw!).\\n\\n\r\nCharacters: The characters are not well developed and some even only appear in 2 or 3 episodes and the relationships between some are a bit forced due to the reduced number of episodes. In the game, you have the opportunity to socialize and get to know better each character and their problems and their life before the invasion but the reduced number of episodes made it impossible.\\n\\n\r\nSound: In my opinion the soundtrack from the anime meets the recommended and has a great ending (better ending in this summer for me), as well as the OST fits well.\\n\\n\r\nBattles: The battles in this anime were good but could have been more and better, if the anime had traversed the whole game we would have the opportunity to see more demons and various attacks.\\n\\n\r\nThe final battle (i do not want to spoil) is too short in my opinion and could have more drama and more action.\\n\\n\r\nThe games of the saga shin megami tensei are famous for having a great story to develop and its interaction with all the characters and addictive battles but the anime was slightly below expectations but i disagree when people say it was a failure because i found it nice to see one my favorite games adapted for television.\\n\\n\r\nWho knows  if they do not make the adaptation of the first game Devil Survivor, but this time done by taking better account of the game.\\n\\n\r\nI hope this review helped you in some way and always remeber :\\n\\n\r\nLET'S SURVIVE !",
            "date": "2013-08-14T06:25:00+00:00",
            "helpful_count": 10,
            "mal_id": 109579,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2469971.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Goukakyo",
                "username": "Goukakyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=109579"
        },
        {
            "content": "I am in love with this anime at the moment! The use of supernatural powers and the characters who are so easy to fall in love with. The story line is like a breath of fresh air and its not too difficult to follow as the events unfold. \r\nTo begin with i assumed it would be yet another predictable anime but as each episode is aired something unexpected turns out. There is a strong theme of power and hierarchy, although it is not overwhelming as it has the portrayal that the power would be easily taken away.  \r\nThis anime is one that you canfall into, you lose yourself in the story and it's not very often that an anime can actually do that for me. As the anime spans out over seven days it is very short but not lacking when it comes to action, not only that but the feeling of self sacrifice is almost overpowering, but it is a brilliant anime. I recommend this to anybody who enjoys action packed animes.",
            "date": "2013-06-15T14:32:00+00:00",
            "helpful_count": 9,
            "mal_id": 101177,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2427129.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ajlashleigh",
                "username": "ajlashleigh"
            },
            "url": "https://myanimelist.net/reviews.php?id=101177"
        },
        {
            "content": "Note: Spoilers are in this review. I tried my best, but I can't really give a good critique without implementing them. \r\nFurthermore, I could not avoid comparing this to the game. Still, I reviewed this on its own merits. I have played Devil Survivor 2: Record Breaker for the 3DS for 100+ hours, so I have a good grasp on the game’s strengths and weaknesses.\r\nI’ve sometimes wondered why Shin Megami Tensei games don’t get adaptations, but then a bit of thinking always leads me to the answer: many of them would be the same. See, since the core SMT series typically boasts multiple endings, thestudio would have to adapt one, and the one it chooses to adapt would be the Neutral route, as that would probably have the most story. This is why we see more linear games (plotwise) like Persona 4 get adaptations. Devil Survivor 2, the second in the Devil Survivor branch of SMT games, has a tone right in between SMT and Persona. The game is considerably more lighthearted than its parent series and its predecessor, and even though it has multiple routes, they’re very similar to each other. So, how does the anime adaptation work out? Not well, I’m afraid.\\n\\n\r\nDevil Survivor 2 the Animation is based on a manga that is based on the game. It follows the main character, renamed Hibiki Kuze, a bunny-eared hoodie wearing high schooler. After signing up for a macabre site, Nicaea, that promises to show death videos, or clips of people dying, the world seems to turn upside down; a subway train crashes, monsters only describable as demons pop out of peoples phones, and mysterious invaders called the Septentriones threaten the balance of the world itself. Hibiki, who has a greater potential than others, can summon stronger demons like Byakko; as a result, he and his friends are forcibly enlisted into the government agency JP’s (pronounced Jips) to fight against these monsters. Hibiki often comes into conflict with the cold and ruthless leader of JP’s, Yamato Hotsuin. He also comes into contact with a number of different people, most noticeably the Anguished One, an enigmatic being who knows more than he’s letting on and is decidedly not human.\\n\\n\r\nThe plot of the original game was never its strong suit (with plenty of dumb anime tropes and stuff like \"The Dragon Stream\"), and for the most part, the anime doesn’t strengthen it. Urgency and despair are rarely felt, despite it being a Shin Megami Tensei title; honestly, this doesn’t play out as anything other than a disaster-based anime, much like films such as Twister and San Andreas. Where the game did excel, however, was with its characters. A total of 14 main characters rounded out a robust cast in the game, and each character had enough time to be fleshed out. Even Hibiki bucked the trend by being a rather witty hero, calling people tsundere, nicknaming them, and flirting with everyone to no end. The cast was creative.\\n\\n\r\nThe anime doesn’t do that. Almost every character is reduced to a singular trait or trope, or even less so. \\n\\n\r\nDaichi? Good friend of Hibiki, and dumb comic relief (A recurring gag has him yelling \"My Demons are weak!\" which gets old fast). \\n\r\nIo? Dandere who seems to like Hibiki. \\n\r\nMakoto? Serious. \\n\r\nFumi? Uncaring.\\n\r\nRonaldo? Justice. \\n\\n\r\nCharacters like Joe, Otome, Airi, Jungo, Hinako, and Keita don’t even get an iota of development to make you give half a shit about them. Joe's a guy, Otome's a doctor, Hinako dances, whatever. Not a shred of their personality or motivations are retained from the game. The most we get is maybe one or two stills (quite literally stills, not even a scene) worth of flashback for Airi and a short scene for Makoto. Hibiki might be one of the worst off; after having such a creative personality in the game, and then having the voice actor to be able to match (Hiroshi Kamiya, who also did the manic Araragi from the Monogatari series). Hibiki is reduced to nothing more than a serious shounen hero who wants to save everyone. Hooray for a generic hero. \\n\\n\r\nAnd, well, it also doesn’t really help that pretty much everyone dies in an extremely haphazard manner. In the game, Death Videos were supposed to be avoided by arriving in a timely fashion. And while the game had time to let you feel the weight of your incompetence, no such element exists in the anime other than Hibiki beating himself about it, as you can't connect to many, if any, of the characters. In one of the early episodes, the character Keita is introduced, only to die in that same episode. The end of the series gets particularly dumb, when pretty much everyone dies in rapid succession.\\n\\n\r\n(Incidentally, during a fight with the Anguished One, Yamato avoids getting killed. Somehow. Despite being exploded upon. Never explained.)\\n\\n\r\nAs far as characterization goes, it’s not an entire wash. The Anguished One is roughly the same as his game counterpart, but the clear “winner” is definitely Yamato, who’s roughly the same as he is in the game. However, he’s significantly more ruthless in this anime than he is in the game, and that produces mixed results. On the one hand, Yamato is permitted extra development even over the game, especially through his childhood and his interactions with politicians that led him to his meritocracy beliefs. On the other hand, Yamato is hard to sympathize with on almost any level; the game, which allowed you to join him in his quest for a meritocracy, included a few light moments, made him a much less “evil” character than he is in the anime. \\n\\n\r\nIt’s because of this overall weak characterization that prevents the extremely talented voice cast from reaching their full potential. There’s a dynamite Japanese voice cast featuring a very strong list of A-list seiyuus, but bland characters can’t really be saved by good voice acting. No one performance is bad (far from it!), but the only one who stands out is Junichi Suwabe as Yamato, even if his great performance only serves to make Yamato more unlikable. \\n\\n\r\nUltimately, all of this can be attributed to rushing, only highlighting the plot points. A playthrough of a route, even quickly, can take around 15 hours, and while not all of that is plot all the time, everything feels stuffed into this 6 and a half hour adaptation which focuses only on the major plot points. If I had to appreciate the plot in any way (besides them somehow paying a lot of attention to the fusion recipes: they were all correct!) it would be the fight with Lugh, which was much plainer in the game.\\n\\n\r\nThankfully, we have some strong animation here. Maybe after seeing a bunch of semi-static sprites all of the time in the game lowered my standards, but the animation is always clean and consistent. A-1 manages to make the demons look terrifying, and the character models by Durarara!! and Danmachi artist Suzuhito Yasuda are brought to life here, with a focus on details. While other aspects of the anime may be suspect, Seiji Kishi does a great job of directing this series, and the cinematography is quite well done. \\n\\n\r\nThe fight scenes are a mixed bag, much like the Persona 4 animation; like that, it feels like glorified Pokemon, which is definitely not what Shin Megami Tensei is. To its credit, the fight scenes look pretty enough, but their length, choreography, and character interactions (which is mostly reduced to yelling stuff like “Go Byakko!”) leaves plenty to be desired.\\n\\n\r\nYou shouldn’t have much of a reason, if any at all, to watch this anime unless you’ve played the game (or fall into a group where you don’t own a 3DS but like the SMT and Persona series). Maybe for morbid curiosity, but not much else. My main reason to watch this was to experience the Japanese cast, which is unavailable to me unless I buy a Japanese 3DS and a Japanese version of Record Breaker, but thanks to the uninspired characters, even that isn’t a good enough reason. I’d recommend you skip this series. It has its strengths, but its weaknesses far outstrip them. But buy Record Breaker if you have a 3DS.\\n\\n\r\nScore:\\n\r\nStory - 4\\n\r\nArt/Animation - 7\\n\r\nSound - 7\\n\r\nCharacter - 3\\n\r\nEnjoyment - 5\\n\\n\r\nOverall: 5.1 (Rounded to 5)\\n\\n\r\nEDIT 6/29/2015: Made a dumbass mistake that Otome was a nurse. Sexism is alive, folks. Corrected to doctor.",
            "date": "2015-06-22T12:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 190932,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3362033.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SNaG21",
                "username": "SNaG21"
            },
            "url": "https://myanimelist.net/reviews.php?id=190932"
        },
        {
            "content": "Devil Survivor 2: Dubious Massacre Too\r\nAfter Seiji Kishi's wildly successful anime adaptation of Persona 4, it was only natural we would see him tackle another popular Atlus video game franchise, right? That's what we got with Devil Survivor 2, a 13 episode series produced by a relative unknown in the anime industry, Studio Bridge. Considering the success Kishi had with Persona 4, we could expect the same great things with Devil Survivor 2...ah expectations...how you never cease to fail me.\r\nThis series is the very definition of the phrase \"all style and no substance.\" Devil Survivor 2 is a GORGEOUSLY animated series with production values throughthe roof. However, Kishi faces the same problem he had with Angel Beats...he tried to cram way too much into too little of space. Devil Survivor 2 is supposed to be a character driven series with well fleshed out characters to drive a dark, horrifically bleak plot. However, since Kishi only had 13 episodes to work with, this series felt rushed in its character development (or lack there of) and it resulted in the series not having the \"impact\" it should've had. I will warn you right now (as if you couldn't tell from the title), there is a lot of death in this series. However, like I stated, due to the characters not being fleshed out, their deaths have very little impact, at least not as much impact as they should've had. \\n\\n\r\nAs far as the story is concerned, it revolves around a graduating high school student named Hibiki Kuze, who is hanging out with his best friend Daichi Shijima after college entrance exams. While hanging out, Daichi shows Hibiki a phone app that shows people their faces when they die. While waiting for their ride in the subway, they encounter a girl from another class named Io Nitta, someone Daichi has a crush on. While waiting for their ride, they all get messages of their dead face clip of the train derailing and killing all of them, and all given the choice by the app if they want to live or die. By choosing to live, they avoid a near death experience when the train does derail, but their worlds will never be the same after this event as they discover that the end of the world is at hand and they'll have to fight to survive. Overall, I did find it to be an interesting plot that at least kept me interested in how this world was coming to an end. However, in my opinion, a story is only as good as the characters that drive it...and that's where this series took a turn for the worst.\\n\\n\r\nThe characters were so underdeveloped that it was sad. While I don't think the cast nor the characters themselves were necessarily terrible or unlikable, the problem was ALL of them were underdeveloped. After the first few episodes, Kishi gives us the impression that we need to be invested in Hibiki, Nitta, and Daich and their growing friendshipi. However, other than learning about all three of them trying to get into college, we learn next to nothing about them. We don't learn anything about what shaped their personalities or their motivations, and other than a short flashback later on in the series, there is absolutely nothing displayed about Hibiki's back story. That's where the problem with this series lies. The nature of Shin Megami Tensei games for the most part, is the choices you make to develop your character. However, when you have a contained anime series, the choices need to be made by the production staff...but in this instance, Kishi didn't make any choices and left the characters open for the viewer to make their own interpretation about them. That sort of practice works fine for a video game, but not when you're telling a story, especially in an anime series format. It was an odd choice because in Kishi's prior work (Persona 4), Yu Narukami, the series lead was fleshed out and the production staff did choose how to develop him. I'd say this is one instance where Kishi should've followed his own prior example. While I mentioned it earlier, this series had way too many notable characters to completely cover in a 13 episode format. There were 14 notable characters that were either main characters or incredibly important supporting characters. However, when you only have 13 episodes to work with, it's impossible to flesh out every single one and when you have a story as active as this one, there just wasn't enough time to cover both bases. I'll give this series a little bit of credit though. Alcor was one hell of a memorable character due to his bizarre appearance and unorthodox behavior...but even that feels like a drag considering how forgettable all the rest of the characters are.\\n\\n\r\nThe MAJOR saving grace for this series should come as no surprise. It's the animation and music. The production value of this series was incredible. The animation was crisp and provided a dreary setting and the high-quality music provided a bleak mood (even if the characters didn't). While this series only had 13 episodes to work with, I'll at least admit Studio Bridge went all out with it. I found the demon designs and the fight scenes to be incredibly fascinating and certainly does justice to the wonderful universe Shin Megami Tensei has to offer. My one complaint (albeit minor) is I found the character designs, primarily the costume designs, to be rather silly for a series of this magnitude. While I know it's probably derived from the series directly, I found some of the character costumes to be downright hilarious, from Kuze's rabbit eared hoodie, to Hinako's breast flop top, to Fumi's swimsuit with a full-length cape. It's pretty sad when a series this ominous can make you chuckle from just mere costume designs.\\n\\n\r\nAll-in-all, I can't help but feel disappointed by this series. This was one series I was looking forward to the most when this season started and it left me feeling discontent. When a character driven series has really shallow character development, you have problems. It's just hard to get invested in a series where there is such little development between the characters throughout. I will say this series did have a pretty strong finish with its last two episodes, however, by then, the damage was done. While I thought the final episode was a strong finish to a weak series, some people might get a little turned off by its Mai-Hime-esque conclusion. I'm not sure how this series works as an adaptation since I've never played the video game, but as an anime series, it failed to deliver in a lot of ways. Now, the question is, who would I recommend this to? Well, I'd say if you liked other video game adapted or inspired anime like Persona 4 or Persona: Trinity Soul, you might enjoy this. However, a viewer that loves being invested in character over plot is more than likely going to find this to be a difficult watch. I hate to say it, but I have a feeling that I'm going to say by the end of the year that Devil Survivor 2 was unfortunately one of the more disappointing anime of 2013.",
            "date": "2013-06-27T14:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 102679,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=102679"
        },
        {
            "content": "I honestly cried at the end because even when everything was sad during the story, they made the ending a super happy one and I seriously think this is one of the best Anime about Devils ever made. I liked it because the art was cool, the story plot was weird yet amazing, in the English version the voices weren't bad, and the characters had new surprises in every episode with great personalities fitting each of their looks. I loved and enjoyed it so I hope you will watch it and feel the same way I did watching Devil Survivor 2: The Animation!!!",
            "date": "2015-03-01T16:37:00+00:00",
            "helpful_count": 7,
            "mal_id": 181486,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4123057.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shiro-tama",
                "username": "Shiro-tama"
            },
            "url": "https://myanimelist.net/reviews.php?id=181486"
        }
    ],
    [
        {
            "content": "Devil Survivor 2 The Animation\r\nAnime Adaptation of the Atlus game Devil Survivor 2\r\nLet's start with the story. Personally, I love apocalypse-themed stories. Devil Survivor 2 gives you that feeling. Who will survive, will you be dead or alive. Though not much thrill as expected, it's still good enough. The plot twists are awesome! Rating: 7\r\nArt. The art is SMT-styled. The characters don't look like each other - unlike some animes with characters that resemble someone else. I love how they animated the demon summoning and things. Gotta love the flying ice-cream. Rating: 8\r\nSound. Oh my Gosh. The OP and ED themes are awesome! Them rightit is! And when a character dies, they're stripped off the ED. And the soundtrack just fits the anime well. Rating: 9\\n\\n\r\nCharacter. Hibiki is the typical Ash-like protagonist. I'll protect you blah blah blah. They should've made him more awesome-er and funnier. Yamato is made more evil and Hibiki made more cliche. I hate how they messed with the characters. Oh, and Io is supposed to be more shy. Rating: 5\\n\\n\r\nEnjoyment. I don't really recall some 'fanatic' moment with me and the anime. Let's just say we just want to watch how it ends. Enjoyment is fair. Rating: 6\\n\\n\r\nOverall Rating: 7\\n\r\nThe story, art and sound are awesome. Characters are messed with, boo. Enjoyment, really not much. But you have to admit, we all want Hibiki's jacket.\\n",
            "date": "2013-08-09T05:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 108913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2785479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Uitchou",
                "username": "Uitchou"
            },
            "url": "https://myanimelist.net/reviews.php?id=108913"
        },
        {
            "content": "Tokyo gets mysteriously and very suddenly trashed. Monsters start coming out of cell phones and the main characters use their poke... er, um... demon summons to fight them. This, of course, attracts the attention of a shadowy government organization that is tracking just that sort of activity with some kind of sciency looking stuff. The men in black capture our heroes, take one of them aside, and explain to him that they are JP's:  an organization established with a great deal of exposition. This pretty much sets the stage for... a great deal more exposition. Did I mention that the demons look and soundridiculous, or that nobody ever needs to charge a phone? \\n\\n\r\nYet for all its idiocy, this show is actually not that painful to watch. Some readers are, no doubt, asking why I can say this about a show filled with clichés and bad running jokes. Here's a question in return:  why do people watch action movies? Many have an inherent silliness, yet they can be surprisingly immersing. \\n\\n\r\nI recommend abandoning this show if you haven't decided you like it by midway through the second episode. Actually, I only say to give it that much time because I have seen comments all over the place saying that the first episode isn't as good as the rest, and a few that say it gets worse as it goes along. I don't know where all of that came from. The quality seems pretty consistent throughout. In fact, that's why I finally got bored and looked for spoilers. Sure enough (according to what I was reading), it ends exactly the way I would expect it to, and seriously, a lousy ending is one of my pet peeves.",
            "date": "2013-10-15T19:14:00+00:00",
            "helpful_count": 7,
            "mal_id": 117001,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 0,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 0,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=117001"
        },
        {
            "content": "Devil Survivor 2 The Animation is an adaptation of a well received game from Atlus's famous franchise Shin Megami Tensei. The game is one of my favourites and I enjoyed it thoroughly. But this anime adapatation is a downer, to say the least.\r\nThe story is quite simple, the world will end in seven days, demons have appeared in Tokyo, there is a website that tells you when your friends will die, each day there is a boss. Now, that premise works well on a videogame, since everyday there are lots of optional events you can do, like a free battle, talking to a party member,training, etc. \\n\\n\r\nThe one thing that they handled horribly was the pacing. The game isn't long, but not short either, but there was no possible way 7 days of gameplay could fit into 13 chapters. As a result, the pacing was too rushed, with boss battles every two chapters or so and little time to develop the characters and story. And since they couldn't spend too long on anything, most of the battles are won by asspulls, like stronger demons out of nowhere or the power of friendship. The moral dispute between the characters is handled poorly because there is no development. \\n\\n\r\nSince it also strayed from the original source, many important characters were reduced to mere fodder. The 13 summoners are your party members, each with interesting personalities, roles and skills. But only a few are explored and the rest, well...don't expect more than 10 minutes of screen time. One of the problems when adapting rpgs with silent heros is giving them personality. In game, they are a reflection of what you think, YOU decide what to do. The game gives you the fun of choice, but in the anime, the hero is given a personality and a name. Hibiki Kuze is the name given to the silent bunny hero from the game. To be straight, he is the epitome of a generic, boring shonen hero. That, and he is insanely OP, him being the biggest plot device from the anime.\\n\\n\r\nThe soundtrack is good and the art and animation are bearable. The opening was nothing too special but I enjoyed the ending. Being a fangirl of the game I set my expectations too high only to be disappointed by a rushed mess of an adaptation. \\n\\n\r\nThe main reason my score is relatively high is because my husbando Yamato appears and was developed more than the others at least. And also because I'm biased.\\n\\n\r\nSo, if you aren't already a fan of the game, this anime isn't for you. But if you watched it and thought it was bearable, you should play the game. \\n",
            "date": "2013-09-23T20:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 114021,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2094441.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Falcie",
                "username": "Falcie"
            },
            "url": "https://myanimelist.net/reviews.php?id=114021"
        },
        {
            "content": "While the concept in this anime is pretty cool, the characters and story line fall short. It's kind of mix of digimon mixed with yuigoh except people summon with their phone instead of cards, etc. Seems less childish and corny that way I guess. While the summoned demons are pretty cool, the characters are ehh. \r\nThe main character is such a goody too shoes I just can't ever relate to him. He's just TOO good to be true in my honest opinion that it makes him seem unrealistic, childish and foolish. They did show us a bit of his past as it being a roughchildhood, but it just wasn't enough to really give us any relation. The rest of the characters are just your typical run of the muck characters you find in a ton of anime. I really didn't get the relationship with the main character and the main antagonist at all. The Main (Hibiki) referred to the antagonist (Haruto) as his friend when I never really saw any sort of relationship whatsoever in the anime between these guys other than \"Hey you Hibiki do my bidding or else...\" and like a moron Hibiki complies. It seemed more like a bully pushing around people instead of trying to understand each other. So the way they ended it was just plain dumb.\\n\\n\r\nStory wise it just seems to just pop out of nowhere without explain certain characters, monsters, etc. It just seems to have left so much unclear. Just a small minor explanation with no certain motives on why the Septenriones and their master wants to destroy humankind other than the typical \"humans are destructive\" moniker. \\n\\n\r\nIn all I thought this could've been much better. Music and artwork was pretty good, but just like Guilty Crown it completely falls flat in the characters and story departments. In the end it just ends up a mediocre anime at best. 5/10",
            "date": "2013-07-05T02:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 103893,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=103893"
        },
        {
            "content": "I started this anime without really high expectaitions, so I was positively surprised when I watched it. \r\nFirst, the story:\r\nI really liked the setting, though I expected something diefferent. I thought it would be more game-like, because that's what I read in an recommendation before. But it isn't really a game in wich they have to survive and there wasn't really the goal to win against the other \"players\", they fought more or less together against some god-like things. But I think it was better like this. The story was well-paced and though it were only 13 episodes, it didn't proceed to fast. It wasexciting when they fought and you couldn't tell already 5 minutes earlier if someone was about to die or not. Also, I liked the development it took towards the end. Only the end as such was not too great. I don't know, but it wasn't so exciting. Just the few last minutes could have been a little bit more...how to put it without giving spoiler...well okay, you'll see. If you don't, that's okay, too, But it left me a little bit like that: \"Oh, it's over. Okay.\" I wasn't dissatisfied, but I didn't think: \"That was it, Great! Just..Great!! I'm impressed!!\" And that is somewhat what a really good ending should be like. \\n\\n\r\nSo now the art:\\n\\n\r\nI really liked the art. It was nice to look at and the characterdesings were really cool. I especially liked Alcor's design, he looked kinda special. Okay, his eyes were strange because they were white around them - I identified it as extreme long white eyelashes but some people also say it was makeup. I don't care, it was strange but gave the character a very special feeling and I liked it. Okay, the women were all a bit too curvy if you'd ask me, but it didn't really annoy.\\n\\n\r\nThe sound:\\n\\n\r\nThe sound did what it should do, I wouldn't say it was very special but it delivered the mood, so it's okay. I liked the opening. But all in all it didn't really stand out. \\n\\n\r\nThe characters:\\n\r\nThose were really, really cool, I think. My favorite is definitely Alcor. I think he was somewhat really cute and I liked the way he cared for the humankind. It is difficult to write about him wothout giving spoilers, but all I can say is, he really, really is cool and his way to see things was interesting to me. Also, he had a quite nice character-development.\\n\r\nHibiki was cool, too, but he didn't have that certain something that made me like Alcor that much. He was calm and that without being heartless - I liked that. But there wasn't much more to him than that, to be honest. Then there was Yamato. He was somewhat cool, I must admid, buuut - in the end he just pissed me off. He is a good character and I didn't lose all sympathy for him 'till the end, but...in the end, he was just so...you will see. His extreme stubbornness and elitist thinking were pissing me off in the end. Daichi was not obviously special, but his uncertainity made him somewhat liekable. He didn't really develop in the beginning and to be honest, he didn't develop in the progress of the Anime, too... but when he did in the end, I was somewhat proud of him and liked him even more. Plus, he was important for the character-setting, I think, because he somewhat lightened the mood. I think this anime could have been somewhat depressing without him...I don't really know, but there was really no woman I really liked in this anime. There were good composed characters, but I just couldn't really like them. Io was somewhat boring, but not annoying. Makoto was okay, no, she was actually quite cool. She wasn't so \"perfect\", if you know ehat I mean. She had to handle an inner conflict and always struggled between what was \"right\" and what she wanted to do. Yes, she was really okay, but I didn't really care for her.. And Kanno Fumi was okay, too. But I didn't sympathize with her. I think that was because her motivations and stuff were never really explained, if she even had something like a motivation...she didn't really seem to care.\\n\r\nIn the end, I'd say the male characters were definitely cooler, but the female characters didn't annoy, either and that is already something if you watch at all the annoying anime-girls in so many animes....\\n\\n\r\nSo my conclusion:\\n\r\nIt was a really nice Anime worth watching it. I liked the conflict it thematized; the question what was right and what wasn't, and I liked the way the characters were. I had a good feeling with them all and Alcor was just great. The Anime didn't get me too excited, though...it was good to watch, well-paced and had a certain depth. Well the fights were exciting, too, but the whole Anime didn't make me feel too strong with the characters..I didn't cry and wasn't happy with the characters, like it is with some other animes. Okay, I felt with Alcor, but he is special. *^* \\n\r\nIn the end, I'm really glad I watched it and would recommend it to everyone who likes apocalypse-settings, interesting charakters and big monsters/demons.",
            "date": "2015-02-27T06:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 181316,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4332715.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hisoka_kanjou",
                "username": "hisoka_kanjou"
            },
            "url": "https://myanimelist.net/reviews.php?id=181316"
        },
        {
            "content": "It should be noted that this is my first review on this site, and I never played any of the Devil Survivor games.\r\nDevil Survivor 2 The Animation: A perfect example of an anime that'll draw you in with a great sounding synopsis and fantastic looking art. But looks can be deceiving, and that's certainly the case with this anime in particular. It's a show that bubbles with potential but only ends up fizzling out in the end. \r\nStory: 5/10\r\nBelieve me, the plot of this anime is in no way original or ground breaking. It's pretty predicable if you ask me. But I found that evenwith it's flaws, it was just good enough to make me want to complete the series. It starts out slow, but eventually begins to pick up about halfway through.\\n\\n\r\nArt: 8/10\\n\r\nThe art is probably the strongest aspect of this anime. I thought the art was pleasing to the eye, and the battles against the Septentrions were always very entertaining and looked fantastic.\\n\\n\r\nSound: 7/10\\n\r\nI really like the music they used for the opening and the ending. The soundtrack for the anime really fit the anime and fit with what was going on.\\n\\n\r\nCharacters: 3/10\\n\r\nThis is where the anime really crashes and burns. The biggest problem with Devil Survivor is that you feel nothing towards the characters. There's pretty much no character development, no back story. You don't really care what happens to them. If one dies you don't cry or feel much of anything but, \"Aw, they died, that's too bad.\" I feel like this anime could have been a lot better if they had given us some insight into these characters and what they were really like.\\n\\n\r\nEnjoyment: 4/10\\n\r\nThis anime had it's enjoyable moments, but for the most part it wasn't anything that I was super excited to watch. I wasn't addicted, I wasn't hooked. Really I just watched it because I had too much time on my hands.\\n\\n\r\nOverall I give this anime a 6. It's characters and story were pretty bland, but it's art and sound saved it from being a complete train wreck. I'd say unless you are completely bored out of your mind or have nothing else better to watch, try to avoid wasting your time on this show.",
            "date": "2013-08-06T17:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 108553,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2738897.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lavendertea",
                "username": "lavendertea"
            },
            "url": "https://myanimelist.net/reviews.php?id=108553"
        },
        {
            "content": "Going into this series I had absolutely no expectations, I went into it blind and I think that helped my enjoyment of the series.\r\nStory: The story's pretty simple in the beginning.  Similar to Gantz, the main characters die in the first episode and get the chance to live again.  However they have to defend themselves against the demons that now plague the land, known as Septemptrians.  The story really gets rolling about halfway through, the ending is especially awesome.  It reminds me of Wolf's Rain in a lot of ways.\r\nArt: The animation was good, I really have no complaints.  Ilove the designs of all the demons and creatures.  They all looked badass and awesome.  Especially Cerberus and Byakko.\\n\\n\r\nSound: This is a sentai dub, so naturally I enjoyed it for the most part.  I'm pretty much a sentai fanboy.  I shamelessly bought the series blind because one of my favorite actors Greg Ayres was in it.  He played a very good Daichi.  Peter Poole as Hibiki was especially awesome, he's even a newer voice actor.  That makes me very excited for his future rolls.  And then Jessica Boone played Io, and did a fantastic job.  I loved her in Princess Tutu, as well.  I also like Illich Guardiola's role as Alcor.  He's another talented actor with a very unique voice, he's easy to pick out in a show.  John Gremillion as Yamato was a surprise.  He did so much better than Hakuro in Utawarerumono.  It's great to see how he's grown.\\n\\n\r\nMy only problem with the dub is that the minor character performances were a bit bland.  That could be the lack of character developement, however.  Which is the result of time restraints.\\n\\n\r\nThe opening and ending themes were catchy.  I can't get the opening out of my head, currently.  It made it hard to get to sleep last night.  Totally going to find them and listen to them over again on youtube.\\n\\n\r\nCharacter: With the exception of the three main characters, the rest of the cast was mostly uninteresting.  I only really got attached to our main leads.  As previously stated, the supporting cast struggled to stand out for me.\\n\\n\r\nEnjoyment:  In the beginning I only somewhat enjoyed it.  It was enough to keep me watching, but I wasn't dying to watch more.  Only when I got to the last half of the series did I really find myself liking the characters.  It made me cry, which I wasn't expecting at all.  \\n\\n\r\nAnother thing I enjoyed was the philosophy at the end of the series.  I won't go into too much detail,, but that was the most interesting aspect of the series.  The biblical references also added to the philosophy of living and wanting to survive.  \\n\\n\r\nOverall: This series surprised me immensely.  Especially one based on a video game.  I enjoyed the story and main cast, and the dub was solid, albeit had it's flaws.  If you're going into this show without expectations, you'll probably enjoy it.  I haven't played the video game franchise it's based off of, so I can't say if that's a reason to watch it.  It's at least worth checking out in that case.  If you're looking for a fun show that gets darker as it goes on, and if you like philosophy, I would definitely recommend Devil Survivor 2.  This series is licensed and available from Sentai Filmworks.  Please support the official release.",
            "date": "2014-09-24T07:14:00+00:00",
            "helpful_count": 6,
            "mal_id": 161887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/267203.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DynamicDylan",
                "username": "DynamicDylan"
            },
            "url": "https://myanimelist.net/reviews.php?id=161887"
        },
        {
            "content": "Seriously, what is the meaning of life?\r\nHonestly, when it comes to game adaptation, I always have the lowest expectations because I know most game adaptations might not fulfill the requirements the game had to offer which results in poor ratings. I have completely forgot about 4/5 of this anime. But as I think about this anime, I am leading into a more \"I don't like this anime\". I will explain them as I move along.\r\nSTORY (2):\r\nThe 3 protagonists Hibiki, Daichi & Nitta were thrown into a virtual world whereby in order to protect Japan, they have to defeat the Septentrions. Yamato Hosuin, the leader ofJP, recruited 3 of them to join their force in destroying the Septentrions and many things start to happen. \\n\\n\r\nThe story was full of plot holes and cliches and the battles were not epic at all. I couldn't get invested in the story and the characters which is very sad because when I watch anime, I am always interested in the story and characters and how they deal with life. I will explain in full detail on the animation, characters and my final thoughts of this anime.\\n\\n\r\nART & ANIMATION (1):\\n\\n\r\nThe animation is so dull which means the animation was so bright on some parts while the animation was so dull on some parts like watching a near-black screen.\\n\\n\r\nThe anime also made use of \"Baka & Test\" when they summon beats and especially when Airi summons \"Caith Sith\" a reference from Final Fantasy 7. However, in FF7, Cait Sith was designed with a cat on top of a huge monster. Well, I don't even know how to describe that. These references are negated by the dull animation.\\n\\n\r\nIf you want to pull the audience in, you have to make the animation look fantastic, not dull.\\n\\n\r\nSOUND (3):\\n\\n\r\nThe opening and the ending was forgettable. I just forgot about the opening and ending theme. Even the music in the anime was not memorable, I just didn't care about the music.\\n\\n\r\nCHARACTER (1):\\n\\n\r\nOh boy! Don't get me started on the characters. The characters are all unlikable and annoying with the exception of Yamato and Alcor. The 3 main characters are like Twilight characters.\\n\\n\r\nTo me, Yamato and Alcor are only the most developed characters in this anime but then they got pushed aside and that was the last we ever seen of them.\\n\\n\r\nHibiki Kuze was one of the worst protagonist I have came across in an anime. His character was like Yukiteru Amano from Mirai Nikki. He just couldn't think straight and he always value his life more than anyone else. He always sulk a lot. The only think that his character develops is that he forms a good relationship with Daichi & Nitta.\\n\\n\r\nDaichi Shima was always overreacting.\\n\\n\r\nNitta Io, a crybaby, who always cries when things go wrong. She never grows as a strong character. In fact, she relies on Hibiki too much. Just another Orihime, damsel in distress.\\n\\n\r\nThe most annoying girl is Airi. To me, she always never care about the situation and the world. She always complain a lot.\\n\\n\r\nI just can't believe that the 3 protagonist are just babies and they value their life more than protecting others. They really have no goal in life. In fact, I don't feel that their situation was dire. There is no weight to the situation.\\n\\n\r\nCONCLUSION (2):\\n\\n\r\nThe characters all just go through the motions with this anime and I didn't get invested in their cause and dilemmas. The characters just stayed the same throughout the anime. \\n\\n\r\nIn episode 11, they mentioned Jack Frost but it was supposed to be pronounced as Black Frost in the game. Though I haven't played the game yet.\\n\\n\r\nThe anime just neglects the appearance of Polaris and the 3 protagonists' parents. If their parents were there in this anime, why didn't I get to see them. It leaves me with a sour feeling of the ending.\\n\\n\r\nAnd speaking of the end, this is one of the worst endings I came across. By the end, I came to realise that the characters that go though the battles, relationships, their causes, struggles and mysteries, it was all for NOTHING!\\n\\n\r\nBy the end of the series, the characters just go on with life as if nothing had happened. Which means to say that this whole adventure didn't matter at all. It was just an illusion after all so we might as well just forget about it.\\n\\n\r\nI was so angry about this ending that everything that they work for is for nothing. The more I think about this anime, the lower the score gets. \\n\\n\r\nSo overall I give this anime a 2 out of 10. I sat through 13 episodes and I realised none of that really mattered.",
            "date": "2013-10-03T23:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 115345,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=115345"
        },
        {
            "content": "The Shin Megami Tensei franchise is probably my favorite franchise of all time, and I honestly can't recommend it highly enough. There's something in the franchise for everyone, whether it's the post-apocalyptic setting of the main SMT games, the technological themes present in all of the games, the mythological aspects/themes, the contrast between order and chaos, the alternate history of the Devil Summoner games, the psychology of the Persona games, incredibly complex storyline of Digital Devil Saga or the subject of the review in question, fascinating perspectives on disaster striking in the Devil Survivor games.\r\nThe franchise, with the potential exception of the main SMT games,excel in making their characters feel and act extremely human and realistically. The games avert many common anime-related and fictional (as well as historical and religious) archetypes, which is done very differently from game to game.\\n\\n\r\nBefore you read the rest of my review, I propose you start playing a MegaTen game (if you haven't already) and hopefully you'll understand exactly why this adaptation irritates me to no end. You can start from Persona 3, Digital Devil Saga or the first Devil Survivor ideally speaking, and don't be hesitant in asking for help or assistance from the fanbase (the games are very well-known for being extremely difficult).\\n\\n\r\nNow, I was extremely excited for the Devil Survivor 2 adaptation. The game deals with how a society reacts when it's on the verge of losing everything, deals with various complex political themes and aspects of government with a great deal of balance and moral ambiguity, and has one of my favorite cast of characters out of a video game. Even if I felt 26 (later reduced to 13) episodes weren't enough, I felt I can at least enjoy it as a fan of the game, just like I did with the Persona 4 adaptation (which was nowhere near perfect, but still fairly enjoyable as an adaptation and as a standalone anime).\\n\\n\r\nThese expectations weren't much, but they were not met. In fact, the only thing that met my expectations in this mess was the soundtrack, which is really good and fitting of the mood of the show, and the artwork (designs being the same as the game) as well as the animation quality, which looked very pleasant to look at throughout the show.\\n\\n\r\nThis is where my praise for the show ends. The story resembles that in the game on a basic and superficial level, that being the premise. While many aspects in the story resembled Neon Genesis Evangelion in the game, the game focuses more on the setting and how people react to the disaster striking. The themes were handled masterfully and carefully, from the various factions and their flawed ideals, their reasons for fighting and a lot of small scenes between the characters where they voice their doubts and question their reason for fighting in a world that has been razed to the ground.\\n\\n\r\nThis is gone in the adaptation, as the futuristic aspect that was so important in the game is shoved aside and treated as a tool for drama rather than slowly but surely dropping hints about the nature of the plot. The fights against the Septentriones are not as satisfying as the fights in the game and lack the strategic depth that one would expect from a game adaptation that revolved around predicting your opponent's future strategies.\\n\\n\r\nI don't expect the fights to be the same as the game, but a lot of thought goes into beating those bosses and I at least should expect some strategy involved. Instead, the adaptation resorts to a lot of yelling and screaming to beat the bosses, which is extremely bad and makes the characters look like a bunch of idiots rather than them coming up with plans.\\n\\n\r\nThe story doesn't resemble that in the game in terms of explanations either. Almost nothing about the demons or the events are explained, very little foreshadowing is present and almost no perspective or focus on the setting is present. I can think of only 7 minutes present in the entire show that attempted to present the setting properly, but even those are only within the first and second episodes, which are paced completely differently from the rest of the show.\\n\\n\r\nSpeaking of pacing, have I mentioned how bad the pacing is? The first few episodes are slow paced and attempt to build up carefully. This isn't a bad thing, mind you, but you can get the impression from them that this show was going to be 26 or more episodes, because the events of the game happen in 8 days, while episodes 2 to 4 (4 is where I'd argue the series completely lost it and started rushing to hell and back) focuses completely on the second day. The pacing feels inconsistent and nothing feels natural or planned out, almost as if the script was constantly being rewritten and the writers weren't entirely sure what to do.\\n\\n\r\nThe writing in this show is pathetic. The game knew when to be happy, when to be tragic, when to be dramatic and balanced switching between the tones extremely well. This is all but gone in the adaptation, and there is absolutely no subtlety or balance in tone.\\n\\n\r\nThe futuristic aspect doesn't work here the same as the game either, since the characters only, and I mean ONLY receive notifications in the game if someone close to them dies in the immediate future rather than receiving a notification every time someone is put in anything slightly resembling danger in the adaptation. It's similar to a small extent to how future diaries work in Mirai Nikki, except that it's more consistent and logical. In the adaptation, the power is inconsistent and weak, and the characters hardly react when someone is in danger or about to die, which means that the notifications about their future are more common and not taken as seriously by both the characters and the viewer.\\n\\n\r\nThis brings us to the characters, who are mere shadows of their former selves at best and absolutely different people from who they were in the game at worst. The characters were very well-fleshed out and far from their basic archetypes in the game, and there were a LOT of small interactions that humanized them and made them more likeable and made us see them in a different light.\\n\\n\r\nThis is completely gone, and the characters have been reduced to mere archetypes of who they were before. Hibiki was reduced from a snarky, flirty, random and sarcastic yet loveable and brave main character into a typical shonen hero, Daichi was reduced from a hesitant and rather cowardly but constantly gets braver character into the typical best buddy who says dumb jokes and is nothing more than a running gag, Io was reduced from a fairly shy young lady, hesitant about sharing her thoughts with others but straightforward and increasingly opens up to those around her to just the shy character archetype, and I can go on and on but I'm pretty sure you've gotten the idea by now.\\n\\n\r\nThe characters never speak to one another and never act in any way resembling the way they acted in the game, and hating the characters here doesn't mean you'll hate them in the game considering that they share almost nothing in common with the exception of their appearance. They do resemble their characters in the game slightly in the beginning but honestly don't expect any normal or sane character interactions while watching this, because you will not find anything resembling that here.\\n\\n\r\nThe Devil Survivor 2 \"adaptation\" is a complete and utter abomination that does not resemble the game in any way, shape or form. Everything has been reduced in both scale and implementation and is simplified for an audience that can just watch something better. The show doesn't resemble the game in any way, shape or form, and I honestly recommend you just start playing the Devil Survivor 2 video game instead of wasting time on this trash.\\n\\n\r\nAs far as I'm concerned, this adaptation doesn't exist and it's a shame, because this show could have been very popular and well-received if a better studio and production team was responsible. I wouldn't mind a remake in the future, but the chances of that are slim considering that the first \"adaptation\" didn't sell well in Japan and messed up as far as ratings are concerned big time.\\n\\n\r\nOh well, back to playing my copy of Devil Survivor 2: Record Breaker, I guess...",
            "date": "2015-08-14T03:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 196121,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1269655.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/sushiisawesome",
                "username": "sushiisawesome"
            },
            "url": "https://myanimelist.net/reviews.php?id=196121"
        },
        {
            "content": "Devil Survivor 2: the animation.\r\nWhat if you do the exact opposite thing from what Odert(Black rock shooter)? Instead of creating a anime that completely depends on the fans from a franchise, you create a anime that is practically only watchable if you do not know the history of the franchise but imply to it in the title in the first place? An anime that's quite good to follow and okay to watch, as long as you won't hold any grudges because of the comparation with the manga or initial game. I'd like to explain some more further going subjects about the anime in this review;therefore, you are encouraged to skip the parts which do not imply on you as reader or gamer.\\n\\n\r\nFor the ones that followed the franchise;\\n\r\nI understand your ''i don't even--''  feeling. It's a dissapointment. Instead of actually putting a grip on the scenes which were important, they just left them out and mainly focused on thematic problems they encounter which are just part of the story; not the big line which MAKES the story in the first place. To avoid any spoilering; What the worst part is, is that they not only didn't left out most important scenes, they also  made the adaption contain scenes from either the game as the manga; WHILE these two aren't even close to insynchronized. And i keep the same feeling as you. However; Didn't you ever asked the question of ''Would this anime be good if we couldn't compare it to the franchise?''\\n\r\nIn otherwords; Comparing a anime to something that isn't a anime in the first place but a game and a manga, Is that correct?\\n\r\nIt's a bad Adaption, yes; i give you that. but as a stand-alone anime it could've gotten further than just a bad sis-com with triangle breasts.\\n\r\n( the horror, the horror!)\\n\\n\\n\r\nFor the ones which are completely new with the series;\\n\r\nThe first thing you should notice is that the anime seems rather... usual. School kids gaining a super power to save their homes, lives and world. It's a pretty standard set-up and can actually bore alot of people. Now if you add the frustration i explained just up above to the ones that  actually played the game and/or read the manga, it doesn't end up well. What we CAN say, is that the anime itself isn't that horrificly bad. By the quality it delivers, it can be a good show to amuse yourself for some few more hours. I'm not implying here it's actually in the big ratings, No. However; It doesn't deserve the immensely negative aura it has these days. \\n\\n\r\n(both groups just continue here, please :3 )\\n\r\nWhat really blazed my mind was the fact that several forums over the internet (Animelist, Bakabt, Crunch) had all kinds of conversations about this anime; The ones who didn't watch it and mainly praised the anime that it ''wasn't that bad'', while the ones who played the game and/or read the manga were\\n\r\nfrom average to very, very negative about the adaption. \\n\\n\r\nArt.\\n\r\nFor the decency of our year, 2013, it's way to present anime got better and better. DS2 didn't stay behind and also used the best technique's for  the beauty of their anime. however. they used supreme animation skills, but lacked detailed backgrounds and details in many scenes. their action is very smooth, but yet again they left out details they could've added with just a few more weeks of editing.\\n\r\n7.7/10\\n\\n\\n\r\nStory.\\n\r\nIt's stripped, it's alot smaller, and quite dull. a Hero between the civillians, saving his friends.  It leaves out plotholes and story content. It's a bit saddening, but that's just how it is.\\n\r\nThe critique is mainly on this part and i have to agree with them. \\n\r\nit's a story that you find in most romcons or harems; it's been done before, and  the originallity can be only found back in the game.\\n\r\n5.9/10\\n\\n\r\nSound.\\n\r\nHowever. hey did apply alot of music themes and effects to boost up the animation. it's refreshing, skips rapidly and doesn't seem repetative. The intro theme is just fine as it is, and not over or under attended. Voice overs are okay, no one particulary good or well done.\\n\r\n7.9/10\\n\\n\r\nCharacters.\\n\r\nAgain, very dull.\\n\r\nThere is some character development and some slight flashbacks to ''their life what they HAD''. But once again, it misses out quite a lot.\\n\r\neven for the people who didn't read the manga or played the game there seem to be something wrong or missing.\\n\r\nIt's just because this is one of the most important parts that the adaption is a dissapointment, but it's enough to substain a anime that can attract fans. you might want to call it a positive side to get them to play the game and read the manga, right? as a ending-tackle; most of the interactions seem to be forced and unnatural. i understand that if you present a half season (12 episodes),\\n\r\nyou do not have alot of time. But don't cover all your time up with mostly action, then! \\n\r\n6.2/10\\n\\n\\n\r\nenjoyment\\n\r\nThe point here, is that most of the side-subjects are all scoring average. so no matter how you look at it or whatever you're searching for in a anime, there is not alot you can get out of this one. it might be a time-consuming anime whenever you have too many, and it's definatly a adaption you can skip as a DS-Gamer. However. It is more troublesome to watch Romcon anime's because this one is JUST as well made as a summon/survival as all others. For the fans who really enjoy these kind of anime; please go ahead. The rest; most of the specs are average. Most anime have their good attributions and their bad ones; Atleast a reason to find a specific audiance. but this one just has everything put on average. What you get as a result, is an anime that's more dull and boring than special or atleast interesting in SOME way. Ontop of the fact that the fans from the manga and games are just poking their eyes out after seeing the first episode already.\\n\r\nDissapointing for some, and average for others. just a small group might enjoy this till the very end; and to those: i wish i was you.\\n\r\n3/10\\n\\n\\n\r\nscores\\n\r\nArt: 7.7/10\\n\r\nStory: 5.9/10\\n\r\nSound: 7.9/10\\n\r\nCharacters: 6.2/10\\n\r\nEnjoyment: 3/10\\n\r\nOverall: 6/10\\n\\n\r\nThank you for reading my review.\\n\r\nI'll see you next time ;)\\n\\n\r\n- Zumorito\\n\\n\\n\\n",
            "date": "2013-08-16T18:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 109999,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2502999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zumorito",
                "username": "Zumorito"
            },
            "url": "https://myanimelist.net/reviews.php?id=109999"
        },
        {
            "content": "I really liked this anime, I question why so many people have negative reviews over this show. Personally, as someone who has yet to play the Shin Megami Tensei games on DS, I cannot say whether it stays true to the game or not but personally, I found this game enjoyable. Perhaps some others felt that the game was much better, but for me I loved this anime nonetheless.\r\nAt first, I was contemplating to drop this anime because the beginning seemed quite boring and plotless. The real hype was when they began to summon the demons and fight against the Septentriones in their endless andoverwhelming battle for 7 days as well as find the truth as to what should be done when the apocalypse has ended. There is strife between the protagonist and Yamato Hotsuin regarding what steps should be taken after they have defeated the last Septentrione. I admit that there were parts where I was just bored with the whole thing because those moments seemed pointless for those with short attention spans like me. \\n\\n\r\nNonetheless, after I finished the anime I felt that it was incredible and that I loved it very much (Mostly due to the magnificent fight at the end which made me super excited). The plot is great and I recommend this for people who love fantasy anime.",
            "date": "2015-10-09T07:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 200825,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4924886.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yumekix",
                "username": "yumekix"
            },
            "url": "https://myanimelist.net/reviews.php?id=200825"
        },
        {
            "content": "This anime had the potential to be a good one, but it lacks in so many ways. 13 episode series can be very good but this one failed to live up to that fact. It hardly developed the characters in any proper light, nor did it give any adequate or interesting background to any characters. The viewer is just thrust into the world their in with little knowledge. The anime does not explain the plot well, a plot which is lacking. The entire idea of the anime is people can summon demons through cell phones & these people have to kill other demons. The actualidea of demons fighting demons is not a bad one, but the way the anime does it is incredibly dumb, i mean summoning through a cell phone?, which has little weird guys that pop up in the phone that shows \"dead clips\" of your friends? it's a bit much. The sound for one is not entertaining, and the art is severely lacking. The animation if good, but the costume designs are so very stupid. The main character was wearing a bunny hat for gods sake, retarded. I would only really advise watching this anime if you have nothing else, otherwise go masturbate or something.",
            "date": "2013-06-28T21:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 102919,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=102919"
        },
        {
            "content": "This anime really does not do the game justice. (Note, this review talks mainly about the adaptation from game to anime.)\r\nI'll start with the pros:\r\n1. Yasuda is probably the weakest character designer Atlus has ever hired for a Megami Tensei game. The character portraits were not that good. The anime makes the characters a lot more visually appealing.\r\n2. The anime opening is really great.\r\nThere are lots of cons, but I'll talk about the biggest gripe that I have with it:\r\nThe plot is kind of all over the place and not very faithful to the game, but the ending is just terrible. I agree with theirdecision to create an ending specific for the anime. Given that every ending in the game is canon due the the Megami Tensei Multiverse, it makes sense to not bias viewers towards any specific endings. However, the ending that they created was awful. It just didn't feel like it fit in with the spirit of the game.\\n\\n\r\nTakeaway: If you haven't played the game, then maybe you won't find the anime too bad. However, if you have played the game, then stay away from this anime. It'll only infuriate you.",
            "date": "2017-07-21T19:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 253425,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5531373.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/amelianreasons",
                "username": "amelianreasons"
            },
            "url": "https://myanimelist.net/reviews.php?id=253425"
        },
        {
            "content": "Dylan Burns\r\nJust finished Devil Survivor 2: The Animation. I must say that was one good piece of work. Animation was great, characters were great, the plot was great, it was overall such a great anime. This really comes to show that video games can really have such a great plot, cause video games are awesome. Lol \r\nIt had some epic battles, humanity had to fight demons the god Polaris sent to earth to test and were given demon summoning apps on their phones from one of gods mechanisms to help earth overcome the test for without them, they were doomed. Yamato and Hibiki were prettymuch the chosen ones although one chose the path that the strongest must rule and the other,i the path that everyone should be equal strong or weak and live side by side and work together. The plot is pretty much humanities struggle to overcome this 7 day test and meet Polaris , in the meantime the world disappears bit by bit within the 7 days.\\n\\n\r\nWas such a great anime\\n\r\n10/10",
            "date": "2013-08-13T15:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 109475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1384699.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/burnsanimal",
                "username": "burnsanimal"
            },
            "url": "https://myanimelist.net/reviews.php?id=109475"
        },
        {
            "content": "\"I live while eveyone dies. I have to shoulder all that, and survive.\" - Hibiki Kuze\r\nDevil Survivor 2 The Animation is from the game Atlus produced(Nintendo DS), which brought us Persona 4 The Animation(PS2 console).\r\nMost of the game nowadays that's been turned into an animation don't pan out. Wonder why? I seriously think you can't cramp a 30+ hour gameplay RPG on a mere 12 or even 24 episodes. But let me tell you something, Atlus did just \"THAT\"! They've crammed 30+ hour games into 13 episodes! But worry not my dear friend, this time, it actually panned out. Of course they didn't include minordetails in the animation, but its still worth watching. Oh, and in the game, there's a lot of options/choices to choose from(typical SMT game).. And of course, at the game, you get to have your privy time with the supporting characters! Yatta! Oops, forgot I was making a review about the \"animation\". Sorry about that. Back to the main topic, the retelling of the story in the animation is a lot different from what's in the game. So even if you played the game, you can still enjoy a quite different story in the anime. Like I've said, they've cramped a lot of hours into 13 episodes, so expect a fast-paced story when watching this. Unexpected things which weren't common in the game is always present in the anime version, and that's what made the animation good.\\n\\n\\n\r\nAlthough there have been slight difference on telling the story, the main plot doesn't change from where the game has led to. So I can safely say that what came out of the animation is on par within the game's story.\\n\\n\r\nThe story doesn't quite drift away from most shounen shows nowadays, we have our Protagonist stuck with a difficult problem. It's about friendships, fighting monsters, conversations of hot guys, and finally, conversations with hot guys.\\n\\n\r\nMartyrs, martyrs everywhere. That's what I've noticed on most of Devil Survivor 2's characters. It's not a bad thing though, definitely not a good thing either. But what can you do? The world's ending and you want to do something for the sake of your friends, that's not bad. But getting help from others is waaaaaaay better. Shouldering everything is pure heroic BS, that's why humans were made weak, so they can rely on other humans.\\n\\n\r\nHibiki Kuze, O Sparkling One! Why the hell do you look like a rabbit(just kidding)?!\\n\r\nThe series is chuck full of bishounens and bishoujous(most of any series are.)! But the most crucial part and disturbing thing that destroys my whole mind, is that THERE ARE NO PETTANKO(s) at all! How could they do such a cruel thing?! Didn't they know that FLAT IS JUSTICE?! They said they're fighting for justice and humanity; but they're not FLAT, they're just flat out lying! Well, I knew it was coming anyway, since the game didn't have one either. Don't mind me, I was just ranting some BS.\\n\\n\r\nDevil Survivor 2 is a good series. It's not that great though, but it's not that bad either. It had its up and downs as far as entertaining the viewers. There were episodes that didn't make any sense(if you didn't played the game or any SMT game, you wouldn't quite understand what's going on.), well that's the hard part cramming up a long game to an animation. Like I've said, many games that were animated didn't pan out. But Atlus does a fair job doing it. All in all, Devil Survivor 2 is a good watch(especially if you've played the game). Not that long, has action-packed scenes, has great art, not so complicated plot. Plus you get bonus Yaoi materials on it, so feed your inner fangirl within you.\\n\\n\r\nLet's all survive! Oh yeah, we need some chawanmushis too!\\n",
            "date": "2014-02-07T05:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 131747,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=131747"
        },
        {
            "content": "The story line is good, and loads of effort is put into the battle against the first 5 of the 7 Septentrion, although I feel as though the battles against the last 2 were rushed to fit it all into 13 episodes. Personally I feel as if the art style is really good, and the sound effects seemed fairly realistic. The character development was decent, with a couple of flashbacks to tell us the history of a few of the characters. It's a really enjoyable anime, so if you like anime's that involve monsters, this is a pretty good anime to watch! Overall, this animeis really good, and I recommend it to anyone!",
            "date": "2014-08-13T05:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 156405,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3726233.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Winged_Killua",
                "username": "Winged_Killua"
            },
            "url": "https://myanimelist.net/reviews.php?id=156405"
        },
        {
            "content": "As someone who played the original game, I watched Devil Survivor 2 for what should of been a great story about fighting fate, death, and the end of the world. Instead what I got was a generic, carbon copy of Neon Genesis Evangelin that removes Mech's and changes them to Persona's. I'll admit the game was that way to a extent but it removes the key part of the game: depth and comedy.\r\nThe biggest flaw with this show is how it ruins a good game by not treating the characters right. The characters are reduced to simple character traits instead of the more complex depths.Daichi is a comical coward who has weak demons, instead of the unsure, but determined friend who acts as the audience surrogate. Yamato is turned into a villain instead of a complex Anti Hero/Anti Villain depending on how you view while also making his obsession with the protagonist, Hibiki, be played up to homosexual subtext combined with Yandere control. By far the biggest offender is Joe, Otomoe, Ronaldo, and Fumi, who all are used for three episodes each and die with no build up. Fumi also dies in the worst way, doing one thing to help fight before being one hit KO'ed.\\n\\n\r\nThe lack of comedy also is a big slap since the game is filled with comedic moments to break the tension and suspense. When a character cracks a joke in game, it's to reassure and lighten the mood but also to raise morale. In the anime, it's fanservice jokes and nothing much.\\n\\n\r\nThe story has no foreshadowing to it's obvious ending. Obvious being that they had to do the expected ending because they messed everything else up. The problem is that it isn't set up right and the anime treats it as the right and natural path. As if saying \"This was the intended route guys!\". It also doesn't explain our Angels-I mean Septentrions, since it makes Yamato the Final Boss instead of the main, real threat thats established in game half-way through. It's a big F-YOU to the fans of the game, especially since it doesn't add up once put under the analysis lenses. Basically it abridges the game but instead of using a shortcut, it blows the whole bridge and shrugs it's shoulders.\\n\\n\r\nThen there's the inconsistent story points. For example, main character Hibiki has super strong, level 40 in game demons at the start with no context why yet other characters get around the same level of demons in relation to the section of the game. There's no justification in story and the fact that the strategic team fighting is reduced to \"Hibiki can save us were team fodder\" is stupid. \\n\\n\r\nAll in all the only good things are great animation, soundtrack, and voice cast on the subbed verison. If you watch the dub, don't. It's a horrible dub. Everything else is just horrible, offensive, and sad to see because Devil Survive 2 is a great game. It's avaliable on the 3DS with a great voice cast and storycontent.\\n",
            "date": "2015-06-28T22:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 191675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/131843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/naruto195",
                "username": "naruto195"
            },
            "url": "https://myanimelist.net/reviews.php?id=191675"
        },
        {
            "content": "Hmm...what to say.\r\nFirst of All, I'm not that happy with this adaptation. Having played the series I had very high hopes for this anime and sadly it just didn't cut it for me. I mean sure the whole idea of trying survive \"God's Ordeal\" is there but I think it's lacking in a sense that it didn't hook me into it as the game did.The anime's 'flow' if you get me is too fast paced which in my opinion leaves those that know nothing of this series confused and very likely to stop watching this anime. I mean what I saw in the characters werenot entirely the same as the game. Anyway I can't give this anime too much heat because I did enjoy seeing some of the choices that the MC A.K.A Hibiki Kuze made as they were similar to what I chose first. Also I also liked how they turned the game that I really loved (love so much that I finished all the available routes in the game and am still playing it >.>) into an anime. \\n\\n\r\nSo all in all I think this was a decent effort, but I just wish that they didn't rush this anime too much and tried to take it how it's meant to be a slow paced, well-planned anime and polished. Then I would've been a bit more happier.\\n\\n\r\n*Just so you know this is just my opinion and this is completely biased so I don't mean any offense if you totally loved this anime or have worse views on it than I do.",
            "date": "2013-07-24T03:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 106585,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919033.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tbhlol12",
                "username": "tbhlol12"
            },
            "url": "https://myanimelist.net/reviews.php?id=106585"
        },
        {
            "content": "Before I review this title, I would like to make it clear that I have not played the video game.\r\nStory - 6\r\nI honestly loved the main plot line, but its execution was very horrible. The first half of the series was very slow and nearly made me drop the series. Didn't really like the plot holes in the beginning of the series and often got confused in the middle of an episode. The pacing was very slow during the first 75% of the series, but managed get the pacing right at the end.\r\nArt - 5\r\nThe art was pretty average. The artwork seemed very dull andnot really noticeable. The animation during fight scenes didn't feel right and the shading of the series seemed pointless.\\n\\n\r\nSound - 7\\n\r\nThe one good aspect of this show? The opening and ending was incredible, but I really didn't notice music during fight scenes or dialogue.\\n\\n\r\nCharacter - 6\\n\r\nCharacter designs slightly resemble The Irregular at Magic High School and character personalities remind me of Sword Art Online. The characters were very flawed, they seemed to make the MC and the General look OP (which I don't like in characters).\\n\\n\r\nEnjoyment - 6\\n\r\nAs I said in story, SLOW pacing in the beginning made it a bore to watch, but at the end it became worthwhile, but didn't make up for its slow beginning.\\n\\n\r\nOVERALL\\n\r\nI think its a very mediocre series that I wouldn't really recommend to others, unless you want to compare the video game. If you are really patient, you might find interest in it.",
            "date": "2016-01-13T15:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 208456,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4519876.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Hyper-",
                "username": "-Hyper-"
            },
            "url": "https://myanimelist.net/reviews.php?id=208456"
        },
        {
            "content": "TLDR: There is no Devil Survivor 1 and yes Devil Survivor 2 is a complete story. The show is solid.\r\nStory, it was interesting enough, nothing made me think \"Now that is cool\". The story consists of some fairly mediocre writing that is held together by its strange pacing by just quickly moving onward when things don't quite make sense.\r\nArt. Generic is the first word that comes to mind. The animation quality is not so bad as to cause me any noticeable discomfort, but nothing struck me as amazing.\r\nCharacter. The characters in this show just sorta exist, they don't really act like people or feel veryhuman or nuanced, I think this is because content would have been cut from the larger game to make this animation but honestly that's a best guess. They have no major inconsistencies though.\\n\\n\r\nWould I say I enjoyed the series, yeah probably, but not all that much. It is something that really borders on the edge of whether or not something is worth watching but I think in the end the show is solid enough all around it can be enjoyed\\n\\n\\n\r\nUltimately I find that this show is passable in all regards, nothing in this show stands out as amazing or horrible. I believe that it is truly middle of the road, however this elevates it slightly because something that is done well in all things elevates it slightly. As someone who never played the game, I think this show is worth the time it takes to watch it however it is forgettable in every way.",
            "date": "2018-01-02T14:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 267228,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5248390.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vongrak",
                "username": "Vongrak"
            },
            "url": "https://myanimelist.net/reviews.php?id=267228"
        }
    ],
    [
        {
            "content": "*MAY CONTAIN SPOILERS*\r\nDevil Survivor is an anime adapted from a game. Idk about you but i haven't played this game and cant judge by how the game went compared to this but i have got to say for first impression. I want to buy this game. The plot is amazing. 7 Days of Judgement, Monsters/Beasts coming Once a day and having to destroy it. It was amazing. The idea of controlling Devils and using them to battle monsters. i have only seen one anime similar to that and that was Owari no Seraph. Anyway back to the point, the story seemed original (from what Ihave seen. i can't say much because i haven't seen much anime), the Game seems awesome but overall, its great. The Characters were great, (couldn't ask for more), the sound was awesome, Art was spontaneous. I especially like Hibiki's Hair.\\n\\n\r\nYea Overall it was a great anime and can''t wait till i get the game.\\n\\n\r\nThanks for reading and I hope you enjoy watching this anime as much as I did.",
            "date": "2016-02-27T22:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 211848,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675972.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SenpaiDetected",
                "username": "SenpaiDetected"
            },
            "url": "https://myanimelist.net/reviews.php?id=211848"
        },
        {
            "content": "How will humans survive the Seven Days of Judgement?  Well, by their will to live, friendship, and strength, of course.\r\n-Personal Opinion- \r\nThis anime, Devil Survivor 2 The Animation, was based off of the DS game, Devil Survivor 2.\r\nI don't care about how others think about the animation after beating the game; I care about how I view it and how epic it was. I mean, I do have the game of Devil Survivor 2 and I haven't finished it yet... but I loved the anime more than the game.\r\nThe game made me die, the anime made me cry, the game made me mad, andthe anime made me sad. Why do you do this to me?!\\n\\n\r\nSince I haven't completed the game, when I was watching this anime I had the urge to play it cause I was a bit jealous of the characters' demons... But then I remembered, I have to level myself up in order to not die... (Dang it)\\n\r\nOKAY! Enough about the game!\\n\r\n-----------------------\\n\\n\r\n-Things you should know-\\n\r\nThere was some parts in this anime that are disturbing because a lot of people die. Just be prepared to cry or at least be upset. (No spoilers)\\n\\n\r\nOverall: 9/10\\n\r\nIt is full of epic action and surprises in every episode. It's a very emotional anime and has a happy ending but it makes you sad/cry. Prepare for the feels.\\n\\n\r\nRecommended for people who like Sci-fi and/or supernatural anime with a twist (the twist is the feels, of course).",
            "date": "2014-12-28T18:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 174897,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495079.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HeyHarp",
                "username": "HeyHarp"
            },
            "url": "https://myanimelist.net/reviews.php?id=174897"
        },
        {
            "content": "Devil Survivor 2 isn't a mind blowing anime, nor does it try to be one. The anime is based on a game and feels very rushed at times, though it should be stated that it can't be helped, with only 13 episodes to work with. This doesn't mean the anime itself isn't enjoyable, on the contrary, I liked it enough to get angry at everyone whom rates this with a 4 or lower so I decided to write a review, forgive me for my clumsiness at it.\r\nBeware of slight spoilers from here on. \r\nThe story is fairly simple: an ordinary high school boy is fightingfor his life, those of his friends and eventually for the fate of humanity itself. Personally I think that's where the strong point of the anime lies, the battle about what should happen with humanity in the end. The world is put through 7 days of trials. If humanity survives this, they can request an audience with the \"god\" of this world and get their wish fulfilled. But with the fate of humanity at stake, which wish is the right one? \\n\r\nYamato Hotsuin thinks that those with power and talent should rule and doesn't think twice about sacrificing people for the greater goal. The rebel leader believes everyone should be treated equally yet has to admit that Yamato's radical actions work. During the battles and life threatening situation our main character has to find the answer to the question \"how should humanity advance after this?\"\\n\\n\r\nNow I won't say the anime is a very deep psychological one, it doesn't seem to want to be one, but if you think about it, the story itself is rather interesting. Sure, the rushed pace and the \"obvious\" choices the main character makes aren't ground breaking but honestly; they're very human-like. The main character is a normal high school boy whom suddenly, without him wanting to, has to decide the fate of humanity itself. He isn't like Lelouch or Light, he isn't driven by some ultimate goal nor has he ever wished for things to turn out like this. He's simply a gifted with power and bound by \"Noblesse Oblige\". And that's what makes him, if you ask me, so likeable. He's a normal high school boy whom simply doesn't want the people around him to get hurt.\\n\\n\r\nArt: I don't know anything about \"fluid\" animation or high quality movements but my personal opinion is that everything is fine. Sure, there are shows with better and smoother animation, yet there are ones with worse ones. I like the character designs a lot and the colors they used for the anime.\\n\\n\r\nSound: The background music is well done and fits the atmosphere of the anime. I especially like the ending, for some reason it seems to really fit the overall feeling of the anime. \\n\\n\r\nOverall Enjoyment: As I said earlier, the story isn't very complicated yet if you're willing to think about it yourself, it's actually rather deep, I personally liked that a lot. The characters are fine, not everyone gets a chance to develop through the anime as much as I wanted to yet they're all likeable enough. There is enough action and even though it's a bit rushed; it's honestly a fine anime that doesn't deserve the bashing it gets. \\n\r\nThe best point of the anime is, I guess, the fact that the main character seems to be so very human-like. He isn't able to turn a blind eye on someone suffering right before his eyes and his way of thinking might be \"simplistic\" yet it's also so very, very human-like. Just think about it, if you yourself would be in his position, would you honestly be able to do things differently? I bet most people wouldn't. He's not flashy and isn't overly optimistic, he just tries to do whatever he can to change the fate of his friends. And honestly, how can you dislike him for that?",
            "date": "2013-07-07T17:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 104319,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/348941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Animefanx3",
                "username": "Animefanx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=104319"
        },
        {
            "content": "The Good: Interesting concept. Great character design. \r\nThe Bad: Mediocre story-telling. Boring plot.\r\nConclusion: This anime has an interesting pokemon-like concept, where certain individuals are able to summon demons via their cell phones to fight for them. It starts out strong; but the plot just gets more and more boring after episode 4. The characters are generic. I found it hard to care about them. Unless you're a fan of the video game, I recommend passing on this one.",
            "date": "2013-07-07T20:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 104351,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bjtdevera",
                "username": "bjtdevera"
            },
            "url": "https://myanimelist.net/reviews.php?id=104351"
        },
        {
            "content": "This anime is good, I think. \r\nI really don't know what the plot of the game is since I really didn't play the game of Devil Survivor. \r\nThis review is based on what the anime shows.\r\nSTORY - 8\r\nThe story is more on action. And that's what I like. It has a mysterious side on it such as what will happen at the end of the world. I think, the concept of 7Days judgment is pretty unique and the way of fight is cool enough from the start till the end. \r\nOne of the protagonist also exceeds my expectation since I really give up thinking thathe'll be useless until the end. And that's what breaks my \"BOREDOM\" on this anime. I think it's really a great anime. \\n\\n\r\nOne thing I find is uncool is how they get to fight one after another demon/septentriones that it actually gets \"Yeah. I already know it\" feeling. \\n\r\nThough I think, it's really the concept of the story. But somehow, i find it repetitive. \\n\r\nAlso, I don't really side on the protagonists state of mind since he's acting like a hero whatever who shoulders every burden of the world. So dramatic. But yeah. He's powerful. I know that. \\n\\n\r\nI like Hotsuin Yamato the most. \\n\\n\\n\r\nART - 8 \\n\\n\\n\r\nThe art is quite good. But I don't know if it's just me or it's quite messy. \\n\r\nThough the fighting scene's are ok, the expressions on the characters face is kinda lacking. But other that that, I think it's ok. \\n\\n\\n\r\nSOUND - 9\\n\\n\r\nI really don't have a problem with the sound. I love the opening and ending song. And the voice actors, I think, did a great job on portraying the character's emotion. \\n\\n\\n\r\nCHARACTER - 8\\n\\n\r\nThe character is humane.\\n\r\nTheir decisions is based on their emotions. And it's great.\\n\r\nThe only one I find annoying is one of the protagonist. Though he's really strong, I find it crappy that he insist his way in and burden himself on too many things.\\n\r\nIt's like he's too perfect. And no one's perfect so it really isn't mvy type of character. \\n\r\nBut expect for him, the other characters successfully show their human emotions and decide to grow because of the problems they've encountered.\\n\\n\\n\r\nENJOYMENT - 8\\n\\n\r\nI enjoyed it. Yeah. \\n\r\nMost of all, the last episodes.\\n\r\nThere are some episodes I find quite boring to watch. Since as I said, it's quite repetitive.\\n\r\nBut yeah, I won't deny that I enjoyed it.\\n\\n\\n\r\nOVERALL - 8\\n\\n\\n\r\nOverall, I scored it very good. \\n\r\nI enjoyed it. \\n\r\nI like how the author didn't fail my expectation on the helpless protagonist.\\n\r\nI like the concept of destruction and day of judgment. \\n\r\nThat there is hope in humanity. \\n\r\nThat human can still fight for each other.\\n\r\nThat there is a future waiting for them.\\n\r\nAnd well, there's a second chance to change our ways.",
            "date": "2017-07-12T21:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 252703,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6349777.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Castinate",
                "username": "Castinate"
            },
            "url": "https://myanimelist.net/reviews.php?id=252703"
        },
        {
            "content": "Episodes 1 to 9 *Yawn*\r\nEpisodes 10 to 13 *Okay things starting to get slightly more interesting*\r\nThe above is basically my very simplistic summary of my experience with Devil Survivor 2. But obviously I'm going to go more in depth about this show, first off lets begin with the story.\r\nPretty much Devil Survivor 2 is about a group of people attempting to survive and fight back against enemy demons, defeat seven Spetentiones (if I spelt that right haha) and prove themselves to an all powerful being. To be honest it sounds cliché but, it's one of those stories that are fun to tag along when doneright. And I mean when it's done right. The problem with this show is that it's boring as hell for the first nine episodes, they basically rinse and repeat five to six battles with Spetentiones. Now obviously the battles aren't copy and paste, in matter of fact the battles in this show are quite entertaining to watch. What brings the story down in this show are the lacklustre backstories of the characters and the non-existent side stories, you're left bored out of your mind until they get to the battles with the Spetentiones. What makes it even worse are the characters themselves but, we'll get to that later. If you want a glimpse at how bored I was for the first nine episodes it took me almost a whole year to watch them, yeah I know. Thankfully from episode 10 and onwards the story gets slightly interesting not very much though, the conflicting moral ideals of both Hibiki and Yamato peaks your interest and the ending sort of leaves you wondering what happens next other than that the story doesn't get much better. The show always seems to be rushed and missing essential scenes like you'll be watching one episode then in the next the interactions between certain characters seem to be different to previously as if they threw a huge chunk of content out the window between to episodes. On and end not for this section I also hear the show is based of a game, and by god I hope it isn't as average as this show because if it isn't I feel sorry for fans of the license.\\n\\n\r\nArt wise, the show does good on the backgrounds aren't amazing but, not terrible either so you can feel thankfully that they got that part right. The character were okay however they weren't anything to marvel at unless you're me I did like Alcor's design of I dunno retro style whatever it was I liked it. On the other hand where the art style truly stands out is the battle sequences you're met with a nice spectacle of light shows I must say though sometimes it can be quite the cluster fuck so be prepared to lose sight of what's happening in some of these scenes.\\n\\n\r\nAs for the sound it was above average, I really liked the shows choice of opening song one of the few reasons I came back to finish the show off. However the soundtrack beyond isn't really memorable except for the battle scenes. Finally I do have to say that the sound effects for powers or fighting from demons was pretty damn good and I could say the same for the fights between humans.\\n\\n\r\nHahaha, now we come to the part where I was so close to giving this section a 2 or 1 for its characters but, I'll tell you why I didn't. One name, Alcor. He was the only character I was ever interested in, the only one I wanted to find out more about as he had an interesting back story granted it still wasn't amazing, however on terms of the other characters he'd be rated 7 or higher. It wasn't only that one reason why I liked him, it was because of his presence in scenes he made the other characters a bit more likable and interesting. He's basically the glue of cast that keeps it all together when he's on screen when he's not the show just falls apart.\\n\r\nThere isn't much to say about the other characters except they're your normal everyday life people. On the other hand I have to make a comment about *I quote* the 'Boring Scumbag Duet' what I mean is Yamato and Fumi (I think that's her name at least) those two are soooo boring it got to the point where I wished they'd trip over a nail impales their throat. So you can hear the sounds of them choking on their blood in the background, their personalities were that of douchebags and I had a habit of sleeping when they spoke. Granted Yamato does get interesting a tiny bit from episode 10 and onwards but, not enough to warrant liking him.\\n\\n\r\nEnjoyment wise it really depends on your expectations, if you go into this not expecting much it might be a fun show to waste some time. But if you're like me expecting a good show then you may be disappointed with what you get. If you're a fan of the Devil Survivor games (yes they're games and I hear they're favourable received in Japan) then none of this may affect you or sway your decision to watch this, as for me this is my first exposure to the license.\\n\\n\r\nOverall the show is just average, it doesn't get better or worse just stays in that mid line the whole to time with a few dips up and down here and there. I would only recommend this on two situations 1) you have no other anime to watch in one of the anime seasons (even though there are betters shows to watch that you may not have seen. And finally 2) if you're already watching one or two shows in an anime season and you just want to past the time between them. \\n\r\nUltimately I'm just viewing my opinion I can't tell you whether you'll like it or not, all I can say is check out a few episodes then decide.",
            "date": "2017-05-03T20:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 246914,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6217963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PhaseShifter",
                "username": "PhaseShifter"
            },
            "url": "https://myanimelist.net/reviews.php?id=246914"
        },
        {
            "content": "So.... Is pretty good to be doing a review about my actually favorite anime.\r\n- Story -\r\n*Score: 9\r\nThe story is really original, like, cmon, have seen a anime where the people go to take battles with their cellphones? Well, if not, i can tell that this is a show for you.\r\nIs scored as \"Great\" because is really hard to see a story like this, i dont like the typical idea that mentions something like — \"So, the anime is just starting, and by one moment to another, everything got destroyed\".\r\nThats a generalist idea of most of the \" Harem - Shonen\" you can see nowdays, but,taking that out, is a damn good story.\\n\\n\r\n- Art -\\n\r\n*Score: 8\\n\r\nTalking about animation, i dont see problems with the animation, but, why it is scored with a 8? That's simple, is just because im a huge fan of the monogatari series, and to be honest, if you do a comparation, you are just going to get that the animation of Devil Survivor 2: The Animation, is ok, but is not the best art to give it a 10 or a 9.\\n\\n\r\n- Sound - \\n\r\n*Score: 10\\n\r\nI dont have too much to talk about, if we're talking about the ending/opening, i just can't say anything, the opening's name is Take your way, you don't need to actually read the translation of the song, because, it gives you that sensation of tranquility that you need, that message that says \"everything is ok if someone is with you\".\\n\\n\r\nThe ending, well, it does have a interesting detail, but, i don't want to do spoiler 'bout the show, so, im just going to say that the feeling that the opening gives to me, is exactly what the ending does too.\\n\\n\r\n- Character - \\n\r\n*Score: 7\\n\r\nOk, Andre, you gave me a nine on story, but, why a 7 in character?\\n\\n\r\nWell, y'all know that, not because the story is that good, the development of the characters is going to be exactly the same.\\n\r\nDevil Survivor 2: The Animation is actually a game-based anime, so, isn't weird that the characters aren't that good tho.\\n\\n\r\n- Enjoyment -\\n\r\n*Score: 8\\n\r\nThe anime is really good, but it gets boring at some moments, you can't expect that this show keep that \"good emotion\" all the course, but, is not that bad, not all the animes are that perfect, and this one is not a exception.\\n\r\nBut, almost all the anime is really interesting, highly recommended.\\n\\n\r\n--- OVERALL ---\\n\r\n*Score: 9\\n\\n\r\nThe anime gives you that emotion, that feeling that the anime wants to pass to all the world, this anime wanted to say something to me, and it got it.\\n\\n\r\nI really recommend it, is not perfect, but for me, is a really masterpeace.\\n\\n\r\nThx, \\n\r\n— Chang.\\n\\n\\n\\n\\n",
            "date": "2017-03-20T19:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 243062,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5173488.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Alstoria",
                "username": "Alstoria"
            },
            "url": "https://myanimelist.net/reviews.php?id=243062"
        },
        {
            "content": "Production and Popularity\r\nDevil Survivor 2 is a 2013 thirteen episode anime based on the 2012 video game by Atlus for the Nintendo DS. Genres and themes include action, fantasy, supernatural, demons, friendship, free will, apocalypse scenario, and in an indirect way, survival game. The anime was created by Studio Bridge, known for being the studio of the ever popular series Fairy Tale. Fifty thousand users on myanimelist.net have ranked Devil Survivor 2 at 7.05, with reviewers giving it a fair mix of votes from 3 to 10. While few people have rated it on Crunchyroll, the average is four out of five stars. In contrast,on IMDb, users have only rated it 6.4 out of 10. \\n\\n\r\nAs you can see, the popularity of the show is not great, and opinions on it differ significantly. To start with, Devil Survivor is based on a game, so the average viewer who hasn't played the game may not appreciate it as much. On the other hand, some of those who did play the game and reviewed the anime online seem to be unsatisfied with the adaptation. Other complaints were that the show was too similar to the classic Neon Genesis Evangelion and lacked originality. For me, these reasons either don't apply or are not enough to make me dislike the show. I have never played the games, so I was not expecting a perfect adaptation. I found the anime perfectly understandable without having to play the game. In addition, I liked the similarities to Evangelion and I felt that Devil Survivor had just enough originality to make it not seem like a rip-off.  \\n\\n\r\nStory and Structure  \\n\\n\r\nI thought the story was excellent. Saving the world from demons or otherworldly invaders might be unoriginal, but there were enough other elements to it to make it good, such as the story of Mono Ureu, the Anguished One, the friendships between the characters, the character of Yamato and his ultimate goals, and the \"magic application\" system on the phones. More than being a story about saving the world, it was the story of a boy who believes in free will (Hibiki), a man who believes that might makes right (Yamato), and a being who has developed human thoughts and emotions when he was not programmed to do so (Mono Ureu). How do the three of them interact, what is their relationship, what makes them enemies, and what could make them friends?\\n\\n\r\nThe story structure was well-done too, divided into _ days. Episode 1 covers Sunday, episodes 2-4 cover Monday, episodes 5-6 cover Tuesday, episodes 7-8 cover Wednesday, episode 9 Thursday, episode 10 Friday, episode 11 Saturday, and episodes 12-13 Sunday. Major plot points can be thought of as each major battle: the first Septentrion in episode 1, the second Septentrion in episode 4, the third in episode 6, fourth in 8, the battle with Lugh after the sixth Septentrion in 10, and each of the three major battles in 11, 12, and 13. This structure is n0t quite as effective as the 1-3-6-8-10-12 structure, but it is used without problems here because of the number of battles that need to be shown (there needs to be time for Yamato's fights with Mono Ureu and Hibiki after the seven Septentrions). \\n\\n\r\nArt \\n\\n\r\nI am not an artist and don't know a lot about animation, but for me, the art was enjoyable. The character designs in particular I liked. Hibiki's rabbit hoody is kind of unforgettable, and even minor characters, such as Tico, were memorable in design. At first I thought the character design for the Anguished One had elements that were overused for his character type, such as stripes and white hair, but it grew on me over time, and it turned out he was much less of a stereotypical character than I had initially assumed. The fantasy battles were amazing to watch. When CG is used, it is mostly used well, and does appear too jarring. A lot of thought must have gone into the designs for all the demons, not to mention the Septentrions and their attacks. I love mythological creatures and animals, so I loved seeing Suzaku the Phoenix, Byakku the white tiger, and Yamato's lion demon (who was strangely named Ceberus). \\n\\n\r\nSound: Seiyuu, Songs, and Scores\\n\\n\r\nDevil Survivor 2 had a fantastic cast. Famous seiyuu Hiroshi Kamiya played main character Hibiki Kuze. He has played various unforgettable roles such as Yato in Norigami, Levi in Shingeki no Kyoujin, Araragi in the monogatari series, Nozomu in Sayonara Zetsubo Sensei, and more. He plays any character well, even the idealistic and sometimes naive Hibiki. Daichi is played by Nobuhiko Okamoto, now known for voicing Rin in Blue Exorcist.  Various other talented seiyuu appeared. A favorite of main is Ami Koshimizu, voice of Kallen in Gode Geass and Ryuuko in Kill la Kill, playing Hinako in this series. \\n\\n\r\nI enjoyed the opening and ending themes as well as the scores in this anime. Ending song \"Be\" by Song Riders was a special favorite that always moved me emotionally. On YouTube, the only OST available for Devil Survivor 2 is the OST for the game and not the anime. So it's hard to say much about the scores used in the series. If memory serves me, I believe they were beautiful and appropriate.   \\n\\n\r\nCharacters \\n\\n\r\nOnce again, the characters were enjoyable and well done in this anime for the most part. At first, some development is lacking, such as working out the character of Nitta, but she eventually gets her time. This is a short series with quite a few characters, so Devil Survivor 2 naturally doesn't develop them as much as shows with fewer characters or more episodes, but given the restrictions, the show does an excellent job. \\n\\n\r\nThe three main characters to consider end up being Hibiki, the humanist, Yamato, the power-driven, and Ureu Mono, the questioner. How these characters interact and play out during the show was entertaining and thought-provoking for me. I felt that although Hibiki is characterized as the \"good guy,\" the other two were not demonized or anything, and it's possible to enjoy the show while agreeing with them more than wih Hibiki if that's the way of your personal values.  \\n\\n\r\nEnjoyment \\n\\n\r\nAs usual, enjoyment is the most important element for me in rating an anime series. I enjoyed nearly every moment of Devil Survivor 2. One specific thing I liked was the theme that to be human is to question, and that the continued questioning will lead to mental and emotional anguish. I believe life is very much like that, so Ureu Mono was my favorite character. I also liked that Hibiki had strong friendships in the anime without there being canon romance, so you can either pick a shipping or consider them platonic friends. My inner yaoi fangirl enjoyed some thoughts of Hibiki and Daichi, but when I take the story seriously I feel that no romance is really needed. It might make for a good fanfiction though.\\n\\n\\n",
            "date": "2017-03-05T02:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 241906,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6028582.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeMarathon",
                "username": "AnimeMarathon"
            },
            "url": "https://myanimelist.net/reviews.php?id=241906"
        },
        {
            "content": "First, I must say that I absolutely loved this anime. *NO SPOILERS* The first episode had me hooked and We all know how it feels to want to know what happens next right? Well, I was immediately attached to the characters and the opening theme. This anime carries good quotes and the fights between demons are just thrilling. My main disappointment would be how there were only 13 episodes. I feel like they could have added so much more, like showing more interaction between the characters. I recommend this anime and I hope you enjoy it as much as I did.",
            "date": "2013-07-11T23:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 104939,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2414443.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LexyChan",
                "username": "LexyChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=104939"
        }
    ]
]