[
    [
        {
            "content": "As much as I’d like to enjoy a return trip back to the Negima universe, I can’t help but wonder why this anime even exists. Watching Uq Holder is like reading an incomplete book, one that has unsalvageable mistakes. It’s as if the producers gathered together at the last minute to procrastinate this like a school project. Don’t me wrong though. This show would have a lot of potential if the staff and directors actually had an elaborate plan. Unfortunately, it ended being broken in ways that can’t be repaired.\r\nI’ll address this early so anime only viewers won’t shake their heads in disappointment and regretlosing their valuable time. As a manga reader, Uq Holder is crammed into a 12-episode show that can’t hold itself together. Beyond the rushing, many details are left unexplored and we hardly get character development in the proper places. It also doesn’t help out that the show sells itself as a sequel. Some characters from the original anime make cameos while introducing new ones and ideas. The term “Uq Holder” is a central focus in this anime. Essentially, it’s an organization made up of outcasts that are non-humans and immortals. The show attempts to get new viewers into a comfortable position with exposition. What ends up happening is an unimpressive story that leaves unfavorable impressions.\\n\\n\r\nHonestly, there isn’t really an elephant in the room. With a quick glimpse of the key visual, it shouldn’t be surprising at what viewers should expect already. Anyone familiar with the Negima universe will likely recognize some of the character. For new viewers, this will probably evoke a thought at what a potential conflict the show will bring. To add insult to the injury, the principle character cast isn’t well developed. Touta Kono is a good example. He is the main male protagonist and honestly a guy that’s too carefree. Being optimistic and energetic isn’t an issue in itself but the show makes him look behave like a kid at almost any chance it gets. It doesn’t help that he often speaks his mind and is too dense to certain situations. Touta’s relationship with others become an important part of this show especially with Yukihime, a vampire and leader of the Uq Holder. Indeed, their relationship seems to be unique among this show that they are very close as friends, comrades, or perhaps something even more. Unfortunately, this show doesn’t develop them more than they should have. It’s pretty much a slap in the face for fans of the manga and general audience as a whole.\\n\\n\r\nBeyond these two, there are also some other characters that get noticeable attention. Kuromaru Tokisaka is a character that I have mixed opinions on. First of all, the anime makes it clear that Kuromaru seems insecure about his gender. It becomes a recurring joke that gets old fast. Next, I can’t help but find Kuromaru and Touta’s relationship to be lacking. The two gets along well and seems similar in personality. However, there’s really not much beyond that. It doesn’t really exceed expectations or leave memorable impressions. There’s even an episode that puts the two together on a date but nothing really develops from it. This applies to other characters in the show where their role is minimized but instead puts Touta in the spotlight. It tries to get him over but fails on multiple levels. For instance, Kirie’s interactions with him feels like a bickering between young siblings. Karin also treats him with distaste that makes Touta look like a fool. Shinobu Yuuki (the maid) and Touta seems to have one of the only normal interactions in this anime but it only goes far as that. Nothing ever really stands out beyond their small talk. Additionally, I can’t proclaim the antagonists to be interesting either. Their motivations aren’t too clear and most of them are generic to the bone. One of them even has a perverted personality that makes crude jokes towards women. There’s a sense of mystery that is meekly explored about them although by story adaptation standards, it’s really more of a misshapen product. So in retrospect, I can’t really say this show has an impressive character cast at all. Too bad really.\\n\\n\r\nNow I do have to admit, watching this show hit me with a dose of nostalgia. The original Negima manga was popular during its run and while the anime adaptation quality was subpar, it still had its moments. Uq Holder tries to remind us of those moments through the flashbacks and storytelling. Negi and his students make cameos in some way or form. Honestly, watching those segments were worth it despite the inconsistency with storytelling. The comedy of Uq Holder is also what people can describe as sexy and fun. It shouldn’t take long for viewers to recognize that the creator of this anime really want us to be get sucked into his ideas. However, that can really end up being a mess with and at its worst, a terrible executed joke.   \\n\\n\r\nAdapted by JC Staff, this anime’s visual quality turned out to be what I had expected. It gives off a very shounen feel with its action and choreography. It does go beyond the usual punches and kicks as it adds blood and even violence. Some of the battle scenes goes over the top with even body horror elements. Fan service is very evident throughout the show with clothes torn off and eye-catchy angles. Character designs are consistently adapted with the mature appearance Yukihime and feminine look of Kuromaru. To say the least, JC Staff did its job but not one that you can talk about them for years to come in regards to this anime.\\n\\n\r\nI can’t say much for the soundtrack except that it seems to work on certain levels. The OP and ED theme features montages of the main characters although is saturated with fan service. Character voice seems to work on most respects although listening to Touta talk can be quite annoying at times. On the other hand, I do appreciate how this show maintains a good balance of battle OST. When it gets serious, it maintains that mood.\\n\\n\r\nAfter watching UQ Holder, I can’t say this is recommendable unless you’re absolutely curious about the adaptation or wanted to be hit with some nostalgia. It’s one of those shows practically screaming “read the manga!” The humor gets old fast and despite the nostalgia it can bring, it still ends up being very underwhelming. Ultimately, this anime turned out to be a poorly executed plan. When you put all the broken pieces together, it still ends up being broken. \\n",
            "date": "2017-12-18T07:17:00+00:00",
            "helpful_count": 48,
            "mal_id": 265492,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=265492"
        },
        {
            "content": "Ken Akamatsu is one of the best mangaka I have ever seen. He took the worst two worst combined genres being Ecchi and Harem and manages to them good. Ken Akamatsu has known its attention to detail to developing its characters from main to even side characters. His works still intrigue me to this day thanks to his manga series being well written, well-paced, engaging, funny, and enjoyable to read.\r\nFor me Ken Akamatsu is a legendary mangaka.\r\nHowever Ken Akamatsu works gets an anime Adaptation thing doesn’t quite as well. In fact, his works don’t really translate well into anime. For example, the Love Hina mangais a solid romcom manga with great comedy that is actually funny, solid romance, likable characters that get developed and does a great job exploring the theme of love and achievement. However, the director for the anime decided to take everything that made the manga good and turned it into a bottom of the barrel, poor animated, unfunny, and cringe-worthy romcom anime that has no at all.\\n\\n\r\nAnother example of this is Negima which not as bad as the Love Hina it’s still pretty lacklustre adaption overall. The first Negima anime done by Xebec was is a decent show on its own that has good and emotional moments however when you start comparing it to the manga you will soon find out it’s a terrible Adaptation as it skips a lot of chapters as well character’s not even having the right colour to the censored fanservice. As for Shaft Negima the only one that I actually liked are the ovas because not only it’s followed the manga perfectly it was still a great watch for both the manga readers and newcomers. Expect for the Negima Final Movie which was shit. As for the Negima!? TV series is fine but also pretty boring due to the series being reduced to a comedy gag filler show after a certain set of episodes and it got boring fast. Now I personally don’t mind filler as along its done right as well being entertaining to watch but Negima and Love Hina filler are not even that good at all.\\n\\n\r\nNow we got UQ Holder. Ken Akamatsu latest anime adaptation.\\n\\n\r\nIs this anime any for newcomers for the Negima franchise?\\n\\n\r\nIs this a good adaptation of the manga?\\n\\n\r\nOr it’s just a forgettable shounen series.\\n\\n\r\nWe will soon find out the answer.\\n\\n\\n\r\nStory.\\n\r\nThe story in UQ holder is set 80 years after the events of Negima. It follows a young boy named Tota Konoe who is the grandson of Negi Springfield, aspires to leave his village and life live in the city of Shin-Tokyo which has a tower structure rising into space. When he gets mortally wounded by a bounty hunter coming after guardian. He soon discovers that he has been made into an immortal vampire by Yukihime, who is actually a 700-year-old vampire mage Evangeline A.K. McDowell. From there Totua picks up another boy named Kuromaru for the journey and they go to a place outside Shin-Tokyo where Yukihime leads a secret society of immortals called UQ Holder. From there Touta embarks on a unique adventure.\\n\\n\r\nUQ Holder is a fun mess. Am not saying the story is bad or anything, in fact, the story is kinda good overall that has a lot of good things in it which I don't want to spoil. However, the problem I have with the story is the show likes to skip quite a lot of chapters from the manga. If you fan of the manga you will not like this show as its skips some important chapters such as the Santa/Sayoko Arc. Another problem that I have with is that its some of the arcs are rushed especially in the tournament arc in episode 10 where the pacing of the show goes way too fast and because of that the tournament arc ended up being really rushed and kinda leaves the viewer feeling unsatisfied. \\n\\n\r\nI will give UQ Holder Anime Adaptation this. The story itself was left unchanged from its manga counterpart which is shocking because the Negima anime didn't even bother adapting the rest of the manga halfway through. \\n\\n\r\nOverall while the story UQ Holder had a lot good things in but ultimately gets crippled by skipping certain important chapters of the manga as well as having rushed pacing and because of that the story of UQ Holder as slightly above average at best.\\n\r\n6/10 \\n\\n\r\nCharacters.\\n\r\nThe characters in UQ Holder were pretty enjoyable but they could have been a lot better and had a bit more character development \\n\\n\r\nFirst, we have Touta. I personally liked his as a character. Yes if you compare to Negi from the Negima series he is quite a typical but he has a lot of charm in terms of his personality. I also really like his character interactions towards other characters like Yukihime, Kuroumaru and even Negi himself. \\n\\n\r\nKuromaru is an interesting character. This character battle style is very similar to another Negima character that we all Negima fans love Setsuna as they both use the Shinmei-Ryu sword technique. One of the things that I liked about this character is the whole Yatagarasu as all the members from the Yatagarasu are genderless before they turn 16 where after that they can choose to be a male or female. Another thing that I liked about Kuromaru is his/her character interactions with the cast and there are usually great because at this point Kuromaru and rest of the characters in this are confused about the Kuromaru's actual gender.\\n\\n\r\nAs for Evangeline or Yukihime. She’s still the loveable and badass character that we all love from the Negima series.\\n\\n\r\nThe rest of the characters are not memorable due to them having lack of screen time.\\n\r\nAs for characters from the Negima series they are the same likable characters that we all love however they could have treated some of the Negima characters a lot better like for example Asuna who a great loyal partner for Negi is now being reduced to a Deus ex Machina type of character. I won’t tell what episode it happens but watching that episode made me quite sad because I really liked Asuna in the manga.\\n\\n\r\nOverall the characters are enjoyable and likable but they could have been a lot better than they actually are.\\n\r\n7/10\\n\\n\r\nVisuals.\\n\r\nCompare to Love Hina and Negima the visuals are a big step up for the most part.\\n\r\nThe character designs were good and faithful to its manga counterpart. The actual animation is smooth and surprisingly consistent. The fights, for the most part, are well animated as well having a lot of tension. As for censorship unlike the Negima anime the show gives a big fuck you to censorship because of the show, for the most part, pull no punches when it comes to the fanservice and blood. Not bad J.C Staff\\n\r\nThe only flaw with the visuals is one sometimes characters go a bit off model and the whole censorship when certain characters is just cringe-worthy but to be honest I rather have than a fucking extreme shot of Asuna panties that has a bear in the middle of the very first episode of Negima Xebec version.\\n\r\nBesides those flaws for the visuals, the show is pretty great visually.\\n\r\n8/10\\n\\n\r\nSound.\\n\\n\r\nThe soundtrack is nothing special, to be honest. Yes, it has some good tracks but the most part it’s pretty forgetful.\\n\r\nThe opening Happy Material is a great opening and I think it’s the best version of the song even surpassing the original Happy Material from the original Negima series which was already great, to begin with.\\n\r\nThe ending theme Steady Go it’s a nice catchy song that fits well with the show.\\n\r\nAs for right now, UQ Holder doesn’t have a dub but I hope it gets one soon.\\n\r\nI love to see Laura Bailey voicing Evangeline again because she did a masterful job at voicing Evangeline.\\n\r\n7/10\\n\\n\r\nFinal Thoughts.\\n\r\nI liked UQ Holder for what it is. Yes, it has its problems such as skipping certain chapters of the manga to a certain character’s being underdeveloped but compare to other Ken Adaptions from the past it does a fairly alright job of adapting the manga as well be a pretty enjoyable show on its own right. \\n\r\nIf you looking for an enjoyable shounen series that I recommend UQ Holder to anyone however if you are a Negima/UQ holder fan such as myself who read the manga then I advise approaching this show with caution.\\n\r\nFinal Score 6.5/10",
            "date": "2017-12-18T09:05:00+00:00",
            "helpful_count": 17,
            "mal_id": 265495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=265495"
        },
        {
            "content": "Okay... I'm just going to get right into it. If you're wondering whether or not the sequel is worth watching, i'll be blunt. It is and it isn't. Don't worry, no spoilers, However I will explain why. \r\nFirst the reasons to watch it; \r\nA.) The plot follows as it should and sticks to the manga.\r\nB.) The characters don't change so much that you don't recognize them.\r\nC.) The character development is just like the original, but a bit more violent.\r\nD.) You get to further immerse yourself into the story with beautiful animations.\r\nNow the reasons not to watch it;\r\nA.) There is huge time skips that will leaveyou feeling lost, aka 30-100 chapters skipped.\\n\\n\r\nB.) If you're hoping to see a lot of previous characters, you will be a bit disappointed.\\n\\n\r\nC.) Lots of throw-away characters that you'll probably never see again.\\n\\n\r\nD.) At the rate the anime is going, you'll be left wondering what happened, 12 episodes is NOT enough for this much material.\\n\\n\r\nAnd that's a small sum to take into account on why you should or shouldn't watch this anime. The rest i'll leave for you to decide. Enjoy or Don't enjoy, the choice is always yours.",
            "date": "2017-12-10T06:25:00+00:00",
            "helpful_count": 13,
            "mal_id": 264907,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6771516.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Exiaze",
                "username": "Exiaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=264907"
        },
        {
            "content": "Being a fan of Ken Akamatsu's work (Love Hina, Negima series (this included)), I was even more happy to see it getting anime adaptations, but sadly with every passing adaptation, it always fails to make what the manga source material great, and then during the conversion to anime, it balls out at the very last minute, and this is another example here with UQ Holder, cramming 140+ chapters into 12 episodes (which clearly ISN'T enough).\r\nStory:\r\nSet 80 years after the events in Negima!, Touta Konoe (grandson of Negi Springfield) has Yukihime (or the legendary magician Evangeline A.K. McDowell who's a vampire as you wanna call it)as his guardian, and when his life is risked by a bounty hunter, gets to know her true identity and is introduced to the secret society kniown as UQ Holder, a society made up of people with supernatural powers.\\n\\n\r\nBeing a manga reader, somehow J.C.Staff assumed that asking people to watch the anime in itself is more of a travesty, because the Santa arc (which takes up at least 20 chapters of the manga) is COMPLETELY missing, and I have no idea why this anime even got a green light in the 1st place. Sure, Negima fans can even complain that the adaptations done earlier was worse, but thankfully this isn't (at least) the worst yet.\\n\\n\r\nCharacters:\\n\r\nTouta Konoe is your run-of-the-mill shounen, with his strong points being aggressive at what he does. Maybe not the best of the main UQ Holder crew, but his interactions with the others are what makes him stand out amongst the heavy action.\\n\\n\r\nKuromaru is an interesting one, because it states that his/her kind are genderless, and when they pass their 16th birthday they get to choose the gender to their liking (and of course if you watch UQ Holder you know the ship feels). Her battle style is of the Shinmei-ryu sword technique (similar to Setsuna), and like Touta, also creates a fun and distracting (in a good way) interaction with the others as well.\\n\\n\r\nAs for Yukihime, she's the Evangeline Negima fans know and love, just with her alias and establishment of UQ Holder. Nothing more to say on that.\\n\\n\r\nFor the others (the rest of the UQ Holder crew: Karin, Kirie etc.), they are not given enough time to showcase themselves on the big screen (although supplementary), but that doesn't mean they get their moments, and still strikes off really well.\\n\\n\r\nAll in all, the character development is one point where this show truly excels at, and wished it could be better if they stringed out longer than 12 episodes allowed.\\n\\n\r\nArt/Animation:\\n\r\nYes, you're probably thinking why J.C.Staff gimped on some of the visuals. And yes, things are sure to look more modern (and updated from the previous works), and while the art looked cheap, the animation was on-point consistent (well, most of the time) and gets the job done.\\n\\n\r\nTo be honest, I've expected J.C.Staff to input more budget knowing that the manga already had a great story to build up to with the action that's held very well, but knowing that paltry 12 episodes isn't gonna cut the slightest of the manga, I just hoped for the best and it delivers somehow, and it's satisfactory for the most part.\\n\\n\r\nSound:\\n\r\nThe OST is also fairly good as well. Both the OP and ED are energizing to hear (with a happy heart, of course) and can't really fault the BGM here. It's a work well done, but also at the same time, nothing special.\\n\\n\r\nI feel like this anime will STILL divide 2 camps of people's thoughts:\\n\r\n1) Anime only, as in watching the show purely without knowing what's going on, with the 3-episdode rule making the basis for the show.\\n\r\n2) Anime + source material (be it LN, VN, Manga), as in knowing the source material beforehand, and expecting more to come out of the anime adaptation, and comparing both materials to knowing which is better.\\n\\n\r\nAs for myself, I really still feel like UQ Holder, as a manga it's great, but the anime adaptation barely touches the iceberg, and even with the OVAs coming out next year (which bases off the different arcs in the manga), it feels incomplete at its finest. Yes, I do like what I have watched, and give it a fair bit of respect, but really, RIP Ken Akamatsu for another bad unjustified adaptation. Like in the premlinary Episode 4 count, do watch if you're a diehard fan or Negima, otherwise, go and read the manga if you want more of the storyline.",
            "date": "2017-12-18T17:38:00+00:00",
            "helpful_count": 10,
            "mal_id": 265537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=265537"
        },
        {
            "content": "Nostalgia hits us come the Fall of 2017 with another of Ken Akamatsu's work in the form of a spinoff of the Negima series, UQ Holder!. Does it hold up?...or will the high level of nostalgia disappoint us?\r\nFor LA, the Negima series is in a weird place for LA in terms of nostalgia all things considered. One is that the original Studio DEEN adaptation gives LA fond memories of this series but was definitely an adaptation with it's faults and typical harem cliches that hasn't aged well. The SHAFT version was LA's favorite over the years by having a more shounen-esque mystery feel to itbut having the typical SHAFTism that would have put people off. LA DID NOT read the manga but heard time and again from LA's friend that it went into a crazy shounen feel that even the SHAFT version didn't even get into. Thus LA was quite in a predicament when going into this spinoff completely blind.\\n\\n\r\nAnd now we have this anime spinoff with an entirely new cast of characters, with old ones returning and it being a fully fledged out shounen series.\\n\\n\r\nFor a start, LA's first impression of UQ Holder was rather meh, going through the cliches of the shounen field from the hot-blooded main character who's a nice guy but dense as hell character trying to surpass his teacher Yukihime (or Evangeline just using a transformation magic looking like an adult but whatever...) while trying to get out of his hillbilly of a village town he lives in. His goal is to make it to the top of the tower in.....a far off city. Yeah typical stuff, but its not until the halfway mark when all hell breaks loose from plot twists every episode afterwards to nostalgic throwbacks that ACTUALLY factor into this plot, new harem characters enter the picture and it going full shounen on us WITH UNCENSORED BLOOD!!!!!!!.\\n\\n\r\nThe entire character cast is very vast to say the least what with new and old characters coming in. So who are the most important characters in all this?...our main protagonist Touta Konoe voiced by Yuka Takakura, Yukihime/Evangeline voiced by Yuki Matsuoka, Negi Springfield is in this too of course who's reprised by Rina Satou and Fate voiced by Akira Ishida are the forerunners of this anime. Kirie Sakurame voiced by Ai Kayano, Kuroumaru Tokisaki voiced by Yuuki Hirose, Shinobu Yuuki voiced by Sayaka Harada, Mizore Yukihiro voiced by Akari Kito and Karin Isht Orte voiced by Yui Ogura (Favourite character by the way) are all in the harem and they have some sort of screentime and battles over this anime. The only harem members that didn't exactly have enough time are Shinobu for not having ANY battle prowess thus they kinda get shafted and Mizore for just entering the anime too late enough though she's battle ready but isn't as powerful as the core cast already are. As for the nostalgia cameos, it's too be expected the original series cast gets a cameo and some form of presences in the plot also yeah Mizore YUKIHIRO reminds you of someone?...yeah Ayaka Yukihiro voiced by Junko Minagawa gets an episode as well if only because of Mizore...a moving of the torch as you could say. LA's favourite cameo would probably be Asuna...because it was ASUNA like come on.\\n\\n\r\nLA thinks one of the only problems besides that LA hadn't read the source material as well as the original source material was that the pacing is very quick, yeah not \"all over the place\", UQ Holder! has a pacing it's just very quick trying to cram in enough exposition, characters and action scenes in one episode as much as possible and yes this impacts the finale but again...this anime is trying to cram in an ongoing manga source material into 12 episodes.....this was GONNA HAPPEN.\\n\\n\r\nIn terms of animation by JC Staff, the animation is pretty consistent, from the amazingly brutal battles to the updated and newer characters and ecchiness typical of the Negima series. All LA will say about the animation is that LA really liked the animation all round and it didn't flake on shortcutting at times and didn't annoy LA in many ways. All round the animation especially the supernatural shounen battles were the highlights in terms of animation.\\n\\n\r\nThe voice acting on the other hand was pretty great all round. From Yuka Takakura crossdressing voices living up to the tradition that Rina Satou did in the original and doing a great job at it, to Yuuki Hirose voicing eerily similar to Nana Mizuki in her typical badass role and yeah a Yui Ogura performance LA can get behind who's voicing a kuudere badass. As for the nostalgia cameos, well it's to be expected that the majority of the voice cast reprises their roles...well cept the ones that...uhhhh can't because reasons. Just reasons. Either way, LA really loved this voice cast, from new and old and even some very well done newbies. Ohh LA forgot but LA thought that Sayaka Harada as Shinobu was voiced by Ayana Takatatsu all this time before LA found out it was Sayaka...MAN Sayaka has range!.\\n\\n\r\nSo right back to the question LA put at the start of this review. Does this spinoff anime hold up by itself?...well LA thinks this question needs to be rephrased. Does this spinoff HELPS to it's original source material while being it's own thing. Well to that LA says yes. This spinoff helped to be like it's original source material as well as growing it's world building as well as TRY to bring in new characters to be important to the plot to which LA feels that Ken Akamatsu obviously planned with this spinoff to how intrinsically linked Touta and Evangeline is to Negi Springfield.\\n\\n\r\nSure this spinoff has problems like the aforementioned pacing issues this anime has but even then LA could defend it by it being an ongoing manga so it was to be expected as well as the problem of a core cast of new characters with powerful battle prowess taking themselves to the forefront with the lesser battle prowess characters being left in the dust and the nostalgic cameos though they are important to the plot, but only by a few scenes unfortunately and of course being an audience member who didn't read the original source material as well as THIS source material and going completely blind had it's own problems, but even with all this, LA did like this spinoff for being it's own thing while paying homage to the original series AND being completely shounen helped as well.\\n\\n\r\nNostalgia is something we want to have to go back to those good old times, but even then we can't have it back 100% as a full experience in the form of a new spinoff, prequel, sequel or whatnot. But having a spinoff learned from it's mistakes from it's MANY adaptations it had is a good step up but that same spinoff bringing in it's own mistakes is for LA...a given.\\n\\n\r\nUQ Holder!: Mahou Sensei Negima! 2 is a decent to great spinoff even with it's strengths and weaknesses. What else can LA say?..Ohh wait how about...\\n\\n\r\n\"Kimi ni todoketai HAPPY READY GO!\"",
            "date": "2017-12-18T14:31:00+00:00",
            "helpful_count": 9,
            "mal_id": 265518,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=265518"
        },
        {
            "content": "For real, this adaptation is poor.\r\nUQ Holder! (anime verison) forgot story arc, character, background.\r\nIt's a manga condensate with censor and scene with no sense wasn't part of the manga.\r\nI really don't know why they destroy the original work with random adaptation.\r\nIt's a bad advertising for the manga who is really better.\r\nthe oppening is medium and forgettable.\r\nRip Santa, a touta teamate character delete in this adaptation. he have a good story and is important for her.\r\nRip touta training period with Dana.\r\nRip the touta and kirie sharing spell who is a important spell in the story and in the last fight versus negi's team\r\nAND WE CAN CARRYON LIKE THAT 1 HOUR I THINK",
            "date": "2017-12-19T10:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 265599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5655845.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sneakylelouch",
                "username": "Sneakylelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=265599"
        },
        {
            "content": "The adaption from the manga to anime was terrible! They skipped out on parts that WILL come later in the anime if it is continued. But they should have followed the same order as the manga so that the viewers would have understood more and felt more towards the characters and story. They also just completely got rid of a character that may or may not come later, but they were still an important part of the whole story! To anyone who wants a good story you should read the manga and forget all about this anime!\r\nIt you had not read the manga and justwatched the anime it would have been a lot better! But even as an anime they skipped a lot of character development and backstory that would have made the anime a lot better. They rushed the story and everything else way too much. If they continue the anime i guarantee that it will still be lackluster. But if they decided to continue it they really have to slow down the speed of story and give better character and background development if they want it to feel meaningful.\\n\\n\r\nSorry if my thoughts are allover the place and such, i don't write reviews ever and i just suck at writing. Overall this anime is complete trash compared to the manga!",
            "date": "2017-12-22T14:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 266025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4527838.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Arukoruotaku",
                "username": "Arukoruotaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=266025"
        },
        {
            "content": "When UQ Holder! anime is announced and the OVA is released, I actually feel have some hope that this anime will be good and followed it's source material. However, when the anime is start aired until the end, it's nothing but highly disappointed me so much even more than the first two Negima anime series does.\r\nStory: 3/10\r\nAt the beginning of the story, same as the manga does but with some mirror changes. It's started at a boy named Konoe Touta who live in a village along with Yukihime, along with his friends always challenge Yukihime in order able to leave the village and make theirdreams comes true. They are always having fun and thinking how to defeat Yukihime all the time, until a male teacher come to teaching Touta's friends the magic spells and tells Touta to give a ring to Yukihime, the ring are used to forbidden the ring wielder to use any magic spells. In the second day, Touta's friends attack Yukihime with using magic, a few minutes later that teacher attacked Touta's friends and tried to kill Yukihime. Yukihime's true name is revealed to be Evangeline A.K McDowell, who is a Vampire from the prequel series Negima!, the ame teacher is also revealed to be a Immortal Hunter and want to kill Yukihime for granting a lot of moneys. When Touta seen Yukihime and his friends in danger, he tried to stop that Immortal Hunter but Touta is killed by him, and later Touta is revived as a Vampire by drinking Yukihime's bloods and successful defeated the Immortal Hunter. To avoid an another Immortal Hunter to attack again, Touta and Yukihime is forced to leave the village, Touta is thinking of he can finally go to the tower, to following a mysterious man's request. As such, Touta and Yukihime has started their journey.\\n\\n\r\nThe story is still followed the manga faithfully until EP3 where the story plots almost gotten changed and it's so much different than the manga does, and the scriptwriter keep changing the story plots thought EP12. The Anime skipped a lot of stuffs that's actually important in the manga, and rushed the whole story plots which caused a lot of confusing when they showed/mentioned somethings that the anime didn't even shows up or being mentioned.\\n\\n\r\nArt & Animation: 4/10\\n\r\nI don't know but the art in this anime are look odd and it seem like J.C Staff tried to followed the Negima OVAs' art but they failed to do so. Sometimes the art (Especially animation) are so bad and it's laughable sometimes, it's seem like J.C Staff either don't have enough budgets to make the animations decent or they didn't even put their effort to did the arts.\\n\\n\r\nSound: 7/10\\n\r\nIt's good to see Haneoka Kei returned to did the music for Negima/UQH franchise again, thought his music isn't that memorable than his music in Negima!? and the Negima OVAs does, but I still somewhat enjoy the music a bit. As for the characters voices, I like them and it's actually fit the characters' personality. Except of Touta, who is like a typical hot-blooded main male protagonist of Shounen action manga are voiced by a Female voice actor. In my opinion, Touta being voiced by a Female VA is feel so out of place and unfitting due to his hot blood personality and he didn't have any childish personality like Son Goku from Dragon Ball series, Luffy from One Piece series and Naruto from Naruto series does. Thought as the anime progress, Touta's voice isn't so annoyed and I start get to used his voice a bit, but my opinion on Touta's voice still haven't change in the end.\\n\\n\r\nCharacter: 2/10\\n\r\nThere's a lot of good characters in this series, but due to the anime being skipped and rushed too many plots we didn't seen the characters get developed thought the end of the anime. Even so, we still did see how other character like Kuromaru (The female look a-like \"boy\") and Shinobu (The maid girl) get a bit character as the anime progress, but mostly on their feeling toward Touta.\\n\\n\r\nEnjoyment: 3/10\\n\r\nIf you never read the manga before you may enjoy this. But for me who is the manga reader, I can't enjoy the anime so much due to the rushed plots and a lot of plots changes here. Sometimes the plots changes is so ridiculous that I can't even holding my anger to watching this.\\n\\n\r\nOverall: 2/10\\n\r\nThe only reason why I give 2/10 instead of 1/10 are because the first two episodes are accurate to the original manga and there's a few moments in this anime that I actually enjoyed. Overall I don't recommend anyone to watch this but recommend to read the manga instead, but of course you can choose to watch this anime if you want and this review didn't bother you that much.",
            "date": "2017-12-19T03:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 265569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545588.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MahiaErebeaNegi",
                "username": "MahiaErebeaNegi"
            },
            "url": "https://myanimelist.net/reviews.php?id=265569"
        },
        {
            "content": "UQ Holder! is definitely an anime with so much potential especially since the manga is very good in my honest opinion as was its prequel Mahou Sensei Negima (the manga, not the anime because that was just bad) but unfortunately it suffered so much from being rushed, left out arcs, and a big focus on the RomCom elements which would have been much more cohesive if they took their time on adapting the source material. It should also be noted that there are many things that require knowledge about the previous work, Negima, which I recommend for you guys to read the manga as theanime never really went far especially with the Magical World arc.\\n\\n\r\nThe story starts out with our main protagonist, Touta Konoe and his friends attacking their teacher and Touta’s guardian, Yukihime (Evangeline A.K. McDowell). Their dream is to get out of the village and go to capital and reach the top of the space elevator. However Yukihime is a mage and isn’t so easily defeated. A crisis that develops leads to Touta finding out about his curse of immortality that was given to him by Yukihime and eventually he and Yukihime leaves the village and make their way to the capital where he can make new friends.\\n\\n\r\nOn their way there, Touta meets an immortal immortal hunter, Kuroumaru, who later becomes his best friend. While the three of them travel they eventually come into contact with Yukihime’s organization UQ Holder. UQ Holder is an organization of immortals that help the world much like a guild and they also operate an inn. This is the how Touta Konoe’s everyday life begins, one filled with romantic comedy as the staff and even guests eventually develops feelings for him, even his best bro. But not everything is sunshines and rainbows as Touta’s past is trying to capture him and he must uncover the truth as well as his connection to his grandfather who is the greatest mage, Negi Springfield.\\n\\n\r\nThe problem here is that J.C.Staff is trying to cram so much material (over 100 chapters worth) into just 12 episodes. So much doesn’t make sense that I kept asking myself stuff like “why this character is showing up so early” or “wasn’t there an arc or 2 before this scene happens?”, the result being that it is an obvious mess and destroys something that could’ve been nothing less than epic. If the studio had been given a chance to do a 2-cour (24 or 25 episodes) of this adaptation then it would’ve been undoubtedly much better than what has been presented to us. It also doesn’t help that they completely erased one arc that introduced us to a really strong character and another male in this Touta-centric anime, they also omitted the training arc where pretty much all the kids get ridiculously strong because they were taught by none other than Evangeline’s master. The training arc was somewhat shown in the OVA but it focused more on Eva and Touta’s relationship which was really sweet but the climax was omitted to my dismay. Also for those who haven’t read the manga you guys should watch the OVA after the anime because of the last line in the anime for it to make more sense.\\n\\n\r\nThe art was decent enough and the action scenes were quite fluid but they lacked the punch that could be found in the manga. It also doesn’t help that some of the more intense fights were cut out due to time constraints. I was also incredibly pissed they never once showed Yukihime using her Magia Erebia form to fight which makes one of the best fights in the whole series when she used it against Fate. Being a romcom anime as well there are many fanservice scenes but I question the censorship using Kamo, while it was cute and unique first time watchers will wonder who the creature is.\\n\\n\r\nI can’t really say much about the soundtrack but the battle music was quite good and manages to sound right when the mood gets heavy or dramatic but it wasn’t exactly memorable in my opinion. The voices were alright but Touta’s was annoying or didn’t sound right at first but I eventually got used to it. The opening and ending had some fanservice and it was too cheery in my opinion, they could’ve just went for some Fairy Tail like songs and it would’ve been much better although that’s just my opinion.\\n\\n\r\nIn the end UQ Holder! had so much going for it but definitely is only subpar at best. A truly epic series despite all the fanservice and slapstick comedy was again afflicted by Ken Akamatsu’s (the creator) curse of having bad adaptations of his works. But despite all the negatives, the few positives helped alleviate my impression of the series. It was so nostalgic to see Negi and the class of 3-A all over again especially Asuna. It reminded me so much of the Negima manga that it makes me want to read it all over again. Also Kuroumaru’s case of his/her feelings for Touta retains the same amount of hilarity as it did in the manga.  I also had fun watching Evangeline but that could just be my bias as she is my favorite character in the Negima universe. In a way it is also unique to see a romcom for immortals.\\n\\n\r\nIf you want to get the full experience of UQ Holder! then I wholeheartedly recommend that you read the Negima manga if you haven’t yet as its 2 major arcs are some of the best if not the best I have ever seen in any medium, then after that you can read the UQ Holder! manga which I will do so soon because the anime just doesn’t do it the justice and exposure it deserves.\\n\\n\r\nP.S. You can also read my review here and some video game reviews if you're interested:\\n\r\nsirusgaming.com/2018/01/anime-review-uq-holder/",
            "date": "2018-01-09T09:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 268035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3670637.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Jetezark",
                "username": "Jetezark"
            },
            "url": "https://myanimelist.net/reviews.php?id=268035"
        },
        {
            "content": "Seems like I am beating a dead horse when it comes to the story. But most of the reviews are bashing the incompleteness of it and I'll just add onto it. There were times where I would just say \"Wait, what is going on?\" And there would be little to no explanation. (Like at the end of the final episode)\r\nThey made up for it by having cute moments and *ahem* sexy moments, but not monumental moments which could sway the story into something better.\r\nThe animation was great, and the characters were really enjoyable. I actually liked Tota which is weird because I usually hate poweredMC characters.\\n\\n\r\nIf you liked Negima and want some Nostalgia I would recommend UQ holder. Other then that it's really not worth wasting your time on.",
            "date": "2017-12-19T19:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 265671,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=265671"
        },
        {
            "content": "Short version: Do you like awesome, beautiful fight scenes?  Are you willing to sit through what this show thinks is a \"story\" and a \"harem\" to get to them? Then you should watch this. People who like serious stories alongside action have much better options.\r\nLong version:\r\nI didn't have many expectations for this anime, going in. I knew there would be story elements and references to the first Negima! series that would go over my head, since I have not seen it, nor have I read the original manga. However the title's branding as \"UQ Holder\", as well as the strength of the first episode,drew me in. So that's my perspective- if you're an OG Negima fan you may want to read someone else's review.\\n\\n\r\nLet's start with the sound design. This, I feel, epitomizes the show. The SFX do their job, with only some of the more powerful spells used later in the show sticking out to me as memorable. The music too, chugs along with the show, dutifully getting intense during fights, hopeful when the characters reach some important revelation, yada yada yada. It's... just good enough. It manages to step over the bar, but it's nothing to praise either. \\n\\n\r\nThe art is amazing though. This anime is simply gorgeous to look at, and it doesn't feel like there are many cheap tricks to avoid animating things, either. There is an action scene every episode, and although it isn't always a fight, it keeps the early episodes from feeling like exposition dumps. However, the story itself is a major let down.\\n\\n\r\nIt was so disappointing to watch a somewhat unique story trainwreck into a convoluted, rushed mess. Frankly, the UQ Holder (think Immortal Magic Justice League) part of the plot is swept under the rug so quickly, it seems to exist solely to justify the graphic torture we watch the characters undergo. Having a plot that includes \"all of the main characters are immortal\" is a great way to play the balancing game of \"Serious Philosophical Ideas\" and \"Dumb Anime Bullshit,\" because it takes the tension off, so it's more believable when characters are joking around in one scene, and fighting seriously in the next. But no, it starts sloping down when the show just tosses \"deep\" questions out (such as, \"Is it worth it for an immortal person to make friends with a mortal, knowing that they will one day die and be left alone?\") and just straight up forget about them. \\n\\n\r\nIt then takes a complete nosedive when the main plot inevitably becomes \"main character is going to be absorbed by the bad guy! Oh no!\", which not only makes the story feel generic, it turns that unique plot point and just makes it an excuse for what is basically torture porn. The characters all suffer big time, and I found it unsettling, even having just watched Texhnolyze before watching this show. Again, this could've been an outlet for philosophical expression, but it just feels distasteful, even if I didn't like the characters, either.\\n\\n\r\nThe characters are another low point. There are seriously about 300 characters who give their full names out, and about ten of them show up more than once.  Of those, four of them are on harem duty, fulfilling their cookie cutter tropes and little else. The rest are barely developed, having one cool fight scene apiece, and otherwise they rotate out for expositional dialogue. \\n\\n\r\nBut I still found it in me to finish this anime, and you will too, enjoying yourself somewhat if you are a ACTION/FIGHT SCENE JUNKIE. I kept watching because the fights are among the best I have ever seen in an anime, and I could just switch my brain off during the rest.It's pretty brain dead anyway.\\n\\n\r\nIndividual scores:\\n\r\nStory: 0/2\\n\r\nArt: 2/2\\n\r\nSound: 1/2\\n\r\nCharacters: 0/2\\n\r\nEnjoyment (FIGHT SCENE JUNKIES): 2/2\\n\r\nOverall score: 5/10",
            "date": "2017-12-19T13:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 265623,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5263721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/B-MAP-000",
                "username": "B-MAP-000"
            },
            "url": "https://myanimelist.net/reviews.php?id=265623"
        },
        {
            "content": "For those of you who went in watching UQ blindly, it is about as decent as other medicore animes from past years. I wouldn't really recommend it though as it is a rushed adapation, but like I said it's not the best and if you think it's worthy of your time then go for it.\r\nNow for the fans of the Negima! series. It was a horrible journey am I right? I admit there were good nostalgic scenes that made me happy (seeing class 3-A again with all their pactio transformations, oh especially Natsumi with her artifact!), but overall... no words can describe my feelings forthis adapation I over-hyped about. But if you are reading this review, I congratulate you and thank you for your service. We should all atleast give a small appreciation for this adapatation for happening, even though we have very high negativity for a poor adapatation. \\n\\n\r\nBut hey, if you all think about it, this could just be one of the many different worlds that could have taken place. No? Yeah I know, it's just me being optimistic as possible.",
            "date": "2017-12-18T21:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 265557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847142.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LeWind_God",
                "username": "LeWind_God"
            },
            "url": "https://myanimelist.net/reviews.php?id=265557"
        },
        {
            "content": "Watching UQ Holder is like riding Space Mountain: Mission 2 at Disneyland Paris. It has a strong start and continues to go faster and faster to the point of breakneck speed. And before I knew it, it was already over. Despite its rough bumps and out of control spins, I couldn’t say I didn’t have some fun. That’s the best analogy concerning the anime adaption.\r\nAs an aficionado of the creator’s previous works (Negima and Love Hina) and a regular reader of UQ Holder, I’ve been anticipating this anime since it was first announced. Taken on its own, the anime offers a standard shounen platform. Anice and short introduction to Evangeline A.K. McDowell a.k.a. Yukihime provides enough information to get into the story’s world and does a good job showing immortality may not be all it’s cracked up to be. The story is what drew me into the series given how much I love shows with elements of magic and most things relating to vampires. \\n\\n\r\nUQ Holder isn’t just a title for the show, it’s the name of an organization for immortals and non-humans to gather, socialize and aid one another. The idea of a world full of immortals is an engrossing one because the characters will have to think of creative ways in order to best the other. The plot initially moves briskly to keep things interesting and as episodes go on, it goes faster. In fact, too fast. This is because the anime blazes through the source material and even skips some of it or around it. Various elements are changed to fit with the anime. This isn’t inherently a bad thing and it’s surprising the anime is still able to remain somewhat coherent despite the edits. On one hand it’s never slow, but the premises and arcs aren’t as strong because character development from the manga is missing. Which made me wonder why was this only 12 episodes.\\n\\n\r\nIf there’s one element of the story I wish had more screen time it’s the relationship between Yukihime and Touta. It’s important to the entire plot and what happens in the last arc of the anime. So it makes no sense to have followed that arc extensively whilst having skipped over a lot of what came before it. The emotional bond between them seems more absurd here whereas in the manga, it’s obvious they both deeply care about each other and there’s a lot of reasons why which the anime does not get into. It makes it hard to judge the anime for what it is rather than what it could and should be.\\n\\n\\n\r\nCharacter-wise, UQ Holder does have a variety of personalities present. Considering the number of characters that can be found here, some of them are going to be more entertaining of course. Touta is the main character to the story and he’s usually happy, boisterous, sociable, kind-hearted, trusting, skilled, and strong while possessing an endless sense of optimism. He actually reminds me a lot of myself when I was in high school (wait a sec, I’m still all of those things!). For a story that has bleakness and sadness lingering in the background, it’s fun to have an upbeat hero who has laudable ideals like Touta. Even though Touta is likable, Evangeline A.K. McDowell/Yukihime is more intriguing, but this is entirely fueled by knowing who she really was already. She’s without a doubt one of the sexiest anime women my eyes ever caught sight of. Seriously, her thighs are out of this world. Besides oozing sex appeal she is a vampire, the legal guardian of Touta, one of the strongest and most feared mages in the world, the catalyst for the plot and the leader of a group of immortals.\\n\\n\r\nOther characters populating the world of UQ Holder include: Kuromaru, Karin, Kirie and Ikku. Kuromaru is the androgynous, reserved deuteragonist who serves as Touta’s best friend and right hand man. Karin is the stoic, big-breasted, bad ass fighter who for some reason harbors an admiration for Yukihime, a dislike for Kouta and runs like Sonic in the first Sonic Adventure game. Karin is smug, arrogant, snarky and has the coolest power. Ikku is… Ikku. There is one character who doesn’t make an appearance and as far as I’m concerned, that’s unforgivable since he’s one well-written character I was highly and emotionally invested in. There was a number of things wrong with UQ Holder, but his absence was the one that sucked the most. Boooooo! Hiss! Hiss! \\n\\n\r\nRegarding the aesthetics, this was initially a clean-looking, but not a drop-dead gorgeous production. The characters are expressive, but the backgrounds feel a bit flat, and the color work isn't all that inspired. The show’s animation is at its best during the fan service filled OP, chibi ED and big fight scenes, but overall it became more uninteresting to me as it progressed. I’m not sure if this is because I like the manga’s sharp lines and art more, but the visual quality does slip especially in the later episodes which to put it bluntly, stinks. \\n\\n\r\nA question I’ve been catching myself asking more and more recently is: when will the CGI fad in anime die? UQ Holder may not be the prettiest production, but seriously, those CGI giant lizard monsters looked incongruous with the cast and backgrounds which made them very distracting. They looked more like they belong in an awful and cheap version of ReBoot. Another irritating facet in the animation department was the censorship, especially in one of Karin’s fight scenes. For the record, I have no interest in any of the other women so I don’t care about seeing her naked. However, having the image of Chamo as censorship blocks just killed everything since it took my focus off the fight. I have an idea what’s going on here. Even though UQ Holder is a late night anime, the edits are used as a way so viewers have to buy the highly priced DVD/BD if they want to see it uncensored. I get it, anime studios have to make money, but I don’t think there was any reason to use that type of censorship. \\n\\n\r\nBesides the OP (which happens to be an updated version of  “Happy☆Material”)  and ED songs, there wasn’t anything notable in the music. The voice acting is pretty good and most of the characters sounded how I imagined they would other than Touta who sounds younger than I thought, but then again he’s 14 years old.\\n\\n\r\nAs much as I don’t want to admit it, it’s hard being an Akamatsu-sensei fan. His previous brainchildren never got the accurate anime adaptions they rightfully deserved, and with UQ Holder, the struggle continues. At the end of the day, I wouldn’t say this was a terrible and unwatchable mess, but it sure was a disappointing adaptation. There really is a good story, full of interesting and distinct characters and all it needed was for it to be handled competently so the end product would’ve been excellent. Being a manga reader, I will also say I enjoyed this more than I should have. Well, if nothing else, Yukihime has a wonderful ass.",
            "date": "2017-12-18T17:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 265538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6727350.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Starchaser",
                "username": "Starchaser"
            },
            "url": "https://myanimelist.net/reviews.php?id=265538"
        },
        {
            "content": "Having never seen or read any of the Negima stuff, I didn't realize until partway in that this was a show set in the future of another show.  That said, you don't really need to have seen negima to feel the connection the returning characters have with each other.\r\nWhat jumped out at me most was the first episode of this series. If the rest of the season had been like episode one, this would have been an all time favorite for me.  I think the story notches down a bit after episode 1, but I still found it very enjoyable.  Some ofthe reviews from manga readers point to the cramming of a bunch of chapters into one corre season, and I can kind of see that.\\n\\n\r\nIf they could have made a season based solely on Touta's connection to Evangeline, it would be an all time favorite for me.\\n\\n\r\nNow, I guess I should go watch Negima.",
            "date": "2019-02-12T17:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 301522,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7206649.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animeFreakFred",
                "username": "animeFreakFred"
            },
            "url": "https://myanimelist.net/reviews.php?id=301522"
        },
        {
            "content": "I do not know why this anime has a 7+ rating considering the main character won't react in any rational way. I forget which episode it was but when he is allow to ask \"one question\" he learns some stuff of his past but he is at no point upset, and when that one character broke the thing on his back and getting rid of the hologram, he acts so calm when he should have been angry cause he was going to learn something of his past that people were hiding. The main reason I hate the anime was cause I put some time asideto watch this only to feel that it was a complete waste when I watched this scene. It would not be so bad if it was just boring and I wanted to see something, but when they play such a BS scene I feel betrayed. I normally do not get this mad at anime but I decided that I needed to make a account on this website to alert people that this series is trash and ruines itself.",
            "date": "2018-12-15T20:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 295858,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rank_or_Spank",
                "username": "Rank_or_Spank"
            },
            "url": "https://myanimelist.net/reviews.php?id=295858"
        },
        {
            "content": "(Spoiler-Free)\r\nAs much as I love the manga UQ Holder, the adaptation is, well...\r\nsame cases as old Negima anime. \r\nThe old negima had completely change the whole plot/story thanks to Xebec but I still can forgive since its from old early 20's. Supposely its going to be better adaptation, but Nope. JCStaff just throw everything away and make a same thing, except we going way too fast as fak until making this show as the most uninteresting shounen anime ever made.\r\nUninteresting story, plot holes, unnecessary huge fan-service and disappointment ahead.\r\nOf course manga peasent be like, na don`t watch anime, go for manga! Manga!\r\nYeah. One thing Iwanted to enjoy is the beginning to the end of the anime adaptation. No. 12-Episodes crammed then hah. Enjoy your show.\\n\\n\r\nBut truth is, I still like the art (even though some are a bit... clunky), the nostalgic Opening (even though kinda lazy but its good.), and the world settings, interesting concept. But oh well.\\n\\n\r\n5/10. Its nice to see a good old Evangeline in the show.",
            "date": "2018-11-22T05:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 294525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960885.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/murut87",
                "username": "murut87"
            },
            "url": "https://myanimelist.net/reviews.php?id=294525"
        },
        {
            "content": "For me it was a good anime, I could have a sequel because I think I had the potential for it.\r\nAlthough this harem was a bit annoying and I think it spoiled anime, but I really liked the part of him wanting to marry eva and not be like most of the harem anime that the protagonist does not choose anyone........................................................................................................................................................................................................................................................................................For me it was a good anime, I could have a sequel because I think I had the potential for it.\r\nAlthough this harem was a bit annoying and I think it spoiled anime, but I really liked the part of him wanting to marry evaand not be like most of the harem anime that the protagonist does not choose anyone",
            "date": "2018-09-23T17:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 289834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7303894.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/1styx",
                "username": "1styx"
            },
            "url": "https://myanimelist.net/reviews.php?id=289834"
        },
        {
            "content": "I wish this series turned out better, I have seen so many cliche harems they are legit pissing me off. This show started out strong but once they start adding females and the main character stays dense as he started then I lose interest. I was actually happy when he confessed but they played it off like any other show. I feel like this show and Index misadvertise being action shows when really their ecchi fan service harems. No development nor closure either, tsk tsk. also if I see another set of tsundere or emotionally unstable women I WILL SURELY DIE. ALSO TITS, SO MANYFUCKING TITS",
            "date": "2018-03-14T20:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 273846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4758505.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/OuroborosXiii",
                "username": "OuroborosXiii"
            },
            "url": "https://myanimelist.net/reviews.php?id=273846"
        },
        {
            "content": "This got me hyped up when I saw it coming, but at the same time I feared that it would die off just like past adaptaions. And it came true.\r\nOverall:\r\nStory: Actually followed the manga for more than half a season so I'll give them credit for that. Of course it's understandable that pacing becomes an issue with all adaptations, but studios need to realize, following the real plot properly and ending off with a cliffhanger is much better than twisting stories to suit your production timeline and ending with a cheesy plot that just screams dues ex machina at the end.\r\nVoice acting was good ina sense that it just hits you with nostalgia. Some casts though, really need to improve on their acting. That and the script flow between each character isn't very smooth, I'm not sure if they managed to get all the voice actors to voice scenes together or they recorded them individually depending on schedule. But to me it doesn't feel like all the characters were present when they recorded. Conversations are a bit disjointed.\\n\\n\r\nAnimation-wise, it's barely passable for a series with so much battles. J.C. Staff has obviously not put in as much money as they did for Index series. Ultra low frame-rates, simplistic drawings for attacks. If it was a doujin circle I'd give it an A+, but for an established studio, this is a D- in my book.\\n\\n\r\nRIP Ken Akamatsu. Seems like you're never going to get any decent adaptations ever. Now the only hope of redeeming the Negima series is to pass it over to Ufotable with a blank cheque. J.C. Staff better have an epic Index installment considering they cut corners with all their side projects.\\n",
            "date": "2017-12-14T23:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 265244,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KuriYokan",
                "username": "KuriYokan"
            },
            "url": "https://myanimelist.net/reviews.php?id=265244"
        }
    ],
    [
        {
            "content": "As much as I’d like to enjoy a return trip back to the Negima universe, I can’t help but wonder why this anime even exists. Watching Uq Holder is like reading an incomplete book, one that has unsalvageable mistakes. It’s as if the producers gathered together at the last minute to procrastinate this like a school project. Don’t me wrong though. This show would have a lot of potential if the staff and directors actually had an elaborate plan. Unfortunately, it ended being broken in ways that can’t be repaired.\r\nI’ll address this early so anime only viewers won’t shake their heads in disappointment and regretlosing their valuable time. As a manga reader, Uq Holder is crammed into a 12-episode show that can’t hold itself together. Beyond the rushing, many details are left unexplored and we hardly get character development in the proper places. It also doesn’t help out that the show sells itself as a sequel. Some characters from the original anime make cameos while introducing new ones and ideas. The term “Uq Holder” is a central focus in this anime. Essentially, it’s an organization made up of outcasts that are non-humans and immortals. The show attempts to get new viewers into a comfortable position with exposition. What ends up happening is an unimpressive story that leaves unfavorable impressions.\\n\\n\r\nHonestly, there isn’t really an elephant in the room. With a quick glimpse of the key visual, it shouldn’t be surprising at what viewers should expect already. Anyone familiar with the Negima universe will likely recognize some of the character. For new viewers, this will probably evoke a thought at what a potential conflict the show will bring. To add insult to the injury, the principle character cast isn’t well developed. Touta Kono is a good example. He is the main male protagonist and honestly a guy that’s too carefree. Being optimistic and energetic isn’t an issue in itself but the show makes him look behave like a kid at almost any chance it gets. It doesn’t help that he often speaks his mind and is too dense to certain situations. Touta’s relationship with others become an important part of this show especially with Yukihime, a vampire and leader of the Uq Holder. Indeed, their relationship seems to be unique among this show that they are very close as friends, comrades, or perhaps something even more. Unfortunately, this show doesn’t develop them more than they should have. It’s pretty much a slap in the face for fans of the manga and general audience as a whole.\\n\\n\r\nBeyond these two, there are also some other characters that get noticeable attention. Kuromaru Tokisaka is a character that I have mixed opinions on. First of all, the anime makes it clear that Kuromaru seems insecure about his gender. It becomes a recurring joke that gets old fast. Next, I can’t help but find Kuromaru and Touta’s relationship to be lacking. The two gets along well and seems similar in personality. However, there’s really not much beyond that. It doesn’t really exceed expectations or leave memorable impressions. There’s even an episode that puts the two together on a date but nothing really develops from it. This applies to other characters in the show where their role is minimized but instead puts Touta in the spotlight. It tries to get him over but fails on multiple levels. For instance, Kirie’s interactions with him feels like a bickering between young siblings. Karin also treats him with distaste that makes Touta look like a fool. Shinobu Yuuki (the maid) and Touta seems to have one of the only normal interactions in this anime but it only goes far as that. Nothing ever really stands out beyond their small talk. Additionally, I can’t proclaim the antagonists to be interesting either. Their motivations aren’t too clear and most of them are generic to the bone. One of them even has a perverted personality that makes crude jokes towards women. There’s a sense of mystery that is meekly explored about them although by story adaptation standards, it’s really more of a misshapen product. So in retrospect, I can’t really say this show has an impressive character cast at all. Too bad really.\\n\\n\r\nNow I do have to admit, watching this show hit me with a dose of nostalgia. The original Negima manga was popular during its run and while the anime adaptation quality was subpar, it still had its moments. Uq Holder tries to remind us of those moments through the flashbacks and storytelling. Negi and his students make cameos in some way or form. Honestly, watching those segments were worth it despite the inconsistency with storytelling. The comedy of Uq Holder is also what people can describe as sexy and fun. It shouldn’t take long for viewers to recognize that the creator of this anime really want us to be get sucked into his ideas. However, that can really end up being a mess with and at its worst, a terrible executed joke.   \\n\\n\r\nAdapted by JC Staff, this anime’s visual quality turned out to be what I had expected. It gives off a very shounen feel with its action and choreography. It does go beyond the usual punches and kicks as it adds blood and even violence. Some of the battle scenes goes over the top with even body horror elements. Fan service is very evident throughout the show with clothes torn off and eye-catchy angles. Character designs are consistently adapted with the mature appearance Yukihime and feminine look of Kuromaru. To say the least, JC Staff did its job but not one that you can talk about them for years to come in regards to this anime.\\n\\n\r\nI can’t say much for the soundtrack except that it seems to work on certain levels. The OP and ED theme features montages of the main characters although is saturated with fan service. Character voice seems to work on most respects although listening to Touta talk can be quite annoying at times. On the other hand, I do appreciate how this show maintains a good balance of battle OST. When it gets serious, it maintains that mood.\\n\\n\r\nAfter watching UQ Holder, I can’t say this is recommendable unless you’re absolutely curious about the adaptation or wanted to be hit with some nostalgia. It’s one of those shows practically screaming “read the manga!” The humor gets old fast and despite the nostalgia it can bring, it still ends up being very underwhelming. Ultimately, this anime turned out to be a poorly executed plan. When you put all the broken pieces together, it still ends up being broken. \\n",
            "date": "2017-12-18T07:17:00+00:00",
            "helpful_count": 48,
            "mal_id": 265492,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=265492"
        },
        {
            "content": "Ken Akamatsu is one of the best mangaka I have ever seen. He took the worst two worst combined genres being Ecchi and Harem and manages to them good. Ken Akamatsu has known its attention to detail to developing its characters from main to even side characters. His works still intrigue me to this day thanks to his manga series being well written, well-paced, engaging, funny, and enjoyable to read.\r\nFor me Ken Akamatsu is a legendary mangaka.\r\nHowever Ken Akamatsu works gets an anime Adaptation thing doesn’t quite as well. In fact, his works don’t really translate well into anime. For example, the Love Hina mangais a solid romcom manga with great comedy that is actually funny, solid romance, likable characters that get developed and does a great job exploring the theme of love and achievement. However, the director for the anime decided to take everything that made the manga good and turned it into a bottom of the barrel, poor animated, unfunny, and cringe-worthy romcom anime that has no at all.\\n\\n\r\nAnother example of this is Negima which not as bad as the Love Hina it’s still pretty lacklustre adaption overall. The first Negima anime done by Xebec was is a decent show on its own that has good and emotional moments however when you start comparing it to the manga you will soon find out it’s a terrible Adaptation as it skips a lot of chapters as well character’s not even having the right colour to the censored fanservice. As for Shaft Negima the only one that I actually liked are the ovas because not only it’s followed the manga perfectly it was still a great watch for both the manga readers and newcomers. Expect for the Negima Final Movie which was shit. As for the Negima!? TV series is fine but also pretty boring due to the series being reduced to a comedy gag filler show after a certain set of episodes and it got boring fast. Now I personally don’t mind filler as along its done right as well being entertaining to watch but Negima and Love Hina filler are not even that good at all.\\n\\n\r\nNow we got UQ Holder. Ken Akamatsu latest anime adaptation.\\n\\n\r\nIs this anime any for newcomers for the Negima franchise?\\n\\n\r\nIs this a good adaptation of the manga?\\n\\n\r\nOr it’s just a forgettable shounen series.\\n\\n\r\nWe will soon find out the answer.\\n\\n\\n\r\nStory.\\n\r\nThe story in UQ holder is set 80 years after the events of Negima. It follows a young boy named Tota Konoe who is the grandson of Negi Springfield, aspires to leave his village and life live in the city of Shin-Tokyo which has a tower structure rising into space. When he gets mortally wounded by a bounty hunter coming after guardian. He soon discovers that he has been made into an immortal vampire by Yukihime, who is actually a 700-year-old vampire mage Evangeline A.K. McDowell. From there Totua picks up another boy named Kuromaru for the journey and they go to a place outside Shin-Tokyo where Yukihime leads a secret society of immortals called UQ Holder. From there Touta embarks on a unique adventure.\\n\\n\r\nUQ Holder is a fun mess. Am not saying the story is bad or anything, in fact, the story is kinda good overall that has a lot of good things in it which I don't want to spoil. However, the problem I have with the story is the show likes to skip quite a lot of chapters from the manga. If you fan of the manga you will not like this show as its skips some important chapters such as the Santa/Sayoko Arc. Another problem that I have with is that its some of the arcs are rushed especially in the tournament arc in episode 10 where the pacing of the show goes way too fast and because of that the tournament arc ended up being really rushed and kinda leaves the viewer feeling unsatisfied. \\n\\n\r\nI will give UQ Holder Anime Adaptation this. The story itself was left unchanged from its manga counterpart which is shocking because the Negima anime didn't even bother adapting the rest of the manga halfway through. \\n\\n\r\nOverall while the story UQ Holder had a lot good things in but ultimately gets crippled by skipping certain important chapters of the manga as well as having rushed pacing and because of that the story of UQ Holder as slightly above average at best.\\n\r\n6/10 \\n\\n\r\nCharacters.\\n\r\nThe characters in UQ Holder were pretty enjoyable but they could have been a lot better and had a bit more character development \\n\\n\r\nFirst, we have Touta. I personally liked his as a character. Yes if you compare to Negi from the Negima series he is quite a typical but he has a lot of charm in terms of his personality. I also really like his character interactions towards other characters like Yukihime, Kuroumaru and even Negi himself. \\n\\n\r\nKuromaru is an interesting character. This character battle style is very similar to another Negima character that we all Negima fans love Setsuna as they both use the Shinmei-Ryu sword technique. One of the things that I liked about this character is the whole Yatagarasu as all the members from the Yatagarasu are genderless before they turn 16 where after that they can choose to be a male or female. Another thing that I liked about Kuromaru is his/her character interactions with the cast and there are usually great because at this point Kuromaru and rest of the characters in this are confused about the Kuromaru's actual gender.\\n\\n\r\nAs for Evangeline or Yukihime. She’s still the loveable and badass character that we all love from the Negima series.\\n\\n\r\nThe rest of the characters are not memorable due to them having lack of screen time.\\n\r\nAs for characters from the Negima series they are the same likable characters that we all love however they could have treated some of the Negima characters a lot better like for example Asuna who a great loyal partner for Negi is now being reduced to a Deus ex Machina type of character. I won’t tell what episode it happens but watching that episode made me quite sad because I really liked Asuna in the manga.\\n\\n\r\nOverall the characters are enjoyable and likable but they could have been a lot better than they actually are.\\n\r\n7/10\\n\\n\r\nVisuals.\\n\r\nCompare to Love Hina and Negima the visuals are a big step up for the most part.\\n\r\nThe character designs were good and faithful to its manga counterpart. The actual animation is smooth and surprisingly consistent. The fights, for the most part, are well animated as well having a lot of tension. As for censorship unlike the Negima anime the show gives a big fuck you to censorship because of the show, for the most part, pull no punches when it comes to the fanservice and blood. Not bad J.C Staff\\n\r\nThe only flaw with the visuals is one sometimes characters go a bit off model and the whole censorship when certain characters is just cringe-worthy but to be honest I rather have than a fucking extreme shot of Asuna panties that has a bear in the middle of the very first episode of Negima Xebec version.\\n\r\nBesides those flaws for the visuals, the show is pretty great visually.\\n\r\n8/10\\n\\n\r\nSound.\\n\\n\r\nThe soundtrack is nothing special, to be honest. Yes, it has some good tracks but the most part it’s pretty forgetful.\\n\r\nThe opening Happy Material is a great opening and I think it’s the best version of the song even surpassing the original Happy Material from the original Negima series which was already great, to begin with.\\n\r\nThe ending theme Steady Go it’s a nice catchy song that fits well with the show.\\n\r\nAs for right now, UQ Holder doesn’t have a dub but I hope it gets one soon.\\n\r\nI love to see Laura Bailey voicing Evangeline again because she did a masterful job at voicing Evangeline.\\n\r\n7/10\\n\\n\r\nFinal Thoughts.\\n\r\nI liked UQ Holder for what it is. Yes, it has its problems such as skipping certain chapters of the manga to a certain character’s being underdeveloped but compare to other Ken Adaptions from the past it does a fairly alright job of adapting the manga as well be a pretty enjoyable show on its own right. \\n\r\nIf you looking for an enjoyable shounen series that I recommend UQ Holder to anyone however if you are a Negima/UQ holder fan such as myself who read the manga then I advise approaching this show with caution.\\n\r\nFinal Score 6.5/10",
            "date": "2017-12-18T09:05:00+00:00",
            "helpful_count": 17,
            "mal_id": 265495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4835791.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TakamakiJoker",
                "username": "TakamakiJoker"
            },
            "url": "https://myanimelist.net/reviews.php?id=265495"
        },
        {
            "content": "Okay... I'm just going to get right into it. If you're wondering whether or not the sequel is worth watching, i'll be blunt. It is and it isn't. Don't worry, no spoilers, However I will explain why. \r\nFirst the reasons to watch it; \r\nA.) The plot follows as it should and sticks to the manga.\r\nB.) The characters don't change so much that you don't recognize them.\r\nC.) The character development is just like the original, but a bit more violent.\r\nD.) You get to further immerse yourself into the story with beautiful animations.\r\nNow the reasons not to watch it;\r\nA.) There is huge time skips that will leaveyou feeling lost, aka 30-100 chapters skipped.\\n\\n\r\nB.) If you're hoping to see a lot of previous characters, you will be a bit disappointed.\\n\\n\r\nC.) Lots of throw-away characters that you'll probably never see again.\\n\\n\r\nD.) At the rate the anime is going, you'll be left wondering what happened, 12 episodes is NOT enough for this much material.\\n\\n\r\nAnd that's a small sum to take into account on why you should or shouldn't watch this anime. The rest i'll leave for you to decide. Enjoy or Don't enjoy, the choice is always yours.",
            "date": "2017-12-10T06:25:00+00:00",
            "helpful_count": 13,
            "mal_id": 264907,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6771516.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Exiaze",
                "username": "Exiaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=264907"
        },
        {
            "content": "Being a fan of Ken Akamatsu's work (Love Hina, Negima series (this included)), I was even more happy to see it getting anime adaptations, but sadly with every passing adaptation, it always fails to make what the manga source material great, and then during the conversion to anime, it balls out at the very last minute, and this is another example here with UQ Holder, cramming 140+ chapters into 12 episodes (which clearly ISN'T enough).\r\nStory:\r\nSet 80 years after the events in Negima!, Touta Konoe (grandson of Negi Springfield) has Yukihime (or the legendary magician Evangeline A.K. McDowell who's a vampire as you wanna call it)as his guardian, and when his life is risked by a bounty hunter, gets to know her true identity and is introduced to the secret society kniown as UQ Holder, a society made up of people with supernatural powers.\\n\\n\r\nBeing a manga reader, somehow J.C.Staff assumed that asking people to watch the anime in itself is more of a travesty, because the Santa arc (which takes up at least 20 chapters of the manga) is COMPLETELY missing, and I have no idea why this anime even got a green light in the 1st place. Sure, Negima fans can even complain that the adaptations done earlier was worse, but thankfully this isn't (at least) the worst yet.\\n\\n\r\nCharacters:\\n\r\nTouta Konoe is your run-of-the-mill shounen, with his strong points being aggressive at what he does. Maybe not the best of the main UQ Holder crew, but his interactions with the others are what makes him stand out amongst the heavy action.\\n\\n\r\nKuromaru is an interesting one, because it states that his/her kind are genderless, and when they pass their 16th birthday they get to choose the gender to their liking (and of course if you watch UQ Holder you know the ship feels). Her battle style is of the Shinmei-ryu sword technique (similar to Setsuna), and like Touta, also creates a fun and distracting (in a good way) interaction with the others as well.\\n\\n\r\nAs for Yukihime, she's the Evangeline Negima fans know and love, just with her alias and establishment of UQ Holder. Nothing more to say on that.\\n\\n\r\nFor the others (the rest of the UQ Holder crew: Karin, Kirie etc.), they are not given enough time to showcase themselves on the big screen (although supplementary), but that doesn't mean they get their moments, and still strikes off really well.\\n\\n\r\nAll in all, the character development is one point where this show truly excels at, and wished it could be better if they stringed out longer than 12 episodes allowed.\\n\\n\r\nArt/Animation:\\n\r\nYes, you're probably thinking why J.C.Staff gimped on some of the visuals. And yes, things are sure to look more modern (and updated from the previous works), and while the art looked cheap, the animation was on-point consistent (well, most of the time) and gets the job done.\\n\\n\r\nTo be honest, I've expected J.C.Staff to input more budget knowing that the manga already had a great story to build up to with the action that's held very well, but knowing that paltry 12 episodes isn't gonna cut the slightest of the manga, I just hoped for the best and it delivers somehow, and it's satisfactory for the most part.\\n\\n\r\nSound:\\n\r\nThe OST is also fairly good as well. Both the OP and ED are energizing to hear (with a happy heart, of course) and can't really fault the BGM here. It's a work well done, but also at the same time, nothing special.\\n\\n\r\nI feel like this anime will STILL divide 2 camps of people's thoughts:\\n\r\n1) Anime only, as in watching the show purely without knowing what's going on, with the 3-episdode rule making the basis for the show.\\n\r\n2) Anime + source material (be it LN, VN, Manga), as in knowing the source material beforehand, and expecting more to come out of the anime adaptation, and comparing both materials to knowing which is better.\\n\\n\r\nAs for myself, I really still feel like UQ Holder, as a manga it's great, but the anime adaptation barely touches the iceberg, and even with the OVAs coming out next year (which bases off the different arcs in the manga), it feels incomplete at its finest. Yes, I do like what I have watched, and give it a fair bit of respect, but really, RIP Ken Akamatsu for another bad unjustified adaptation. Like in the premlinary Episode 4 count, do watch if you're a diehard fan or Negima, otherwise, go and read the manga if you want more of the storyline.",
            "date": "2017-12-18T17:38:00+00:00",
            "helpful_count": 10,
            "mal_id": 265537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=265537"
        },
        {
            "content": "Nostalgia hits us come the Fall of 2017 with another of Ken Akamatsu's work in the form of a spinoff of the Negima series, UQ Holder!. Does it hold up?...or will the high level of nostalgia disappoint us?\r\nFor LA, the Negima series is in a weird place for LA in terms of nostalgia all things considered. One is that the original Studio DEEN adaptation gives LA fond memories of this series but was definitely an adaptation with it's faults and typical harem cliches that hasn't aged well. The SHAFT version was LA's favorite over the years by having a more shounen-esque mystery feel to itbut having the typical SHAFTism that would have put people off. LA DID NOT read the manga but heard time and again from LA's friend that it went into a crazy shounen feel that even the SHAFT version didn't even get into. Thus LA was quite in a predicament when going into this spinoff completely blind.\\n\\n\r\nAnd now we have this anime spinoff with an entirely new cast of characters, with old ones returning and it being a fully fledged out shounen series.\\n\\n\r\nFor a start, LA's first impression of UQ Holder was rather meh, going through the cliches of the shounen field from the hot-blooded main character who's a nice guy but dense as hell character trying to surpass his teacher Yukihime (or Evangeline just using a transformation magic looking like an adult but whatever...) while trying to get out of his hillbilly of a village town he lives in. His goal is to make it to the top of the tower in.....a far off city. Yeah typical stuff, but its not until the halfway mark when all hell breaks loose from plot twists every episode afterwards to nostalgic throwbacks that ACTUALLY factor into this plot, new harem characters enter the picture and it going full shounen on us WITH UNCENSORED BLOOD!!!!!!!.\\n\\n\r\nThe entire character cast is very vast to say the least what with new and old characters coming in. So who are the most important characters in all this?...our main protagonist Touta Konoe voiced by Yuka Takakura, Yukihime/Evangeline voiced by Yuki Matsuoka, Negi Springfield is in this too of course who's reprised by Rina Satou and Fate voiced by Akira Ishida are the forerunners of this anime. Kirie Sakurame voiced by Ai Kayano, Kuroumaru Tokisaki voiced by Yuuki Hirose, Shinobu Yuuki voiced by Sayaka Harada, Mizore Yukihiro voiced by Akari Kito and Karin Isht Orte voiced by Yui Ogura (Favourite character by the way) are all in the harem and they have some sort of screentime and battles over this anime. The only harem members that didn't exactly have enough time are Shinobu for not having ANY battle prowess thus they kinda get shafted and Mizore for just entering the anime too late enough though she's battle ready but isn't as powerful as the core cast already are. As for the nostalgia cameos, it's too be expected the original series cast gets a cameo and some form of presences in the plot also yeah Mizore YUKIHIRO reminds you of someone?...yeah Ayaka Yukihiro voiced by Junko Minagawa gets an episode as well if only because of Mizore...a moving of the torch as you could say. LA's favourite cameo would probably be Asuna...because it was ASUNA like come on.\\n\\n\r\nLA thinks one of the only problems besides that LA hadn't read the source material as well as the original source material was that the pacing is very quick, yeah not \"all over the place\", UQ Holder! has a pacing it's just very quick trying to cram in enough exposition, characters and action scenes in one episode as much as possible and yes this impacts the finale but again...this anime is trying to cram in an ongoing manga source material into 12 episodes.....this was GONNA HAPPEN.\\n\\n\r\nIn terms of animation by JC Staff, the animation is pretty consistent, from the amazingly brutal battles to the updated and newer characters and ecchiness typical of the Negima series. All LA will say about the animation is that LA really liked the animation all round and it didn't flake on shortcutting at times and didn't annoy LA in many ways. All round the animation especially the supernatural shounen battles were the highlights in terms of animation.\\n\\n\r\nThe voice acting on the other hand was pretty great all round. From Yuka Takakura crossdressing voices living up to the tradition that Rina Satou did in the original and doing a great job at it, to Yuuki Hirose voicing eerily similar to Nana Mizuki in her typical badass role and yeah a Yui Ogura performance LA can get behind who's voicing a kuudere badass. As for the nostalgia cameos, well it's to be expected that the majority of the voice cast reprises their roles...well cept the ones that...uhhhh can't because reasons. Just reasons. Either way, LA really loved this voice cast, from new and old and even some very well done newbies. Ohh LA forgot but LA thought that Sayaka Harada as Shinobu was voiced by Ayana Takatatsu all this time before LA found out it was Sayaka...MAN Sayaka has range!.\\n\\n\r\nSo right back to the question LA put at the start of this review. Does this spinoff anime hold up by itself?...well LA thinks this question needs to be rephrased. Does this spinoff HELPS to it's original source material while being it's own thing. Well to that LA says yes. This spinoff helped to be like it's original source material as well as growing it's world building as well as TRY to bring in new characters to be important to the plot to which LA feels that Ken Akamatsu obviously planned with this spinoff to how intrinsically linked Touta and Evangeline is to Negi Springfield.\\n\\n\r\nSure this spinoff has problems like the aforementioned pacing issues this anime has but even then LA could defend it by it being an ongoing manga so it was to be expected as well as the problem of a core cast of new characters with powerful battle prowess taking themselves to the forefront with the lesser battle prowess characters being left in the dust and the nostalgic cameos though they are important to the plot, but only by a few scenes unfortunately and of course being an audience member who didn't read the original source material as well as THIS source material and going completely blind had it's own problems, but even with all this, LA did like this spinoff for being it's own thing while paying homage to the original series AND being completely shounen helped as well.\\n\\n\r\nNostalgia is something we want to have to go back to those good old times, but even then we can't have it back 100% as a full experience in the form of a new spinoff, prequel, sequel or whatnot. But having a spinoff learned from it's mistakes from it's MANY adaptations it had is a good step up but that same spinoff bringing in it's own mistakes is for LA...a given.\\n\\n\r\nUQ Holder!: Mahou Sensei Negima! 2 is a decent to great spinoff even with it's strengths and weaknesses. What else can LA say?..Ohh wait how about...\\n\\n\r\n\"Kimi ni todoketai HAPPY READY GO!\"",
            "date": "2017-12-18T14:31:00+00:00",
            "helpful_count": 9,
            "mal_id": 265518,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=265518"
        },
        {
            "content": "For real, this adaptation is poor.\r\nUQ Holder! (anime verison) forgot story arc, character, background.\r\nIt's a manga condensate with censor and scene with no sense wasn't part of the manga.\r\nI really don't know why they destroy the original work with random adaptation.\r\nIt's a bad advertising for the manga who is really better.\r\nthe oppening is medium and forgettable.\r\nRip Santa, a touta teamate character delete in this adaptation. he have a good story and is important for her.\r\nRip touta training period with Dana.\r\nRip the touta and kirie sharing spell who is a important spell in the story and in the last fight versus negi's team\r\nAND WE CAN CARRYON LIKE THAT 1 HOUR I THINK",
            "date": "2017-12-19T10:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 265599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5655845.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sneakylelouch",
                "username": "Sneakylelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=265599"
        },
        {
            "content": "The adaption from the manga to anime was terrible! They skipped out on parts that WILL come later in the anime if it is continued. But they should have followed the same order as the manga so that the viewers would have understood more and felt more towards the characters and story. They also just completely got rid of a character that may or may not come later, but they were still an important part of the whole story! To anyone who wants a good story you should read the manga and forget all about this anime!\r\nIt you had not read the manga and justwatched the anime it would have been a lot better! But even as an anime they skipped a lot of character development and backstory that would have made the anime a lot better. They rushed the story and everything else way too much. If they continue the anime i guarantee that it will still be lackluster. But if they decided to continue it they really have to slow down the speed of story and give better character and background development if they want it to feel meaningful.\\n\\n\r\nSorry if my thoughts are allover the place and such, i don't write reviews ever and i just suck at writing. Overall this anime is complete trash compared to the manga!",
            "date": "2017-12-22T14:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 266025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4527838.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Arukoruotaku",
                "username": "Arukoruotaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=266025"
        },
        {
            "content": "When UQ Holder! anime is announced and the OVA is released, I actually feel have some hope that this anime will be good and followed it's source material. However, when the anime is start aired until the end, it's nothing but highly disappointed me so much even more than the first two Negima anime series does.\r\nStory: 3/10\r\nAt the beginning of the story, same as the manga does but with some mirror changes. It's started at a boy named Konoe Touta who live in a village along with Yukihime, along with his friends always challenge Yukihime in order able to leave the village and make theirdreams comes true. They are always having fun and thinking how to defeat Yukihime all the time, until a male teacher come to teaching Touta's friends the magic spells and tells Touta to give a ring to Yukihime, the ring are used to forbidden the ring wielder to use any magic spells. In the second day, Touta's friends attack Yukihime with using magic, a few minutes later that teacher attacked Touta's friends and tried to kill Yukihime. Yukihime's true name is revealed to be Evangeline A.K McDowell, who is a Vampire from the prequel series Negima!, the ame teacher is also revealed to be a Immortal Hunter and want to kill Yukihime for granting a lot of moneys. When Touta seen Yukihime and his friends in danger, he tried to stop that Immortal Hunter but Touta is killed by him, and later Touta is revived as a Vampire by drinking Yukihime's bloods and successful defeated the Immortal Hunter. To avoid an another Immortal Hunter to attack again, Touta and Yukihime is forced to leave the village, Touta is thinking of he can finally go to the tower, to following a mysterious man's request. As such, Touta and Yukihime has started their journey.\\n\\n\r\nThe story is still followed the manga faithfully until EP3 where the story plots almost gotten changed and it's so much different than the manga does, and the scriptwriter keep changing the story plots thought EP12. The Anime skipped a lot of stuffs that's actually important in the manga, and rushed the whole story plots which caused a lot of confusing when they showed/mentioned somethings that the anime didn't even shows up or being mentioned.\\n\\n\r\nArt & Animation: 4/10\\n\r\nI don't know but the art in this anime are look odd and it seem like J.C Staff tried to followed the Negima OVAs' art but they failed to do so. Sometimes the art (Especially animation) are so bad and it's laughable sometimes, it's seem like J.C Staff either don't have enough budgets to make the animations decent or they didn't even put their effort to did the arts.\\n\\n\r\nSound: 7/10\\n\r\nIt's good to see Haneoka Kei returned to did the music for Negima/UQH franchise again, thought his music isn't that memorable than his music in Negima!? and the Negima OVAs does, but I still somewhat enjoy the music a bit. As for the characters voices, I like them and it's actually fit the characters' personality. Except of Touta, who is like a typical hot-blooded main male protagonist of Shounen action manga are voiced by a Female voice actor. In my opinion, Touta being voiced by a Female VA is feel so out of place and unfitting due to his hot blood personality and he didn't have any childish personality like Son Goku from Dragon Ball series, Luffy from One Piece series and Naruto from Naruto series does. Thought as the anime progress, Touta's voice isn't so annoyed and I start get to used his voice a bit, but my opinion on Touta's voice still haven't change in the end.\\n\\n\r\nCharacter: 2/10\\n\r\nThere's a lot of good characters in this series, but due to the anime being skipped and rushed too many plots we didn't seen the characters get developed thought the end of the anime. Even so, we still did see how other character like Kuromaru (The female look a-like \"boy\") and Shinobu (The maid girl) get a bit character as the anime progress, but mostly on their feeling toward Touta.\\n\\n\r\nEnjoyment: 3/10\\n\r\nIf you never read the manga before you may enjoy this. But for me who is the manga reader, I can't enjoy the anime so much due to the rushed plots and a lot of plots changes here. Sometimes the plots changes is so ridiculous that I can't even holding my anger to watching this.\\n\\n\r\nOverall: 2/10\\n\r\nThe only reason why I give 2/10 instead of 1/10 are because the first two episodes are accurate to the original manga and there's a few moments in this anime that I actually enjoyed. Overall I don't recommend anyone to watch this but recommend to read the manga instead, but of course you can choose to watch this anime if you want and this review didn't bother you that much.",
            "date": "2017-12-19T03:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 265569,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545588.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MahiaErebeaNegi",
                "username": "MahiaErebeaNegi"
            },
            "url": "https://myanimelist.net/reviews.php?id=265569"
        },
        {
            "content": "UQ Holder! is definitely an anime with so much potential especially since the manga is very good in my honest opinion as was its prequel Mahou Sensei Negima (the manga, not the anime because that was just bad) but unfortunately it suffered so much from being rushed, left out arcs, and a big focus on the RomCom elements which would have been much more cohesive if they took their time on adapting the source material. It should also be noted that there are many things that require knowledge about the previous work, Negima, which I recommend for you guys to read the manga as theanime never really went far especially with the Magical World arc.\\n\\n\r\nThe story starts out with our main protagonist, Touta Konoe and his friends attacking their teacher and Touta’s guardian, Yukihime (Evangeline A.K. McDowell). Their dream is to get out of the village and go to capital and reach the top of the space elevator. However Yukihime is a mage and isn’t so easily defeated. A crisis that develops leads to Touta finding out about his curse of immortality that was given to him by Yukihime and eventually he and Yukihime leaves the village and make their way to the capital where he can make new friends.\\n\\n\r\nOn their way there, Touta meets an immortal immortal hunter, Kuroumaru, who later becomes his best friend. While the three of them travel they eventually come into contact with Yukihime’s organization UQ Holder. UQ Holder is an organization of immortals that help the world much like a guild and they also operate an inn. This is the how Touta Konoe’s everyday life begins, one filled with romantic comedy as the staff and even guests eventually develops feelings for him, even his best bro. But not everything is sunshines and rainbows as Touta’s past is trying to capture him and he must uncover the truth as well as his connection to his grandfather who is the greatest mage, Negi Springfield.\\n\\n\r\nThe problem here is that J.C.Staff is trying to cram so much material (over 100 chapters worth) into just 12 episodes. So much doesn’t make sense that I kept asking myself stuff like “why this character is showing up so early” or “wasn’t there an arc or 2 before this scene happens?”, the result being that it is an obvious mess and destroys something that could’ve been nothing less than epic. If the studio had been given a chance to do a 2-cour (24 or 25 episodes) of this adaptation then it would’ve been undoubtedly much better than what has been presented to us. It also doesn’t help that they completely erased one arc that introduced us to a really strong character and another male in this Touta-centric anime, they also omitted the training arc where pretty much all the kids get ridiculously strong because they were taught by none other than Evangeline’s master. The training arc was somewhat shown in the OVA but it focused more on Eva and Touta’s relationship which was really sweet but the climax was omitted to my dismay. Also for those who haven’t read the manga you guys should watch the OVA after the anime because of the last line in the anime for it to make more sense.\\n\\n\r\nThe art was decent enough and the action scenes were quite fluid but they lacked the punch that could be found in the manga. It also doesn’t help that some of the more intense fights were cut out due to time constraints. I was also incredibly pissed they never once showed Yukihime using her Magia Erebia form to fight which makes one of the best fights in the whole series when she used it against Fate. Being a romcom anime as well there are many fanservice scenes but I question the censorship using Kamo, while it was cute and unique first time watchers will wonder who the creature is.\\n\\n\r\nI can’t really say much about the soundtrack but the battle music was quite good and manages to sound right when the mood gets heavy or dramatic but it wasn’t exactly memorable in my opinion. The voices were alright but Touta’s was annoying or didn’t sound right at first but I eventually got used to it. The opening and ending had some fanservice and it was too cheery in my opinion, they could’ve just went for some Fairy Tail like songs and it would’ve been much better although that’s just my opinion.\\n\\n\r\nIn the end UQ Holder! had so much going for it but definitely is only subpar at best. A truly epic series despite all the fanservice and slapstick comedy was again afflicted by Ken Akamatsu’s (the creator) curse of having bad adaptations of his works. But despite all the negatives, the few positives helped alleviate my impression of the series. It was so nostalgic to see Negi and the class of 3-A all over again especially Asuna. It reminded me so much of the Negima manga that it makes me want to read it all over again. Also Kuroumaru’s case of his/her feelings for Touta retains the same amount of hilarity as it did in the manga.  I also had fun watching Evangeline but that could just be my bias as she is my favorite character in the Negima universe. In a way it is also unique to see a romcom for immortals.\\n\\n\r\nIf you want to get the full experience of UQ Holder! then I wholeheartedly recommend that you read the Negima manga if you haven’t yet as its 2 major arcs are some of the best if not the best I have ever seen in any medium, then after that you can read the UQ Holder! manga which I will do so soon because the anime just doesn’t do it the justice and exposure it deserves.\\n\\n\r\nP.S. You can also read my review here and some video game reviews if you're interested:\\n\r\nsirusgaming.com/2018/01/anime-review-uq-holder/",
            "date": "2018-01-09T09:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 268035,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3670637.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Jetezark",
                "username": "Jetezark"
            },
            "url": "https://myanimelist.net/reviews.php?id=268035"
        },
        {
            "content": "Seems like I am beating a dead horse when it comes to the story. But most of the reviews are bashing the incompleteness of it and I'll just add onto it. There were times where I would just say \"Wait, what is going on?\" And there would be little to no explanation. (Like at the end of the final episode)\r\nThey made up for it by having cute moments and *ahem* sexy moments, but not monumental moments which could sway the story into something better.\r\nThe animation was great, and the characters were really enjoyable. I actually liked Tota which is weird because I usually hate poweredMC characters.\\n\\n\r\nIf you liked Negima and want some Nostalgia I would recommend UQ holder. Other then that it's really not worth wasting your time on.",
            "date": "2017-12-19T19:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 265671,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=265671"
        },
        {
            "content": "Short version: Do you like awesome, beautiful fight scenes?  Are you willing to sit through what this show thinks is a \"story\" and a \"harem\" to get to them? Then you should watch this. People who like serious stories alongside action have much better options.\r\nLong version:\r\nI didn't have many expectations for this anime, going in. I knew there would be story elements and references to the first Negima! series that would go over my head, since I have not seen it, nor have I read the original manga. However the title's branding as \"UQ Holder\", as well as the strength of the first episode,drew me in. So that's my perspective- if you're an OG Negima fan you may want to read someone else's review.\\n\\n\r\nLet's start with the sound design. This, I feel, epitomizes the show. The SFX do their job, with only some of the more powerful spells used later in the show sticking out to me as memorable. The music too, chugs along with the show, dutifully getting intense during fights, hopeful when the characters reach some important revelation, yada yada yada. It's... just good enough. It manages to step over the bar, but it's nothing to praise either. \\n\\n\r\nThe art is amazing though. This anime is simply gorgeous to look at, and it doesn't feel like there are many cheap tricks to avoid animating things, either. There is an action scene every episode, and although it isn't always a fight, it keeps the early episodes from feeling like exposition dumps. However, the story itself is a major let down.\\n\\n\r\nIt was so disappointing to watch a somewhat unique story trainwreck into a convoluted, rushed mess. Frankly, the UQ Holder (think Immortal Magic Justice League) part of the plot is swept under the rug so quickly, it seems to exist solely to justify the graphic torture we watch the characters undergo. Having a plot that includes \"all of the main characters are immortal\" is a great way to play the balancing game of \"Serious Philosophical Ideas\" and \"Dumb Anime Bullshit,\" because it takes the tension off, so it's more believable when characters are joking around in one scene, and fighting seriously in the next. But no, it starts sloping down when the show just tosses \"deep\" questions out (such as, \"Is it worth it for an immortal person to make friends with a mortal, knowing that they will one day die and be left alone?\") and just straight up forget about them. \\n\\n\r\nIt then takes a complete nosedive when the main plot inevitably becomes \"main character is going to be absorbed by the bad guy! Oh no!\", which not only makes the story feel generic, it turns that unique plot point and just makes it an excuse for what is basically torture porn. The characters all suffer big time, and I found it unsettling, even having just watched Texhnolyze before watching this show. Again, this could've been an outlet for philosophical expression, but it just feels distasteful, even if I didn't like the characters, either.\\n\\n\r\nThe characters are another low point. There are seriously about 300 characters who give their full names out, and about ten of them show up more than once.  Of those, four of them are on harem duty, fulfilling their cookie cutter tropes and little else. The rest are barely developed, having one cool fight scene apiece, and otherwise they rotate out for expositional dialogue. \\n\\n\r\nBut I still found it in me to finish this anime, and you will too, enjoying yourself somewhat if you are a ACTION/FIGHT SCENE JUNKIE. I kept watching because the fights are among the best I have ever seen in an anime, and I could just switch my brain off during the rest.It's pretty brain dead anyway.\\n\\n\r\nIndividual scores:\\n\r\nStory: 0/2\\n\r\nArt: 2/2\\n\r\nSound: 1/2\\n\r\nCharacters: 0/2\\n\r\nEnjoyment (FIGHT SCENE JUNKIES): 2/2\\n\r\nOverall score: 5/10",
            "date": "2017-12-19T13:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 265623,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5263721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/B-MAP-000",
                "username": "B-MAP-000"
            },
            "url": "https://myanimelist.net/reviews.php?id=265623"
        },
        {
            "content": "For those of you who went in watching UQ blindly, it is about as decent as other medicore animes from past years. I wouldn't really recommend it though as it is a rushed adapation, but like I said it's not the best and if you think it's worthy of your time then go for it.\r\nNow for the fans of the Negima! series. It was a horrible journey am I right? I admit there were good nostalgic scenes that made me happy (seeing class 3-A again with all their pactio transformations, oh especially Natsumi with her artifact!), but overall... no words can describe my feelings forthis adapation I over-hyped about. But if you are reading this review, I congratulate you and thank you for your service. We should all atleast give a small appreciation for this adapatation for happening, even though we have very high negativity for a poor adapatation. \\n\\n\r\nBut hey, if you all think about it, this could just be one of the many different worlds that could have taken place. No? Yeah I know, it's just me being optimistic as possible.",
            "date": "2017-12-18T21:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 265557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847142.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LeWind_God",
                "username": "LeWind_God"
            },
            "url": "https://myanimelist.net/reviews.php?id=265557"
        },
        {
            "content": "Watching UQ Holder is like riding Space Mountain: Mission 2 at Disneyland Paris. It has a strong start and continues to go faster and faster to the point of breakneck speed. And before I knew it, it was already over. Despite its rough bumps and out of control spins, I couldn’t say I didn’t have some fun. That’s the best analogy concerning the anime adaption.\r\nAs an aficionado of the creator’s previous works (Negima and Love Hina) and a regular reader of UQ Holder, I’ve been anticipating this anime since it was first announced. Taken on its own, the anime offers a standard shounen platform. Anice and short introduction to Evangeline A.K. McDowell a.k.a. Yukihime provides enough information to get into the story’s world and does a good job showing immortality may not be all it’s cracked up to be. The story is what drew me into the series given how much I love shows with elements of magic and most things relating to vampires. \\n\\n\r\nUQ Holder isn’t just a title for the show, it’s the name of an organization for immortals and non-humans to gather, socialize and aid one another. The idea of a world full of immortals is an engrossing one because the characters will have to think of creative ways in order to best the other. The plot initially moves briskly to keep things interesting and as episodes go on, it goes faster. In fact, too fast. This is because the anime blazes through the source material and even skips some of it or around it. Various elements are changed to fit with the anime. This isn’t inherently a bad thing and it’s surprising the anime is still able to remain somewhat coherent despite the edits. On one hand it’s never slow, but the premises and arcs aren’t as strong because character development from the manga is missing. Which made me wonder why was this only 12 episodes.\\n\\n\r\nIf there’s one element of the story I wish had more screen time it’s the relationship between Yukihime and Touta. It’s important to the entire plot and what happens in the last arc of the anime. So it makes no sense to have followed that arc extensively whilst having skipped over a lot of what came before it. The emotional bond between them seems more absurd here whereas in the manga, it’s obvious they both deeply care about each other and there’s a lot of reasons why which the anime does not get into. It makes it hard to judge the anime for what it is rather than what it could and should be.\\n\\n\\n\r\nCharacter-wise, UQ Holder does have a variety of personalities present. Considering the number of characters that can be found here, some of them are going to be more entertaining of course. Touta is the main character to the story and he’s usually happy, boisterous, sociable, kind-hearted, trusting, skilled, and strong while possessing an endless sense of optimism. He actually reminds me a lot of myself when I was in high school (wait a sec, I’m still all of those things!). For a story that has bleakness and sadness lingering in the background, it’s fun to have an upbeat hero who has laudable ideals like Touta. Even though Touta is likable, Evangeline A.K. McDowell/Yukihime is more intriguing, but this is entirely fueled by knowing who she really was already. She’s without a doubt one of the sexiest anime women my eyes ever caught sight of. Seriously, her thighs are out of this world. Besides oozing sex appeal she is a vampire, the legal guardian of Touta, one of the strongest and most feared mages in the world, the catalyst for the plot and the leader of a group of immortals.\\n\\n\r\nOther characters populating the world of UQ Holder include: Kuromaru, Karin, Kirie and Ikku. Kuromaru is the androgynous, reserved deuteragonist who serves as Touta’s best friend and right hand man. Karin is the stoic, big-breasted, bad ass fighter who for some reason harbors an admiration for Yukihime, a dislike for Kouta and runs like Sonic in the first Sonic Adventure game. Karin is smug, arrogant, snarky and has the coolest power. Ikku is… Ikku. There is one character who doesn’t make an appearance and as far as I’m concerned, that’s unforgivable since he’s one well-written character I was highly and emotionally invested in. There was a number of things wrong with UQ Holder, but his absence was the one that sucked the most. Boooooo! Hiss! Hiss! \\n\\n\r\nRegarding the aesthetics, this was initially a clean-looking, but not a drop-dead gorgeous production. The characters are expressive, but the backgrounds feel a bit flat, and the color work isn't all that inspired. The show’s animation is at its best during the fan service filled OP, chibi ED and big fight scenes, but overall it became more uninteresting to me as it progressed. I’m not sure if this is because I like the manga’s sharp lines and art more, but the visual quality does slip especially in the later episodes which to put it bluntly, stinks. \\n\\n\r\nA question I’ve been catching myself asking more and more recently is: when will the CGI fad in anime die? UQ Holder may not be the prettiest production, but seriously, those CGI giant lizard monsters looked incongruous with the cast and backgrounds which made them very distracting. They looked more like they belong in an awful and cheap version of ReBoot. Another irritating facet in the animation department was the censorship, especially in one of Karin’s fight scenes. For the record, I have no interest in any of the other women so I don’t care about seeing her naked. However, having the image of Chamo as censorship blocks just killed everything since it took my focus off the fight. I have an idea what’s going on here. Even though UQ Holder is a late night anime, the edits are used as a way so viewers have to buy the highly priced DVD/BD if they want to see it uncensored. I get it, anime studios have to make money, but I don’t think there was any reason to use that type of censorship. \\n\\n\r\nBesides the OP (which happens to be an updated version of  “Happy☆Material”)  and ED songs, there wasn’t anything notable in the music. The voice acting is pretty good and most of the characters sounded how I imagined they would other than Touta who sounds younger than I thought, but then again he’s 14 years old.\\n\\n\r\nAs much as I don’t want to admit it, it’s hard being an Akamatsu-sensei fan. His previous brainchildren never got the accurate anime adaptions they rightfully deserved, and with UQ Holder, the struggle continues. At the end of the day, I wouldn’t say this was a terrible and unwatchable mess, but it sure was a disappointing adaptation. There really is a good story, full of interesting and distinct characters and all it needed was for it to be handled competently so the end product would’ve been excellent. Being a manga reader, I will also say I enjoyed this more than I should have. Well, if nothing else, Yukihime has a wonderful ass.",
            "date": "2017-12-18T17:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 265538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6727350.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Starchaser",
                "username": "Starchaser"
            },
            "url": "https://myanimelist.net/reviews.php?id=265538"
        },
        {
            "content": "Having never seen or read any of the Negima stuff, I didn't realize until partway in that this was a show set in the future of another show.  That said, you don't really need to have seen negima to feel the connection the returning characters have with each other.\r\nWhat jumped out at me most was the first episode of this series. If the rest of the season had been like episode one, this would have been an all time favorite for me.  I think the story notches down a bit after episode 1, but I still found it very enjoyable.  Some ofthe reviews from manga readers point to the cramming of a bunch of chapters into one corre season, and I can kind of see that.\\n\\n\r\nIf they could have made a season based solely on Touta's connection to Evangeline, it would be an all time favorite for me.\\n\\n\r\nNow, I guess I should go watch Negima.",
            "date": "2019-02-12T17:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 301522,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7206649.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animeFreakFred",
                "username": "animeFreakFred"
            },
            "url": "https://myanimelist.net/reviews.php?id=301522"
        },
        {
            "content": "I do not know why this anime has a 7+ rating considering the main character won't react in any rational way. I forget which episode it was but when he is allow to ask \"one question\" he learns some stuff of his past but he is at no point upset, and when that one character broke the thing on his back and getting rid of the hologram, he acts so calm when he should have been angry cause he was going to learn something of his past that people were hiding. The main reason I hate the anime was cause I put some time asideto watch this only to feel that it was a complete waste when I watched this scene. It would not be so bad if it was just boring and I wanted to see something, but when they play such a BS scene I feel betrayed. I normally do not get this mad at anime but I decided that I needed to make a account on this website to alert people that this series is trash and ruines itself.",
            "date": "2018-12-15T20:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 295858,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rank_or_Spank",
                "username": "Rank_or_Spank"
            },
            "url": "https://myanimelist.net/reviews.php?id=295858"
        },
        {
            "content": "(Spoiler-Free)\r\nAs much as I love the manga UQ Holder, the adaptation is, well...\r\nsame cases as old Negima anime. \r\nThe old negima had completely change the whole plot/story thanks to Xebec but I still can forgive since its from old early 20's. Supposely its going to be better adaptation, but Nope. JCStaff just throw everything away and make a same thing, except we going way too fast as fak until making this show as the most uninteresting shounen anime ever made.\r\nUninteresting story, plot holes, unnecessary huge fan-service and disappointment ahead.\r\nOf course manga peasent be like, na don`t watch anime, go for manga! Manga!\r\nYeah. One thing Iwanted to enjoy is the beginning to the end of the anime adaptation. No. 12-Episodes crammed then hah. Enjoy your show.\\n\\n\r\nBut truth is, I still like the art (even though some are a bit... clunky), the nostalgic Opening (even though kinda lazy but its good.), and the world settings, interesting concept. But oh well.\\n\\n\r\n5/10. Its nice to see a good old Evangeline in the show.",
            "date": "2018-11-22T05:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 294525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960885.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/murut87",
                "username": "murut87"
            },
            "url": "https://myanimelist.net/reviews.php?id=294525"
        },
        {
            "content": "For me it was a good anime, I could have a sequel because I think I had the potential for it.\r\nAlthough this harem was a bit annoying and I think it spoiled anime, but I really liked the part of him wanting to marry eva and not be like most of the harem anime that the protagonist does not choose anyone........................................................................................................................................................................................................................................................................................For me it was a good anime, I could have a sequel because I think I had the potential for it.\r\nAlthough this harem was a bit annoying and I think it spoiled anime, but I really liked the part of him wanting to marry evaand not be like most of the harem anime that the protagonist does not choose anyone",
            "date": "2018-09-23T17:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 289834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7303894.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/1styx",
                "username": "1styx"
            },
            "url": "https://myanimelist.net/reviews.php?id=289834"
        },
        {
            "content": "I wish this series turned out better, I have seen so many cliche harems they are legit pissing me off. This show started out strong but once they start adding females and the main character stays dense as he started then I lose interest. I was actually happy when he confessed but they played it off like any other show. I feel like this show and Index misadvertise being action shows when really their ecchi fan service harems. No development nor closure either, tsk tsk. also if I see another set of tsundere or emotionally unstable women I WILL SURELY DIE. ALSO TITS, SO MANYFUCKING TITS",
            "date": "2018-03-14T20:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 273846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4758505.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/OuroborosXiii",
                "username": "OuroborosXiii"
            },
            "url": "https://myanimelist.net/reviews.php?id=273846"
        },
        {
            "content": "This got me hyped up when I saw it coming, but at the same time I feared that it would die off just like past adaptaions. And it came true.\r\nOverall:\r\nStory: Actually followed the manga for more than half a season so I'll give them credit for that. Of course it's understandable that pacing becomes an issue with all adaptations, but studios need to realize, following the real plot properly and ending off with a cliffhanger is much better than twisting stories to suit your production timeline and ending with a cheesy plot that just screams dues ex machina at the end.\r\nVoice acting was good ina sense that it just hits you with nostalgia. Some casts though, really need to improve on their acting. That and the script flow between each character isn't very smooth, I'm not sure if they managed to get all the voice actors to voice scenes together or they recorded them individually depending on schedule. But to me it doesn't feel like all the characters were present when they recorded. Conversations are a bit disjointed.\\n\\n\r\nAnimation-wise, it's barely passable for a series with so much battles. J.C. Staff has obviously not put in as much money as they did for Index series. Ultra low frame-rates, simplistic drawings for attacks. If it was a doujin circle I'd give it an A+, but for an established studio, this is a D- in my book.\\n\\n\r\nRIP Ken Akamatsu. Seems like you're never going to get any decent adaptations ever. Now the only hope of redeeming the Negima series is to pass it over to Ufotable with a blank cheque. J.C. Staff better have an epic Index installment considering they cut corners with all their side projects.\\n",
            "date": "2017-12-14T23:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 265244,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KuriYokan",
                "username": "KuriYokan"
            },
            "url": "https://myanimelist.net/reviews.php?id=265244"
        }
    ]
]