[
    [
        {
            "content": "[THIS REVIEW CONTAINS SPOILERS]\r\n–––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\r\n[A Confusing and Frustrating Mess]\r\nIf I had to describe Dies Irae, it’s this: confusing and frustrating.  Almost every episode left me saying, “what the fuck is going on” or “what is happening”.  But, in most cases, I just sit there looking confused and dazed as I try to piece together the events that happened this episode with the previous ones.  After awhile, I sort of understand what is happening, but not without a few lingering questions.  Questions that I hoped would be answered in the next episode, except they weren’t, leaving me even more confused and frustrated.\r\nIt seemsas though the creators or producers were expecting the viewers to have played the visual novel and use that as a guide for this series.  Considering that this anime was created through fundraising raised by fans of the visual novel, it’s no wonder.  As someone who has never played the visual novel, I can only say that this show feels rushed, contains many unexplained and poorly connected plot points, and unlikable characters.\\n\\n\r\nSTORY:\\n\\n\r\nDies Irae is a mess.  Since, the beginning of Episode 0, this anime has been a disaster.  The two episodes begins as a sort of harem opening, where many female characters are introduced (i.e. Kasumi, Rea, Kei Sakurai, Rusalka Schwägerin, and later Marie).  Later in Episode 2, it jumps to a random action dream sequence, where the ’Nazis’ test Ren if he’s worth or not and ask to see his powers.  Like what?  A rushed conversation with Rusalka is held on the roof of the school, which barely explains anything, and Kasumi's reveal lacked impact and felt rushed.  Again what?  Then comes along Episode 4, where almost everything is explained.  Basically, the show is too rushed, and too uneven.\\n\\n\r\nIt took four episodes, not including Episode 0, to explain the motives of the ‘Nazis’, the backstory for this show, and Ren’s purpose; all told in the form of Kei's exposition.  If that is not bad writing, I don’t what is.  \\n\\n\r\nIf I had to summarize this show, it’s this: this show is following the Marie Route; Ren is supposed to be powered up by the Nazis so that he can act as a strong opponent for Reinhard Heydrich.\\n\\n\r\nThere are many plot-lines and concepts thrown around without any sense of connection, and too many unanswered questions, such as how is Ren being a clone important, why is Valeria Trifa trying to find the lost bloodline and why are they important, who is the girl locked with the skulls and skeletons, who the person that was with Riza during the flashback sequence, which of the twin did Riza pick to survive and which to kill, and when Bey was beginning to die who was the silver girl shown on screen, etc.\\n\\n\r\nBesides the awful writing, terrible pacing and the many unanswered questions, there are many additional problems with this anime, such as the lack of tension and direction of the show, boring but necessary expositions in Episode 4 and 7, no hints or foreshadowing of future events (i.e. kasumi being possessed), and finally lack of relatable characters.  But, at least the action was good, so there’s that.\\n\\n\r\nThis should have been a longer show, too many ideas and concepts were condensed into 11 episodes.  And worst of all, it has an inconclusive TV ending with the introduction of an evil Nazi eye-patched character, therefore you must see the ONA (12-17) to understand the rest of the story.  That is just stupid.\\n\\n\r\nCHARACTERS:\\n\\n\r\nTo be honest, I found the characters to be unlikable and unremarkable, even though some of them have proper character development and motives for their goals/wishes.  I mean, obviously, the main character will get some character development, along with their backstory and motives explained.  But, other characters that have proper development include: Kei Sakurai, and Marie.  Everyone else falls into a secondary role, acting as a “challenger” to the main character, as a supportive character, or act as completely irrelevant.\\n\\n\r\nMain Characters in the Show: \\n\\n\r\nRen Fujii is the main character, who hates blades in general as said in Episode 1, however as series progresses he himself gets a arm blade and is completely fine with it.  No traumatic flashback, and no disgust, I found that strange, but whatever.  To be honest, he has a really dull personality, and is only important because all the ‘Nazis’ want him to be strong and a badass, so that he can fight Reinhard Heydrich properly.  A sudden revelation in Episode 7 reveals that Ren was a clone created by Kasumi's father as “the bastard child of Karl Krafft,” and originally called Zarathustra.  But, how is this relevant to the story, the anime fails to explain this.\\n\\n\r\nMarie is a girl, who first appears at a sword exhibition and then in Ren’s dreams.  Her origin story is explained in Episode 5, where it’s revealed that she is the soul within the guillotine and Ren forms a contract with her, thus enabling Ren to use the guillotine blade.  Further on, there are many cheesy and cute moments, such as wanting to be the ‘fifth member’ of their group of friends in school, going clothe shopping with Ren and Kasumi, protecting Ren in Episode 10 when he unconscious, etc.  And while, I though it was lame, it does show that Marie cares deeply about Ren and his friends.\\n\\n\r\nKei Sakurai is the youngest member of the Obsidian Round Table after Beatrice Kirchisen passed away eleven years ago.  She acts as a teacher for Ren, offering advice on how to use his powers and improve his levels beyond activity and formation levels.  Her wish is revealed in Episode 9 and 10, where it states that she killed thousands of people just to resurrect some family members and to put an end to the curse that plagues her family.  I found her intentions terrible and unjust, but again whatever.  Her transformation sequence is also terrible and disappointing as all she gains is flames around her.\\n\\n\r\n“Challengers” in the Show: \\n\\n\r\nThere are quite a few characters in this section, but I will only talk about two of them.  The remaining characters, such as Riza, Eleonore Von Wittenburg, Rote Spinne, and even Rusalka Schwägerin, despite providing crucial information in Episode 3, performing the massacre in Episode 8, and appearing in other moments, did not have much character development or background stories.  This is especially true for Eleonore Von Wittenburg, who only fights Ren in Episode 10, and Rote Spinne, who fights and is killed by Ren in Episode 4.  Riza has a special backstory told in Episode 9, however its connection to the overall story is very ambiguous.\\n\\n\r\nReinhard Heydrich (“Lord Heydrich”) is the main villain of the show, who makes an official introduction in Episode 6, where he appears from the Heavens and kicks the shit out of Ren.  He is the leader of Longinus Dreizehn Orden and Obsidian Round Table, although it doesn’t matter as each organization is slowly decreasing in membership.  Then, in Episode 7, we learn about his true wish, in which he wants to escape the perpetual sense of déjà vu that he's trapped in.  To be honest, I found his wish, stupid and laughable.\\n\\n\r\nValeria Trifa, in the beginning appeared as a clueless, perverted priest, however as the series progresses we see that his true intention are elsewhere.  The anime heavily suggests that he’s helping Ren, and Lord Heydrich and his associates, basically he plays for both sides.  Furthermore, it seems like he’s trying to find the lost bloodline associated with the Round Table, however its connection to the show is also very ambiguous.\\n\\n\r\nSupportive Characters in the Show: \\n\\n\r\nShirou Yusa is Ren's childhood best friend, who is a thrill seeker and the person who mysteriously disappeared in Episode 1.  However, his sudden appearance in Episode 5 changes everything.  He now act as the boss for an underground club, somehow gains lots of money from his rich girlfriend, and has this odd ability called, “déjà vu”, which allows him to dodge/react to any incoming attacks and thus prevent being killed.  However, some questions came to mind: how did he get these abilities, and why did he take lots of damage in Episode 1, when he could have easily dodged Ren’s attacks?  Sill, these are minor questions, and his role in the story was significant, from providing crucial information to assisting in the fights against the Nazis.\\n\\n\r\nKasumi Ayase is a loud-mouth, obnoxious neighbor and childhood friend.  She acts very masculine, as evidenced by being a member of the kendo club, and has an unyielding personality.  Her importances in the story are explained in Episode 3, however the way the material and information was presented felt extremely rushed and anticlimactic.  And, from Episode 3 onwards, she is used more for comedy relief and as the damsel-in-distress, for multiple events.\\n\\n\r\nIrrelevant Characters in the Show:\\n\\n\r\nRea “Theresia” Himuro’s character is strange, in that, while she occasionally appears in the anime, she doesn’t have a huge impact on the overall story.  In fact, she acts more as the popular upperclassman and comedy relief, who eats weird spicy bread, keeps her distances from others, and has a monotone voice with a mostly flat expression.  Her only contribution/relevance was to unlock the chains off of Ren in Episode 7, beyond that she was completely irrelevant.  Still, the anime hints that there is a deeper backstory to her, unfortunately the anime fails to show it.\\n\\n\r\nAnother character, who makes one or two appearances in the anime, is a girl trapped with a bunch of skeletons and skulls.  But, similar to Rea, the anime fails to answer who she is, what’s her backstory, and what’s her role in the overall story. \\n\\n\r\nANIMATION: \\n\\n\r\nThe art is mediocre at best.  The character design is passable; they all have some freaky eye design with crosses and other strange objects reflected in it, and they somewhat have the same face design.  The only differences between characters are their different color hairs and their hair styles, and certain distinctive neck scars, although this only applies to two characters.  Most usage of CG was to render specific objects, such as red skulls, skeletal claws, transformations, blades, etc, and their usage were well intended and great, however the constant use of red skulls to remind viewers that he’s a ‘bad guy’ was overdone and repetitive.  Some problems with the art includes, the unrealistic pool of blood and blood splatters, the hazy filters to indicate a dream-sequence was annoying and terrible looking, and the general lack of background details, making them look plain and cheap.\\n\\n\r\nMost of the animations in this show was done pretty well, such as the good action scenes and sequences in the park, the bridge, and in the school, and general character movements.  Still, there were some questionable animations, for example: the awkward dancing sequences/movements in Episodes 7 and 8 where the characters either stood there or appeared to be rocking back-and-forth, the many still shots of our main characters doing mundane activities, and the limited fight choreographies.  Overall, both the art and animations were satisfactory, providing just enough details and movement to entertain the viewers.\\n\\n\r\nSOUND:\\n\\n\r\nThe voice acting is pretty good as every voice actor or actresses fulfills their roles, whether they are the villain, or secondary or main characters.  Still there was a moment, where I laughed as I realized almost every character talks in a deep, sinister, and threatening voice like they are the most badass person on the planet.\\n\\n\r\nThe opening song is sung by Yui Sakakibara and accompanied with electric guitars, drums, a mixed choir, and organ music, while the background display shocking images, such as skulls and bones, guillotines, Nazis, religious crosses, monsters and mechs, a red moon, and closeup shots of eyes and what they see.  The ending song is sung by Phero☆Men (i.e. Suwabe Junichi and Jinguuji Ren) and accompanied with drums, guitars, and keyboard, set to ending credits.  The opening song, in my opinion, was okay, and not as impactful as compared to the ending song.  The ending song, on the other hand, created an ominous feeling of ‘something bad’ was going to happen, which was perfect for this show.  And the use of choir and organ sounds, in the opening intro, also added layers of ominous feelings, despite the decent vocals and lyrics.\\n\\n\r\nNow, the use of background music was hit-or-miss.  There were moments where it worked and moments where it fell flat.  For moments where it worked, here are some examples: the use of heavy rock music during fight scenes adding more intensity to the fights, the use of Messa da Requiem - dies irae as the character musical introduction for Lord Heydrich creating the impression that a badass was appearing, and finally the use of organ music and dramatic vocals for when a villains shows up brought dread and despair.  For moments where it didn’t worked, here are some example: the use of organ music during important conversations to create a moody and intense atmosphere, and the priest’s ‘drama-filled’ conversation with Riza in the school.\\n\\n\r\nENJOYMENT:\\n\\n\r\nWhat enjoyment?  I had more moments of confusion than enjoyment.  Enjoyment is the last word I would use for this series.  In fact, I felt more relief towards the end of every 23 minute episode, knowing that it’s done; never to be watched again.",
            "date": "2017-12-22T11:07:00+00:00",
            "helpful_count": 73,
            "mal_id": 266002,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=266002"
        },
        {
            "content": "A wise man once said: \"There is no Tsukihime anime.\" \r\nHis august thought, pregnant with knowledge and brightness can fit any visual novel adaptation perfectly. To ruin a magnificent novel by an unspeakable, abominable, despicable, damned monstrosity of an adaptation is a grave sin one could say.\r\nGreat books don't make great movies, or series in this instance.\r\nSo I say: \"There is no Dies Irae anime.\"\r\nReally just read the VN, it's available on Steam, you won't regret spending those sixty hours reading it. It is a magnificent story filled with so much thought you won't be able to remove it from your thoughts (unless you don'tlike reading then I guess nothing can help at this point).\\n\r\nI am still hoping it will be remade, like what happened with DEEN's Fate.\\n\\n",
            "date": "2017-12-22T11:02:00+00:00",
            "helpful_count": 32,
            "mal_id": 266000,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5942210.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PavelShinpuSama",
                "username": "PavelShinpuSama"
            },
            "url": "https://myanimelist.net/reviews.php?id=266000"
        },
        {
            "content": "This show is a disaster. This isn't something I say lightly. On a basic level Dies Irae is a complete and utter failure on almost every possible level. And knowing that (at the time of this review) there are still web exclusive episodes left is a harrowing thought.\r\nI have not read the visual novel, in fact I was dared to watch this show, having not read it. As somebody who hasn't read the VN Dies Irae is baffling. Characters teleport around, change powers and appearances, and have momentary appearances in the show for seconds before randomly becoming important later. Of course, this is because muchof the VN content has been cut out, this is an adaptation of the final route. (Although strangely there is anime original content too.)\\n\\n\r\nEven still, Dies Irae's \"plot\" manages to be simultaneously simple and overly complex, with lots of extra, needless characters with unknown motivations. Even a cursory flashback isn't afforded to those who aren't already intimately familiar. And with good VN adaptations out there, it isn't good enough these days.\\n\\n\r\nBut even looking beyond my own ignorance of the source material, this anime is a mess. The animation quality ranges from mid-budget 2005 harem show to local YouTube animator getting his hands on a CGI program. Characters are consistent in them being completely off model, the CGI is laughable and jarring, and the show can't even afford some frames for the fight scenes. For an action show there is a severe lack of action.\\n\\n\r\nThe characters are very rarely explained, the vast majority of the important backstory for them being cut from the show in favour of more CGI skeletons. The main character is incredibly boring, and his friends and allies even more so. The enemy side shows a little more personality, but there's so many of them that you'll quickly forget names and faces. They rotate out every other episode meaning none of them have much impact and even fewer do anything of significance to the narrative. \\n\\n\r\nAny momentary enjoyment that you might feel from the over dramatic presentation and bad German will quickly be removed as the show bores you to death with long episodes consisting entirely of exposition, that fail to actually explain anything. Be warned, the chuuni appeal does not last for long.\\n\\n\r\nThe sound sucks, with some really phoned in voice performances from everybody involved.\\n\\n\r\nAvoid this dud.",
            "date": "2017-12-22T12:36:00+00:00",
            "helpful_count": 31,
            "mal_id": 266012,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5485448.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Streecer",
                "username": "Streecer"
            },
            "url": "https://myanimelist.net/reviews.php?id=266012"
        },
        {
            "content": "To be honest I personally love the anime so far. Some people complain how the anime doesn't make any sense but I understand perfectly. \r\nStory:8 The anime is about a war happening and having two sides fight each other. A dude with a sister goes to bed every night dreaming about a person dying. But wakes up to find out that a man is actually dying every day. To me the anime is very interesting if you actually understand what's going on and I'll let you watch the rest to find out what happens.\r\nArt:8 People have their own anime art styles so this is goingto be in my own opinion. I really like the art in this anime and how everything looks in it. It's my kind of art style and that's another reason why I personally like this anime. But that's on me though because like I said we all have our own art style preferences.\\n\\n\r\nSound:8 Not really much I can say. The sound in the anime is really good. All the all the weapons so sound look and realistic and it really gets you into the anime. The music really does make the anime a lot more interesting.\\n\\n\r\nCharacter:8 All characters have their own personality. Some are mad funny and make you laugh and some are serous. All the characters are so strong, and confident. Not scared to fight any opponent and even though their are two sides of the war, some characters become somewhat close to each other. Overall I think the characters are perfect.\\n\\n\r\nEnjoyment:8 If you fully understand the anime you'll really enjoy it. Just take the time to process what's going on and you'll see how amazing the anime is. A anime where you get to see a lot of action and amazing battles.\\n\\n\r\nHonestly I'd give the story a higher rate if they just made it a little bit more clear for some people so they can really understand it. Anime starts off a bit confusing but the more you get into it the more you'll understand and you'll see how entertaining the anime is. So far, I really enjoy it because I understand what's going on in the anime.\\n\\n\\n",
            "date": "2017-11-21T15:13:00+00:00",
            "helpful_count": 31,
            "mal_id": 263696,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141734.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeSpirits",
                "username": "AnimeSpirits"
            },
            "url": "https://myanimelist.net/reviews.php?id=263696"
        },
        {
            "content": "I can get why people have a problem with this show. The pace is quite uneven, the story isn´t that coherent, much is not explained, and the clear haram vibe can be a turn off. I haven´t read/played the popular visual novel that the anime adaption is built on, so I can´t say if it´s a good adaption or not. However, I actually quite liked the show, its just demand that you are focused on the bits and pieces of information you get, and that you puzzle them together yourself. But before we dig into the actual review, some background information can be good.\r\nLet´s firstunderstand the title “Dies Irae”, the show actually makes more sense when you know the meaning of it.\\n\\n\r\n“Dies Irae” is contrary to what many believe (me at the beginning as well), is not German, it´s Latin. Directly translated it means “Day of wrath”, and I found out when googling some, that it is a real psalm text about the absolute dooms day, which has an old catholic origin, and were translated to German in the 1700th. Dies Irae, is the day the world will be dissolved in ashes, much like the Vikings “Ragnarök”. Which basically telling you which direction this show will take. \\n\\n\r\nNow when we cleared that out, let´s take a look at how “Dies Irae” were as a show.\\n\r\nThe fractions of the show that let you in on the plot, weren´t that bad at all. An old society of super powerful mages, with some dark plans and a big end game, the origin of the main character Ren and his friends Kasumi and Shirou, the connection with the mages powers and human souls, and the techniques and incantations they use to preform magic, are all some interesting parts. But it´s just that, it´s just fractions of those bits throughout the show, which never were explored or explained to an extent that would have taking the show from “this is kind of cool” to “kind of really damn good” level. \\n\\n\r\nAs for the 0 episode, if you didn´t get it the first time, re-watch it after the 7th episode, it fits pretty good there, and the episode will make since. \\n\\n\r\nThe show has some of its focus on other parts, such as the harem part (yes, it´s very harem influenced, hence the several routes), surprisingly much slice of life, and some fights that felt kind of pointless in the beginning, besides present many of the villains as psycho sadistic assholes (with a few exceptions). Personal opinions aside, many of the characters are stereotypes with a twist, and used as such. For example, the childhood friend that wishes she now would be teenager MC´s girlfriend, MC´s rival male childhood friend, and a loli-looking tsundere senpai. But at the same time, I weren´t bored with them, they had enough importance in what´s was unfolding, and interesting enough personalities. \\n\\n\r\nSome explanations of the circumstances and certain characters place in the story are provided during the watch, but they could´ve have focused much more on those parts to really make it interesting. \\n\\n\r\nBesides that, I actually looked forward to watching a new episode each week. “Dies Irae” grow steadily on me, and had something that made me not only keep watching it, but looking forward to it. And that may been partly because of the plot development, it takes a little bit of a lift in the 7th episode, and partly because of the soundtrack. Some of the soundtrack is some real high-class pieces; German classic-music-orchestras, sometimes with some good opera. Which fitted the atmosphere of “Dies Irae” really well, with the German inspired uniforms, plot-base, and names. And after googling some more, I found out that the incantations the mages preform is individual, and are based on famous German literature and operas like Wagner and Goethe (the quote which is seen in every episode, just after the opening, is from Goethe´s two pieced tragedy). The rest isn´t too bad either, with some nice rock pieces fitting the darker theme. The opening \"Kadenz\" by Yui Sakakibara, is engaging and presents the mode and spirit of the show well. It´s a lot of characters and connections, which the visuals do a good job of displaying. With the highlight being the ending song, \"Opera” by Phero☆Men. If not watch the show, just look that one up, it’s pretty great, it was the best part of the show according to me. The VA´s were well matched, with a nice sounding Japanese accent. \\n\\n\r\nI liked the art and animation. The character design seemed to be somewhat similar to Kouta Hirano´s works (the man behind Hellsing), with their specific hair styles, eye and face shapes, long limbs and bodies, gloves and uniforms with Nazi-Germen design. Which is in my opinion isn´t a bad thing, I´m a big fan of his work. To see the similar style in another show, was just a plus. The animation, by studio A.C.G.T, is absolutely decent, it often looks pretty good. Nice colours, backgrounds, effects for the super natural/magic parts, and the fight scenes were fluid and interesting enough.\\n\\n\r\nSo, to round things up, I actually did enjoy most of my time with “Dies Irae”. \\n\r\nEspecially after I looked up some information, that gave the show the platform it needed. Some will be explained throughout this first 11 episodes, and since the show is scheduled for at least 6 more episodes (ONA), it has the opportunity to grow in that department, and give the show a solid feeling. The soundtrack, opening, and ending were worth the time on its own, I´m still a bit surprised about how good they were. And the Kouta Hirano inspired art were a clear plus as well. I will definitively check out the visual novel it based on, I haven´t had the craving for a game in a while, but Dies definitively awoke up that feeling a bit. \\n\\n",
            "date": "2017-12-22T10:47:00+00:00",
            "helpful_count": 27,
            "mal_id": 265995,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=265995"
        },
        {
            "content": "So this is strange to me. I loved the 00 episode so much it instantly became one of my favorites but the rest seems so rushed that they managed to create an anime with basically no depth to the characters or story lines. \r\nThis is the kind of anime that usually rates the highest for me and it has such an amazing potential but everything turned out a little off the mark and while I do enjoy it they should have made it at least a 24 episode show and added more background instead of rushing the living hell out of it.",
            "date": "2017-12-16T01:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 265324,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2784.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThePhr3ak",
                "username": "ThePhr3ak"
            },
            "url": "https://myanimelist.net/reviews.php?id=265324"
        },
        {
            "content": "I'm proud to tell everybody that this anime has a potential to become a masterpiece, people complained about it for being too short or cutting important points in the VN, but the most common thing people said about the anime are sentences like: \"What did just Happened ?\" \"What did I just Watched\", etc...\r\nHowever \"in my case\" I'm not confused at all, the story is easy to understand, and I'm not even joking... I could only advise people to read the description/sypnosis first especially before watching and not skipping the important EP 0. This anime is one of the most unique I've ever watched... Itcombines almost all of my favourite topics: World War 2, the French Revolution  - History for short..., Philosophy, Magick, Life and Death, the Round Table, Norse Mythology, etc. It contains some intriguing elements, it is also important to analyse the subtitles/character's words in order not to get lost...\\n\\n\r\nAlso people should understand that, this anime was made, with the help of FUNDRAISING, so we should be able to understand why the anime was made that way. The art of the anime translates the overall budget as you can see, there some parts that are not smooth (in terms of frames) but still this does not mean the anime should be labelled as one of the worse...\\n\\n\r\nStory +300/10 - Its unique on its own, the theme and atmosphere is very serious, it has a dark tone at almost all the time, etc.\\n\\n\r\nArt: 9/10 - As stated above, there are some parts where frames are not much smooth, but this will never be the case for me... it's still great...\\n\\n\r\nSound: +250/10 - The Opening Song matched the anime well, BG Sounds may at often times not amuse the audience, well  that being said we can't please everybody... but for me they still done a great job.\\n\\n\r\nCharacter: +500/10 - Even though there's not much backstory shown, most of the characters are unique on its own...\\n\\n\r\nEnjoyment: 100/10 - I said it before and I'll say it again... the enjoyment this anime gives is just fine and great, one of the most unique anime shows I ever watched but of course not the best but absolutely not the worse.\\n\\n\r\nOverall 10,000/10 Its quite easy to understand (I haven't even played the VN mind you...), has a unique way of storytelling, all I can say is they had done a great job for this anime... If only the studio have enough budget, this will be one of the Greatest Anime Ever Made... I still hope for that time to come....\\n\\n\r\nNote: This is my first time writing a review on MAL, I apologised for my bad grammars... ^__^ just stating my opinion...",
            "date": "2018-05-17T04:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 280775,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7260993.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sylth_Asmodeus",
                "username": "Sylth_Asmodeus"
            },
            "url": "https://myanimelist.net/reviews.php?id=280775"
        },
        {
            "content": "Overall, Dies Irae is not an anime for everyone. Looking through comments before watching the show created doubt and gave me the feeling of searching for the imperfections in the anime.\r\nBeginning with the story, it is very complex. There are many different stories from different perspectives of characters that are followed and all intertwine with each other, however, it all surprisingly fits together. I have watched close to mid 200s, maybe even 300 series and it required quite a bit of attention to detail to fully understand the show. If you can follow along with stories well, and create sense out of it, then Idefinitely recommend this show. If anything, I wouldn't recommend comparing this anime to others due to its diversity.\\n\\n\r\nBoth the art and sound were very good. Battles were enjoyable to watch, and sounds fit in perfectly with the art.\\n\\n\r\nCharacter development through the show is on the higher end. I enjoyed how more and more is known about the characters as the anime progressed. The main characters all had great development and the explanation of the characters by Kraft explained a lot. There were unnecessary development of side characters, which did add some confusion to the overall story, but it did help in understanding intentions.\\n\\n\r\nTo sum things up, Dies Irae is a really controversial anime in the way that it touches on Nazi topics and is very complex in itself. Do not let the low rating of the anime discourage you to watch it though. If you want to see if this is a good anime for you, I'd recommend watching around 3 to 5 episodes, not including episode 0. Really hoping for a second season for this anime to see what happens after the ending and just to see what happens with everything in general.",
            "date": "2017-12-30T19:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 266933,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6844814.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Teritas",
                "username": "Teritas"
            },
            "url": "https://myanimelist.net/reviews.php?id=266933"
        },
        {
            "content": "Dies Irae is actually not as confusing as everyone says. In fact, I find it very smart. Many things are not directly told but if you have watched enough anime you will be able to grasp the situation of what is going on. \r\nAlthough the themes and genre are typical, the execution of these ideas are brought in a dark and sometimes gory atmosphere which supports it really well.\r\nThe characters are really unique and are over powered in their own ways which makes it really interesting to watch. However I agree with most people that there is not enough development and makes them see alot like only supporting characters.\\n\\n\r\nS0me scenes are kind of awkward especially with the soundtrack that is not always fitting, but nevertheless it was a good watch.\\n\\n\r\nDESPERATELY WAITING FOR THE NEXT FEW EPISODES TO AIR IN JULY WHOS WITH ME",
            "date": "2018-04-27T19:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 279170,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6336743.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hazel_daze",
                "username": "hazel_daze"
            },
            "url": "https://myanimelist.net/reviews.php?id=279170"
        },
        {
            "content": "Story: Fairly interesting, although incomplete by the last episode. It's not nearly as confusing as people are making it out to be, though I can understand thinking that it's confusing because all of the information simply isn't there. If anything will leave you scratching your head it's the last episode, which concludes \"in the middle of the climax\", as best as I can describe it. It's interesting enough and has some unique concepts, perhaps remnants of the critically acclaimed visual novel. Still, the way it is handled falls short of \"good\", and without the ONA this is clearly an unfinished production. \r\nArt: Once again, fair.It's not a high budget production, and this shows in both the art and the voice acting, but it has its moments. Acceptable. \\n\\n\r\nSound: The voice acting is overall fairly weak, and the background music doesn't stand out in any particular way. Passable. The guillotine song is kind of cool. \\n\\n\r\nCharacter: Eh. They're not extremely well developed and come off as pretty generic, but that's fine. Some of the bad guys are interesting. \\n\\n\r\nEnjoyment/Overall: An alright anime. Not something I would recommend you go out of your way to watch, but not a total failure. I will watch the ONA to see if the story gets fleshed out more. There's plenty of better stuff to spend 11 episodes on, though. Be warned that the (Funi?) translation is pretty bad, and kind of ruins a couple of scenes with awkward lines and misunderstandings. \\n\\n",
            "date": "2018-01-07T09:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 267793,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3165665.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zarmazarma",
                "username": "Zarmazarma"
            },
            "url": "https://myanimelist.net/reviews.php?id=267793"
        },
        {
            "content": "Ok so Dies Irae (Latin Word interesting choice for depicting Day of Wrath for a titled Hymn for mass of the dead). First off it isn't bad to watch at times it may appear confusing and ultimately without what is expected to be another 6 episodes feels incomplete however thats not to fret as they are expected to be released according to their website! \r\nIll keep this spoiler free as possible now assuming you may have already seen the first episode 0 if not ill also add a small bit about that here if so skip that.\r\nEpisode 0 gives us a bit of a historylesson to introduce the scenario and the bases for this anime tho it doesn't introduce us to our main characters in the full season it does give us some reasoning for all the other characters that are involved their history and a understanding of the whole supernatural/super power thing we have going on. Though you should probably watch this first as without it your going to be confused throughout a fair amount of the anime.\\n\\n\r\nOk so on to episodes 1 - 11!\\n\\n\r\nLets break it down so that its easier to get a full scope ill stay spoiler Free!!\\n\\n\r\nStory: 6 \\n\\n\r\nRight so the story has it's up's and down's, though what doesn't right? So there are a few things here that you have to understand this anime is all about power and like the saying of Kings \"With Power you can do anything\" the concept of this is very real in this world where our main protagonist has to train up and become stronger so that for all meaning of the word Dies Irae doesn't happen. Now something to mention is the pacing seems to be all over the place at times the anime is very slow and other times very fast and too much is happening. But hold on we are all confused! why on earth does nothing seem logical? Well you know those times when you don't want involvement in something and honestly feel like you don't really have any heart for what your doing till someone really annoys you well this is very much built on that emotion and as emotions go they are everywhere in this anime everything people do or there reasons are build on desire and emotions. Now long as you are able to keep up with its complex meanings as you go through things do get reveled and it does in fact make sense, also its action packed and in a cool way so if you like that sort of thing then its totally for you. With added fan service for the watchers but not anything that would be overkill it creates a lighter atmosphere at times, but let it be know that it also gets dark like seriously and attack are bloody. \\n\\n\r\nArt: 7 \\n\\n\r\nOk on the bright side its not bad on the eyes though id say around this period there are other options which are going to satisfy as eye candy this is defiantly not bad! The characters are well designed swell as the depictions of the super natural ability though the look and drawn aspects are clean the way in which some aspects were interpreted and drawn may not suit a fans wishes. This is extremely limited scenario and in the most part doesn't take effect away from the anime.\\n\\n\r\nSound: 7 \\n\\n\r\nOk interesting one i'm going to cover 2 aspects here because i checked both out for good measure i feel that even if you are a DUB watcher SUB is going to be the better option here. Firstly it sounds a lot better in the DUB there are a bunch of German accents which sound French at times and they also feel the need to actually speak in a mix of Languages at times that unless you have studied Latin may be just something you have to accept if watching this. However if you watch it in SUB then its great because you don't have to deal with all the broken german (french sounding) accents that the english speaking actors used. Otherwise the intro and end sounds were good.\\n\\n\r\nCharacters: 6 \\n\\n\r\nOk so we have 2 main characters and ill speak about each of them and then side characters as a whole.\\n\\n\r\nFujii, Ren:\\n\\n\r\nThis guy is interesting in a way that i have no idea what his though process is tho he has pretty good ideals as a human being to say the least. He feels committed to take on a task that he really doesn't like and doesn't want to be part off though he is forced into it wants to protect those that he cares about and cannot except what is going to happen. Plus he has a great female lead to work with when she eventually shows up so here we have Marie. \\n\\n\r\nMarie:\\n\\n\r\nOk so she's great intact without her this anime would bomb as she draws at least some meaning for what is going on in the anime as well as plays a vital part like well he needs her what can I say! She has a personality that changes and really is noticeable throughout the anime, though she doesn't show up right away only appearing in clips every now and then in the beginning to later be explained (when you watch that is not by me).\\n\\n\r\nSides: \\n\\n\r\nOk actually one of the sides if not 2 could be main characters as well they are pretty important and one of them may even get more air time than our female star! However her role as mostly a bystander won't fill that cut necessary of this title, these characters make up the friends, allies and enemies of the main couple in the anime and support them and the events as you move forward. \\n\\n\r\nYou Say -  \"Hmm well thats what you would expect of side character!\"\\n\r\nPrecisely!\\n\\n\r\nEnjoyment: 7 (My Personal enjoyment level)\\n\\n\r\nI enjoyed watching it because I watched it all the way through in fact I can't wait for the next 6 episodes to be released would I say its the best thing iv ever watched? No! But it isn't a bad watch either in actual fact I rate this about 6.8 and for the overall rating we round that up to 7. I enjoyed the action element to this and the phycology behind it. There are a lot of element that made me want to keep on watching throughout the series to see what would happen next and each episode sets off from where the last finished so its not episodic another thing I like in an anime. If you have time give it a watch a lot of people will like it is it for everyone? No! But is it worth watching? Yes!\\n\\n\r\nI hope anyone who read this found its useful i tried to be as neutral as possible when writing this as to give a review showing both sides good and bad of the anime and wish those who do watch it enjoyment!\\n\\n\r\nThanks for reading and have a Happy New Year!!\\n",
            "date": "2017-12-29T12:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 266789,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5031999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Suzune-Horikita",
                "username": "Suzune-Horikita"
            },
            "url": "https://myanimelist.net/reviews.php?id=266789"
        },
        {
            "content": "Dies Irae is absolutely one of my favorite typical dark fantasy visual novel, i got excited after hearing this one got anime adaptation... however, my hope got down so fast after watching the first episode.\r\n(i'm going to avoid the spoiler)\r\nStory 4/10:\r\nDies Irae has a great story, however.. the anime skip so much detail and feels like they just throw a pieces of puzzle at a random place, you could enjoy watching it more IF you played the VN, but if you didn't.... trust me, you can barely understand the story, or worse.. you can't understand it at all. Plot twist is one of its greatestasset(as a VN).. but the anime twisted the plot so much that you can't even see it.\\n\\n\r\nArt 3/10:\\n\r\nNothing to say, the Art looks poor for even for 2000's anime.\\n\\n\r\nSound 6/10:\\n\r\nThe Voice Actor/Actress is good, they enlist a pretty good cast right here, all the theme used really fit its natural dark fantasy atmosphere. When the theme kicked in some of the fight scene(eventhough the animation are kinda poor), it feels intense and could give you a chill down your spine.\\n\\n\r\nCharacter 6/10:\\n\r\nThe \"MAIN\" Character is probably the lion part of the series, First.. you need to know that the anime is based on Marie Route, personally i think.. this route is where Ren got most character development. The anime really did a good job with Sakura and Marie, and shiro too, although some support character looks rather bland and need more screentime, but it's fair at least.\\n\\n\r\nEnjoyment 3/10:\\n\r\nThis probably isn't the case if you watch it several times, but for the first-timer, you probably couldn't enjoy it that much... this is a kind of anime that required you to watch it several times before you could solve the twist. For those who have played the VN, they probably will enjoy it more... But yah... still not some \"jawdropping\" material.\\n",
            "date": "2018-08-08T00:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 285875,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4645412.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ArruhuNatoryu",
                "username": "ArruhuNatoryu"
            },
            "url": "https://myanimelist.net/reviews.php?id=285875"
        },
        {
            "content": "This Anime had so much potential it actually hurt me. The nazi theme it has going was pretty cool but man the execution of the interchanging characters/story was essentially a cluster of confusion.\r\nToo many things going on at the same time and many things not being explained. I feel hurt because I WANTED to like it more than I did I could see the great potential within this Anime. They creators don't explain the plot to the point where the viewer is not in total darkness.\r\nAll the characters seemed pretty interesting but yet again because they don't explain enough of where the story was goingand how it got there you don't care as much as.\\n\\n\r\nThe music was pretty good at least.\\n\\n\r\nStay away from this one it's not worth it.",
            "date": "2018-02-19T03:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 271921,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1465385.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ruggarell",
                "username": "Ruggarell"
            },
            "url": "https://myanimelist.net/reviews.php?id=271921"
        },
        {
            "content": "I discover Dies Irae with this anime, and I have only one thing to say: I was not disappointed. I take this anime as an introduction to my future reading of the work.\r\nWhat to think of this Anime? I liked all the characters, each with its history, its characteristics, its personality and its background that I will enjoy discovering in the visual novel.\r\nI do not understand why there is so much hate on this adaptation, especially since the producers have totally assumed to have great problems. If it starts on a crowfunding, how can you believe for a single second that the adaptation will beof high quality? On a Visual Novel which is very long and has several purposes? Instead of yelling like idiots no matter how, look at the bottom of the thing to understand the current situation. I think we have to see these episodes as a test, the next 6 ONA episodes will be there to deepen the story and I'm happy.\\n\\n\r\nOverall, I am satisfied. Endearing characters, very good music, a perfectible animation but not ugly.\\n\\n\r\nI think we criticize this anime very easily without understanding the difficulties behind, it sure changes the anime fan service nowadays with stories seen and reviews, and it does not bother the same people criticizing Dies Irae. .. and studios that do not have the means to produce good adaptations of Visual Novel do not take up the budget, publish a really bad adaptation, and for the case of Dies Irae, producers have to assume until end, we ask for money via a Crowfunding to at least please the fan and try to bring a new audience for the works of Light, and who is pointed at and criticized? It's them strangely, and I think it's stupid, yes I say that vulgarly, but it's really stupid for a studio that has at least produce to please the fan, to assume all the difficulties of production but despite all have done that to please the fan.\\n\\n\r\nI can not wait for a second season.",
            "date": "2017-12-22T16:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 266033,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4765344.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/UltimaWeaponEX",
                "username": "UltimaWeaponEX"
            },
            "url": "https://myanimelist.net/reviews.php?id=266033"
        },
        {
            "content": "So, I really don't know what's going on ten out of the episodes in, yet I'm enjoying it in its entirety.  The characters are hard to keep track of but I know that I like them, the art is pretty phenomenal in the fact that it's so vast and crazy. Though, storywise every time I feel like I finally understand what's happening they throw some curveball out of left field at me like I'm in the writer's room and have express knowledge of backstory.  This wouldn't be a problem if it served a plot device but so far it really hasn't. However, istill sat down and binged it so I'd say it's doing something right.",
            "date": "2017-12-18T23:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 265559,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6815571.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Blacksept69",
                "username": "Blacksept69"
            },
            "url": "https://myanimelist.net/reviews.php?id=265559"
        },
        {
            "content": "To be as clear cut as I can be. I don't understand how people are thrashing this anime so indiscriminately, but I can say that most of the people there are not very well off in terms of what they might like. It wasn't confusing, misleading, nor was it jittery or broken in terms of plot. It went exactly as how the author intended, and to be honest, this one was a work of art. To actually understand it correctly, you need to watch it all, start to finish. That's the main problem with the group surrounding this. I think that's also why most ofthe people here have rated it poorly, as they don't actually conceive an opinion based on the whole, but rather bits and pieces. Think of it like this, a symphony. Something slow, melodious, but picks up and reaches that tempo of crescendo until it hits the climax, where it falls off and leaves those watching needing more. That's the kind of drive that I got from this. But I will say inexperience with literature can make it a little hard to follow, but that's also because you need to search for the plot directive while you follow, and the conclusion you reach in this particular work is simple. One might want to paint it something else, or to give it a name unfitting to what it is perceived, but that remains to what the watcher wants to learn from it. My opinion won't change, and will still be a 10/10 for myself.",
            "date": "2018-07-02T02:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 282760,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Steven_Pugh",
                "username": "Steven_Pugh"
            },
            "url": "https://myanimelist.net/reviews.php?id=282760"
        },
        {
            "content": "Warning Major spoilers below\nWhere to start, I found this anime by chance on YouTube as I was scrolling through my recommended and decided 'hey' I'll watch this it looks interesting why not? however I came to regret that decision later.\nWhilst the art and sound is great I have a problem with the overall story due to its lack of an explanation about the background of his Powers and why he is connected to a spirit of a girl killed by a guillotine.\nThen there is no explanation as to why the 13 Nazi group members want to destroy the world and why they are fighting againstthe main character.\\n\nFinally there is the ending, for some reason the ending was so abrupt it left me more confused that I was before I started the anime. I'm not entirely sure why they ended it when they did but I'm assuming its due to the lack of positive feedback it received. \\n",
            "date": "2018-02-26T08:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 272498,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6931580.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kevin_Leafy",
                "username": "Kevin_Leafy"
            },
            "url": "https://myanimelist.net/reviews.php?id=272498"
        },
        {
            "content": "What a disastet.....\r\nWhen I first saw the first episode I stoped watching this series. However recently I have been on spree and watching most animes I have on my list I have not seen yet, and unfortunatly for me this was still in my list...\r\nAnd too be frank I regret it soo much, I could have spent the time I wasted on this watching something good or masterbating. I highly reccomend if you have a choice between this anime and fapping, too go with the lader.\r\nutter garbage!\r\nI mean comeon, the story is shit, the characters are shit and the cinematography is awfull. \r\nDo yourself afavor and DON*T watch this garbage!",
            "date": "2018-01-24T10:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 269510,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3531387.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/nexeriv",
                "username": "nexeriv"
            },
            "url": "https://myanimelist.net/reviews.php?id=269510"
        },
        {
            "content": "This is the first time I'm gonna write a review just to show up how salty am I.\r\nReading the plot was a good surprise: soviets, nazis, WWII, super powers, mystery and magic. Good enough to caught me up to watch it. Ok, 10 minutes of the 1º episode and I didn't understand what I saw. Too much bright, too much people who wasn't introduced, too much of nothing. The art was ok and the sound was good but I just don't even know what was happening! Where is the things I read on the plot? Dies Irea is a complete mess. The show is waytoo rushed and became so confusing. I don't know if I'm too old or anime was always like that. Dropped.",
            "date": "2017-12-29T13:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 266794,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5389285.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/sadnsorrow",
                "username": "sadnsorrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=266794"
        }
    ],
    [
        {
            "content": "[THIS REVIEW CONTAINS SPOILERS]\r\n–––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\r\n[A Confusing and Frustrating Mess]\r\nIf I had to describe Dies Irae, it’s this: confusing and frustrating.  Almost every episode left me saying, “what the fuck is going on” or “what is happening”.  But, in most cases, I just sit there looking confused and dazed as I try to piece together the events that happened this episode with the previous ones.  After awhile, I sort of understand what is happening, but not without a few lingering questions.  Questions that I hoped would be answered in the next episode, except they weren’t, leaving me even more confused and frustrated.\r\nIt seemsas though the creators or producers were expecting the viewers to have played the visual novel and use that as a guide for this series.  Considering that this anime was created through fundraising raised by fans of the visual novel, it’s no wonder.  As someone who has never played the visual novel, I can only say that this show feels rushed, contains many unexplained and poorly connected plot points, and unlikable characters.\\n\\n\r\nSTORY:\\n\\n\r\nDies Irae is a mess.  Since, the beginning of Episode 0, this anime has been a disaster.  The two episodes begins as a sort of harem opening, where many female characters are introduced (i.e. Kasumi, Rea, Kei Sakurai, Rusalka Schwägerin, and later Marie).  Later in Episode 2, it jumps to a random action dream sequence, where the ’Nazis’ test Ren if he’s worth or not and ask to see his powers.  Like what?  A rushed conversation with Rusalka is held on the roof of the school, which barely explains anything, and Kasumi's reveal lacked impact and felt rushed.  Again what?  Then comes along Episode 4, where almost everything is explained.  Basically, the show is too rushed, and too uneven.\\n\\n\r\nIt took four episodes, not including Episode 0, to explain the motives of the ‘Nazis’, the backstory for this show, and Ren’s purpose; all told in the form of Kei's exposition.  If that is not bad writing, I don’t what is.  \\n\\n\r\nIf I had to summarize this show, it’s this: this show is following the Marie Route; Ren is supposed to be powered up by the Nazis so that he can act as a strong opponent for Reinhard Heydrich.\\n\\n\r\nThere are many plot-lines and concepts thrown around without any sense of connection, and too many unanswered questions, such as how is Ren being a clone important, why is Valeria Trifa trying to find the lost bloodline and why are they important, who is the girl locked with the skulls and skeletons, who the person that was with Riza during the flashback sequence, which of the twin did Riza pick to survive and which to kill, and when Bey was beginning to die who was the silver girl shown on screen, etc.\\n\\n\r\nBesides the awful writing, terrible pacing and the many unanswered questions, there are many additional problems with this anime, such as the lack of tension and direction of the show, boring but necessary expositions in Episode 4 and 7, no hints or foreshadowing of future events (i.e. kasumi being possessed), and finally lack of relatable characters.  But, at least the action was good, so there’s that.\\n\\n\r\nThis should have been a longer show, too many ideas and concepts were condensed into 11 episodes.  And worst of all, it has an inconclusive TV ending with the introduction of an evil Nazi eye-patched character, therefore you must see the ONA (12-17) to understand the rest of the story.  That is just stupid.\\n\\n\r\nCHARACTERS:\\n\\n\r\nTo be honest, I found the characters to be unlikable and unremarkable, even though some of them have proper character development and motives for their goals/wishes.  I mean, obviously, the main character will get some character development, along with their backstory and motives explained.  But, other characters that have proper development include: Kei Sakurai, and Marie.  Everyone else falls into a secondary role, acting as a “challenger” to the main character, as a supportive character, or act as completely irrelevant.\\n\\n\r\nMain Characters in the Show: \\n\\n\r\nRen Fujii is the main character, who hates blades in general as said in Episode 1, however as series progresses he himself gets a arm blade and is completely fine with it.  No traumatic flashback, and no disgust, I found that strange, but whatever.  To be honest, he has a really dull personality, and is only important because all the ‘Nazis’ want him to be strong and a badass, so that he can fight Reinhard Heydrich properly.  A sudden revelation in Episode 7 reveals that Ren was a clone created by Kasumi's father as “the bastard child of Karl Krafft,” and originally called Zarathustra.  But, how is this relevant to the story, the anime fails to explain this.\\n\\n\r\nMarie is a girl, who first appears at a sword exhibition and then in Ren’s dreams.  Her origin story is explained in Episode 5, where it’s revealed that she is the soul within the guillotine and Ren forms a contract with her, thus enabling Ren to use the guillotine blade.  Further on, there are many cheesy and cute moments, such as wanting to be the ‘fifth member’ of their group of friends in school, going clothe shopping with Ren and Kasumi, protecting Ren in Episode 10 when he unconscious, etc.  And while, I though it was lame, it does show that Marie cares deeply about Ren and his friends.\\n\\n\r\nKei Sakurai is the youngest member of the Obsidian Round Table after Beatrice Kirchisen passed away eleven years ago.  She acts as a teacher for Ren, offering advice on how to use his powers and improve his levels beyond activity and formation levels.  Her wish is revealed in Episode 9 and 10, where it states that she killed thousands of people just to resurrect some family members and to put an end to the curse that plagues her family.  I found her intentions terrible and unjust, but again whatever.  Her transformation sequence is also terrible and disappointing as all she gains is flames around her.\\n\\n\r\n“Challengers” in the Show: \\n\\n\r\nThere are quite a few characters in this section, but I will only talk about two of them.  The remaining characters, such as Riza, Eleonore Von Wittenburg, Rote Spinne, and even Rusalka Schwägerin, despite providing crucial information in Episode 3, performing the massacre in Episode 8, and appearing in other moments, did not have much character development or background stories.  This is especially true for Eleonore Von Wittenburg, who only fights Ren in Episode 10, and Rote Spinne, who fights and is killed by Ren in Episode 4.  Riza has a special backstory told in Episode 9, however its connection to the overall story is very ambiguous.\\n\\n\r\nReinhard Heydrich (“Lord Heydrich”) is the main villain of the show, who makes an official introduction in Episode 6, where he appears from the Heavens and kicks the shit out of Ren.  He is the leader of Longinus Dreizehn Orden and Obsidian Round Table, although it doesn’t matter as each organization is slowly decreasing in membership.  Then, in Episode 7, we learn about his true wish, in which he wants to escape the perpetual sense of déjà vu that he's trapped in.  To be honest, I found his wish, stupid and laughable.\\n\\n\r\nValeria Trifa, in the beginning appeared as a clueless, perverted priest, however as the series progresses we see that his true intention are elsewhere.  The anime heavily suggests that he’s helping Ren, and Lord Heydrich and his associates, basically he plays for both sides.  Furthermore, it seems like he’s trying to find the lost bloodline associated with the Round Table, however its connection to the show is also very ambiguous.\\n\\n\r\nSupportive Characters in the Show: \\n\\n\r\nShirou Yusa is Ren's childhood best friend, who is a thrill seeker and the person who mysteriously disappeared in Episode 1.  However, his sudden appearance in Episode 5 changes everything.  He now act as the boss for an underground club, somehow gains lots of money from his rich girlfriend, and has this odd ability called, “déjà vu”, which allows him to dodge/react to any incoming attacks and thus prevent being killed.  However, some questions came to mind: how did he get these abilities, and why did he take lots of damage in Episode 1, when he could have easily dodged Ren’s attacks?  Sill, these are minor questions, and his role in the story was significant, from providing crucial information to assisting in the fights against the Nazis.\\n\\n\r\nKasumi Ayase is a loud-mouth, obnoxious neighbor and childhood friend.  She acts very masculine, as evidenced by being a member of the kendo club, and has an unyielding personality.  Her importances in the story are explained in Episode 3, however the way the material and information was presented felt extremely rushed and anticlimactic.  And, from Episode 3 onwards, she is used more for comedy relief and as the damsel-in-distress, for multiple events.\\n\\n\r\nIrrelevant Characters in the Show:\\n\\n\r\nRea “Theresia” Himuro’s character is strange, in that, while she occasionally appears in the anime, she doesn’t have a huge impact on the overall story.  In fact, she acts more as the popular upperclassman and comedy relief, who eats weird spicy bread, keeps her distances from others, and has a monotone voice with a mostly flat expression.  Her only contribution/relevance was to unlock the chains off of Ren in Episode 7, beyond that she was completely irrelevant.  Still, the anime hints that there is a deeper backstory to her, unfortunately the anime fails to show it.\\n\\n\r\nAnother character, who makes one or two appearances in the anime, is a girl trapped with a bunch of skeletons and skulls.  But, similar to Rea, the anime fails to answer who she is, what’s her backstory, and what’s her role in the overall story. \\n\\n\r\nANIMATION: \\n\\n\r\nThe art is mediocre at best.  The character design is passable; they all have some freaky eye design with crosses and other strange objects reflected in it, and they somewhat have the same face design.  The only differences between characters are their different color hairs and their hair styles, and certain distinctive neck scars, although this only applies to two characters.  Most usage of CG was to render specific objects, such as red skulls, skeletal claws, transformations, blades, etc, and their usage were well intended and great, however the constant use of red skulls to remind viewers that he’s a ‘bad guy’ was overdone and repetitive.  Some problems with the art includes, the unrealistic pool of blood and blood splatters, the hazy filters to indicate a dream-sequence was annoying and terrible looking, and the general lack of background details, making them look plain and cheap.\\n\\n\r\nMost of the animations in this show was done pretty well, such as the good action scenes and sequences in the park, the bridge, and in the school, and general character movements.  Still, there were some questionable animations, for example: the awkward dancing sequences/movements in Episodes 7 and 8 where the characters either stood there or appeared to be rocking back-and-forth, the many still shots of our main characters doing mundane activities, and the limited fight choreographies.  Overall, both the art and animations were satisfactory, providing just enough details and movement to entertain the viewers.\\n\\n\r\nSOUND:\\n\\n\r\nThe voice acting is pretty good as every voice actor or actresses fulfills their roles, whether they are the villain, or secondary or main characters.  Still there was a moment, where I laughed as I realized almost every character talks in a deep, sinister, and threatening voice like they are the most badass person on the planet.\\n\\n\r\nThe opening song is sung by Yui Sakakibara and accompanied with electric guitars, drums, a mixed choir, and organ music, while the background display shocking images, such as skulls and bones, guillotines, Nazis, religious crosses, monsters and mechs, a red moon, and closeup shots of eyes and what they see.  The ending song is sung by Phero☆Men (i.e. Suwabe Junichi and Jinguuji Ren) and accompanied with drums, guitars, and keyboard, set to ending credits.  The opening song, in my opinion, was okay, and not as impactful as compared to the ending song.  The ending song, on the other hand, created an ominous feeling of ‘something bad’ was going to happen, which was perfect for this show.  And the use of choir and organ sounds, in the opening intro, also added layers of ominous feelings, despite the decent vocals and lyrics.\\n\\n\r\nNow, the use of background music was hit-or-miss.  There were moments where it worked and moments where it fell flat.  For moments where it worked, here are some examples: the use of heavy rock music during fight scenes adding more intensity to the fights, the use of Messa da Requiem - dies irae as the character musical introduction for Lord Heydrich creating the impression that a badass was appearing, and finally the use of organ music and dramatic vocals for when a villains shows up brought dread and despair.  For moments where it didn’t worked, here are some example: the use of organ music during important conversations to create a moody and intense atmosphere, and the priest’s ‘drama-filled’ conversation with Riza in the school.\\n\\n\r\nENJOYMENT:\\n\\n\r\nWhat enjoyment?  I had more moments of confusion than enjoyment.  Enjoyment is the last word I would use for this series.  In fact, I felt more relief towards the end of every 23 minute episode, knowing that it’s done; never to be watched again.",
            "date": "2017-12-22T11:07:00+00:00",
            "helpful_count": 73,
            "mal_id": 266002,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=266002"
        },
        {
            "content": "A wise man once said: \"There is no Tsukihime anime.\" \r\nHis august thought, pregnant with knowledge and brightness can fit any visual novel adaptation perfectly. To ruin a magnificent novel by an unspeakable, abominable, despicable, damned monstrosity of an adaptation is a grave sin one could say.\r\nGreat books don't make great movies, or series in this instance.\r\nSo I say: \"There is no Dies Irae anime.\"\r\nReally just read the VN, it's available on Steam, you won't regret spending those sixty hours reading it. It is a magnificent story filled with so much thought you won't be able to remove it from your thoughts (unless you don'tlike reading then I guess nothing can help at this point).\\n\r\nI am still hoping it will be remade, like what happened with DEEN's Fate.\\n\\n",
            "date": "2017-12-22T11:02:00+00:00",
            "helpful_count": 32,
            "mal_id": 266000,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5942210.jpg",
                "scores": {
                    "animation": 1,
                    "character": 10,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PavelShinpuSama",
                "username": "PavelShinpuSama"
            },
            "url": "https://myanimelist.net/reviews.php?id=266000"
        },
        {
            "content": "This show is a disaster. This isn't something I say lightly. On a basic level Dies Irae is a complete and utter failure on almost every possible level. And knowing that (at the time of this review) there are still web exclusive episodes left is a harrowing thought.\r\nI have not read the visual novel, in fact I was dared to watch this show, having not read it. As somebody who hasn't read the VN Dies Irae is baffling. Characters teleport around, change powers and appearances, and have momentary appearances in the show for seconds before randomly becoming important later. Of course, this is because muchof the VN content has been cut out, this is an adaptation of the final route. (Although strangely there is anime original content too.)\\n\\n\r\nEven still, Dies Irae's \"plot\" manages to be simultaneously simple and overly complex, with lots of extra, needless characters with unknown motivations. Even a cursory flashback isn't afforded to those who aren't already intimately familiar. And with good VN adaptations out there, it isn't good enough these days.\\n\\n\r\nBut even looking beyond my own ignorance of the source material, this anime is a mess. The animation quality ranges from mid-budget 2005 harem show to local YouTube animator getting his hands on a CGI program. Characters are consistent in them being completely off model, the CGI is laughable and jarring, and the show can't even afford some frames for the fight scenes. For an action show there is a severe lack of action.\\n\\n\r\nThe characters are very rarely explained, the vast majority of the important backstory for them being cut from the show in favour of more CGI skeletons. The main character is incredibly boring, and his friends and allies even more so. The enemy side shows a little more personality, but there's so many of them that you'll quickly forget names and faces. They rotate out every other episode meaning none of them have much impact and even fewer do anything of significance to the narrative. \\n\\n\r\nAny momentary enjoyment that you might feel from the over dramatic presentation and bad German will quickly be removed as the show bores you to death with long episodes consisting entirely of exposition, that fail to actually explain anything. Be warned, the chuuni appeal does not last for long.\\n\\n\r\nThe sound sucks, with some really phoned in voice performances from everybody involved.\\n\\n\r\nAvoid this dud.",
            "date": "2017-12-22T12:36:00+00:00",
            "helpful_count": 31,
            "mal_id": 266012,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5485448.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Streecer",
                "username": "Streecer"
            },
            "url": "https://myanimelist.net/reviews.php?id=266012"
        },
        {
            "content": "To be honest I personally love the anime so far. Some people complain how the anime doesn't make any sense but I understand perfectly. \r\nStory:8 The anime is about a war happening and having two sides fight each other. A dude with a sister goes to bed every night dreaming about a person dying. But wakes up to find out that a man is actually dying every day. To me the anime is very interesting if you actually understand what's going on and I'll let you watch the rest to find out what happens.\r\nArt:8 People have their own anime art styles so this is goingto be in my own opinion. I really like the art in this anime and how everything looks in it. It's my kind of art style and that's another reason why I personally like this anime. But that's on me though because like I said we all have our own art style preferences.\\n\\n\r\nSound:8 Not really much I can say. The sound in the anime is really good. All the all the weapons so sound look and realistic and it really gets you into the anime. The music really does make the anime a lot more interesting.\\n\\n\r\nCharacter:8 All characters have their own personality. Some are mad funny and make you laugh and some are serous. All the characters are so strong, and confident. Not scared to fight any opponent and even though their are two sides of the war, some characters become somewhat close to each other. Overall I think the characters are perfect.\\n\\n\r\nEnjoyment:8 If you fully understand the anime you'll really enjoy it. Just take the time to process what's going on and you'll see how amazing the anime is. A anime where you get to see a lot of action and amazing battles.\\n\\n\r\nHonestly I'd give the story a higher rate if they just made it a little bit more clear for some people so they can really understand it. Anime starts off a bit confusing but the more you get into it the more you'll understand and you'll see how entertaining the anime is. So far, I really enjoy it because I understand what's going on in the anime.\\n\\n\\n",
            "date": "2017-11-21T15:13:00+00:00",
            "helpful_count": 31,
            "mal_id": 263696,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141734.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeSpirits",
                "username": "AnimeSpirits"
            },
            "url": "https://myanimelist.net/reviews.php?id=263696"
        },
        {
            "content": "I can get why people have a problem with this show. The pace is quite uneven, the story isn´t that coherent, much is not explained, and the clear haram vibe can be a turn off. I haven´t read/played the popular visual novel that the anime adaption is built on, so I can´t say if it´s a good adaption or not. However, I actually quite liked the show, its just demand that you are focused on the bits and pieces of information you get, and that you puzzle them together yourself. But before we dig into the actual review, some background information can be good.\r\nLet´s firstunderstand the title “Dies Irae”, the show actually makes more sense when you know the meaning of it.\\n\\n\r\n“Dies Irae” is contrary to what many believe (me at the beginning as well), is not German, it´s Latin. Directly translated it means “Day of wrath”, and I found out when googling some, that it is a real psalm text about the absolute dooms day, which has an old catholic origin, and were translated to German in the 1700th. Dies Irae, is the day the world will be dissolved in ashes, much like the Vikings “Ragnarök”. Which basically telling you which direction this show will take. \\n\\n\r\nNow when we cleared that out, let´s take a look at how “Dies Irae” were as a show.\\n\r\nThe fractions of the show that let you in on the plot, weren´t that bad at all. An old society of super powerful mages, with some dark plans and a big end game, the origin of the main character Ren and his friends Kasumi and Shirou, the connection with the mages powers and human souls, and the techniques and incantations they use to preform magic, are all some interesting parts. But it´s just that, it´s just fractions of those bits throughout the show, which never were explored or explained to an extent that would have taking the show from “this is kind of cool” to “kind of really damn good” level. \\n\\n\r\nAs for the 0 episode, if you didn´t get it the first time, re-watch it after the 7th episode, it fits pretty good there, and the episode will make since. \\n\\n\r\nThe show has some of its focus on other parts, such as the harem part (yes, it´s very harem influenced, hence the several routes), surprisingly much slice of life, and some fights that felt kind of pointless in the beginning, besides present many of the villains as psycho sadistic assholes (with a few exceptions). Personal opinions aside, many of the characters are stereotypes with a twist, and used as such. For example, the childhood friend that wishes she now would be teenager MC´s girlfriend, MC´s rival male childhood friend, and a loli-looking tsundere senpai. But at the same time, I weren´t bored with them, they had enough importance in what´s was unfolding, and interesting enough personalities. \\n\\n\r\nSome explanations of the circumstances and certain characters place in the story are provided during the watch, but they could´ve have focused much more on those parts to really make it interesting. \\n\\n\r\nBesides that, I actually looked forward to watching a new episode each week. “Dies Irae” grow steadily on me, and had something that made me not only keep watching it, but looking forward to it. And that may been partly because of the plot development, it takes a little bit of a lift in the 7th episode, and partly because of the soundtrack. Some of the soundtrack is some real high-class pieces; German classic-music-orchestras, sometimes with some good opera. Which fitted the atmosphere of “Dies Irae” really well, with the German inspired uniforms, plot-base, and names. And after googling some more, I found out that the incantations the mages preform is individual, and are based on famous German literature and operas like Wagner and Goethe (the quote which is seen in every episode, just after the opening, is from Goethe´s two pieced tragedy). The rest isn´t too bad either, with some nice rock pieces fitting the darker theme. The opening \"Kadenz\" by Yui Sakakibara, is engaging and presents the mode and spirit of the show well. It´s a lot of characters and connections, which the visuals do a good job of displaying. With the highlight being the ending song, \"Opera” by Phero☆Men. If not watch the show, just look that one up, it’s pretty great, it was the best part of the show according to me. The VA´s were well matched, with a nice sounding Japanese accent. \\n\\n\r\nI liked the art and animation. The character design seemed to be somewhat similar to Kouta Hirano´s works (the man behind Hellsing), with their specific hair styles, eye and face shapes, long limbs and bodies, gloves and uniforms with Nazi-Germen design. Which is in my opinion isn´t a bad thing, I´m a big fan of his work. To see the similar style in another show, was just a plus. The animation, by studio A.C.G.T, is absolutely decent, it often looks pretty good. Nice colours, backgrounds, effects for the super natural/magic parts, and the fight scenes were fluid and interesting enough.\\n\\n\r\nSo, to round things up, I actually did enjoy most of my time with “Dies Irae”. \\n\r\nEspecially after I looked up some information, that gave the show the platform it needed. Some will be explained throughout this first 11 episodes, and since the show is scheduled for at least 6 more episodes (ONA), it has the opportunity to grow in that department, and give the show a solid feeling. The soundtrack, opening, and ending were worth the time on its own, I´m still a bit surprised about how good they were. And the Kouta Hirano inspired art were a clear plus as well. I will definitively check out the visual novel it based on, I haven´t had the craving for a game in a while, but Dies definitively awoke up that feeling a bit. \\n\\n",
            "date": "2017-12-22T10:47:00+00:00",
            "helpful_count": 27,
            "mal_id": 265995,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=265995"
        },
        {
            "content": "So this is strange to me. I loved the 00 episode so much it instantly became one of my favorites but the rest seems so rushed that they managed to create an anime with basically no depth to the characters or story lines. \r\nThis is the kind of anime that usually rates the highest for me and it has such an amazing potential but everything turned out a little off the mark and while I do enjoy it they should have made it at least a 24 episode show and added more background instead of rushing the living hell out of it.",
            "date": "2017-12-16T01:43:00+00:00",
            "helpful_count": 11,
            "mal_id": 265324,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2784.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ThePhr3ak",
                "username": "ThePhr3ak"
            },
            "url": "https://myanimelist.net/reviews.php?id=265324"
        },
        {
            "content": "I'm proud to tell everybody that this anime has a potential to become a masterpiece, people complained about it for being too short or cutting important points in the VN, but the most common thing people said about the anime are sentences like: \"What did just Happened ?\" \"What did I just Watched\", etc...\r\nHowever \"in my case\" I'm not confused at all, the story is easy to understand, and I'm not even joking... I could only advise people to read the description/sypnosis first especially before watching and not skipping the important EP 0. This anime is one of the most unique I've ever watched... Itcombines almost all of my favourite topics: World War 2, the French Revolution  - History for short..., Philosophy, Magick, Life and Death, the Round Table, Norse Mythology, etc. It contains some intriguing elements, it is also important to analyse the subtitles/character's words in order not to get lost...\\n\\n\r\nAlso people should understand that, this anime was made, with the help of FUNDRAISING, so we should be able to understand why the anime was made that way. The art of the anime translates the overall budget as you can see, there some parts that are not smooth (in terms of frames) but still this does not mean the anime should be labelled as one of the worse...\\n\\n\r\nStory +300/10 - Its unique on its own, the theme and atmosphere is very serious, it has a dark tone at almost all the time, etc.\\n\\n\r\nArt: 9/10 - As stated above, there are some parts where frames are not much smooth, but this will never be the case for me... it's still great...\\n\\n\r\nSound: +250/10 - The Opening Song matched the anime well, BG Sounds may at often times not amuse the audience, well  that being said we can't please everybody... but for me they still done a great job.\\n\\n\r\nCharacter: +500/10 - Even though there's not much backstory shown, most of the characters are unique on its own...\\n\\n\r\nEnjoyment: 100/10 - I said it before and I'll say it again... the enjoyment this anime gives is just fine and great, one of the most unique anime shows I ever watched but of course not the best but absolutely not the worse.\\n\\n\r\nOverall 10,000/10 Its quite easy to understand (I haven't even played the VN mind you...), has a unique way of storytelling, all I can say is they had done a great job for this anime... If only the studio have enough budget, this will be one of the Greatest Anime Ever Made... I still hope for that time to come....\\n\\n\r\nNote: This is my first time writing a review on MAL, I apologised for my bad grammars... ^__^ just stating my opinion...",
            "date": "2018-05-17T04:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 280775,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7260993.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sylth_Asmodeus",
                "username": "Sylth_Asmodeus"
            },
            "url": "https://myanimelist.net/reviews.php?id=280775"
        },
        {
            "content": "Overall, Dies Irae is not an anime for everyone. Looking through comments before watching the show created doubt and gave me the feeling of searching for the imperfections in the anime.\r\nBeginning with the story, it is very complex. There are many different stories from different perspectives of characters that are followed and all intertwine with each other, however, it all surprisingly fits together. I have watched close to mid 200s, maybe even 300 series and it required quite a bit of attention to detail to fully understand the show. If you can follow along with stories well, and create sense out of it, then Idefinitely recommend this show. If anything, I wouldn't recommend comparing this anime to others due to its diversity.\\n\\n\r\nBoth the art and sound were very good. Battles were enjoyable to watch, and sounds fit in perfectly with the art.\\n\\n\r\nCharacter development through the show is on the higher end. I enjoyed how more and more is known about the characters as the anime progressed. The main characters all had great development and the explanation of the characters by Kraft explained a lot. There were unnecessary development of side characters, which did add some confusion to the overall story, but it did help in understanding intentions.\\n\\n\r\nTo sum things up, Dies Irae is a really controversial anime in the way that it touches on Nazi topics and is very complex in itself. Do not let the low rating of the anime discourage you to watch it though. If you want to see if this is a good anime for you, I'd recommend watching around 3 to 5 episodes, not including episode 0. Really hoping for a second season for this anime to see what happens after the ending and just to see what happens with everything in general.",
            "date": "2017-12-30T19:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 266933,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6844814.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Teritas",
                "username": "Teritas"
            },
            "url": "https://myanimelist.net/reviews.php?id=266933"
        },
        {
            "content": "Dies Irae is actually not as confusing as everyone says. In fact, I find it very smart. Many things are not directly told but if you have watched enough anime you will be able to grasp the situation of what is going on. \r\nAlthough the themes and genre are typical, the execution of these ideas are brought in a dark and sometimes gory atmosphere which supports it really well.\r\nThe characters are really unique and are over powered in their own ways which makes it really interesting to watch. However I agree with most people that there is not enough development and makes them see alot like only supporting characters.\\n\\n\r\nS0me scenes are kind of awkward especially with the soundtrack that is not always fitting, but nevertheless it was a good watch.\\n\\n\r\nDESPERATELY WAITING FOR THE NEXT FEW EPISODES TO AIR IN JULY WHOS WITH ME",
            "date": "2018-04-27T19:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 279170,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6336743.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hazel_daze",
                "username": "hazel_daze"
            },
            "url": "https://myanimelist.net/reviews.php?id=279170"
        },
        {
            "content": "Story: Fairly interesting, although incomplete by the last episode. It's not nearly as confusing as people are making it out to be, though I can understand thinking that it's confusing because all of the information simply isn't there. If anything will leave you scratching your head it's the last episode, which concludes \"in the middle of the climax\", as best as I can describe it. It's interesting enough and has some unique concepts, perhaps remnants of the critically acclaimed visual novel. Still, the way it is handled falls short of \"good\", and without the ONA this is clearly an unfinished production. \r\nArt: Once again, fair.It's not a high budget production, and this shows in both the art and the voice acting, but it has its moments. Acceptable. \\n\\n\r\nSound: The voice acting is overall fairly weak, and the background music doesn't stand out in any particular way. Passable. The guillotine song is kind of cool. \\n\\n\r\nCharacter: Eh. They're not extremely well developed and come off as pretty generic, but that's fine. Some of the bad guys are interesting. \\n\\n\r\nEnjoyment/Overall: An alright anime. Not something I would recommend you go out of your way to watch, but not a total failure. I will watch the ONA to see if the story gets fleshed out more. There's plenty of better stuff to spend 11 episodes on, though. Be warned that the (Funi?) translation is pretty bad, and kind of ruins a couple of scenes with awkward lines and misunderstandings. \\n\\n",
            "date": "2018-01-07T09:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 267793,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3165665.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zarmazarma",
                "username": "Zarmazarma"
            },
            "url": "https://myanimelist.net/reviews.php?id=267793"
        },
        {
            "content": "Ok so Dies Irae (Latin Word interesting choice for depicting Day of Wrath for a titled Hymn for mass of the dead). First off it isn't bad to watch at times it may appear confusing and ultimately without what is expected to be another 6 episodes feels incomplete however thats not to fret as they are expected to be released according to their website! \r\nIll keep this spoiler free as possible now assuming you may have already seen the first episode 0 if not ill also add a small bit about that here if so skip that.\r\nEpisode 0 gives us a bit of a historylesson to introduce the scenario and the bases for this anime tho it doesn't introduce us to our main characters in the full season it does give us some reasoning for all the other characters that are involved their history and a understanding of the whole supernatural/super power thing we have going on. Though you should probably watch this first as without it your going to be confused throughout a fair amount of the anime.\\n\\n\r\nOk so on to episodes 1 - 11!\\n\\n\r\nLets break it down so that its easier to get a full scope ill stay spoiler Free!!\\n\\n\r\nStory: 6 \\n\\n\r\nRight so the story has it's up's and down's, though what doesn't right? So there are a few things here that you have to understand this anime is all about power and like the saying of Kings \"With Power you can do anything\" the concept of this is very real in this world where our main protagonist has to train up and become stronger so that for all meaning of the word Dies Irae doesn't happen. Now something to mention is the pacing seems to be all over the place at times the anime is very slow and other times very fast and too much is happening. But hold on we are all confused! why on earth does nothing seem logical? Well you know those times when you don't want involvement in something and honestly feel like you don't really have any heart for what your doing till someone really annoys you well this is very much built on that emotion and as emotions go they are everywhere in this anime everything people do or there reasons are build on desire and emotions. Now long as you are able to keep up with its complex meanings as you go through things do get reveled and it does in fact make sense, also its action packed and in a cool way so if you like that sort of thing then its totally for you. With added fan service for the watchers but not anything that would be overkill it creates a lighter atmosphere at times, but let it be know that it also gets dark like seriously and attack are bloody. \\n\\n\r\nArt: 7 \\n\\n\r\nOk on the bright side its not bad on the eyes though id say around this period there are other options which are going to satisfy as eye candy this is defiantly not bad! The characters are well designed swell as the depictions of the super natural ability though the look and drawn aspects are clean the way in which some aspects were interpreted and drawn may not suit a fans wishes. This is extremely limited scenario and in the most part doesn't take effect away from the anime.\\n\\n\r\nSound: 7 \\n\\n\r\nOk interesting one i'm going to cover 2 aspects here because i checked both out for good measure i feel that even if you are a DUB watcher SUB is going to be the better option here. Firstly it sounds a lot better in the DUB there are a bunch of German accents which sound French at times and they also feel the need to actually speak in a mix of Languages at times that unless you have studied Latin may be just something you have to accept if watching this. However if you watch it in SUB then its great because you don't have to deal with all the broken german (french sounding) accents that the english speaking actors used. Otherwise the intro and end sounds were good.\\n\\n\r\nCharacters: 6 \\n\\n\r\nOk so we have 2 main characters and ill speak about each of them and then side characters as a whole.\\n\\n\r\nFujii, Ren:\\n\\n\r\nThis guy is interesting in a way that i have no idea what his though process is tho he has pretty good ideals as a human being to say the least. He feels committed to take on a task that he really doesn't like and doesn't want to be part off though he is forced into it wants to protect those that he cares about and cannot except what is going to happen. Plus he has a great female lead to work with when she eventually shows up so here we have Marie. \\n\\n\r\nMarie:\\n\\n\r\nOk so she's great intact without her this anime would bomb as she draws at least some meaning for what is going on in the anime as well as plays a vital part like well he needs her what can I say! She has a personality that changes and really is noticeable throughout the anime, though she doesn't show up right away only appearing in clips every now and then in the beginning to later be explained (when you watch that is not by me).\\n\\n\r\nSides: \\n\\n\r\nOk actually one of the sides if not 2 could be main characters as well they are pretty important and one of them may even get more air time than our female star! However her role as mostly a bystander won't fill that cut necessary of this title, these characters make up the friends, allies and enemies of the main couple in the anime and support them and the events as you move forward. \\n\\n\r\nYou Say -  \"Hmm well thats what you would expect of side character!\"\\n\r\nPrecisely!\\n\\n\r\nEnjoyment: 7 (My Personal enjoyment level)\\n\\n\r\nI enjoyed watching it because I watched it all the way through in fact I can't wait for the next 6 episodes to be released would I say its the best thing iv ever watched? No! But it isn't a bad watch either in actual fact I rate this about 6.8 and for the overall rating we round that up to 7. I enjoyed the action element to this and the phycology behind it. There are a lot of element that made me want to keep on watching throughout the series to see what would happen next and each episode sets off from where the last finished so its not episodic another thing I like in an anime. If you have time give it a watch a lot of people will like it is it for everyone? No! But is it worth watching? Yes!\\n\\n\r\nI hope anyone who read this found its useful i tried to be as neutral as possible when writing this as to give a review showing both sides good and bad of the anime and wish those who do watch it enjoyment!\\n\\n\r\nThanks for reading and have a Happy New Year!!\\n",
            "date": "2017-12-29T12:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 266789,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5031999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Suzune-Horikita",
                "username": "Suzune-Horikita"
            },
            "url": "https://myanimelist.net/reviews.php?id=266789"
        },
        {
            "content": "Dies Irae is absolutely one of my favorite typical dark fantasy visual novel, i got excited after hearing this one got anime adaptation... however, my hope got down so fast after watching the first episode.\r\n(i'm going to avoid the spoiler)\r\nStory 4/10:\r\nDies Irae has a great story, however.. the anime skip so much detail and feels like they just throw a pieces of puzzle at a random place, you could enjoy watching it more IF you played the VN, but if you didn't.... trust me, you can barely understand the story, or worse.. you can't understand it at all. Plot twist is one of its greatestasset(as a VN).. but the anime twisted the plot so much that you can't even see it.\\n\\n\r\nArt 3/10:\\n\r\nNothing to say, the Art looks poor for even for 2000's anime.\\n\\n\r\nSound 6/10:\\n\r\nThe Voice Actor/Actress is good, they enlist a pretty good cast right here, all the theme used really fit its natural dark fantasy atmosphere. When the theme kicked in some of the fight scene(eventhough the animation are kinda poor), it feels intense and could give you a chill down your spine.\\n\\n\r\nCharacter 6/10:\\n\r\nThe \"MAIN\" Character is probably the lion part of the series, First.. you need to know that the anime is based on Marie Route, personally i think.. this route is where Ren got most character development. The anime really did a good job with Sakura and Marie, and shiro too, although some support character looks rather bland and need more screentime, but it's fair at least.\\n\\n\r\nEnjoyment 3/10:\\n\r\nThis probably isn't the case if you watch it several times, but for the first-timer, you probably couldn't enjoy it that much... this is a kind of anime that required you to watch it several times before you could solve the twist. For those who have played the VN, they probably will enjoy it more... But yah... still not some \"jawdropping\" material.\\n",
            "date": "2018-08-08T00:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 285875,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4645412.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ArruhuNatoryu",
                "username": "ArruhuNatoryu"
            },
            "url": "https://myanimelist.net/reviews.php?id=285875"
        },
        {
            "content": "This Anime had so much potential it actually hurt me. The nazi theme it has going was pretty cool but man the execution of the interchanging characters/story was essentially a cluster of confusion.\r\nToo many things going on at the same time and many things not being explained. I feel hurt because I WANTED to like it more than I did I could see the great potential within this Anime. They creators don't explain the plot to the point where the viewer is not in total darkness.\r\nAll the characters seemed pretty interesting but yet again because they don't explain enough of where the story was goingand how it got there you don't care as much as.\\n\\n\r\nThe music was pretty good at least.\\n\\n\r\nStay away from this one it's not worth it.",
            "date": "2018-02-19T03:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 271921,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1465385.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ruggarell",
                "username": "Ruggarell"
            },
            "url": "https://myanimelist.net/reviews.php?id=271921"
        },
        {
            "content": "I discover Dies Irae with this anime, and I have only one thing to say: I was not disappointed. I take this anime as an introduction to my future reading of the work.\r\nWhat to think of this Anime? I liked all the characters, each with its history, its characteristics, its personality and its background that I will enjoy discovering in the visual novel.\r\nI do not understand why there is so much hate on this adaptation, especially since the producers have totally assumed to have great problems. If it starts on a crowfunding, how can you believe for a single second that the adaptation will beof high quality? On a Visual Novel which is very long and has several purposes? Instead of yelling like idiots no matter how, look at the bottom of the thing to understand the current situation. I think we have to see these episodes as a test, the next 6 ONA episodes will be there to deepen the story and I'm happy.\\n\\n\r\nOverall, I am satisfied. Endearing characters, very good music, a perfectible animation but not ugly.\\n\\n\r\nI think we criticize this anime very easily without understanding the difficulties behind, it sure changes the anime fan service nowadays with stories seen and reviews, and it does not bother the same people criticizing Dies Irae. .. and studios that do not have the means to produce good adaptations of Visual Novel do not take up the budget, publish a really bad adaptation, and for the case of Dies Irae, producers have to assume until end, we ask for money via a Crowfunding to at least please the fan and try to bring a new audience for the works of Light, and who is pointed at and criticized? It's them strangely, and I think it's stupid, yes I say that vulgarly, but it's really stupid for a studio that has at least produce to please the fan, to assume all the difficulties of production but despite all have done that to please the fan.\\n\\n\r\nI can not wait for a second season.",
            "date": "2017-12-22T16:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 266033,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4765344.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/UltimaWeaponEX",
                "username": "UltimaWeaponEX"
            },
            "url": "https://myanimelist.net/reviews.php?id=266033"
        },
        {
            "content": "So, I really don't know what's going on ten out of the episodes in, yet I'm enjoying it in its entirety.  The characters are hard to keep track of but I know that I like them, the art is pretty phenomenal in the fact that it's so vast and crazy. Though, storywise every time I feel like I finally understand what's happening they throw some curveball out of left field at me like I'm in the writer's room and have express knowledge of backstory.  This wouldn't be a problem if it served a plot device but so far it really hasn't. However, istill sat down and binged it so I'd say it's doing something right.",
            "date": "2017-12-18T23:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 265559,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6815571.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Blacksept69",
                "username": "Blacksept69"
            },
            "url": "https://myanimelist.net/reviews.php?id=265559"
        },
        {
            "content": "To be as clear cut as I can be. I don't understand how people are thrashing this anime so indiscriminately, but I can say that most of the people there are not very well off in terms of what they might like. It wasn't confusing, misleading, nor was it jittery or broken in terms of plot. It went exactly as how the author intended, and to be honest, this one was a work of art. To actually understand it correctly, you need to watch it all, start to finish. That's the main problem with the group surrounding this. I think that's also why most ofthe people here have rated it poorly, as they don't actually conceive an opinion based on the whole, but rather bits and pieces. Think of it like this, a symphony. Something slow, melodious, but picks up and reaches that tempo of crescendo until it hits the climax, where it falls off and leaves those watching needing more. That's the kind of drive that I got from this. But I will say inexperience with literature can make it a little hard to follow, but that's also because you need to search for the plot directive while you follow, and the conclusion you reach in this particular work is simple. One might want to paint it something else, or to give it a name unfitting to what it is perceived, but that remains to what the watcher wants to learn from it. My opinion won't change, and will still be a 10/10 for myself.",
            "date": "2018-07-02T02:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 282760,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Steven_Pugh",
                "username": "Steven_Pugh"
            },
            "url": "https://myanimelist.net/reviews.php?id=282760"
        },
        {
            "content": "Warning Major spoilers below\nWhere to start, I found this anime by chance on YouTube as I was scrolling through my recommended and decided 'hey' I'll watch this it looks interesting why not? however I came to regret that decision later.\nWhilst the art and sound is great I have a problem with the overall story due to its lack of an explanation about the background of his Powers and why he is connected to a spirit of a girl killed by a guillotine.\nThen there is no explanation as to why the 13 Nazi group members want to destroy the world and why they are fighting againstthe main character.\\n\nFinally there is the ending, for some reason the ending was so abrupt it left me more confused that I was before I started the anime. I'm not entirely sure why they ended it when they did but I'm assuming its due to the lack of positive feedback it received. \\n",
            "date": "2018-02-26T08:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 272498,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6931580.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kevin_Leafy",
                "username": "Kevin_Leafy"
            },
            "url": "https://myanimelist.net/reviews.php?id=272498"
        },
        {
            "content": "What a disastet.....\r\nWhen I first saw the first episode I stoped watching this series. However recently I have been on spree and watching most animes I have on my list I have not seen yet, and unfortunatly for me this was still in my list...\r\nAnd too be frank I regret it soo much, I could have spent the time I wasted on this watching something good or masterbating. I highly reccomend if you have a choice between this anime and fapping, too go with the lader.\r\nutter garbage!\r\nI mean comeon, the story is shit, the characters are shit and the cinematography is awfull. \r\nDo yourself afavor and DON*T watch this garbage!",
            "date": "2018-01-24T10:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 269510,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3531387.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/nexeriv",
                "username": "nexeriv"
            },
            "url": "https://myanimelist.net/reviews.php?id=269510"
        },
        {
            "content": "This is the first time I'm gonna write a review just to show up how salty am I.\r\nReading the plot was a good surprise: soviets, nazis, WWII, super powers, mystery and magic. Good enough to caught me up to watch it. Ok, 10 minutes of the 1º episode and I didn't understand what I saw. Too much bright, too much people who wasn't introduced, too much of nothing. The art was ok and the sound was good but I just don't even know what was happening! Where is the things I read on the plot? Dies Irea is a complete mess. The show is waytoo rushed and became so confusing. I don't know if I'm too old or anime was always like that. Dropped.",
            "date": "2017-12-29T13:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 266794,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5389285.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/sadnsorrow",
                "username": "sadnsorrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=266794"
        }
    ]
]