[
    [
        {
            "content": "Goshuushou-sama Ninomiya-kun, is just one of those shows that you probably shouldn't like but you do anyway.  Even for an echii show this is pretty over the top at times.  It’s full of swimsuits, bouncing boobs, and moe.  If you like those themes then you’re really going to love this.\r\nThe story is pretty weak overall though it does have a premise that is fairly unique.  Mayu Tsukimura is a succubus, who pretty humorously suffers from a fear of men, well except one, our hero Shungo Ninomiya.  The story starts with Mayu's brother and Shungo's sister having him protect her fromzealous boys drawn to her by her succubus power she can’t control and helping her overcome her fear of men.  This puts our mains in plenty of echii situations, such as being forced to sleep, bathe, fondle and other silly sexual situations. To tell you the truth as much as this anime was geared towards the sex drive of young men I still found these situations quite funny.  Of course there is always a rival, and Reika Houjou, a rich spoiled girl who is in love with Shungo, fills that role.  Even taking a demeaning position as a maid in his house to keep an eye on his relationship with Mayu.  There is a series of dreams that unfold as the show progresses that reveal more and more of the motivations of the characters.  This becomes the real story and the show becomes less and less about what it starts out as. \\n\\n\r\nMost of the characters of the show really stand out and are exceptional.  I really enjoyed them and their antics are hilarious.  They don’t have a tremendous amount of depth which is why I only give them a good rating.  Probably because the series is short there isn’t much development or back story.  We never really find out more about the succubus' or why there seems to be so many running around.  Reika probably is the best developed character and you can see actual growth with her as the series comes to its conclusion.  But like I said, they are just fun to watch!\\n\\n\r\nThe animation I felt was really great.  Very cute character designs and shockingly no loli's!  They are all high school age and they actually look it.  Mayu especially is drawn to bring out the moe feelings in all of us.  This is reinforced by her voice acting.  I just wanted to grab her and snuggle with her too!  All the other acting is very good too, usually there is always some character whose voice gets on my nerves but not so in this series.  The songs are all very catchy and fun too.\\n\\n\r\nOverall this show isn’t going to win any awards for depth or make you smarter.  This is pure eye candy.  It’s a must watch for anyone who is a fan of echii/harem genre but I think also for anyone who wants to watch a lighthearted comedy.  Your experience may vary but I don’t see how anyone could \"hate\" this show.\\n",
            "date": "2008-11-30T12:07:00+00:00",
            "helpful_count": 173,
            "mal_id": 9967,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=9967"
        },
        {
            "content": "If someone were to take all the most popular elements of a typical harem anime, add nothing new and make a new show out of it, you would end up as something like Goshuushou-sama Ninomiya-kun. Coming from the same studio that produced Girls Bravo, this isn't all too surprising to be fair.\r\nStory\r\nThe story is pedestrian by most standards for the harem genre. The focus is primarily on the daily life of Ninomiya Shungo, and is really only pushed forward by his recalling of long suppressed memories of his childhood. There are a couple moments in which the plot strives to be something greater than istypical, but those are short-lived.\\n\\n\r\nArt\\n\r\nThe artwork is solid if unspectacular. Character designs are fairly average, although at times quality degrades significantly despite this only being a 12 episode series. More money may have been spent on the commercial break fan service than on animation, which while quite good, detracts from the show as a whole.\\n\\n\r\nSound\\n\r\nThe OP theme is catchy for about the first 45 seconds then falls off at the chorus. The ED theme, not so much, and as a result can be easily skipped without regret after hearing it once.\\n\\n\r\nCharacter\\n\r\nThe main character, Ninomiya Shungo, is not the everyman typical of the harem genre. He's quite capable in a fight, but then again, so is every other male character with any plot significance. He's also extremely popular with all the girls at school vying for the attention he would rather not give anyone. The two women fighting over him are Tsukimura Mayu, a succubus with androphobia and feeds of the life force of men, and Hojo Reika, in the tsundere role. Most any other character in the series is an archetype that has been seen before.\\n\\n\r\nEnjoyment\\n\r\nFor a harem show, the series does have some good moments. There's a certain absurdity to some of the comedy. The omake segments in some of the episodes are well worth watching. Other times, however, the story dragged on and on for long periods, or worse, forgotten just minutes after watching the episode.\\n\\n\r\nOverall\\n\r\nIf you are looking for a harem anime that in no way challenges the sensibilities of the viewer, this could be well worth a watch. It's fairly good at what it does in that it sticks to genre conventions. Could this series be better? Probably, with a little bit more money for animation, but honestly, it provides plenty for anyone who would possibly be interested in watching this in fan service alone. And really, what more could you possibly ask for from anything in this genre.\\n",
            "date": "2007-12-20T20:28:00+00:00",
            "helpful_count": 83,
            "mal_id": 1634,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25775.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EmperorJ",
                "username": "EmperorJ"
            },
            "url": "https://myanimelist.net/reviews.php?id=1634"
        },
        {
            "content": "Goshuushou-sama Ninomiya-kun\r\nIs it ok for me to have enjoyed this anime even though i felt the anime was nothing more than fine? i still don't know what kept me entertained not even why i wasn't bored by this...\r\nStory\r\nI felt the story could be better developed, as i was watching i thought that they were forgetting to give us the story and gave us filler episodes and not moving forward to the point, just the first three episodes points you who's who but you don't know the why of a lot of things, eg. about the story, the characters, some happenings etc. and yeah it canbe predictable on some things, but just because of that, it doesn't mean that you have to figure out what's happening without any backstory, but i have to point that some things weren't predictable and mislead you to think the opposite of what's really happening, maybe the last two episodes clears the things, but they should have done it in the middle eps. and make it more interesting to see, it was slow paced and they put almost everything in the end, and the ED felt rushed, shouldn't have ended like that way. Overall was fine.\\n\\n\r\nArt & Sound\\n\r\nThe art style looked better when they presented the cuts from part A to Part B, i think that's from the Light Novels, it was beautiful, such vivid colors, really made me wanted to see the LN, but in the anime was average. \\n\r\nSound was very good with the voice acting Miyuki Sawashiro is a VA that i liked, i know her from a lot of animes i have seen and yet to see animes where she's in but the background music, OP and ED were meh, overall was fine.\\n\\n\r\nCharacters\\n\r\nI didn't liked the characters that much, they weren't well developed for what i already stated above, where you get to know about them just in the last episodes, and that should've been in the course of the first episodes not in the end, but Ninomiya was likeable just at first, then i lost that interest on him as a character, he was a little slow making conclusions despite being good at fighting or other things, Mayu and Reika were ok but because of what i already wrote, they were just interesting in the last episodes, support characters were good, overall was fine.\\n\\n\r\nEnjoyment\\n\r\nI somehow enjoyed this, a good enjoyment, is just that they failed to develop everything, maybe it was the comedy or the funny situations, but i wasn't bored and for a run is ok, but i want to think that the Light Novel is obviosly better with such beautiful art style and really stand out colors and a better paced story.",
            "date": "2015-08-20T02:33:00+00:00",
            "helpful_count": 21,
            "mal_id": 196600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=196600"
        },
        {
            "content": "*was redone\r\nstory:\r\nIt was kinda weak, but good enough for me to enjoy it. It seriously made me root for something bad to happen sometimes.\r\nart:\r\nPretty much the worst part of the anime. It looked pretty bad, but it wasn't unbearable though. The designs for the characters were pretty lacking except for the design for Mayu. Reika was probably the worst of all even considering all of the supporting characters.\r\nsound:\r\nI really liked the sound. The OP was really good for it. And the ED (which is usually pretty much ignored by me) was pretty enjoyable to watch.\r\ncharacter:\r\nNot enough developement. At first they were developing great but thensomewhere in the middle they just plainly stopped advancing at all. It was just like someone sitting in one place all day, not moving very much. Plus the addition of Reika's other personality totally ruined it. That was probably the point where all character developement really fell downhill.\\n\\n\r\nenjoyment:\\n\r\nEven though the show had all those flaws, I still enjoyed it to the max. I really liked Mayu. And basically watching Mayu in all of those scenes really helped me finish the anime as fast as possible. Those little stories at the beginning of the show were entertaining, seriously. The ministory with Reika in it was hilarious. The only thing is that it felt kind of incomplete at the end. But, that's how anime like these usually end anyways so it's to expect.\\n\\n\r\noverall:\\n\r\nWouldn't suggest this for people who hate ecchi cause it has a lot of it in here. It has a few fight scenes, but they weren't too fulfilling. Developement was bad, I hated the Reika's other personality though. It gets annoying at times but I still like it, the anime should get some emotion out of me and it gets a plus in that area. Even with all these flaws it still is one of my favorite anime. Don't know too well why, but I just really like it.",
            "date": "2008-02-02T15:12:00+00:00",
            "helpful_count": 19,
            "mal_id": 2286,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/34979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GoshuushoSama",
                "username": "GoshuushoSama"
            },
            "url": "https://myanimelist.net/reviews.php?id=2286"
        },
        {
            "content": "Story\r\nThis is a romantic comedy, with some harem elements. I was therefore quite surprised that the show actually had a little deep story, some episodes in. It definitely didn&rsquo;t turn out as a regular harem, etc. Most of the episodes were pretty random, but they all lead to the ending, which I thought was quite neat. The comedy was most prominent, but it also had a slice of drama, and a bit of irregular romance. But at one time it was a bit ridiculous, with succubuses popping out from every corner. Although, it didn&rsquo;t affect the story as a whole.\r\nArt\r\nThe animation was clean and lookednice, but in my opinion it wasn&rsquo;t really top notch. It was as good as it was needed, to make this into a decent series.\\n\\n\r\nSound\\n\r\nThe OP wasn&rsquo;t particularly memorable to me, but the ED was a bit catchy. Background music wasn&rsquo;t that prominent, but it worked out quite well. The music built well upon the comedy, though.\\n\\n\r\nCharacter\\n\r\nI thought the characters were likable, very likable indeed. Shungo wasn&rsquo;t the typical guy in a harem-anime, and Mayu was just hilarious. Reika was a bit too tsundere for me, but it worked out fine with her. The side-characters fitted in nicely, as well, and there weren&rsquo;t any characters I disliked in the end.\\n\\n\r\nEnjoyment\\n\r\nThis show was really entertaining, and really funny, and I finished it in quite short time.\\n\\n\r\nOverall\\n\r\nIt was a good series, non-typical harem, and very funny. I wouldn&rsquo;t really mind if there was a second series, and I guess most persons would like this anime. Watch it and enjoy.\\n",
            "date": "2008-02-28T06:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 2775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24232.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/martusf",
                "username": "martusf"
            },
            "url": "https://myanimelist.net/reviews.php?id=2775"
        },
        {
            "content": "Another average-class addition for the harem/comedy genre. The anime doesn't excel in anything specifically, but it's at least enjoyable.\r\nThe storyline is very typical: the main male character is surrounded by women that like/love him, yet he doesn't seem to acknowledge any of them. In this case, the only twist is that there are only two girls that fight for him, and that both shared a common past with the male character, though he forgot about it. The art style is just standard; nothing astonishing nor dull. I did feel uneasy about the way female eyes were portrayed, it just didn't seem right. The opening andending songs are just alright, I guess they suit the serie. Character development is exclusive to the three main characters, leaving every other one as if they came out of the blue. Even so, I'm not saying that they were developed fully, they only explained the very essential to understand the plot and it's outcome.\\n\\n\r\nI approve of this anime, it's enjoyable overall. It has some ecchi, though not explicit, and some comical parts. If you have the time and interest, watch it; if you don't, you're not missing much.",
            "date": "2008-08-26T19:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 7467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44786.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/erwinmm89",
                "username": "erwinmm89"
            },
            "url": "https://myanimelist.net/reviews.php?id=7467"
        },
        {
            "content": "This is one of my first reviews ever so don't be harsh!! lol :)\r\nWhen I started to watch this I knew it was going be a harem/ecchi like all the others, but I thought this anime had a charm to it. \r\nI loved the characters and I thought the opening and ending of the anime was brilliant!! Sure it has its bits where girls have big boobs and tight tops, but thats a harem for you!\r\nI thought the artwork was good and the story line was abit cheesy but likeable.\r\nOverall a very funny and charming anime to watch\r\nHope this review is ok ;)",
            "date": "2010-04-07T03:49:00+00:00",
            "helpful_count": 8,
            "mal_id": 24776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313388.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Usagi-long-legs",
                "username": "Usagi-long-legs"
            },
            "url": "https://myanimelist.net/reviews.php?id=24776"
        },
        {
            "content": "[Notable picks: \r\nfanservice:8 l ecchi:9 l supernatural:6 l consistency:2 l clarity of plot:3 l harem:6 l school life:1 ]\r\nVery random. Large number of plotless episodes. Unrealistic. Exaggeration. Confusing plot.\r\nStory:4\r\nIn the beginning, there were a lot of exaggerated scenes, containing a \"wow\" factor.\r\n There also seemed to be a plot, one to save Mayu from her uncontrollable powers. But after the first or first few episodes her power seemed non-existent.\r\n Then another main female character seems to have some \"secret\" in one episode. A few episodes later we see the \"secret\" coming back again and that was the beginning of the end. \r\nAnd then another newconcept came out: Ninomiya's past. \\n\r\nWell, aside from varying storylines, flashbacks that make little sense keep flashing throughout the series, which were only explained too late imo.\\n\r\nI felt that there were more fanservice or plotless scenes than scenes with plots. Beware.\\n\\n\r\nArt:8\\n\r\nNicely drawn, animation was good. Easy to recognize the different characters cos they were drawn very differently. Background was drawn well too, along with special effects.\\n\\n\r\nSound:6\\n\r\nBoth OP and ED were quite good, but I dun really agree that they are fitting, especially the ending, which seemed to fit more as an OP. Sound effects, voice acting was good, expressive but not spectecular.\\n\\n\r\nCharacter:3\\n\r\nKudos on having a character with 2 personalities (bipolar i think). Other than that the characters seem too easygoing, supernatural, mysterious, or downright random (as in personality keeps changing thruout the series). \\n\\n\r\nCharacter development was lacking for several characters, including the main ones. There were too many scenes where a lot of characters were pulled together just for impact, eg. for fanservice or the concluding episodes, so much so that some of them seem like just extras.\\n\\n\r\nEnjoyment:4\\n\r\nToo much ecchi, fanservice and plotless episodes. Confusing flashbacks and sudden changes to the characters' powers cause much questions to surface. Was pretty much watching the episodes just to see if the original \"possible plot\" could be picked up again. \\n\\n\r\nThe short clips at the start of every episode sometimes were a bonus, but sometimes ended with a cliffhanger or just proved too lame to laugh at.\\n\\n\r\nBut the beginning and ending episodes were still quite good.\\n\\n\r\nOverall:4\\n\r\nAfter finishing the series, I was left with an empty feeling. Too many questions about the series. Felt like some time was wasted watching fanservice. But, it's still interesting though, so I completed it, although I skipped some scenes.",
            "date": "2010-03-14T04:23:00+00:00",
            "helpful_count": 8,
            "mal_id": 23969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=23969"
        },
        {
            "content": "When it comes to Succubi in anime, the interpretation can vary in a number of ways.  On one hand, we have Astarotte's Toy, which involves a succubus at the age of 10 (don't ask me why that age), needing to build up her male harem for reasons I need to keep censored; and on the other, we have Rosario + Vampire, which involves a more developed and outgoing succubus named Kurumu, who can only have one mate in her life.  And then we have Goshuushou-sama Ninomiya-kun, an anime that has way too many succubi, and a rather interesting plot.  \r\nStory (7.52/10): Thisanime for the most part does have a decent plot.  The story of Good Luck Ninomiya-kun, as it is known in the english version, is about a boy named Ninomiya Shungo, who is some sort of martial artist badass, considering the fact that he beats up a bear in the first episode, who finds himself in a predicament of having to take care of this cute and rather large chested girl named Tsukimura Mayu, and help her get over her androphobia by doing various \"relationship-esque\" things with her.  Along the way, a 3rd year by the name of Houjou Reika somehow makes herself involved in their affairs by becoming the house maid, and the story of this love triangle continues onward.\\n\\n\r\nWhile this synopsis is fairly standard in terms of how the character relations are set up, the actual plot itself is a roller coaster; meaning that it has its ups, downs, spirals, and unexpected twists.  What the series does do, is integrate a backstory for the three main characters, and develop a sort of connection between them all, as this backstory provides a main focal point towards the end of the series.  While the backstory was cute and all, the fact that we only got bits and pieces at the beginning, followed by some really heavy hinting as the series went on, was infuriating.  What I mean is the fact that we had characters mention the actual backstory constantly, like \"I won't forget what you did to me 10 years ago\", over and over again for 3 episodes.  It was so ridiculous to the extent that it would make any normal watcher crazy due to how teasing it was.  \\n\\n\r\nOn the flip side from the main story, we have side episodes.  Several episodes throughout the series were pretty much just pointless side story, which made me felt like I was wasting time watching this series.  Especially since this anime is only 12 episodes long, using every minute to explain plot and do what you want to accomplish is pretty crucial.  \\n\\n\r\nOverall, I felt as though the story was at the very least watchable.  There were a couple of facepalm moments and complete utter waste of time moments, but the majority of the series proved itself to be ok to watch.  The pacing was decent, and nothing felt particularly rushed, but I just felt like some parts of the show could've received a bit more explanation for a few of its points since some things felt ridiculous even by anime standards.\\n\\n\r\nThe end I felt like was a bow to the series (not a nice looking fancy bow, but just a normal one), as the actually end was a close to the series, just not the most wonderful close to a series ever.  Apart from that curveball that I did not expect, the end was rather generic, but somehow really befitting for this series.\\n\\n\r\nOverview\\n\r\n+  Decent main story\\n\r\n+  average pull off of a back story\\n\r\n-   Too little explanation of certain plot points\\n\r\n-   Pointless side story\\n\r\n-   unexplained details\\n\\n\r\nCharacters (6.83/10):  Ninomiya Shungo as the main protagonist is a rather interesting male lead.  Compared to a majority of male leads that I've seen in romance-related animes, this guy can most definitely pull his weight.  He is shown to be a rather determined and caring person towards the people he cares about, and is generally a decent character.  When he's not somewhat dense.  Compared to a lot of male characters, he's not completely oblivious to the fact that he's got 2 girls that basically live with him crushing on him at the same time, but he's still oblivious to this fact.\\n\\n\r\nTsukimura Mayu is generally what you would expect of a cute, dandere character.  She is most certainly a dandere, being only proactive in the series at the end, as well as being an androphobic, meaning she does not like to deal with men.  Other than this, there's not really any other way of explaining her, since she is that damsel in distress character that Shungo sweeps in and saves at the very last second.  Which, when you have a martial artist badass having to save you from various threats cause somehow your brother is an international terrorist, being saved happens quite often.  \\n\\n\r\nHoujou Reika as the last of the character trio is a tsundere character that is more explored than Mayu.  While I don't necessarily like the route that the anime put her on, (considering the fact that she's a stalker half the time), I find her to be a lot more interesting and more developed than Mayu because of the fact that she was affected by the aforementioned backstory that isn't explained until the very end.  Apart from that, she's also a Oujo-sama character too, and I just feel like she wasn't put beyond the pedestal that she was given at the start of the series, since the only development she actually gets only appears at the very last few episodes.  \\n\\n\r\nThe side characters in this anime are heavily one-noted, being a bunch of troupes and pointless people that I personally could care less about.  There's only perhaps one or two that I feel like actually matter, since some of the supporting cast basically show up in almost every scene and add more to a perspective character and develop them in the process.  Mostly though, they're just plot devices.  \\n\\n\r\nOverview\\n\r\n+  Above average male lead for a romance-related anime.  (Since most of them are crap.)\\n\r\n+  Some character development\\n\r\n-   Very troupe heavy cast\\n\r\n-   Mainly useless side cast\\n\r\n-   Underdeveloped main cast\\n\\n\r\nArt and Sound (6.98/10):  The art for this series is a standard looking look.  The actual color palette and detail aren't particularly outstanding, but as aesthetics, they look rather decent to look at.  One thing that I feel is a turn off for a lot of people, is the very moe-looking females.  Every female in this series has those large, moe eyes, and if you're not a fan of moe, or hate it, this isn't a series for you.  \\n\\n\r\nEcchi section (I do this for any ecchi show I watch.): What surprised me about the ecchi was the fact that there wasn't an excessive amount of it.  Sure, there was some here and there and some scenes that would have you watch this in your room alone when no one's looking, but for the most part, this series isn't too aggressive in terms of showing its audience the naked bodies of their female character. (I just wrote that, didn't I?)\\n\\n\r\nFrom a musical aspect, the series had a very hyper and very generic OST and ED.  They're cute and all, but they really aren't as catchy as one might think.  Apart from that, the series does have this mystical woodwind music that actually sounds pretty decent.  It's not the most memorable thing to take from this show, but the music does appear quite often, and it gives a whole other tone to this anime.\\n\\n\r\nOverview\\n\\n\r\nEverything is average.  There's no real positives or negatives to the aesthetics of this series.\\n\\n\r\nPersonal Enjoyment (7.02/10):  I wouldn't say that I disliked this series, cause I did finish all of it and was rather pleased with myself after I had finished, but I wouldn't say I truly liked it.  It wasn't by far the best series that I've watched, but it wasn't the worst.  Apart from the pointless side story episodes, which I hate in any anime in general, the story was rather executed well, and I was able to follow along with it rather easily without any trouble whatsoever.  I will say however, that I wasn't a fan of some of the plot points and focuses that the series had, such as the entire middle arc, as well as some of the absurd parts of the story, that I felt like needed a bit of explanation because there are some confusing scenarios in this series.  \\n\\n\r\nIf you don't mind moe, ecchi, missing plot, or even generic anime troupes in general, then you might actually like this series.  If any one of those you hate with all your heart, this probably isn't the first choice for you.  Personally, I feel like this series is a good time killer, and nothing more.  However, I will put a disclaimer that there are a few scenes that get my seal of approval for being disturbing and overall strange, so bear that in mind. (Ex.  A man wearing a bunny girl outfit.  Yeah, that exists in this anime.) \\n\\n\r\nOveral Score: (6.73/10)",
            "date": "2014-03-25T16:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 136975,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136975"
        },
        {
            "content": "I can say that this was a bit of a surprise, it was better than i expected. Overall i like ecchi anime and stuff like that. You get what u want here, boobs, swimsuits and i did get a good laugh. What i was surprised about was the story. Most of you know that most ecchi anime don't really have a true storyline and all and most of the time the story is in the last episode. This one however is a little different which i liked. The basics of it are that Ninomiya is trying to help Mayu with her androphobia and they dosome crazy stuff. At first it may sound like its no different than other ecchi anime. But the story progresses through the all the episodes not just the last one. You see flashbacks and learn new stuff about their past that lead to the ending. The story itself is also unique and interesting for this kind of anime but i don't want to spoil anything. The art/design and sound was really good. The OP/ED was also catchy. If you like ecchi and harem then surely you will like this.",
            "date": "2010-12-29T06:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 33172,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325144.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DamiPL",
                "username": "DamiPL"
            },
            "url": "https://myanimelist.net/reviews.php?id=33172"
        },
        {
            "content": "Okay i'll keep this short watch this Anime it will change your idea on ecchi instead of being rather perverted like most of them this anime has ecchi to a certain extent but it doesnt over do it. For instance how most echii animes have most character in somewhat revieling clothing this one only does that to some extent. In all i gave this Anime a 9 out of 10 which is pretty awesome and a must see.",
            "date": "2008-12-26T03:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 10645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125500.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gamester163",
                "username": "gamester163"
            },
            "url": "https://myanimelist.net/reviews.php?id=10645"
        },
        {
            "content": "Story: The anime starts off by introducing us to Mayu Tsukumira a sucubbus with a problem.  She can't control her powers well enough and attracts men to her and she's afraid of them.  Ninomiya Shungo is the man who's supposed to help her with her problem and so starts his \"crazy\" life.  The story seems good and interesting but throughout the anime I felt that it started to stray from its main point and become something else, and I felt that the directors should have stayed more true to the plot.  \r\nArt: The ecchi scenes are done nicely and is whatsaved me from rating this anime a 6 or below.  \\n\\n\r\nSound: The sound matches most of the scenes and is pretty decent.\\n\\n\r\nCharacter: I felt that the characters didn't undergo much character development because after one episode the characters might change a bit, then go back to their same old cycle or routine and not be honest with their feelings.  Toward the end however we see the characters shape up nicely, so that makes up for it.  I also felt that some characters were just random objects popping out of nowhere and it's like whats the point of introducing him so late or even putting them in there? (Yes im talking about you green haired guy who i forgot what your name was -.-)  So on the character part 7\\n\\n\r\nEnjoyment: So far this anime seems alright but the end starts to seem like it turns away from its genre and tries to become something it's not.\\n\\n\r\nOverall: If your looking for a good rom com harem anime then this might be for your.",
            "date": "2012-03-15T16:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 56051,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/413122.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/thejosh18",
                "username": "thejosh18"
            },
            "url": "https://myanimelist.net/reviews.php?id=56051"
        },
        {
            "content": "Ninomiya is your typical two girls after one guy plus lots of accidental ecchi moments. It's about a not-so ordinary high school guy and his meetings with two not-so ordinary girls. There is a fair amount of suggestive material, though it has been far eclipsed by the ecchi works of today.\r\nThe actual show is pleasantly enjoyable if you can tolerate the overflow of old school fan service and the inconceivable nature of the entire situation. The majority of the show just introduces the characters as they go on mini-adventures before culminating in a substantial climax near the end.\r\nOverall, this is a decent at best watchfor those who can live with some fan service. This is a really crowded genre, and this particular work just doesn't stand out much.\\n\\n\r\nAnimation:\\n\r\nThe animation was probably crisp for its time but is definitely outdated by 2015 standards. Colors are nicely toned though a bit over-saturated and the characters are well proportioned (and I don't mean that in an ecchi sense), and still quite cute.\\n\\n\r\nThere is a fair amount of action in the show though obviously the only reason you'd venture here is for the ecchi. And to be honest, if that's what you're looking for other shows do that better as well too.\\n\\n\r\nSound:\\n\r\nThe sound of the series is pretty average. The OP isn't bad but not that memorable. The ED is actually better though there is a bit of ecchi-ness in the visuals. The BGM fits the mood nicely but isn't anything outstanding. As for voice actors, Mayu has a very high pitched voice (which some might find cute but others annoying). Overall, the VAs did a very good job, especially Miyuki Sawashiro for giving a pompous, arrogant attitude for Reika.\\n\\n\r\nStory:\\n\r\nNinomiya is yet another show about a somewhat timid guy with a girl literally falling onto him. It focuses on the relationship between Ninomiya kun and the two girls Reika and Mayu. As with many other shows, it involves the main character's long lost childhood memories.\\n\\n\r\nFor the most part, the series consists of mostly stand-alone episodes where viewers learn a little about Ninomiya and the girls, who end up living in Ninomiya's house. Mayu is afraid of men and so Ninomiya is used as the \"tool\" for her to get used to guys. This often involves unusually ecchi situations that may offend some viewers. Near the end of the series, a great deal is revealed about Ninomiya's past and how the girls play a part in it, culminating in a fairly intensive climax in the last episode.\\n\\n\r\nOverall, the story could have built up to the last few episodes a little better and the ending leaves an inconclusive feeling.\\n\\n\r\nCharacter:\\n\r\nFirst of all, I will note that nearly all of the characters in this series are irregular (including unusual martial arts abilities, succubi powers, or an oddly aggressive personality (sexually) etc.).\\n\\n\r\nNinomiya is a popular high school boy who lives with his elder sister. Both are apparently highly skilled martial artists and essentially super-soldiers. However, he tends to be weak/timid around girls and the school girls often harass him due to his lack of resistance. He has known Reika and Mayu from his distant past though his memories are foggy at best.\\n\\n\r\nMayu is a succubus who lives with her brother. Both join the Ninomiya family once it is determined that Ninomiya will help familiarize Mayu with guys. Mayu is a succubus and thus looks extremely attractive. She has a clumsy personality and naive nature. She is often seen in suggestive positions/acts with Ninomiya as part of their \"training\".\\n\\n\r\nReika comes from a very affluent family (which also happens to be succubi) and, in a weird series of twists, ends up as Ninomiya's maid. She also harbors feelings for Ninomiya though her proud attitude would never allow her to admit it.\\n\\n\r\nThe cast in general is fairly diverse and developments are fairly good for the main characters (the secondary characters are static for the most part).\\n\\n\r\nValue:\\n\r\nThe overall show had a lot of humorous occurrences as well as some decent dramatic moments. The show also tries to throw in some action which is well played out as well. As for value in general, the storyline isn't very great and the characters aren't particularly memorable. Though it might be a fair spur of the moment watch, don't expect it to be a standout.",
            "date": "2015-11-12T00:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 203207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203207"
        },
        {
            "content": "Being a newcomer to the anime scene, (spare watching the wonderful yet overly commented on in UK Studio Ghibli films) it was really nice to get a feel of different types of Anime.\r\nI was recommended this via MAL after watching Fruit's Basket and I quite enjoyed it. \r\nGoshuushou-Sama Ninomiya-kun is a humourous, dramatic anime and generally quite over the top. But that is not without it's charm, and by the end I figured I was quite enchanted to see the outcomings of the sub storyline going along with the over-the-top main one. \r\nThe characters to me, are quite transparent, the artwork is so-so. Tome it carries the typical characters I feel as though i've seen before.  But that's not always a bad thing, as again being quite new to watching anime it was nice to see something I was familar with. \\n\\n\r\nOverall I rated this a 7 (good), because despite the lack of interesting artwork and characters, the storyline is ok and at only 12 episodes it's not really too troublesome to watch if you're the kind of person that has to finish what you've started.",
            "date": "2008-03-05T02:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 2885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38464.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sarawwr",
                "username": "sarawwr"
            },
            "url": "https://myanimelist.net/reviews.php?id=2885"
        },
        {
            "content": "This will be the shortest review I have ever written and possibly will ever write.\r\nGoshuuoshou sama ninomiya kun is arguably the least substantive anime I have ever watched... and that is saying an awful lot, let me tell you. The plot is rehashed from any harem anime you have ever seen with a small \"twist\" that changes nothing of the show.\r\nThe protagonist , the titular \"Ninomiya\" Shuungo encounters a girl that is secretly a succubus, this is established in episode 1 so I am not presenting any spoilers, he is somehow resistant to her strange pheromone control over men so he is then tasked to\"Train\" her in dealing with the opposite sex.\\n\\n\r\nThat is the backdrop for a lot of messing around. ecchi and comedy. The problem is, it is incredibly flimsy... the story literally goes nowhere, the characters are exactly the same in episode 12 as they are in episode 1. Nothing is resolved, nothing changes. This show is 100% pure fanservice... and it's not very good fanservice.\\n\\n\r\nBut let me give it some honest praise; some of the rare action sequences were good, some of the interactions occasionally yield great comedic results, but these are all rare. The writing is piss terrible from beginning to end aside from those rare exceptions.\\n\\n\r\nThere is no story. Things just happen.\\n\r\nThere is no character development. Characters behave in completely illogical and irrational ways.\\n\r\nThere is no setting. \\n\r\nThere is nothing here.\\n\\n\\n\\n\r\nIf you truly just want to see T&A, there are better anime for it. \\n\r\nI do not recommend this, I actively recommend against seeing it.\\n\r\nMy expectations were low and I was still disappointed.\\n\r\nThis is a terrible anime. Avoid at all cost.\\n",
            "date": "2015-11-07T10:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 202884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925233.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mythof_Feminism",
                "username": "Mythof_Feminism"
            },
            "url": "https://myanimelist.net/reviews.php?id=202884"
        },
        {
            "content": "(CONTAINS SPOILERS)\r\nYeah, so I came into this anime expecting about, well, what I did. So, I will just go about the positives as soon as I can this time.\r\nThe anime opens to a pretty cool fighting sequence where Shungo and his sister are training against wild animals. I assumed they were mildly close here due to the way it was addressed, but I would be proven wrong later. This is mainly meant to establish that Shungo is not a complete wimp and is able to defend himself. Good stuff right here.\r\nI like the character designs, particularly the females, as the long vertical eyes look strangelyappealing. One of the only reasons I tackled this anime is because I thought the plot was interesting. A succubus with androphobia seemed like it would revolve around her comical mischief and, for the first episode, that was the vibe I got. Also, I really enjoyed the cool flip Shungo did when he grabbed Mayu's arm and swung her around into a full grab. That is one of the coolest action sequences I have ever seen in a while. You see it right away anyway, so it's not spoiling much.\\n\\n\r\nI also enjoy how they mention a school field trip, but don't go through with it right away like nearly every other anime does. It's interesting since they acknowledge it's there, but still leave room for the time between them getting ready and actually going for more plot. Most anime normally just have the characters bring it up, they plan and then they're off. They acknowledge it in one episode and it does not actually occur until a couple more later.\\n\\n\r\nAnd here we go. It's a harem and, as I said earlier, I thought it would be centered around Mayu and I did not know it was a harem. It still mostly involves her, but she's the awkward moral support to Shungo more than anything as he is the main character. So many weird dynamics are present in the anime, but the main one is all the females openly violating Shungo in public with nobody stopping them when we're introduced to more of them. The first time you see them (yeah, all of them), they tie him up and force him to look at their underwear. Perverted women seems like a foreign concept in anime, but what's even sadder is that this proves that female characters can get away with anything. Even when they're doing acts that male characters are infamously punished for, nobody bats an eye. Real dumb indeed and it quickly annoyed me. And it only gets worse since Mayu eventually stops being harassed by the male students and it really becomes one-sided on Shungo, where the males are also always picking on him. She occasionally gets punished, but it's not really that harsh.\\n\\n\r\nAnd of course, my favorite part about the harem genre, the male is always punished in nearly every episode. I am not going to hate this too much since the harem genre pretty much established itself as such due to Love Hina making it this way, but the concept is just too old now. Anime like Isekai wa Sumaatofon to Tomo ni prove that a harem can revolve around the male being respected and still be funny. Of course, this is an old anime, but the criticism still stands. It was made over half a decade after Love Hina and was at the worst time for harems when the majority of them have lifeless plots that are essentially \"I wonder how we can get the male to feel the most pain possible\" scenarios over and over. I mean, most in the next decade still do this, but looking back at the one I mentioned earlier, it's hard to believe it took until near the end of this decade for them to think \"oh, maybe we can have a harem where the male is respected\" and even then, I imagine most of them still don't do that very often.\\n\\n\r\nThe running gags are also about what you'd expect. Shungo is always bullied by nearly everyone, misunderstandings happen all the time, Reika is always telling Shungo not to do lewd things, his friends are always wanting him to do lewd things, though I can't deny nearly all the females being involved with this as well is also surprising. The most interesting one is probably Ryoko's bizarre punishments, always ending with \"naked\" which I found myself enjoying for some reason. Earlier in the series, they acknowledged Shungo's combat training more and Ryoko would always mention he would receive a bizarre excursion if he did not do a particular task that involves him honing his skills in a very difficult manner, always ending with him having to be \"naked\" during it.\\n\\n\r\nBefore I end off, however, I'd like to mention one episode in particular, being the eighth one. The anime took a pleasant turn and I enjoyed it a lot. The character personalities got unusual in a fresh way. The goal was for Shungo to make some ramen for his sister, but believed it to be a \"written challenge\" so he wanted to make it fresh. He asks Mayu to assist in stirring the pot well he goes out for the rest of the episode to grab all the ingredients. Hinako became the star of the show here after Mayu calls her for help on stirring the pot. For some bizarre reason, it turns into a softcore hentai fest shortly after Hinako arrives. It becomes even more comical when the plot turns in her favor as every other girl that walked in was forced to help stir the ramen.\\n\\n\r\nTo top it all off, Shungo returns home to the march of rip-off Rocky music, goes into the kitchen and, in a surprising twist, the girls then tell him he can finish it off, as opposed to teasing him like usual (or attempted murder in Shinobu's case). After shrugging the situation, Shungo does just that. Also different is that, opposed to it ending with a punishment for him, it instead ends with Ryoko simply eating something else. Not out of boredom, but because Reika asked her to sample their family's newest ramen. And for the first time in the whole series so far, Shungo is on the giving end of the punishment, yelling at Reika and calling her an idiot, alongside all the girls that helped with the pot. They then all eat their acquired ramen in sadness.\\n\\n\r\nIt's something I felt didn't need to be written about in full at first, but due to the way the anime is structured, it came off as surprising that they took such a twist in what I believed were established concepts on how the rest of the anime's humor would flow. Shungo does a bunch of bizarre tasks with minimal punishment, Mayu is not bashful in the slightest due to the apparent drug-induced air from the pot and the women that normally tease Shungo instead help him make ramen for Ryoko. Really, I couldn't love this episode more due to the unfamiliar nature. Just this episode alone saved this anime from receiving a deadbeat score.\\n\\n\r\nOf course you would think that, with how highly I'm praising the last episode I watched, it is rather bizarre I am now starting the review rather than seeing if the rest of the anime improves upon this. Well, I can't see this anime getting fresher than this. It will most likely be the same thing again and I imagine if he ends up with anyone, it will be Mayu. Or maybe one of his sisters punishments will get so bizarre that it ends with \"naked\" on her and decides to strip him of his virginity for not doing anything with Mayu. Maybe that would be a bit much, but due to how much Ryoko disrespects Shungo, I wouldn't be surprised if she did something so horrid.\\n\\n\r\nAnd as for the field trip episode that's been padded out, well, I imagine it won't be any different than the norm. Shungo probably doesn't want to peep at the girls, his friends make him do it anyway, he gets into an awkward situation with Mayu, Reika or both and then he is punished for it. Won't be surprised if my prediction is barely any different than what I will watch later. Yes, I will continue to watch the anime, but I figured I've seen enough to write about it now is all.",
            "date": "2018-07-12T18:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 283842,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=283842"
        },
        {
            "content": "Goshuushou-sama Ninomiya-kun is as generic as generic harem come. When you have trouble remembering character's names by \r\nepisode 6, you know that a show is generic. Compared to other harem anime that I have seen, the pacing was not as sharp, \r\nthe humor not as funny, and secondary characters bland.\r\nAn especially large flaw I found was that there was there was no chemistry whatsoever between Ninomiya and Tsukimura, the \r\nmain couple. Really, I could not really look forward to any of the interactions between the characters, except perhaps \r\nbetween Ninomiya and Reika, the second lead girl.\r\nApart from issues of characterization and progresion, I found theoverall compsition to be lacking. For instance, the music \\n\\n\r\nwas quite forgettable, neither the OP nor ED stood out, and the background music did not contribute much at all to \\n\\n\r\natmosphere, although it didn't detract either. The art style was also very generic; none of the characters stood out \\n\\n\r\nvisually at all.\\n\\n\r\nI found Ninomiya to be overall, a very underwhelming generic harem anime.",
            "date": "2012-04-01T19:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 57667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456433.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ResoluteDreamer",
                "username": "ResoluteDreamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=57667"
        },
        {
            "content": "Well that almost killed me. For some reason I am feeling that deep hot anger flowing through me more after watching this anime. Goshuushou-sama Ninomiya-kun is one of the most harem based animes I have seen, though I bet there are worse out there. \r\nThe mc has lost his memories from his past and now his two childhood friends, of course two girls, have appeared in front of him. One as the student council president and another out of a helicopter. Then it just so happens that one is a Succubus and the other has multi-personality problems. Oh oh oh, and they both love him,how surprising. Then to top that off, he gets harassed by both the male and female population at his school, the girls for some reason get pleasure out of sexual harassing him and the guys just like to do stupid stuff to him, like make him fall in a pit trap at school... because that is reasonable.\\n\\n\r\nThen those background characters, the mc's big sister, the Succubus's big brother and the multi-personality problem girls's... employees? No more like personal hit squad... a two person hit squad, yeah. But what is up with those evil older siblings, they just do what ever and don't care if the mc gets beat at all. These people are just... ugh.\\n\\n\r\nSo all in all, this anime made me suffer and it hurt.",
            "date": "2015-01-23T17:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 178831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3129915.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SoloAcrobat6",
                "username": "SoloAcrobat6"
            },
            "url": "https://myanimelist.net/reviews.php?id=178831"
        },
        {
            "content": "I guess you could criticize this anime for not having an intricate plot or massive character development, but regardless, it's a very enjoyable show at the very least.\r\nOr I would say that easily since I'm a sucker for eye candy and comedy.\r\nThe show is pretty short and sweet.  I like how it manages to be concise in this way, so it isn't overcomplicated, and it manages to provide some excellent humor along the way. If you're absolutely begging for a plot, I guess I could say it does have something that resembles a decent plot. Shungo's memories of the girl in his dreams doget resolved appropriately.\\n\\n\r\nIn terms of artwork and sound effects, it's not necessarily outstanding, but the character designs are still quite appealing. Maybe too appealing during certain embarrassing moments. Honestly though, can you really say no to Mayu's bouncing breasts in the opening scene?\\n\\n\r\nSeems like a pretty obscure anime, but I think it's worth 12 episodes time of investment. There's good laughs and nice stuff to look at.",
            "date": "2009-10-16T13:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 19732,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=19732"
        },
        {
            "content": "Well I have not completed it so this review is based on the first episode. I think this anime is very promising and i honestly can't wait to watch more. The boobs and such i could do without but other then that its good. I have read other reviews saying that its not that great. Yes, it is like your basic echii, romantic comedy but thats why its so good. Its so basic, you have no choice but to love it. I gave the story a 7 becuase its uniqe to its genre. Art is a 6 though because all the women look very cuteand have great design but i feel like it wasn't passed on when it comes to the men. I think they could look better. Sound was good as far as the theme song. The characters are all diffrent in apperance and style which goes appreciated, and finally it is quite enjoyable. I think one main running gag will be that our main man is like superman. He can do all these things like fight bears and tigers. Its funny to watch making enjoying the anime easy. Overall i give her a 8. She scored high on my book and i am picky. Highly recommended for people who like a romantic and simple anime all rolled in one.",
            "date": "2009-06-17T01:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 15825,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194966.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SassyMarmot",
                "username": "SassyMarmot"
            },
            "url": "https://myanimelist.net/reviews.php?id=15825"
        }
    ],
    [
        {
            "content": "Goshuushou-sama Ninomiya-kun, is just one of those shows that you probably shouldn't like but you do anyway.  Even for an echii show this is pretty over the top at times.  It’s full of swimsuits, bouncing boobs, and moe.  If you like those themes then you’re really going to love this.\r\nThe story is pretty weak overall though it does have a premise that is fairly unique.  Mayu Tsukimura is a succubus, who pretty humorously suffers from a fear of men, well except one, our hero Shungo Ninomiya.  The story starts with Mayu's brother and Shungo's sister having him protect her fromzealous boys drawn to her by her succubus power she can’t control and helping her overcome her fear of men.  This puts our mains in plenty of echii situations, such as being forced to sleep, bathe, fondle and other silly sexual situations. To tell you the truth as much as this anime was geared towards the sex drive of young men I still found these situations quite funny.  Of course there is always a rival, and Reika Houjou, a rich spoiled girl who is in love with Shungo, fills that role.  Even taking a demeaning position as a maid in his house to keep an eye on his relationship with Mayu.  There is a series of dreams that unfold as the show progresses that reveal more and more of the motivations of the characters.  This becomes the real story and the show becomes less and less about what it starts out as. \\n\\n\r\nMost of the characters of the show really stand out and are exceptional.  I really enjoyed them and their antics are hilarious.  They don’t have a tremendous amount of depth which is why I only give them a good rating.  Probably because the series is short there isn’t much development or back story.  We never really find out more about the succubus' or why there seems to be so many running around.  Reika probably is the best developed character and you can see actual growth with her as the series comes to its conclusion.  But like I said, they are just fun to watch!\\n\\n\r\nThe animation I felt was really great.  Very cute character designs and shockingly no loli's!  They are all high school age and they actually look it.  Mayu especially is drawn to bring out the moe feelings in all of us.  This is reinforced by her voice acting.  I just wanted to grab her and snuggle with her too!  All the other acting is very good too, usually there is always some character whose voice gets on my nerves but not so in this series.  The songs are all very catchy and fun too.\\n\\n\r\nOverall this show isn’t going to win any awards for depth or make you smarter.  This is pure eye candy.  It’s a must watch for anyone who is a fan of echii/harem genre but I think also for anyone who wants to watch a lighthearted comedy.  Your experience may vary but I don’t see how anyone could \"hate\" this show.\\n",
            "date": "2008-11-30T12:07:00+00:00",
            "helpful_count": 173,
            "mal_id": 9967,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=9967"
        },
        {
            "content": "If someone were to take all the most popular elements of a typical harem anime, add nothing new and make a new show out of it, you would end up as something like Goshuushou-sama Ninomiya-kun. Coming from the same studio that produced Girls Bravo, this isn't all too surprising to be fair.\r\nStory\r\nThe story is pedestrian by most standards for the harem genre. The focus is primarily on the daily life of Ninomiya Shungo, and is really only pushed forward by his recalling of long suppressed memories of his childhood. There are a couple moments in which the plot strives to be something greater than istypical, but those are short-lived.\\n\\n\r\nArt\\n\r\nThe artwork is solid if unspectacular. Character designs are fairly average, although at times quality degrades significantly despite this only being a 12 episode series. More money may have been spent on the commercial break fan service than on animation, which while quite good, detracts from the show as a whole.\\n\\n\r\nSound\\n\r\nThe OP theme is catchy for about the first 45 seconds then falls off at the chorus. The ED theme, not so much, and as a result can be easily skipped without regret after hearing it once.\\n\\n\r\nCharacter\\n\r\nThe main character, Ninomiya Shungo, is not the everyman typical of the harem genre. He's quite capable in a fight, but then again, so is every other male character with any plot significance. He's also extremely popular with all the girls at school vying for the attention he would rather not give anyone. The two women fighting over him are Tsukimura Mayu, a succubus with androphobia and feeds of the life force of men, and Hojo Reika, in the tsundere role. Most any other character in the series is an archetype that has been seen before.\\n\\n\r\nEnjoyment\\n\r\nFor a harem show, the series does have some good moments. There's a certain absurdity to some of the comedy. The omake segments in some of the episodes are well worth watching. Other times, however, the story dragged on and on for long periods, or worse, forgotten just minutes after watching the episode.\\n\\n\r\nOverall\\n\r\nIf you are looking for a harem anime that in no way challenges the sensibilities of the viewer, this could be well worth a watch. It's fairly good at what it does in that it sticks to genre conventions. Could this series be better? Probably, with a little bit more money for animation, but honestly, it provides plenty for anyone who would possibly be interested in watching this in fan service alone. And really, what more could you possibly ask for from anything in this genre.\\n",
            "date": "2007-12-20T20:28:00+00:00",
            "helpful_count": 83,
            "mal_id": 1634,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25775.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EmperorJ",
                "username": "EmperorJ"
            },
            "url": "https://myanimelist.net/reviews.php?id=1634"
        },
        {
            "content": "Goshuushou-sama Ninomiya-kun\r\nIs it ok for me to have enjoyed this anime even though i felt the anime was nothing more than fine? i still don't know what kept me entertained not even why i wasn't bored by this...\r\nStory\r\nI felt the story could be better developed, as i was watching i thought that they were forgetting to give us the story and gave us filler episodes and not moving forward to the point, just the first three episodes points you who's who but you don't know the why of a lot of things, eg. about the story, the characters, some happenings etc. and yeah it canbe predictable on some things, but just because of that, it doesn't mean that you have to figure out what's happening without any backstory, but i have to point that some things weren't predictable and mislead you to think the opposite of what's really happening, maybe the last two episodes clears the things, but they should have done it in the middle eps. and make it more interesting to see, it was slow paced and they put almost everything in the end, and the ED felt rushed, shouldn't have ended like that way. Overall was fine.\\n\\n\r\nArt & Sound\\n\r\nThe art style looked better when they presented the cuts from part A to Part B, i think that's from the Light Novels, it was beautiful, such vivid colors, really made me wanted to see the LN, but in the anime was average. \\n\r\nSound was very good with the voice acting Miyuki Sawashiro is a VA that i liked, i know her from a lot of animes i have seen and yet to see animes where she's in but the background music, OP and ED were meh, overall was fine.\\n\\n\r\nCharacters\\n\r\nI didn't liked the characters that much, they weren't well developed for what i already stated above, where you get to know about them just in the last episodes, and that should've been in the course of the first episodes not in the end, but Ninomiya was likeable just at first, then i lost that interest on him as a character, he was a little slow making conclusions despite being good at fighting or other things, Mayu and Reika were ok but because of what i already wrote, they were just interesting in the last episodes, support characters were good, overall was fine.\\n\\n\r\nEnjoyment\\n\r\nI somehow enjoyed this, a good enjoyment, is just that they failed to develop everything, maybe it was the comedy or the funny situations, but i wasn't bored and for a run is ok, but i want to think that the Light Novel is obviosly better with such beautiful art style and really stand out colors and a better paced story.",
            "date": "2015-08-20T02:33:00+00:00",
            "helpful_count": 21,
            "mal_id": 196600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=196600"
        },
        {
            "content": "*was redone\r\nstory:\r\nIt was kinda weak, but good enough for me to enjoy it. It seriously made me root for something bad to happen sometimes.\r\nart:\r\nPretty much the worst part of the anime. It looked pretty bad, but it wasn't unbearable though. The designs for the characters were pretty lacking except for the design for Mayu. Reika was probably the worst of all even considering all of the supporting characters.\r\nsound:\r\nI really liked the sound. The OP was really good for it. And the ED (which is usually pretty much ignored by me) was pretty enjoyable to watch.\r\ncharacter:\r\nNot enough developement. At first they were developing great but thensomewhere in the middle they just plainly stopped advancing at all. It was just like someone sitting in one place all day, not moving very much. Plus the addition of Reika's other personality totally ruined it. That was probably the point where all character developement really fell downhill.\\n\\n\r\nenjoyment:\\n\r\nEven though the show had all those flaws, I still enjoyed it to the max. I really liked Mayu. And basically watching Mayu in all of those scenes really helped me finish the anime as fast as possible. Those little stories at the beginning of the show were entertaining, seriously. The ministory with Reika in it was hilarious. The only thing is that it felt kind of incomplete at the end. But, that's how anime like these usually end anyways so it's to expect.\\n\\n\r\noverall:\\n\r\nWouldn't suggest this for people who hate ecchi cause it has a lot of it in here. It has a few fight scenes, but they weren't too fulfilling. Developement was bad, I hated the Reika's other personality though. It gets annoying at times but I still like it, the anime should get some emotion out of me and it gets a plus in that area. Even with all these flaws it still is one of my favorite anime. Don't know too well why, but I just really like it.",
            "date": "2008-02-02T15:12:00+00:00",
            "helpful_count": 19,
            "mal_id": 2286,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/34979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GoshuushoSama",
                "username": "GoshuushoSama"
            },
            "url": "https://myanimelist.net/reviews.php?id=2286"
        },
        {
            "content": "Story\r\nThis is a romantic comedy, with some harem elements. I was therefore quite surprised that the show actually had a little deep story, some episodes in. It definitely didn&rsquo;t turn out as a regular harem, etc. Most of the episodes were pretty random, but they all lead to the ending, which I thought was quite neat. The comedy was most prominent, but it also had a slice of drama, and a bit of irregular romance. But at one time it was a bit ridiculous, with succubuses popping out from every corner. Although, it didn&rsquo;t affect the story as a whole.\r\nArt\r\nThe animation was clean and lookednice, but in my opinion it wasn&rsquo;t really top notch. It was as good as it was needed, to make this into a decent series.\\n\\n\r\nSound\\n\r\nThe OP wasn&rsquo;t particularly memorable to me, but the ED was a bit catchy. Background music wasn&rsquo;t that prominent, but it worked out quite well. The music built well upon the comedy, though.\\n\\n\r\nCharacter\\n\r\nI thought the characters were likable, very likable indeed. Shungo wasn&rsquo;t the typical guy in a harem-anime, and Mayu was just hilarious. Reika was a bit too tsundere for me, but it worked out fine with her. The side-characters fitted in nicely, as well, and there weren&rsquo;t any characters I disliked in the end.\\n\\n\r\nEnjoyment\\n\r\nThis show was really entertaining, and really funny, and I finished it in quite short time.\\n\\n\r\nOverall\\n\r\nIt was a good series, non-typical harem, and very funny. I wouldn&rsquo;t really mind if there was a second series, and I guess most persons would like this anime. Watch it and enjoy.\\n",
            "date": "2008-02-28T06:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 2775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24232.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/martusf",
                "username": "martusf"
            },
            "url": "https://myanimelist.net/reviews.php?id=2775"
        },
        {
            "content": "Another average-class addition for the harem/comedy genre. The anime doesn't excel in anything specifically, but it's at least enjoyable.\r\nThe storyline is very typical: the main male character is surrounded by women that like/love him, yet he doesn't seem to acknowledge any of them. In this case, the only twist is that there are only two girls that fight for him, and that both shared a common past with the male character, though he forgot about it. The art style is just standard; nothing astonishing nor dull. I did feel uneasy about the way female eyes were portrayed, it just didn't seem right. The opening andending songs are just alright, I guess they suit the serie. Character development is exclusive to the three main characters, leaving every other one as if they came out of the blue. Even so, I'm not saying that they were developed fully, they only explained the very essential to understand the plot and it's outcome.\\n\\n\r\nI approve of this anime, it's enjoyable overall. It has some ecchi, though not explicit, and some comical parts. If you have the time and interest, watch it; if you don't, you're not missing much.",
            "date": "2008-08-26T19:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 7467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44786.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/erwinmm89",
                "username": "erwinmm89"
            },
            "url": "https://myanimelist.net/reviews.php?id=7467"
        },
        {
            "content": "This is one of my first reviews ever so don't be harsh!! lol :)\r\nWhen I started to watch this I knew it was going be a harem/ecchi like all the others, but I thought this anime had a charm to it. \r\nI loved the characters and I thought the opening and ending of the anime was brilliant!! Sure it has its bits where girls have big boobs and tight tops, but thats a harem for you!\r\nI thought the artwork was good and the story line was abit cheesy but likeable.\r\nOverall a very funny and charming anime to watch\r\nHope this review is ok ;)",
            "date": "2010-04-07T03:49:00+00:00",
            "helpful_count": 8,
            "mal_id": 24776,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313388.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Usagi-long-legs",
                "username": "Usagi-long-legs"
            },
            "url": "https://myanimelist.net/reviews.php?id=24776"
        },
        {
            "content": "[Notable picks: \r\nfanservice:8 l ecchi:9 l supernatural:6 l consistency:2 l clarity of plot:3 l harem:6 l school life:1 ]\r\nVery random. Large number of plotless episodes. Unrealistic. Exaggeration. Confusing plot.\r\nStory:4\r\nIn the beginning, there were a lot of exaggerated scenes, containing a \"wow\" factor.\r\n There also seemed to be a plot, one to save Mayu from her uncontrollable powers. But after the first or first few episodes her power seemed non-existent.\r\n Then another main female character seems to have some \"secret\" in one episode. A few episodes later we see the \"secret\" coming back again and that was the beginning of the end. \r\nAnd then another newconcept came out: Ninomiya's past. \\n\r\nWell, aside from varying storylines, flashbacks that make little sense keep flashing throughout the series, which were only explained too late imo.\\n\r\nI felt that there were more fanservice or plotless scenes than scenes with plots. Beware.\\n\\n\r\nArt:8\\n\r\nNicely drawn, animation was good. Easy to recognize the different characters cos they were drawn very differently. Background was drawn well too, along with special effects.\\n\\n\r\nSound:6\\n\r\nBoth OP and ED were quite good, but I dun really agree that they are fitting, especially the ending, which seemed to fit more as an OP. Sound effects, voice acting was good, expressive but not spectecular.\\n\\n\r\nCharacter:3\\n\r\nKudos on having a character with 2 personalities (bipolar i think). Other than that the characters seem too easygoing, supernatural, mysterious, or downright random (as in personality keeps changing thruout the series). \\n\\n\r\nCharacter development was lacking for several characters, including the main ones. There were too many scenes where a lot of characters were pulled together just for impact, eg. for fanservice or the concluding episodes, so much so that some of them seem like just extras.\\n\\n\r\nEnjoyment:4\\n\r\nToo much ecchi, fanservice and plotless episodes. Confusing flashbacks and sudden changes to the characters' powers cause much questions to surface. Was pretty much watching the episodes just to see if the original \"possible plot\" could be picked up again. \\n\\n\r\nThe short clips at the start of every episode sometimes were a bonus, but sometimes ended with a cliffhanger or just proved too lame to laugh at.\\n\\n\r\nBut the beginning and ending episodes were still quite good.\\n\\n\r\nOverall:4\\n\r\nAfter finishing the series, I was left with an empty feeling. Too many questions about the series. Felt like some time was wasted watching fanservice. But, it's still interesting though, so I completed it, although I skipped some scenes.",
            "date": "2010-03-14T04:23:00+00:00",
            "helpful_count": 8,
            "mal_id": 23969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=23969"
        },
        {
            "content": "When it comes to Succubi in anime, the interpretation can vary in a number of ways.  On one hand, we have Astarotte's Toy, which involves a succubus at the age of 10 (don't ask me why that age), needing to build up her male harem for reasons I need to keep censored; and on the other, we have Rosario + Vampire, which involves a more developed and outgoing succubus named Kurumu, who can only have one mate in her life.  And then we have Goshuushou-sama Ninomiya-kun, an anime that has way too many succubi, and a rather interesting plot.  \r\nStory (7.52/10): Thisanime for the most part does have a decent plot.  The story of Good Luck Ninomiya-kun, as it is known in the english version, is about a boy named Ninomiya Shungo, who is some sort of martial artist badass, considering the fact that he beats up a bear in the first episode, who finds himself in a predicament of having to take care of this cute and rather large chested girl named Tsukimura Mayu, and help her get over her androphobia by doing various \"relationship-esque\" things with her.  Along the way, a 3rd year by the name of Houjou Reika somehow makes herself involved in their affairs by becoming the house maid, and the story of this love triangle continues onward.\\n\\n\r\nWhile this synopsis is fairly standard in terms of how the character relations are set up, the actual plot itself is a roller coaster; meaning that it has its ups, downs, spirals, and unexpected twists.  What the series does do, is integrate a backstory for the three main characters, and develop a sort of connection between them all, as this backstory provides a main focal point towards the end of the series.  While the backstory was cute and all, the fact that we only got bits and pieces at the beginning, followed by some really heavy hinting as the series went on, was infuriating.  What I mean is the fact that we had characters mention the actual backstory constantly, like \"I won't forget what you did to me 10 years ago\", over and over again for 3 episodes.  It was so ridiculous to the extent that it would make any normal watcher crazy due to how teasing it was.  \\n\\n\r\nOn the flip side from the main story, we have side episodes.  Several episodes throughout the series were pretty much just pointless side story, which made me felt like I was wasting time watching this series.  Especially since this anime is only 12 episodes long, using every minute to explain plot and do what you want to accomplish is pretty crucial.  \\n\\n\r\nOverall, I felt as though the story was at the very least watchable.  There were a couple of facepalm moments and complete utter waste of time moments, but the majority of the series proved itself to be ok to watch.  The pacing was decent, and nothing felt particularly rushed, but I just felt like some parts of the show could've received a bit more explanation for a few of its points since some things felt ridiculous even by anime standards.\\n\\n\r\nThe end I felt like was a bow to the series (not a nice looking fancy bow, but just a normal one), as the actually end was a close to the series, just not the most wonderful close to a series ever.  Apart from that curveball that I did not expect, the end was rather generic, but somehow really befitting for this series.\\n\\n\r\nOverview\\n\r\n+  Decent main story\\n\r\n+  average pull off of a back story\\n\r\n-   Too little explanation of certain plot points\\n\r\n-   Pointless side story\\n\r\n-   unexplained details\\n\\n\r\nCharacters (6.83/10):  Ninomiya Shungo as the main protagonist is a rather interesting male lead.  Compared to a majority of male leads that I've seen in romance-related animes, this guy can most definitely pull his weight.  He is shown to be a rather determined and caring person towards the people he cares about, and is generally a decent character.  When he's not somewhat dense.  Compared to a lot of male characters, he's not completely oblivious to the fact that he's got 2 girls that basically live with him crushing on him at the same time, but he's still oblivious to this fact.\\n\\n\r\nTsukimura Mayu is generally what you would expect of a cute, dandere character.  She is most certainly a dandere, being only proactive in the series at the end, as well as being an androphobic, meaning she does not like to deal with men.  Other than this, there's not really any other way of explaining her, since she is that damsel in distress character that Shungo sweeps in and saves at the very last second.  Which, when you have a martial artist badass having to save you from various threats cause somehow your brother is an international terrorist, being saved happens quite often.  \\n\\n\r\nHoujou Reika as the last of the character trio is a tsundere character that is more explored than Mayu.  While I don't necessarily like the route that the anime put her on, (considering the fact that she's a stalker half the time), I find her to be a lot more interesting and more developed than Mayu because of the fact that she was affected by the aforementioned backstory that isn't explained until the very end.  Apart from that, she's also a Oujo-sama character too, and I just feel like she wasn't put beyond the pedestal that she was given at the start of the series, since the only development she actually gets only appears at the very last few episodes.  \\n\\n\r\nThe side characters in this anime are heavily one-noted, being a bunch of troupes and pointless people that I personally could care less about.  There's only perhaps one or two that I feel like actually matter, since some of the supporting cast basically show up in almost every scene and add more to a perspective character and develop them in the process.  Mostly though, they're just plot devices.  \\n\\n\r\nOverview\\n\r\n+  Above average male lead for a romance-related anime.  (Since most of them are crap.)\\n\r\n+  Some character development\\n\r\n-   Very troupe heavy cast\\n\r\n-   Mainly useless side cast\\n\r\n-   Underdeveloped main cast\\n\\n\r\nArt and Sound (6.98/10):  The art for this series is a standard looking look.  The actual color palette and detail aren't particularly outstanding, but as aesthetics, they look rather decent to look at.  One thing that I feel is a turn off for a lot of people, is the very moe-looking females.  Every female in this series has those large, moe eyes, and if you're not a fan of moe, or hate it, this isn't a series for you.  \\n\\n\r\nEcchi section (I do this for any ecchi show I watch.): What surprised me about the ecchi was the fact that there wasn't an excessive amount of it.  Sure, there was some here and there and some scenes that would have you watch this in your room alone when no one's looking, but for the most part, this series isn't too aggressive in terms of showing its audience the naked bodies of their female character. (I just wrote that, didn't I?)\\n\\n\r\nFrom a musical aspect, the series had a very hyper and very generic OST and ED.  They're cute and all, but they really aren't as catchy as one might think.  Apart from that, the series does have this mystical woodwind music that actually sounds pretty decent.  It's not the most memorable thing to take from this show, but the music does appear quite often, and it gives a whole other tone to this anime.\\n\\n\r\nOverview\\n\\n\r\nEverything is average.  There's no real positives or negatives to the aesthetics of this series.\\n\\n\r\nPersonal Enjoyment (7.02/10):  I wouldn't say that I disliked this series, cause I did finish all of it and was rather pleased with myself after I had finished, but I wouldn't say I truly liked it.  It wasn't by far the best series that I've watched, but it wasn't the worst.  Apart from the pointless side story episodes, which I hate in any anime in general, the story was rather executed well, and I was able to follow along with it rather easily without any trouble whatsoever.  I will say however, that I wasn't a fan of some of the plot points and focuses that the series had, such as the entire middle arc, as well as some of the absurd parts of the story, that I felt like needed a bit of explanation because there are some confusing scenarios in this series.  \\n\\n\r\nIf you don't mind moe, ecchi, missing plot, or even generic anime troupes in general, then you might actually like this series.  If any one of those you hate with all your heart, this probably isn't the first choice for you.  Personally, I feel like this series is a good time killer, and nothing more.  However, I will put a disclaimer that there are a few scenes that get my seal of approval for being disturbing and overall strange, so bear that in mind. (Ex.  A man wearing a bunny girl outfit.  Yeah, that exists in this anime.) \\n\\n\r\nOveral Score: (6.73/10)",
            "date": "2014-03-25T16:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 136975,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136975"
        },
        {
            "content": "I can say that this was a bit of a surprise, it was better than i expected. Overall i like ecchi anime and stuff like that. You get what u want here, boobs, swimsuits and i did get a good laugh. What i was surprised about was the story. Most of you know that most ecchi anime don't really have a true storyline and all and most of the time the story is in the last episode. This one however is a little different which i liked. The basics of it are that Ninomiya is trying to help Mayu with her androphobia and they dosome crazy stuff. At first it may sound like its no different than other ecchi anime. But the story progresses through the all the episodes not just the last one. You see flashbacks and learn new stuff about their past that lead to the ending. The story itself is also unique and interesting for this kind of anime but i don't want to spoil anything. The art/design and sound was really good. The OP/ED was also catchy. If you like ecchi and harem then surely you will like this.",
            "date": "2010-12-29T06:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 33172,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/325144.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DamiPL",
                "username": "DamiPL"
            },
            "url": "https://myanimelist.net/reviews.php?id=33172"
        },
        {
            "content": "Okay i'll keep this short watch this Anime it will change your idea on ecchi instead of being rather perverted like most of them this anime has ecchi to a certain extent but it doesnt over do it. For instance how most echii animes have most character in somewhat revieling clothing this one only does that to some extent. In all i gave this Anime a 9 out of 10 which is pretty awesome and a must see.",
            "date": "2008-12-26T03:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 10645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125500.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gamester163",
                "username": "gamester163"
            },
            "url": "https://myanimelist.net/reviews.php?id=10645"
        },
        {
            "content": "Story: The anime starts off by introducing us to Mayu Tsukumira a sucubbus with a problem.  She can't control her powers well enough and attracts men to her and she's afraid of them.  Ninomiya Shungo is the man who's supposed to help her with her problem and so starts his \"crazy\" life.  The story seems good and interesting but throughout the anime I felt that it started to stray from its main point and become something else, and I felt that the directors should have stayed more true to the plot.  \r\nArt: The ecchi scenes are done nicely and is whatsaved me from rating this anime a 6 or below.  \\n\\n\r\nSound: The sound matches most of the scenes and is pretty decent.\\n\\n\r\nCharacter: I felt that the characters didn't undergo much character development because after one episode the characters might change a bit, then go back to their same old cycle or routine and not be honest with their feelings.  Toward the end however we see the characters shape up nicely, so that makes up for it.  I also felt that some characters were just random objects popping out of nowhere and it's like whats the point of introducing him so late or even putting them in there? (Yes im talking about you green haired guy who i forgot what your name was -.-)  So on the character part 7\\n\\n\r\nEnjoyment: So far this anime seems alright but the end starts to seem like it turns away from its genre and tries to become something it's not.\\n\\n\r\nOverall: If your looking for a good rom com harem anime then this might be for your.",
            "date": "2012-03-15T16:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 56051,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/413122.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/thejosh18",
                "username": "thejosh18"
            },
            "url": "https://myanimelist.net/reviews.php?id=56051"
        },
        {
            "content": "Ninomiya is your typical two girls after one guy plus lots of accidental ecchi moments. It's about a not-so ordinary high school guy and his meetings with two not-so ordinary girls. There is a fair amount of suggestive material, though it has been far eclipsed by the ecchi works of today.\r\nThe actual show is pleasantly enjoyable if you can tolerate the overflow of old school fan service and the inconceivable nature of the entire situation. The majority of the show just introduces the characters as they go on mini-adventures before culminating in a substantial climax near the end.\r\nOverall, this is a decent at best watchfor those who can live with some fan service. This is a really crowded genre, and this particular work just doesn't stand out much.\\n\\n\r\nAnimation:\\n\r\nThe animation was probably crisp for its time but is definitely outdated by 2015 standards. Colors are nicely toned though a bit over-saturated and the characters are well proportioned (and I don't mean that in an ecchi sense), and still quite cute.\\n\\n\r\nThere is a fair amount of action in the show though obviously the only reason you'd venture here is for the ecchi. And to be honest, if that's what you're looking for other shows do that better as well too.\\n\\n\r\nSound:\\n\r\nThe sound of the series is pretty average. The OP isn't bad but not that memorable. The ED is actually better though there is a bit of ecchi-ness in the visuals. The BGM fits the mood nicely but isn't anything outstanding. As for voice actors, Mayu has a very high pitched voice (which some might find cute but others annoying). Overall, the VAs did a very good job, especially Miyuki Sawashiro for giving a pompous, arrogant attitude for Reika.\\n\\n\r\nStory:\\n\r\nNinomiya is yet another show about a somewhat timid guy with a girl literally falling onto him. It focuses on the relationship between Ninomiya kun and the two girls Reika and Mayu. As with many other shows, it involves the main character's long lost childhood memories.\\n\\n\r\nFor the most part, the series consists of mostly stand-alone episodes where viewers learn a little about Ninomiya and the girls, who end up living in Ninomiya's house. Mayu is afraid of men and so Ninomiya is used as the \"tool\" for her to get used to guys. This often involves unusually ecchi situations that may offend some viewers. Near the end of the series, a great deal is revealed about Ninomiya's past and how the girls play a part in it, culminating in a fairly intensive climax in the last episode.\\n\\n\r\nOverall, the story could have built up to the last few episodes a little better and the ending leaves an inconclusive feeling.\\n\\n\r\nCharacter:\\n\r\nFirst of all, I will note that nearly all of the characters in this series are irregular (including unusual martial arts abilities, succubi powers, or an oddly aggressive personality (sexually) etc.).\\n\\n\r\nNinomiya is a popular high school boy who lives with his elder sister. Both are apparently highly skilled martial artists and essentially super-soldiers. However, he tends to be weak/timid around girls and the school girls often harass him due to his lack of resistance. He has known Reika and Mayu from his distant past though his memories are foggy at best.\\n\\n\r\nMayu is a succubus who lives with her brother. Both join the Ninomiya family once it is determined that Ninomiya will help familiarize Mayu with guys. Mayu is a succubus and thus looks extremely attractive. She has a clumsy personality and naive nature. She is often seen in suggestive positions/acts with Ninomiya as part of their \"training\".\\n\\n\r\nReika comes from a very affluent family (which also happens to be succubi) and, in a weird series of twists, ends up as Ninomiya's maid. She also harbors feelings for Ninomiya though her proud attitude would never allow her to admit it.\\n\\n\r\nThe cast in general is fairly diverse and developments are fairly good for the main characters (the secondary characters are static for the most part).\\n\\n\r\nValue:\\n\r\nThe overall show had a lot of humorous occurrences as well as some decent dramatic moments. The show also tries to throw in some action which is well played out as well. As for value in general, the storyline isn't very great and the characters aren't particularly memorable. Though it might be a fair spur of the moment watch, don't expect it to be a standout.",
            "date": "2015-11-12T00:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 203207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203207"
        },
        {
            "content": "Being a newcomer to the anime scene, (spare watching the wonderful yet overly commented on in UK Studio Ghibli films) it was really nice to get a feel of different types of Anime.\r\nI was recommended this via MAL after watching Fruit's Basket and I quite enjoyed it. \r\nGoshuushou-Sama Ninomiya-kun is a humourous, dramatic anime and generally quite over the top. But that is not without it's charm, and by the end I figured I was quite enchanted to see the outcomings of the sub storyline going along with the over-the-top main one. \r\nThe characters to me, are quite transparent, the artwork is so-so. Tome it carries the typical characters I feel as though i've seen before.  But that's not always a bad thing, as again being quite new to watching anime it was nice to see something I was familar with. \\n\\n\r\nOverall I rated this a 7 (good), because despite the lack of interesting artwork and characters, the storyline is ok and at only 12 episodes it's not really too troublesome to watch if you're the kind of person that has to finish what you've started.",
            "date": "2008-03-05T02:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 2885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38464.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sarawwr",
                "username": "sarawwr"
            },
            "url": "https://myanimelist.net/reviews.php?id=2885"
        },
        {
            "content": "This will be the shortest review I have ever written and possibly will ever write.\r\nGoshuuoshou sama ninomiya kun is arguably the least substantive anime I have ever watched... and that is saying an awful lot, let me tell you. The plot is rehashed from any harem anime you have ever seen with a small \"twist\" that changes nothing of the show.\r\nThe protagonist , the titular \"Ninomiya\" Shuungo encounters a girl that is secretly a succubus, this is established in episode 1 so I am not presenting any spoilers, he is somehow resistant to her strange pheromone control over men so he is then tasked to\"Train\" her in dealing with the opposite sex.\\n\\n\r\nThat is the backdrop for a lot of messing around. ecchi and comedy. The problem is, it is incredibly flimsy... the story literally goes nowhere, the characters are exactly the same in episode 12 as they are in episode 1. Nothing is resolved, nothing changes. This show is 100% pure fanservice... and it's not very good fanservice.\\n\\n\r\nBut let me give it some honest praise; some of the rare action sequences were good, some of the interactions occasionally yield great comedic results, but these are all rare. The writing is piss terrible from beginning to end aside from those rare exceptions.\\n\\n\r\nThere is no story. Things just happen.\\n\r\nThere is no character development. Characters behave in completely illogical and irrational ways.\\n\r\nThere is no setting. \\n\r\nThere is nothing here.\\n\\n\\n\\n\r\nIf you truly just want to see T&A, there are better anime for it. \\n\r\nI do not recommend this, I actively recommend against seeing it.\\n\r\nMy expectations were low and I was still disappointed.\\n\r\nThis is a terrible anime. Avoid at all cost.\\n",
            "date": "2015-11-07T10:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 202884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925233.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mythof_Feminism",
                "username": "Mythof_Feminism"
            },
            "url": "https://myanimelist.net/reviews.php?id=202884"
        },
        {
            "content": "(CONTAINS SPOILERS)\r\nYeah, so I came into this anime expecting about, well, what I did. So, I will just go about the positives as soon as I can this time.\r\nThe anime opens to a pretty cool fighting sequence where Shungo and his sister are training against wild animals. I assumed they were mildly close here due to the way it was addressed, but I would be proven wrong later. This is mainly meant to establish that Shungo is not a complete wimp and is able to defend himself. Good stuff right here.\r\nI like the character designs, particularly the females, as the long vertical eyes look strangelyappealing. One of the only reasons I tackled this anime is because I thought the plot was interesting. A succubus with androphobia seemed like it would revolve around her comical mischief and, for the first episode, that was the vibe I got. Also, I really enjoyed the cool flip Shungo did when he grabbed Mayu's arm and swung her around into a full grab. That is one of the coolest action sequences I have ever seen in a while. You see it right away anyway, so it's not spoiling much.\\n\\n\r\nI also enjoy how they mention a school field trip, but don't go through with it right away like nearly every other anime does. It's interesting since they acknowledge it's there, but still leave room for the time between them getting ready and actually going for more plot. Most anime normally just have the characters bring it up, they plan and then they're off. They acknowledge it in one episode and it does not actually occur until a couple more later.\\n\\n\r\nAnd here we go. It's a harem and, as I said earlier, I thought it would be centered around Mayu and I did not know it was a harem. It still mostly involves her, but she's the awkward moral support to Shungo more than anything as he is the main character. So many weird dynamics are present in the anime, but the main one is all the females openly violating Shungo in public with nobody stopping them when we're introduced to more of them. The first time you see them (yeah, all of them), they tie him up and force him to look at their underwear. Perverted women seems like a foreign concept in anime, but what's even sadder is that this proves that female characters can get away with anything. Even when they're doing acts that male characters are infamously punished for, nobody bats an eye. Real dumb indeed and it quickly annoyed me. And it only gets worse since Mayu eventually stops being harassed by the male students and it really becomes one-sided on Shungo, where the males are also always picking on him. She occasionally gets punished, but it's not really that harsh.\\n\\n\r\nAnd of course, my favorite part about the harem genre, the male is always punished in nearly every episode. I am not going to hate this too much since the harem genre pretty much established itself as such due to Love Hina making it this way, but the concept is just too old now. Anime like Isekai wa Sumaatofon to Tomo ni prove that a harem can revolve around the male being respected and still be funny. Of course, this is an old anime, but the criticism still stands. It was made over half a decade after Love Hina and was at the worst time for harems when the majority of them have lifeless plots that are essentially \"I wonder how we can get the male to feel the most pain possible\" scenarios over and over. I mean, most in the next decade still do this, but looking back at the one I mentioned earlier, it's hard to believe it took until near the end of this decade for them to think \"oh, maybe we can have a harem where the male is respected\" and even then, I imagine most of them still don't do that very often.\\n\\n\r\nThe running gags are also about what you'd expect. Shungo is always bullied by nearly everyone, misunderstandings happen all the time, Reika is always telling Shungo not to do lewd things, his friends are always wanting him to do lewd things, though I can't deny nearly all the females being involved with this as well is also surprising. The most interesting one is probably Ryoko's bizarre punishments, always ending with \"naked\" which I found myself enjoying for some reason. Earlier in the series, they acknowledged Shungo's combat training more and Ryoko would always mention he would receive a bizarre excursion if he did not do a particular task that involves him honing his skills in a very difficult manner, always ending with him having to be \"naked\" during it.\\n\\n\r\nBefore I end off, however, I'd like to mention one episode in particular, being the eighth one. The anime took a pleasant turn and I enjoyed it a lot. The character personalities got unusual in a fresh way. The goal was for Shungo to make some ramen for his sister, but believed it to be a \"written challenge\" so he wanted to make it fresh. He asks Mayu to assist in stirring the pot well he goes out for the rest of the episode to grab all the ingredients. Hinako became the star of the show here after Mayu calls her for help on stirring the pot. For some bizarre reason, it turns into a softcore hentai fest shortly after Hinako arrives. It becomes even more comical when the plot turns in her favor as every other girl that walked in was forced to help stir the ramen.\\n\\n\r\nTo top it all off, Shungo returns home to the march of rip-off Rocky music, goes into the kitchen and, in a surprising twist, the girls then tell him he can finish it off, as opposed to teasing him like usual (or attempted murder in Shinobu's case). After shrugging the situation, Shungo does just that. Also different is that, opposed to it ending with a punishment for him, it instead ends with Ryoko simply eating something else. Not out of boredom, but because Reika asked her to sample their family's newest ramen. And for the first time in the whole series so far, Shungo is on the giving end of the punishment, yelling at Reika and calling her an idiot, alongside all the girls that helped with the pot. They then all eat their acquired ramen in sadness.\\n\\n\r\nIt's something I felt didn't need to be written about in full at first, but due to the way the anime is structured, it came off as surprising that they took such a twist in what I believed were established concepts on how the rest of the anime's humor would flow. Shungo does a bunch of bizarre tasks with minimal punishment, Mayu is not bashful in the slightest due to the apparent drug-induced air from the pot and the women that normally tease Shungo instead help him make ramen for Ryoko. Really, I couldn't love this episode more due to the unfamiliar nature. Just this episode alone saved this anime from receiving a deadbeat score.\\n\\n\r\nOf course you would think that, with how highly I'm praising the last episode I watched, it is rather bizarre I am now starting the review rather than seeing if the rest of the anime improves upon this. Well, I can't see this anime getting fresher than this. It will most likely be the same thing again and I imagine if he ends up with anyone, it will be Mayu. Or maybe one of his sisters punishments will get so bizarre that it ends with \"naked\" on her and decides to strip him of his virginity for not doing anything with Mayu. Maybe that would be a bit much, but due to how much Ryoko disrespects Shungo, I wouldn't be surprised if she did something so horrid.\\n\\n\r\nAnd as for the field trip episode that's been padded out, well, I imagine it won't be any different than the norm. Shungo probably doesn't want to peep at the girls, his friends make him do it anyway, he gets into an awkward situation with Mayu, Reika or both and then he is punished for it. Won't be surprised if my prediction is barely any different than what I will watch later. Yes, I will continue to watch the anime, but I figured I've seen enough to write about it now is all.",
            "date": "2018-07-12T18:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 283842,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=283842"
        },
        {
            "content": "Goshuushou-sama Ninomiya-kun is as generic as generic harem come. When you have trouble remembering character's names by \r\nepisode 6, you know that a show is generic. Compared to other harem anime that I have seen, the pacing was not as sharp, \r\nthe humor not as funny, and secondary characters bland.\r\nAn especially large flaw I found was that there was there was no chemistry whatsoever between Ninomiya and Tsukimura, the \r\nmain couple. Really, I could not really look forward to any of the interactions between the characters, except perhaps \r\nbetween Ninomiya and Reika, the second lead girl.\r\nApart from issues of characterization and progresion, I found theoverall compsition to be lacking. For instance, the music \\n\\n\r\nwas quite forgettable, neither the OP nor ED stood out, and the background music did not contribute much at all to \\n\\n\r\natmosphere, although it didn't detract either. The art style was also very generic; none of the characters stood out \\n\\n\r\nvisually at all.\\n\\n\r\nI found Ninomiya to be overall, a very underwhelming generic harem anime.",
            "date": "2012-04-01T19:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 57667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456433.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ResoluteDreamer",
                "username": "ResoluteDreamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=57667"
        },
        {
            "content": "Well that almost killed me. For some reason I am feeling that deep hot anger flowing through me more after watching this anime. Goshuushou-sama Ninomiya-kun is one of the most harem based animes I have seen, though I bet there are worse out there. \r\nThe mc has lost his memories from his past and now his two childhood friends, of course two girls, have appeared in front of him. One as the student council president and another out of a helicopter. Then it just so happens that one is a Succubus and the other has multi-personality problems. Oh oh oh, and they both love him,how surprising. Then to top that off, he gets harassed by both the male and female population at his school, the girls for some reason get pleasure out of sexual harassing him and the guys just like to do stupid stuff to him, like make him fall in a pit trap at school... because that is reasonable.\\n\\n\r\nThen those background characters, the mc's big sister, the Succubus's big brother and the multi-personality problem girls's... employees? No more like personal hit squad... a two person hit squad, yeah. But what is up with those evil older siblings, they just do what ever and don't care if the mc gets beat at all. These people are just... ugh.\\n\\n\r\nSo all in all, this anime made me suffer and it hurt.",
            "date": "2015-01-23T17:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 178831,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3129915.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SoloAcrobat6",
                "username": "SoloAcrobat6"
            },
            "url": "https://myanimelist.net/reviews.php?id=178831"
        },
        {
            "content": "I guess you could criticize this anime for not having an intricate plot or massive character development, but regardless, it's a very enjoyable show at the very least.\r\nOr I would say that easily since I'm a sucker for eye candy and comedy.\r\nThe show is pretty short and sweet.  I like how it manages to be concise in this way, so it isn't overcomplicated, and it manages to provide some excellent humor along the way. If you're absolutely begging for a plot, I guess I could say it does have something that resembles a decent plot. Shungo's memories of the girl in his dreams doget resolved appropriately.\\n\\n\r\nIn terms of artwork and sound effects, it's not necessarily outstanding, but the character designs are still quite appealing. Maybe too appealing during certain embarrassing moments. Honestly though, can you really say no to Mayu's bouncing breasts in the opening scene?\\n\\n\r\nSeems like a pretty obscure anime, but I think it's worth 12 episodes time of investment. There's good laughs and nice stuff to look at.",
            "date": "2009-10-16T13:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 19732,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=19732"
        },
        {
            "content": "Well I have not completed it so this review is based on the first episode. I think this anime is very promising and i honestly can't wait to watch more. The boobs and such i could do without but other then that its good. I have read other reviews saying that its not that great. Yes, it is like your basic echii, romantic comedy but thats why its so good. Its so basic, you have no choice but to love it. I gave the story a 7 becuase its uniqe to its genre. Art is a 6 though because all the women look very cuteand have great design but i feel like it wasn't passed on when it comes to the men. I think they could look better. Sound was good as far as the theme song. The characters are all diffrent in apperance and style which goes appreciated, and finally it is quite enjoyable. I think one main running gag will be that our main man is like superman. He can do all these things like fight bears and tigers. Its funny to watch making enjoying the anime easy. Overall i give her a 8. She scored high on my book and i am picky. Highly recommended for people who like a romantic and simple anime all rolled in one.",
            "date": "2009-06-17T01:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 15825,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194966.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SassyMarmot",
                "username": "SassyMarmot"
            },
            "url": "https://myanimelist.net/reviews.php?id=15825"
        }
    ],
    [
        {
            "content": "Story\r\nWell...to be frank this is the first anime I see that the all story revolves around succubus ^_^ ... I really liked how the story evolved...And I was kindda pissed that Ninomiya didn't remember about Reika and Mayu >.< ...A splendit ending...But as all good animes...It was way too short...just 12 episodes? T_T With a story like that IT SHOULD BEEN like minium 100 or so...Eighter way...A well unique plot...\r\nArt\r\nLot's of beautifull enviroments and coloured places...It's been awhile since I last saw so charming views...\r\nSound\r\nNothing much to complain...I enjoyed both OP/ED...But the ending was the cherry on top of the cake...I really loved the ed...andso as the sounds from the episodes...\\n\\n\r\nCharacter\\n\r\nLot's of succubus characters...and all of them with unique traits...But to be honest I really loved Reika chan's attitude ^_^ she is so cool and cute...not to say that she is my type *drooling*\\n\\n\r\nEnjoyment\\n\r\nLot's of comedy ecchi moments that made me laugh...and lot's of romantic moments too that I enjoyed...Nothing to complain here too...\\n\\n\r\nOverall\\n\r\nIt gets a 10++ ...It's been awhile since I was so captived by an anime...",
            "date": "2010-07-21T01:32:00+00:00",
            "helpful_count": 0,
            "mal_id": 28702,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313513.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shiro-",
                "username": "Shiro-"
            },
            "url": "https://myanimelist.net/reviews.php?id=28702"
        },
        {
            "content": "dont listen to what the others are saying they dont know what the *** their talking about this anime is amazing and wonderful im an anime fan and never going to disrespect it.\r\nthis anime is perfect for ecchi/romance drama lover's \r\nperfect anime if ur going to get into watching anime",
            "date": "2012-06-24T20:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 64345,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1301887.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/yujizzsakai",
                "username": "yujizzsakai"
            },
            "url": "https://myanimelist.net/reviews.php?id=64345"
        },
        {
            "content": "I'm just going to jump right into this review, by saying that this anime was VERY hard to decide if it was in my 'Hate' book, or my 'love' book.  First off, the lead character is INCREDIBLY likable (in my book)...the supporting characters' personalities have been used so often in the anime universe, that it's not even funny.\r\nThe main character is the only character that has any charm, at all. There is bunches of fan service, but this anime is also VERY funny...*laughing in head* one character had small breasts and fantisized about pupularizing small breasts over large breasts, and handing out posters, makinglarge breasted girls  long for small breasts. It was funny.  \\n\\n\r\nThe music was great, GREAT. This anime seemed to have found a 'format' for good anime, and attempted following it, but it failed to provide personality for it's characters, and that is it's downfall.\\n\\n\\n\r\n**I apologize for the grammar.",
            "date": "2012-01-03T12:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 50837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/367113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Drumming1997",
                "username": "Drumming1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=50837"
        }
    ]
]