[
    [
        {
            "content": "I am a straight male.\r\nThis show is pretty good.\r\nI initially wrote off this show after seeing the now slightly famous intro scene, but soon, a joke amongst friends turned into a marathon of the six episodes that were out at the time. Every week after that, I looked forward to Wednesdays, where I'd get to see the next episode of Love Stage. At this point, after completing the series, the true question is this:\r\nWhy did I enjoy the show to the extent that I did?\r\nI mean, it is quite normal for one to enjoy a show that is that is directed towards a different targetaudience, (I.E. shoujos) and I have nothing but respect for yaoi and the culture, but me enjoying this would seem as a bit extreme...except its not.  \\n\\n\r\nWhat this show does well, and likely the biggest reason to why I enjoyed it, was the characters. I will say, I enjoyed the mere presence of almost every single character in this show. The first of the two protagonists is Izumi, the more feminine character of the relationship, and the youngest member of a family of world class entertainers. He has a dream to become a manga artist, however his complete lack of skill causes his family to worry to quite a large extent. Now, there is more to Izumi's wonderful eyes- His character is well developed throughout the show. We get to see all the trails and tribulations he goes through, whether it be with the relationship between him and the other protagonist, which I'll get to in a sec, or the constant tension with his family, who almost sees him as a lost cause.  Izumi certainly does go through some entertaining developments throughout the show. The largest cause of this is the other male in the relationship, Ryouma. Ryouma is a growing celebrity in Japan, being seen in commercials and dramas frequently. As the masculine man in the relationship, is it his duty to take charge and progress the relationship along, and this works to create a dynamic between the two characters that I personally found quite entertaining to watch. The other characters, while not particularly developed, certainly add to the overall show- They accentuate the protagonists, while at the same time, being likable. Characters like Izumi's brother, a member of a rock band modeled off the actual manga writer's brother, make for good laughs, as well as Rei, the manager of Izumi's family. The beautiful thing is, all of these characters are likable: you can relate to their issues, and actually care about what  becomes of them. When a character cried, I felt sad. When they were happy, so was I. This is the shows strongest point. All characters have their own moments in the story which makes for a good time. \\n\\n\r\n(Speaking of good time, I will warn that the show, while not a hentai, does contain its fair share of...*scenes* in it, so do be prepared for that.)\\n\\n\r\nAs for the story, it is actually nothing quite special, however this is not necessarily a bad thing. Does it take risks? Not particularly, but for what the show is trying to accomplish, (Displaying the relationship between the main characters.) it is quite serviceable. Without spoiling too much, the show begins with a standard romantic, almost love at first sight affair, but quickly turns into a comedic tale about a yaoi relationship. The best part about all this, is that it is quite hilarious. The actual chemistry between the characters is almost more important than the story said chemistry is attempting to progress in the first place. Every scene attempts to have a funny moment, whether it be regarding the hilarity of Izumi's manga, or the conversations between him and Ryouma. So honestly, the story may be weak, but that may be the point.\\n\\n\r\nTechnically, the show is quite decent. Animation is quite solid here. Nothing to write home about, honestly, but character movements are crisp, and the palette is quite vibrant, adding much to the style of the show. (I mean, Izumi's eyes!) Keen eyed individuals would notice some shoddy art quality on occasion, such as inconsistent character drawings, but this is a nit-pick at worst. Regarding the soundtrack, I would not likely listen to the tracks outside of the show, but they do serve the show well. Songs play at the right times, while the tracks do not stand out, they certainly do fit well with the emotions a particular scene is trying to emanate. The OP, but SCREEN mode, fits in very well with the show. These guys are fairly new to the anime scene, and I do hope to hear them featured in more shows down the road. The ED is slightly less appealing to me, but still works quite well.\\n\\n\r\nSo yeah, Love Stage. This is the first yaoi show that I've every completed, and while I do not believe that I'll be actively searching for more in the genre, I would be lying if I say I did not enjoy this show. The show is only 10 episodes, and while the length did not hurt the show, I definitely believe that it would have slightly benefited from the extra two episodes, for developmental reasons which you will likely see. Nonetheless, I'd  recommend it. Go watch it, you will invested in the characters, feel their emotions, and...yeah I still cant believe I watched a yaoi.\\n\\n\r\nHave fun.",
            "date": "2014-09-10T16:00:00+00:00",
            "helpful_count": 376,
            "mal_id": 159839,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/418710.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fearlessEdition",
                "username": "fearlessEdition"
            },
            "url": "https://myanimelist.net/reviews.php?id=159839"
        },
        {
            "content": "This is now one of my favourite animes, this is my first review so bare with me, I've never felt like writing one til i watched this anime. As a fan of yaoi/shounen ai this was a breath of fresh air as it's so hard to find decent animes in this genre because there are little to choose from and they're lacking in every department. \r\nThis is a -absolute must- watch for fans of the yaoi and shounen-ai, but also i would highly recommend it for those new to it and want to check it out, it would make a good starter into these genresbecause it's quite cute, nice animation, likeable characters, good development in only 11 episodes and also it's quite tame when it comes to the sexual things compared to other ones like Junjou Romantica, yet it's still enough too excited about.\\n\\n\r\nIzumi stared in a wedding commerical with Ryouma when they were younger and since then Ryouma has loved her..ahem him... ever since. Later they meet in a reunion commercial and Ryouma's love is releaved.. and so is Izumi's real gender, but that doesn't stop his love. And so Ryouma pursues Izumi. Izumi plays the Uke, he's very cute, and loveable i just wanted to squeeze him to bits. Ryouma as a famous actor I wasn't expecting him to be a such a lovable character. He was so sweet, caring and kind.. it was cute seeing what love does to him, he was the kind of guy I would want as my man. Overall I really liked them as a couple. The supporting charcaters were great aswell, especially Izumi's brother he's quite funny.\\n\\n\r\nThough there's only 11 episodes I was worried no way that's enough and I'll be disappointed cause it will leave me hanging incomplete. But actually it developed further than I thought in such the short time it was nice. Unlike other romance animes you have to wait for 24+ episodes just for a confession or even a kiss. I was excited for each episode and how it'd progress next.\\n\\n\r\nThe art was nice and especially the detail in Izumi eyes, so pretty. Only bad thing was lets say Izumi is walking down the street.. he will be detailed and everything but all the background people are whited out figures like ghosts or something which was a bit lazy. \\n\\n\r\nThere's not really any music in the anime it'self  other than the OP and ED, they're really catchy I would always sit through them, usually I skip through the Op and ED on animes and get straight to watching the anime.\\n\\n\r\nOnly downside was that Izumi is a hardout fan of a anime La la Lulu which i found a bit childish but it goes with his cute character but after awhile it was bit annoying, especially that La La Lulu alarm clock omg lol. But it effected the anime to where there were La La Lulu scenes.. some which toke minutes that I had to skip and I didn't see the point of myself and just wasted the screen time.\\n\\n\r\nMake sure you watch the OVA aswell for a total of 11 episodes. Though i wish there was more - there's alot of potiental for 2nd season, though the 11 are still satisfying.\\n\\n\r\nOverall don't miss out on this anime even if you don't watch shounen-ai, this is a good place to start especially if you're into the romance genre. I tend to watch only romance animes and the romance in this anime was great it got me excited and fangirling on the other side of the screen. So give it ago you won't regret it :)",
            "date": "2014-11-22T22:16:00+00:00",
            "helpful_count": 58,
            "mal_id": 169571,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3986493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HeyYouPikachu",
                "username": "HeyYouPikachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=169571"
        },
        {
            "content": "THIS REVIEW CONTAINS SOME SPOILERS, READ AT YOUR OWN RISK\r\nLove stage is a Shounen-ai anime. Most of the male population really won't enjoy this but it's mostly for girls. The anime is really good and was enjoyable with Comedy, Romance, Drama etc...\r\nStory -8\r\nStory's pretty good. Izumi wants to become a manga artist. His family is in show biz and so they want him to enter the show biz world. Note that he is only in college. He is often mistaken for a girl because of his cute looks and such. Ryouma, our main male character number 2, mistook him for a girl when they hadto do a commercial when they were young. After meeting 10 years later, Ryouma still has feelings, even after finding out Izumi was a guy. Izumi struggles to draw manga. It gets rejected and gets into despair. I really like Izumi's character development through out the show. He slowly realizes his feelings for Ryouma and gets into show biz in the end.\\n\\n\r\nArt - 8\\n\\n\r\nArt is beautiful but there were times were the art was iffy but it's good overall.\\n\\n\r\nSound 9\\n\\n\r\nI love the OP and END. There both really amazing and also the background music\\n\\n\r\nCharacter 9\\n\\n\r\nCharacters are great as well. A lot of development with Ryouma and Izumi. Shougo, Izumi's brother who is a musician, has some secret affair going on with Rei, the Sena family's manager. But no one really actually realizes it unless you really pay attention. Izumi's parents are side characters and so are his friends. Most characters get a development.\\n\\n\r\nEnjoyment 10\\n\\n\r\nIt was really enjoyable. It made me laugh. There was some sexual moments and they were steamy. The drama is good and they left us some cliffhangers. Romance is beautiful as well. Though no one knows Izumi and Ryouma are gay hehe. \\n\\n\r\nOverall this anime is great. If you're a yaoi lover than give it a watch, you'll love it. If you're a guy and watch Yaoi then I also recommend it. It's not as amazing compared to Sekaiichi Hatsukoi, but it's close. There isn't a lot of intimate scenes, maybe few. Unlike most of them that are M ;)\\n\\n\r\nSo give it a watch, and I'm sure you will like it, unless you hate Yaoi dont bother watching.",
            "date": "2014-09-10T21:56:00+00:00",
            "helpful_count": 36,
            "mal_id": 159869,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/741341.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SizzlingTear2",
                "username": "SizzlingTear2"
            },
            "url": "https://myanimelist.net/reviews.php?id=159869"
        },
        {
            "content": "As with any genre, yaoi/shounenai is often criticized by people who doesn't like it.  Actually shounen ai (and shoujo ai too) is mostly the same as ANY romantic comedy anime out there, the only difference is that the main couple features homoromantic characters, which tends to scare off straight viewers. \r\nThe thing with \"Love Stage!!\", what makes it so special, it's that for some reason it seems to have broken that genre barrier, and a big part of their viewers are straight male people who don't usually watch shounenai/yaoi shows.  \r\nThe premise of the story is very simple: Ryouma, a famous actor, fellin love with a girl when he was a child and has been obsessed with her memory since then, and once he meets 'her' again, now as a young adult, he discovers 'she' was actually a him: Izumi, a clumsy otaku with a showbusiness family. \\n\\n\r\nWhat makes it SO good is both the comedic value, because the story is tremendously HILARIOUS, and the characters itself, which are really very well developed in just a few episodes. \\n\\n\r\nThe art is pretty cool, nothing out of the \"shoujo norm\", but myself, i love the character design a lot. But i'm biased because i really love Zaou Taishi's drawing style. \\n\\n\r\nSo, i must say that if you are a fujoshi/fudanshi or a person who appreciates the genre just like me, this is a MUST watch. \\n\r\nIf you are a viewer who usually doesn't like yaoi/shounenai, or you haven't watch one ever, i will give it a try. Odds are you are going to like it... and if not, at least it's worth the laughs.",
            "date": "2015-03-09T14:16:00+00:00",
            "helpful_count": 36,
            "mal_id": 182049,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4493932.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/whiteteeth",
                "username": "whiteteeth"
            },
            "url": "https://myanimelist.net/reviews.php?id=182049"
        },
        {
            "content": "I first heard of this show by accidentally coming across its opening somewhere on the internet. From what I saw, it looked like this show was going to be about a healthy, consensual, small-age-gap relationship, which is a relationship I still have yet to see in yaoi. I find it a lot more in yuri, but hardly in yaoi. The two boys were holding hands, looking into each others eyes and had smiles on their faces. They both looked happy rather than one looking sexually pleased while the other wishes he was somewhere else. I really wanted to see if Japan can actually make ashow about a HEALTHY guy-on-guy relationship, and I thought this was going to be the one. I was wrong.\\n\\n\r\nThe first couple episodes were highly entertaining. One of the main characters, Ryouma is coming to the realization that he has feelings for another guy, Izumi and is going through a bunch of conflicting emotions, considering he thought he was straight before hand and he, at first, thought that Izumi was a girl. \\n\\n\r\nOne day, Ryouma goes over to Izumi's house. They start off with the usual awkward greeting. Then, Ryouma ends up chasing Izumi around the house and tackling him. Ryouma pulls his pants down and puts his mouth all over Izumi's lower half while Izumi is crying praying that this stops soon. Luckily, soon enough, Ryouma was caught in the act by Izumi's parents' manager and was forced to stop.\\n\\n\r\nAt first, I was glad that this scene was taken by the characters in a negative way. In the crunchyroll subs I was reading, the manager even referred to it as assault when reporting what happened to Izumi's brother, which I was really impressed with. In fact, Izumi's brother was ready to beat up Ryouma the next time he saw him as punishment for what he did to his little brother. I was even more pleased to find that Ryouma shortly thereafter revealed how guilty he feels about what he has done to a person he cares so much for and even apologizes to Izumi in the most sincerest of ways. I thought, \"Thank God Japan knows that rape is a terrible thing!!\" A couple episodes later, there was a scene that made me completely change my mind about that. \\n\\n\r\nIzumi went on for days without sleeping because he was trying to finish up a manga in time to enter it into a contest. As a way of strengthening their \"friendship\", Ryouma volunteered to help Izumi finish the manga in the last couple days before the contest. Just after the manga is finished, Izumi collapses to sleep and Ryouma carries him to his bed. Just before leaving Izumi's room, Ryouma couldn't resist, but take the opportunity to kiss Izumi while he is out cold. He planted a short one and then was ready to walk out, then thought, \"well, one more wouldn't hurt\". He kisses him again, and then thinks, \"Nah, maybe one more. Now one more. I swear, this will be the last one. No another wouldn't hurt.\" He ends up kissing Izumi all over his body and apparently it's alright because Izumi's unconscious. If I were in Izumi's situation, especially if I woke up in the middle of that, I would be furious. I stopped the episode in the middle of that scene and swore to never continue. I came out of it feeling extremely disappointed and in utter disbelief.\\n\\n\r\nAfter they showed one rape scene where they acknowledge that what Ryouma did to Izumi was terrible, they show another scene where he gets away with doing something not that much different. I never found out what happened after that scene, but I knew that it was either going to result in Ryouma getting away with what he did because no one was watching and Izumi was unconscious, which is not something I was going to like in the slightest, or that Ryouma does get caught, in which case, I can hardly imagine Izumi wanting to stay friends with him, let alone start a romantic relationship with him. \\n\\n\r\nLet me ask, do any of you know of any queer anime (especially yaoi) where the two main characters are in a healthy, consensual, relationship? I really want to find something out there that does. It would make me feel really happy to know that Japan realizes that gay relationships are not that different from straight ones. The only one I've come across that has come to that realization is Aoi Hana (highly recommend you watch that show instead).",
            "date": "2016-06-06T19:33:00+00:00",
            "helpful_count": 14,
            "mal_id": 220171,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5253211.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TanakaRiza",
                "username": "TanakaRiza"
            },
            "url": "https://myanimelist.net/reviews.php?id=220171"
        },
        {
            "content": "Love Stage started as a romantic comedy manga by Eiki Eiki and Zaou Taishi. In 2014 our old friends at J.C. Staff, behind such titles as Yami no Matsuei, Hachimitsu to Clover, Shakugan no Shana, Toradora and a bunch of other anime I've reviewed, started releasing an anime adaptation. Is it a romance that's worth your time? Let's examine it and find out. As it was Valentine's yesterday and this seems like a good week for some romance.\r\nStory:\r\nSena Izumi comes from a show business family. His mother is an actress. His father is in theatre and his elder brother is the lead singer of aband. Izumi, however, doesn't want to be in show business. He wants to be a manga writer and artist. In spite of not being good at drawing. I know how he feels. That's why all my writing just uses words. Things change for Izumi when he receives an offer to be the bride in an advert that's a follow up to one he was in a decade ago. He initially refuses but finds out that the other intended star, Ichijou Ryouma, won't take part unless the casting is the same as it was a decade ago. Reluctantly, Izumi agrees to take part for the sake of his family's business. Little does he realise that Ichijou's insistence has to do with the feelings he's harboured for a decade and little does Ichijou realise that the co-star he's been pining for is actually a boy. I detect incoming hijinks.\\n\\n\r\nThe biggest flaw with this series is that a lot of the early stuff involving the romance is questionable, at best. Ichijou carries around a picture of eight year old Izumi and he's been obsessing over him. That's pretty creepy. You'd think a mentally stable person would have gotten over their first crush given a decade. There's also a scene where Ichijou actively tries to force himself on Izumi which begs the question of why a light-hearted comedic romance involves attempted rape. That's not remotely suitable for the tone. To its credit, the series does acknowledge the atrocious nature of Ryouma's actions and spends a good amount of time having him try to redeem himself but it's still really tonally awkward and poor form for the start of a romance. There's also some awkwardness involving Izumi's brother harbouring a complex for him that borders on incestuous.\\n\\n\r\nOn the positive side, the romance does get pretty decent once its past the initial awkwardness. The comedic elements of the series also generally work pretty well. It's not uproariously funny comedy, but it is pretty good.\\n\\n\r\nCharacters:\\n\\n\r\nThis series has two types of characters. The first are the major characters who are a step or two above archetypes. They develop, albeit in kind of shallow ways, over the course of the series. The second are the side characters who are pretty much the epitome of generic. The interactions vary a bit. Izumi is unrealistically quick to forgive Ryouma but their latter interactions after that whole plot point dies down are pretty decent and develop almost naturally. My favourite interactions by far are between Izumi & Rei, a gent who acts as a guardian and parental figure towards him. It's a multi-faceted dynamic that can be genuinely heart-warming at times. Then we have the brotherly relationship which is far too clingy and a bit creepy.\\n\\n\r\nArt:\\n\\n\r\nThe artwork is, as a whole, pretty decent. The series does suffer a bit from the whole comedic undetailed moments that you get in a lot of series. The mouths are also a bit awkward both in how they move and in their appearance. I do quite like the way they do the eyes in the series, although the spectacles look awkward, and the regular scenes where they aren't doing something odd for comedic effect look quite nice. I also do like that Izumi's drawings are realistically amateurish. They don't make them look exaggeratedly bad like a lot of series that have a character who's supposed to be bad at artwork do.\\n\\n\r\nSound:\\n\\n\r\nThe cast in this is pretty good. Eguchi Takuya, Hirakawa Daisuke & Yonaga Tsubasa all deliver nice performances and the rest of the cast are all competent. The music was handled by Nakanishi Ryosuke and he did a decent enough job. It's not a soundtrack I'll be listening to on its own but it does get the job done.\\n\\n\r\nHo-yay:\\n\\n\r\nI've already talked about Izumi And Ryouma quite a bit but there's more homo-eroticism in the series than just the two of them. Towards the end it's heavily implied that Izumi's brother and Rei are in a sexual relationship. I don't know why they didn't do more that instead of focusing on the kind of creepy brother complex.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nUltimately, Love Stage is a series that has a massive shadow hanging over it. The shadow of the messed up way the main romance starts. And while the series does markedly improve over that very poor first impression, it never quite breaks away from it. Ultimately, those things it does well kind of strike a balance with those it does poorly. Is it a bad series? No. It has quite a few funny moments and the latter stuff with the romance is decent enough. Is it a good one? Also no. It's simply hurt too much by the tonal awkwardness in the beginning and by the whole brother complex aspect. In the end, it's pretty average. My final rating is going to be a 5/10. If you like romances and can forgive the whole way things open, you'll probably get some enjoyment from it. Next week I'll look at JoJo no Kimyou na Bouken: Stardust Crusaders series 2.",
            "date": "2017-02-15T13:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 240648,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=240648"
        },
        {
            "content": "So... Um yeah.\r\nHonest, this anime really isn't any good. \r\nIn fact, I'd probably go as far as saying it's actually bad. To be honest, I'm kind of ashamed to even say I watched and enjoyed it. Is this what fanservice obsessed men feel like when watching something like Highschool DxD? I feel like trash for enjoying it.\r\nWell, if you like BL, then this is probably going to satisfy your needs. But good lord. Everything about this anime is implausible, silly and over the top; the story doesn't even justify watching it because the character development is just so mediocre. Still, I enjoyed it.\r\nSigh.",
            "date": "2018-08-08T22:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 285974,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3731383.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lovelysweetdream",
                "username": "lovelysweetdream"
            },
            "url": "https://myanimelist.net/reviews.php?id=285974"
        },
        {
            "content": "The teenage years are often referred to as the best years of your life, but they can come with their own set of challenges...  It’s the time of life where you’re still finding out who you are, who you want to be, and what’s important to you.  Even as late as the crucial age of 18, it can be difficult to find your place in the world, especially if you’re struggling to find the place where you belong.  This is even worse for Sena Izumi, because in addition to his more normal adolescent woes, he’s the youngest member of an entire familyof entertainers and celebrities...  His sly father is a stage actor, his spoiled mother is a model/actress, his doting brother is the lead singer of a popular rock band, his family has it’s own talent manager...  And he wants to be a manga artist.  Naturally, this has caused a bit of friction in the family, as the excitable and outgoing Sena family is  beginning to seriously worry about their youngest son, who’s locked himself in his room like a hermit and dedicated his life to a passion that they believe he has no talent for the field that he dreams of finding success in, and they’ve decided to do whatever it takes to get him out of his introverted shell.\\n\\n\r\nFortunately for them, an opportunity to do so has just presented itself.  When Izumi was only eight years old, he was dressed up like a girl for a wedding scene in a commercial, and the company wants to do an anniversary commercial...  A sequel, where the children from the original classic have grown up and are marrying themselves.  After some creative persuasion from his brother, Izumi agrees to don the drag dress one more time, but little does he know that his walk down the aisle is leading him into the arms of destiny.  His costar, the now famous Ryoma Ichijou, has been in love with him since the first commercial, and this isn’t just imprinting...  The sight of her face has gotten him through ten long years of hardship in the entertainment industry, and it was HIS idea to get the original cast back so he could finally make his dreams of seeing her again come true.  Will his discovery of his bride’s true gender bring his longing to a grinding halt, or has he come too far to turn back now?  And what kind of effect will getting caught up in all of this have on Sena’s routine lifestyle?  They may only be married in fiction, but the red string of fate is all too real.\\n\\n\r\nLove Stage comes to us from JC Staff, who I believe I’ve said before has no real consistency in it’s visual presentation.  It goes all over the place in terms of quality, but out of the three general camps that I mentioned in my Kill Me Baby review, I’d say Love Stage fits nicely into Camp 3.  This is, once again, the camp where anime has a modest budget, there’s no real room for excess, and they do whatever they can to make the show look as good as possible without putting themselves into a compromising financial situation.  Much like other shows in this camp, Love Stage never really goes out of it’s way to impress you with it’s animation, but it still looks fucking great.  The characters use very simple movements whenever motion is needed, and it never tries to do more than it needs to, while at the same time never feeling like it’s skimping.  There are budget saving tricks at play, but the producers were clever enough to make sure it all felt like part of the visual style and tone of the series, which they succeeded at.\\n\\n\r\nAnd speaking of the visual style, this is a very beautiful show just in terms of it’s art alone.  For about 90 percent of the series, the color palette is bright, warm and welcoming, almost like it knew how intense it’s kind of subject matter could be, and was designed to put viewers at ease right from the early stages.  The other ten percent of the time, when the show does get a bit darker, what with the characters dealing with issues and internal turmoil, the palette changes to reflect this, but it’s never for long.  The level of detail is also stunning, with it’s depiction every little crack in a shattered marble only being the tip of the iceberg.  Just about everything in the background is shown with intricate detail aside from the people, who are drawn as colorless silhouettes, and while I’d normally rag on a show for this...  RWBY season 1, how ya doing...  The fact that it only really happens when a character is busy with internal monologues does make it feel like an accurate portrayal of their distracted mindset.\\n\\n\r\nWhile I’m not a fan of shiny white halos surrounding a character’s hair...  I’ve bitched about it before, and sorry, but I’m not cool with it here either...  The character designs are otherwise very attractive and tell us a lot about the characters as people.  Ryouma and Izumi in particular were designed to fall right in the middle of masculinity and femininity, as they’re obviously coded male, but they still have the big moe eyes, slender bodies and feathery hair that’s just long enough to frame their faces, and the details that would normally code a character as seme or uke are more than just there, they’re ingrained into their personalities.  Izumi’s eyes in particular are multi-colored, mostly amber but touched by a subtle swirl of blue at the tops, giving them a mysterious quality that you can understand someone getting entranced by.  The other characters in the cast are fairly generic in design, but it doesn‘t really hurt anything, as their looks do inform their personalities.  I do feel that the blushing artwork is a little too over-pronounced, but that’s a minor issue.\\n\\n\r\nThe music is a bit on the generic side, but it’s not bad or anything.  I didn’t find any of it to be repetitive or annoying, like in a lot of shows I’ve seen.  The character songs are a lot more interesting, with LalaLulu’s song being a delightful parody of the Magical girl genre, and Izumi’s brother Shougo has a really cool song called Love or Die, and yeah, I can see why the band Crusherz became famous.  The opening, Lovest by Screen Mode, is awesome.  Not only is the song catchy, upbeat and fun to listen to, but the video is just as fun and fits every beat perfectly.  The constantly changing visuals are simple enough to grasp what they’re showing you in the time they have, and they match the energy and tone of the show.  Surprisingly, the ending theme is more of the same, a catchy song with visuals that are pleasing to the eyes and match the beat of the song, and while most of it features posed characters, there’s an actual burst of expensive animation towards the end.  I can’t remember another show where I watched all the way through the opening and closing as often as I did with this one.\\n\\n\r\nThere’s no dub, and I’m not a good judge of Japanese acting, but I’d just like to point out that if there’s ever a dub for this show, I hope they cast Chris Patton as Ryouma and Greg Ayres as Izumi.  Moving along.\\n\\n\r\nOkay, let’s just rip this band-aid off right now...  Love Stage is a yaoi.  It’s not a shonen-ai, oh no, it’s a full on yaoi.  I’ve never reviewed a yaoi before, but that doesn’t mean I haven’t seen any.  While I’m no expert on the genre, I have dabbled a bit, and unfortunately, what I’ve seen prior to Love Stage wasn’t all that impressive.  I read the first few volumes of Loveless, I saw the first four episodes of Gravitation, I’ve seen the movie Fake, and while it’s more subtextual than anything else, I sat through the first season of Black Butler.  In short, my exposure to the medium has revealed it to be a minefield of problematic situations and over-all just shitty story-telling, relying way too heavily on love at first sight, people turning queer out of nowhere on a dime because the plot demanded it, romanticized sexual assault, writers who forgo necessary information and development because seem to just want to get to the action already, and way too many couple where the age differences lay on different sides of the law.  I’ve been told by people far more versed in the genre than I am that most if not all of these observations are persistent from title to title.\\n\\n\r\nNow, does that mean there are no good Boys Love material out there?  No, not necessarily.  I plan to watch Yuri on Ice and Nabari no Ou in the future, and I’ve even seen some shows that I thought would have been improved if the main male characters went gay for each other...  Kids on the Slope, for example.  But alas, thank the LGBT gods, there is at least one good yaoi anime out there.  I’ve already praised the art and animation from this show up and down the wall, but the number of problems and genre cliches Love Stage avoids, subverts, or just has fun with is insane.  Now keep in mind, I’m not saying it’s an accurate portrayal of homosexual people or homosexual couples, and I’m not saying it presents it’s gay characters as realistic people or that it exists for reasons outside of tickling the libidoes of ravenous fujoshi, but that doesn’t mean it can’t be good.  Yeah, I made a big deal about figuring out whether or not Strawberry Panic was faithful to it’s subject, but that show was garbage and needed the extra point.  Love Stage doesn’t have that problem.\\n\\n\r\nRight off the bat, we’re introduced to the main character, Sena Izumi, the uke of the situation.  Oh, but we find out much more than that about him.  After making sweet promises to us in the form of it’s animation, Love Stage wastes no time establishing Izumi’s character.  We find out who he is, what he wants from life, what his family’s like, what his backstory was like, what his issue is, several possible resolutions to it, basically everything you need to know about him, and this is expressed without a lick of unnatural dialogue or exposition, and even better, we learn all of this before the first kiss is even taken.  We don’t learn quite as much about his seme Ryouma until much later, but we know about their shared history, and through his actions revolving around his interactions with Izumi and his coworkers, we do learn enough about him to not have any lingering questions about him that really need to be answered.  I can’t say they feel like people I’d meet out there in the real world, but they still feel like fully developed and fleshed out characters.\\n\\n\r\nThey also both have personalities that tie directly into their seme/uke coding, with Izumi being childish and submissive, but still driven by his own interests and possessing a decent level of propriety and agency.  Ryouma is tall, dark and mysterious, quick to anger and somewhat closed off, but still struggling with the conflicting feelings inside of him and trying his best to control the parts of himself he doesn’t quite understand yet.  While it takes them a while to work out their personal hang-ups and finally come together, they do make a really likeable couple.  I also really liked the Izumi family, as viciously manipulative and backstabbing as they can be.  Shougo, Izumi’s older brother, dotes on him and gets clingy to the point that he honestly can be a little creepy at times, but he still has plenty of moments where he redeems himself by showing a genuine concern and protecting him.  We don’t see much of Izumi’s parents, but despite Dad acting like he knows best and Mom acting self-centered, they both clearly love their children.  \\n\\n\r\nPerhaps the most nuanced character is the family’s manager, Rei, a cold and calculating character who’s not above pulling the strings whenever necessary, selling people out to family obligations and looking for every possible advantage in his day-to-day dealings, but he still cares enough about his employers that he’ll set aside all of his business concerns if it feels like the right thing to do.  Izumi’s manga club, only one of whom kind of registers his presence, is designed so that he’ll look out of place there, not that he ever notices.  Similarly, the fictional character of Lala-Lulu, his fantasy Waifu idol, is so far removed from bearing any resemblance to actual girls that it’s not hard to see how disingenuine his attraction to the fairer sex really is.  A few of the characters can get annoying at times, the fat otaku feel like an unjust stereotype, and I’m pretty sure I’d have a gripe with Izumi’s parents if they were given more to do, but over-all, I really liked all of these characters.  I’ll admit that Ryouma does test me a little, but that just leads me to a few other cliches.\\n\\n\r\nFirst of all, there’s the love at first sight cliche, which Ryouma falls neatly into.  He’s been in love with a certain girl since they were 8, and while that would normally earn an eyeroll at best from me, the fact that his love for her carried him through the entertainment industry...  A field of work where you NEED to hold onto some form of innocense to survive, let alone succeed...  I can give it a pass.  Plus, with Izumi turning out to be a gut, and Ryouma being unable to shake the feeling anyway, it does feel like Love Stage is having fun with this cliche, rather than using it straightforwardly.  Ryouma’s feelings are portrayed as crazy, but not the stalker kind of crazy...  The romantic kind, where you know your love for someone makes no sense, and is totally out ofl eft field, but you’ll still stay true to who you are and who you love, the world be damned if it stands in the way.  This is probably the best usage of love at first sight that I’ve seen in an anime, let alone in a yaoi, but unfortunately, Ryouma falls into other cliches that are much harder to forgive.\\n\\n\r\nA constant occurrence in yaoi is rape.  It may not be carried all the way through, but it’s there, from gay characters in non-yaoi shows that speak in exaggerated falsetto and frequently make unwelcome advances on straight characters, to attempted rape that’s played for laughs, to actual rape that’s romanticized and sparks a new level of romance as a result.  And yes, there is a point where this show gets...  Rapey.  I won’t tell you exactly what happens, or the reason that it happens, but three episodes in, Ryouma does something, and he winds up losing control of himself and coming within a hair’s breadth of doing something he’d never be able to take back, before he’s interrupted and the unforgivable thing is just barely prevented, but here’s where Love Stage takes a major step away from the worst of it’s genre...  What he does is considered to be a bad thing.  The writers don’t try to sweep it under the rug, oh no, it’s painted exactly the way it should be, and it’s this turning point that really got me invested in this pairing.\\n\\n\r\nAfter the...  thing...  Ryouma feels genuine remorse, and he has to apologize and earn Izumi’s trust back before he can even THINK about pursuing a relationship.  He’s accepted his feelings by this point, but Izumi is a much harder sell, and even though he buries the hatchet with him...  Mostly out of pity...  It isn’t until Ryouma proves his devotion by getting involved with Izumi’s lifelong passion, helping him along towards his goal, and doing everything in his power to encourage him and build him back up when things don’t go the way he wanted.  He slips back into problematic territory when he kisses Izumi a bunch of times in his sleep...  I mean, come on, seriously?  But he earns those points back when he refuses a carnal offer that he can tell Izumi doesn’t really mean.  I won’t say whether or not these two wind up together in the end, but...  Isn’t that alone a breath of fresh air?  The fact that you can’t tell?  Yeah, they have numerous encounters, both as friends and as romantic prospects, but the outcome of their time together is just as engaging as the journey there.\\n\\n\r\nLove Stage is available from Sentai Filmworks.  The original manga by Eiki Eiki is available from SuBLime.  The original light novel is not available stateside,  but the series can also be viewed on Crunchyroll.  There’s an OVA episode on the DVD that I highly recommend, and as for what it’s about, let’s just say it’s more of Ryouma being a pain in the ass.\\n\\n\r\nNow, after all the time I’ve spent talking about how good this title is compared to other titles in the Boys’ Love genre, and how it deconstructs and subverts a bunch of troublesome tropes, the reaction I’m probably getting from most readers is...  So what?  Even if it’s a good yaoi, it’s still a yaoi, and most of the anime fanbase will have no interest in that kind of content.  Well, there is one thing about Love Stage that I feel gives it a more universal appeal:  This show is fucking hilarious.  I was hooked right from the first time that Shougo manipulated Izumi with Lala Lulu merchandise, and Ryouma’s reaction to Izumi’s gender reveal was just icing on the cake.  It’s visual style works extremely well with it’s comedic timing, which follows a healthy combination of gag and character-based jokes, most of which hit their mark.  It was almost enough for me to forgive some of the more problematic scenes, including Ryouma’s missteps and an attempted gang-bang towards the end that came right the fuck out of nowhere.  It’s a yaoi, so it’s going to be a mixed bag, but it’s a bag I won’t mind reaching into a few more times.  I give Love Stage an 8/10.",
            "date": "2017-07-29T05:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 254123,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=254123"
        },
        {
            "content": "I never quite know whether I should try to rate BL anime within its own genre or not, but since MAL makes no genre distinctions when showing top anime, it seems fairer to rate it as I rate all other anime.  But I will point out where it stands within its own genre.\r\nI am gay and used to read a lot of BL. Tip to North American audiences:  in these reviews most people use confusing terminology, so here's a quickie refresher.  BL (Boys Love) is what the Japanese call boy-on-boy manga and anime mostly written by women and mostly directed at women.Yaoi in Japan only refers to very explicit BL doujinshi (fan fiction), which are basically pornographic without much plot.  In the West, people tend to misuse yaoi for boy-on-boy romantic works with some amount of actual sex being portrayed, while some call romantic works without explicit sex shounen-ai.  Again, that's not the term used in Japan, where shounen-ai only refers to a very narrow part of BL produced in the 1970s and 80s by a specific group of mangaka who expanded very romantic, idealized, exoticized shoujo concepts to boys.  Do yourselves a favour and learn to call boy-on-boy manga and anime BL, that way you're in tune with the country that actually produces most of it, and it'll reduce confusion.  This anime is BL, without graphically explicit sex.  Here endeth the lecture  ;)\\n\\n\r\nLove Stage!! turned out to be a fluffy, mildly amusing, quite inoffensive BL anime.  I have not read the source manga, but BL anime is almost always less explicit than its source.  If you think homosexuality is a sin, don't watch it.  If the thought of boy-on-boy sex makes you a bit uncomfortable because you're a straight guy, I think you can fairly safely watch this without breaking out in hives.  There is clearly some sex happening, but it is stylized away in a rather imaginative way; nothing is ever shown graphically, other than kisses, and even those are darn tame; no lips as much as move.  I gotta say I especially loved the pink elephants, that had me laughing out loud.  Most of the humour is also not suggestive, and while there is some fan service, it doesn't even get close to hetero ecchi -- we get some naked torsos without nipples, woohoo. Most of the anime consists neither of lovey-dovey action nor of sex, it spends more time on Izumi's attempts to find himself, career-wise and romantically.\\n\\n\r\nStory 4/10:  Anime in general doesn't necessarily come up with believable stories, but the fluffier BL often takes the cake.  Ryouma, an up-and-coming hot actor, when he was a boy apparently fell in love with an 8 year old crybaby girl based on a single encounter, and carries that flame in his heart for the next 10 years.  Yeah, tell me another one.  When he has a chance to meet that girl again, he grabs it, and finds his love confirmed as the girl has grown up into a super-cute young woman.  Only, she's not actually a girl, she's a boy.  Henceforth we get the usual disgust upon the denouement from both Ryouma and Izumi, the cross-dressing boy in question, but love naturally conquers all in no time flat, without a whole lot of hesitation.  This is basically completely unrealistic on all levels, and because it's also thoroughly tropey, and one of my least favourite tropes are the stereotyping of seme/uke roles (sexually dominant / submissive), and the feminizing of the uke, I don't give it a lot of points.  Redeeming factors are that Ryouma actually tries to connect with Izumi on a personal level, and that Izumi doesn't get stuck in his panicked reactions but thinks further.  Still, it's all very shallow.  Most of the comedy wasn't funny to me, though I laughed at some of the visuals.\\n\\n\r\nArt 5/10:  I'm not a big fan of Zaou Taishi; I find her mouths very unattractive, and her lines too heavily inked.  But it's all very bright and colourful, with lovely eyes in shades no human ever had.  ;)  The animation is decent for BL, not so much in general -- BL anime tends to have very small budgets and it always shows, though this is better than what it used to be.\\n\\n\r\nSound 5/10: nothing special, neither in regard to music nor voice talent.\\n\\n\r\nCharacter 4/10:  Izumi actually experiences some growth, though it's minuscule. Ryouma gets over his initial disgust so fast it must have caused whiplash, but at least he didn't turn out as arrogant as he first came across -- never have I seen somebody kowtow more, which was interesting. The other characters are all barely there (I imagine the manga probably expands at least Rei and Shougo's roles, since they're obviously the secondary couple).\\n\\n\r\nEnjoyment 7/10:  I enjoyed it more than one might think from reading the preceding paragraphs, because the pacing was good and the characters were likeable, and I am grateful for any BL anime at all.  But I want to add something here for the reviewers who said:  \"yay, at least there was no rape or dubcon (dubious consent)!\"  You have been conditioned by too much bad BL.  There damn well was dubcon -- Izumi gets kissed many times without his consent, he gets nearly raped by Ryouma who only stops because Izumi is crying (though that actually tempts him too, which is a Japanese bullying trope I hate), he gets nearly raped by 3 strangers upon whom he comes in the process of a robbery.  On the plus side, the creators are at least not valorizing any of that, which is a step forward, but they're still playing it for laughs, and I can't express just how much I want BL to get further away from all the dubcon. Enthusiastic mutual consent is sexier than dubcon any day.",
            "date": "2016-09-20T00:49:00+00:00",
            "helpful_count": 7,
            "mal_id": 229573,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229573"
        },
        {
            "content": "Is no one going to mention how ONE OF THE MAIN CHARACTERS NEARLY RAPES THE OTHER??? \r\nThat ruined the whole anime for me. The characters are acting like it's not a big deal! It's infuriating!!! I will not ship a man who nearly raped another one WITH the victim. That's just fucked up.\r\nSure, at first the older brother was mad, but he saw that the rapist was seemingly depressed the next day, and THAT got rid of his anger. BULLSHIT. How dare they normalize rape instead of condemning it? There's no warning that it's going to happen, either. It just RANDOMLY happens. I can't eventhink of a reason as to WHY this led to the man trying to rape the other. This scene is completely unnecessary and, my best guess, is only inserted for \"fan service.\" \\n\r\nAssault isn't fucking okay. Stop trying to normalize it in the LGBT+ community. You won't see this shit anywhere else in anime.",
            "date": "2017-02-11T13:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 240369,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/memechelle",
                "username": "memechelle"
            },
            "url": "https://myanimelist.net/reviews.php?id=240369"
        },
        {
            "content": "Love Stage!! is a pretty good surprise in the BL genre. It's not incredible but gives us a fair love story and enjoyable characters.  \r\nStory: 6\r\nThe setting is common and overused in both shounen ai and shoujo manga, but it's not too long and unfolds well. Once you get into it, it can be pretty heart warming and has its inspirational moments. It's a relief that there are no dub/non-con in this story (and it is pretty sad that I have to mension this in my BL reviews).  \r\nArt: 6\r\nPretty good for a BL anime, and still very pink. \r\nSound: 6\r\nThe opening song,LΦVEST by SCREEN mode is a cheerful and happy tune, not unlike every other j-pop songs you could have heard in animes so far. \\n\r\nI admit it... I started watching LS!! because I knew Hirakawa Daisuke and Yonaga Tsubasa (respectively Rei Ryugazaki and Nagisa Hazuki in Free!) were acting in it. It was nice to hear their voices in the same anime again. Overall the voice acting is good.  \\n\\n\r\nCharacters: 6\\n\r\nThe characters aren't especially well written, but they come off as funny and enjoyable. They all have a little something that makes them likable in the end, and it is all we can ask for. I especially feel for Izumi, the main character.   \\n\\n\r\nEnjoyment: 7\\n\r\nYes! a decent BL love story! It's common and unoriginal but it keeps its promises.\\n\\n\r\nOverall: 6\\n\r\nIf you want to watch a cheesy BL story, Love Stage!! is a pretty good choice. It's short and nice. Don't expect a masterpiece and you will be pleased with what this anime has to offer. \\n\\n",
            "date": "2015-05-12T13:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 187683,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4605884.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pastabeanchuu",
                "username": "Pastabeanchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=187683"
        },
        {
            "content": "I made an account just to write this review. I think this show is funny and light-hearted, which is great. But there is something fundamentally wrong in the basis of their relationship. One of the characters sexually assaults another, and experiences no real consequences. Then, the guy who got assaulted (Izumi), was pressured to stop being a burden to his family. On top of that, his brother ends up sympathizing with the assaulter because he cries about how Izumi will never forgive him. But Izumi does. THIS IS WRONG. The show completely brushes over the assault and it's consequences on the characters as human beings.It even goes so far as to JUSTIFY THE ASSAULT as a part of their relationship. This is a major problem in the LGBT community, and anime about the community. ASSAULT AND RAPE ARE NOT, AND WILL NEVER BE OK. And it feels really ignored and brushed over here. Ignoring that part the show is great, but this has such a negative impact on ACTUAL people's lives.",
            "date": "2018-12-17T17:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 296016,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LunarEclipse1214",
                "username": "LunarEclipse1214"
            },
            "url": "https://myanimelist.net/reviews.php?id=296016"
        },
        {
            "content": "this is the first yaoi anime I have ever watched and  I want to admit it was very good. I thought that this anime would be uninteresting and the plot would be very bad but actually it was not. You may not be a yaoi fan but if you love romance animes you would enjoy this too. \r\nThe story is about a major otaku Izumi Sena who just entered college and wants to become a mangaka like his idol Saotome (the writer of Lalalulu). \r\nten years ago when he was 8 his parents were making appearance in a advertisement \"Happy Wedding\". this was thefirst time when he met Ryouma. (The girl for the commercial couldn't show up because her flight was delayed, so Izumi's mother volenteered him for the missing girl's role. Izumi ended up doing the commercial with Ryouma, and ended up dressing like a young female. )\\n\r\nRyouma fell for Izumi because he thought \"she\" was a girl. After 10 years they were shooting this commercial again. And this was the time when Ryouma found out that Izumi was a boy but after this his feelings didn't change. He continued loving Izumi and even confessed to him saying that he didn't care that he was a boy he still loved him. But at that time Izumi didn't love him so they remained as friends but after a short time Izumi fell in love with Ryouma and they ended as a couple.\\n\\n\r\nmaybe my review wasn't the best but the story is quite good. I would give it 8. Also the art was very good I liked it very much and I would give it 9. I enjoyed the opening and the ending very much too. Also I loved character's development. \\n\r\nThe anime had many comedy/romance moments and some dirty ( not too much ) moments which every fangirl (like me) would enjoy. So for the enjoyment I would give 8.\\n\r\nThe only thing I didn't like about the anime was that it was only 10 episodes ( I know that it had Ova too) but it would be better if it had more episodes.\\n\r\nBut I am a big romance fan and as my first yaoi anime it was quite very good . I recommend you this anime.\\n\\n\\n\r\n- sorry for my bad english. also this was my first preview so don't judge me-",
            "date": "2015-07-12T06:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 193199,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4617830.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MizukiHaruno",
                "username": "MizukiHaruno"
            },
            "url": "https://myanimelist.net/reviews.php?id=193199"
        },
        {
            "content": "I thoroughly enjoyed this anime even though I'm usually not usually into this genre. \r\nTO keep it brief, the reason why I liked it is because it is so funny, there are moments when you are rooting for the supporting characters as well as the main, and the characters are generally well developed in just the mere 10 episodes.\r\nBecause I am not usually into this genre, I found it a little bit uncomfortable in the intimate scenes, but if you substitute Izumi for a girl, it would be totally fine. However making him a guy makes it all the more hilarious. But yes, I wouldwarn people who are not usually into this genre that it may make you feel a little uncomfortable in some minute parts but all in all, please give it a go, it was very fun to watch. :)",
            "date": "2015-04-08T22:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 185188,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4548661.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MagicPotato98",
                "username": "MagicPotato98"
            },
            "url": "https://myanimelist.net/reviews.php?id=185188"
        },
        {
            "content": "If you are looking for a sweet, light-hearted love story, then regardless of your gender go for it, it will surely put a smile on your face. But if you are looking for some love story full of all types of emotion and struggles people go through when in a relationship then definitely Love Stage isn't for you.\r\nStory: The story is full of sweet and funny moments, there is hardly any scene that can make you sad or feel pity for the characters. Everything worked out well for the lead characters well, and I found this approach quite unrealistic. In a relationship, struggle becomes partof your life but our characters hardly faced any struggle. And I think that's what make this anime so lovable and cheerful. It really puts a smile on your face.\\n\\n\r\nCharacters: The lead characters are surely awesome but the same can't be said for the minor characters. The feminine features of Izumi are well justified and you can actually feel love busting out of Ryouma. Anybody in love can easily relate to Ryouma and that's what makes him the best character from this anime.\\n",
            "date": "2014-09-16T02:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 160585,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3892693.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AhmedAmin",
                "username": "AhmedAmin"
            },
            "url": "https://myanimelist.net/reviews.php?id=160585"
        },
        {
            "content": "I had very mixed feelings about this anime. While as a whole I didn't hate it, i spent a lot of my time screaming at my computer and I doubt I'd be able to recommend it to most of my friends. That being said, I'd be lying if I said it doesn't have good points. The artwork is detailed and interesting without being overwhelming, the music is good, The voice acting is nothing short of brilliant, I like the characters and *most* of the story works really well. \r\nBut it's big problem is it's use of sexual assault in the story. I actually would've beenalright with this had the character been properly called out for his actions and faced some kind of consequence for his actions, since a character with flaws doesn't fault the story itself if used correctly. But this doesn't happen, us as the audience aren't shown that this character has learned from his actions and are expected to root for him. It really says something about a love story when you can't morally root for the main pair.\\n\\n",
            "date": "2018-02-19T05:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 271927,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6948558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/NekoKuma",
                "username": "NekoKuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=271927"
        },
        {
            "content": "I like to think of myself as being open minded, but this show just has some effect on me, I just watch it and get all hot and bothered, sweat trails down my armpits all the way down to my underwear since that's all I'm wearing while I watch this show and I just get drenched.\r\nNow I'm not saying this show will make you go gay, but it's one of the best romantic comedies ever made even without the yaoi aspect in place, there's a few scenes some closed minded kids might think is close to rape -but as we say in the west, \"ifit doesn't go in, it didn't happen\", and so I'll start off by letting you know this is one of those series that gets better as you go, you'll watch episode 1 and be like \"eh this is like a 7.5/10\", then you'll see after the credits and think of that one asian guy in school yelling \"Ha! Gayyyy!\" from that movie none of us have actually seen. Then you'll go on to watch the next 2 episodes and just think to yourself \"I like where this is going\", then you watch a few more episodes and you're just like \"Oh man!\" and then you think to yourself \"If this has a good ending I'm gonna shit myself....\" because it's just that good. You finally get to the last episode, episode 10, everything is totally wrapped up and you just fell in love with 2 men and don't even feel gay about it and you're just left with this sense of fulfillment with your life.....then you find out there's an OVA literally titled \"Episode 11\" and you're in shock and dismay at the same time because you just hope they don't screw up those last 10 episodes for you, and then the planets align and a comet shoots by during a meteor shower and you snap a picture of them all in the same frame to have the OVA not only continue the story where it left off, but to make it even better....I know it doesn't seem possible, but this is the show you'll watch and right as you finish it you'll be covered in a thick white sticky substance and everyone will come in the room and you'll have to explain that there was a spooky ghost and it got ectoplasm everywhere like Randy Marsh from South Park.\\n\\n\r\nGo ahead, go watch it, but if you don't watch the OVA after the series you might as well give up on life.",
            "date": "2015-08-21T12:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 196690,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4825944.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rahzek",
                "username": "Rahzek"
            },
            "url": "https://myanimelist.net/reviews.php?id=196690"
        },
        {
            "content": "I have seen many a yaoi genre anime. In fact, maybe around 30-35% of anime I have seen falls in the yaoi category. But, I have to say that Love Stage!! has been my absolute favorite.\r\nMost yaoi or yuri go ahead and jump into the relationship aspect and everything that comes along to being in a relationship. However, nothing \"touchy touchy\" came along till the very end. The creators made sure to throw plenty of character development in which I looooooove. So if you enjoy an actual story and character development, but also want something that has a relationship aspect to it, this yaoi animeis for you. I gave this anime a 10 overall for those reasons.\\n\\n\r\nHowever, the art and sound could've been better. Admittedly, it wasn't my most favorite artwork I've seen. BUT, for a yaoi anime, it was decent. That's why it received a 7.\\n\r\nThe music in it wasn't very catchy or enticing which is why I gave that part a 6.\\n\r\nThe character and enjoyment obviously catches my attention more than anything else in an anime. If there isn't good character development, or none at all, and if it isn't enjoyable, it is automatically dropped. This wasn't the case for Love Stage!! I was captured all the way through the ten episodes. I was upset to find that there were only ten; however, which is a little disappointing only because I really got into the show.\\n\\n\r\nAll in all, Love Stage!! was highly enjoyable and even a straight male would enjoy it. If you haven't watched yet, I recommend you start it soon. (I've watched it twice.)",
            "date": "2015-07-22T01:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 194040,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1327829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/5sos",
                "username": "5sos"
            },
            "url": "https://myanimelist.net/reviews.php?id=194040"
        },
        {
            "content": "I'm, like, a little annoyed that I enjoyed this anime so much? It's 100% the type of corny, slightly trashy romances that a lot of people hate, but this one made me really happy? I shouldn't be giving it this high of a score, but I am because?\r\nFor real, this anime was so unexpected. I really didn't expect to enjoy it this much. I'm pretty sure most of it had to do with the little story that it told rather than anything else. The art style was nice, and mostly it didn't bother me, but it's one of those styles that makes everyone looks justa little bit *too* pretty, you know? The sound was alright, and the characters themselves were your standard romance (especially yaoi) characters. \\n\\n\r\nBut the way this anime was able to tell it's story was really charming and fun to watch. For starters, the humor in it was awesome. I think the reason I was able to enjoy it so much, cliche though it was, was because it was sort of taking the piss out of BL manga and that genre in general. Like, it knows it's cliche, and it runs with it. \\n\\n\r\nBeyond that, the romance aspect of it was told in a more realistic way than most other yaoi I've seen. I mean, it still wasn't extremely realistic, but the characters' developments within the story felt genuine to me.  I do wish there was more conflict involved in the anime, like maybe a quarrel with two certain characters or whatever. Also, I would've liked to see expansion on other characters besides the main, but all in all, I had a great time watching this anime.\\n\\n\r\nThe quality isn't really amazing if you compare it to other, super successful anime, but it's a good time, and that's why it's rated the way it is. Enjoyment is the most important thing to me, and this anime hit it. Honestly, I'd probably watch this again in the future. Just sayin'.",
            "date": "2019-03-08T21:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 303139,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=303139"
        },
        {
            "content": "So recently I finished a re-watch of this show a few weeks back and only now I'm reflecting it. So what can I say about the show? I really, really liked it.\r\nFrom the yaoi anime I've seen (JunJou Romantica) there seems to be a format with yaoi that goes on. There's the obvious seme and uke, the fact that the uke may not like the seme or the other way around, and there's a LOT of pinning down. \r\nLove Stage fulfills these criteria, yes, but I feel that has a charm that surpasses JunJou Romantica at least. The humor definitely springs from the main characterIzumi Sena, who gets wrapped up in his family's popular lifestyle, when instead he wants to be a mangaka. Plus, his Mom's name is Nagisa - and the seiyuu for Izumi voiced Nagisa in Free!.  Rei is also here, with the same seiyuu too!\\n\\n\r\nThe roles for who the seme and the uke are in this show is Ryouma as the Seme and Izumi as Uke. This is obvious in their appearances; Ryouma is a young, fit acting superstar. Izumi is an incredibly femmy young adult who has the ability to look EXACTLY like a girl with makeup and proper clothes - as expected with any closed, shut in otakus, I suppose. Their relationship is off to a rocky start, but then there's the whole thing with another trope I notice in yaoi anime, the eventual realization of being a homosexual. Ryouma begins with Izumi thinking he was a girl, but after a mishap with Izumi's brother (who's also gay) he horribly finds out he was a dude all along!\\n\\n\r\nOf course, as time ravels on, he continues to think of Izumi. This leads him to eventually have Izumi pinned down naked. Unlike with JunJou Romantica, the sex here is stylized and not as explicit. The manga, however, is extremely explicit, to which I HIGHLY recommend it on that basis! Either way, Izumi is creeped out by all this but eventually warms up to Ryouma once he does something FOR him! Wow! After buying Ryouma's bought him clothes and food on a date, it's only after he helps with Izumi's manga project is that he realizes he's not a bad guy after all. This struck me as weird on Izumi's character.\\n\\n\r\nEventually, both parties come to realize their love for one another after some weird trials. For me, this is one of the things I can't credit Love Stage for is the story. It's bothersome that Izumi has to realize his affection for Ryouma after Ryouma has done so much for him. It seems like to me he doesn't really love him at all. Another thing is how Ryouma even starts to love Ryouma in the first place. He latched onto a picture of a shota Izumi dressed as a little girl for 10 YEARS! Then in the manga, the story dives an irritatingly cheap plot line that'll be disclosed later. \\n\\n\r\nAfter all that rambling, what can I say overall? Well, Love Stage has a plot line that, while not frustratingly dumb or anything, is a bit questionable but still pulls off it's cute moments. Izumi and Ryouma aren't shallow and underdeveloped, they're real entertaining but still have their times when you want to seriously ask, \"Why?\" on what they do. Side characters like Rei and Izumi's brother, another couple in the show, are also good. Not dished to the side or anything, they work into the plot without being an annoyance half the time.\\n\\n\r\nI recommend this show, definitely should watch it if you're considering it.",
            "date": "2015-11-28T23:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 204403,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kon",
                "username": "kon"
            },
            "url": "https://myanimelist.net/reviews.php?id=204403"
        }
    ],
    [
        {
            "content": "I am a straight male.\r\nThis show is pretty good.\r\nI initially wrote off this show after seeing the now slightly famous intro scene, but soon, a joke amongst friends turned into a marathon of the six episodes that were out at the time. Every week after that, I looked forward to Wednesdays, where I'd get to see the next episode of Love Stage. At this point, after completing the series, the true question is this:\r\nWhy did I enjoy the show to the extent that I did?\r\nI mean, it is quite normal for one to enjoy a show that is that is directed towards a different targetaudience, (I.E. shoujos) and I have nothing but respect for yaoi and the culture, but me enjoying this would seem as a bit extreme...except its not.  \\n\\n\r\nWhat this show does well, and likely the biggest reason to why I enjoyed it, was the characters. I will say, I enjoyed the mere presence of almost every single character in this show. The first of the two protagonists is Izumi, the more feminine character of the relationship, and the youngest member of a family of world class entertainers. He has a dream to become a manga artist, however his complete lack of skill causes his family to worry to quite a large extent. Now, there is more to Izumi's wonderful eyes- His character is well developed throughout the show. We get to see all the trails and tribulations he goes through, whether it be with the relationship between him and the other protagonist, which I'll get to in a sec, or the constant tension with his family, who almost sees him as a lost cause.  Izumi certainly does go through some entertaining developments throughout the show. The largest cause of this is the other male in the relationship, Ryouma. Ryouma is a growing celebrity in Japan, being seen in commercials and dramas frequently. As the masculine man in the relationship, is it his duty to take charge and progress the relationship along, and this works to create a dynamic between the two characters that I personally found quite entertaining to watch. The other characters, while not particularly developed, certainly add to the overall show- They accentuate the protagonists, while at the same time, being likable. Characters like Izumi's brother, a member of a rock band modeled off the actual manga writer's brother, make for good laughs, as well as Rei, the manager of Izumi's family. The beautiful thing is, all of these characters are likable: you can relate to their issues, and actually care about what  becomes of them. When a character cried, I felt sad. When they were happy, so was I. This is the shows strongest point. All characters have their own moments in the story which makes for a good time. \\n\\n\r\n(Speaking of good time, I will warn that the show, while not a hentai, does contain its fair share of...*scenes* in it, so do be prepared for that.)\\n\\n\r\nAs for the story, it is actually nothing quite special, however this is not necessarily a bad thing. Does it take risks? Not particularly, but for what the show is trying to accomplish, (Displaying the relationship between the main characters.) it is quite serviceable. Without spoiling too much, the show begins with a standard romantic, almost love at first sight affair, but quickly turns into a comedic tale about a yaoi relationship. The best part about all this, is that it is quite hilarious. The actual chemistry between the characters is almost more important than the story said chemistry is attempting to progress in the first place. Every scene attempts to have a funny moment, whether it be regarding the hilarity of Izumi's manga, or the conversations between him and Ryouma. So honestly, the story may be weak, but that may be the point.\\n\\n\r\nTechnically, the show is quite decent. Animation is quite solid here. Nothing to write home about, honestly, but character movements are crisp, and the palette is quite vibrant, adding much to the style of the show. (I mean, Izumi's eyes!) Keen eyed individuals would notice some shoddy art quality on occasion, such as inconsistent character drawings, but this is a nit-pick at worst. Regarding the soundtrack, I would not likely listen to the tracks outside of the show, but they do serve the show well. Songs play at the right times, while the tracks do not stand out, they certainly do fit well with the emotions a particular scene is trying to emanate. The OP, but SCREEN mode, fits in very well with the show. These guys are fairly new to the anime scene, and I do hope to hear them featured in more shows down the road. The ED is slightly less appealing to me, but still works quite well.\\n\\n\r\nSo yeah, Love Stage. This is the first yaoi show that I've every completed, and while I do not believe that I'll be actively searching for more in the genre, I would be lying if I say I did not enjoy this show. The show is only 10 episodes, and while the length did not hurt the show, I definitely believe that it would have slightly benefited from the extra two episodes, for developmental reasons which you will likely see. Nonetheless, I'd  recommend it. Go watch it, you will invested in the characters, feel their emotions, and...yeah I still cant believe I watched a yaoi.\\n\\n\r\nHave fun.",
            "date": "2014-09-10T16:00:00+00:00",
            "helpful_count": 376,
            "mal_id": 159839,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/418710.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fearlessEdition",
                "username": "fearlessEdition"
            },
            "url": "https://myanimelist.net/reviews.php?id=159839"
        },
        {
            "content": "This is now one of my favourite animes, this is my first review so bare with me, I've never felt like writing one til i watched this anime. As a fan of yaoi/shounen ai this was a breath of fresh air as it's so hard to find decent animes in this genre because there are little to choose from and they're lacking in every department. \r\nThis is a -absolute must- watch for fans of the yaoi and shounen-ai, but also i would highly recommend it for those new to it and want to check it out, it would make a good starter into these genresbecause it's quite cute, nice animation, likeable characters, good development in only 11 episodes and also it's quite tame when it comes to the sexual things compared to other ones like Junjou Romantica, yet it's still enough too excited about.\\n\\n\r\nIzumi stared in a wedding commerical with Ryouma when they were younger and since then Ryouma has loved her..ahem him... ever since. Later they meet in a reunion commercial and Ryouma's love is releaved.. and so is Izumi's real gender, but that doesn't stop his love. And so Ryouma pursues Izumi. Izumi plays the Uke, he's very cute, and loveable i just wanted to squeeze him to bits. Ryouma as a famous actor I wasn't expecting him to be a such a lovable character. He was so sweet, caring and kind.. it was cute seeing what love does to him, he was the kind of guy I would want as my man. Overall I really liked them as a couple. The supporting charcaters were great aswell, especially Izumi's brother he's quite funny.\\n\\n\r\nThough there's only 11 episodes I was worried no way that's enough and I'll be disappointed cause it will leave me hanging incomplete. But actually it developed further than I thought in such the short time it was nice. Unlike other romance animes you have to wait for 24+ episodes just for a confession or even a kiss. I was excited for each episode and how it'd progress next.\\n\\n\r\nThe art was nice and especially the detail in Izumi eyes, so pretty. Only bad thing was lets say Izumi is walking down the street.. he will be detailed and everything but all the background people are whited out figures like ghosts or something which was a bit lazy. \\n\\n\r\nThere's not really any music in the anime it'self  other than the OP and ED, they're really catchy I would always sit through them, usually I skip through the Op and ED on animes and get straight to watching the anime.\\n\\n\r\nOnly downside was that Izumi is a hardout fan of a anime La la Lulu which i found a bit childish but it goes with his cute character but after awhile it was bit annoying, especially that La La Lulu alarm clock omg lol. But it effected the anime to where there were La La Lulu scenes.. some which toke minutes that I had to skip and I didn't see the point of myself and just wasted the screen time.\\n\\n\r\nMake sure you watch the OVA aswell for a total of 11 episodes. Though i wish there was more - there's alot of potiental for 2nd season, though the 11 are still satisfying.\\n\\n\r\nOverall don't miss out on this anime even if you don't watch shounen-ai, this is a good place to start especially if you're into the romance genre. I tend to watch only romance animes and the romance in this anime was great it got me excited and fangirling on the other side of the screen. So give it ago you won't regret it :)",
            "date": "2014-11-22T22:16:00+00:00",
            "helpful_count": 58,
            "mal_id": 169571,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3986493.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HeyYouPikachu",
                "username": "HeyYouPikachu"
            },
            "url": "https://myanimelist.net/reviews.php?id=169571"
        },
        {
            "content": "THIS REVIEW CONTAINS SOME SPOILERS, READ AT YOUR OWN RISK\r\nLove stage is a Shounen-ai anime. Most of the male population really won't enjoy this but it's mostly for girls. The anime is really good and was enjoyable with Comedy, Romance, Drama etc...\r\nStory -8\r\nStory's pretty good. Izumi wants to become a manga artist. His family is in show biz and so they want him to enter the show biz world. Note that he is only in college. He is often mistaken for a girl because of his cute looks and such. Ryouma, our main male character number 2, mistook him for a girl when they hadto do a commercial when they were young. After meeting 10 years later, Ryouma still has feelings, even after finding out Izumi was a guy. Izumi struggles to draw manga. It gets rejected and gets into despair. I really like Izumi's character development through out the show. He slowly realizes his feelings for Ryouma and gets into show biz in the end.\\n\\n\r\nArt - 8\\n\\n\r\nArt is beautiful but there were times were the art was iffy but it's good overall.\\n\\n\r\nSound 9\\n\\n\r\nI love the OP and END. There both really amazing and also the background music\\n\\n\r\nCharacter 9\\n\\n\r\nCharacters are great as well. A lot of development with Ryouma and Izumi. Shougo, Izumi's brother who is a musician, has some secret affair going on with Rei, the Sena family's manager. But no one really actually realizes it unless you really pay attention. Izumi's parents are side characters and so are his friends. Most characters get a development.\\n\\n\r\nEnjoyment 10\\n\\n\r\nIt was really enjoyable. It made me laugh. There was some sexual moments and they were steamy. The drama is good and they left us some cliffhangers. Romance is beautiful as well. Though no one knows Izumi and Ryouma are gay hehe. \\n\\n\r\nOverall this anime is great. If you're a yaoi lover than give it a watch, you'll love it. If you're a guy and watch Yaoi then I also recommend it. It's not as amazing compared to Sekaiichi Hatsukoi, but it's close. There isn't a lot of intimate scenes, maybe few. Unlike most of them that are M ;)\\n\\n\r\nSo give it a watch, and I'm sure you will like it, unless you hate Yaoi dont bother watching.",
            "date": "2014-09-10T21:56:00+00:00",
            "helpful_count": 36,
            "mal_id": 159869,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/741341.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SizzlingTear2",
                "username": "SizzlingTear2"
            },
            "url": "https://myanimelist.net/reviews.php?id=159869"
        },
        {
            "content": "As with any genre, yaoi/shounenai is often criticized by people who doesn't like it.  Actually shounen ai (and shoujo ai too) is mostly the same as ANY romantic comedy anime out there, the only difference is that the main couple features homoromantic characters, which tends to scare off straight viewers. \r\nThe thing with \"Love Stage!!\", what makes it so special, it's that for some reason it seems to have broken that genre barrier, and a big part of their viewers are straight male people who don't usually watch shounenai/yaoi shows.  \r\nThe premise of the story is very simple: Ryouma, a famous actor, fellin love with a girl when he was a child and has been obsessed with her memory since then, and once he meets 'her' again, now as a young adult, he discovers 'she' was actually a him: Izumi, a clumsy otaku with a showbusiness family. \\n\\n\r\nWhat makes it SO good is both the comedic value, because the story is tremendously HILARIOUS, and the characters itself, which are really very well developed in just a few episodes. \\n\\n\r\nThe art is pretty cool, nothing out of the \"shoujo norm\", but myself, i love the character design a lot. But i'm biased because i really love Zaou Taishi's drawing style. \\n\\n\r\nSo, i must say that if you are a fujoshi/fudanshi or a person who appreciates the genre just like me, this is a MUST watch. \\n\r\nIf you are a viewer who usually doesn't like yaoi/shounenai, or you haven't watch one ever, i will give it a try. Odds are you are going to like it... and if not, at least it's worth the laughs.",
            "date": "2015-03-09T14:16:00+00:00",
            "helpful_count": 36,
            "mal_id": 182049,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4493932.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/whiteteeth",
                "username": "whiteteeth"
            },
            "url": "https://myanimelist.net/reviews.php?id=182049"
        },
        {
            "content": "I first heard of this show by accidentally coming across its opening somewhere on the internet. From what I saw, it looked like this show was going to be about a healthy, consensual, small-age-gap relationship, which is a relationship I still have yet to see in yaoi. I find it a lot more in yuri, but hardly in yaoi. The two boys were holding hands, looking into each others eyes and had smiles on their faces. They both looked happy rather than one looking sexually pleased while the other wishes he was somewhere else. I really wanted to see if Japan can actually make ashow about a HEALTHY guy-on-guy relationship, and I thought this was going to be the one. I was wrong.\\n\\n\r\nThe first couple episodes were highly entertaining. One of the main characters, Ryouma is coming to the realization that he has feelings for another guy, Izumi and is going through a bunch of conflicting emotions, considering he thought he was straight before hand and he, at first, thought that Izumi was a girl. \\n\\n\r\nOne day, Ryouma goes over to Izumi's house. They start off with the usual awkward greeting. Then, Ryouma ends up chasing Izumi around the house and tackling him. Ryouma pulls his pants down and puts his mouth all over Izumi's lower half while Izumi is crying praying that this stops soon. Luckily, soon enough, Ryouma was caught in the act by Izumi's parents' manager and was forced to stop.\\n\\n\r\nAt first, I was glad that this scene was taken by the characters in a negative way. In the crunchyroll subs I was reading, the manager even referred to it as assault when reporting what happened to Izumi's brother, which I was really impressed with. In fact, Izumi's brother was ready to beat up Ryouma the next time he saw him as punishment for what he did to his little brother. I was even more pleased to find that Ryouma shortly thereafter revealed how guilty he feels about what he has done to a person he cares so much for and even apologizes to Izumi in the most sincerest of ways. I thought, \"Thank God Japan knows that rape is a terrible thing!!\" A couple episodes later, there was a scene that made me completely change my mind about that. \\n\\n\r\nIzumi went on for days without sleeping because he was trying to finish up a manga in time to enter it into a contest. As a way of strengthening their \"friendship\", Ryouma volunteered to help Izumi finish the manga in the last couple days before the contest. Just after the manga is finished, Izumi collapses to sleep and Ryouma carries him to his bed. Just before leaving Izumi's room, Ryouma couldn't resist, but take the opportunity to kiss Izumi while he is out cold. He planted a short one and then was ready to walk out, then thought, \"well, one more wouldn't hurt\". He kisses him again, and then thinks, \"Nah, maybe one more. Now one more. I swear, this will be the last one. No another wouldn't hurt.\" He ends up kissing Izumi all over his body and apparently it's alright because Izumi's unconscious. If I were in Izumi's situation, especially if I woke up in the middle of that, I would be furious. I stopped the episode in the middle of that scene and swore to never continue. I came out of it feeling extremely disappointed and in utter disbelief.\\n\\n\r\nAfter they showed one rape scene where they acknowledge that what Ryouma did to Izumi was terrible, they show another scene where he gets away with doing something not that much different. I never found out what happened after that scene, but I knew that it was either going to result in Ryouma getting away with what he did because no one was watching and Izumi was unconscious, which is not something I was going to like in the slightest, or that Ryouma does get caught, in which case, I can hardly imagine Izumi wanting to stay friends with him, let alone start a romantic relationship with him. \\n\\n\r\nLet me ask, do any of you know of any queer anime (especially yaoi) where the two main characters are in a healthy, consensual, relationship? I really want to find something out there that does. It would make me feel really happy to know that Japan realizes that gay relationships are not that different from straight ones. The only one I've come across that has come to that realization is Aoi Hana (highly recommend you watch that show instead).",
            "date": "2016-06-06T19:33:00+00:00",
            "helpful_count": 14,
            "mal_id": 220171,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5253211.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TanakaRiza",
                "username": "TanakaRiza"
            },
            "url": "https://myanimelist.net/reviews.php?id=220171"
        },
        {
            "content": "Love Stage started as a romantic comedy manga by Eiki Eiki and Zaou Taishi. In 2014 our old friends at J.C. Staff, behind such titles as Yami no Matsuei, Hachimitsu to Clover, Shakugan no Shana, Toradora and a bunch of other anime I've reviewed, started releasing an anime adaptation. Is it a romance that's worth your time? Let's examine it and find out. As it was Valentine's yesterday and this seems like a good week for some romance.\r\nStory:\r\nSena Izumi comes from a show business family. His mother is an actress. His father is in theatre and his elder brother is the lead singer of aband. Izumi, however, doesn't want to be in show business. He wants to be a manga writer and artist. In spite of not being good at drawing. I know how he feels. That's why all my writing just uses words. Things change for Izumi when he receives an offer to be the bride in an advert that's a follow up to one he was in a decade ago. He initially refuses but finds out that the other intended star, Ichijou Ryouma, won't take part unless the casting is the same as it was a decade ago. Reluctantly, Izumi agrees to take part for the sake of his family's business. Little does he realise that Ichijou's insistence has to do with the feelings he's harboured for a decade and little does Ichijou realise that the co-star he's been pining for is actually a boy. I detect incoming hijinks.\\n\\n\r\nThe biggest flaw with this series is that a lot of the early stuff involving the romance is questionable, at best. Ichijou carries around a picture of eight year old Izumi and he's been obsessing over him. That's pretty creepy. You'd think a mentally stable person would have gotten over their first crush given a decade. There's also a scene where Ichijou actively tries to force himself on Izumi which begs the question of why a light-hearted comedic romance involves attempted rape. That's not remotely suitable for the tone. To its credit, the series does acknowledge the atrocious nature of Ryouma's actions and spends a good amount of time having him try to redeem himself but it's still really tonally awkward and poor form for the start of a romance. There's also some awkwardness involving Izumi's brother harbouring a complex for him that borders on incestuous.\\n\\n\r\nOn the positive side, the romance does get pretty decent once its past the initial awkwardness. The comedic elements of the series also generally work pretty well. It's not uproariously funny comedy, but it is pretty good.\\n\\n\r\nCharacters:\\n\\n\r\nThis series has two types of characters. The first are the major characters who are a step or two above archetypes. They develop, albeit in kind of shallow ways, over the course of the series. The second are the side characters who are pretty much the epitome of generic. The interactions vary a bit. Izumi is unrealistically quick to forgive Ryouma but their latter interactions after that whole plot point dies down are pretty decent and develop almost naturally. My favourite interactions by far are between Izumi & Rei, a gent who acts as a guardian and parental figure towards him. It's a multi-faceted dynamic that can be genuinely heart-warming at times. Then we have the brotherly relationship which is far too clingy and a bit creepy.\\n\\n\r\nArt:\\n\\n\r\nThe artwork is, as a whole, pretty decent. The series does suffer a bit from the whole comedic undetailed moments that you get in a lot of series. The mouths are also a bit awkward both in how they move and in their appearance. I do quite like the way they do the eyes in the series, although the spectacles look awkward, and the regular scenes where they aren't doing something odd for comedic effect look quite nice. I also do like that Izumi's drawings are realistically amateurish. They don't make them look exaggeratedly bad like a lot of series that have a character who's supposed to be bad at artwork do.\\n\\n\r\nSound:\\n\\n\r\nThe cast in this is pretty good. Eguchi Takuya, Hirakawa Daisuke & Yonaga Tsubasa all deliver nice performances and the rest of the cast are all competent. The music was handled by Nakanishi Ryosuke and he did a decent enough job. It's not a soundtrack I'll be listening to on its own but it does get the job done.\\n\\n\r\nHo-yay:\\n\\n\r\nI've already talked about Izumi And Ryouma quite a bit but there's more homo-eroticism in the series than just the two of them. Towards the end it's heavily implied that Izumi's brother and Rei are in a sexual relationship. I don't know why they didn't do more that instead of focusing on the kind of creepy brother complex.\\n\\n\r\nFinal Thoughts:\\n\\n\r\nUltimately, Love Stage is a series that has a massive shadow hanging over it. The shadow of the messed up way the main romance starts. And while the series does markedly improve over that very poor first impression, it never quite breaks away from it. Ultimately, those things it does well kind of strike a balance with those it does poorly. Is it a bad series? No. It has quite a few funny moments and the latter stuff with the romance is decent enough. Is it a good one? Also no. It's simply hurt too much by the tonal awkwardness in the beginning and by the whole brother complex aspect. In the end, it's pretty average. My final rating is going to be a 5/10. If you like romances and can forgive the whole way things open, you'll probably get some enjoyment from it. Next week I'll look at JoJo no Kimyou na Bouken: Stardust Crusaders series 2.",
            "date": "2017-02-15T13:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 240648,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=240648"
        },
        {
            "content": "So... Um yeah.\r\nHonest, this anime really isn't any good. \r\nIn fact, I'd probably go as far as saying it's actually bad. To be honest, I'm kind of ashamed to even say I watched and enjoyed it. Is this what fanservice obsessed men feel like when watching something like Highschool DxD? I feel like trash for enjoying it.\r\nWell, if you like BL, then this is probably going to satisfy your needs. But good lord. Everything about this anime is implausible, silly and over the top; the story doesn't even justify watching it because the character development is just so mediocre. Still, I enjoyed it.\r\nSigh.",
            "date": "2018-08-08T22:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 285974,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3731383.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lovelysweetdream",
                "username": "lovelysweetdream"
            },
            "url": "https://myanimelist.net/reviews.php?id=285974"
        },
        {
            "content": "The teenage years are often referred to as the best years of your life, but they can come with their own set of challenges...  It’s the time of life where you’re still finding out who you are, who you want to be, and what’s important to you.  Even as late as the crucial age of 18, it can be difficult to find your place in the world, especially if you’re struggling to find the place where you belong.  This is even worse for Sena Izumi, because in addition to his more normal adolescent woes, he’s the youngest member of an entire familyof entertainers and celebrities...  His sly father is a stage actor, his spoiled mother is a model/actress, his doting brother is the lead singer of a popular rock band, his family has it’s own talent manager...  And he wants to be a manga artist.  Naturally, this has caused a bit of friction in the family, as the excitable and outgoing Sena family is  beginning to seriously worry about their youngest son, who’s locked himself in his room like a hermit and dedicated his life to a passion that they believe he has no talent for the field that he dreams of finding success in, and they’ve decided to do whatever it takes to get him out of his introverted shell.\\n\\n\r\nFortunately for them, an opportunity to do so has just presented itself.  When Izumi was only eight years old, he was dressed up like a girl for a wedding scene in a commercial, and the company wants to do an anniversary commercial...  A sequel, where the children from the original classic have grown up and are marrying themselves.  After some creative persuasion from his brother, Izumi agrees to don the drag dress one more time, but little does he know that his walk down the aisle is leading him into the arms of destiny.  His costar, the now famous Ryoma Ichijou, has been in love with him since the first commercial, and this isn’t just imprinting...  The sight of her face has gotten him through ten long years of hardship in the entertainment industry, and it was HIS idea to get the original cast back so he could finally make his dreams of seeing her again come true.  Will his discovery of his bride’s true gender bring his longing to a grinding halt, or has he come too far to turn back now?  And what kind of effect will getting caught up in all of this have on Sena’s routine lifestyle?  They may only be married in fiction, but the red string of fate is all too real.\\n\\n\r\nLove Stage comes to us from JC Staff, who I believe I’ve said before has no real consistency in it’s visual presentation.  It goes all over the place in terms of quality, but out of the three general camps that I mentioned in my Kill Me Baby review, I’d say Love Stage fits nicely into Camp 3.  This is, once again, the camp where anime has a modest budget, there’s no real room for excess, and they do whatever they can to make the show look as good as possible without putting themselves into a compromising financial situation.  Much like other shows in this camp, Love Stage never really goes out of it’s way to impress you with it’s animation, but it still looks fucking great.  The characters use very simple movements whenever motion is needed, and it never tries to do more than it needs to, while at the same time never feeling like it’s skimping.  There are budget saving tricks at play, but the producers were clever enough to make sure it all felt like part of the visual style and tone of the series, which they succeeded at.\\n\\n\r\nAnd speaking of the visual style, this is a very beautiful show just in terms of it’s art alone.  For about 90 percent of the series, the color palette is bright, warm and welcoming, almost like it knew how intense it’s kind of subject matter could be, and was designed to put viewers at ease right from the early stages.  The other ten percent of the time, when the show does get a bit darker, what with the characters dealing with issues and internal turmoil, the palette changes to reflect this, but it’s never for long.  The level of detail is also stunning, with it’s depiction every little crack in a shattered marble only being the tip of the iceberg.  Just about everything in the background is shown with intricate detail aside from the people, who are drawn as colorless silhouettes, and while I’d normally rag on a show for this...  RWBY season 1, how ya doing...  The fact that it only really happens when a character is busy with internal monologues does make it feel like an accurate portrayal of their distracted mindset.\\n\\n\r\nWhile I’m not a fan of shiny white halos surrounding a character’s hair...  I’ve bitched about it before, and sorry, but I’m not cool with it here either...  The character designs are otherwise very attractive and tell us a lot about the characters as people.  Ryouma and Izumi in particular were designed to fall right in the middle of masculinity and femininity, as they’re obviously coded male, but they still have the big moe eyes, slender bodies and feathery hair that’s just long enough to frame their faces, and the details that would normally code a character as seme or uke are more than just there, they’re ingrained into their personalities.  Izumi’s eyes in particular are multi-colored, mostly amber but touched by a subtle swirl of blue at the tops, giving them a mysterious quality that you can understand someone getting entranced by.  The other characters in the cast are fairly generic in design, but it doesn‘t really hurt anything, as their looks do inform their personalities.  I do feel that the blushing artwork is a little too over-pronounced, but that’s a minor issue.\\n\\n\r\nThe music is a bit on the generic side, but it’s not bad or anything.  I didn’t find any of it to be repetitive or annoying, like in a lot of shows I’ve seen.  The character songs are a lot more interesting, with LalaLulu’s song being a delightful parody of the Magical girl genre, and Izumi’s brother Shougo has a really cool song called Love or Die, and yeah, I can see why the band Crusherz became famous.  The opening, Lovest by Screen Mode, is awesome.  Not only is the song catchy, upbeat and fun to listen to, but the video is just as fun and fits every beat perfectly.  The constantly changing visuals are simple enough to grasp what they’re showing you in the time they have, and they match the energy and tone of the show.  Surprisingly, the ending theme is more of the same, a catchy song with visuals that are pleasing to the eyes and match the beat of the song, and while most of it features posed characters, there’s an actual burst of expensive animation towards the end.  I can’t remember another show where I watched all the way through the opening and closing as often as I did with this one.\\n\\n\r\nThere’s no dub, and I’m not a good judge of Japanese acting, but I’d just like to point out that if there’s ever a dub for this show, I hope they cast Chris Patton as Ryouma and Greg Ayres as Izumi.  Moving along.\\n\\n\r\nOkay, let’s just rip this band-aid off right now...  Love Stage is a yaoi.  It’s not a shonen-ai, oh no, it’s a full on yaoi.  I’ve never reviewed a yaoi before, but that doesn’t mean I haven’t seen any.  While I’m no expert on the genre, I have dabbled a bit, and unfortunately, what I’ve seen prior to Love Stage wasn’t all that impressive.  I read the first few volumes of Loveless, I saw the first four episodes of Gravitation, I’ve seen the movie Fake, and while it’s more subtextual than anything else, I sat through the first season of Black Butler.  In short, my exposure to the medium has revealed it to be a minefield of problematic situations and over-all just shitty story-telling, relying way too heavily on love at first sight, people turning queer out of nowhere on a dime because the plot demanded it, romanticized sexual assault, writers who forgo necessary information and development because seem to just want to get to the action already, and way too many couple where the age differences lay on different sides of the law.  I’ve been told by people far more versed in the genre than I am that most if not all of these observations are persistent from title to title.\\n\\n\r\nNow, does that mean there are no good Boys Love material out there?  No, not necessarily.  I plan to watch Yuri on Ice and Nabari no Ou in the future, and I’ve even seen some shows that I thought would have been improved if the main male characters went gay for each other...  Kids on the Slope, for example.  But alas, thank the LGBT gods, there is at least one good yaoi anime out there.  I’ve already praised the art and animation from this show up and down the wall, but the number of problems and genre cliches Love Stage avoids, subverts, or just has fun with is insane.  Now keep in mind, I’m not saying it’s an accurate portrayal of homosexual people or homosexual couples, and I’m not saying it presents it’s gay characters as realistic people or that it exists for reasons outside of tickling the libidoes of ravenous fujoshi, but that doesn’t mean it can’t be good.  Yeah, I made a big deal about figuring out whether or not Strawberry Panic was faithful to it’s subject, but that show was garbage and needed the extra point.  Love Stage doesn’t have that problem.\\n\\n\r\nRight off the bat, we’re introduced to the main character, Sena Izumi, the uke of the situation.  Oh, but we find out much more than that about him.  After making sweet promises to us in the form of it’s animation, Love Stage wastes no time establishing Izumi’s character.  We find out who he is, what he wants from life, what his family’s like, what his backstory was like, what his issue is, several possible resolutions to it, basically everything you need to know about him, and this is expressed without a lick of unnatural dialogue or exposition, and even better, we learn all of this before the first kiss is even taken.  We don’t learn quite as much about his seme Ryouma until much later, but we know about their shared history, and through his actions revolving around his interactions with Izumi and his coworkers, we do learn enough about him to not have any lingering questions about him that really need to be answered.  I can’t say they feel like people I’d meet out there in the real world, but they still feel like fully developed and fleshed out characters.\\n\\n\r\nThey also both have personalities that tie directly into their seme/uke coding, with Izumi being childish and submissive, but still driven by his own interests and possessing a decent level of propriety and agency.  Ryouma is tall, dark and mysterious, quick to anger and somewhat closed off, but still struggling with the conflicting feelings inside of him and trying his best to control the parts of himself he doesn’t quite understand yet.  While it takes them a while to work out their personal hang-ups and finally come together, they do make a really likeable couple.  I also really liked the Izumi family, as viciously manipulative and backstabbing as they can be.  Shougo, Izumi’s older brother, dotes on him and gets clingy to the point that he honestly can be a little creepy at times, but he still has plenty of moments where he redeems himself by showing a genuine concern and protecting him.  We don’t see much of Izumi’s parents, but despite Dad acting like he knows best and Mom acting self-centered, they both clearly love their children.  \\n\\n\r\nPerhaps the most nuanced character is the family’s manager, Rei, a cold and calculating character who’s not above pulling the strings whenever necessary, selling people out to family obligations and looking for every possible advantage in his day-to-day dealings, but he still cares enough about his employers that he’ll set aside all of his business concerns if it feels like the right thing to do.  Izumi’s manga club, only one of whom kind of registers his presence, is designed so that he’ll look out of place there, not that he ever notices.  Similarly, the fictional character of Lala-Lulu, his fantasy Waifu idol, is so far removed from bearing any resemblance to actual girls that it’s not hard to see how disingenuine his attraction to the fairer sex really is.  A few of the characters can get annoying at times, the fat otaku feel like an unjust stereotype, and I’m pretty sure I’d have a gripe with Izumi’s parents if they were given more to do, but over-all, I really liked all of these characters.  I’ll admit that Ryouma does test me a little, but that just leads me to a few other cliches.\\n\\n\r\nFirst of all, there’s the love at first sight cliche, which Ryouma falls neatly into.  He’s been in love with a certain girl since they were 8, and while that would normally earn an eyeroll at best from me, the fact that his love for her carried him through the entertainment industry...  A field of work where you NEED to hold onto some form of innocense to survive, let alone succeed...  I can give it a pass.  Plus, with Izumi turning out to be a gut, and Ryouma being unable to shake the feeling anyway, it does feel like Love Stage is having fun with this cliche, rather than using it straightforwardly.  Ryouma’s feelings are portrayed as crazy, but not the stalker kind of crazy...  The romantic kind, where you know your love for someone makes no sense, and is totally out ofl eft field, but you’ll still stay true to who you are and who you love, the world be damned if it stands in the way.  This is probably the best usage of love at first sight that I’ve seen in an anime, let alone in a yaoi, but unfortunately, Ryouma falls into other cliches that are much harder to forgive.\\n\\n\r\nA constant occurrence in yaoi is rape.  It may not be carried all the way through, but it’s there, from gay characters in non-yaoi shows that speak in exaggerated falsetto and frequently make unwelcome advances on straight characters, to attempted rape that’s played for laughs, to actual rape that’s romanticized and sparks a new level of romance as a result.  And yes, there is a point where this show gets...  Rapey.  I won’t tell you exactly what happens, or the reason that it happens, but three episodes in, Ryouma does something, and he winds up losing control of himself and coming within a hair’s breadth of doing something he’d never be able to take back, before he’s interrupted and the unforgivable thing is just barely prevented, but here’s where Love Stage takes a major step away from the worst of it’s genre...  What he does is considered to be a bad thing.  The writers don’t try to sweep it under the rug, oh no, it’s painted exactly the way it should be, and it’s this turning point that really got me invested in this pairing.\\n\\n\r\nAfter the...  thing...  Ryouma feels genuine remorse, and he has to apologize and earn Izumi’s trust back before he can even THINK about pursuing a relationship.  He’s accepted his feelings by this point, but Izumi is a much harder sell, and even though he buries the hatchet with him...  Mostly out of pity...  It isn’t until Ryouma proves his devotion by getting involved with Izumi’s lifelong passion, helping him along towards his goal, and doing everything in his power to encourage him and build him back up when things don’t go the way he wanted.  He slips back into problematic territory when he kisses Izumi a bunch of times in his sleep...  I mean, come on, seriously?  But he earns those points back when he refuses a carnal offer that he can tell Izumi doesn’t really mean.  I won’t say whether or not these two wind up together in the end, but...  Isn’t that alone a breath of fresh air?  The fact that you can’t tell?  Yeah, they have numerous encounters, both as friends and as romantic prospects, but the outcome of their time together is just as engaging as the journey there.\\n\\n\r\nLove Stage is available from Sentai Filmworks.  The original manga by Eiki Eiki is available from SuBLime.  The original light novel is not available stateside,  but the series can also be viewed on Crunchyroll.  There’s an OVA episode on the DVD that I highly recommend, and as for what it’s about, let’s just say it’s more of Ryouma being a pain in the ass.\\n\\n\r\nNow, after all the time I’ve spent talking about how good this title is compared to other titles in the Boys’ Love genre, and how it deconstructs and subverts a bunch of troublesome tropes, the reaction I’m probably getting from most readers is...  So what?  Even if it’s a good yaoi, it’s still a yaoi, and most of the anime fanbase will have no interest in that kind of content.  Well, there is one thing about Love Stage that I feel gives it a more universal appeal:  This show is fucking hilarious.  I was hooked right from the first time that Shougo manipulated Izumi with Lala Lulu merchandise, and Ryouma’s reaction to Izumi’s gender reveal was just icing on the cake.  It’s visual style works extremely well with it’s comedic timing, which follows a healthy combination of gag and character-based jokes, most of which hit their mark.  It was almost enough for me to forgive some of the more problematic scenes, including Ryouma’s missteps and an attempted gang-bang towards the end that came right the fuck out of nowhere.  It’s a yaoi, so it’s going to be a mixed bag, but it’s a bag I won’t mind reaching into a few more times.  I give Love Stage an 8/10.",
            "date": "2017-07-29T05:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 254123,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=254123"
        },
        {
            "content": "I never quite know whether I should try to rate BL anime within its own genre or not, but since MAL makes no genre distinctions when showing top anime, it seems fairer to rate it as I rate all other anime.  But I will point out where it stands within its own genre.\r\nI am gay and used to read a lot of BL. Tip to North American audiences:  in these reviews most people use confusing terminology, so here's a quickie refresher.  BL (Boys Love) is what the Japanese call boy-on-boy manga and anime mostly written by women and mostly directed at women.Yaoi in Japan only refers to very explicit BL doujinshi (fan fiction), which are basically pornographic without much plot.  In the West, people tend to misuse yaoi for boy-on-boy romantic works with some amount of actual sex being portrayed, while some call romantic works without explicit sex shounen-ai.  Again, that's not the term used in Japan, where shounen-ai only refers to a very narrow part of BL produced in the 1970s and 80s by a specific group of mangaka who expanded very romantic, idealized, exoticized shoujo concepts to boys.  Do yourselves a favour and learn to call boy-on-boy manga and anime BL, that way you're in tune with the country that actually produces most of it, and it'll reduce confusion.  This anime is BL, without graphically explicit sex.  Here endeth the lecture  ;)\\n\\n\r\nLove Stage!! turned out to be a fluffy, mildly amusing, quite inoffensive BL anime.  I have not read the source manga, but BL anime is almost always less explicit than its source.  If you think homosexuality is a sin, don't watch it.  If the thought of boy-on-boy sex makes you a bit uncomfortable because you're a straight guy, I think you can fairly safely watch this without breaking out in hives.  There is clearly some sex happening, but it is stylized away in a rather imaginative way; nothing is ever shown graphically, other than kisses, and even those are darn tame; no lips as much as move.  I gotta say I especially loved the pink elephants, that had me laughing out loud.  Most of the humour is also not suggestive, and while there is some fan service, it doesn't even get close to hetero ecchi -- we get some naked torsos without nipples, woohoo. Most of the anime consists neither of lovey-dovey action nor of sex, it spends more time on Izumi's attempts to find himself, career-wise and romantically.\\n\\n\r\nStory 4/10:  Anime in general doesn't necessarily come up with believable stories, but the fluffier BL often takes the cake.  Ryouma, an up-and-coming hot actor, when he was a boy apparently fell in love with an 8 year old crybaby girl based on a single encounter, and carries that flame in his heart for the next 10 years.  Yeah, tell me another one.  When he has a chance to meet that girl again, he grabs it, and finds his love confirmed as the girl has grown up into a super-cute young woman.  Only, she's not actually a girl, she's a boy.  Henceforth we get the usual disgust upon the denouement from both Ryouma and Izumi, the cross-dressing boy in question, but love naturally conquers all in no time flat, without a whole lot of hesitation.  This is basically completely unrealistic on all levels, and because it's also thoroughly tropey, and one of my least favourite tropes are the stereotyping of seme/uke roles (sexually dominant / submissive), and the feminizing of the uke, I don't give it a lot of points.  Redeeming factors are that Ryouma actually tries to connect with Izumi on a personal level, and that Izumi doesn't get stuck in his panicked reactions but thinks further.  Still, it's all very shallow.  Most of the comedy wasn't funny to me, though I laughed at some of the visuals.\\n\\n\r\nArt 5/10:  I'm not a big fan of Zaou Taishi; I find her mouths very unattractive, and her lines too heavily inked.  But it's all very bright and colourful, with lovely eyes in shades no human ever had.  ;)  The animation is decent for BL, not so much in general -- BL anime tends to have very small budgets and it always shows, though this is better than what it used to be.\\n\\n\r\nSound 5/10: nothing special, neither in regard to music nor voice talent.\\n\\n\r\nCharacter 4/10:  Izumi actually experiences some growth, though it's minuscule. Ryouma gets over his initial disgust so fast it must have caused whiplash, but at least he didn't turn out as arrogant as he first came across -- never have I seen somebody kowtow more, which was interesting. The other characters are all barely there (I imagine the manga probably expands at least Rei and Shougo's roles, since they're obviously the secondary couple).\\n\\n\r\nEnjoyment 7/10:  I enjoyed it more than one might think from reading the preceding paragraphs, because the pacing was good and the characters were likeable, and I am grateful for any BL anime at all.  But I want to add something here for the reviewers who said:  \"yay, at least there was no rape or dubcon (dubious consent)!\"  You have been conditioned by too much bad BL.  There damn well was dubcon -- Izumi gets kissed many times without his consent, he gets nearly raped by Ryouma who only stops because Izumi is crying (though that actually tempts him too, which is a Japanese bullying trope I hate), he gets nearly raped by 3 strangers upon whom he comes in the process of a robbery.  On the plus side, the creators are at least not valorizing any of that, which is a step forward, but they're still playing it for laughs, and I can't express just how much I want BL to get further away from all the dubcon. Enthusiastic mutual consent is sexier than dubcon any day.",
            "date": "2016-09-20T00:49:00+00:00",
            "helpful_count": 7,
            "mal_id": 229573,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229573"
        },
        {
            "content": "Is no one going to mention how ONE OF THE MAIN CHARACTERS NEARLY RAPES THE OTHER??? \r\nThat ruined the whole anime for me. The characters are acting like it's not a big deal! It's infuriating!!! I will not ship a man who nearly raped another one WITH the victim. That's just fucked up.\r\nSure, at first the older brother was mad, but he saw that the rapist was seemingly depressed the next day, and THAT got rid of his anger. BULLSHIT. How dare they normalize rape instead of condemning it? There's no warning that it's going to happen, either. It just RANDOMLY happens. I can't eventhink of a reason as to WHY this led to the man trying to rape the other. This scene is completely unnecessary and, my best guess, is only inserted for \"fan service.\" \\n\r\nAssault isn't fucking okay. Stop trying to normalize it in the LGBT+ community. You won't see this shit anywhere else in anime.",
            "date": "2017-02-11T13:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 240369,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/memechelle",
                "username": "memechelle"
            },
            "url": "https://myanimelist.net/reviews.php?id=240369"
        },
        {
            "content": "Love Stage!! is a pretty good surprise in the BL genre. It's not incredible but gives us a fair love story and enjoyable characters.  \r\nStory: 6\r\nThe setting is common and overused in both shounen ai and shoujo manga, but it's not too long and unfolds well. Once you get into it, it can be pretty heart warming and has its inspirational moments. It's a relief that there are no dub/non-con in this story (and it is pretty sad that I have to mension this in my BL reviews).  \r\nArt: 6\r\nPretty good for a BL anime, and still very pink. \r\nSound: 6\r\nThe opening song,LΦVEST by SCREEN mode is a cheerful and happy tune, not unlike every other j-pop songs you could have heard in animes so far. \\n\r\nI admit it... I started watching LS!! because I knew Hirakawa Daisuke and Yonaga Tsubasa (respectively Rei Ryugazaki and Nagisa Hazuki in Free!) were acting in it. It was nice to hear their voices in the same anime again. Overall the voice acting is good.  \\n\\n\r\nCharacters: 6\\n\r\nThe characters aren't especially well written, but they come off as funny and enjoyable. They all have a little something that makes them likable in the end, and it is all we can ask for. I especially feel for Izumi, the main character.   \\n\\n\r\nEnjoyment: 7\\n\r\nYes! a decent BL love story! It's common and unoriginal but it keeps its promises.\\n\\n\r\nOverall: 6\\n\r\nIf you want to watch a cheesy BL story, Love Stage!! is a pretty good choice. It's short and nice. Don't expect a masterpiece and you will be pleased with what this anime has to offer. \\n\\n",
            "date": "2015-05-12T13:07:00+00:00",
            "helpful_count": 7,
            "mal_id": 187683,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4605884.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pastabeanchuu",
                "username": "Pastabeanchuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=187683"
        },
        {
            "content": "I made an account just to write this review. I think this show is funny and light-hearted, which is great. But there is something fundamentally wrong in the basis of their relationship. One of the characters sexually assaults another, and experiences no real consequences. Then, the guy who got assaulted (Izumi), was pressured to stop being a burden to his family. On top of that, his brother ends up sympathizing with the assaulter because he cries about how Izumi will never forgive him. But Izumi does. THIS IS WRONG. The show completely brushes over the assault and it's consequences on the characters as human beings.It even goes so far as to JUSTIFY THE ASSAULT as a part of their relationship. This is a major problem in the LGBT community, and anime about the community. ASSAULT AND RAPE ARE NOT, AND WILL NEVER BE OK. And it feels really ignored and brushed over here. Ignoring that part the show is great, but this has such a negative impact on ACTUAL people's lives.",
            "date": "2018-12-17T17:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 296016,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LunarEclipse1214",
                "username": "LunarEclipse1214"
            },
            "url": "https://myanimelist.net/reviews.php?id=296016"
        },
        {
            "content": "this is the first yaoi anime I have ever watched and  I want to admit it was very good. I thought that this anime would be uninteresting and the plot would be very bad but actually it was not. You may not be a yaoi fan but if you love romance animes you would enjoy this too. \r\nThe story is about a major otaku Izumi Sena who just entered college and wants to become a mangaka like his idol Saotome (the writer of Lalalulu). \r\nten years ago when he was 8 his parents were making appearance in a advertisement \"Happy Wedding\". this was thefirst time when he met Ryouma. (The girl for the commercial couldn't show up because her flight was delayed, so Izumi's mother volenteered him for the missing girl's role. Izumi ended up doing the commercial with Ryouma, and ended up dressing like a young female. )\\n\r\nRyouma fell for Izumi because he thought \"she\" was a girl. After 10 years they were shooting this commercial again. And this was the time when Ryouma found out that Izumi was a boy but after this his feelings didn't change. He continued loving Izumi and even confessed to him saying that he didn't care that he was a boy he still loved him. But at that time Izumi didn't love him so they remained as friends but after a short time Izumi fell in love with Ryouma and they ended as a couple.\\n\\n\r\nmaybe my review wasn't the best but the story is quite good. I would give it 8. Also the art was very good I liked it very much and I would give it 9. I enjoyed the opening and the ending very much too. Also I loved character's development. \\n\r\nThe anime had many comedy/romance moments and some dirty ( not too much ) moments which every fangirl (like me) would enjoy. So for the enjoyment I would give 8.\\n\r\nThe only thing I didn't like about the anime was that it was only 10 episodes ( I know that it had Ova too) but it would be better if it had more episodes.\\n\r\nBut I am a big romance fan and as my first yaoi anime it was quite very good . I recommend you this anime.\\n\\n\\n\r\n- sorry for my bad english. also this was my first preview so don't judge me-",
            "date": "2015-07-12T06:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 193199,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4617830.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MizukiHaruno",
                "username": "MizukiHaruno"
            },
            "url": "https://myanimelist.net/reviews.php?id=193199"
        },
        {
            "content": "I thoroughly enjoyed this anime even though I'm usually not usually into this genre. \r\nTO keep it brief, the reason why I liked it is because it is so funny, there are moments when you are rooting for the supporting characters as well as the main, and the characters are generally well developed in just the mere 10 episodes.\r\nBecause I am not usually into this genre, I found it a little bit uncomfortable in the intimate scenes, but if you substitute Izumi for a girl, it would be totally fine. However making him a guy makes it all the more hilarious. But yes, I wouldwarn people who are not usually into this genre that it may make you feel a little uncomfortable in some minute parts but all in all, please give it a go, it was very fun to watch. :)",
            "date": "2015-04-08T22:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 185188,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4548661.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MagicPotato98",
                "username": "MagicPotato98"
            },
            "url": "https://myanimelist.net/reviews.php?id=185188"
        },
        {
            "content": "If you are looking for a sweet, light-hearted love story, then regardless of your gender go for it, it will surely put a smile on your face. But if you are looking for some love story full of all types of emotion and struggles people go through when in a relationship then definitely Love Stage isn't for you.\r\nStory: The story is full of sweet and funny moments, there is hardly any scene that can make you sad or feel pity for the characters. Everything worked out well for the lead characters well, and I found this approach quite unrealistic. In a relationship, struggle becomes partof your life but our characters hardly faced any struggle. And I think that's what make this anime so lovable and cheerful. It really puts a smile on your face.\\n\\n\r\nCharacters: The lead characters are surely awesome but the same can't be said for the minor characters. The feminine features of Izumi are well justified and you can actually feel love busting out of Ryouma. Anybody in love can easily relate to Ryouma and that's what makes him the best character from this anime.\\n",
            "date": "2014-09-16T02:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 160585,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3892693.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AhmedAmin",
                "username": "AhmedAmin"
            },
            "url": "https://myanimelist.net/reviews.php?id=160585"
        },
        {
            "content": "I had very mixed feelings about this anime. While as a whole I didn't hate it, i spent a lot of my time screaming at my computer and I doubt I'd be able to recommend it to most of my friends. That being said, I'd be lying if I said it doesn't have good points. The artwork is detailed and interesting without being overwhelming, the music is good, The voice acting is nothing short of brilliant, I like the characters and *most* of the story works really well. \r\nBut it's big problem is it's use of sexual assault in the story. I actually would've beenalright with this had the character been properly called out for his actions and faced some kind of consequence for his actions, since a character with flaws doesn't fault the story itself if used correctly. But this doesn't happen, us as the audience aren't shown that this character has learned from his actions and are expected to root for him. It really says something about a love story when you can't morally root for the main pair.\\n\\n",
            "date": "2018-02-19T05:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 271927,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6948558.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/NekoKuma",
                "username": "NekoKuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=271927"
        },
        {
            "content": "I like to think of myself as being open minded, but this show just has some effect on me, I just watch it and get all hot and bothered, sweat trails down my armpits all the way down to my underwear since that's all I'm wearing while I watch this show and I just get drenched.\r\nNow I'm not saying this show will make you go gay, but it's one of the best romantic comedies ever made even without the yaoi aspect in place, there's a few scenes some closed minded kids might think is close to rape -but as we say in the west, \"ifit doesn't go in, it didn't happen\", and so I'll start off by letting you know this is one of those series that gets better as you go, you'll watch episode 1 and be like \"eh this is like a 7.5/10\", then you'll see after the credits and think of that one asian guy in school yelling \"Ha! Gayyyy!\" from that movie none of us have actually seen. Then you'll go on to watch the next 2 episodes and just think to yourself \"I like where this is going\", then you watch a few more episodes and you're just like \"Oh man!\" and then you think to yourself \"If this has a good ending I'm gonna shit myself....\" because it's just that good. You finally get to the last episode, episode 10, everything is totally wrapped up and you just fell in love with 2 men and don't even feel gay about it and you're just left with this sense of fulfillment with your life.....then you find out there's an OVA literally titled \"Episode 11\" and you're in shock and dismay at the same time because you just hope they don't screw up those last 10 episodes for you, and then the planets align and a comet shoots by during a meteor shower and you snap a picture of them all in the same frame to have the OVA not only continue the story where it left off, but to make it even better....I know it doesn't seem possible, but this is the show you'll watch and right as you finish it you'll be covered in a thick white sticky substance and everyone will come in the room and you'll have to explain that there was a spooky ghost and it got ectoplasm everywhere like Randy Marsh from South Park.\\n\\n\r\nGo ahead, go watch it, but if you don't watch the OVA after the series you might as well give up on life.",
            "date": "2015-08-21T12:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 196690,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4825944.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rahzek",
                "username": "Rahzek"
            },
            "url": "https://myanimelist.net/reviews.php?id=196690"
        },
        {
            "content": "I have seen many a yaoi genre anime. In fact, maybe around 30-35% of anime I have seen falls in the yaoi category. But, I have to say that Love Stage!! has been my absolute favorite.\r\nMost yaoi or yuri go ahead and jump into the relationship aspect and everything that comes along to being in a relationship. However, nothing \"touchy touchy\" came along till the very end. The creators made sure to throw plenty of character development in which I looooooove. So if you enjoy an actual story and character development, but also want something that has a relationship aspect to it, this yaoi animeis for you. I gave this anime a 10 overall for those reasons.\\n\\n\r\nHowever, the art and sound could've been better. Admittedly, it wasn't my most favorite artwork I've seen. BUT, for a yaoi anime, it was decent. That's why it received a 7.\\n\r\nThe music in it wasn't very catchy or enticing which is why I gave that part a 6.\\n\r\nThe character and enjoyment obviously catches my attention more than anything else in an anime. If there isn't good character development, or none at all, and if it isn't enjoyable, it is automatically dropped. This wasn't the case for Love Stage!! I was captured all the way through the ten episodes. I was upset to find that there were only ten; however, which is a little disappointing only because I really got into the show.\\n\\n\r\nAll in all, Love Stage!! was highly enjoyable and even a straight male would enjoy it. If you haven't watched yet, I recommend you start it soon. (I've watched it twice.)",
            "date": "2015-07-22T01:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 194040,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1327829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/5sos",
                "username": "5sos"
            },
            "url": "https://myanimelist.net/reviews.php?id=194040"
        },
        {
            "content": "I'm, like, a little annoyed that I enjoyed this anime so much? It's 100% the type of corny, slightly trashy romances that a lot of people hate, but this one made me really happy? I shouldn't be giving it this high of a score, but I am because?\r\nFor real, this anime was so unexpected. I really didn't expect to enjoy it this much. I'm pretty sure most of it had to do with the little story that it told rather than anything else. The art style was nice, and mostly it didn't bother me, but it's one of those styles that makes everyone looks justa little bit *too* pretty, you know? The sound was alright, and the characters themselves were your standard romance (especially yaoi) characters. \\n\\n\r\nBut the way this anime was able to tell it's story was really charming and fun to watch. For starters, the humor in it was awesome. I think the reason I was able to enjoy it so much, cliche though it was, was because it was sort of taking the piss out of BL manga and that genre in general. Like, it knows it's cliche, and it runs with it. \\n\\n\r\nBeyond that, the romance aspect of it was told in a more realistic way than most other yaoi I've seen. I mean, it still wasn't extremely realistic, but the characters' developments within the story felt genuine to me.  I do wish there was more conflict involved in the anime, like maybe a quarrel with two certain characters or whatever. Also, I would've liked to see expansion on other characters besides the main, but all in all, I had a great time watching this anime.\\n\\n\r\nThe quality isn't really amazing if you compare it to other, super successful anime, but it's a good time, and that's why it's rated the way it is. Enjoyment is the most important thing to me, and this anime hit it. Honestly, I'd probably watch this again in the future. Just sayin'.",
            "date": "2019-03-08T21:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 303139,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=303139"
        },
        {
            "content": "So recently I finished a re-watch of this show a few weeks back and only now I'm reflecting it. So what can I say about the show? I really, really liked it.\r\nFrom the yaoi anime I've seen (JunJou Romantica) there seems to be a format with yaoi that goes on. There's the obvious seme and uke, the fact that the uke may not like the seme or the other way around, and there's a LOT of pinning down. \r\nLove Stage fulfills these criteria, yes, but I feel that has a charm that surpasses JunJou Romantica at least. The humor definitely springs from the main characterIzumi Sena, who gets wrapped up in his family's popular lifestyle, when instead he wants to be a mangaka. Plus, his Mom's name is Nagisa - and the seiyuu for Izumi voiced Nagisa in Free!.  Rei is also here, with the same seiyuu too!\\n\\n\r\nThe roles for who the seme and the uke are in this show is Ryouma as the Seme and Izumi as Uke. This is obvious in their appearances; Ryouma is a young, fit acting superstar. Izumi is an incredibly femmy young adult who has the ability to look EXACTLY like a girl with makeup and proper clothes - as expected with any closed, shut in otakus, I suppose. Their relationship is off to a rocky start, but then there's the whole thing with another trope I notice in yaoi anime, the eventual realization of being a homosexual. Ryouma begins with Izumi thinking he was a girl, but after a mishap with Izumi's brother (who's also gay) he horribly finds out he was a dude all along!\\n\\n\r\nOf course, as time ravels on, he continues to think of Izumi. This leads him to eventually have Izumi pinned down naked. Unlike with JunJou Romantica, the sex here is stylized and not as explicit. The manga, however, is extremely explicit, to which I HIGHLY recommend it on that basis! Either way, Izumi is creeped out by all this but eventually warms up to Ryouma once he does something FOR him! Wow! After buying Ryouma's bought him clothes and food on a date, it's only after he helps with Izumi's manga project is that he realizes he's not a bad guy after all. This struck me as weird on Izumi's character.\\n\\n\r\nEventually, both parties come to realize their love for one another after some weird trials. For me, this is one of the things I can't credit Love Stage for is the story. It's bothersome that Izumi has to realize his affection for Ryouma after Ryouma has done so much for him. It seems like to me he doesn't really love him at all. Another thing is how Ryouma even starts to love Ryouma in the first place. He latched onto a picture of a shota Izumi dressed as a little girl for 10 YEARS! Then in the manga, the story dives an irritatingly cheap plot line that'll be disclosed later. \\n\\n\r\nAfter all that rambling, what can I say overall? Well, Love Stage has a plot line that, while not frustratingly dumb or anything, is a bit questionable but still pulls off it's cute moments. Izumi and Ryouma aren't shallow and underdeveloped, they're real entertaining but still have their times when you want to seriously ask, \"Why?\" on what they do. Side characters like Rei and Izumi's brother, another couple in the show, are also good. Not dished to the side or anything, they work into the plot without being an annoyance half the time.\\n\\n\r\nI recommend this show, definitely should watch it if you're considering it.",
            "date": "2015-11-28T23:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 204403,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4003325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kon",
                "username": "kon"
            },
            "url": "https://myanimelist.net/reviews.php?id=204403"
        }
    ],
    [
        {
            "content": "Overall: 6.5, rounded up to 7. \r\nIt's hard to rate an anime when there's very little basis for comparison (the genre being extremely limited) but I’ll do my best. Love Stage is, while definitely a cut above the majority of the genre, still not what I’d consider a remarkable anime. The characters are one-dimensional, their motives are dubious at best, and they show little to no growth throughout, all of which is a typical and recurring issue in yaoi/shounen-ai series. \r\nI think the most disappointing aspect of the series is that it had a lot of potential – potential which was never realized because ofthe obvious effort put into it to keep it from being ‘serious.’ In the process, important themes were left unexplored, critical issues were hand-waved, and overall, it just left the impression that the creator…didn’t really care. Not about the characters, or the plot, or about making the story believable. And it wasn’t. \\n\\n\r\nIf you’re wondering why I gave the series an overall rating of ‘6.5/7’ when I’ve done nothing but criticize it so far, it’s because I went in with very low expectations, as I tend to do when it comes to this genre. I didn’t take it seriously, didn’t anticipate character depth or development, and didn’t hold high expectations of gaining anything from it (i.e., a moral, sense of awe, etc) aside from amusement.  \\n\\n\r\nLove Stage did have its pros: the art was decent (I do adore Zaou Taishi’s style, but you can tell they were on a budget with this one), the audio was clear, the voice-overs were very fitting, and the subs were sharp. There was nothing special about the opening/ending music, including the video(s), but it wasn’t terrible.  Typical J-pop songs, though certainly less catchy than others. \\n\\n\r\nThe romance was…cute, if you disregard the attempt at sexual assault between the main characters at the beginning (which, at least, the author did attempt to address and treat with due seriousness, though she didn’t really succeed, and I believe that stems from different cultural attitudes towards rape more than anything). The attempted assault towards the end of the series was also tasteless, but unfortunately it’s common in shounen-ai/yaoi as a plot device. \\n\\n\r\nTL;DR – Overall, it was a decent anime, for its genre, and I’d recommend it anyone who 1) is in the mood for a cheesy BL-romcom with little in the way of substance, 2) doesn’t have assault-related triggers, 3) loves gay stererotypes (i.e., seme/uke), romance cliches, and/or crossdressing, and 4) likes watching cute boys kissing other cute boys. \\n",
            "date": "2015-10-22T12:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 201761,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4472919.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/reinakun",
                "username": "reinakun"
            },
            "url": "https://myanimelist.net/reviews.php?id=201761"
        },
        {
            "content": "This is the first yaoi type anime I watched and so I really enjoyed it. \r\nThe beginning shows you a little bit about Izumi and when he was younger. It's exciting and a little funny.   \r\nBut since this is a first for me, I can't really say if it's one of the best out there. It's probably not very original in the anime world but it is a pretty interesting story.",
            "date": "2015-08-10T09:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 195719,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4803863.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KittensRule98",
                "username": "KittensRule98"
            },
            "url": "https://myanimelist.net/reviews.php?id=195719"
        },
        {
            "content": "In this hysterical boys’ love anime, college student Izumi is the youngest member of the Sena show-biz family—the only member who is not interested in being in entertainment: awkward, with paralyzing stage fright. As a child, due to a casting emergency, Izumi ended up in a wedding commercial with his family and a little boy named Ryouma (Izumi played a girl and Ryouma played a boy), and now they’re reuniting for a 10th-year anniversary.\r\nLike most anime in the BL genre, there is a disappointing undercurrent of homophobia—but unlike most, this anime has that at the beginning and then Ryouma accepts that he’s in love witha guy and that his feelings transcend gender. Like many BL anime, there is an assault scene—but unlike most, the perpetrator realizes what he’s done is deeply wrong and takes every step he can to sincerely apologize and undo the hurt he’s caused.\\n\\n\r\nBoth the leads are very appealing, and the supporting characters are all wonderful, as well: Izumi’s doting parents and wonderfully supportive brother, long-suffering manager, school friends, and manga crush (magical princess Lala-Lulu). Parts are exceptionally funny, like Izumi’s hopelessness at drawing manga. And I love the exploration that sex and relationships need work and aren’t always perfect on the first try.",
            "date": "2015-05-03T11:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 187049,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/384487.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/shadowfireflame",
                "username": "shadowfireflame"
            },
            "url": "https://myanimelist.net/reviews.php?id=187049"
        },
        {
            "content": "story: 9/10\r\nits about a guy who meets a guy that is dressed up as a girl. then the guy falls in love with the guy that is dressed up. when the guy realises that the girl was a guy all along he still loves him as much as he always had. The main story is following the girly guy discovering if he wants to be gay or not.\r\nArt: 10/10 \r\nBeautiful!\r\nSound: 10/10\r\nNol complaints and great voice acting\r\nCharacter: 10/10\r\nAll the characters have amazing personalities and amazing character progressions especially the two male leads\r\nEnjoyment: 9/10\r\nAbsolute guilty pleasure. It was so funny and the tension between the male leadswere great\\n\\n\r\nOverall: 8/10\\n\r\nIt wasn't fan-servicy like i expected it to be. It never went overboard with the love scenes or anything. It had the perfect balance between love and comedy!! definitely recommend to those who love romance and comedy anime!\\n\\n",
            "date": "2016-01-24T06:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 209267,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4865183.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Weeboo_Forever",
                "username": "Weeboo_Forever"
            },
            "url": "https://myanimelist.net/reviews.php?id=209267"
        },
        {
            "content": "First things first, I am one of the pickiest BL fangirls in the world. I despise Junjo Romantica and Sekai Ichi Hatsukoi. But Love Stage surpasses them with flying colours. \r\nStory 8/10\r\nGasp, there's actually a plot, and it's pretty good. Its strongest point is that the drama does not solely revolve around the characters' romance. Izumi might be a shut in otaku, but outside of his relationship with Ryouma, he has a vision of becoming a mangaka. He actively pursues his dream and you can genuinely relate to his coming of age struggles. Ryouma's fame also plays a part in the events instead of beingtreated as an excuse for him to be rich and not do anything. My only problem is that it still uses sexual harassment as a plot device. Romance-wise, I like that the main focus is kept on Izumi and Ryouma instead of having a bunch of flat beta romances like other BL. Honestly, their relationship is better paced than most hetero romances I've seen. \\n\\n\r\nCharacter 9/10\\n\r\nThe only reason I didn't give this 10 is because the background characters are pretty much cardboard cutouts. Izumi and Ryouma are very real in contrast. While the show falls into the sexual harassment trope, Izumi has a very realistic reaction in the aftermath instead of immediately falling for his aggressor. He also grows from the experience so he doesn't end up being a damsel in distress later on. Ryouma, unlike other characters I immensely dislike, regrets his loss of control and has to beg for forgiveness. I love that he doesn't get it right away and has to earn Izumi's friendship, then eventually his love. \\n\\n\r\nArt 6/10\\n\r\nIt's not horrifying to look at, and no one has a severe case of yaoi hands, but the eyes are drawn in that way where you can see them through the hair. The lips are a bit weird looking too. It's not my favourite style but it's certainly not as bad as Love Pistols. \\n\\n\r\nSound 6/10\\n\r\nThe OP and ED are okay. The background music doesn't add much but doesn't detract from the drama. No one would watch this for the music anyway. \\n\\n\r\nEnjoyment 9/10\\n\r\nThis was such a refreshing series compared to most BL. The premise is cute, the ending is sweet, and it doesn't perpetuate abusive relationships. What more can a girl ask for? If you're looking for a shounen ai series with a realistic relationship and a good sense of humour, then you'll love this!",
            "date": "2014-12-21T19:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 173527,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Magpies",
                "username": "Magpies"
            },
            "url": "https://myanimelist.net/reviews.php?id=173527"
        },
        {
            "content": "A BL story done right.\r\nThese days, BL either discards conflicting sexuality emotions or plays off the love story subtly. Often times along with discarding confusion about sexuality they tend to pretend females hardly exist.\r\nBUT, Love Stage does not do this! As a person who does not generally enjoy BL, shounen ai, or yaoi, I can say that I thoroughly enjoyed this anime from beginning to end. \r\nBoth leads go through confusion and denial about their feelings towards each other largely regarding their sexuality. For such a short anime it was pretty well put together with the pacing. Still enough kyaa-ing and frustration without the feelingof being to rushed.",
            "date": "2014-12-20T18:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 173319,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510775.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NixKaen",
                "username": "NixKaen"
            },
            "url": "https://myanimelist.net/reviews.php?id=173319"
        },
        {
            "content": "Completely absurd scenario, every character lovable, just right amount of fan service.  Masterpiece indeed.  I watched this whole thing in one sitting and then I watched the OVA.  Izumi is so cute character and Ryouma take good care (mostly) of his bb princess.  Nice well-paced romance that doesn't have you clawing your eyes out screaming at the screen for them to finally kiss or whatever, lots of overflowing passion \"omg wait we both boys xd\" type moments to break up the sexual tension here and there. Tho beware there several non-con moments if you dislike that stuff.\r\nAll in all, total no-brainerif you like yaoi or even just shoujo rom-com in general.  It's sexy, cute and funny. Only downside is that I really wish this series had continued because it feels like it's just beginning to show its true potential once you hit the end.",
            "date": "2018-10-21T21:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 292261,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450594.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/getter_beam",
                "username": "getter_beam"
            },
            "url": "https://myanimelist.net/reviews.php?id=292261"
        },
        {
            "content": "(i will write in Portuguese PQ yes)\r\nAaaaa what can i say about this cute anime who have watched several times because of the original story, the characters who are a sweethearts and the art that is absolutely beautiful?? A masterpiece of yaoi hihihi;\r\nI only lay low in that part where Ryoma practically stripped Izumi to see if he still liked him even though he was a boy, for me this scene should be deleted from the face of the Earth.\r\nI confess that I identified with Izumi: he felt humiliated in his childhood, because he embarrassed himself in front of the production of the program sohe retracted in his own world, lowered himself compared to everyone in his family and lived like this for Years. \\n\\n\\n\r\nBut like, I know most of the audience is feminine, but recommend for everyone, it is a gorgeous yaoi of an innocent love (on the part of Izumi Heheh because the Ryoma osta of a same lemon) and I hope not to be the one who considers this one of the most favs.\\n\\n\r\n(portuguese)\\n\r\nAaaaa o que falar desse animezinho que já assisti várias vezes por causa da história original, dos personagens que são uns amorzinhos e da arte que é absolutamente linda?? Uma obra-prima de yaoi hihihi;\\n\\n\r\nSó dou baixa naquela parte em que o Ryoma praticamente despiu o Izumi pra ver se ele continuava a gostar dele mesmo sabendo que ele era um menino, pra mim essa cena devia ser deletada da face da terra.\\n\\n\\n\r\nConfesso que me identifiquei com o Izumi: se sentiu humilhado na infância, pois, passou vergonha na frente da produção do programa por isso se retraio no seu próprio mundo, se rebaixou se comparado com todos da sua família e viveu assim por anos. \\n\\n\\n\r\nMas tipo, sei que a maioria do público é feminino, mas recomendo pra todos, é um yaoi lindo de um amor inocente (por parte do Izumi heheh porque o Ryoma osta de um lemon mesmo) e espero não ser a única que considera esse um dos mais favs.",
            "date": "2018-10-10T17:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 291442,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6214676.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cici_",
                "username": "cici_"
            },
            "url": "https://myanimelist.net/reviews.php?id=291442"
        },
        {
            "content": "So I watched this show when I was obsessed with Yaoi back in 9th grade and rewatched it recently and I kinda hate it.\r\nThis show makes light of Ryoma's sexual harassment and assaults and it's kinda nasty tbh. Like I specifically remember a scene where Ryoma kisses Izumi multiple times while he is sleeping.\r\nThe art is pretty I guess I like Izumi's eyes they're really beautiful.\r\nAs for characters, there isn't much Ryoma as I said before creeps me out but I really like Izumi he is endearing and I feel for him as a person who's tried to make a manga but was complete ass.\r\nLoveStage! isn't bad but Its just kinda creepy.",
            "date": "2018-03-04T21:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 273061,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7031106.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DepOp",
                "username": "DepOp"
            },
            "url": "https://myanimelist.net/reviews.php?id=273061"
        },
        {
            "content": "I liked this more than I thought I would. I would consider myself some what of a BL/yaoi connoisseur. I watched Love Stage with BL tropes and Junjo Romantica specifically in mind. The #1 best part about this anime is that the main character actually has a personality. He's not just some closeted twink (I mean he is); he has interests and dreams. He's an otaku who dreams of making a manga, but he sucks at it. He also has to struggle with being in a super talented family even though he hasn't found his \"calling\".\r\n     The relationship is... yeah, ok.I'm really cynical of any romance in media. They just met, they are not in love. There's sexual assault but not rape. I can't believe my standards are so low.\\n\r\n     The brother's crush was really shitty and annoying. Isumi already has Ryoma fawning over him, what does the incest add?\\n\r\n     I wasn't a fan of Izumi's hobby change. Obviously there is noting wrong with liking anime. I don't get why he had to quit it. I also don't understand why he became an actor (or as they put it \"being in showbiz\"). I understand that he's probably going to be famous because he has his family's name. He was never shown as having an aptitude for acting. I guess it's good that he got over his stage fright.\\n\r\n     As usual in Japanese media being gay isn't really acknowledged. I mean wouldn't this relation ruin both of their careers?\\n\r\n     Art: I am an art snob. The art was typical anime style- no complaints. The way the mouths are drawn and animated though... yeesh. Maybe they're trying to look sexy, but I find it disturbing. The backgrounds don't really exist, probably to save money, but you know, I think they pulled it off. They disguised it as a stylistic choice.",
            "date": "2017-10-25T16:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 261707,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5823173.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bad_dong",
                "username": "bad_dong"
            },
            "url": "https://myanimelist.net/reviews.php?id=261707"
        },
        {
            "content": "Have you ever watched something (anime, movie, music video, ect.) and when it ends you immediately want to watch it again? \r\nFor me that is this anime. \r\nNow time for the review.\r\nThis is my first BL anime, and I wasn't even sure that I would like it but it has high reviews and was recommended off another anime I watched, it only took 2 episodes for me to get hooked.\r\nAs the story played out I got hooked on each character, wanting to see what would happen next and growing as they grew. I must say, the main character made me have my ups and downs,between rooting for him and pushing him down, but as the story continued on I watched him grow and I loved his character even more. I have no words to describe this anime. By Far the best romance I have seen. \\n\r\nNeedless to say I am watching more BL anime, but... well I am going to watch this one again ;)\\n\\n\r\nStory: Original, entertaining, stays on topic.\\n\\n\r\nArt: Shounen Ai ... do I need to say more???\\n\\n\r\nSound: When it was time for tears or laughs the sound hit it perfectly, never missing a beat and always filling you completely of that emotion, never left wanting more or feeling like something was missing\\n\\n\r\nCharacter: You see it from many of the characters views and each character grew, but the main character grew the most, making me feel overjoyed when the final scene played out.\\n\\n\r\nEnjoyment: L-O-V-E-D  it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\\n\\n\r\nOverall: Watch it now, seriously .... NOW",
            "date": "2015-08-17T23:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 196437,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2991133.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/beccabear94",
                "username": "beccabear94"
            },
            "url": "https://myanimelist.net/reviews.php?id=196437"
        },
        {
            "content": "Love Stage!! was the second shonen-ai anime I've watched (the first one was Yuri!!! On Ice). The first two episodes were enjoyable. They sounded promising. Izumi, the main character, is very cute and funny. Ryoma, who falls in love with Izumi, is that kind of exaggerated guy that makes you laugh. Rei, one of the employees of Izumi's family, is amazing! The music is awesome too and I'd constantly catch myself thinking of the opening theme. But all the other episodes were a little bit strange with some flaws and other stupid cliché stuff like: \"Hey, I know who you are.\" Then you put onyour glasses and I don't know who you are anymore. (Yes, that old Clark Kent thing.) But let me be a little more specific:\\n\\n\r\nSTORY - 5\\n\r\nThe story is ok. Just that. Love Stage!! isn't very different from that silly shoujos with silly characters. At the end, only one thing matters: will Izumi and Ryoma go through all the external challenges and be together? Nothing to be surprised, you know. But there some points that made me feel uncomfortable. By the way, this will probably be a spoiler, so if you don't want to read it jump to \"ART\". And the spoiler begins: it seems that everyone wants to touch Izumi. Yeah, in the sexual sense. Izumi is a cute, timid, female looking otaku. The others characters look at him and become all: \"OMG! He is so cute I want to eat him!\" And Ryoma is like: \"I can't control myself when I'm close to you. I'll attack you because you are so cute.\" I don't think that's funny. Seriously, I don't. So, if you don't like romanticized rape either you'd better look for another shonen-ai.\\n\\n\r\nART - 8\\n\r\nThe art is very good. I liked it very much. Izumi's smile is contagious. The characters in general are beautifully drawn. It's not a masterpiece, you know, but it's enjoyable.\\n\\n\r\nSOUND - 7\\n\r\nNothing to complain here. The opening theme is fun and sticks easily to your mind. The ending sound doesn't get behind. But again, it's not a masterpiece.\\n\\n\r\nCHARACTER - 6\\n\r\nAs I've said before, the characters are silly. I mean, there's not a single responsible adult here. Izumi is a spoiled introvert otaku unable to do anything without help. He grows very little during the show. Ryoma doesn't change very much either. Izumi's parents, Seiya and Nagisa, are stupid to say the least. Nagisa acts like a teenage girl who only thinks about parties and handsome men. Seiya isn't a very mature and careful father. But from time to time they say something apparently profound about Izumi--just to pretend they are good parents. Shougo, Izumi's older brother, is spoiled too. He likes to do everything on his own way and doesn't care how his actions will affect other people. But he cares very much for Izumi and is much more  helpful than Seiya and Nagisa. Rei is the stereotype of the good employee who respects his bosses and does everything to make their lives more comfortable. He is Izumi's eternal protector. Although I liked Rei very much--he is my favorite character from the show--it's undeniable that he has a great responsibility from Izumi and Shougo being so spoiled! Oh, and there is Lala-Lulu, the main character of Izumi's favorite manga. Lala-Lulu is the stereotype of the mahou shoujo with a heart full of kindness. She has no personality at all--an empty lovely character--and her voice is irritating. But she is important for the plot. Finally, we have Takahiro Kuroi, Izumi's classmate. Kuroi is the only responsible character in the entire show. Too bad he didn't receive much attention!\\n\\n\r\nENJOYMENT - 6\\n\r\nLove Stage!! was an OK anime. It made me laugh sometimes, the songs are good, the art is beautiful. Nothing more than that.\\n\\n\r\nOVERALL - 6\\n\r\nI think I've said everything I had in mind. Love Stage!! is a silly show with handsome male characters and fanservice scenes. Lots and lots of fanservice scenes. Depending on how you interpret them, they can be pretty offensive.\\n\\n\r\nI hope this review has helped you. Bye bye!\\n",
            "date": "2017-07-27T11:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 253960,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6066086.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JudeMelody",
                "username": "JudeMelody"
            },
            "url": "https://myanimelist.net/reviews.php?id=253960"
        },
        {
            "content": "I have mixed feelings about this show.\r\nFirstly, I love shounen ai and yaoi. I like fluffy romantic anime from time to time. There were a few moments in this show that I genuinely enjoyed. Also, it's pretty to look at, especially the eyes. \r\nBut...\r\nI just wasn't feeling the leads at all. The main character is whiny and indecisive and the only thing he is passionate about is something he really sucks at. Even though we see him put in time, effort, and practice, we never see him improve at all and ultimately he gives up and gives in to family pressure. \r\nAs for the loveinterest: he's a jerk. Not a misunderstood jerk with a dark past, just a jerk. \\n\\n\r\nHonestly, I would much rather have watched a show about the background characters than either of these guys. \\n\\n\r\nShougo and Rei > Izumi and Ryouma",
            "date": "2017-07-13T08:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 252728,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6397541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nekonekonekochat",
                "username": "nekonekonekochat"
            },
            "url": "https://myanimelist.net/reviews.php?id=252728"
        },
        {
            "content": "The anime does not disappoint for fans of the manga! All the art and character designs stay true to the manga, and the voice actors in the anime were selected very well. Love BL drama, and it is also really nice to see the boundaries pushed between the stereotypical roles and nice to see a \"willing\" uke who comes to his own realization of his sexuality. Looking at other popular works of this genre (Junjou Romantica, Okane ga Nai, Sekai Ichi Hatsukoi, etc.), the missing piece is generally \"consent\" and Love Stage!! addresses this nicely. Funny moments, cute story, romance... what more do I want?Just more episodes. oh yeah! the opening is also really nice! good job!",
            "date": "2016-12-01T04:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 234696,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5077236.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hot-Chili",
                "username": "Hot-Chili"
            },
            "url": "https://myanimelist.net/reviews.php?id=234696"
        },
        {
            "content": "to put it short and simple: this should be called suicide prevention: the anime.\r\nexistence is absurd, we humans are afraid of the unknown, therefore we fear existence as much as death, because all of us know that we don't know anything at alll. questioning your very existence itself and other forms of misery makes up a huge part of our lives, at any given month in time we probably feel either extremely depressed or deal with vague/intense mind numbing anxiety 90% of the time. this is where this anime comes in.\r\ni haven't felt as warm, bubbly and generally content as when i watched this show.the afterglow only lasted one or two hours, after which i was yet again acutely aware of my crippling benzo addiction and that my sense of self is constantly fading in and out of some sort of depersonalization brainhaze, followed by panic attacks. but those hours were great and happy times.\\n\\n\r\nthe story is close to non-existant and doesn't really matter, a very cute TRAP wants to become a mangaka, worships some random mahou shoujo protagonist and tries to cope with being forced into his family business, then some stuff happens, then he has sex and falls in love with someone he met 10 years ago.\\n\\n\r\nok let me put it this way: you=stupid and depressed. you=watch cute femboy do his thing. you=now happy for arbitrary amount of time but at the same time jealous that you don't have anything like that going for you.\\n\\n\r\nthe characters where pretty well fleshed out, or who am i kidding i was too busy imagining getting married to the cute protagonist, whatever his name was, for the sake of satisfying my degenerate fetish brought on by anime.\\n\\n\r\nthe sound doesn't matter either, mediocre if anything, not sure if i can recall any soundtrack at all.\\n\\n\r\ni give it a 10/10 overall. let the cuteness of whatever his name is embrace you. put up posters on the wall, buy body pillow and merch to fill your empty broken soul.\\n",
            "date": "2016-08-09T09:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 226324,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lebannen",
                "username": "lebannen"
            },
            "url": "https://myanimelist.net/reviews.php?id=226324"
        },
        {
            "content": "I'm going to be totally honest...\r\nThis anime first made me wonder if yaoi was a good thing. \r\nI concluded with yes, yes it is.\r\nNot only did I enter this with an open mind but I had no preference whether or not I'd like it. I was assuming that I was going to watch the first episode and just go... Meh... But I was hooked and wheeled in like a fish on a Sunday afternoon. If you have any doubt about it, Just give it a go!\r\nThe story is easy to follow and even if you know the end result, you'd still want to watch itall! I was wondering whether I should read the manga but I thought that the anime satisfies it perfectly and there is no need for a second season (Unless you want to see them go into a deeper relationship). Since I wasn't hanging off my feet and feeling destroyed (In a bad way) with this anime, it's a good piece to watch and it takes it at a good pace.\\n\\n\r\nThe art in this anime is excellent! The main protagonist (Sena Izumi) has such gorgeous eyes and the hair styles of all the different characters are so unique and beautiful yet simple. It delivers a great atmosphere that has never made me feel cringy or disgusted (I was too hyped all the time -3-)\\n\\n\r\nThe characters relationships are just perfect. Personally watching through-out the anime, I never once thought that the relationships were unjustified or too weird/strange to have in the anime. I'd never think of the main relationships to be anything but perfect.\\n\r\nThis anime also leaves you not hating any of the characters. You would think that in a yaoi anime you'll hate a certain someone but in this piece, you feel complete with the characters and don't think that anyone of them acted anything but themselves.\\n\\n\r\nOverall this is an excellent anime that deserves to be watched. If you're feeling unsure whether you'll like this type of stuff, just watch the first episode, giving you a taste of what it's like... Just don't go overboard.\\n\\n\r\n-3-",
            "date": "2016-08-09T04:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 226305,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5323050.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/yolokittenlol",
                "username": "yolokittenlol"
            },
            "url": "https://myanimelist.net/reviews.php?id=226305"
        },
        {
            "content": "I was putting off watching this anime but, it was so much better than I expected and was so glad that I did, because it was hella good. \r\nThe plot is a tiny bit cliche with the whole gender bender theme, with this boy that dressed up as a girl and this super hot guy falls in love with him, but then realises he's a boy.. etc. I remember reading the summary/synopsis and rolling my eyes going ' OH ANNNOTHER GENDER BENDER'. BUT WAS I SURPRISED. \r\nEven through the theme may be have been overdone so many times, you could feel the chemistry between Izumiand Tsubasa. AND I MEAN FEEL. I found myself squealing and 'aww'ing so many times, I was wondering what my brother thought through his room next door. \\n\\n\\n\r\nIt's just a really good anime. \\n\\n\r\nDon't believe it's going to be another gender bender anime, which is it. But it's so much more, it's a must watch. \\n\\n\r\nBut srsly, I dont blame Tsubasa in thinking that Izumi was a girl- I mean .. come on. Have you seen his face ? what boy is that pretty ?? \\n",
            "date": "2016-04-02T21:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 215280,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298169.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/shurl_wurl",
                "username": "shurl_wurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=215280"
        },
        {
            "content": "Most guys don't enjoy shounen ai anime. They're mostly meant for the female audience. Even so, this one deserves a watch. After only an episode, I was hooked. \r\nWhat is it that is special about Love Stage? \r\nTo me, how it managed to combine romance, comedy and drama all into a 10 episode anime and finish it without leaving you with a feeling of emptyness. Most anime nowadays seems to have that one thing that you cannot figure out after finishing, but you just know something is missing, atleast for me.\r\nLove Stage manages to make you laugh with it's expressions and situations.\r\nIt keeps your eyespeeled at the screen wanting see what happens next.\\n\\n\r\nTalking about it production wise, well ...\\n\r\nIt has beautiful artwork. They really outdid themselves. This is the first time I see it and absolutely adore it. Characters look lively and beautiful along with the backgrounds.\\n\r\nSound quality is good.\\n\\n\r\nThe overall enjoyment is a solid 10. From beginning to end.",
            "date": "2015-07-11T12:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 193070,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3987243.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Rackneow",
                "username": "Rackneow"
            },
            "url": "https://myanimelist.net/reviews.php?id=193070"
        },
        {
            "content": "Story - 8/10\r\nLOVE STAGE!!! has a good story. Unlike other Yaoi anime that I've seen, both the main characters have never been attracted to nor been with someone of the same sex. Both of them were new to it, though the only reason one was attracted initially was because he thought the other was a girl. As usual, for an anime/manga like this, the main characters have to be big shots. Showbiz family. I wish I had their struggles lol\r\nI like how the story progresses quite well and unlike Junjou Romantica or Sekaiichi Hatsukoi, the main characters to think way too much and they don'tplay ridiculously coy. That's the reason I give this anime an overall 8 as opposed to the aforementioned comparisons which both got 7.\\n\\n\r\nArt - 8/10\\n\\n\r\nThe art is really nice and clean, although in the beginning I was thrown off with how strange the main character's (Izumi) eyes looked. I realized it had to be different looking in the anime since his eyes was a main part of the plot. I got used to it by episode 3 though. I think the characters look quite attractive. I don;t particularly care for Izumi, but I like Ryouma and Izumi's brother.\\n\\n\r\nSound - 7/10\\n\\n\r\nThe soundtrack was not bad or els eI would have noticed it immediately like the suckiness the was OST in Junjou Romantica. That being said, the soundtrack wasn;t anything special enough for me to notice and say wow this sounds good. As for the character's voices, I think it suited them quite well. My favorite voice is of Izumi's brother, Shougo... I've never heard a voice like that before, I thought it sounded quite unique and I enjoyed it.\\n\\n\r\nCharacter - 8/10\\n\\n\r\nAs I mentioned before, character development was good, there wasn't much beating around the bush either. Nothing felt forced, no character in this 10 episode anime annoyed me. The characters in this one are quite likeable.\\n\\n\r\nYou BET I enjoyed this show~! I wish it was longer but it seems there isn't much manga out for it to have had more episodes. I'm giving this an 8/10 for Very good~!\\n",
            "date": "2016-01-16T11:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 208667,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=208667"
        },
        {
            "content": "i came like 6 times this is probably the best yaoi anime i've ever seen like holy shit i came 4 times at the last episode alone and apparently i need a longer review so im just gonna write the words \"i came\" 58 times i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i camei came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came i came",
            "date": "2018-02-26T13:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 272516,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6416723.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/_tor_",
                "username": "_tor_"
            },
            "url": "https://myanimelist.net/reviews.php?id=272516"
        }
    ],
    [
        {
            "content": "Myself personally, I really enjoyed love stage because it was really cute and showed the relationship between the two guys in the sweetest way it also showed how they were reunited from a previous time in the past. The little teasing scene in the show just makes you want them to be together. I never got bored watching the show. But I am upset that it only has 10 episodes because they could have made the show longer to explore more scenes with the guys doing more.\r\nThis show is comedy, showbiz, and yaoi/ Shounen Ai\r\n(new to posting my opinion on shows so if it badsorry lol)",
            "date": "2017-12-28T17:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 266682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6838850.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shawtywop16",
                "username": "Shawtywop16"
            },
            "url": "https://myanimelist.net/reviews.php?id=266682"
        }
    ]
]