[
    [
        {
            "content": "Anime is like a well-oiled machine.  When all of its parts work harmoniously together (i.e. the story, characters, aesthetics, and the like), you end up with a piece of work that functions well as a piece of entertainment that has a larger majority of its audience responding well to it.  But when there're sections that don't really work all that well, then you've got a problem.\r\nStory: With the world dying to the point that it could no longer sustain life, a man known only as 'Y' rebuilt it from gears and clockwork, thus creating the 'Clockwork Planet' that the characters live in.(Don't ask me how he did it, the characters themselves don't even fucking know)  It is here where our dual protagonists come across many wrenches in this world of gears as they try and work out the kinks in the machine.  \\n\\n\r\nBased entirely on only a few of the story's beginning arcs, Clockwork Planet is a typical arc-heavy story that relies on different problems arising for our protagonists to deal with, each creating a similar problem in a different way.  These outlandish scenarios act as a double-edged sword for the series as while the plots create a semi-engaging scenario for the audience and provide us a reason to continue watching, the actual logistics for each antagonist's reason for doing their evil deeds usually don't really make any sense whatsoever.  Especially with the last arc, a lot of the show's cogs fall apart because a lot of plot aspects don't fully mesh well with each other.  \\n\\n\r\nIt's also important to note that very often the show wastes time with less action-packed scenes and focuses more on comedic or slice-of-life moments that while do help provide a better aspect of life on the clockwork planet, don't really add much to the story.  Especially since most of the time they shove these parts in the middle of the action, so it creates a jarring shift in tone.  \\n\\n\r\nAll in all, Clockwork Planet was a series that had a rocky start, picked up a little bit in the middle, and then ended with the cogs falling apart again.  Mixed with plot holes (some of which can be ignored to an extent), unclear antagonist motivation, and a surprising amount of choppiness with the story, Clockwork Planet's story ends up being a clunky mess that has some good aspects, but ultimately falls apart because things don't mesh well enough to create good synchronization.  \\n\\n\r\nOverview:\\n\r\n+ Interesting world (Gotta give 'em for an interesting setting)\\n\r\n-  Clunky pacing \\n\r\n-  Jarring tone shifts\\n\r\n-  Unclear antagonist motivation\\n\\n\r\nCharacters: Inversely, the characters of Clockwork Planet share a different opinion when compared to its story.  Sadly, if you're not a main character, than the show really doesn't care about you.\\n\\n\r\nFirst are the duality of protagonists, Naota Miura, the boy whose sexual preference is robot and Marie Bell Breguet, the short fused clocksmith gone rogue.  Obsessed with clocks and wanting to be a clocksmith, Naota represents the 'Natural Genius', as his uncanny, natural ability to hear minute problems within the rhythm of gears and figure out the problem from that actually makes him quite interesting.  As a character, Naota is a boy who adores automata to the point that he makes one his waifu and gets very upset when they're mistreated.  Marie on the other hand is an experienced clocksmith representing the 'Learned Genius' as comparatively, she knows how to fix stuff, but has to work to find the answer when her counterpart does the reverse.  Because of their contraries, the characters work well together as opposites, and the majority of the runtime is dedicated to their opposing ideas meshing together to fix the problem.  While they don't do well on their own, their teamwork brings up a good positive for the show since their bickering is actually really fun and interesting to watch.\\n\\n\r\nThen there's RyuZu, the one who follows.  As the main automaton of the series, RyuZu is a sharp-tongued robot gal who hates people but loves/respects Naota because he fixed what 200 years of clocksmiths couldn't repair.  Generally acting as a supplement to Naota's character, RyuZu acts as a bit of a gag due to how rude to everyone she is, thus creating some actually charming scenarios between the characters.  She mostly stays stagnant in terms of development like the rest of the cast, but the qualities involving her offensive nature make her very entertaining if nothing else.  Other automaton like AnchoR and Halter act a similar role in that they add more to the series to make the cast more colorful, but don't have much in the way of development and are really only necessary to the plot when needed.\\n\\n\r\nAside from them, the supporting characters are shoddy examples of what not to do when creating a supporting cast.  The antagonists have very loose motivations that don't really make sense or amount to anything, and the supporting cast either have a very tiny role and/or don't really make much sense.\\n\\n\r\nOverview:\\n\r\n+ Interesting (and entertaining) main characters\\n\r\n+ Entertaining supplementary characters to the main duo\\n\r\n-  Supporting cast doesn't really matter all that much\\n\\n\r\nArt:  Produced by Xebec, Clockwork Planet's art leaves a lot to be desired.  The animation and art itself is standard fare, and the show uses actually really nice CGI in order to create the numerous amounts of gears, cogs, and machines that we see throughout the series.  Despite its background appearance, the character designs leave a lot to be desired.\\n\\n\r\nWhile the original art for clockwork planet does leave some things to be desired, the anime's adaptation of said art has a lot of inconsistencies with it.  Character proportions (like AnchoR's head compared to her body) look off, as the heads of the characters are stretched length-wise and create some really peculiar looking people.  On top of that, the show's inconsistencies with character design make it so that one shot doesn't look the same as another, thus creating weird shots altogether.  \\n\\n\r\nOverview:\\n\r\n+ Good use of CGI\\n\r\n-  Inconsistent character designs\\n\\n\r\nSound: Appropriately (or lazily) named 'Clockwork Planet', the show's OP made by Fripside is...quite samey to what the group makes.  A lot of their songs sound very similar, and this one is no different.  That isn't to say it's a bad thing, as the inclusion of windup noises and the overall tone of the song is still quite nice despite how similar it sounds to a multitude of their other tracks.\\n\\n\r\nThe show's ED on the other hand (also appropriately named), \"Anti-clockwise\", is a louder, slightly more screechy song with dissonant piano chords and an all around messier structure comparatively to its OP counterpart.  It's not that pleasant to listen to, and is one of those things that's worth skipping not because it's forgettable, but because it does grate on the ears a little bit.\\n\\n\r\nOverview:\\n\r\n+/- Tracks vary with your mileage\\n\\n\r\nPersonal Enjoyment: I was anticipating the release of Clockwork Planet for quite a while.  It was one of those show that I really wanted to watch and I had to wait for its release because it was stuck in development hell for a little while.  Unfortunately, the end result I wouldn't say is worth the wait, but despite that, I still enjoyed it regardless of the fact that I can just as easily chalk up a lot of the shows problems and ultimately say that it is indeed a 'bad adaptation'.  \\n\\n\r\nDid I enjoy this series?\\n\\n\r\nCritically, the show has many flaws.  Despite that, Clockwork Planet still managed to be a guilty pleasure of mine.  The bickering between the main cast really made the show enjoyable for me to the point that I really didn't care much for the story or any other aspect of the show.  Fripside's OP's always interest me, so I would be remised if I said that I didn't enjoy that too.  Sure it's not a great show, but a show doesn't have to be 'great' in order for one to enjoy it.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nThe last arc felt really weak.  Especially since it took about a third of the runtime, having a huge portion of the story stumble towards the end was a big letdown, especially since very few things at the moment clicked in place.  \\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you just really want to see some interesting characters talk to each other, than Clockwork Planet fits the bill.  Again, the show struggles with having a cohesive story and the visuals leave some things to be desired.  Despite that, its characters make the show good enough for those with low standards to still find something enjoyable to watch, so if anything, I'd say this show is for those willing to devote some time to enjoy something that's kinda stupid, if anything.",
            "date": "2017-06-22T14:55:00+00:00",
            "helpful_count": 67,
            "mal_id": 250691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=250691"
        },
        {
            "content": "I will note that I am not the best at writing reviews, and that this is only my second or third time writing one. It may not be objective and fair, but these are my honest thoughts on this anime.\r\nI decide to give this a fair try, and I'll be watching it till the end, my friend suggested it to me and that is why I am continuing to watch it otherwise I would have dropped it the first episode. He claims it picks up but I have yet to see that.\r\nThe story is one of the weakest aspect of this show, careful because Imight spoil a few things within the episodes I have already watched. The story goes as follow; random robot or android made of gears falls on some random kids home--the kid is noted to be unable to fix anything that has to do with gears, yet he can hear gears and is able to fix the android which hasn't been fixable in 200 years.\\n\\n\r\nThat's just the first episode but no need to go further, over all it doesn't pick up and is unable to keep what tension there is by including poorly placed jokes to lighten things up.\\n\\n\r\nWe move to the characters, the main character which I described in the second paragraph doesn't have any redeeming quality's other then liking gears and there is so much that could come from a series all about gears, but it doesn't seem like the gears are the main focus, just an after thought. Honestly the characters are non existent in their form in the anime, just generic personality you would expect. Naoto Miura is the happy go lucky one track mind pervert who loves his gears and won't do anything that doesn't involve gears. And Marie Bell Bregute is constantly looking to be the best that she can be and fix everything. There really is no personality here.\\n\\n\r\nAm I enjoying this series, no, I am watching because I'm expecting it to get better but I am not seeing that. So in conclusion it's not a series I would suggest but others seem to enjoy it, and if you enjoy it, good for you, it's just something I would have dropped long ago if not for my friend. I gave it a 4 and if it does pick up I am open to changing that number but for now, it remains.",
            "date": "2017-05-12T15:33:00+00:00",
            "helpful_count": 59,
            "mal_id": 247544,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863491.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Moe_VII",
                "username": "Moe_VII"
            },
            "url": "https://myanimelist.net/reviews.php?id=247544"
        },
        {
            "content": "Clockwork planet review \r\nBeautiful android girls saving the world from government corruption with the help of an eccentric ability user and a genius engineer. \r\nThere are slight spoilers mainly in character analysis so please be aware as you read the review \r\nBased off the light novel of the same name Clockwork planet is an action based anime that has a pretty interesting premise in that it combines an action based anime with something that we usually see inside a sci fi anime which in this case are the automatons which is a type of advanced android that populate the world that this anime is setin. Combine this with the unique setting that Clockwork planet is set in and you get clockwork planet. I always been a fan of sci fi and action anime but what I really like more is one that combines the excellent combat scenes that most action anime has with the futuristic settings that sci fi anime are renowned for. Clockwork planet combines the best elements of both into one and is one anime that’s been in my watch list ever since I saw the pv. \\n\\n\r\nStory and setting \\n\\n\r\nThe story for clockwork planet takes place in the future where the planet after a series of destructive wars has left it barren and close to destruction has been transformed into a new planet that is composed entirely of gears by a renowned but mysterious clocksmith called Y. The setting for this story is centered on a futuristic version of japan which like the planet has undergone a radical change in its environments and in society.  \\n\r\nThe overall plot for the series is largely revolved around the theme for this series which is justice and the fighting of government corruption and follows the lives of a young teenage Boy called Nauto who possesses a unique talent that is seen by society as a threat and Mari a young teenage girl that also has a unique talent that allows her to excel in her duties as a meister which is an advanced engineer that is trained to repair the tech that is used in this futuristic world. Along the way they are assisted by Ryu zu and anchoR two advanced androids that were made in the early years of the transformation and are more advanced than any automaton that exists in the world. They are further assisted by a host of support characters that come from all walks in life. The overall plot of the series based off the concept of justice and pits Naoto, Mari and their allies against the corruption that has taken root in governments around Japan and can be described as a fight against social injustice. \\n\\n\r\nAnchoR\\n\\n\r\nAnchoR voiced by veteran seiyuu Sayaka Senbongi of girlish number and unlimited Fafnir fame is one of the main characters of the series and one of Nauto and Mari’s main allies in the series. An advanced Y series android and a sister to Ryu anchoR resembles a young girl both in terms of in terms of physical appearance and in terms of personality. Personality wise anchoR is a cute, kind and innocent girl that behaves very much like someone of that age group. As a result of being ordered to guard a powerful weapon deep underground however in the beginning of the series anchoR was bound to a strict set of rules that mandated the actions that she can take as part of her duties. These unfortunately had the effect of causing her a great deal of trauma as her duties meant that any intruders that she detects will be terminated by her. As a result, at this point anchoR hid her true personality behind a wall wishing with all her heart for someone to hear her voice and save her. later on, and after she meets Nauto and Mari properly anchoR is finally awakened from her nightmare and her personality reverts back to her true self. As a result of waking up and seeing Mari and Nauto anchoR has the impression that Mari and Nauto are her parents and as a result see’s them as her mother and father respectively an aspect that I found to be cute and suitable for her character. Though somewhat slow to trust due to her past traumatic experience once anchoR’s has fully trusted someone she can be surprisingly loyal to that person. Though still bounded by the contracts that she forms with her master she can on occasion disobey an order if it means it will help her master. As a Y series, android anchoR like Ryu is also a capable combatant and in her case, can transform into a combat automata that takes the form of a red colored assassin that is lethal in close combat. Despite being smaller than Ryu anchoR is surprisingly capable in combat and her fight scenes with Ryu in the series was really impressive. \\n\\n\r\nAs a character, I felt that anchoR was pretty well designed and fitted well with the theme of justice and corruption in that she was forced to carry out her duties of protecting something terrible that was located underground on the orders of corrupt adults despite the fact that she was nothing but a child. Seeing anchoR wake up from her nightmare that was forced on to her by her creators and awaken her true personality was a joy to see. It was nice to see her discover new things in life that she likes something that her past life can never do and in the process learning how to be more human. I felt that Sayaka Senbongi really did a great job voicing the character of anchoR. \\n\\n\r\nMarie \\n\\n\r\nMarie voiced by veteran seiyuu Saori Oonishi of Denpa Kyoushi and Food wars fame is one of the main characters of the series and is one of Naoto’s main allies in the series. A teenage girl that despite her young age is actually a member of the meister order which in this universe are engineers that are tasked with keeping the complicated gears that power this new world in working condition. As the youngest person to be inducted into that prestigious order Marie is a genius level mechanic and has an innate understanding of how gears work and how they can be repaired. Marie is also a bit of a free spirit and isn’t scared of any pressure and indeed when sufficiently motivated won’t let enemies stand in the way of her repairs. Personality wise as a result of her former position as the head of a large tech company Marie is a feisty and confidant person that because of her skills can be arrogant at times and be dismissive of other people.  Marie’s most prominent trait is no doubt her determination which comes from her pride both as a meister and as someone that worked so hard to learn all the required skills that she has. As a result, even when confronted with a problem that is impossible to fix or modify Marie when sufficiently motivated can become really determined to finish that task and will not let anything that gets in her way. Despite her confident nature Marie can become depressed and go into despair especially when confronted with situations that seem to be impossible to decipher even for someone of her skills. This is however where her bond with Nauto comes into play however. \\n\\n\r\nMarie’s relationship with Nauto is an interesting one and one that forms part of the overall plot for this series. Though their initial meeting was anything but friendly and more along the lines of mutual antagonization over the series their relationship starts to improve as they both learn about each other and overcome challenges together. In the beginning of the series Marie’s relationship with Nauto was rather icy that stems from both her pride as a meister that caused her to look down at Nauto who she felt didn’t deserve such an ability. However, as the series goes on this relationship soon turns to one of respect as she become impressed by how useful and ground-breaking his ability is though this is far from the only reason as she also appreciated that fact that Nauto can always come up with a plan of action that while always sounding crazy never less has a good chance of working. By the end of the series it’s apparent that between Nauto and Marie is a relationship that is built on trust and respect for each other’s respective skills.  Another aspect of the relationship that is unique to Marie’s relationship with Nauto is way that Nauto supports Marie. Despite her positive and determined nature even Marie will sometimes find herself in the throes of despair and in this state Nauto is one of the few that can help Marie get out of that state. Just as Marie can appeal to Nauto’s skills at listening to gears in order to cheer him up Nauto when trying to cheer up Marie often makes use of jabs at Marie’s vaunted determination and pride that she has that usually has the effect of making her angry but at the same time open her eyes to new ideas that she is able to deduce thanks to her intelligence. \\n\\n\r\nThe character of Marie I felt was pretty well designed and served as a great contrast to the other main characters of Nauto, Ryu and anchoR. Seeing two people of differing backgrounds be able to put aside their differences and develop a respect for each other and work together was a concept that I particularly liked. I felt that Saori Oonishi really did an excellent job in voicing the character of Marie. \\n\\n\r\nVainney \\n\\n\r\nHalter Vainney voiced by veteran voice actor Kenichirou Matsuda is one of the main characters of the series and one of Marie and Nauto’s main allies in the series. A combat automaton that takes the form of a mid-aged man Halter serves as Marie’s bodyguard and main adviser in the series. A loyal, calm and stoic person Halter has a long past with Marie as he’s been serving her family and protecting her since she was a child. As a result, the bond that exists between the two is exceptionally strong. Although a bodyguard by definition should have as their main task be concerned with the protection of their charge Halter also serves as an adviser and confidant to Marie and often provides sound advice to her that is especially useful when she’s lost or does not know how to proceed with her plans. Because of their long association the relationship that Marie has with Halter is pretty close that is exemplified by the fact that Marie often plays pranks on him. Despite this Marie’s trust in Halter is very strong and Halter in turn is very determined to protect Marie as well. Though skilled in combat as expected of a bodyguard Halter is also rational enough to realize when a situation has turned against them and when the time to retreat is at hand. As a result, Halter can often make snap decisions that are contrary to Marie’s wishes but serve to protect her. \\n\r\nThe character of Halter I felt was an interesting contrast to Marie that was different to what Nauto brought to the table in that he serves to tamper Marie’s brash nature which by my count almost cost Marie her life quite a few times in the series. Halter’s dry wit and sound advice was also a welcome addition to the cast and often had the effect of keeping tension between Marie and Nauto down a notch as the series progresses. \\n\\n\r\nNaoto\\n\\n\r\nNaoto voiced by veteran seiyuu singer Yoshino Nanjo is one of the main characters of the series. A teenage boy and a high school student that in the beginning of the series lived in the Kyoto ward in Japan. A quiet but kind and caring person Nauto though not lacking in social skills can also be described as an otaku but not a normal one. In the case of Nauto the subject that Nauto is most interested in is in gears and machines and can as a result be described as a machine otaku. Though loving to fix and assemble machines in the beginning of the series Nauto had great trouble in fixing any. In the beginning of the series Nauto as a love for fixing machines actually aspires to become a clocksmith which would allow him to fix all kinds of machines that exist in this world of his. As a result, Nauto is somewhat jealous of those that have managed to attain that dream of his. Because of his kind and caring personality Nauto tries to treat everyone with respect and kindness but on some occasions, he can be overly brash sometimes. A prominent trait of Nauto’s personality that can be considered strange by people living in this world of his is that Nauto treats automatons with the same amount of respect and kindness that he treats regular humans with which often surprises the people that he meets along the way. Indeed, this was a surprise for even the automatons that he encounters along the way such as Ryu and anchoR. As one of the main characters of the series and one half of the Marie Nauto pair Nauto has an interesting ability in that as a result of having rather sensitive hearing Nauto is able to hear and locate any imperfections in a mechanical component and as such is able to help immensely in determining why a machine isn’t working as intended. \\n\\n\r\nAs the series goes Nauto encounters a number of different characters that he’s able to establish friendships and bonds with the most significant ones being his relationship and bonds with RyuZu, anchoR and Marie. \\n\\n\r\nNauto’s relationship with RyuZu serves as one of the main points of the series and I felt was a rather interesting one. In the beginning of the series Nauto encounters RyuZu in the most dramatic way possible and though the meeting was shocking to him was also what ultimately started his relationship with her. At first Nauto was a bit wary of Ryu as he had never seen an automaton that was as advanced as she was. But as a result of Nauto able to fix a problem within her that has compounded man men that were brighter than him Nauto was able to fix her and make her operational. Although In the beginning of the series Nauto was fascinated by Ryu as an automaton Nauto’s personality trait of treating automatons the same as he treats humans causes him to start to view Ryu as a human being as well and as the series progresses and they fight alongside one another countless times this causes develop a romantic interest in Ryu. Indeed, by the end of the series Nauto has indeed fallen in love with Ryu that culminates in a rather well put together scene where he presents a ring to her. However, Ryu zu is not the only special relationship that Nauto manages to establish as his relationship with anchoR was also another highlight of Nauto. An effect of Nauto’s relationship and close bonds that he forges with Ryu zu and anchoR is that he sees them as part of his family which has the effect of manifesting a sense of determination that causes Nauto to fight even harder to protect his family from harm. All in all, I felt that as a character Nauto was a pretty well-designed character whose main points was his kindness, honesty and his treatment of both automatons and humans equally and fairly that matched the theme of this anime pretty well. His relationship with Ryu zu was really sweet and their relationship was pretty well designed. I felt that Yoshino Nanjo actually did a great job in voicing the character of Nauto.  \\n\\n\\n\r\nRyu zu \\n\\n\r\nRyu Zu voiced by veteran seiyuu Ai Kakuma of Asterisk wars fame is one of the main characters of the series and the main heroine of the series. Ryu like anchoR is a member of the Y series an advanced series of androids that was created by the legendary clocksmith Y and despite being an old series is far more advanced than the automatons that replaced it in the world. RyuZu takes the form of a young teenage girl that can be best described as breathtakingly elegant as she really is beautiful. Personality wise Ryu zu adapts two different personas that she makes use of depending on the situation that she’s in. Her normal persona is one that is polite and respectful to all but usually quiet and focused. This is countered by her other persona that can be condescending to others but in a funny way that seems that she’s only making these comments and actions just for the fun of it. Unlike anchoR however Ryu has great pride in both herself and her specs as a member of the Y series and as a result tends to have a low opinion of humanity that despite all these years of having her in their possession have not managed to find a way to fix her. This opinion of humans however is done in a way that’s funny and contrasts with her normal composed and respectful persona. In the anime Ryu is noted to have an interesting personality trait in that she seems to prefer her actions to be dramatic in nature. Whether this is due to her wanting to display her superiority over current automatons and humans is something that we can only wonder. \\n\\n\r\nRyu zu’s relationship with Nauto forms an important part of the series main plot and is a relationship that I thought was cute and well designed. Ryu Zu and Nauto met in a rather dramatic fashion early on the series and their relationship as a result started slow. In the beginning of the series Ryu was wary of Nauto but at the same time curious about him as he despite being a mere human could repair him. After seeing Nauto’s bravery and the way that he treats automatons as well as his attempts to protect those that are dear to him Ryu zu’s opinion of Nauto improved to the point where she requested that Nauto take up the mantle of being her master much to his surprise. As the series progresses and Ryu Zu gets to know Nauto more and understand his personality as well as his ability Ryu starts to gradually fall for Nauto much to the surprise of not just herself but Nauto as well. Despite being an android, this fact was surprising to me and at first, I thought it was simply because she was loyal to Nauto but this was not so as she likes him on her own free will and not out of a sense of loyalty to him. A unique trait of Ryu that only manifests when she’s dealing with her master or with Marie is that despite her beautiful appearance Ryu actually has a sharp tongue though while sounding hurtful also does a great job of keeping Nauto and Mari on track with their tasks in the series. Despite being an android Ryu can be surprisingly human at times when she’s with Nauto as he treats her more like a fellow human than an automaton which in the beginning baffled her. These actions which are an important part of his relationship with her was interesting as it showed that Ryu can also have human emotions that she shouldn’t have such as likes, dislikes, embarrassment and of course jealously. The teasing out of emotions from Ryu by Nauto I felt was a central part of their relationship in that it allowed both to have a better understanding of each other and in the course of it establish a much better relationship. Seeing Ryu exhibit a sense of jealousy when Naoto is admiring other machines was both an interesting and funny thing to see. \\n\\n\r\nAll in all, I felt that the character of Ryu zu was a pretty well-designed character that showed that while automatons were created by humans they too can have their own free will and emotions and that their relationship with humans can be one of trust rather than one based on control. I felt that Ai Kakuma really did an excellent job in voicing the character of Ryu. \\n\\n\r\nArts and animation\\n\\n\r\nIn terms of art I felt that the character designs for the characters that were featured in this series was actually pretty good. The designs for the two Y series androids Ryu and anchoR I felt were pretty detailed and both despite looking really pretty and cute were also lethal in combat which I felt contrasted greatly with their looks. The clothing designs for Nauto and Marie I felt also did a good job in reflecting not just the time period but in the jobs that both did. The environmental design for the series is another thing that I liked and it was interesting seeing the future versions of Tokyo and Kyoto and see the subtle differences between the two. In terms of animation I felt that was pretty sharp and clear and each character whether they are main or support had a great deal of detail on them. The combat scenes for the series I felt were pretty good and were pretty well designed and executed with each fight being pretty unique. In particular the combat scenes that showed Ryu Zu and anchoR use their abilities in battle were pretty nicely detailed. The transformation scenes for both of the girls as well as the designs for their transformed self’s I felt was excellently done.    \\n\\n\r\nMusic \\n\\n\r\nThe music for the series in general were pretty good but I felt that the opening theme was perhaps the one that stood out the most. The ending theme though good felt somewhat flat when compared to the strong opening theme. The scene music for the series was generally good. \\n\\n\r\nVoice acting \\n\\n\r\nVoice acting in this series I felt was one of the series strong points and was consistently strong throughout the series. Of the characters that were featured in this show the main cast I felt had the best in terms of voice acting ability with the seiyuu’s for Ryu zu and Marie and Nauto who are Ai Kakuma, Saori Oonishi and Yoshino Nanjo respectively deserving particular praise for their performances as I felt that they did a great job in portraying their respective characters and bring them to live. Of the support cast the voice actors for the main villain in this series and the one that voices the gender bender cyborg soldier also deserves some praise for their performances. \\n\\n\r\nOverall conclusion \\n\\n\r\nOverall, I felt that Clockwork planet was an interesting anime that among its strengths included an interesting premise, interesting characters, interesting story, strong voice acting and great combat scenes. This is however offset by the fact that the series did not really have what can be considered to be a strong villain role and indeed the one that can be considered to be that role only appeared much later in the series and as a result didn’t have time to make his presence felt. Despite that I do commend his effort in that although he had only a few episodes to establish himself he certainly did a good job in making himself a threat to not just the main cast but to the country as well. \\n\\n\r\nThe premise of the show which emphasizes on justice and transparency as well as the beliefs in equality and trust between humans and automatons I felt was interesting and combined with the story was one of the main strengths of this show. In line with the theme of justice and transparency the main villains that are faced by the main characters were the government which while certainly serviceable as the villain could have been replaced by a better villain instead as their attempts to stop the cast while certainly over the top and destructive were more comical than dangerous. Despite this it was actually pretty satisfying in seeing the cast stop them and expose their crimes to the people though. On the other hand, the plans that the main cast hatch in their attempt to stop the government though was much better and far more creative in their plans than anything. Though the plans suggested as it is by Nauto always sound crazy and impossible seeing them actually work really tells you that unorthodox thinking can sometimes triumph over impossible odds especially if you have more brains than they do. \\n\\n\r\n The characters for the show whether they were main or support ones I felt were all well designed and had a clearly defined role in the narrative. The struggles that they all experienced and the way that they actually overcome them was I felt pretty well done with my favourite here being anchoR’s as her past trauma was as such that it was the trickiest to solve and overcome. Watching the main cast start to learn to trust each other and respect each other as they try to stop the government’s plans was certainly entertaining and seeing them eventually put aside their differences and work together as a team to deal with the common threat was worth it. \\n\\n\r\n The abilities that the two main characters have in this series I felt was pretty interesting and matched well with their personalities. With regards to character development for each of the characters I felt that they were done pretty well with each character becoming not just stronger but also improving upon their existing personalities. Although each of the characters are developed as the series progresses I feel that characters of Ryu and Nauto were developed more than the others especially with regards to Nauto’s bond with Ryu and her becoming more human as the series progresses. The romance between Nauto and Ryu while certainly strange I felt was interesting and also rather sweet because it felt natural as Ryu like a human fell in love because she saw Nauto’s true personality and came to admire it and the person behind it.  Though she may be icy on the surface beneath that is still someone that can still feel human emotion. In this I really liked seeing Ryu Zu act jealous when Nauto is with other girls as it shows how much has developed as a character. The combat scenes for the series Is another of the shows strong points and I felt that the combat scenes in this series was pretty well done. Seeing two Y series androids lay waste to an enemy force twice their number in a matter of seconds is immensely satisfying though that’s for sure. \\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-06-23T16:50:00+00:00",
            "helpful_count": 34,
            "mal_id": 250805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=250805"
        },
        {
            "content": "Warning possible Spoilers \r\nWhen I found out that Clockwork Planet was created by the same person who made No Game No Life I was definitely interested with what it would offer me, although despite not being as good as NGNL Clockwork Planet was still alright.\r\nWhen Earth was destroyed it was rebuilt by some God or being and made entirely out of Gears, Our MC Naoto Miura has a special gift that is needed by people to help fix certain gears, luckily he has a ragtag group to help him on his journey.\r\nThe story of Clockwork Planet is pretty confusing and I'll admit it was hardto follow, but what I got from it is that gears are used for literally everything and that includes the cities people live in so if a gear goes wrong and can't be fixed then everyone is in big trouble so a group of special scientists are used to sort out these problems, but it runs much deeper than that as our group of characters discover which is more about the existence of the planet itself, It is a difficult story to take note of and even more difficult to make into words so I'd watch the show if you want a detailed or better detailed explanation because the story though interesting isn't the best part of this show.\\n\r\nHonestly the characters are the most interesting part of it mainly because each of them seem so different that they work very well together and it brings out a surprising amount of comedy for a show that I wasn't expecting to make me laugh a good number of times.\\n\r\nHowever there is definitely one thing I understood from the story is that the word impossible is used a lot as a story development device because there are a lot of times where things go wrong for our hero's and they break down quite a lot of times because they think the situation they are trying to solve is impossible when really it isn't because they haven't used every option available, some people might think this is a stupid way to drive the plot forward, but honestly I think this just made the characters better because it showed how determined they are to save everyone even though some characters might not look like their trying to do that.\\n\\n\r\nThe characters like I said before are the most interesting aspect of the show and it had a nicely mixed bunch who seemed very different to each other.\\n\r\nNaoto is the male MC and he was very mixed for me as a character because he is someone that is fascinated with clockwork and wants to fix things yet he can never actually fix anything though he has a special hearing ability that allows him to locate any faults in the gears mechanism which really helps out the others a lot of the time, his character goes through some pretty weird stages as he starts out like a weird, but selfish asshole only caring for himself or the automatons, but after the halfway point he does start to become a better character as he starts thinking more about the people than himself.\\n\r\nRyuZU is the female MC and is an Automaton that was made at the same time the planet was made making her a 1000 years old, she doesn't really show her emotions though she is very loyal to Naoto even to the point of threatening people when they are thinking of harming Naoto and there is one thing she definitely is and that's comedic gold because RyuZU will always make a pretty savage joke against anyone and not even realise it making her a good source of comedy in the show although despite being the female MC she really didn't do a whole lot other than kicking ass and being a savage she actually doesn't do a lot to solve a situation especially during the second half.\\n\r\nMarie Bell Berguet to me is the true female MC of the show because she is pretty much Naoto's total opposite yet equal at the same time because she is incredibly good at fixing things and kicking ass too, you really notice the more you watch the show because both of them have something that the other needs making them a really interesting duo, Marie is actually a princess and can be a pretty stubborn girl yet very determined which is one of her strong points and even though she does take her anger out on Naoto and RyuZU it's actually understandable since they keep picking on her, but seeing her and Naoto's relationship develop was actually interesting and I thought she was actually a well rounded and useful character.\\n\r\nAnchoR is another Automaton who is RyuZU's sister although she doesn't do a whole lot since she joined the group pretty late there was enough time to see she was a pretty adorable character though conflicted too since she didn't enjoy being a weapon and was glad that Naoto and Marie were able to give her free will with her decisions which in turn she references them as Father and Mother which seemed pretty odd at first, but made much more sense later, she has a very strong will and will even go as far as sacrificing herself just so she can bid time for Naoto and the others to complete their tasks.\\n\r\nHalter Vainney is Marie's cybernetic bodyguard and a pretty funny one too, despite looking like a serious guy which he is Halter does like to make funny jokes with Marie from time to time even in combat though he does have a strong protective nature for Marie since he has been her bodyguard and close friend since she was a little girl so Marie is special to Halter and is willing to follow any order to make sure she's safe.\\n\\n\r\nThe artstyle looked very interesting since clock gears aren't usually something that gets a lot of concentration so seeing an entire world made out of it looked architecturally amazing even if it is CGI and it looked even more amazing how almost everything is made out of it even the automatons who had a good looking technical interior, the characters design's themselves was interesting too, but the fact that both Naoto and Marie are 16 just doesn't match the way they look then again this is something that has happened plenty of times.\\n\\n\r\nSurprisingly enough there is actually a good amount of comedy in this anime which was something I wasn't expecting and it was actually pretty funny comedy with some moments making me laugh for a good bit like when Marie got that secret message that was a bit sexual and then RyuZU made a joke out of it which was really funny, most of the time it's usually RyuZU or Marie that make the funniest moments and they are mostly unexpected.\\n\\n\r\nWith a good amount of comedy this show can be very serious as there are lots of times as I said before where the characters hit a wall and then have a big breakdown  until they get picked back up again and honestly I felt really bad for our hero's because they actually get screwed over probably every episode or almost every episode and it made me feel sorry that they had this many setbacks to deal with.\\n\r\nThere was also a decent amount of action although not the best and it was pretty short sometimes it was still entertaining especially when RyuZU or AnchoR went into their Imaginary forms which looked pretty cool and was definitely destructive.\\n\\n\r\nOverall this is probably the most interesting spring anime so far (well that isn't AoT S2) and I did like the chemistry between the characters so I'd probably recommend this to anyone who is a fan of No Game No Life to see if they get the same interesting feeling.",
            "date": "2017-08-08T06:39:00+00:00",
            "helpful_count": 30,
            "mal_id": 254978,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=254978"
        },
        {
            "content": "i was very surprised to see such low ratings! it feels weird to be reviewing a show that hasn't finished airing yet, but I felt something needed to be said so people don't turn away from this masterpiece based on the ratings and negative reviews. \r\nFirst of all, the art is incredible! This clockwork world is simply beautiful. The characters are interesting and creative. I love that the lead doesn't struggle with the kind of self esteem issues that drag on character development in many shows. I don't know about you, but I watch anime to see something more than ordinary. Anime has the powerto richly develop exotic worlds in vibrant color in ways that mediums simply can't do right now. (not cost effectively anyway!). Clockwork Planet is a world unlike our own.\\n\\n\r\nThis show does force the watcher to accept that the physics of this world (this universe is obviously not ours), differs from our own. The way these gears work looks like magic to me, and thus, this show is closer to the magic genre than to mech. But they say that any technology, sufficiently advanced, would look like magic to undeveloped peoples. If you cannot accept that in this world gears have power in a way in ours it does not, I can see how you would find the show too unbelievable. If you can watch an anime and judge it based on the ideas within it and it's ability to help you imagine a new reality far different than your own, you too will see this as a masterpiece.",
            "date": "2017-06-07T20:46:00+00:00",
            "helpful_count": 30,
            "mal_id": 249478,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/c0ldsteal",
                "username": "c0ldsteal"
            },
            "url": "https://myanimelist.net/reviews.php?id=249478"
        },
        {
            "content": "This is a anime with a intriguing idea, and interesting premise and start, that doesn't really feel like it goes anywhere.   Which is a shame as there is so much to like about the world, I liked the idea of the earth essentially being a clock work planet now.\r\nProblem is this is a example of a great idea hindered by poor villains and lack of feeling of gravitas.   I never understood the villians goals, or their reasons and what their final plan was supposed to do.   which made the final moments confusing.\r\nI would say watch a few episodes toget the feel for the anime and the world, but if you watch more, be prepared to possibly feel unfullfilled.",
            "date": "2017-06-22T13:44:00+00:00",
            "helpful_count": 24,
            "mal_id": 250686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=250686"
        },
        {
            "content": "One day, a little MyAnimeList user named FrozenRoy was on his friend's Crunchyroll account, looking for a show at the start of the anime season to watch, and eventually review on My Anime List. Our little FrozenRoy quite enjoys steampunk and clockpunk stuff and so was interested in a show called Clockwork Planet, because it had a really interesting premise. That's how we get here.\r\nClockwork Planet's premise is, indeed, pretty cool: The planet Earth was fucked up so hard that it looked like humanity was going to become extinct, long ago. A supergenius only known by Y proposed and performed a massive operation to replacethe planet, piece by piece in its entirity, with a world made out of clockwork, gears floating in space. And he managed to do it. A thousand years later, we live in a world of gears where clockwork machinery is an every day part of life, and main character Naoto Miura discovers RyuZU (yes, the caps are meant that way), a clockwork automaton made by Y.\\n\\n\r\nThis is a fairly solid start, right? We've got potential mystery of the past and present, if you like cute girls its got a robot, the other main character Marie is also presented as facing a crisis with one of the city's main gear towers, giving us some instant suspense. So, sounds like a good start for a series, right? How does it shape up?\\n\\n\r\nHaha, it is TERRIBLE. First off, the plot and backstory is all but irrelevent. Very little of the show couldn't have just been set in a somewhat future world and been almost the same. Marie's plot with the military is one of the most obvious and yet blundered plots I've seen in a while: The \"villain\" is utterly incompetent both in terms of in character and how they are provided, for example, and the logic of it is quite absurd, I'm trying not to spoil it but...look, its like if you tried to cover up killing someone by going out and bombing a police station. Yeah, great, people might not investigate that murder, now you're on the hook for something more! They later do try to do a single thing with the Y backstory, but its so poorly communicated that it ends up as very muddy and simply doesn't go anywhere, creating a villain with essentially zero motivation.\\n\\n\r\nThat's another thing about this series that sucks. There's a few villains who are even named and all of them have either cardboard cutout or non-existant motivations, never get to fight and do not perform logical plot functions. Instead, 90% of enemies are nameless mooks who are supposed to be good fighters, but get mowed down by the dozens until they are little more than speed bumps on the path of the heroes. When the game makes it out like they are actually a threat, it doesn't feel tense or believable, because we've seen these exact enemies get simply flattened previously, eliminating the suspension of disbelief.\\n\\n\r\nCharacters in this series tend to end up with boring or inconsistant characterization. Naota has any potentially interesting gimmick in how much he is just a huge gear fan in this world, buuuut that mostly goes nowhere and he ends up being the generic main character surrounded by waifus. RyuZU has is oveprotective but it seems very selective when she is and otherwise is kind of just...there, it is hard to say she has a very defined personality, although that to an extent has a point due to her robotic origins. She does have one good quality, especially in a show full of not very likable characters: She's programmed to phrase her compliments in the most biting manner, resulting in her cutting down character's for their deserved stupidity repeatedly. \\n\\n\r\nI hold a particular dislike in my heart for Marie, though, whose character was terrible and incoherent throughout the entire piece. The show really doesn't know how to portray her. Sometimes she comes across as incredibly hot headed and arrogant, other times she is over the top depressed about her abilities. Most commonly, she seems to take whatever extreme that Naota isn't taking, in order for him to take the reasonable viewpoint and come out on top of her, which also makes stuff of the finale seem rather out of place in the series. Her super speed repairing powers seem quite random and are generally poorly animated, she generally was very badly done as a character, including a worse \"hidden identity\" than Clark Kent, which also ends up being thrown out in like 3 episodes anyway so WHAT WAS THE POINT. TELL ME YOUR SECRETS, SHOW.\\n\\n\r\nYou also get Halter, who is...generic bodyguard basically. AnchoR I can't talk much about for some spoiler purposes, but she too is quite bad, and in particular has some icky stuff where the show really doesn't seem to want to know if it wants to take a romantic rival or daughter situation with her. The results are as squicky as you might imagine.\\n\\n\r\nAnchoR is a good anchoring, hehe, point to talk about the shows AWFUL art and sound design and direction. The art is the far worse of the two: AnchoR's hair frequently looks like toothpaste on top of her head and character's outfits are frequenrly drawn in an odd and improper manner, making it look almost more like a paper doll with clothing that is a part of them and shifts awkwardly. Expressions do not always properly follow moods, often if animation is repeateded, such as Marie looking confidently annoyed at Naota in a scene where she is clearly in great distress. Animation of characters often is flimsy during talking or still shots, making characters look uncomfortable and blob-like, with machinery having uninspired designs and backgrounds being sparsely detailed. AnchoR frequently gets it the worst due to her dress and hair, making her stand out as being unrealistically poor in the crowd.\\n\\n\r\nSound design is similiarly poor, with uninspired voice acting with the exception of Halter who has a kinda cool older guy edge to him, entirely forgettable and drab in-story soundtracking and lacking sound effects for various things, although it often more skirts to forgettable than horrible in comparison to the art. I gave it a 2 simply because the OP is decent enough, especially with the clock effects in the background, and because of a handful of good mechanical noises in the finale, putting it above the true dredges of the world in that regard. \\n\\n\r\nSo, ultimately, the thought of this show should be rather obvious: It is dreadful. The plot is poorly paced, with filler slapped in at random and utterly drama breaking comedic moments hampering a script full of obvious stupidity and little tension. The art is some of the worst I've seen in a while, unless you are a huge fan of Colgate making some hot new anime. The sound design is poor and uninspired and the characters have difficult defining their personalities or otherwise are extremely inconsistant and poorly done. Battles are extremely disappointing, with action scenes largely consisting of stomps or boring fights against mooks, with no true villain fights even, eating up runtime as little more than filler. If you consider yourself a connoisseur of bad anime, then give Clockwork Planet a look, as it has plenty of material to mock with your friends. But if you want a quality anime, avoid Clockwork Planet in its entirity: You miss nothing but terrible spins on pre-existing concepts and an infuriating inability to do anything with its core concept.",
            "date": "2017-07-30T19:30:00+00:00",
            "helpful_count": 18,
            "mal_id": 254275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5765649.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/FrozenRoy",
                "username": "FrozenRoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=254275"
        },
        {
            "content": "This anime, for the lack of a better word, is definitely a disappointment thus far. Everything about it has been lacklustre in my opinion and I have to say, I've been watching this anime ever since it's been released in hopes but I'm still unsatisfied even up to episode 8 - they still jump around the plot, drag things on and cut out important bits.\r\nIt's a kind of anime that you HAVE to watch before reading the light novel or manga, or better yet, just don't watch this and read the manga/LN. \r\nIf I hadn't read the manga or the LN, then perhaps I would'verated this whole show a solid 4-5. \\n\\n\r\nAll I can say is that I'm just left really disliking this anime, after all, I have been waiting for this anime to be released since I quite liked the manga. \\n\\n\r\nStory: 4 \\n\r\nThe story's decent. It definitely has some interesting premises such as a world made of gears, this mysterious god-like person called 'Y', the meaning behind the Initial-Y series, and I'm honestly curious as to where Naoto's parents are – which, really, aren’t new brought to the table. Honestly, that's the only thing that's interesting me. \\n\\n\r\nHowever, the story is not set out quite well (I have to admit it's the same in the LN or the manga) with the animators either rushing or dragging the whole plot and cutting out some important bits from the original sources that sometimes I feel like the story is going nowhere. And to be fair, it is an anime so it requires more effort but still; I think they could handle the story a little better. \\n\\n\r\nAdditionally, the story's quite predictable turning what could’ve been something interesting as just… something ordinary and decent. There’s some good humour but too much fanservice that honestly doesn’t add to the plot.\\n\\n\r\nCompared to the first few episodes though, it became marginally better by episode 8, a solid 4.5/10. Not much improvement but eh.\\n\\n\r\nArt: 4\\n\r\nNow the art - I expected so much of the art since I really like Kuro’s and Shino’s art, and not to mention the promotional poster by Shino makes it look amazing, but the art is… average. Honestly, I really, really don’t like how Naoto’s been drawn and sometimes, the anatomy of the characters turn very strange like their eyes are too far apart or inhuman actions. \\n\\n\r\nBut, like I said; the art’s average, good but not spectacular. Not all of them look the same and they draw action scenes quite well (I suppose) and I really like the drawing of the buildings, the gears, the weapon animations and fighting sequences and the world. The lighting effects are quite… exaggerated but you can see that the animators are quite talented.\\n\\n\r\nI was also rather confused by the opening with the roses and them dramatic poses. \\n\\n\r\nSound: 6\\n\r\nI guess the sound is better. I like the songs, they’re fairly good for the soundtrack across the episodes, though I kind of don’t pay much attention to them since I get mildly distracted from the interactions of the characters, it’s fitting to the mood of each scene it plays at – it’s an aspect that I appreciate in this anime. \\n\\n\r\nI really like the fight scene music, too, since they make them sound cooler and the sound effects are very, very fitting.\\n\\n\r\nOf course, as a Soraru and Mafumafu fan, the ending song is AMAZING. I love their voices so much and the beat is just, woah. Seriously, the instrumentals along with their vocals are so pleasant to the ears! It’s an ending that I always stay to listen to. \\n\\n\r\nThe cast was also alright though I find Naoto's voice a bit annoying, but still quite good voice acting.\\n\\n\r\nCharacter: 2\\n\r\nTo be blunt, the characters sucks in this anime. They are all so bland and just… typical…\\n\\n\r\nSo, worst character first, must be Naoto. The genius guy who doesn’t seem like a genius, doesn’t even know it and ends up being too rash and always making stupid choices. Not to mention he is absolutely loud and obsessive, AND perverted. His character design is okay and would’ve been better if he was more to the quite side. His only redeeming feature is he’s not the kind to give up, but even then, that feature annoys me. Honestly, I find his character irritating and I really don’t find his relationship to RyuZu all that appealing – it seemed more like nerd-guy-who-can’t-get-a-girl-actually-gets-a-beautiful-girl trope and frankly, the fanservice only served to make me hate Naoto even more – and mostly in this anime. \\n\\n\r\nSecond worst character – which a LOT of people will hate me for – is RyuZU in my opinion. She’s the typical goudere, one who wants to please her lover and speaks harshly because people apparently find them appealing – not really. Her character irks me when she frankly puts Marie as her target of insults and the like, and her relationship with Naoto is just too much fanservice for me. \\n\\n\r\nMarie has to be the better character compared to these two despite being the whiny brat character – she’s more real, and more to the we-need-to-plan-first person, kind of like a foil to Naoto – in a way, she’s more human than Naoto. While Naoto is irritating in the way that I can’t care for him because he doesn’t care about the millions of people dying over his waifu who can be fixed unlike humans, Marie cares and she’s self-conscious about herself to the point she wants to be the best and actually concerns more about the people rather than some automaton waifu, though she is still quite unlikeable since she’s the typical tsundere princess genius trope. \\n\\n\r\nHalter and AnchoR are best characters just because they aren’t as annoying as Naoto and Halter reminds me of a Dad and AnchoR is just so cute.  \\n\\n\r\nI also feel like they missed a lot of characterisation that was included in the manga/light novel. \\n\\n\r\nEnjoyment: 4\\n\r\nIf I hadn’t read the LN or the manga, I would have given this show a good 5/10 for enjoyment, because while I rather watched only to be disappointed, it is rather enjoyable and quite laid-back. The sound is pleasant to the ears, the animation is rather nice to look at if you can get past the annoying characters and there are some characters that you can enjoy.\\n\\n\r\nOverall: 3 \\n\r\nIt’s a good 3/10 because the recent episode is fairly okay. It just cuts out too much important information but drags on unneeded ones, the characters are just annoying and very dull as a show with a rather interesting premise.\\n\\n\r\nIf you want to enjoy this anime, I highly recommend that you watch this either without reading the LN or manga, read it after or just don’t watch it and read the manga (the manga has fewer fanservice scenes than both LN or anime).\\n\\n\r\nI'll see if the future episodes will change any of my scores in the future *crosses fingers, hoping it would*",
            "date": "2017-05-27T12:27:00+00:00",
            "helpful_count": 12,
            "mal_id": 248651,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/yukimi05",
                "username": "yukimi05"
            },
            "url": "https://myanimelist.net/reviews.php?id=248651"
        },
        {
            "content": "This anime is a bit special to me; it was written by the author of No Game No Life, one of my favorite lightnovels, Yuu Kamiya-sensei. \r\nFirst off, I would like to say that the benchmarks for a 10 are:\r\nStory: Steins;Gate, Iron-Blooded Orphans\r\nArt: 5 cm per second, Violet Evergarden\r\nSound: Guilty Crown, Spice and Wolf\r\nCharacter: Kimi no na Wa, Koe no Katachi\r\nEnjoyment: Lucky Star, Ghost in the Shell\r\nOverall: Working!!\r\nIt is the story of a genius boy (Naoto) that can hear every detail inside a world made entirely out of clockwork by a man named Y 1000 years ago: Clockwork Planet. His skill is certainly useful inthis world where everything is made out of gears since he can spot problems really quickly.\\n\\n\r\nOne day, a girl automaton - human-looking androids that are wholly made of gears - falls from the sky. She has one gear malfunction, which Naoto quickly repairs. She is revealed to be RyuZU, over 1000 years old, and was built by Y himself. Thus starts the story of a genius boy and his legendary automaton, along with another genius girl, Marie Breguet, youngest Meister in history, and her butler.\\n\\n\r\nAs you can see, there's lots of geniuses in this story, which is a trademark of Kamiya's work. If you read the light novel, you also know that the playful tone gently complements the dense details very well. The story is paced a bit weird, but paced enjoyably, so it gets very good; it doesn't matter what technique they used as long as the consumer enjoys.\\n\\n\r\nThis anime makes quite a good use of the medium; it is stunning to see a world entirely made out of clockwork. The style is also what I expected: I really liked Naoto and AnchoR's designs. However, I would have liked to see a bit more details and shadows here and there. It feels like the budget was lacking a little, after spending it all on animating the countess gears. The endings and openings are much better animated than the anime. If the whole anime was animated like that, I would comfortably give a ten. Therefore, I also notched it down to a 9, because the quality was inconsistent. Although the gears are absolutely stunning and beautiful, some scenes are literally a character standing there while the background pans from left to right. I believe Kamiya-sensei's work deserves more budget than this.\\n\\n\r\nAs for the sound, I find it quite pleasant to listen to. The OP and ED aren't particularly good, but neither are they particularly bad. They sound quite generic, but the animation is something absolutely amazing to watch. The music paced well with the actions of the characters, and it flowed melodiously and didn't feel weird. It deserves an 8 because it isn't particularly touching either.\\n\\n\r\nThe characters are getting a solid 9, almost touching 10. Naoto's baby-like idiot behavior is something that not many anime exploit, and RyuZU's arrogant but loving servant attitude is pretty unique too. Breguet and AnchoR are both quite memorable; you won't mistake them for anyone else in the \"Waifu or Laifu\" game. There is quite a good character development, but still somehow lacking compared to most romantic, character-centered animes. It still gets 9 because this anime is more story and action-centered, and we have to compensate for that too.\\n\\n\r\nEnjoyment gets full marks: any anime that's interesting enough to make me stay up the whole night watching (me, who isn't a binge watcher and got tests coming) are deserving of full marks. The fanservice isn't appreciated by me (not a fan) but I didn't feel particularly uncomfortable rewatching it at school. Some moments even made me laugh. The rewatch rating is also very high; would rewatch anytime. Enjoyment is up there with Rewrite, Working!! and Lucky Star.\\n\\n\r\nOverall, it gets a 9. It would have been a 10 if only the art was a bit better. It's a really thin line, but it's probably in the 9.5 range, since I did see the amazing OP and ED, meaning the studio did have the skill to animate this properly.\\n\\n\r\nReccomend: Chobits, for an enjoyable trip to a cozy home in future Japan",
            "date": "2018-01-19T19:06:00+00:00",
            "helpful_count": 8,
            "mal_id": 269069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6890669.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iveykun",
                "username": "iveykun"
            },
            "url": "https://myanimelist.net/reviews.php?id=269069"
        },
        {
            "content": "This anime sucks. Earth is destroyed and a genius name Y recreate it with gears, the story may look like interesting but trust me, it's not. The first few episodes looks pretty interesting but i don't understand why they put fan service stuff in this anime. Well it's not like hardcore but it's very lame. You don't even laugh for the jokes, it's that bad. The story gets worst every new episodes come's out. I have dropped this anime at episode 8. \r\nStory - Horrible story, suddenly a female powerful robot falls from the sky and he considers it has his wife and after fewepisode they fight his female robot sister and win and calls it has his daughter. To accompany this three, there is one more small girl and she has one more man has a body guard. He will be pretty much hugging this female character and other will be like, have u abandoned me !!! With all this they fight bad people.... If you are into this kind of stuff, go for it. To people who wants enjoy, learn, laugh please stop reading this review and go search for an other anime because trust me, it's not worth watching.",
            "date": "2017-05-26T03:56:00+00:00",
            "helpful_count": 9,
            "mal_id": 248553,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4890795.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Swaroopch",
                "username": "Swaroopch"
            },
            "url": "https://myanimelist.net/reviews.php?id=248553"
        },
        {
            "content": "Story:\r\nThis is the anime's weakest point. It starts off okay, but the events that go on don't generally have a particularly good connection to each other and it's very predictable. There is literally no reason to anticipate that any major character will actually die or is in any danger and it's really just a show where the major characters blow stuff up and keep succeeding. There is very little world building as well despite the potential that this show has to make that interesting.\r\nCharacter:\r\nOne of the slightly better parts of the story. There is some growth in Marie Bell Briguette and there's some development withAnchoR. But other than these two the rest are kind of one dimensional. Marie also surprisingly looked a lot better in her disguise than her usual outfit, so it kind of begs the question why that isn't her usual design.\\n\\n\r\nArt:\\n\r\nIt's one of the more distinct art styles in this day and age, albeit childish-looking. The backgrounds are nice, but the characters could have used a more sophisticated design.\\n\\n\r\nSound:\\n\r\nIt has a nice-ish opening song. In general though, nothing special.\\n\\n\r\nEnjoyment:\\n\r\nNot displeasing like some worse written anime out there. Just not great.\\n\\n\r\nWho's this for?\\n\r\n-Kids\\n\r\n-People who want a simple and straight forward plot\\n\r\n-People who just want mindless action\\n\r\n-People who have a thing for lolis (AnchoR and Marie)\\n\\n\r\nWho's this not for?\\n\r\n-People who want a sophisticated plot\\n\r\n-People who want all the main characters to be decently 3 dimensional\\n\r\n-People who enjoy more sophisticated art/character designs.\\n\r\n-People who want there to be good world building",
            "date": "2017-06-23T11:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 250775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6177738.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SongstressSL",
                "username": "SongstressSL"
            },
            "url": "https://myanimelist.net/reviews.php?id=250775"
        },
        {
            "content": "It's not a good sign when the most compelling scene of a new anime series occurs before the opening credits in the first episode. Clockwork Planet was pretty much all downhill from there. \r\nI recall noticing a comment on some website or other noting that this was the ultimate chuunibyou show, and I'd say that's about right. Clockwork Planet plays out as an endless variation on weird anime-centric fetishes instead of something resembling a real story. I was initially attracted to the show because I thought it might involve some kind of steampunk aesthetic, but I was quickly disabused of that potentiality. Instead, you havea ludicrous notion that the entirety of planet Earth was reconstructed with gears, cogs, and endless other mechanisms. Evidently this world also includes artificial intelligences that are also made entirely of clockwork parts. \\n\\n\r\nNow, this is not necessarily a bad premise for a series, but Clockwork Planet makes absolutely no effort to explain, justify, or even marginally expand on this initial concept. Instead, you get a lot of incredibly dull bickering between the two protagonists, and even more ridiculous interactions between them and a few clockwork-based humanoid creatures. It's barely worth expanding on this aspect of the show, but the male protagonist spends a ton of screen-time obsessing over two female clockwork entities to the point that it really becomes creepy. Obviously this is the intent, and it's acknowledged quite a few times during the 12-episode run. But why? Who cares? Not me, at any rate.\\n\\n\r\nI didn't care because, for all of its action scenes and supposedly intense narrative drive, Clockwork Planet had nowhere to go. The characters don't really develop, and really it's pretty generous to even call them characters at all. You're essentially given a set of archetypes and asked to care about their actions and choices when (a) they're really just constructs serving as mechanisms to advance the plot, and (b) they never really develop in any noticeable way. If the overall plot had been at all interesting, then I think it would be possible to forgive some lack of decent characterization, but I couldn't be bothered to care about that aspect of the show either. As far as I could tell, things happened, characters popped up when necessary to advance the rather meaningless story, and then it all ended. That's it. \\n\\n\r\nI was incredibly disappointed by this show and I would not recommend it to anyone. It's not vile, but it's pointless. I know that the goal was to create some really cool show with \"meaningful\" plot developments and genuine emotional depth, but I cannot possibly imagine how the mess that is Clockwork Planet could ever attain even the level of an average but uninspiring series. In a way, perhaps that's appropriate. Clockwork Planet, in a sense, lived up to its name. The show runs like an odd little machine ticking away, without a point or purpose. By the time its mechanism ran down at the end of episode 12, could anyone really have been bothered to wind it up again? I certainly could not be bothered.",
            "date": "2017-06-23T00:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 250727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5016597.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/delta5",
                "username": "delta5"
            },
            "url": "https://myanimelist.net/reviews.php?id=250727"
        },
        {
            "content": "Alright this is my first review but cut me some slack\r\nI watched up to the 6th episode and i gotta say this anime is crap. The characters are too 1-dimensional, the tensions is fleeting and the first villain doesn't even provide any form of pressure.\r\ntake an example from the first scene we see this \"villain\", at first he's all chill and stuff saying things like \"I can't let you do that, it's against the \"insert powerful association\" orders\" and doesn't let tsundere girl go save people. But the moment she pulls a gun on him out of anger, he suddenly squeals in fright completely ruiningthe moment. \\n\r\nNot to mention it's really rushed. (apparently the first 4 episodes went through 2 volumes)\\n\\n\r\nIt was really hyped up because it was created by the same person who wrote NGNL but honestly it doesn't live up to it's glamor.",
            "date": "2017-05-14T18:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 247683,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5365166.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/White_Jester",
                "username": "White_Jester"
            },
            "url": "https://myanimelist.net/reviews.php?id=247683"
        },
        {
            "content": "Now this is important: You should never just take someone else's opinion as the end all be all.\r\nILL KEEP IT SHORT FOR YOU:\r\nThis anime is a masterpiece in its own right. The only way i see it getting so many bad reviews is that all the people that actually bother to write these things are closed minded idiots that cant embrace the different perspectives that some anime series try to recreate like this one.\r\nClockwork planet's plot is by all means short and very open to a second season if they can bring back the same or improved interest (hooks) as the first season.\r\nWith its stupidcomedy sections thrown into random scenarios the series keeps you focused on not just the action packed fights but also at what the characters are saying.\\n\\n\r\nIf we look into the characters a bit, we will notice that they are plainly common personalities, seen time and time again in lots of anime, manga and light novel series. But when we tae this into account along with the random idea of a world like a clock, you will realise that it makes sense to keep the simplicities in the series or it becomes too difficult for people to connect and enjoy the series.\\n\\n\\n\r\nNow there are a few issues with the plot of this series, like how the problem each time ends up being too similar and the solution is almost always the same as well. Also there's the cliché that the main characters just happen to be the only people capable of fixing the problem even though the world of clockwork planet s one with many abnormalities, or you could say, dark places with who knows what lurking. \\n\\n\\n\r\nSo overall I personally think this series is possibly up there with one of the greatest in the last decade, and I would bet that lots of you will have similar but not so extreme opinions on this series.\\n\\n\r\nNick Shadows\\n\r\n(waiting for season 2)",
            "date": "2017-10-26T23:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 261811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5466755.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NickShadows",
                "username": "NickShadows"
            },
            "url": "https://myanimelist.net/reviews.php?id=261811"
        },
        {
            "content": "You know what type of anime is the absolute worst to review? The one where you can't even voice a detailed opinion about it without a horribly massive spoiler, which I won't reveal. I was incredibly close to dropping this whole thing every moment from episode 1 to 10 but stuck with it almost entirely thanks to the beautiful artwork, even though 9 of 10 contraptions are just dumb redundant clusters of gears spinning in place without the slightest credibility to their function.\r\nI flat out hated the main guy until the spoiler, then I only disliked him intensely. I thought everything was absolute moronic garbagebeyond compare until the spoiler, then I only thought it was really dumb and poorly planned. Had I stopped and dropped before the spoiler I'd have scored this anime among the worst I'd ever had the misfortune of watching, now I only think it was a waste of patience.\\n\\n\r\nI won't reveal what happens down the road, if you can endure hours of nothing but a giant middle finger raised against everything you know about physics and mechanics you deserve all the reward you can get. As usual with these logically flawed animes you're more likely to have a good time the more ignorant and unintelligent you are, this also applies to a reduced-but-still-huge degree after the \"conclusion\". Since I have a very good understanding of physics, mechanics, basic neurology and general human biology the only things that pulled the score up were fine art and good enough sound.",
            "date": "2017-10-18T12:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 261126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261126"
        },
        {
            "content": "TL;DR Section at the end of the review. This review may or may not contain minor spoilers.\r\nOh, Clockwork Planet... How I had such high hopes for you, and in a way, you didn't let me down at all.\r\nClockwork Planet revolves around a world made out of... gears and clockwork parts. Go figure. The earth's resources had been used up to it's fullest, so a mysterious man known as Y made the Clockwork Planet by himself. Fast forward a hundred years or so, and we have Naoto Miura, an aspiring clocksmith. Someday, a female automaton falls through his roof, and discovers that she's not functioning properly.He then uses his insanely OP talent of being able to hear how the gears move and see their locations to fix RyuZU. She ends up making Naoto her master as they move on to greater and bigger things.\\n\\n\r\nThe problem with this show is that it's insanely cheesy and so poorly done that I honestly believe Xebec was trying to make a joke of this show, in and of itself. The goofy animation, lines, and ideals spouted from Naoto made this a great show for just turning off your mind and watching on autopilot. Marie, on the other hand, is just about as annoying as you can get. With her constant \"I am regarded as a genius, yet I can't do anything!\" bullshit will frustrate just about anyone and everyone that watches this show. All the other characters are absolutely not important and are just there to wreck havoc upon the world at large. I'd just like to mention as well, Naoto should've been a female character.\\n\\n\r\nThe art and sound direction are less than mediocre. As formerly mentioned, the art/animation is just really lackluster, and the same goes for the sound. There was several really odd scenes with the animation (see last episode with the hand clap of Marie and her friend) that just felt so out of place.\\n\\n\r\nTL;DR: Clockwork Planet is only enjoyable if you're able to turn off your brain and just watch for the awfulness. If you're a super serious person who watches for amazing action scenes, insanely moving dialogue, or exponential character growth, this is not the place for you. Only watch this show if you're okay with having a good time watching something really, really underwhelming.",
            "date": "2017-06-30T20:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 251601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078535.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/deathline",
                "username": "deathline"
            },
            "url": "https://myanimelist.net/reviews.php?id=251601"
        },
        {
            "content": "STORY: Story begins when Naoto saves a cyborg named RyuZu by activating her. RyuZu pays him back by calling him master and ordering his commands. Soon, they team up with a girl named Marie and her bodyguard Halter. The enemy = the government. They have committed purges on the cities which causes the destruction & deaths of the citizens. The story also talks about the origins of how Earth was re-created over 1000 years ago with gears by Y. He is also the creator of RyuZu. CONTAINS: A lot of backstories and conspiracies, Action-fighting scenes, Humor, romantic-comedy moments (including Loli) & weird sexual encounters.\r\nCHARACTERS:\r\nNaoto: Highschool student who has a gift of repairing robots and automaton with sound. Has a fetish for beautiful automatons. Caring, but perverted too.\\n\r\nRyuZu: Strongest weapon created by Y. Owes her life to Naoto for saving her. Her outfit reminds me of a nun. She is brutally honest and can come off as a savage (with her words and fighting skills).\\n\r\nMarie: Gifted young Engineer. Has a Doctorates Degree. Strong on the outside, but during tough situations... she is very vulnerable. Plus, she has a sweet tooth and uses desserts as her source of energy.\\n\r\nHalter: Marie's bodyguard, former soldier, has cybernetic parts. He keeps Marie in line whenever she gets out of control.\\n\\n\r\nOVERALL:\\n\r\nAlright, but I really enjoyed the battle scenes in the anime. It's really cool to see how gears work and integrated in their everyday lives. BUT, I would really like to know what was the cause of Earth's destruction prior to Y reviving it!",
            "date": "2017-06-23T06:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 250751,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=250751"
        },
        {
            "content": "Now, I'm not going to say this was a masterpiece, but after watching 11 episodes (soon to be 12 later today when it comes out on CRoll) I can tell you that this anime was a fun ride. When it first came out, I was hesitant because I wasn't sure how well they would adapt the novel. It really does a good job at squeezing out the more entertaining parts from the 3 novels it has covered into a 12 episode series. Personally, I believe that it is one of the best new anime this season. I would suggest it, but I have to warnyou, the first episode really made me and quite a few other fans nervous, as a couple scenes really didn't make the anime look promising. I would say after the first episode, it has a been a very smooth ride.",
            "date": "2017-06-22T06:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 250644,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6336492.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/appaweeb",
                "username": "appaweeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=250644"
        },
        {
            "content": "This is my opinion, If you get triggered while reading this because you don't like the anime don't read it.\r\nPersonally I thought it was a very good anime. Even though I have not written many reviews before.\r\nI think this anime is very good even though It doesn't have so many episodes. The audio in the anime was pretty good.\r\nIt actually had a decent storyline but I felt like it had much more potential. The character designs were very unique and had an outstanding design. Overall it is a very good anime.\r\nAnd I would highly recommend it for viewers.",
            "date": "2017-07-26T06:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 253836,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/20XX_Shine",
                "username": "20XX_Shine"
            },
            "url": "https://myanimelist.net/reviews.php?id=253836"
        },
        {
            "content": "It is mediocre.\r\nThe series is set in a world where Earth was destroyed, and in its place a clockwork planet was built by a mysterious individual called Wye for humanity to live on. Thousands of years later, the protagonist Naoto, a young clocksmith with unexplained superhuman hearing, has an ancient robot girl fall on him, and is the first person to fix her after 200 years. The robot girl pledges to be his slave, and joins him and a goup of elite clocksmiths to fix the damaged parts of their world and thwart terrorists and evil military conspiracies. Another character called Marie is introduced whogets Naoto into the organisation, and the two have a very interesting dynamic in which both are geniuses in their own ways, but their opposing ways of going about fixing problems makes it hard for them to get along.\\n\r\nThe series has three main problems:\\n\r\nProblem 1. The protagonists: Naoto is a weirdo who is sexually attracted to clocks and clockwork robots, and only helps Marie in the hopes of finding more clock girls due to his own perversion.\\n\r\nMarie meanwhile constantly mocks Naoto's intelligence, and even attacks him for no clear reason in the penultimate episode. She doesn't even qualify as a tsundere here, since there's no romantic implications behind their friendship, she is just an awful person.\\n\r\nThe robot girls also have nothing really unique or distinct about their personalities, and the series feels more like an attempt to sell off the writer's sexual fantasy than it does an attempt to actually deliver a quality story.\\n\r\nThere's also the robot girl Anchor who we see murder a load of soldiers in one episode, then find out in a later episode that she was programmed not to harm humans... what!?\\n\r\nProblem 2. The villains: The first episodes set up one character as being the overarching bad guy, only to be forgotten about and replaced with an old guy who spends half of his time spouting pseudo-philosophical nonsense that makes no sense and falsely accusing the protagonist of impersonating Wye... Oh, and he murders all of his own completely loyal men for no clear reason in the penultimate episode, proving that he is the worst kind of villain: the stupid villain who does evil things just to show off how evil he is even in detriment to his own plan. In short: an idiot.\\n\r\nProblem 3. The set-up: The series sets up so much regarding Naoto's inexplicable to calculate some things to several decimal places and determine complex mechanical solutions to damage, but bizarre lack of knowledge about equally complex manners. That and his exceptional hearing meant that for ages they seemed to be implying that Naoto was either a robot or Wye himself... but he wasn't, all the set-up had no pay-off and made no sense in the end, with none of Naoto's gifts being explained at all.\\n\r\nProblem 4. The finale: Speaking of unexplained, it's explained that, in this otherwise completely sci-fi series without supernatural elements, the two completely normal human protagonists are somehow able to create clock pieces with the power of their minds in order to fix the planet. How they do it is never explained, nothing that happens in the finale makes any sense, it's all just stupid.\\n\r\nAside from that it was a fun watch with decent animation, a lot of cool ideas that could really work well in other stories, some well written comedy scenes, and a nice soundtrack. 5/10",
            "date": "2018-09-25T14:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 289986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6526526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheLegendOfDan",
                "username": "TheLegendOfDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=289986"
        }
    ],
    [
        {
            "content": "Anime is like a well-oiled machine.  When all of its parts work harmoniously together (i.e. the story, characters, aesthetics, and the like), you end up with a piece of work that functions well as a piece of entertainment that has a larger majority of its audience responding well to it.  But when there're sections that don't really work all that well, then you've got a problem.\r\nStory: With the world dying to the point that it could no longer sustain life, a man known only as 'Y' rebuilt it from gears and clockwork, thus creating the 'Clockwork Planet' that the characters live in.(Don't ask me how he did it, the characters themselves don't even fucking know)  It is here where our dual protagonists come across many wrenches in this world of gears as they try and work out the kinks in the machine.  \\n\\n\r\nBased entirely on only a few of the story's beginning arcs, Clockwork Planet is a typical arc-heavy story that relies on different problems arising for our protagonists to deal with, each creating a similar problem in a different way.  These outlandish scenarios act as a double-edged sword for the series as while the plots create a semi-engaging scenario for the audience and provide us a reason to continue watching, the actual logistics for each antagonist's reason for doing their evil deeds usually don't really make any sense whatsoever.  Especially with the last arc, a lot of the show's cogs fall apart because a lot of plot aspects don't fully mesh well with each other.  \\n\\n\r\nIt's also important to note that very often the show wastes time with less action-packed scenes and focuses more on comedic or slice-of-life moments that while do help provide a better aspect of life on the clockwork planet, don't really add much to the story.  Especially since most of the time they shove these parts in the middle of the action, so it creates a jarring shift in tone.  \\n\\n\r\nAll in all, Clockwork Planet was a series that had a rocky start, picked up a little bit in the middle, and then ended with the cogs falling apart again.  Mixed with plot holes (some of which can be ignored to an extent), unclear antagonist motivation, and a surprising amount of choppiness with the story, Clockwork Planet's story ends up being a clunky mess that has some good aspects, but ultimately falls apart because things don't mesh well enough to create good synchronization.  \\n\\n\r\nOverview:\\n\r\n+ Interesting world (Gotta give 'em for an interesting setting)\\n\r\n-  Clunky pacing \\n\r\n-  Jarring tone shifts\\n\r\n-  Unclear antagonist motivation\\n\\n\r\nCharacters: Inversely, the characters of Clockwork Planet share a different opinion when compared to its story.  Sadly, if you're not a main character, than the show really doesn't care about you.\\n\\n\r\nFirst are the duality of protagonists, Naota Miura, the boy whose sexual preference is robot and Marie Bell Breguet, the short fused clocksmith gone rogue.  Obsessed with clocks and wanting to be a clocksmith, Naota represents the 'Natural Genius', as his uncanny, natural ability to hear minute problems within the rhythm of gears and figure out the problem from that actually makes him quite interesting.  As a character, Naota is a boy who adores automata to the point that he makes one his waifu and gets very upset when they're mistreated.  Marie on the other hand is an experienced clocksmith representing the 'Learned Genius' as comparatively, she knows how to fix stuff, but has to work to find the answer when her counterpart does the reverse.  Because of their contraries, the characters work well together as opposites, and the majority of the runtime is dedicated to their opposing ideas meshing together to fix the problem.  While they don't do well on their own, their teamwork brings up a good positive for the show since their bickering is actually really fun and interesting to watch.\\n\\n\r\nThen there's RyuZu, the one who follows.  As the main automaton of the series, RyuZu is a sharp-tongued robot gal who hates people but loves/respects Naota because he fixed what 200 years of clocksmiths couldn't repair.  Generally acting as a supplement to Naota's character, RyuZu acts as a bit of a gag due to how rude to everyone she is, thus creating some actually charming scenarios between the characters.  She mostly stays stagnant in terms of development like the rest of the cast, but the qualities involving her offensive nature make her very entertaining if nothing else.  Other automaton like AnchoR and Halter act a similar role in that they add more to the series to make the cast more colorful, but don't have much in the way of development and are really only necessary to the plot when needed.\\n\\n\r\nAside from them, the supporting characters are shoddy examples of what not to do when creating a supporting cast.  The antagonists have very loose motivations that don't really make sense or amount to anything, and the supporting cast either have a very tiny role and/or don't really make much sense.\\n\\n\r\nOverview:\\n\r\n+ Interesting (and entertaining) main characters\\n\r\n+ Entertaining supplementary characters to the main duo\\n\r\n-  Supporting cast doesn't really matter all that much\\n\\n\r\nArt:  Produced by Xebec, Clockwork Planet's art leaves a lot to be desired.  The animation and art itself is standard fare, and the show uses actually really nice CGI in order to create the numerous amounts of gears, cogs, and machines that we see throughout the series.  Despite its background appearance, the character designs leave a lot to be desired.\\n\\n\r\nWhile the original art for clockwork planet does leave some things to be desired, the anime's adaptation of said art has a lot of inconsistencies with it.  Character proportions (like AnchoR's head compared to her body) look off, as the heads of the characters are stretched length-wise and create some really peculiar looking people.  On top of that, the show's inconsistencies with character design make it so that one shot doesn't look the same as another, thus creating weird shots altogether.  \\n\\n\r\nOverview:\\n\r\n+ Good use of CGI\\n\r\n-  Inconsistent character designs\\n\\n\r\nSound: Appropriately (or lazily) named 'Clockwork Planet', the show's OP made by Fripside is...quite samey to what the group makes.  A lot of their songs sound very similar, and this one is no different.  That isn't to say it's a bad thing, as the inclusion of windup noises and the overall tone of the song is still quite nice despite how similar it sounds to a multitude of their other tracks.\\n\\n\r\nThe show's ED on the other hand (also appropriately named), \"Anti-clockwise\", is a louder, slightly more screechy song with dissonant piano chords and an all around messier structure comparatively to its OP counterpart.  It's not that pleasant to listen to, and is one of those things that's worth skipping not because it's forgettable, but because it does grate on the ears a little bit.\\n\\n\r\nOverview:\\n\r\n+/- Tracks vary with your mileage\\n\\n\r\nPersonal Enjoyment: I was anticipating the release of Clockwork Planet for quite a while.  It was one of those show that I really wanted to watch and I had to wait for its release because it was stuck in development hell for a little while.  Unfortunately, the end result I wouldn't say is worth the wait, but despite that, I still enjoyed it regardless of the fact that I can just as easily chalk up a lot of the shows problems and ultimately say that it is indeed a 'bad adaptation'.  \\n\\n\r\nDid I enjoy this series?\\n\\n\r\nCritically, the show has many flaws.  Despite that, Clockwork Planet still managed to be a guilty pleasure of mine.  The bickering between the main cast really made the show enjoyable for me to the point that I really didn't care much for the story or any other aspect of the show.  Fripside's OP's always interest me, so I would be remised if I said that I didn't enjoy that too.  Sure it's not a great show, but a show doesn't have to be 'great' in order for one to enjoy it.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nThe last arc felt really weak.  Especially since it took about a third of the runtime, having a huge portion of the story stumble towards the end was a big letdown, especially since very few things at the moment clicked in place.  \\n\\n\r\nWould I recommend this series?\\n\\n\r\nIf you just really want to see some interesting characters talk to each other, than Clockwork Planet fits the bill.  Again, the show struggles with having a cohesive story and the visuals leave some things to be desired.  Despite that, its characters make the show good enough for those with low standards to still find something enjoyable to watch, so if anything, I'd say this show is for those willing to devote some time to enjoy something that's kinda stupid, if anything.",
            "date": "2017-06-22T14:55:00+00:00",
            "helpful_count": 67,
            "mal_id": 250691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=250691"
        },
        {
            "content": "I will note that I am not the best at writing reviews, and that this is only my second or third time writing one. It may not be objective and fair, but these are my honest thoughts on this anime.\r\nI decide to give this a fair try, and I'll be watching it till the end, my friend suggested it to me and that is why I am continuing to watch it otherwise I would have dropped it the first episode. He claims it picks up but I have yet to see that.\r\nThe story is one of the weakest aspect of this show, careful because Imight spoil a few things within the episodes I have already watched. The story goes as follow; random robot or android made of gears falls on some random kids home--the kid is noted to be unable to fix anything that has to do with gears, yet he can hear gears and is able to fix the android which hasn't been fixable in 200 years.\\n\\n\r\nThat's just the first episode but no need to go further, over all it doesn't pick up and is unable to keep what tension there is by including poorly placed jokes to lighten things up.\\n\\n\r\nWe move to the characters, the main character which I described in the second paragraph doesn't have any redeeming quality's other then liking gears and there is so much that could come from a series all about gears, but it doesn't seem like the gears are the main focus, just an after thought. Honestly the characters are non existent in their form in the anime, just generic personality you would expect. Naoto Miura is the happy go lucky one track mind pervert who loves his gears and won't do anything that doesn't involve gears. And Marie Bell Bregute is constantly looking to be the best that she can be and fix everything. There really is no personality here.\\n\\n\r\nAm I enjoying this series, no, I am watching because I'm expecting it to get better but I am not seeing that. So in conclusion it's not a series I would suggest but others seem to enjoy it, and if you enjoy it, good for you, it's just something I would have dropped long ago if not for my friend. I gave it a 4 and if it does pick up I am open to changing that number but for now, it remains.",
            "date": "2017-05-12T15:33:00+00:00",
            "helpful_count": 59,
            "mal_id": 247544,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863491.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Moe_VII",
                "username": "Moe_VII"
            },
            "url": "https://myanimelist.net/reviews.php?id=247544"
        },
        {
            "content": "Clockwork planet review \r\nBeautiful android girls saving the world from government corruption with the help of an eccentric ability user and a genius engineer. \r\nThere are slight spoilers mainly in character analysis so please be aware as you read the review \r\nBased off the light novel of the same name Clockwork planet is an action based anime that has a pretty interesting premise in that it combines an action based anime with something that we usually see inside a sci fi anime which in this case are the automatons which is a type of advanced android that populate the world that this anime is setin. Combine this with the unique setting that Clockwork planet is set in and you get clockwork planet. I always been a fan of sci fi and action anime but what I really like more is one that combines the excellent combat scenes that most action anime has with the futuristic settings that sci fi anime are renowned for. Clockwork planet combines the best elements of both into one and is one anime that’s been in my watch list ever since I saw the pv. \\n\\n\r\nStory and setting \\n\\n\r\nThe story for clockwork planet takes place in the future where the planet after a series of destructive wars has left it barren and close to destruction has been transformed into a new planet that is composed entirely of gears by a renowned but mysterious clocksmith called Y. The setting for this story is centered on a futuristic version of japan which like the planet has undergone a radical change in its environments and in society.  \\n\r\nThe overall plot for the series is largely revolved around the theme for this series which is justice and the fighting of government corruption and follows the lives of a young teenage Boy called Nauto who possesses a unique talent that is seen by society as a threat and Mari a young teenage girl that also has a unique talent that allows her to excel in her duties as a meister which is an advanced engineer that is trained to repair the tech that is used in this futuristic world. Along the way they are assisted by Ryu zu and anchoR two advanced androids that were made in the early years of the transformation and are more advanced than any automaton that exists in the world. They are further assisted by a host of support characters that come from all walks in life. The overall plot of the series based off the concept of justice and pits Naoto, Mari and their allies against the corruption that has taken root in governments around Japan and can be described as a fight against social injustice. \\n\\n\r\nAnchoR\\n\\n\r\nAnchoR voiced by veteran seiyuu Sayaka Senbongi of girlish number and unlimited Fafnir fame is one of the main characters of the series and one of Nauto and Mari’s main allies in the series. An advanced Y series android and a sister to Ryu anchoR resembles a young girl both in terms of in terms of physical appearance and in terms of personality. Personality wise anchoR is a cute, kind and innocent girl that behaves very much like someone of that age group. As a result of being ordered to guard a powerful weapon deep underground however in the beginning of the series anchoR was bound to a strict set of rules that mandated the actions that she can take as part of her duties. These unfortunately had the effect of causing her a great deal of trauma as her duties meant that any intruders that she detects will be terminated by her. As a result, at this point anchoR hid her true personality behind a wall wishing with all her heart for someone to hear her voice and save her. later on, and after she meets Nauto and Mari properly anchoR is finally awakened from her nightmare and her personality reverts back to her true self. As a result of waking up and seeing Mari and Nauto anchoR has the impression that Mari and Nauto are her parents and as a result see’s them as her mother and father respectively an aspect that I found to be cute and suitable for her character. Though somewhat slow to trust due to her past traumatic experience once anchoR’s has fully trusted someone she can be surprisingly loyal to that person. Though still bounded by the contracts that she forms with her master she can on occasion disobey an order if it means it will help her master. As a Y series, android anchoR like Ryu is also a capable combatant and in her case, can transform into a combat automata that takes the form of a red colored assassin that is lethal in close combat. Despite being smaller than Ryu anchoR is surprisingly capable in combat and her fight scenes with Ryu in the series was really impressive. \\n\\n\r\nAs a character, I felt that anchoR was pretty well designed and fitted well with the theme of justice and corruption in that she was forced to carry out her duties of protecting something terrible that was located underground on the orders of corrupt adults despite the fact that she was nothing but a child. Seeing anchoR wake up from her nightmare that was forced on to her by her creators and awaken her true personality was a joy to see. It was nice to see her discover new things in life that she likes something that her past life can never do and in the process learning how to be more human. I felt that Sayaka Senbongi really did a great job voicing the character of anchoR. \\n\\n\r\nMarie \\n\\n\r\nMarie voiced by veteran seiyuu Saori Oonishi of Denpa Kyoushi and Food wars fame is one of the main characters of the series and is one of Naoto’s main allies in the series. A teenage girl that despite her young age is actually a member of the meister order which in this universe are engineers that are tasked with keeping the complicated gears that power this new world in working condition. As the youngest person to be inducted into that prestigious order Marie is a genius level mechanic and has an innate understanding of how gears work and how they can be repaired. Marie is also a bit of a free spirit and isn’t scared of any pressure and indeed when sufficiently motivated won’t let enemies stand in the way of her repairs. Personality wise as a result of her former position as the head of a large tech company Marie is a feisty and confidant person that because of her skills can be arrogant at times and be dismissive of other people.  Marie’s most prominent trait is no doubt her determination which comes from her pride both as a meister and as someone that worked so hard to learn all the required skills that she has. As a result, even when confronted with a problem that is impossible to fix or modify Marie when sufficiently motivated can become really determined to finish that task and will not let anything that gets in her way. Despite her confident nature Marie can become depressed and go into despair especially when confronted with situations that seem to be impossible to decipher even for someone of her skills. This is however where her bond with Nauto comes into play however. \\n\\n\r\nMarie’s relationship with Nauto is an interesting one and one that forms part of the overall plot for this series. Though their initial meeting was anything but friendly and more along the lines of mutual antagonization over the series their relationship starts to improve as they both learn about each other and overcome challenges together. In the beginning of the series Marie’s relationship with Nauto was rather icy that stems from both her pride as a meister that caused her to look down at Nauto who she felt didn’t deserve such an ability. However, as the series goes on this relationship soon turns to one of respect as she become impressed by how useful and ground-breaking his ability is though this is far from the only reason as she also appreciated that fact that Nauto can always come up with a plan of action that while always sounding crazy never less has a good chance of working. By the end of the series it’s apparent that between Nauto and Marie is a relationship that is built on trust and respect for each other’s respective skills.  Another aspect of the relationship that is unique to Marie’s relationship with Nauto is way that Nauto supports Marie. Despite her positive and determined nature even Marie will sometimes find herself in the throes of despair and in this state Nauto is one of the few that can help Marie get out of that state. Just as Marie can appeal to Nauto’s skills at listening to gears in order to cheer him up Nauto when trying to cheer up Marie often makes use of jabs at Marie’s vaunted determination and pride that she has that usually has the effect of making her angry but at the same time open her eyes to new ideas that she is able to deduce thanks to her intelligence. \\n\\n\r\nThe character of Marie I felt was pretty well designed and served as a great contrast to the other main characters of Nauto, Ryu and anchoR. Seeing two people of differing backgrounds be able to put aside their differences and develop a respect for each other and work together was a concept that I particularly liked. I felt that Saori Oonishi really did an excellent job in voicing the character of Marie. \\n\\n\r\nVainney \\n\\n\r\nHalter Vainney voiced by veteran voice actor Kenichirou Matsuda is one of the main characters of the series and one of Marie and Nauto’s main allies in the series. A combat automaton that takes the form of a mid-aged man Halter serves as Marie’s bodyguard and main adviser in the series. A loyal, calm and stoic person Halter has a long past with Marie as he’s been serving her family and protecting her since she was a child. As a result, the bond that exists between the two is exceptionally strong. Although a bodyguard by definition should have as their main task be concerned with the protection of their charge Halter also serves as an adviser and confidant to Marie and often provides sound advice to her that is especially useful when she’s lost or does not know how to proceed with her plans. Because of their long association the relationship that Marie has with Halter is pretty close that is exemplified by the fact that Marie often plays pranks on him. Despite this Marie’s trust in Halter is very strong and Halter in turn is very determined to protect Marie as well. Though skilled in combat as expected of a bodyguard Halter is also rational enough to realize when a situation has turned against them and when the time to retreat is at hand. As a result, Halter can often make snap decisions that are contrary to Marie’s wishes but serve to protect her. \\n\r\nThe character of Halter I felt was an interesting contrast to Marie that was different to what Nauto brought to the table in that he serves to tamper Marie’s brash nature which by my count almost cost Marie her life quite a few times in the series. Halter’s dry wit and sound advice was also a welcome addition to the cast and often had the effect of keeping tension between Marie and Nauto down a notch as the series progresses. \\n\\n\r\nNaoto\\n\\n\r\nNaoto voiced by veteran seiyuu singer Yoshino Nanjo is one of the main characters of the series. A teenage boy and a high school student that in the beginning of the series lived in the Kyoto ward in Japan. A quiet but kind and caring person Nauto though not lacking in social skills can also be described as an otaku but not a normal one. In the case of Nauto the subject that Nauto is most interested in is in gears and machines and can as a result be described as a machine otaku. Though loving to fix and assemble machines in the beginning of the series Nauto had great trouble in fixing any. In the beginning of the series Nauto as a love for fixing machines actually aspires to become a clocksmith which would allow him to fix all kinds of machines that exist in this world of his. As a result, Nauto is somewhat jealous of those that have managed to attain that dream of his. Because of his kind and caring personality Nauto tries to treat everyone with respect and kindness but on some occasions, he can be overly brash sometimes. A prominent trait of Nauto’s personality that can be considered strange by people living in this world of his is that Nauto treats automatons with the same amount of respect and kindness that he treats regular humans with which often surprises the people that he meets along the way. Indeed, this was a surprise for even the automatons that he encounters along the way such as Ryu and anchoR. As one of the main characters of the series and one half of the Marie Nauto pair Nauto has an interesting ability in that as a result of having rather sensitive hearing Nauto is able to hear and locate any imperfections in a mechanical component and as such is able to help immensely in determining why a machine isn’t working as intended. \\n\\n\r\nAs the series goes Nauto encounters a number of different characters that he’s able to establish friendships and bonds with the most significant ones being his relationship and bonds with RyuZu, anchoR and Marie. \\n\\n\r\nNauto’s relationship with RyuZu serves as one of the main points of the series and I felt was a rather interesting one. In the beginning of the series Nauto encounters RyuZu in the most dramatic way possible and though the meeting was shocking to him was also what ultimately started his relationship with her. At first Nauto was a bit wary of Ryu as he had never seen an automaton that was as advanced as she was. But as a result of Nauto able to fix a problem within her that has compounded man men that were brighter than him Nauto was able to fix her and make her operational. Although In the beginning of the series Nauto was fascinated by Ryu as an automaton Nauto’s personality trait of treating automatons the same as he treats humans causes him to start to view Ryu as a human being as well and as the series progresses and they fight alongside one another countless times this causes develop a romantic interest in Ryu. Indeed, by the end of the series Nauto has indeed fallen in love with Ryu that culminates in a rather well put together scene where he presents a ring to her. However, Ryu zu is not the only special relationship that Nauto manages to establish as his relationship with anchoR was also another highlight of Nauto. An effect of Nauto’s relationship and close bonds that he forges with Ryu zu and anchoR is that he sees them as part of his family which has the effect of manifesting a sense of determination that causes Nauto to fight even harder to protect his family from harm. All in all, I felt that as a character Nauto was a pretty well-designed character whose main points was his kindness, honesty and his treatment of both automatons and humans equally and fairly that matched the theme of this anime pretty well. His relationship with Ryu zu was really sweet and their relationship was pretty well designed. I felt that Yoshino Nanjo actually did a great job in voicing the character of Nauto.  \\n\\n\\n\r\nRyu zu \\n\\n\r\nRyu Zu voiced by veteran seiyuu Ai Kakuma of Asterisk wars fame is one of the main characters of the series and the main heroine of the series. Ryu like anchoR is a member of the Y series an advanced series of androids that was created by the legendary clocksmith Y and despite being an old series is far more advanced than the automatons that replaced it in the world. RyuZu takes the form of a young teenage girl that can be best described as breathtakingly elegant as she really is beautiful. Personality wise Ryu zu adapts two different personas that she makes use of depending on the situation that she’s in. Her normal persona is one that is polite and respectful to all but usually quiet and focused. This is countered by her other persona that can be condescending to others but in a funny way that seems that she’s only making these comments and actions just for the fun of it. Unlike anchoR however Ryu has great pride in both herself and her specs as a member of the Y series and as a result tends to have a low opinion of humanity that despite all these years of having her in their possession have not managed to find a way to fix her. This opinion of humans however is done in a way that’s funny and contrasts with her normal composed and respectful persona. In the anime Ryu is noted to have an interesting personality trait in that she seems to prefer her actions to be dramatic in nature. Whether this is due to her wanting to display her superiority over current automatons and humans is something that we can only wonder. \\n\\n\r\nRyu zu’s relationship with Nauto forms an important part of the series main plot and is a relationship that I thought was cute and well designed. Ryu Zu and Nauto met in a rather dramatic fashion early on the series and their relationship as a result started slow. In the beginning of the series Ryu was wary of Nauto but at the same time curious about him as he despite being a mere human could repair him. After seeing Nauto’s bravery and the way that he treats automatons as well as his attempts to protect those that are dear to him Ryu zu’s opinion of Nauto improved to the point where she requested that Nauto take up the mantle of being her master much to his surprise. As the series progresses and Ryu Zu gets to know Nauto more and understand his personality as well as his ability Ryu starts to gradually fall for Nauto much to the surprise of not just herself but Nauto as well. Despite being an android, this fact was surprising to me and at first, I thought it was simply because she was loyal to Nauto but this was not so as she likes him on her own free will and not out of a sense of loyalty to him. A unique trait of Ryu that only manifests when she’s dealing with her master or with Marie is that despite her beautiful appearance Ryu actually has a sharp tongue though while sounding hurtful also does a great job of keeping Nauto and Mari on track with their tasks in the series. Despite being an android Ryu can be surprisingly human at times when she’s with Nauto as he treats her more like a fellow human than an automaton which in the beginning baffled her. These actions which are an important part of his relationship with her was interesting as it showed that Ryu can also have human emotions that she shouldn’t have such as likes, dislikes, embarrassment and of course jealously. The teasing out of emotions from Ryu by Nauto I felt was a central part of their relationship in that it allowed both to have a better understanding of each other and in the course of it establish a much better relationship. Seeing Ryu exhibit a sense of jealousy when Naoto is admiring other machines was both an interesting and funny thing to see. \\n\\n\r\nAll in all, I felt that the character of Ryu zu was a pretty well-designed character that showed that while automatons were created by humans they too can have their own free will and emotions and that their relationship with humans can be one of trust rather than one based on control. I felt that Ai Kakuma really did an excellent job in voicing the character of Ryu. \\n\\n\r\nArts and animation\\n\\n\r\nIn terms of art I felt that the character designs for the characters that were featured in this series was actually pretty good. The designs for the two Y series androids Ryu and anchoR I felt were pretty detailed and both despite looking really pretty and cute were also lethal in combat which I felt contrasted greatly with their looks. The clothing designs for Nauto and Marie I felt also did a good job in reflecting not just the time period but in the jobs that both did. The environmental design for the series is another thing that I liked and it was interesting seeing the future versions of Tokyo and Kyoto and see the subtle differences between the two. In terms of animation I felt that was pretty sharp and clear and each character whether they are main or support had a great deal of detail on them. The combat scenes for the series I felt were pretty good and were pretty well designed and executed with each fight being pretty unique. In particular the combat scenes that showed Ryu Zu and anchoR use their abilities in battle were pretty nicely detailed. The transformation scenes for both of the girls as well as the designs for their transformed self’s I felt was excellently done.    \\n\\n\r\nMusic \\n\\n\r\nThe music for the series in general were pretty good but I felt that the opening theme was perhaps the one that stood out the most. The ending theme though good felt somewhat flat when compared to the strong opening theme. The scene music for the series was generally good. \\n\\n\r\nVoice acting \\n\\n\r\nVoice acting in this series I felt was one of the series strong points and was consistently strong throughout the series. Of the characters that were featured in this show the main cast I felt had the best in terms of voice acting ability with the seiyuu’s for Ryu zu and Marie and Nauto who are Ai Kakuma, Saori Oonishi and Yoshino Nanjo respectively deserving particular praise for their performances as I felt that they did a great job in portraying their respective characters and bring them to live. Of the support cast the voice actors for the main villain in this series and the one that voices the gender bender cyborg soldier also deserves some praise for their performances. \\n\\n\r\nOverall conclusion \\n\\n\r\nOverall, I felt that Clockwork planet was an interesting anime that among its strengths included an interesting premise, interesting characters, interesting story, strong voice acting and great combat scenes. This is however offset by the fact that the series did not really have what can be considered to be a strong villain role and indeed the one that can be considered to be that role only appeared much later in the series and as a result didn’t have time to make his presence felt. Despite that I do commend his effort in that although he had only a few episodes to establish himself he certainly did a good job in making himself a threat to not just the main cast but to the country as well. \\n\\n\r\nThe premise of the show which emphasizes on justice and transparency as well as the beliefs in equality and trust between humans and automatons I felt was interesting and combined with the story was one of the main strengths of this show. In line with the theme of justice and transparency the main villains that are faced by the main characters were the government which while certainly serviceable as the villain could have been replaced by a better villain instead as their attempts to stop the cast while certainly over the top and destructive were more comical than dangerous. Despite this it was actually pretty satisfying in seeing the cast stop them and expose their crimes to the people though. On the other hand, the plans that the main cast hatch in their attempt to stop the government though was much better and far more creative in their plans than anything. Though the plans suggested as it is by Nauto always sound crazy and impossible seeing them actually work really tells you that unorthodox thinking can sometimes triumph over impossible odds especially if you have more brains than they do. \\n\\n\r\n The characters for the show whether they were main or support ones I felt were all well designed and had a clearly defined role in the narrative. The struggles that they all experienced and the way that they actually overcome them was I felt pretty well done with my favourite here being anchoR’s as her past trauma was as such that it was the trickiest to solve and overcome. Watching the main cast start to learn to trust each other and respect each other as they try to stop the government’s plans was certainly entertaining and seeing them eventually put aside their differences and work together as a team to deal with the common threat was worth it. \\n\\n\r\n The abilities that the two main characters have in this series I felt was pretty interesting and matched well with their personalities. With regards to character development for each of the characters I felt that they were done pretty well with each character becoming not just stronger but also improving upon their existing personalities. Although each of the characters are developed as the series progresses I feel that characters of Ryu and Nauto were developed more than the others especially with regards to Nauto’s bond with Ryu and her becoming more human as the series progresses. The romance between Nauto and Ryu while certainly strange I felt was interesting and also rather sweet because it felt natural as Ryu like a human fell in love because she saw Nauto’s true personality and came to admire it and the person behind it.  Though she may be icy on the surface beneath that is still someone that can still feel human emotion. In this I really liked seeing Ryu Zu act jealous when Nauto is with other girls as it shows how much has developed as a character. The combat scenes for the series Is another of the shows strong points and I felt that the combat scenes in this series was pretty well done. Seeing two Y series androids lay waste to an enemy force twice their number in a matter of seconds is immensely satisfying though that’s for sure. \\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-06-23T16:50:00+00:00",
            "helpful_count": 34,
            "mal_id": 250805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=250805"
        },
        {
            "content": "Warning possible Spoilers \r\nWhen I found out that Clockwork Planet was created by the same person who made No Game No Life I was definitely interested with what it would offer me, although despite not being as good as NGNL Clockwork Planet was still alright.\r\nWhen Earth was destroyed it was rebuilt by some God or being and made entirely out of Gears, Our MC Naoto Miura has a special gift that is needed by people to help fix certain gears, luckily he has a ragtag group to help him on his journey.\r\nThe story of Clockwork Planet is pretty confusing and I'll admit it was hardto follow, but what I got from it is that gears are used for literally everything and that includes the cities people live in so if a gear goes wrong and can't be fixed then everyone is in big trouble so a group of special scientists are used to sort out these problems, but it runs much deeper than that as our group of characters discover which is more about the existence of the planet itself, It is a difficult story to take note of and even more difficult to make into words so I'd watch the show if you want a detailed or better detailed explanation because the story though interesting isn't the best part of this show.\\n\r\nHonestly the characters are the most interesting part of it mainly because each of them seem so different that they work very well together and it brings out a surprising amount of comedy for a show that I wasn't expecting to make me laugh a good number of times.\\n\r\nHowever there is definitely one thing I understood from the story is that the word impossible is used a lot as a story development device because there are a lot of times where things go wrong for our hero's and they break down quite a lot of times because they think the situation they are trying to solve is impossible when really it isn't because they haven't used every option available, some people might think this is a stupid way to drive the plot forward, but honestly I think this just made the characters better because it showed how determined they are to save everyone even though some characters might not look like their trying to do that.\\n\\n\r\nThe characters like I said before are the most interesting aspect of the show and it had a nicely mixed bunch who seemed very different to each other.\\n\r\nNaoto is the male MC and he was very mixed for me as a character because he is someone that is fascinated with clockwork and wants to fix things yet he can never actually fix anything though he has a special hearing ability that allows him to locate any faults in the gears mechanism which really helps out the others a lot of the time, his character goes through some pretty weird stages as he starts out like a weird, but selfish asshole only caring for himself or the automatons, but after the halfway point he does start to become a better character as he starts thinking more about the people than himself.\\n\r\nRyuZU is the female MC and is an Automaton that was made at the same time the planet was made making her a 1000 years old, she doesn't really show her emotions though she is very loyal to Naoto even to the point of threatening people when they are thinking of harming Naoto and there is one thing she definitely is and that's comedic gold because RyuZU will always make a pretty savage joke against anyone and not even realise it making her a good source of comedy in the show although despite being the female MC she really didn't do a whole lot other than kicking ass and being a savage she actually doesn't do a lot to solve a situation especially during the second half.\\n\r\nMarie Bell Berguet to me is the true female MC of the show because she is pretty much Naoto's total opposite yet equal at the same time because she is incredibly good at fixing things and kicking ass too, you really notice the more you watch the show because both of them have something that the other needs making them a really interesting duo, Marie is actually a princess and can be a pretty stubborn girl yet very determined which is one of her strong points and even though she does take her anger out on Naoto and RyuZU it's actually understandable since they keep picking on her, but seeing her and Naoto's relationship develop was actually interesting and I thought she was actually a well rounded and useful character.\\n\r\nAnchoR is another Automaton who is RyuZU's sister although she doesn't do a whole lot since she joined the group pretty late there was enough time to see she was a pretty adorable character though conflicted too since she didn't enjoy being a weapon and was glad that Naoto and Marie were able to give her free will with her decisions which in turn she references them as Father and Mother which seemed pretty odd at first, but made much more sense later, she has a very strong will and will even go as far as sacrificing herself just so she can bid time for Naoto and the others to complete their tasks.\\n\r\nHalter Vainney is Marie's cybernetic bodyguard and a pretty funny one too, despite looking like a serious guy which he is Halter does like to make funny jokes with Marie from time to time even in combat though he does have a strong protective nature for Marie since he has been her bodyguard and close friend since she was a little girl so Marie is special to Halter and is willing to follow any order to make sure she's safe.\\n\\n\r\nThe artstyle looked very interesting since clock gears aren't usually something that gets a lot of concentration so seeing an entire world made out of it looked architecturally amazing even if it is CGI and it looked even more amazing how almost everything is made out of it even the automatons who had a good looking technical interior, the characters design's themselves was interesting too, but the fact that both Naoto and Marie are 16 just doesn't match the way they look then again this is something that has happened plenty of times.\\n\\n\r\nSurprisingly enough there is actually a good amount of comedy in this anime which was something I wasn't expecting and it was actually pretty funny comedy with some moments making me laugh for a good bit like when Marie got that secret message that was a bit sexual and then RyuZU made a joke out of it which was really funny, most of the time it's usually RyuZU or Marie that make the funniest moments and they are mostly unexpected.\\n\\n\r\nWith a good amount of comedy this show can be very serious as there are lots of times as I said before where the characters hit a wall and then have a big breakdown  until they get picked back up again and honestly I felt really bad for our hero's because they actually get screwed over probably every episode or almost every episode and it made me feel sorry that they had this many setbacks to deal with.\\n\r\nThere was also a decent amount of action although not the best and it was pretty short sometimes it was still entertaining especially when RyuZU or AnchoR went into their Imaginary forms which looked pretty cool and was definitely destructive.\\n\\n\r\nOverall this is probably the most interesting spring anime so far (well that isn't AoT S2) and I did like the chemistry between the characters so I'd probably recommend this to anyone who is a fan of No Game No Life to see if they get the same interesting feeling.",
            "date": "2017-08-08T06:39:00+00:00",
            "helpful_count": 30,
            "mal_id": 254978,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=254978"
        },
        {
            "content": "i was very surprised to see such low ratings! it feels weird to be reviewing a show that hasn't finished airing yet, but I felt something needed to be said so people don't turn away from this masterpiece based on the ratings and negative reviews. \r\nFirst of all, the art is incredible! This clockwork world is simply beautiful. The characters are interesting and creative. I love that the lead doesn't struggle with the kind of self esteem issues that drag on character development in many shows. I don't know about you, but I watch anime to see something more than ordinary. Anime has the powerto richly develop exotic worlds in vibrant color in ways that mediums simply can't do right now. (not cost effectively anyway!). Clockwork Planet is a world unlike our own.\\n\\n\r\nThis show does force the watcher to accept that the physics of this world (this universe is obviously not ours), differs from our own. The way these gears work looks like magic to me, and thus, this show is closer to the magic genre than to mech. But they say that any technology, sufficiently advanced, would look like magic to undeveloped peoples. If you cannot accept that in this world gears have power in a way in ours it does not, I can see how you would find the show too unbelievable. If you can watch an anime and judge it based on the ideas within it and it's ability to help you imagine a new reality far different than your own, you too will see this as a masterpiece.",
            "date": "2017-06-07T20:46:00+00:00",
            "helpful_count": 30,
            "mal_id": 249478,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/c0ldsteal",
                "username": "c0ldsteal"
            },
            "url": "https://myanimelist.net/reviews.php?id=249478"
        },
        {
            "content": "This is a anime with a intriguing idea, and interesting premise and start, that doesn't really feel like it goes anywhere.   Which is a shame as there is so much to like about the world, I liked the idea of the earth essentially being a clock work planet now.\r\nProblem is this is a example of a great idea hindered by poor villains and lack of feeling of gravitas.   I never understood the villians goals, or their reasons and what their final plan was supposed to do.   which made the final moments confusing.\r\nI would say watch a few episodes toget the feel for the anime and the world, but if you watch more, be prepared to possibly feel unfullfilled.",
            "date": "2017-06-22T13:44:00+00:00",
            "helpful_count": 24,
            "mal_id": 250686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=250686"
        },
        {
            "content": "One day, a little MyAnimeList user named FrozenRoy was on his friend's Crunchyroll account, looking for a show at the start of the anime season to watch, and eventually review on My Anime List. Our little FrozenRoy quite enjoys steampunk and clockpunk stuff and so was interested in a show called Clockwork Planet, because it had a really interesting premise. That's how we get here.\r\nClockwork Planet's premise is, indeed, pretty cool: The planet Earth was fucked up so hard that it looked like humanity was going to become extinct, long ago. A supergenius only known by Y proposed and performed a massive operation to replacethe planet, piece by piece in its entirity, with a world made out of clockwork, gears floating in space. And he managed to do it. A thousand years later, we live in a world of gears where clockwork machinery is an every day part of life, and main character Naoto Miura discovers RyuZU (yes, the caps are meant that way), a clockwork automaton made by Y.\\n\\n\r\nThis is a fairly solid start, right? We've got potential mystery of the past and present, if you like cute girls its got a robot, the other main character Marie is also presented as facing a crisis with one of the city's main gear towers, giving us some instant suspense. So, sounds like a good start for a series, right? How does it shape up?\\n\\n\r\nHaha, it is TERRIBLE. First off, the plot and backstory is all but irrelevent. Very little of the show couldn't have just been set in a somewhat future world and been almost the same. Marie's plot with the military is one of the most obvious and yet blundered plots I've seen in a while: The \"villain\" is utterly incompetent both in terms of in character and how they are provided, for example, and the logic of it is quite absurd, I'm trying not to spoil it but...look, its like if you tried to cover up killing someone by going out and bombing a police station. Yeah, great, people might not investigate that murder, now you're on the hook for something more! They later do try to do a single thing with the Y backstory, but its so poorly communicated that it ends up as very muddy and simply doesn't go anywhere, creating a villain with essentially zero motivation.\\n\\n\r\nThat's another thing about this series that sucks. There's a few villains who are even named and all of them have either cardboard cutout or non-existant motivations, never get to fight and do not perform logical plot functions. Instead, 90% of enemies are nameless mooks who are supposed to be good fighters, but get mowed down by the dozens until they are little more than speed bumps on the path of the heroes. When the game makes it out like they are actually a threat, it doesn't feel tense or believable, because we've seen these exact enemies get simply flattened previously, eliminating the suspension of disbelief.\\n\\n\r\nCharacters in this series tend to end up with boring or inconsistant characterization. Naota has any potentially interesting gimmick in how much he is just a huge gear fan in this world, buuuut that mostly goes nowhere and he ends up being the generic main character surrounded by waifus. RyuZU has is oveprotective but it seems very selective when she is and otherwise is kind of just...there, it is hard to say she has a very defined personality, although that to an extent has a point due to her robotic origins. She does have one good quality, especially in a show full of not very likable characters: She's programmed to phrase her compliments in the most biting manner, resulting in her cutting down character's for their deserved stupidity repeatedly. \\n\\n\r\nI hold a particular dislike in my heart for Marie, though, whose character was terrible and incoherent throughout the entire piece. The show really doesn't know how to portray her. Sometimes she comes across as incredibly hot headed and arrogant, other times she is over the top depressed about her abilities. Most commonly, she seems to take whatever extreme that Naota isn't taking, in order for him to take the reasonable viewpoint and come out on top of her, which also makes stuff of the finale seem rather out of place in the series. Her super speed repairing powers seem quite random and are generally poorly animated, she generally was very badly done as a character, including a worse \"hidden identity\" than Clark Kent, which also ends up being thrown out in like 3 episodes anyway so WHAT WAS THE POINT. TELL ME YOUR SECRETS, SHOW.\\n\\n\r\nYou also get Halter, who is...generic bodyguard basically. AnchoR I can't talk much about for some spoiler purposes, but she too is quite bad, and in particular has some icky stuff where the show really doesn't seem to want to know if it wants to take a romantic rival or daughter situation with her. The results are as squicky as you might imagine.\\n\\n\r\nAnchoR is a good anchoring, hehe, point to talk about the shows AWFUL art and sound design and direction. The art is the far worse of the two: AnchoR's hair frequently looks like toothpaste on top of her head and character's outfits are frequenrly drawn in an odd and improper manner, making it look almost more like a paper doll with clothing that is a part of them and shifts awkwardly. Expressions do not always properly follow moods, often if animation is repeateded, such as Marie looking confidently annoyed at Naota in a scene where she is clearly in great distress. Animation of characters often is flimsy during talking or still shots, making characters look uncomfortable and blob-like, with machinery having uninspired designs and backgrounds being sparsely detailed. AnchoR frequently gets it the worst due to her dress and hair, making her stand out as being unrealistically poor in the crowd.\\n\\n\r\nSound design is similiarly poor, with uninspired voice acting with the exception of Halter who has a kinda cool older guy edge to him, entirely forgettable and drab in-story soundtracking and lacking sound effects for various things, although it often more skirts to forgettable than horrible in comparison to the art. I gave it a 2 simply because the OP is decent enough, especially with the clock effects in the background, and because of a handful of good mechanical noises in the finale, putting it above the true dredges of the world in that regard. \\n\\n\r\nSo, ultimately, the thought of this show should be rather obvious: It is dreadful. The plot is poorly paced, with filler slapped in at random and utterly drama breaking comedic moments hampering a script full of obvious stupidity and little tension. The art is some of the worst I've seen in a while, unless you are a huge fan of Colgate making some hot new anime. The sound design is poor and uninspired and the characters have difficult defining their personalities or otherwise are extremely inconsistant and poorly done. Battles are extremely disappointing, with action scenes largely consisting of stomps or boring fights against mooks, with no true villain fights even, eating up runtime as little more than filler. If you consider yourself a connoisseur of bad anime, then give Clockwork Planet a look, as it has plenty of material to mock with your friends. But if you want a quality anime, avoid Clockwork Planet in its entirity: You miss nothing but terrible spins on pre-existing concepts and an infuriating inability to do anything with its core concept.",
            "date": "2017-07-30T19:30:00+00:00",
            "helpful_count": 18,
            "mal_id": 254275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5765649.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/FrozenRoy",
                "username": "FrozenRoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=254275"
        },
        {
            "content": "This anime, for the lack of a better word, is definitely a disappointment thus far. Everything about it has been lacklustre in my opinion and I have to say, I've been watching this anime ever since it's been released in hopes but I'm still unsatisfied even up to episode 8 - they still jump around the plot, drag things on and cut out important bits.\r\nIt's a kind of anime that you HAVE to watch before reading the light novel or manga, or better yet, just don't watch this and read the manga/LN. \r\nIf I hadn't read the manga or the LN, then perhaps I would'verated this whole show a solid 4-5. \\n\\n\r\nAll I can say is that I'm just left really disliking this anime, after all, I have been waiting for this anime to be released since I quite liked the manga. \\n\\n\r\nStory: 4 \\n\r\nThe story's decent. It definitely has some interesting premises such as a world made of gears, this mysterious god-like person called 'Y', the meaning behind the Initial-Y series, and I'm honestly curious as to where Naoto's parents are – which, really, aren’t new brought to the table. Honestly, that's the only thing that's interesting me. \\n\\n\r\nHowever, the story is not set out quite well (I have to admit it's the same in the LN or the manga) with the animators either rushing or dragging the whole plot and cutting out some important bits from the original sources that sometimes I feel like the story is going nowhere. And to be fair, it is an anime so it requires more effort but still; I think they could handle the story a little better. \\n\\n\r\nAdditionally, the story's quite predictable turning what could’ve been something interesting as just… something ordinary and decent. There’s some good humour but too much fanservice that honestly doesn’t add to the plot.\\n\\n\r\nCompared to the first few episodes though, it became marginally better by episode 8, a solid 4.5/10. Not much improvement but eh.\\n\\n\r\nArt: 4\\n\r\nNow the art - I expected so much of the art since I really like Kuro’s and Shino’s art, and not to mention the promotional poster by Shino makes it look amazing, but the art is… average. Honestly, I really, really don’t like how Naoto’s been drawn and sometimes, the anatomy of the characters turn very strange like their eyes are too far apart or inhuman actions. \\n\\n\r\nBut, like I said; the art’s average, good but not spectacular. Not all of them look the same and they draw action scenes quite well (I suppose) and I really like the drawing of the buildings, the gears, the weapon animations and fighting sequences and the world. The lighting effects are quite… exaggerated but you can see that the animators are quite talented.\\n\\n\r\nI was also rather confused by the opening with the roses and them dramatic poses. \\n\\n\r\nSound: 6\\n\r\nI guess the sound is better. I like the songs, they’re fairly good for the soundtrack across the episodes, though I kind of don’t pay much attention to them since I get mildly distracted from the interactions of the characters, it’s fitting to the mood of each scene it plays at – it’s an aspect that I appreciate in this anime. \\n\\n\r\nI really like the fight scene music, too, since they make them sound cooler and the sound effects are very, very fitting.\\n\\n\r\nOf course, as a Soraru and Mafumafu fan, the ending song is AMAZING. I love their voices so much and the beat is just, woah. Seriously, the instrumentals along with their vocals are so pleasant to the ears! It’s an ending that I always stay to listen to. \\n\\n\r\nThe cast was also alright though I find Naoto's voice a bit annoying, but still quite good voice acting.\\n\\n\r\nCharacter: 2\\n\r\nTo be blunt, the characters sucks in this anime. They are all so bland and just… typical…\\n\\n\r\nSo, worst character first, must be Naoto. The genius guy who doesn’t seem like a genius, doesn’t even know it and ends up being too rash and always making stupid choices. Not to mention he is absolutely loud and obsessive, AND perverted. His character design is okay and would’ve been better if he was more to the quite side. His only redeeming feature is he’s not the kind to give up, but even then, that feature annoys me. Honestly, I find his character irritating and I really don’t find his relationship to RyuZu all that appealing – it seemed more like nerd-guy-who-can’t-get-a-girl-actually-gets-a-beautiful-girl trope and frankly, the fanservice only served to make me hate Naoto even more – and mostly in this anime. \\n\\n\r\nSecond worst character – which a LOT of people will hate me for – is RyuZU in my opinion. She’s the typical goudere, one who wants to please her lover and speaks harshly because people apparently find them appealing – not really. Her character irks me when she frankly puts Marie as her target of insults and the like, and her relationship with Naoto is just too much fanservice for me. \\n\\n\r\nMarie has to be the better character compared to these two despite being the whiny brat character – she’s more real, and more to the we-need-to-plan-first person, kind of like a foil to Naoto – in a way, she’s more human than Naoto. While Naoto is irritating in the way that I can’t care for him because he doesn’t care about the millions of people dying over his waifu who can be fixed unlike humans, Marie cares and she’s self-conscious about herself to the point she wants to be the best and actually concerns more about the people rather than some automaton waifu, though she is still quite unlikeable since she’s the typical tsundere princess genius trope. \\n\\n\r\nHalter and AnchoR are best characters just because they aren’t as annoying as Naoto and Halter reminds me of a Dad and AnchoR is just so cute.  \\n\\n\r\nI also feel like they missed a lot of characterisation that was included in the manga/light novel. \\n\\n\r\nEnjoyment: 4\\n\r\nIf I hadn’t read the LN or the manga, I would have given this show a good 5/10 for enjoyment, because while I rather watched only to be disappointed, it is rather enjoyable and quite laid-back. The sound is pleasant to the ears, the animation is rather nice to look at if you can get past the annoying characters and there are some characters that you can enjoy.\\n\\n\r\nOverall: 3 \\n\r\nIt’s a good 3/10 because the recent episode is fairly okay. It just cuts out too much important information but drags on unneeded ones, the characters are just annoying and very dull as a show with a rather interesting premise.\\n\\n\r\nIf you want to enjoy this anime, I highly recommend that you watch this either without reading the LN or manga, read it after or just don’t watch it and read the manga (the manga has fewer fanservice scenes than both LN or anime).\\n\\n\r\nI'll see if the future episodes will change any of my scores in the future *crosses fingers, hoping it would*",
            "date": "2017-05-27T12:27:00+00:00",
            "helpful_count": 12,
            "mal_id": 248651,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/yukimi05",
                "username": "yukimi05"
            },
            "url": "https://myanimelist.net/reviews.php?id=248651"
        },
        {
            "content": "This anime is a bit special to me; it was written by the author of No Game No Life, one of my favorite lightnovels, Yuu Kamiya-sensei. \r\nFirst off, I would like to say that the benchmarks for a 10 are:\r\nStory: Steins;Gate, Iron-Blooded Orphans\r\nArt: 5 cm per second, Violet Evergarden\r\nSound: Guilty Crown, Spice and Wolf\r\nCharacter: Kimi no na Wa, Koe no Katachi\r\nEnjoyment: Lucky Star, Ghost in the Shell\r\nOverall: Working!!\r\nIt is the story of a genius boy (Naoto) that can hear every detail inside a world made entirely out of clockwork by a man named Y 1000 years ago: Clockwork Planet. His skill is certainly useful inthis world where everything is made out of gears since he can spot problems really quickly.\\n\\n\r\nOne day, a girl automaton - human-looking androids that are wholly made of gears - falls from the sky. She has one gear malfunction, which Naoto quickly repairs. She is revealed to be RyuZU, over 1000 years old, and was built by Y himself. Thus starts the story of a genius boy and his legendary automaton, along with another genius girl, Marie Breguet, youngest Meister in history, and her butler.\\n\\n\r\nAs you can see, there's lots of geniuses in this story, which is a trademark of Kamiya's work. If you read the light novel, you also know that the playful tone gently complements the dense details very well. The story is paced a bit weird, but paced enjoyably, so it gets very good; it doesn't matter what technique they used as long as the consumer enjoys.\\n\\n\r\nThis anime makes quite a good use of the medium; it is stunning to see a world entirely made out of clockwork. The style is also what I expected: I really liked Naoto and AnchoR's designs. However, I would have liked to see a bit more details and shadows here and there. It feels like the budget was lacking a little, after spending it all on animating the countess gears. The endings and openings are much better animated than the anime. If the whole anime was animated like that, I would comfortably give a ten. Therefore, I also notched it down to a 9, because the quality was inconsistent. Although the gears are absolutely stunning and beautiful, some scenes are literally a character standing there while the background pans from left to right. I believe Kamiya-sensei's work deserves more budget than this.\\n\\n\r\nAs for the sound, I find it quite pleasant to listen to. The OP and ED aren't particularly good, but neither are they particularly bad. They sound quite generic, but the animation is something absolutely amazing to watch. The music paced well with the actions of the characters, and it flowed melodiously and didn't feel weird. It deserves an 8 because it isn't particularly touching either.\\n\\n\r\nThe characters are getting a solid 9, almost touching 10. Naoto's baby-like idiot behavior is something that not many anime exploit, and RyuZU's arrogant but loving servant attitude is pretty unique too. Breguet and AnchoR are both quite memorable; you won't mistake them for anyone else in the \"Waifu or Laifu\" game. There is quite a good character development, but still somehow lacking compared to most romantic, character-centered animes. It still gets 9 because this anime is more story and action-centered, and we have to compensate for that too.\\n\\n\r\nEnjoyment gets full marks: any anime that's interesting enough to make me stay up the whole night watching (me, who isn't a binge watcher and got tests coming) are deserving of full marks. The fanservice isn't appreciated by me (not a fan) but I didn't feel particularly uncomfortable rewatching it at school. Some moments even made me laugh. The rewatch rating is also very high; would rewatch anytime. Enjoyment is up there with Rewrite, Working!! and Lucky Star.\\n\\n\r\nOverall, it gets a 9. It would have been a 10 if only the art was a bit better. It's a really thin line, but it's probably in the 9.5 range, since I did see the amazing OP and ED, meaning the studio did have the skill to animate this properly.\\n\\n\r\nReccomend: Chobits, for an enjoyable trip to a cozy home in future Japan",
            "date": "2018-01-19T19:06:00+00:00",
            "helpful_count": 8,
            "mal_id": 269069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6890669.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iveykun",
                "username": "iveykun"
            },
            "url": "https://myanimelist.net/reviews.php?id=269069"
        },
        {
            "content": "This anime sucks. Earth is destroyed and a genius name Y recreate it with gears, the story may look like interesting but trust me, it's not. The first few episodes looks pretty interesting but i don't understand why they put fan service stuff in this anime. Well it's not like hardcore but it's very lame. You don't even laugh for the jokes, it's that bad. The story gets worst every new episodes come's out. I have dropped this anime at episode 8. \r\nStory - Horrible story, suddenly a female powerful robot falls from the sky and he considers it has his wife and after fewepisode they fight his female robot sister and win and calls it has his daughter. To accompany this three, there is one more small girl and she has one more man has a body guard. He will be pretty much hugging this female character and other will be like, have u abandoned me !!! With all this they fight bad people.... If you are into this kind of stuff, go for it. To people who wants enjoy, learn, laugh please stop reading this review and go search for an other anime because trust me, it's not worth watching.",
            "date": "2017-05-26T03:56:00+00:00",
            "helpful_count": 9,
            "mal_id": 248553,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4890795.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Swaroopch",
                "username": "Swaroopch"
            },
            "url": "https://myanimelist.net/reviews.php?id=248553"
        },
        {
            "content": "Story:\r\nThis is the anime's weakest point. It starts off okay, but the events that go on don't generally have a particularly good connection to each other and it's very predictable. There is literally no reason to anticipate that any major character will actually die or is in any danger and it's really just a show where the major characters blow stuff up and keep succeeding. There is very little world building as well despite the potential that this show has to make that interesting.\r\nCharacter:\r\nOne of the slightly better parts of the story. There is some growth in Marie Bell Briguette and there's some development withAnchoR. But other than these two the rest are kind of one dimensional. Marie also surprisingly looked a lot better in her disguise than her usual outfit, so it kind of begs the question why that isn't her usual design.\\n\\n\r\nArt:\\n\r\nIt's one of the more distinct art styles in this day and age, albeit childish-looking. The backgrounds are nice, but the characters could have used a more sophisticated design.\\n\\n\r\nSound:\\n\r\nIt has a nice-ish opening song. In general though, nothing special.\\n\\n\r\nEnjoyment:\\n\r\nNot displeasing like some worse written anime out there. Just not great.\\n\\n\r\nWho's this for?\\n\r\n-Kids\\n\r\n-People who want a simple and straight forward plot\\n\r\n-People who just want mindless action\\n\r\n-People who have a thing for lolis (AnchoR and Marie)\\n\\n\r\nWho's this not for?\\n\r\n-People who want a sophisticated plot\\n\r\n-People who want all the main characters to be decently 3 dimensional\\n\r\n-People who enjoy more sophisticated art/character designs.\\n\r\n-People who want there to be good world building",
            "date": "2017-06-23T11:10:00+00:00",
            "helpful_count": 6,
            "mal_id": 250775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6177738.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SongstressSL",
                "username": "SongstressSL"
            },
            "url": "https://myanimelist.net/reviews.php?id=250775"
        },
        {
            "content": "It's not a good sign when the most compelling scene of a new anime series occurs before the opening credits in the first episode. Clockwork Planet was pretty much all downhill from there. \r\nI recall noticing a comment on some website or other noting that this was the ultimate chuunibyou show, and I'd say that's about right. Clockwork Planet plays out as an endless variation on weird anime-centric fetishes instead of something resembling a real story. I was initially attracted to the show because I thought it might involve some kind of steampunk aesthetic, but I was quickly disabused of that potentiality. Instead, you havea ludicrous notion that the entirety of planet Earth was reconstructed with gears, cogs, and endless other mechanisms. Evidently this world also includes artificial intelligences that are also made entirely of clockwork parts. \\n\\n\r\nNow, this is not necessarily a bad premise for a series, but Clockwork Planet makes absolutely no effort to explain, justify, or even marginally expand on this initial concept. Instead, you get a lot of incredibly dull bickering between the two protagonists, and even more ridiculous interactions between them and a few clockwork-based humanoid creatures. It's barely worth expanding on this aspect of the show, but the male protagonist spends a ton of screen-time obsessing over two female clockwork entities to the point that it really becomes creepy. Obviously this is the intent, and it's acknowledged quite a few times during the 12-episode run. But why? Who cares? Not me, at any rate.\\n\\n\r\nI didn't care because, for all of its action scenes and supposedly intense narrative drive, Clockwork Planet had nowhere to go. The characters don't really develop, and really it's pretty generous to even call them characters at all. You're essentially given a set of archetypes and asked to care about their actions and choices when (a) they're really just constructs serving as mechanisms to advance the plot, and (b) they never really develop in any noticeable way. If the overall plot had been at all interesting, then I think it would be possible to forgive some lack of decent characterization, but I couldn't be bothered to care about that aspect of the show either. As far as I could tell, things happened, characters popped up when necessary to advance the rather meaningless story, and then it all ended. That's it. \\n\\n\r\nI was incredibly disappointed by this show and I would not recommend it to anyone. It's not vile, but it's pointless. I know that the goal was to create some really cool show with \"meaningful\" plot developments and genuine emotional depth, but I cannot possibly imagine how the mess that is Clockwork Planet could ever attain even the level of an average but uninspiring series. In a way, perhaps that's appropriate. Clockwork Planet, in a sense, lived up to its name. The show runs like an odd little machine ticking away, without a point or purpose. By the time its mechanism ran down at the end of episode 12, could anyone really have been bothered to wind it up again? I certainly could not be bothered.",
            "date": "2017-06-23T00:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 250727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5016597.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/delta5",
                "username": "delta5"
            },
            "url": "https://myanimelist.net/reviews.php?id=250727"
        },
        {
            "content": "Alright this is my first review but cut me some slack\r\nI watched up to the 6th episode and i gotta say this anime is crap. The characters are too 1-dimensional, the tensions is fleeting and the first villain doesn't even provide any form of pressure.\r\ntake an example from the first scene we see this \"villain\", at first he's all chill and stuff saying things like \"I can't let you do that, it's against the \"insert powerful association\" orders\" and doesn't let tsundere girl go save people. But the moment she pulls a gun on him out of anger, he suddenly squeals in fright completely ruiningthe moment. \\n\r\nNot to mention it's really rushed. (apparently the first 4 episodes went through 2 volumes)\\n\\n\r\nIt was really hyped up because it was created by the same person who wrote NGNL but honestly it doesn't live up to it's glamor.",
            "date": "2017-05-14T18:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 247683,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5365166.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/White_Jester",
                "username": "White_Jester"
            },
            "url": "https://myanimelist.net/reviews.php?id=247683"
        },
        {
            "content": "Now this is important: You should never just take someone else's opinion as the end all be all.\r\nILL KEEP IT SHORT FOR YOU:\r\nThis anime is a masterpiece in its own right. The only way i see it getting so many bad reviews is that all the people that actually bother to write these things are closed minded idiots that cant embrace the different perspectives that some anime series try to recreate like this one.\r\nClockwork planet's plot is by all means short and very open to a second season if they can bring back the same or improved interest (hooks) as the first season.\r\nWith its stupidcomedy sections thrown into random scenarios the series keeps you focused on not just the action packed fights but also at what the characters are saying.\\n\\n\r\nIf we look into the characters a bit, we will notice that they are plainly common personalities, seen time and time again in lots of anime, manga and light novel series. But when we tae this into account along with the random idea of a world like a clock, you will realise that it makes sense to keep the simplicities in the series or it becomes too difficult for people to connect and enjoy the series.\\n\\n\\n\r\nNow there are a few issues with the plot of this series, like how the problem each time ends up being too similar and the solution is almost always the same as well. Also there's the cliché that the main characters just happen to be the only people capable of fixing the problem even though the world of clockwork planet s one with many abnormalities, or you could say, dark places with who knows what lurking. \\n\\n\\n\r\nSo overall I personally think this series is possibly up there with one of the greatest in the last decade, and I would bet that lots of you will have similar but not so extreme opinions on this series.\\n\\n\r\nNick Shadows\\n\r\n(waiting for season 2)",
            "date": "2017-10-26T23:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 261811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5466755.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NickShadows",
                "username": "NickShadows"
            },
            "url": "https://myanimelist.net/reviews.php?id=261811"
        },
        {
            "content": "You know what type of anime is the absolute worst to review? The one where you can't even voice a detailed opinion about it without a horribly massive spoiler, which I won't reveal. I was incredibly close to dropping this whole thing every moment from episode 1 to 10 but stuck with it almost entirely thanks to the beautiful artwork, even though 9 of 10 contraptions are just dumb redundant clusters of gears spinning in place without the slightest credibility to their function.\r\nI flat out hated the main guy until the spoiler, then I only disliked him intensely. I thought everything was absolute moronic garbagebeyond compare until the spoiler, then I only thought it was really dumb and poorly planned. Had I stopped and dropped before the spoiler I'd have scored this anime among the worst I'd ever had the misfortune of watching, now I only think it was a waste of patience.\\n\\n\r\nI won't reveal what happens down the road, if you can endure hours of nothing but a giant middle finger raised against everything you know about physics and mechanics you deserve all the reward you can get. As usual with these logically flawed animes you're more likely to have a good time the more ignorant and unintelligent you are, this also applies to a reduced-but-still-huge degree after the \"conclusion\". Since I have a very good understanding of physics, mechanics, basic neurology and general human biology the only things that pulled the score up were fine art and good enough sound.",
            "date": "2017-10-18T12:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 261126,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=261126"
        },
        {
            "content": "TL;DR Section at the end of the review. This review may or may not contain minor spoilers.\r\nOh, Clockwork Planet... How I had such high hopes for you, and in a way, you didn't let me down at all.\r\nClockwork Planet revolves around a world made out of... gears and clockwork parts. Go figure. The earth's resources had been used up to it's fullest, so a mysterious man known as Y made the Clockwork Planet by himself. Fast forward a hundred years or so, and we have Naoto Miura, an aspiring clocksmith. Someday, a female automaton falls through his roof, and discovers that she's not functioning properly.He then uses his insanely OP talent of being able to hear how the gears move and see their locations to fix RyuZU. She ends up making Naoto her master as they move on to greater and bigger things.\\n\\n\r\nThe problem with this show is that it's insanely cheesy and so poorly done that I honestly believe Xebec was trying to make a joke of this show, in and of itself. The goofy animation, lines, and ideals spouted from Naoto made this a great show for just turning off your mind and watching on autopilot. Marie, on the other hand, is just about as annoying as you can get. With her constant \"I am regarded as a genius, yet I can't do anything!\" bullshit will frustrate just about anyone and everyone that watches this show. All the other characters are absolutely not important and are just there to wreck havoc upon the world at large. I'd just like to mention as well, Naoto should've been a female character.\\n\\n\r\nThe art and sound direction are less than mediocre. As formerly mentioned, the art/animation is just really lackluster, and the same goes for the sound. There was several really odd scenes with the animation (see last episode with the hand clap of Marie and her friend) that just felt so out of place.\\n\\n\r\nTL;DR: Clockwork Planet is only enjoyable if you're able to turn off your brain and just watch for the awfulness. If you're a super serious person who watches for amazing action scenes, insanely moving dialogue, or exponential character growth, this is not the place for you. Only watch this show if you're okay with having a good time watching something really, really underwhelming.",
            "date": "2017-06-30T20:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 251601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5078535.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/deathline",
                "username": "deathline"
            },
            "url": "https://myanimelist.net/reviews.php?id=251601"
        },
        {
            "content": "STORY: Story begins when Naoto saves a cyborg named RyuZu by activating her. RyuZu pays him back by calling him master and ordering his commands. Soon, they team up with a girl named Marie and her bodyguard Halter. The enemy = the government. They have committed purges on the cities which causes the destruction & deaths of the citizens. The story also talks about the origins of how Earth was re-created over 1000 years ago with gears by Y. He is also the creator of RyuZu. CONTAINS: A lot of backstories and conspiracies, Action-fighting scenes, Humor, romantic-comedy moments (including Loli) & weird sexual encounters.\r\nCHARACTERS:\r\nNaoto: Highschool student who has a gift of repairing robots and automaton with sound. Has a fetish for beautiful automatons. Caring, but perverted too.\\n\r\nRyuZu: Strongest weapon created by Y. Owes her life to Naoto for saving her. Her outfit reminds me of a nun. She is brutally honest and can come off as a savage (with her words and fighting skills).\\n\r\nMarie: Gifted young Engineer. Has a Doctorates Degree. Strong on the outside, but during tough situations... she is very vulnerable. Plus, she has a sweet tooth and uses desserts as her source of energy.\\n\r\nHalter: Marie's bodyguard, former soldier, has cybernetic parts. He keeps Marie in line whenever she gets out of control.\\n\\n\r\nOVERALL:\\n\r\nAlright, but I really enjoyed the battle scenes in the anime. It's really cool to see how gears work and integrated in their everyday lives. BUT, I would really like to know what was the cause of Earth's destruction prior to Y reviving it!",
            "date": "2017-06-23T06:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 250751,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=250751"
        },
        {
            "content": "Now, I'm not going to say this was a masterpiece, but after watching 11 episodes (soon to be 12 later today when it comes out on CRoll) I can tell you that this anime was a fun ride. When it first came out, I was hesitant because I wasn't sure how well they would adapt the novel. It really does a good job at squeezing out the more entertaining parts from the 3 novels it has covered into a 12 episode series. Personally, I believe that it is one of the best new anime this season. I would suggest it, but I have to warnyou, the first episode really made me and quite a few other fans nervous, as a couple scenes really didn't make the anime look promising. I would say after the first episode, it has a been a very smooth ride.",
            "date": "2017-06-22T06:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 250644,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6336492.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/appaweeb",
                "username": "appaweeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=250644"
        },
        {
            "content": "This is my opinion, If you get triggered while reading this because you don't like the anime don't read it.\r\nPersonally I thought it was a very good anime. Even though I have not written many reviews before.\r\nI think this anime is very good even though It doesn't have so many episodes. The audio in the anime was pretty good.\r\nIt actually had a decent storyline but I felt like it had much more potential. The character designs were very unique and had an outstanding design. Overall it is a very good anime.\r\nAnd I would highly recommend it for viewers.",
            "date": "2017-07-26T06:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 253836,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/20XX_Shine",
                "username": "20XX_Shine"
            },
            "url": "https://myanimelist.net/reviews.php?id=253836"
        },
        {
            "content": "It is mediocre.\r\nThe series is set in a world where Earth was destroyed, and in its place a clockwork planet was built by a mysterious individual called Wye for humanity to live on. Thousands of years later, the protagonist Naoto, a young clocksmith with unexplained superhuman hearing, has an ancient robot girl fall on him, and is the first person to fix her after 200 years. The robot girl pledges to be his slave, and joins him and a goup of elite clocksmiths to fix the damaged parts of their world and thwart terrorists and evil military conspiracies. Another character called Marie is introduced whogets Naoto into the organisation, and the two have a very interesting dynamic in which both are geniuses in their own ways, but their opposing ways of going about fixing problems makes it hard for them to get along.\\n\r\nThe series has three main problems:\\n\r\nProblem 1. The protagonists: Naoto is a weirdo who is sexually attracted to clocks and clockwork robots, and only helps Marie in the hopes of finding more clock girls due to his own perversion.\\n\r\nMarie meanwhile constantly mocks Naoto's intelligence, and even attacks him for no clear reason in the penultimate episode. She doesn't even qualify as a tsundere here, since there's no romantic implications behind their friendship, she is just an awful person.\\n\r\nThe robot girls also have nothing really unique or distinct about their personalities, and the series feels more like an attempt to sell off the writer's sexual fantasy than it does an attempt to actually deliver a quality story.\\n\r\nThere's also the robot girl Anchor who we see murder a load of soldiers in one episode, then find out in a later episode that she was programmed not to harm humans... what!?\\n\r\nProblem 2. The villains: The first episodes set up one character as being the overarching bad guy, only to be forgotten about and replaced with an old guy who spends half of his time spouting pseudo-philosophical nonsense that makes no sense and falsely accusing the protagonist of impersonating Wye... Oh, and he murders all of his own completely loyal men for no clear reason in the penultimate episode, proving that he is the worst kind of villain: the stupid villain who does evil things just to show off how evil he is even in detriment to his own plan. In short: an idiot.\\n\r\nProblem 3. The set-up: The series sets up so much regarding Naoto's inexplicable to calculate some things to several decimal places and determine complex mechanical solutions to damage, but bizarre lack of knowledge about equally complex manners. That and his exceptional hearing meant that for ages they seemed to be implying that Naoto was either a robot or Wye himself... but he wasn't, all the set-up had no pay-off and made no sense in the end, with none of Naoto's gifts being explained at all.\\n\r\nProblem 4. The finale: Speaking of unexplained, it's explained that, in this otherwise completely sci-fi series without supernatural elements, the two completely normal human protagonists are somehow able to create clock pieces with the power of their minds in order to fix the planet. How they do it is never explained, nothing that happens in the finale makes any sense, it's all just stupid.\\n\r\nAside from that it was a fun watch with decent animation, a lot of cool ideas that could really work well in other stories, some well written comedy scenes, and a nice soundtrack. 5/10",
            "date": "2018-09-25T14:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 289986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6526526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TheLegendOfDan",
                "username": "TheLegendOfDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=289986"
        }
    ],
    [
        {
            "content": "Clockwork Planet for LA is easily summed up in 6 words \"could have been sooo much better\".\r\nClockwork Planet from the genius mind of Yuu Kamiya of No Game No Life fame is about Naoto Miura voiced by Yoshino Nanjo who is obsessed with automata's and has an eerie ability to hear what's wrong with automations and when a black box containing a female automata by the name of RyuZU literally falls into his lap, his world of success and failures of a gear-like world will come under attack.\r\nYeah, sounds interesting right?.....yeah too bad it utterly fails in it's execution though.\r\nWhat does LA mean by this?,well LA will be referring to Yuu Kamiya's other work No Game No Life for this a couple times in this review but for the main protagonist Naoto, he's essentially Sora without the sense of urgency at the matter of the world collapsing at hand and is your all mighty janitor, Marie Bell Breguet voiced by Saori Oonishi is the other main protagonist of the this anime and is the one wanting to find RyuZU as it was initially hers in the first place. She is essentially your Shiro but with less tact. These two characters are essentially the win all button as they in the most slimmest of margins will win any battle they come across. Now your thinking that Sora and Shiro did the same thing what's the difference between them and Naoto and Marie?...Sora and Shiro's talents and tactics were shown to us making their journey in their Game World be investing to the audience and slight plot twists were hinted at us before finally showing to us in full force making them badass in the process allowing their journey through their games to have context and inviting to watch, Naoto and Marie's on the other hand...don't give us the context it needs and denies the sense of urgency in their plans (heck Naoto NEVER gives us even a hint that he had something in mind before showing it) and arcs just end and start up again with new villains really wanting the same thing....to destroy their world.\\n\\n\r\nDo you know what's worse?...the animation done by Xebec only makes what was supposed to be amazing and gorgeous looking to look bland and boring and it's character design for this anime done by Shino of Lance N'Masques and less said about Lance N'Masques the better only made it sooo much worse. The poor and bland animation permeates this anime all the way through from it's CGI gears abundant, janky character designs and movements and battles that does get better by the final arc (if only to make it look polished but not much else). The ONLY exception to this becomes RyuZU and AnchoR but even then it's characters designs were soo much better in it's manga state than what the anime gave us.\\n\\n\r\nLA really wanted to like this anime but ever so quickly LA just found it boring or just saw perplexing story decisions especially at the end of arcs it went through and let's not even get started on the blatantly awkward fanservice moments...like Marie's naked body in the shower during a depressing time to AnchoR calling Naoto cute when she also sees him as a father to just fanserviced costume for Marie and AnchoR easily makes the fanservice awkward most of the time and again...the animation doesn't helps it's case either.\\n\\n\r\nThere is a good anime within the crap decisions and utterly baffling execution of most of it's plot and let's just say that even the ending left it in a dour note as it just left it as \"another arc done...next\" kind of scthick and characters just not caring they took down a villain who's presences even confused LA as to why he was doing or was even here.\\n\\n\r\nLA will say that at the very least the voice acting was decent overall with Saori Oonishi giving her all in this trainwreck, LA did kinda wished that Yoshino Nanjo as Naoto could just dial it down a bit and LA really did like Ai Kakuma as RyuZU and Sayaka Senbongi as AnchoR but nonetheless from the entire voice cast was decent albeit some annoyances.\\n\\n\r\nClockwork Planet is an anime with no urgency, giving the audience nothing in return for us watching it and has god-tier protagonist who can fix anything thus even it's tension is gone, baffling and confusing plot decisions and even worse animation looking either ugly or janky. If Clockwork Planet was given to someone who knew what they were doing and changed some things to make more sense and was given to Madhouse or Kyoto Animation, then this anime would not be this forgettable but unfortunately in LA's circumstances...that's exactly what Clockwork Planet has turned into.",
            "date": "2017-06-24T03:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 250834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=250834"
        },
        {
            "content": "Note, I am a huge fan of both the LN and Manga, you can check my list. I gave the LN a 10/10 instead of a 3/10. That being said, let's jump into the show.\r\nStory 6/10:\r\nThe one thing that this adaptation didn't screw up that hard is the story. I mean, it's not written by the studio, so of course it won't be that bad. However, what turned an otherwise 10/10 storyline into a 6/10 storyline is the pacing and the important details that have been cut away. For example, the opening started with a dumb fight with no context at all, making me, assomeone who read the LN and the manga, lost in mere seconds. The motive of the antagonist of the first arc was also explained poorly that instead of reflecting the dark side of politics, it made me question how dumb the people are in this world to appoint him onto such a high position. If other studios (say White Fox or Mad House or Trigger) were the ones who did the adaptation, it can easily reach a 9 or 10.\\n\\n\\n\r\nArt 3/10:\\n\r\nWhat? Is? Wrong? With? You? The characters look nothing like the original, nor does it give the same vibe. Instead of the almost mythical designs of the automatons; or the cute, yet iconic designs of the human characters, they now all look unbearably generic. The only redeeming factor is the background art, which is the only credit I can give.\\n\\n\r\nSound 4/10:\\n\r\nAgain, the same old rock japanese anime music that I have grown out of years ago. The ending is cool, but gets annoying once it gets old.\\n\\n\r\nCharacter 1/10:\\n\r\nThis is where they screw up the hardest: the characters. In the original, no characters were as annoying as they were here. The obsession with robots from Naoto was not as exaggerated, and the author has went out of its way to make us the readers understand where his obsession came from. He also has other character traits that have not been shown at all in the show. RyuZu may still be a servent type A character, but she has shown depth from time to time. Marie has childish moments, but she also has the competence that someone who hold such a high social status has. Halter was one of the coolest character in the LN. None of these were in the show. Instead, we get a bunch of noisy idiots with one exaggerated character trait that I've seen billion times in other anime done better.\\n\\n\r\nEnjoyment 2/10:\\n\r\nIt's impossible for me to enjoy this anime, knowing how much better it could have been. If it were adapted better, even though it may not enter my top 10, it can easily reach a spot pretty close. This, on the other hand, can easily enter the top 10 worst shows I have ever watched.\\n\\n\r\nOverall: 3/10\\n\r\nThis is the definition of a missed oppurtunity, one that I am not planning to let go of. I don't like to argue with people which show is better because I believe that it is ultimately subjective. But even still I do have my favourites. I wouldn't bat an eye if someone read the original source and hated it, that's just taste difference; but if someone hated the franchise because of the anime, I would sincerely hope that they could give the manga a shot. This is also why I gave enjoyment a 2 instead of a 1, because I know that some people will see through this and read the orginal source instead.\\n",
            "date": "2018-08-04T20:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 285596,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5344319.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hiroto124",
                "username": "Hiroto124"
            },
            "url": "https://myanimelist.net/reviews.php?id=285596"
        },
        {
            "content": "Anchor-chan is so cuuuuuuuuuuuuute!\r\nCertainly the best character so far in this anime.\r\nBut for some reasons, the other characters aren't pioneered their potential, especially the Automatons, and I think the rushed story takes responsibility. Their emotions change so fast that I couldn't understand how the situation solved. Some of their quotes didn't even relate to the problem they were facing.\r\nThey also don't explain a lot of things in the light novel makes this series hard to be understood. \r\nThe sound is so interesting to hear, with gear's sound is the main. It surprised me because of complex sounds has been done so well.\r\nHowever, this series isfun to watch. Even it can't be used to be a commercial for the light novel in my opinion, I still recommend this to who love the sci-fi series.\\n\\n\\n",
            "date": "2017-11-19T00:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 263533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6677450.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/0hht0",
                "username": "0hht0"
            },
            "url": "https://myanimelist.net/reviews.php?id=263533"
        },
        {
            "content": "Clockwork Planet is the kind of show that looks promising from the outside  -- Clocks and clockwork are a motif with a lot of history of depth, perhaps because clockwork is inherently artificial, inherently deterministic, and closely tied in with the subject of Time.  And even if the show didn't really say anything brilliant about the universe or the human condition, there were other assets to using clockwork as well -- for one, it makes for an incredibly stylish motif.  Even if its art quality was, ultimately, nothing special, the intricate world of ticking gears was at least visually interesting, and astyle that while not totally new also isn't totally done to death.  And the premise of, well, an entire clockwork planet may not have made a ton of logical sense, but it was at least something that showed some creative imagination.  In short, the pitch for this show had a lot going for it, enough that even if it slipped up or fell short in some areas, it was easy to see how there might be more to carry it forward in other areas.\\n\\n\r\nUnfortunately, it fell short, slipped up, or was outright bad in almost every aspect.  Clockwork Planet is a rare breed that manages to get everything wrong; the plot is wrong, the pacing is wrong, the characters are wrong, the tone is wrong; even the visuals are merely serviceable.  I wasn't expecting true greatness, but I was expecting a lot more.  That said, it didn't offend me, and had the occasional enjoyable bit, so I decided to see it through.  And, in some ways, after the first couple episodes told me how off base my expectations had been, it's surprising that Clockwork Planet didn't turn out even worse.\\n\\n\r\nBecause it's not fair to judge Clockwork Planet by the standards of the maximum potential suggested by its pitch; it should be judged as what it is, an action show with a little light intrigue.  By those standards, Clockwork Planet still fails.  Perhaps not as tragically, but... well let's take a look.\\n\\n\r\nHow's the action?  Well, it's not really bad, but neither is it good.  For the vast majority of the show fights are very basic -- Marie and Halter shoot stuff and never miss, Dr. Robotnik's table scraps shoot back constantly and can't hit the broad side of the barn, and if she's there RyuZU goes in and reduces said enemies to scrap metal without breaking a sweat.  As the series goes on there are a couple of action scenes that don't follow the same formula, but even when things get shaken up the action is... just sort of dull, which for action is a rather dire crime.\\n\\n\r\nHow's the intrigue, then?  It really fails to please at any point.  We start with a fairly generic \"Evil military doing overblown destructive things\" plot and... it never really changes  Towards the end a few extra tropes are thrown in -- like the never-fully-explained-or-explored visionary/omnicidal terrorist.  They vaguely, sort of, hint at a deeper plot but without actually addressing it, they don't actually attain anything they reach for.\\n\\n\r\nWell, even if the action and intrigue are weak, what about the characters?  Clockwork Planet wouldn't be the first show saved from a mediocre story by great characters if that were the case, but... at the risk of a terrible pun the characters in this show are, in large part, cogs in a machine, lifeless and only serving their purpose to further the mediocre story.  Now, once the last main character gets formally introduced and added to the party the show gets a little bit better on most of these scores, but that doesn't forgive the bad impressions these devices made early.  Let's talk about our leads.\\n\\n\r\nNaoto: I'll give him this... he's not generic.  Instead, he's multiple generic characters mashed together with little regard to how well they meld.  He plays notes of airhead, screw-up, prodigy, pervert, innocent/accidental pervert, selfish kid, and hero all at once and they don't go together.  This makes his 'character' kind of hard to define.  He'll geek out over anything with gears, act a lot on love/lust (mostly directed at RyuZU), and has what is, in setting, a fairly incredible superpower.  In short, he's a wish fulfillment character who isn't sure what wish he should be fulfilling, costing him the chance at depth as he scrambles to cover the viewership bases.  He'll be shy when the plot wants him to be shy, determined when it needs him to make action happen, reticent when it needs to have him resist the action, and so on, very rarely with proper rhyme or reason.\\n\\n\r\nRyuZU: What easily should have been the most interesting character, a clockwork automaton and masterpiece of the very creator of the world, is instead possibly the most painfully generic of characters.  None of her reactions feel natural -- I don't just mean natural for a human, because she obviously isn't, I mean natural for a consistent character.  Other works have done robotic, artificial, or otherwise inhuman characters fairly well, and address where they stand on the scale between being emotionless machines and being 'normal' people.  RuyZU, on the other hand, isn't interested in exploring any of her possible depth, she just switches between the two modes she's given as the plot demands: the generic female and the generic superpowered badass.  She'll do or say whatever she needs to in order to further the plot and keep the dull dynamic between her and the similarly confused Naoto going.  While I want to judge these characters on what they do deliver, rather than on what they could have delivered but didn't, it bears mentioning that RyuZU is defined as the \"One who serves\", and while we get some blink-and-you'll-miss-it moments of that dynamic actually being of import, it's largely lost and forgotten.\\n\\n\r\nHalter: There's not much to him -- he's the generic badass \"normal\" who's known Marie long enough to be her handler/bodyguard without ever so much as batting an eye at her temper.\\n\\n\r\nMarie: The most watchable character in the show, Marie is a gifted young clock-maker with a practical outlook, short temper, and total unwillingness to compromise or surrender, at least in a graceful fashion.  She holds the dubious distinction of being the best main character in this show because she's the only one with what feels like a well-designed character with some depth.  Her traits are consistent, and unlike too many of the others they actually feel like they paint the picture of a cohesive whole.  As the show goes forward, Marie has some \"Out of Character\" moments but unlike Naoto and RyuZU being played for comedy, Marie's moments are played for drama, and do an... acceptable job of depicting a young woman who is struggling to live up to her ideal self.\\n\\n\r\nThe Other Character: One whose name I will not say for spoiler reasons (Though she is in the show's intro, so it's unclear how much of a spoiler it should be considered) this is the other passable character besides Marie in that she actually has an arc, and issues that are presented in a consistent manner that still allows the character to grow and evolve.  In any other show this would be, to an extent, a basic requirement of being a character, but in this show it's praise-worthy.\\n\\n\\n\r\nIn short, problems everywhere.  The story is dreadful, it never once hits a mark worth hitting, either determined to pick the most overripe low-hanging fruit or else insultingly fail to do even that.  The ending is pathetic, almost insulting, erasing any goodwill that the slightly better second half may have built with a climax that maybe could have worked in a smarter production that took its time to actually build meaning into what it was doing, but here has nothing going for it.  The characters, with two aversions, have less life in them than actual clockwork figures.  The action isn't godawful but it's lame, dominated by flashing lights that carry with them no stakes nor drama.  The art is OK, it's about par for the course for a \"nothing special\" action show, but this was a design that should have been so much more, a world practically begging, \"Make me incredible!  Wow the audience with my depth and intricacy!\".  The best thing I can say is that the opening and ending themes are decent -- the opening is a little bit catchy and what visuals it doesn't take directly from the episodes do have the sort of beauty that I wish had made it elsewhere in the production, while the ending is distinctive and made good use of ticking clockwork (An element that I felt, in a personal and minor quibble, could have been incorporated better into the soundtrack as a whole).  But even then the sound in the show itself was nothing special.\\n\\n\r\nSo, my final thoughts on Clockwork Planet?  It's disappointing.  I've come away from this show with nothing, since it determined to squander its running time providing no meat whatsoever to justify its existence or the time I spent watching it.  It was never truly 'bad', I will say.  Except for the ending 'twist' there weren't any points where I felt insulted, disgusted, ashamed, or actually angry at what I was watching for having some critical failure of quality, so if you really want to watch it after hearing all this I guess it's harmless enough.  But in some ways, that's almost (Almost!) a worse crime than actually being terrible.  A truly terrible show would have made me feel something.  True, that something would have been unpleasant, but it would have been a feeling\\n\\n\r\nArt: 6\\n\r\nSound: 6\\n\r\nCharacter: 3\\n\r\nStory: 2\\n\r\nEnjoyment: 5\\n\r\nOverall: 4",
            "date": "2017-08-31T10:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 256610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069462.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/TevishSzat",
                "username": "TevishSzat"
            },
            "url": "https://myanimelist.net/reviews.php?id=256610"
        },
        {
            "content": "Overall, I think this series was quite a train wreck. When I was first watching the series, I thought that the idea of a planet made of gears would be a super interesting concept, and that our MC would become super OP, much like the MCs of NGNL; however, at the end of the series, I felt like the MC was quite useless compared to his female counterpart. After finishing the series, I can say that, although it was a train wreck, it had enough momentum to keep me thoroughly entertained and I highly recommend watching the actual show. \r\nStory (7/10)\r\nThe story seemed a bitrandom. A bunch of nonsense stopped the MCs multiple times throughout the arcs which all seemed very... meh.  Although the plot of both of the arcs were not anything revolutionary, they had enough randomness to make the show unpredictable. In fact, some of the main details of the story and in the climax of the show left me thinking, \"Wait, WTF?\" There were many parts that were confusing, however, if you just go with the flow and watch this series with an open mind, it's not too hard to enjoy it.\\n\r\nThroughout the series, there were many comedic moments. I felt that these were an excellent idea, as the MCs look like kids. The comedy breaks the heavy, harsh atmosphere and truly makes the series enjoyable to watch.\\n\\n\r\nArt (7/10)\\n\r\nThe art is nothing revolutionary. It isn't new, nor is it old. The animation is smooth but not as smooth as some of the newer shows that are coming out. It was completely \"normal\" for me. Some of the things did have interesting design concepts but overall, the art was nothing outstanding.\\n\\n\r\nSound (10/10)\\n\r\nI loved this soundtrack. It truly set the tone of the entire anime. Some parts of it, without the music, would have been a lot more gloomy. The music keeps everything up beat and hopeful. The music was truly on point.\\n\\n\r\nCharacters (8/10)\\n\r\nThe characters in this anime are very human-like. They have different phases and act differently. The MC doesn't have a strict pattern that he follows, and he has a whole swing of emotions that are clearly demonstrated. All of the characters have that wide swing of emotion, and I felt that that the characters grew on me. Although they were very humanlike, some of the characters (not gonna name which ones) had certain times during the series where they completely changed into new characters. If these bursts of knowledge and these changes were explained by the series, I would have no doubt given a 10/10.\\n\\n\r\nEnjoyment (9/10)\\n\r\nI binged watched this series. I am a manga/LN reader, and for any of you, like me, get into manga, it's very hard to get back into anime. Manga is so fast and allows you to get into it more easily, in my opinion. However, this anime kept me interested and entertained enough to binge it. Although there were some slow parts that I trudged through, it was an overall fun adventure that kept me watching it until it's completion.\\n\\n\r\nOverall (8/10)\\n\r\nWith plot holes upon plot holes, I cannot give this series anything more than an 8. Although I loved the characters and music, the story is what I look for in a series. There were wayyy (yes with three ys) too many plot holes and times where I just was like, \"wait is nobody gonna question what just happened?\" to give it a higher score.\\n",
            "date": "2017-08-16T13:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 255610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tualu",
                "username": "Tualu"
            },
            "url": "https://myanimelist.net/reviews.php?id=255610"
        },
        {
            "content": "The concept had promise. Then reality came along. The first couple of episodes jumped from dialogue right out of a Hentai to Ecchi and back again. For a while it looked like it was going to be loli Ecchi, then the director changed his mind. Then went back, then tossed in the towel and tossed in some of the worst drawn automatons to pollute the airwaves.\r\nThen there's the gears. 6 billion to make one loli robot. Need to make gears?Wear a suit and dance naked in VR to a golden flower and create them from nothing. Seriously. WTF.\r\nIt's just so totally screwy that all enjoymentgoes out the window.  There's literally nothing redeeming about this anime.",
            "date": "2017-07-04T00:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 251901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4902734.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rickcir",
                "username": "Rickcir"
            },
            "url": "https://myanimelist.net/reviews.php?id=251901"
        },
        {
            "content": "Real Score:5.5\\10\r\nClockWork Planet, an adaptation of the Light Novel written by  Kamiya Yuu, you might know him from the No Game No Life franchise. It has a wonderful setting, an interesting premise and a good overall design, but nothing more. The entire project falls flat and becomes generic, stale and not enjoyable at all at times. I don't like putting low scores, in fact i have given very few scores under 6, but all of the wasted opportunity and dull moments forced me to do it\r\nStory 4\r\nThe Story, if it exists, is bad, really bad. The pacing is horrible and the 2 major storyarcs fell rushed and dull. The \"Main\" Villain of the story is your typical generic and boring villain and i'm not joking if i say you can predict all of his lines even before he says them. The story itself has a really interesting premise, with a good world building( literally) and an amusing mistery about the shadowly figure of Y and his dools, Needless to say, this is all thrown out of the window pretty quickly, and the story starts in Medias Res, which is an automatic sin. The 2 Major story arcs are very weak from a tecnical and emotional standpoint, they start really slow and have a really fast and rushed climax, with lots of useless exposition and dumb character moments. But the 2 biggest problems lie in the tone of the Story-telling, at least that little of story telling present in the show, because the show doesn't even care about its story, it concentrates around frivolous moments and \\n\r\nit goes around unnecessary turns without ever coming to the point; the tone is never explained or showed, you don't know if you're supposed to take what's shown seriously or to laugh, it doesn't even care about this. The second biggest problem is the plot itself, it's predictable, extended too much in certain moments, and boring:you're supposed to feel something during the main parts of the story, but the execution is so poor that the only thing you actually fell is indifference, which is a common emotion throughout the entire show\\n\\n\r\nCharacters 5\\n\r\nI'll start on the positive notes: RyuZU is awesome, the best character hands down, from the witty and diabolical dialogue, to the literally verbal assaults that she does against some of the other characters, and her action scenes are the best, too bad that in the second part of the story she kind of disappears, she was my only joy. The others are dull, uninteresting and, to be honest, dumb: Naoto and Marie Bell Breguet are weak leads, they have no development whatsoever: Naoto begins as a pussy and weak character, ends the same way, while Marie Bell begins  well, she becomes a crybaby pretty quickly and actually gets worse as the series progresses, she loses her personality, has unnecessary conflicts that lead nowhere. The side characters are forgettable and clichéd, they offer nothing to the story and are just there for the useless banter and for the forced humour, which is the biggest problem here: The humour is based about Fan Service and an horribile running gag, that of the Doll \"Family\", one time i laugh, the second time too, the third , the fourth and fifth time too, maybe, but from the sixth time onwards you present me with the same exact joke and you dedicate an entire episode to some of the most forced humour i've seen in a while, that tickles me and stops me from enjoying your show\\n\\n\r\nSound 7\\n\r\nThe music is good, thumbs up for FripSide and After the Rain for doing a really good work with the soundtrack, the opening and the ending are really good songs, and the ending has some really cool visuals. On the other hand, the opening is a good song, but the visuals are horrible, anyone who worked on this should think about it more and work harder, because this is one of the worst openings, in terms of visuals, i've ever seen, it's even off-sync at times. The overall soundtrack of the show is quite solid, it blossoms in the action scenes, but nothing too remarkable. Quick tip:Listen to the ending, is really cool\\n\\n\r\nAnimation and Direction 6\\n\r\nXebec Studios has done a really solid job with the animation, with polished faces and movements, some of the frames look really good, but the lack of detail in the character's models and polishness is rather disturbing, the feel generic and bland(almost like the characters themselves, quite ironic), some of the designs are kind of lackluster, especially when you think about the surprisingly good use of CGI and the cool design of the world. Nothing special about the direction, not too bad but not too good\\n\\n\r\nEnjoyment 5.75\\n\r\nI started to enjoy myself at the beginning, the jokes were nice, the characters looked promising, RyuZU was awesome and i didn't know what the plot has in store for me. However, in the end, all my aspectations went to hell, the jokes started to get old, forced and unfunny, the characters never really had the growth that i expected and, because of all of this, at the big climax, i was indifferent, i din't simply care, the show never put effort into making me care: one good characters doesn't save the others, and a derailed, boring and uninteresing plot just made my enjoyment go down, a lot\\n\r\nI enjoyed RyuZU(Of course) and, at the start, the jokes were pretty funny, and i really liked the environment and the idea of Planet made entirely with Clock Gears\\n\\n\r\nThis was ClockWork Planet, a slight above average show, with forced humour, uninteresting characters, an horrible villain and a boring plot. The animation and the soundtrack are good, but alone they can't save the show. I believe if they reduced the humour, and focused more on the villain and actually going forward going with the plot, i would have been involved and invested right until the end. But this way is not a good one, and it has almost destroyed every excitement that i might have had for a possible second season, which this show sets up very poorly.Thanks for reading, May our Sweet and Merciful Madoka be with all of you, and embrace her wisdom while being accompanied by our beautiful angel, from the Initial Y-Doll Series, RyuZU, who will punish every heathen that goes against our Lady",
            "date": "2017-06-27T07:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 251210,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6308811.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AwesomeAlfie27",
                "username": "AwesomeAlfie27"
            },
            "url": "https://myanimelist.net/reviews.php?id=251210"
        },
        {
            "content": "This review contains some spoilers:\r\nLiterally the only redeeming factors of this show were the character Halter and the fact that I had the best time drinking and making fun of this show (the only reasons this has a 2 and not a 1.) The story was a convoluted mess that was only about a quarter explained. I had the only the vaguest idea of what was happening. The villain was given no explanation to his motives and while the two main characters meet him, it's glossed over for at least 2 episodes (??!!!???). And the two Automatons don't use their full power in any meaningfulway - RyuZU doesn't use her imaginary gear and AnchoR doesn't use her kickass guns or her ability to send things into the frickin shadow realm when facing the big bad. Those powers appear once or twice and are never brought when it would be useful because their Master doesn't want them to do what they're programmed to do. It's also never explained just how Naoto saves the world; he and Marie just do cuz they're great and they fixed the world in their Pacific Rim: Clockwork Edition rigs while playing celestial DDR.\\n\\n\r\nThe characters were all tropes stapled onto horrible designs (save RyuZU, that character design deserved a better show) and all came off as mary sues who were geniuses who could do anything. The soundtrack wasn't cohesive and flipped from dramatic to comedic abruptly. The art was inconsistent and felt straight out of a 2002 anime. They faces changed frame to frame in VERY noticeable ways and the CGI stuck out like the sorest of thumbs.\\n\\n\r\nOnly watch this show if you have nothing better to do and enjoy wasting 4 to 6 hours of your time.",
            "date": "2017-06-24T21:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 250944,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3881239.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/bexxter",
                "username": "bexxter"
            },
            "url": "https://myanimelist.net/reviews.php?id=250944"
        },
        {
            "content": "Having finally finished \"Clockwork Planet\" I can finally reach a conclusion. Overall this does have a nice number of things going for it. Some good background music, an interesting world, and some great character back and forths....\r\nHowever execution is key and at numerous times throughout the series events feel so rushed and characters seem to be arbitrarily stupified. \r\nThe main problem.over everything else is certainly in the character designs. Everyone looks 7 or 8 yo. Which really intensifies the awkwardness of some of the scenes dialogue or visuals. I can honestly imagine Sora from No Game No Life saying certain lines from the shows maincharacter and them working. But on account of a child saying them they just seem shoved in his mouth rather than part of his character. \\n\\n\r\nIf these characters had been aged properly I can guarantee that everything else remaining equal this show would be succeeded among a larger audience. As it stands presently... idk go listen to the ost on YouTube.\\n\\n\r\nI can't give it a recommendation for anyone considering it. This is average for the most part and it's character designs only emphasize that. All in all I give it a 5/10",
            "date": "2018-03-19T02:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 274269,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2888359.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/shadow9x20",
                "username": "shadow9x20"
            },
            "url": "https://myanimelist.net/reviews.php?id=274269"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nClockwork Planet features and stars a couple of automata, robots who are more human than machine (on the outside at least).\r\nLast year, a video game titled Nier:Automata stayed true to its name and did the same. I quickly fell in love with the somewhat niche project: 2B, the phenomenal OST, the amazing (true) ending. Not only was it my favorite game from 2017 but also it earned a spot within my all-time-best list. Alongside the likes of Banjo-Kazooie, Super Mario 64, Donkey Kong Country 2: Diddy’s Kong Quest, Dark Souls, The Last of Us, andmany others.\\n\\n\r\nIn comparison, Clockwork Planet will in no way be earning a similar treatment.\\n\\n\r\nSTORY\\n\\n\r\n1000 years after the Earth’s demise, it finds new life within Clockwork Planet. From the tall buildings to the layered ground, the world fills itself with almost nothing else but gears upon gears. Within this world lives Naoto, an aspiring clocksmith. One day, a coffin falls from the sky. A coffin that contains RyuZU, the “One Who Follows.” He fixes her broken mechanical innards, she swears an oath of loyalty to him, and the two, alongside Marie and Halter, move as one unit to save this planet from whatever evil may roam.\\n\\n\r\nRather than telling one complete tale, this season roughly splits itself up into three distinct arcs: the Kyoto Grid Arc, the AnchoR Arc, and the Yatsukahagi Arc. A relatively common approach. Perhaps not as common, though, is the brokenness of this entire product.\\n\\n\r\nThe Kyoto Grid Arc already starts to unscrew the bolts keeping the show together. While these first four episodes serve mostly as the introduction – bringing the group together, establishing the setting, etc. – a lot of the content fails to deliver. The military-political subplot does not tie back enough to Marie and her standing since the audience hasn’t learned much about her at this point. The opposing robots do not make for interesting enemies and thus hurt the power of the action sequences. The anime doesn’t do the best job at differentiating this sci-fi world from any other run-of-the-mill city.\\n\\n\r\nIn episode three, RyuZU’s head-nodding confession to Naoto makes for a fun little scene, demonstrating that the anime has something worthwhile to share. When the AnchoR Arc begins a couple of episodes later, however, concerning smoke and whirring noises expel from this product as it breaks down further.\\n\\n\r\nBreakage comes from different sources this time around. For example, in its attempts to provide a better backing to the upcoming plot, it tries to explain where the superweapon came from. It’s given as an unsightly exposition dump, though. The show also includes this crazy area called the “Deep Underground.” As Halter describes it, basically outer space if it existed, well, underground. A person cannot survive down there, and it seems like a neat place for the anime to explore if not a relevant plot point altogether.\\n\\n\r\nBut no on both fronts. Naoto just so happens to find a safe spot down there for convenience sake, and it is never revisited, leaving it as a tangential piece of the narrative. Oh, he and RyuZU also just-so-happen to meet some random old guy who turns out to be the final villain of the season. Because why not?\\n\\n\r\nTo the show’s half-credit, it does contain small throughputs that do tie back to earlier moments in the season, providing some semblance of writing coherency. Remember that subplot from the first arc? Marie puts those evil people within the government sphere on blast to out their corruption. A sly move for sure, but a move that unexpectedly acts as the catalyst to escalate known tensions. (Info lost within that exposition dump.)\\n\\n\r\nMarie also mentions very briefly an old friend of hers named Houko in this arc who later appears in the last arc. Something similar goes for the message that they tailed. They find the obliterated body of the cyborg who sent it, and he later tells them it was his doing shortly before reincarnating as a female.\\n\\n\r\nBut these throughputs are too loose in their construction, for they are information and connections that do not matter in the grand scheme of things. Marie’s accidental actions do not lead to any thematic discussion on the political struggles and their adverse effect on the people. Houko does not play a significant role in the events that follow her arrival. It doesn’t matter who sent that radio message because it doesn’t affect the plot whatsoever.\\n\\n\r\nHowever, once again, Clockwork Planet gets at something when RyuZU brings Marie along for her duel with AnchoR as an expenditure of sorts (unbeknownst to the young girl, of course). Fun, believable writing that, for a brief moment, may fix this show.\\n\\n\r\nThe Yatsukahagi Arc will have none of that, strolling in to demolish what’s left. The conflict at this point centers on the massive superweapon and how the group will save the country. In doing so, too many strange story beats occur. RyuZU and AnchoR don’t go all-out despite their bend-the-laws-of-physics abilities out of a misplaced fear of them overexerting themselves (which AnchoR does anyway). The whole giant space Tall Wand debacle comes and goes without much worry. The magical, poorly explained gear-making event to mend the Pillar of Heaven boggles the mind in its asinine nature.\\n\\n\r\nThree arcs. Three chances. Three misses. In short, this narrative is like using a feather to jam a nail into a dense piece of wood – it just doesn’t work.\\n\\n\r\nART & ANIMATION\\n\\n\r\nClockwork Planet tries to make things work instead with its visuals.\\n\\n\r\nRyuZU, Marie, and Naoto do so with their designs. Their somewhat dated looks hearken back to a now older style, acting not as an issue but rather as a source of intrigue. Furthermore, their details in general give them some clout. RyuZU especially. A nun-and-maid combo outfit. Her “impeccable and perfect body” (as Naoto puts it in episode five). Extra accessories and patterns that adorn her clothes. Each part highlight her devoutness, beauty, and intricacy (respectively), arguing for said clout.\\n\\n\r\nAlso of note are some of the different shots within the anime. It mostly refrains from any grand detail in its background artistry, but Clockwork Planet can have flashes of neatness. Whether it’s a top-down view of the gear-filled country or a psychedelic interpretation of Naoto’s incredible hearing ability, the audience is treated sparingly to a couple of cool shots.\\n\\n\r\nUnfortunately, that intrigue and those flashes cannot hide the anime’s otherwise underwhelming presentation. It can look far too rough at times when designs do not maintain correct looks either through squashing or from improper details. Outright mishaps are rare (e.g., the white of Halter’s eyeball is colored incorrectly at one point in episode two), but the overreliance on speedy backgrounds, the barely serviceable cinematography, and the boring maneuvers for its action sequences continually hamper its visual integrity.\\n\\n\r\nWorse still, the actual animation is far too stilted for much of the show’s run. The anime gets around the poor movement with gun battles, swift blade attacks, and the occasional comedic display (e.g., Marie opening and closing her hands in episode five to mimic choking someone). But mouths during conversations, their walk cycles, turning, and the general actions they take do not amount to much. Not that the animation is choppy or unacceptable; it simply doesn’t aim to appeal.\\n\\n\r\nWorst of all, the opening track rips over half of its visuals from the events of the anime itself. An every-single-episode indication that the anime refused to try harder than it otherwise could have. Combined with all the other problems, the art and animation simply don’t have enough going for them in such a visual-driven medium.\\n\\n\r\nCHARACTERS\\n\\n\r\nAfter the story breaks apart and the visuals barely work as a Band-Aid, Clockwork Planet’s cast arrives to try and rectify the situation with tools of their own. They tinker and toil, but their efforts are in vain.\\n\\n\r\nIt starts with RyuZU. Arguably the best part of the entire anime, RyuZU instantly improves the show with her progenitor status (being a creation of Y, the creator of their world) and, of course, her deadpan insults (which strike with truth and hilarity). Her ultra-time-slowing move gives her a cool edge over the enemy, too.\\n\\n\r\nWhile she makes fun of Marie and the others, part of her character focuses on not hating humanity so much. Or at least, coming to the conclusion that they have more brains than those of a common flea. She takes that minute step thanks to one person: Naoto. He proves to her with his aural capabilities that people nowadays are not just a bunch of buffoons. That they are indeed capable of some extraordinary things.\\n\\n\r\nHowever, Naoto doesn’t just give her a reason to stop the hate. He also gives her a sincere relationship. While the pairing of a teenage boy and a thousand-year-old killer robot is admittedly an odd pairing, Naoto’s joy and persistence at having a thoughtful connection with RyuZU beyond the master-servant roles they take up puts her out of her comfort zone. Thus, he elicits emotions from her that she otherwise would have never experienced.\\n\\n\r\nDespite RyuZU’s part in Clockwork Planet, the anime literally and figuratively puts her out of commission come the second half of the season. An electromagnetic pulse wave overheats her system, and she oddly receives less focus even when she revives, leaving her presence diminished and her impact forgettable.\\n\\n\r\nThe trade-off is spending more time on AnchoR. Arriving at about that halfway point, she counts as RyuZU’s younger “sister” and looks at Naoto and Marie as her “father” and “mother” respectively. Having always been told what to do and only just recently gaining her freedom, she almost always asks for permission first before doing something. That is, until she “disobeys” Naoto of her own free will and chooses to wipe out the superweapon come the end of the season.\\n\\n\r\nLike RyuZU, though, AnchoR’s most important involvement comes from a relationship she holds with another character: Marie. Despite AnchoR’s kindhearted intentions, Marie doesn’t like AnchoR and actively distances herself from the little girl as much as possible. So, from their interactions, AnchoR eases Marie’s at-times rough personality, and Marie humanizes the “One Who Annihilates” by giving her the love and the support she has never known.\\n\\n\r\nMarie isn’t an automata, but she is a known genius of the Meisterguild and of the Breguet family. At least, before she destroys her guild crest and fakes her own death. She describes herself as someone who never views anything as impossible, and she stores insane amounts of knowledge in her head while simultaneously fixing mechanical issues with utmost precision.\\n\\n\r\nIn comparison, Naoto, the main protagonist of Clockwork Planet, isn’t a genius but instead a miracle. His hearing compensates for the fact that he does not have strong tinkering skills, giving him an advantage and an out in many a situation. He also has a keen affinity for the small (perverted) pleasures in life, and he isn’t afraid to be honest with people.\\n\\n\r\nBoth Marie and Naoto have their own moments throughout the season. Most of episode six challenges Marie’s personal mantra, and Naoto regularly lends his talent such as when he pinpoints the few gears among trillions that need a repair or determines where the next attack will manifest.\\n\\n\r\nOnce again, though, it’s the relationship between the two that takes precedence. Marie often cannot fathom why this “idiot” makes so much sense all the time, and Naoto encourages her despite the troubles they face. Most importantly, they mirror each other about the other. She’s mad at herself for relying on Naoto the miracle; he’s mad at himself for the envy he feels towards Marie the genius. They don’t hate each other. Rather, they both simply wish that they could do and be more than what they currently are.\\n\\n\r\nA cool idea, but it’s only sprinkled throughout the season rather than honed in on as a major talking point between the characters. Plus, their esoteric, paradoxical exchange in episode eleven, where they seemingly teach the other (to some extent) their signature traits, isn’t the most sound writing on the (clockwork) planet.\\n\\n\r\nAs for the other cast members involved, they either do not contribute much or lack basic characterization and writing to make them worthwhile. Take Halter. He’s no doubt a cool, chill dude to have around, balancing out the craziness of the others. Yet he unfortunately doesn’t receive a lot of attention outside of a weird aside where Marie pretends to call him “papa.”\\n\\n\r\nVermouth, the man-turned-woman cyborg, adds in some comedic relief when nearly every line of her dialogue takes the form of a sexual innuendo. However, her late inclusion, her lacking relationships, and her failure to hold a meaningful role within the crew simply makes her into an unnecessary distraction.\\n\\n\r\nGannai, the main villain of the Yatsukahagi Arc, is little more than a crotchety old man who has beef with Y on a philosophical basis. He barely has a handful of lines during his brief stint let alone a tangible foundation to his very character.\\n\\n\r\nFrom RyuZU to AnchoR, Naoto to Marie, and everyone in-between, the characters unfortunately cannot fix what is already broken. Some of their relationships had a chance, but, they do not instill enough torque to get the gears going.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nClockwork Planet finds no respite from its broken state when it comes to a lot of the music played throughout the season.\\n\\n\r\nThe titular opening track, “Clockwork Planet,” stalls the show from the get-go. The faint noise of a hand-turned device and some techno sounds can be heard in the background for a couple of fitting inclusions. However, the flat vocals, the tired beat, the odd loftiness, and the lacking instrumentation turn the OP into more of a chore to listen to all the way through rather than a welcome addition to the anime.\\n\\n\r\nThe ending track, “Anti Clockwise,” redeems where its brethren reduced. More relevant noises appear in the form of ticking time, but the ED trades in the techno and the tired for the dynamic and the diverse. Frantic piano keys give way to varied vocals, guitar segments, a bit of autotune, and changing tempos that power up the entire piece. While not a playlist-worthy track, it at least keeps the music from having nothing to show for itself.\\n\\n\r\nBecause, sandwiched between the detestable and the acceptable, the original soundtrack slowly fades away from the minds of the audience. Hand drums, acoustic guitar, and synthesizer accompany mystery vibes, sad moments, and fast-paced action sequences (respectively), yet their impact is low and their supportive nature only exists insofar as they give the listener something to distract them from the rest of the anime. One of the tracks does have a cool saxophone lead-in. But, when it proceeds to play alien spaceships and daintier instruments afterwards, roughness messes up that smoothness.\\n\\n\r\nOn top of the fact that there are no noteworthy voice-acting performances, the music and sound work within Clockwork Planet is one of the weakest pieces to this malfunctioning project.\\n\\n\r\nENJOYMENT\\n\\n\r\nOnly two people in the anime save it from being an absolute bore: RyuZU and Konrad.\\n\\n\r\nRyuZU for the obvious reasons. She’s a beauty, but it’s her words against Naoto and the others that got a chuckle out of me every time. Here are a few of my favorites from the show.\\n\\n\r\n“Is there some kind of problem? Does my perfection and overwhelming capabilities damage your mitochondrion-level pride?” “Master Naoto, your face is already dull at best.” “I suspect the brains of the army’s officers have been seriously damaged. I mean, they fell for a plan you came up with, Miss Marie.” “Even the Gods are envious of the treasure that is my lap. It is the definition of unrivaled luxury.” “Please, use every bit of your insufficient brain. Excuse me.”\\n\\n\r\nI also liked the romance bits between her and Naoto. Her pouts and jokes, the almost-kissed-twice scene, her engagement moment. Without RyuZU, the anime would have been nigh intolerable for sure.\\n\\n\r\nNow Konrad, he knows what’s up. He goes from a leading scientist to a strip-club proprietor. Taking in and building up sexy robot women who throw themselves at the casual beanie-and-t-shirt wearing gentleman every chance they get. All while doing his part to help save the world during his downtime. A man truly worthy of respect.\\n\\n\r\nAs for everyone and everything else, I cannot say I was a big fan. I wish Halter did more throughout the season. Naoto, Marie, and AnchoR have their quirks, but I don’t find them pronounced enough. The shootouts and the occasional super abilities didn’t keep my attention. The drama didn’t do anything for me. No interesting themes pop up that I could either investigate or admire. Choosing to have AnchoR register with Naoto instead of Marie seems like a huge misstep on a character and narrative level in my eyes.\\n\\n\r\nThis anime isn’t the worst that I’ve ever seen, but it puts itself pretty far down there.\\n\\n\r\nClockwork Planet needs more repairs than a destroyed timepiece. The story is a mess. The visuals lack value. The characters come up short. The music is bland. The entertainment available amounts to maybe a couple of elements. Altogether, an automatic fall to very nier the bottom of the list.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, a weak foundation, loose plot points, and questionable writing choices keep the narrative from highlighting the extremely sparse moments that have some grain of worth\\n\\n\r\nArt & Animation: Bad, while the individual designs and a few shots have some intrigue to them, the stilted animation, the low input of its cinematography, and the rough artistry in general lead to an underwhelming visual presentation\\n\\n\r\nCharacters: Bad, RyuZU, AnchoR, Naoto, and Marie have potential in their relationships and individual traits, but their efficacy ranges all over the place, and the side cast in general do not contribute much, if anything at all\\n\\n\r\nMusic & Sound: Bad, the OP and the OST crash hard, and the VA performances are par for the course, but at least the ED provides a track worth listening to\\n\\n\r\nEnjoyment: Bad, RyuZU and Konrad do what they can to keep the boredom at bay\\n\\n\r\nFinal Score: 2/10",
            "date": "2018-03-17T19:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 274135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=274135"
        },
        {
            "content": "Tick-tock goes the clock, forever...\nStory (7/10) - The world has ended, and a new one was built in its place, literally. When a failure clock smith high school student 'discovers' an important automaton, his biggest dream has come true. But everything has a price, which he soon finds out when he gets roped into stopping a calamity-potential conspiracy.   \nArt (7/10) - The uniqueness of Clockwork Planet is a given, and Xebec did a very good job in bringing it to life. \nSound (6/10) - The Intro and Outro weren't bad, just not the best either.\nCharacter (6/10) - A high school teen with anobsession with Gears and his faithful servant meet a master clock smith and her bodyguard, what could happen?\\n\\n\nEnjoyment (6/10) - This was a nice little show.\\n\\n\nOverall (6.4/10) - I've been planning to watch this anime for a while, and I when I finally got around to it, I was a little disappointed. Were my expectations for this show too high? Maybe. Was this show overhyped? Maybe. All in all, Clockwork Planet has an interesting take on it, and after watching, I've very curious to see how it continues. Do I want to read the Light Novel source-material? Yes, but when?\\n\\n\nOnly time will tell...",
            "date": "2018-01-12T16:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 268336,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=268336"
        },
        {
            "content": "Short one: I don't like this anime.\r\nLong one:\r\nSTORY:\r\nThere's only one thing that really matter. THE PLOT. So i will watch something if:\r\nA) Story description is charming\r\nB) Story is endearing\r\nC) Plot Is well articulated\r\nSo if i read the description of something and i could maybe like an anime i will try watching it, in this case Clocwork Planet its a steampunk-like anime and i love steam punk so i gave it a try but what is this story? \r\nA cyborg fell into protagonist house and SHE (obviously) decided to become his....slave!? WTH!? \r\nSo, we can think, \"Umh... the premises are bad but maybe it will improvelater? \" Nah. \\n\\n\r\nBasically this guy has a super hearing power and he  uses this power to do... well...mhmmm... I DON'T KNOW! \\n\r\nWhats the point of this anime? Whats the point in helping maria?  to do what? and why? \\n\\n\r\nHis only reason is TO FIND THE CYBORG'S SISTER NOT BECAUSE HE KNOWS HER, OR SOMETHING NOBLE, BUT JUST BECAUSE HE IS A CYBORG GEEK AND JUST WANT TO FIND HER FOR NO REAL NEED! \\n\\n\r\nSo he basically put himself in danger just to find a very high-tech and pointless smartphone(as example) without any need to do it. Meanwhile he helps maria (only name i remember) fighting corruption(!?) WTH? \\n\\n\r\nARTS AND SOUND: \\n\r\nOnly things good here. Steampunk-like anime with good ambience, backgrounds and environments. I didn't really heard the musics but they do their job well... Nothing else to say\\n\\n\r\nCHARACTERS:\\n\r\nPreposterous. \\n\r\nProtagonist is a geek, nothing bad about it but HE FELL IN LOVE WITH HIS SLAVE CYBORG IN JUST AN EPISODE. Falling in love with a thing is stupid from the start, but in just an episode? And the cyborg fell in love TOO... A CYBORG... Well maybe she was built so well that she has emotions and bla bla... yes its this case but SHE CAN'T HAVE SEXUAL DESIRE, SHE CAN'T DO SEX SHE, CAN'T REPRODUCE, why? Because in the first episode the main character FIXED HER OPENING HER CHEST. SHE IS BASICALLY A LIVING CLOCK ONLY MADE BY GEARS... How sex is supposed to work here? So i can only say WTF!? The problem is, putting asides anatomical problems, if the story were a good one i could have just ignored those problems but the story is crap. This anime has too many holes not only in the plot but in the characterization. Protagonist is stupid as fuck, in the first episode HE SAID HE COULDN'T EVEN FIX A SIMPLE CLOCK BUT THEN HE FIXES A CYBORG AND THEN HELPED DOING OTHER THINGS. So is he smart or not? Is he a good engineer or not? Answer is HE LEARNED ALL HE NEEDED IN THE FIRST EPISODE WHILE SLEEPING. I can't justify in other ways...\\n\\n\r\nObviously other Characters are lolis, girls with a gentle heart but cold manners or snorty ones... And this anime is full of SEXUAL REFERENCES, they don't make you see anything, except standard japanese stuff, but they are really explicit in the talking manners ... \\n\\n\r\nThere is no introspection in this anime, characters doesn't have consistency, coherence etc... Most important they are exactly as other characters already seen in other animes, nothing more nothing less... \\n\\n\\n\r\nBASICALLY THIS ANIME HAS \\n\r\nA) NO PLOT\\n\r\nB) NO STORY\\n\r\nC) STUPID CHARACTERS\\n\r\nD) STUPID SKETCHES\\n\r\nE) BORING AS HELL\\n\\n\\n\\n",
            "date": "2017-10-08T05:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 260121,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5893176.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PilgrimJagger",
                "username": "PilgrimJagger"
            },
            "url": "https://myanimelist.net/reviews.php?id=260121"
        },
        {
            "content": "If i were to describe this show in one word it would be \"Melodramatic\".\r\nThe show had so much potential to shock and awe us with a unique universe based on the concept of an artificial planet functioning via clockwork gears. But the show doesn't really go anywhere with it, the gears serving more as both just a quirky aesthetic and as a plot device rather than any kind of functioning environment. Either the effort just wasn't put in or a sub-par narrative just fluked an interesting premise.\r\nTo compound the feeling of melodrama the show doesn't really have any pace but absolute haste. It's a neverending rush from one problem to another and this has a knock on affect in regards to the quality of the introduction of new characters because they are given next to no background when they appear since the show focuses on the plot; this, in turn, makes it practically impossible to relate to them or in some cases really fail to understand what their intentions or motivations are at all.\\n\\n\r\nFor example there's a completely random \"agent\" character originally introduced as a throw away device to introduce a new threat/antagonist. The agent works for a completely absent organisation that is never mentioned and who after being destroyed and later brought back to life chooses to start working with the protagonists because [insert arbitrary reason]. The whole thing is just weak. He also seems to know and be able to contact the female lead, despite having no real connection with her. Additionally he finds himself in the predicament of being swapped genders in the (underground) process of re-initialising his cyborg consciousness inside another body and despite an initial disapproval, manages to slot right into the new role after just moments like a cheap joke despite having the potential to being one of the most complex characters in the show even though (s)he is only a supporting role. Every now and then when they appear on screen you're found asking yourself \"Wait a minute, who even is this person\".\\n\\n\r\nYet the show still expects for us to care and relate when these flimsy characters with no origin story get stuck in dire situations.\\n\\n\r\nOrdinarily i would have lumped this show into a pigeon hole as a child's show, the complete lack of complexity, basic as hell action scenes and over dramatic acting makes it appear that way, except the show in a vain attempt to be edgy introduces some fairly frequent foul language and completely superfluous unwarranted nudity (all be it censored). It's really hard to judge this show because it's really hard to know what the goal was outside of the original Light Novel, which may have been more smooth than this adaptation.\\n\\n\r\nI can't tell whether the show tried to be too many things at once or didn't try to be anything at all and the result is a complete mess of a story, with ludicrously high stake gambits driving an underlying story of one 16 year old's seedy desire to have a harem of sentient pseudo sex dolls. Maybe that is the ultimate joke. Certainly it is a running one that each antagonists high and mighty ideals and plans are all foiled by a protagonist whose only motivation in opposing them is his interest in maintaining the status quo of being in a relationship with his automata which he cannot do if his home town is \"purged\", \"blown up\" or \"shot with a giant orbital space lance\".\\n\\n\r\nTo summarise: The characters are all melodramatic and with no real depth making the show feel really silly overall. There isn't even really any fan service despite being the opening saga of a harem so it's hard to tell what the ultimate intent of the show was. The art is hit and miss, the use of CG has always been a cheap move, but a clear effort has been made to reduce the obviousness of \"recycling\" content that would be re-used over and over like the gears. It's not a difficult show to watch, but it's silliness wont keep you as engaged as you might have wanted to be. You'll probably be disappointed if you're a seasoned anime watcher.",
            "date": "2017-07-28T13:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 254061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=254061"
        },
        {
            "content": "This anime had potential, the source material is good. BUT The anime adaptation lacks creativity and script is subpar. Flow in Clockwork planet is very clunky and it is distracting from the story, that could have been interesting but script is bad. From the main villain who just appears out of nowhere we don't hear until the very end and his background is not explored, his motives are not setup properly and basically all we know about him is from his mumblings and very short flashbacks. You can't really get into things if you don't really know why things happen.Then there is the MCs, Naoto seems some what developed but is still a too 2 dimensional character. It seems like he is not very well set upped, black slate almost. Then Marie... Her mood shifts swings like a pendulum, one moment kind and then bitching about something small to Naoto. Chemistry between them seems forced the way it is shown. Automatas, RyuZu is maybe the most stable and sane one. She is consistent and likable and character is well defined. AnchoR is the annoying, but still kinda cute little sister, can't stay mad for her. \\n\r\n     Now the overall aesthetics. Sound design is very basic, generic and kinda forgetable. Art is average, it really feels like manga with moving pictures not like a proper anime. Colours were also kinda dull, would have needed like some bright colours there and there, maybe not like in NO game no life, but sth. that would have made this animes visuals to popup form the mediocracy. \\n\r\n      It was still some what entertaining but overall not the way I would have imagined this world. 6,3/10 Rounded to 6/10. A disappointment for me, had the material for 8-9 but lacks.",
            "date": "2017-06-29T07:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 251422,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5954983.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Keksisieppo",
                "username": "Keksisieppo"
            },
            "url": "https://myanimelist.net/reviews.php?id=251422"
        },
        {
            "content": "This show I picked up mostly because the community swore the light novels were pretty good and the plot seemed intriguing. Honestly though, the whole thing just felt… off. Which is hilarious because a huge theme of this show is things working together in harmony, like gears in a clock (subtle, light-novel sensei). It was like the show couldn’t decide what it wanted to be. One moment we’re having these decent gun fights and things are all intense and serious, and the next we have an android offering to use her lap as a pillow for the MC like it’s a harem anime.\r\nBut probably mybiggest problem with this show was the whole /r/iamverysmart feeling that the main characters gave me. The MC has super hearing and has to wear noise cancelling headphones to have a normal conversation with someone (yes, really), and the main girl is a supposed “genius” who is constantly one-upped by the MC. I could have maybe accepted their behavior a little more if they were older, but we’re talking about preteens who come off as bratty and patronizing at best. I swear, both the MC and main girl went through a cycle of Problem -> Solution -> New Problem -> Immense, Immediate Depression -> Other Person Telling Them it’s Daijoubu -> Solution all the way up until the finale.\\n\\n\r\nThat isn’t to say that it was all bad, though. The animation was decent, and watching the few fire fights were actually pretty awesome at times. And while the fanservice is shoehorned in at awkward places, it’s still decent fanservice. I know what I’m on about, son. If you aren’t too concerned about plot, this might be worth checking out.\\n\\n\r\nMy MAL Score: 5/10.",
            "date": "2017-06-24T21:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 250941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5332401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/blessedhellfire",
                "username": "blessedhellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=250941"
        },
        {
            "content": "En mi opinión la serie está muy desaprovechada, su historia me parece monotona, pero esta bien llevada, lo que realmente hunde la serie son sus personajes tan planos y poco apreciables. Realmente no te causan ninguna emoción. El protagonista no tiene nada de encanto como tal, básicamente es un idiota, no tenemos un protagonista carismático y de buen nivel como Joseph Joestar o Lelouch, el personaje mas fuerte de la serie apenas si me pareció que servia para fanservice,  su actitud tan egocéntrica en lugar de ser Divertida o algo me resultó molesta en fin RyuZU se pudo aprovechar mejor. Marie igualmente era unpersonaje sin encanto, pero era el mas pasable de toda la serei. Halter era el tipo serio que carece de personalidad y presencia un personaje plano y ya. \\n\r\nLa animación esta en la media de lo correcto, lo cual es bueno. Con su ambientación creo que se podía lograr algo mejor si teníamos una animación mas a lo Kabaneri en cuanto a calidad. Pero en lineas generales está bien.\\n\\n\r\nNo digo que la serie sea mala, la verdad es que se puede disfrutar y entretiene.\\n\r\nPero me parece mediocre porque está desaprovechada. \\n\\n\r\nLa serie tiene lados muy buenos y situaciones muy interesantes.",
            "date": "2017-06-23T10:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 250768,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kokerf",
                "username": "Kokerf"
            },
            "url": "https://myanimelist.net/reviews.php?id=250768"
        }
    ]
]