[
    [
        {
            "content": "The tags \"Action, Ecchi, Fantasy, School, Shounen, Vampire, Supernatural\" actually summarize the show pretty well, with the exception of \"school\" perhaps. If you want to watch a normal guy who stumbles upon ridiculous powers and then proceeds to save the world and get a lot of female attention; then here you go. \r\nOne of the things to appreciate here is that what you see is what you get. It's a straightforward anime you can get some escapism/ good sequences out of (be them of the girls or of the action). I also think that the first few episodes are quite representative of the series asa whole; so your interest should be fairly easy to gauge early on.\\n\\n\r\n-Story\\n\r\n7/10 - as expected, the story isn't outstanding, it simply does its job here. Strike the blood's strong point is not going to be its plot. The story works in arcs, with new villains/ girls being added or focused on in each arc. There are some overall trends and developments but its nothing special. I'd call it overly simplistic - however actually for a show that I watched to just distract myself for an hour or so I found this to be a positive. I'm not sure if some of the satire or irony that came across was intended, but if it was then I tip my hat to the writers.\\n\r\nThe story does work for the genre(s) in mind here - pretty much the plot will be bent to better accommodate scenes where Kojou can be a hero or save the girl or can get into a better fight. But that's fine because that's why people will watch the show in the first place.\\n\r\nWithout wanting to give too much away, I think certain plot devices were quite clever. Overall I think the plot serves its function quite well, but because the plot is obviously going to be side-lined in such a series there is a limit to how good it is.\\n\\n\r\n-Art\\n\r\n9/10 - Probably the anime's best point is the art. The characters designs, as well as the background and effects for fights, etc. are well done and ultimately are very effective. The art style is certainly easy on the eyes, and the sequences often fit the anime well.\\n\r\nI can't really think of many negatives here - perhaps some money was saved on certain designs but in my opinion the art here almost makes the show.\\n\\n\r\n-Sound\\n\r\n7/10 - Like most modern animes, there really isn't much to comment on here as its just simply decent. I thought the OPs were fine, as were the endings. They are not something I'd personally want to listen to outside of the show, alongside the background music, but they contribute pretty much as you'd expect them too.\\n\r\nThe voice acting here is good as far as I can tell. Kojou isn't meant to be super charismatic so it fits the plot, but its nothing to write home about.\\n\\n\r\n-Character\\n\r\n6/10 - The characters are ok, given that the pretense of the show is to break character models and focus on action and harem.\\n\r\nKojou is (axiomatically) fairly likable and for most people easy to relate to. This is no surprise given the escapism theme (/self insert theme). I don't particularly like Kojou, and I found him a bit overly simplistic. But the fact that I have an opinion is evidence for him actually having a character (which is more than can be said for certain animes in similar genres).\\n\r\nThe girls are all quite distinct and well developed, apart from their at times inexplicable devotion to Kojou (but then again, harem). I think Himeragi Yukina probably has the best developed character, and she actually has some development/ perspective added, although this is also stunted because of the harem nature of the show.\\n\r\nThe villains are, in general, awful and almost completely one dimensional. But it doesn't really matter because most of the time they are on screen they just get destroyed by Kojou.\\n\\n\r\nTl;dr - it's harem, don't expect interesting or insightful characters. For a harem, the characters are ok.\\n\\n\r\n-Enjoyment\\n\r\n8/10 - Although the show has its flaws, its quite good fun to watch, and I found it a nice contrast to studying. Because of the art and arc-type plot, it's something that could quite easily be re-watched or returned to, which is a positive IMO.\\n\r\nI would say that your enjoyment of this anime is very dependent on how much you enjoy action and/or harem and/or supernatural genres. The Kojou/Yukina relationship is ok to follow, but this is not a romance anime, and it's something I'd recommend watching when you want to have a break rather than something to stimulate your brain.\\n\\n\r\n-Overall\\n\r\n7/10. Again, the art, the escapism and the straightforward nature of this show are its strong points. It's generic, but I'd say it beats most other shows in similar genres. Why? There's nothing that groundbreaking, just a few subtle nuances that go unnoticed individually but actually contribute to making this show quite enjoyable. Unfortunately the show does fall flat on its face at times for taking itself too seriously and shoe-horning itself into arcing episodes, where it probably had potential to be a better overall show if it avoided this. As is, it remains something lighthearted that most young guys will probably enjoy once or twice (if you enjoy the first few episodes, you'll enjoy the rest. Despite the flaws, there is something to be appreciated here.)",
            "date": "2014-05-07T16:27:00+00:00",
            "helpful_count": 173,
            "mal_id": 142619,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/afterwards",
                "username": "afterwards"
            },
            "url": "https://myanimelist.net/reviews.php?id=142619"
        },
        {
            "content": "It’s not hard to figure out what Strike the Blood might be about at first even if you’re coming into the show completely fresh. The key words are ‘blood’ and ‘strike’ where the latter is when our main male protagonist Akatsuki Kojo does his mojo to satisfy his blood lust. There’s hardly anything too original related this series. After all, we get the typical mysterious guy meets young girl in a city on an ordinary day. Then, a not-so-normal event happens and the duo gets caught in events they didn’t think could get both involved. But if we add everything together, Strike the Blood comestogether as a little more than a show to induce nosebleeds. \\n\\n\r\nStrike the Blood is an animated series based off the light novel of the same name written by Gakuto Mikumo. This is not his first work as he has previously been involved with series such as Dantalian no Shoka, the Zettai Karen novels, and Asura Cryin’. What he brings into Strike the Blood has a little taste of all of those elements in his previous works but transform it into a meat package – a series with a main protagonist that feeds off of others to control its users’ familiars. \\n\\n\r\nAn anime series involving with vampires. That’s hardly original in any sense either with its generics. There’s plenty of anime that followed similar ideas such as Vampire Knight, Karin, or Blood+. Strike the Blood takes our main male protagonist Akatsuki Kojo and makes him into a big name in a big city. For instance, most people who knows about his origins and status as the Fourth Progenitor, the world’s strongest vampire. As the title strikes both a bit of fear and respect, it’s no surprise that he is a man to take notice of especially for his observer, Yukina Himeragi. For the duo, their relationship begins kicks off with a rocky start loaded with misunderstandings, confusion, and animosity. Given the fact that Yukina’s job is to observe Akatsuki makes their relationship seem even more awkward as the former would be labeled as a stalker in some ways. At the same time, Akatsuki becomes annoyed by her presence. It’s also not exactly the best combination with Yukina’s anti-progenitor spear always on hand. It seems to serve as a warning sign should Akatsuki goes out of control. Over time however, the duo gets along better with Yukina even developing a seemingly crush on the young man. Outcomes like this should not be taken as a surprise however. While the duo lacks strong chemistry, they share a similar feeling towards those they encounter and the city they live in. It’s through their willingness to help others that ties them together to make the duo stronger.\\n\\n\r\nBased off a light novel series, the series divides itself in arc format with a certain set of episodes focusing on a specific event/character/conflict that requires a solution. In total, there are 7 arcs covering the light novels. More importantly is the fact that each arc focuses on a different character with a different otherworldly conflict. It brings out the diversity that the audience can get accustomed to. There’s all types of otherworldly beings that the show focuses on whether it’s vampires, werewolves, angels, or witches. Along with that, each arc also progresses Akatsuki’s relationships with others as he gets stronger. Unfortunately, his lack of characterization doesn’t shine with his past being left in unexplored territories. This falls under a similar case for Yukina as the audience hardly knows about them beyond their purpose on the surface. Other characters of course also plays their roles in each arc, some more than others with a particular few getting veritable moments. But because each arc changes its tone, audience should be ready to adjust themselves to match the mood with its themes. There might also be some sort of hidden moral that progresses the story although most of it is obscure and seems cliched . Unfortunately for Akatsuki, there’s little focus on his goals or morals as the show itself doesn’t give an impression as if it he had one at all in the first place. With the way he is dressed. Akatsuki is more of the lone wolf and he only gets into situations because of his status. \\n\\n\r\nWhile the word ‘diverse’ can be used to describe a favorable stance to adapt an anime’s character cast, there is also generics that makes up the other half. The majority of the main characters are female that falls under some sort of characteristic that comes off as generic as it can be. We have Yukina, the girl that observes Kojo 24/7 as her role. There’s the typical classmate Asagi Aiba with an obvious crush on Kojo. Nagisa Akatsuki plays the role of the little sister with her chatty mouth but lack of understanding of the supernatural world. Then, there’s the tsundere Sayaka Kirasaka whom often says things that means the opposite way around. Each arc also features a prominent character that is the focus of its story. Most of them are always female and shouldn’t be a surprise with a show like Strike the Blood. It’s predictable with most endings of each arc with Akatsuki doing the striking and blood spilled for authentic reasons. \\n\\n\r\nThe action of Strike the Blood can be described as thrilling but not anything that blows itself out of the water. If I had to describe it, it would fall under the line of dangerous but also hectic. Each arc features a different conflict so the action tends to diverse itself a bit in terms of presentation. However, one key factor always strikes at heart with Akatsuki’s blood lust. The earlier stages plays it off as a necessity but later on ventures into a more erotic allurement. It shouldn’t be surprising at all with hints given already featuring its fan service moments. There’s the pantsu, honey trap, and misunderstandings all over the place that brings out Strike the Blood’s generics to its core. Surprisingly enough, the show omits the traditional onsen/beach episode. Perhaps it was too busy focusing on its conflicts in each arc to given our characters a vacation or it wanted to go beyond its setting. Who knows? What it’s known is the fact that Akatsuki always gets his fun (not the way he sees it though) in each and every single arc. Fun itself can also give the audience different impression. The show sometimes likes to make fun of itself with little gags. Even the organization Yukina belongs to is hard to take serious at first with a name like “Lion King”. We also can’t forget about some of the dialogues that comes out in the wrong way with most coming out as cheesy. Finally, there’s also bits of romance. Unfortunately, that territory is something Akatsuki seems to have the least interest in. Despite obvious advances, Akatsuki doesn’t seem to show actual interest in any of the girls that approaches him besides satisfying his blood lust. Every meal means he gets a little satisfaction but not in a romantic sense. If you’re looking for a developing romantic story, Strike the Blood is the wrong place to be. Akatsuki is just not a bachelor for his candidates.\\n\\n\r\nSilver Link animated Strike the Blood. On a technical level, the style of the series fits well with its supernatural themes. The Demon District, Itogami City also gives off an impression of aspects with its advancing arts. Most otherworldly beings are depicted accurately with credibility. Unfortunately, some of the character designs lacks a bit with any unique features. The school uniforms looks generic and hardly stands out. Akatsuki’s design makes him look like a loner with his hood covering his head that viewers will feel less attached to. Other characters such as Nagisa Minamiya has appearances that contrasts their age. Supporting main characters are also hardly noticeable despite some of their status. On the other hand, the background art of its city gives an impression of a luxurious display with its aquatic-like attributes.\\n\\n\r\nSoundtrack can come off as a mixed bag. On the surface, it is consistent to match its style. But at the same time, it can come off as just being there with nothing to focus directly on. The OP and ED songs offers a montage of the main characters as well as possible foreshadowing. With a show like Strike the Blood though, the arcs can be predictable already anyways. But for what’s worth, most of the characters’ voice acting is remarkable. The only sting is the dialogues themselves that comes off as cheesy and lacks distinguishing moments. However, I do give praise to their voice mannerism especially for Yukina (Risa Taneda). Even though she just began recently with animated voice acting, there’s promising potential for her with a role of a main character.\\n\\n\r\nIn the end, Strike the Blood is another typical series with nothing stellar that strikes hard at home. It has its harem vibes, the fan service, the gimmicky gags, and predictable arc conclusions. However, it does bring out a diverse cast of characters that offers attention. Not only that but Akatsuki isn’t your typical wimpy main lead. He often takes charge despite not like being part a conflict. If only the show focused on him more rather than adding a girl to his harem every arc would bring out much more potential. On the other hand, each arc does have potential with its diversity. While some of it is colored with gags, it does progress the story’s overall themes. It could take a bit of patience to get used to this show overall in the end but that’s how it is really.\\n",
            "date": "2014-03-28T19:04:00+00:00",
            "helpful_count": 101,
            "mal_id": 137623,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137623"
        },
        {
            "content": "​Thunder's Review no.4: Strike the Blood\r\nI followed this anime whole way down to the hell where it have ended. Much virgin blood was sucked and a lot of underwear exposed. Occasionally I enjoyed the ride but the road was rocky and full of holes. Those holes were full of predictable randomness not seen in ages and suited final destination perfectly. Welcome among all these vampires, witches and loli teachers, this is Strike the Blood. \r\nThe Story 2/10\r\nThe best way to describe this show is simply saying that it's a harem with vampires and magic. Beginning is generic but fairly interesting, there was some space fordevelopment but all hope for the good story is quickly washed away in a couple of episodes. The world that could be interesting setting with different vampire lords and organizations controlling it is never explained to us and all we see throughout the whole series is one city.\\n\\n\r\nOur protagonist is of course your typical high school student who accidentally happens to be the strongest vampire in the world, oh and there are a lot of girls falling for him just because he's a nice guy. And do I have to mention that Itogami City that he's living in is a place that all demons are sent to to live in \"secret\"?(weekly destroy the city and a lot of explosions scenario)There is nothing outstanding and even decently original or interesting in the Strike the Blood's story, actually there is no plot! All plot lines are resolved in the series of short arcs, few episodes long each. Episodic nature at least suit Strike the Blood as a one time per week time waster. I doubt that I would care to watch something with no overall plot, episode after episode constantly.\\n\\n\r\nOkay so we know that there is arguably no plot, then what's with those episodic arcs? Well, this is old shounen formula done even worse than usual. Villain of the week appear, our main character can't bit him but then just get power up by turning his vampire urges on and sucking blood out of the one of attractive girls in the show (read, any girl in the show). It ended with me just waiting for some girl to undress and be done with it. It was funny first time but seriously EVERY time?! The only times when you'll be surprised will be those moments when they introduce new characters or threats to the city. I doubt I've ever seen such a random plot twists. There is absolutely no foreshadowing, everything is just thrown at you without warning.\\n\\n\r\nStrike the Blood doesn't handle its more serious plot twists well, actually when serious stuff  is happening your only motivation for keeping watching is another ecchi moment or some short fight scene. Fight scenes can be fairly enjoyable, at least at the beginning, but there is barely any tactic involved and all characters are just screaming names of their insane shounen attacks again and again and again... Overall I think that best parts of the show was those that nothing happens in and all the characters were just fooling around. Seriously, comedy parts were the only think I was interested in and every week I prayed to myself for as much of it as possible.\\n\\n\r\nI don't want to spoil wonderful ending for you, just know the word that describe it best: random.\\n\\n\\n\r\nThe Animation and the Art 6/10\\n\r\nAnimations in Strike the Blood are fluid enough, especially in fight scenes. Characters are well drawn and there are some really attractive girls out there if you're in for that kind of stuff. Some backgrounds may be call beautiful and overall animations and art stands on more than decent level, but is drowned down by some cgi. What this anime misses is original art style, especially on characters. There is nothing that make me remember how characters looked. I can barely remember which girl had which hair style. On the other side you usually doesn't remember pretty girl from the porn video you watched so I guess it's fine.\\n\\n\\n\r\nThe Sound 6/10\\n\r\nBoth openings were ok, at least when it comes to watching them once per week. Overall soundtrack wasn't bad and was kind of nice background music but nothing more than that. There was no tracks that stand out enough to make me listing to them afterwards, I'm sad every time it happens. Music is very important part of every show and this anime really needed something to make up for the random story. Sadly music wasn't this something.\\n\\n\r\nAs far as voice acting goes I don't have anything special to say about it, it wasn't bad but I heard better.\\n\\n\\n\r\nThe Characters 4/10\\n\r\nIn show with such a troublesome plot there should be great characters to make up for it. When characters in Strike the blood aren't worst I've seen, they are not that great either. Our main male lead, Akatsuki Kojou is fairly likeable but also fairly generic teenager that a lot of girls are falling for just because he's a vampire that sucked their blood. There is also our main female lead Himeragi Yukina. She can handle herself in a fight and are ready to beat up Akatsuki every time he do some perverted thing he haven't actually done. There are of course few other girls that are there to interact with Kojou in interesting ways (\"cough\", fanservice). Some characters have interesting backstories to them when others have almost none. We get to know most things about most secondary character within duration of few sentences. So basically we don't have a reason to care about most characters in the show.\\n\\n\r\nOur main cast get some simple character development, but it's very slow development and by the show's end characters aren't much different than by its start.\\n\\n\r\nI guess all characters do their job as plot devices, even if they are there this whole time to do something important just once. Just don't go in this show expecting some interesting individuals with their own ideologies that actually makes sense. Villains are unworthy of mentioning. When the biggest part of characters are mediocre, villains in this anime are below that standard. Their goals are simple and simply evil. At least we have decent quantity of attractive girls to look at.\\n\\n\\n\r\nThe Enjoyment 5/10\\n\r\nWhen Strike the Blood doesn't try to be serious it's actually quite enjoyable. Too bad that it didn't have more comedy or maybe some overall plot but I guess it would not work with that sort of show. There is nothing outstanding about it, soundtrack and animations are just decent. You can still probably like it more than I do if you really like anime stereotypes and you didn't grew tired of them yet.\\n\\n\\n\r\nOverall 4/10\\n\r\nStrike the blood is rather mediocre show that failed when it counts the most. What we got is vampire teenager with harem of girls, a lot of anime stereotypes, good comedy that was a light in the dark in this show, messy \"plot\" that ended in a very random way and a group of rather weak characters. It wasn't worst thing that I've seen and sometimes you need something mediocre to appreciate better works.\\n",
            "date": "2014-04-02T10:48:00+00:00",
            "helpful_count": 60,
            "mal_id": 138327,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3497631.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Kaminari-sama",
                "username": "Kaminari-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=138327"
        },
        {
            "content": "My expectations for Strike the Blood were simple: I wanted lots of action with some romance thrown in. Instead, I feel like I got the opposite. Overall, I was disappointed in some areas and pleasantly surprised in others. Though I don't regret watching it, I wish the show had only 12 episodes instead of 24.\r\nStory: 6\r\nTo put it simply, the story for this show is mediocre. It isn't outstanding, but nor is it bad. It simply fulfills its duty to carry along the main premise of the show, which focuses more on the relationships between characters (primarily, of course, between the leading hero Koujo andthe ladies).  The show is divided into several arcs, which range from 2-5 episodes long. After the first few arcs, a general pattern of events begins to emerge and repeat itself. Though this has no real severe implication on the show, it does make it a bit predictable.  \\n\\n\r\nThe only significant issue I have with the plot is that it never addresses the circumstances in which Kojou becomes the Fourth Progenitor. Though it is mentioned several times in the show and there are a few short flashbacks, the questions surrounding Kojou's mysterious transformation are left unanswered--though I suppose that if there's a possibility for a second season they could be answered then. \\n\\n\r\nArt: 10\\n\\n\r\nBy far the best thing about this show was the art.  Very crisp, exciting animation, with exciting colors and fantastic fight choreography totally fulfilled my expectations.  Character designs were spectacular, the magic was interesting, and the scenery was beautiful. \\n\\n\r\nSound: 7\\n\\n\r\nThe sound was not particularly memorable. It, like the plot, fulfilled its purpose, though unless you're paying attention, it's not very noticeable.  The OPs and endings were fine, but not anything out of the ordinary.\\n\\n\r\nCharacter: 5\\n\\n\r\nThe characters in a romantic show, especially a harem, are its driving force, and I feel like this is where Strike The Blood's mediocrity prevails. \\n\\n\r\nI found the main character, Kojou a bit two-dimensional and simplistic.  He was likeable, handsome, decent, heroic, and pretty much everything a good (but not particularly interesting) protagonist should be. He had only a few minor flaws, leaving little room for character development or improvement.  \\n\\n\r\nThe girls in the show, however, are a different story.  Their personalities are more clearly defined and more developed than Kojou's, and they don't really follow archetypes, so they're certainly more interesting. Himeragi, the female lead, is the most developed, and she undergoes the most noticeable character development in the whole show.  \\n\\n\r\nThe one thing that bugged me most about the girls, however, is that no matter how smitten they were with the main character, they constantly berated him, calling him an indecent pervert even in situations that are totally out of his control (this is especially true of the main female character, Himeragi.) Though I can understand that this was meant to be comedic relief, hearing \"HENTAI\" screamed in various high pitched girly voices episode after episode starts to grate on one's nerves. \\n\\n\r\nSupporting/side characters were incredibly bland.  For example, Kojou's male friend with headphones was so underdeveloped that those are the only two things I can  remember about him. A few side characters, like the First Progenitor, could have been really interesting, but they were sort of put on the back burner to all of the romance going on.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nThis is the sort of show I'd recommend to someone who wanted to shut off their brain for a while, watch some cool magic, and see a couple panty shots. It certainly wasn't bad, and I can't say I disliked it, but overall, it fell straight into the mediocre category.",
            "date": "2014-07-03T21:45:00+00:00",
            "helpful_count": 59,
            "mal_id": 150243,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3088041.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MachinaEm",
                "username": "MachinaEm"
            },
            "url": "https://myanimelist.net/reviews.php?id=150243"
        },
        {
            "content": "Based off the light novel was written by Gakuto Mikumo, \r\nThe story tells us a boy named Akatsuki Kojou, that turns out to be The Fourth Progenitor, the world's strongest vampires in the world. He was followed by a girl named Yukina Himeragi, who came from the Lion King organization to observe the Fourth Progenitor.\r\nI found out the two lines above really offers me a unique set-up of an anime,  and the genres \"Action+Ecchi\" really offers us a combination of a real action and a desirable fan service. But not the story.The plot is divided into several simplistic arcs, that actually works with theentire series. The problem of Strike the Blood is the poor story execution that turns out to be a dull for someone who doesn't really into Action or Ecchi genres.And to make things worst, there are some plot holes about how Kojou become the Fourth Progenitor too. Besides that, some people may think Strike the Blood is cool, and some people maybe think it's one of those typical Harem that ruins their senses, but in the reality, it has a decent story indeed.\\n\\n\r\nThe most precious diamond that lies in the anime is the Animation , like almost every modern anime in this era, they all offers us a great animation. We have a catchy and clear art, with an amazing visual effects and fighting scenes. It's really the main attraction of the anime itself.\\n\\n\r\nThere is not much to talk about in the sound section, but I found my heart racing when hearing the 1st opening song \"STRIKE THE BLOOD\" which sung by Kishida Kyoudan & The Akeboshi Rockets. Meanwhile, the 2nd opening song, & the endings is decent. The seiyuu did fairly well when bringing such character to the screen.\\n\\n\r\nWell, most anime have a serious problem on the character section, Strike the Blood is the perfect example of it. In the early episode of the series, Strike the Blood really promising us a meaningful development.\\n\\n\r\nBut the reality didn't accept that wish, there is no meaningful development that grows. The only thing we have is a simple division character.In the main character, we have our male lead Akatsuki Kojou, the Fourth Progenitor. And since the Fourth Progenitor is the strongest vampire in the world, of course there is no trouble when Kojou faces the enemies by himself (Notes: He sometimes really weak and then get helped by his own harem). Then, beside our male lead we have a collection of girls that fell in love with our male lead, the male lead gain strength by drinking the virgins blood. With that combination ahead of us, the characters became a real messy. And besides that, most of the enemy is doesn't get a development because they all defeated by Kojou in the end of the arc. \\n\\n\r\nAlthough Strike the Blood has some mistakes in the execution, I found the title itself memorable in my brain. Since this is a Shounen anime, women may not found this anime interesting. It is recommended to those who prefer action than story and prefer fan service than development. Overall, it is decent and fairly enjoyable....",
            "date": "2014-12-10T04:42:00+00:00",
            "helpful_count": 45,
            "mal_id": 171653,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=171653"
        },
        {
            "content": "\"This is my fight!\" \r\n\"No, this is our fight!\" \r\n- Akatsuki Kojou & Himeragi Yukina, respectively; dialogue from perhaps every episode of the entire anime.\r\nAnd by the end of the series, I have realized that it was my fight as well - I had to fight the urge to drop the series as a whole. The story begins with the main character, Akatsuki Kojou, who is the epitome of the standard harem protagonist. He is forced to accept his new found vampire powers and the misunderstandings that come with it, misunderstandings meaning a flock of girls including the main heroine, Himeragi Yukina. It is thestandard harem/ecchi/supernatural anime. And yet the anime leaves so much to be desired.\\n\\n\r\nStory: 5/10\\n\r\nThe story teeters between explaining too much and answering too little - the anime quite frequently drops embellished familiar names one after the other, while shying away from actual plot background. At the end of the anime, we are left with snippets of Kojou's vampiric origins, an uneasy plot device, and a flimsily assembled \"conclusion\" that abruptly ends the show. \\n\\n\r\nArt: 7/10\\n\r\nThe saving grace of this show. The fights were appropriately coordinated, well drawn, and were exciting to watch. The characters looked pretty in all but the budget scenes (which were sporadic but easy to point out). \\n\\n\r\nSound: 6/10\\n\r\nThe soundtrack was decent, despite the fact that it seemed like the entire show had only maybe three or four OSTs not including the OP and ED. It did its job and did not detract from the show. \\n\\n\r\nCharacters: 5/10\\n\r\nEvery character fell flat and did not stir a sense of personality. Kojou's interaction with every single girl can only be described as irritatingly futile. From the span of 24 episodes, not once did Kojou feel like he was developing as a character. With perspective to the main antagonist, his main reason for being is that he was adequately bored enough to become a villain. I found myself only drawn to liking one character, Astarte, if only because she was purposefully written as one dimensional and not an irritating mess of a character.\\n\\n\r\nEnjoyment: 6/10\\n\r\nBy the end, I was left with more questions than I had when I started the anime, a puzzling sense of confusion, and slight relief that I don't have to watch Strike the Blood anymore. The fight scenes were pleasant to watch but I cannot say the same for the rest of the show. The comedy was bland, the fan service was blatant and mediocre, and the potential harem/romance was forced at best.\\n\\n\r\nOverall: 5/10\\n\r\nA good anime to watch when you have more free time than you wish you had. A must-see if you're a fanatic of exceedingly mediocre anime with fan service, jumbled fantasy plots, and underdeveloped characters.",
            "date": "2015-06-26T02:57:00+00:00",
            "helpful_count": 26,
            "mal_id": 191301,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4695260.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/paoya",
                "username": "paoya"
            },
            "url": "https://myanimelist.net/reviews.php?id=191301"
        },
        {
            "content": "I REALLY NEED TO WRITE A REVIEW FOR THIS ANIME, BECAUSE IT HAS REALLY GOT ON MY TITS. BEAR IN MIND THAT I DROPPED THIS AFTER FINISHING EPISODE 12.\r\nStory 7/10\r\nThe actual plot of this anime was interesting, and a new take on something that has been done many times before. The story revolves around the Fourth Primogenitor is the world's strongest vampire, who is a high school boy called Kojou Akatsuki.  The Lion King Organisation send a skilled middle schooler, Yukina Himeragi, to be his observer.  The anime is split up into different arcs, all about four episodes long, and each unveiled newthings about the characters, and wasn't that boring.  \\n\\n\r\nArt 8/10\\n\\n\r\nI really did like the art in this anime, especially during fight scenes.  The character design was good, and it was quite cleanly drawn (I hate when anime has a messy looking art type, you feel).\\n\\n\r\nSound 8/10\\n\\n\r\nI really loved the opening theme, like damn.  I feel that was one of the only things that kept me going for so long. The ending was good too, however, although the music during fights/emotional scenes was satisfactory, it wasn't exactly epic, so I give it 8.\\n\\n\r\nCharacter 5/10\\n\\n\r\nNOW HERE IS WHERE THE ANIME COMPLETELY FAILED FOR ME.  At first, I was like, okay, I like Kojou, I like Himeragi, this is cool, I hope they get together, etc. Then suddenly there was another female character in love with him.  Then another. Then another. LIKE JESUS CHRIST, CANT WE HAVE ONE FEMALE CHARACTER WHO ISNT IN LOVE WITH HIM?? Not only that, these characters weren't even that well developed in my mind! Sure, they all had backstories, but there are so fucking many of them, that the writers can't actually go properly into any of them!! Jesus Christ. I couldn't deal with it.\\n\\n\r\nEnjoyment 4/10\\n\\n\r\nAll the points mentioned in my characters review section took away at least five points.  The other one point probably came from the fact the anime just isn't what I usually enjoy. The whole character stuff really ruined the whole anime for me basically.\\n\\n\r\nTherefore, my overall rating for this anime is 6/10.  If you enjoy watching a ton of female characters all be so caught up on this one guy so often, then you might like this anime.  I guess I would recommend it to fans of action, and vampire anime too.  \\n\\n\r\nTry the anime for yourself instead of deciding not to because of this review or anything.  I'm just really picky with anime. \\n\\n",
            "date": "2014-02-10T10:31:00+00:00",
            "helpful_count": 21,
            "mal_id": 132143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3437689.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pyrospyr",
                "username": "pyrospyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=132143"
        },
        {
            "content": "I am very disappointed with this anime. The story does not connect at all and each episode they just make up crap and make the main character overpowered as fuck when all he does is slouch around all day and getting turned on by lolis. The other main character Himeragi is just a total tsundere (in my definition they are just annoying, stubborn, impulsive, bitches) and blames everything on Akatsuki for things he doesnt do like being friendly with another girl she act as if they've been married for 40 years and he cheating on her when theres no chemistry. Also they are copying ideasfrom other animes which make them cliche not to mention how childish it is. If an admin reads this please change the rating to 10 years or younger because this is worse than Devil Survivor 2 (most cliche anime ive seen other than fate/stay)",
            "date": "2014-02-23T21:29:00+00:00",
            "helpful_count": 20,
            "mal_id": 133687,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3489015.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Lebrando",
                "username": "Lebrando"
            },
            "url": "https://myanimelist.net/reviews.php?id=133687"
        },
        {
            "content": "\"This is my review,\"\r\n\"No senpai, this is our review!~\"\r\nOkay, okay, Yukina. I get it, I get it. This is OUR review. -COUGH- Ahem.\r\nAnyway, let's get down to business. How do I describe Strike The Blood? I feel Strike The Blood was one of the best animes this winter. While other people found it quite mediocre, or annoying at times. Which, yes, I do agree that line did get annoying but I was able to ignore it because the plot drilled me into the series.\r\nI've enjoyed the character growth within the show. Some characters are unfortunately hated, but I'll give a summary of why I enjoyedthis series.\\n\\n\r\nYou have Kojou Akatsuki, the male protagonist. Who is a vampire, he struggles every day life whether it is selfish or not to keep living a normal life then he gets wrapped up in dangerous things. I felt like his character grew with Yukina, while a lot of people may hate her but the reasons for her behavior is quite reasonable in my opinion; considering she didn't know how to socialize or know how to act like a normal human being. She was able to understand more being around Kojou.\\n\\n\r\nI also enjoy the fact that this series didn't just FOCUS on Kojou and Yukina. I found the other cast got a decent amount of screen time as well. There wasn't many characters that annoyed me except for one, but I liked the consistency of the show; while the show has been done many times and isn't completely original. I loved the fact that Yukina wasn't in the same school as Kojou just to observe him, she was in another school. I would go into more, but I don't want to spoil for those who haven't gave it ago. This was just a fun series to experience this year; that made me want more and more.\\n\\n\r\nSo for the story, I will give an 8. Only because, I feel like there is a lot of things missing that need to be answered. This score will change if there is a second season.\\n\\n\r\nAnd characters I will give a 7, their personalities meshed very well with the series and I loved how they all interacted with each other. It's like you can feel part of their group. I also enjoy the fact all of them got a good amount of screen time, though I wish Motoki got a little bit more than he had. He was amazing, and I can't stop thinking about Alvin from Tales of Xillia when I look at Motoki. I swear, those two look alike. OKAY, OKAY, back on topic. XD. I just hope if we get a second season, we'll get into more details about everyone's past lives since with the series being rather short and with so much going on, they didn't have time to fill in gaps about their pasts. This way I can really understand the characters at their full potential.\\n\\n\r\nThe art was crisp and clean, it was pretty to look at. However, they could've done without the green outlining or bright colors that may hurt the eyes at times. I think that was my only beef with the art other than it looking pretty. So I will give the animation a 8. Only because the animation sort of looked blurred at times which I hope they fix in the next season if there is one. I don't know how well the sales have been for this series, but I do plan to buy so it can work its way into a second series.\\n\\n\r\nI found the sound tracks amazing, mainly the opening and endings. The sound track itself wasn't really memorable except when shit was about to go down. I only liked some of the soundtracks; so the sound I will give a 7. \\n\\n\r\nEnjoyment? Well, what can I say? It was a fun ride while it lasted. It was sad to see this series end. I've written a review about this show before but unfortunately my comment had gotten removed so I am rewriting this. My overall enjoyment was 9.\\n\\n\r\nI've already gave a review how I felt about the characters and another thing I like to add. I like how there wasn't TOO much fighting over the main male; and that Yukina didn't beat him up all the time, she scolded him yes a couple of times but she didn't take it too far like most tsunderes do. So I give Yukina quite a lot of props. I enjoyed that she didn't question much of Kojou and instead, trusted the guy. So despite what people may say about Yukina, I give her quite a bit of respect than most main females. Although, my main favorites were Sayaka and La Folia. : D OKAY,BEFORE I GET TOO RAMBLING ABOUT THIS ANIME.\\n\\n\r\nOverall, I give it a 9 out of 10.\\n\\n\r\n-v-\\n\\n\r\nForgive me, I suck at reviews. :'D\\n",
            "date": "2014-08-19T17:32:00+00:00",
            "helpful_count": 19,
            "mal_id": 157175,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2088817.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShionxChan",
                "username": "ShionxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=157175"
        },
        {
            "content": "\"This is our fight\" - Yukina Himeragi\r\nNow, we're down to the last 2-cour fall anime I watched \"Strike the Blood\". This anime is produced by Silver Link who produced the comedy \"Baka & test\" which I enjoyed a lot. This anime is directed by Hideyo Yamamoto.\r\nSTORY (5):\r\nThe story follows Akatsuki Kojou, who became the 4th primogenitor, 3 months ago, after the original spirit of the 4th primogenitor come into Kojou's body. The 4th primogenitor is said to be the strongest vampire in the world and is accompanied by 12 familiars. When the government and Lion King organization received news on the 4th primogenitor, they ordereda Sword Shaman known as Yukina Himeragi, to find the 4th primogenitor and take the 4th primogenitor down. \\n\\n\r\nThat's basically the intro of the story, and what you're going to expect from there on are a bunch of misunderstandings, action scenes and wacky situations in soon.\\n\\n\r\nThe story covers 7 chapters of the light novel. In fact, I researched that the light novel has 10 chapters. \\n\\n\r\nThe story starts off as interesting but as each chapter goes by, it keeps going more downhill. It is due to the fact that too many characters are introduced. I will get to the characters section later.\\n\\n\r\nART (6):\\n\\n\r\nThe character designs are good and the animation is good. In fact, the action scenes are cool. \\n\\n\r\nSOUND (6):\\n\\n\r\nI liked the 1st and 2nd opening. The 1st opening is the name of the title itself. It was sang by Kishida Kyodan. The 2nd opening is \"Fight 4 Real\" by Altima. the 2nd opening is very energetic and lively. I also liked the 1st ending \"Strike my soul\" by Yuka Iguchi especially the 2nd ending \"Signal\" by Kanon Wakeshima. The 2nd ending \"Signal\" has a more relaxing and smooth tone than compared to the other songs.\\n\\n\r\nCHARACTER (4):\\n\\n\r\nThe biggest downfall with the show is the characters. The characters are real but they did not have enough depth to them. The problem with the anime is that every chapter, they introduce many characters. Because of that, the value of the character diminishes. It is just like in a workplace, if there are too many people in the workplace, the work and productivity gets less and less.\\n\\n\r\nMost girls like to bang on Akatsuki Kojou like Yuuma, la Folia and even Sayaka.\\n\\n\r\nAsagi Aiba & La Folia are the most interesting characters but sadly, they didn't have enough material for them to work on.\\n\\n\r\nDimitri Vatler was an interesting character but sadly he didn't have much time for his development.\\n\\n\r\nWhen Nina possesses Asagi, Asagi manages to become a better character.\\n\\n\r\nYukina Himeragi is jealous when Akatsuki Kojou is around with different girls. Yukina Himeragi says \"Senpai\" just like Mirai Kuriyama from Beyond the Boundary. The difference is that Yukina Himeragi's tone of voice is more serious. Both characters are voiced by Risa Taneda.\\n\\n\r\nSayaka Kirasaka is your typical tsundere. Normally when Akatsuki Kojou does something nasty, she gets angry and hits him. \\n\\n\r\nAre you serious? Why do I see this in most harem anime? When a guy does something wrong, a girl beats him up.\\n\\n\r\nSayaka is the most annoying girl out of the bunch. Normally, tsunderes are my least favorite girls in anime. In fact, tsunderes are the most overused characters in anime.\\n\\n\r\nThis is why I said that the problem with this anime is that it introduces a lot of girls and that these girls have not enough material to work with.\\n\\n\r\nCONCLUSION (5):\\n\\n\r\nSilver Link made a great comedy Baka & Test. But after making \"Strike the blood\", I am starting to worry about Silver Link because they run out of interesting ideas from there. \\n\\n\r\nStrike the Blood unfortunately suffers from the same problem as Sword Art Online in the sense that Sword Art Online introduces too many characters that the value of characters diminish. \\n\\n\r\nIf you want me to care about the characters, you need to work on their relationships rather than introduce too many characters.\\n\\n\r\nThis anime had interesting opening and ending theme. It had great animation. However, the animation and the opening and ending theme didn't save the show. \\n\\n\r\nThe story was cliched especially the characters.\\n\\n\r\nUnfortunately, I didn't come in with a 4 in mind. So, I give this anime a 5 out of 10.\\n",
            "date": "2014-03-27T09:32:00+00:00",
            "helpful_count": 16,
            "mal_id": 137223,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=137223"
        },
        {
            "content": "This is going to be my first review in a long time and sorry for the gramatical mistackes i make.\r\nSo a while ago when the anime was not still out i read the first couple of chapters of the manga.I think it was 6.I liked it soo much and when i heard that a anime is being made i stopped reading in order not to spoil it later.So lets begin:\r\nStory 4/10\r\nThe story starts interesting its about a boy called Akatsuki Kojou who 3 months ago became the 4th Progenitor the strongest vampire accompanied by 12 familliars.Well i expected a overpowered badass main character but itdidnt turn that way.So if you are looking for a such character this is not a show for you.I'm not saying he is weak or wimpy like some other characters but whenever there is a fight that woman (the main heroine) says ,,It's not only your fight its ours\".So we never actualy see him going full power.As the story goes you will find your self more and more bored.One of the problems in the story is that after one arc finishes the second begins right away not leaving any space for the character development.\\n\r\nArt 7/10\\n\r\nThe characters are well desinged and the battles are really well done.Thats about it.\\n\r\nSound 5/10\\n\r\nThe opening and the ending didnt really leave much impresion on me.I guess they were average.\\n\r\nCharacter 4/10\\n\r\nThe problem with the characters is that they are intruduced quickly.I dont even remember the names of anyone of them exept the main guy.The villans were just evil for the sake of it and there wasnt much background for the characters.To put it simply they were there just for Kojou to take blood from them.\\n\r\nEnjoyment 6/10\\n\r\nThe show wasnt entirely bad.If they made a little more efort in the plot and at least made it so that i could at least remember the character names it would have been one of the better animes i have watched.\\n\r\nOverall 5,2/10\\n\r\nWell if you have nothing to watch or a lot of free time i would reccomend this anime",
            "date": "2014-04-06T10:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 138961,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RealityEater",
                "username": "RealityEater"
            },
            "url": "https://myanimelist.net/reviews.php?id=138961"
        },
        {
            "content": "It's so bad, it's good. Seriously I can't get enough of these idiots probably because it reminds me of the good ol' middle school writing days. Though all the character battle monologues makes me want to cry blood. Speaking of characters, they're so flat, they remind me of how humpless my chest is, which is depressing. The only good thing about the characters is they're animated well enough that they could become the golden aesthetic calf of some fangirl club.But in short, they are depressing. \r\nThere really isn't much to say about this series because it's the typical anime. A lot of fan service andthe ecchi is thrown around in the most awkward of ways. Like serious, they will make a girl appear magically on the main character in a vain attempt in being relevant. \\n\r\nIt's disappointing. \\n\r\nSO I'll give you the real. If you're the type to get a kick out of idiocy or you get off on cheap ecchi, THIS is the anime for you. Everyone else should avoid it like a kid with asthma to an approaching dust storm.",
            "date": "2015-11-22T06:57:00+00:00",
            "helpful_count": 12,
            "mal_id": 203944,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4736435.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kofuku-chan",
                "username": "Kofuku-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=203944"
        },
        {
            "content": "So this anime is a typical sort of harem (romancey) action, magic futurey type anime, which sort of reminds me of things like a certain magical index and even rosario + vampire.\r\nSo the good:\r\nIts fun to watch, if you enjoy anime like raildex, or harem action it has the typical funny ecchi scenes you see when the character accidentally does something pervy. It has awesome action with cool magic effects, and its proper action where people bleed and get hurt. \r\nI found the characters quite fun to watch, with varying personalities that you see on a typical harem. The story line had quite a fewarcs, a lot of which are done quite well explaining everything thats going on compared to other anime which either breezes through the story line for the action, or screws up the action doing nothing but story and text. The action scenes also feel really interesting and fun to watch and character development although a little low is quite good.\\n\\n\r\nThe not as good:\\n\r\nThe biggest problem with the anime is how typical it is to others, the action harem ecchi plot is the exact same as you would see in any other harem ecchi action. The character personalities are the exact same as normal anime of that genre and the biggest problem is it doesn't do much different, they attack difficult enemies, theres a few romancey like themes, and its all really the same.\\n\\n\\n\r\nConclusion:\\n\r\nHonestly even though the anime doesn't deviate to others of that particular genre I friggen loved it, it felt fresh and new considering the character personalities are used so much. I was engaged more so in this anime then a lot of others I've seen. The arcs I felt was done really well in the anime, with none of them feeling like they ended too quickly or too slowly except the last one. And its something I really wanted to watch, something where I felt on the edge of my seat, I enjoyed my whole time and nothing too huge happened on the plot that would put me off from watching it.\\n\\n\r\nTLDR\\n\r\nIf you enjoy typical harem, action romancey, ecchi anime with magic, and demons and stuff, you will probably love this anime. If you don't though this anime probably won't be on the top of your list of anime to watch.",
            "date": "2014-03-31T13:50:00+00:00",
            "helpful_count": 12,
            "mal_id": 138109,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2379187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/trustnoone",
                "username": "trustnoone"
            },
            "url": "https://myanimelist.net/reviews.php?id=138109"
        },
        {
            "content": "I found the strong point in this series being the story. In the first few episodes, it was intriguing, and the story was progressing well. It presents a great deal of mystery and potential. The way the characters are introduced is clever, and each episode masterfully presents a captivating theme throughout, and ends with you desperately wanting to know what happens next. Sadly, as it moves on, and the harem aspect becomes more apparent, the story slowly dies. Instead of the action, fights, and moving moments, fan service becomes commonplace. As for character background, the only character with a fleshed out back story wouldbe Kojou. The flashbacks and pieces of his memories seem to evidently hide huge secrets and momentous events, yet the series keeps a veil of secrecy over his past the entire while. As for the other characters, most lacked a back story entirely. Despite being liable to having an enthralling past, the anime seemed to be hesitant to touch on any of it, and when it does, it usually ends with one scene, and never progresses whatsoever. The animation, however, is very good. The movements of the characters don't seem clumsy or unnatural and action is generally fluid. The varying BGM is played at appropriate scenes, and enhances the overall feeling of the scene. Overall, a good series.",
            "date": "2014-11-10T20:42:00+00:00",
            "helpful_count": 12,
            "mal_id": 168155,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4245477.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kaou",
                "username": "Kaou"
            },
            "url": "https://myanimelist.net/reviews.php?id=168155"
        },
        {
            "content": "I rarely say that easily but that anime is epic and full of quality ! I've watched the 24 episodes one shot ,eating in front of it ,skipping sleeping hours because each episode end made me have the urge to watch the next one.I've rarely been so much into an anime ,this one is definitely one of my favorite one ! Let's examine it :\r\nStory (8) : The story can sound classical for some peoples ,but for my own I find it original and really interesting.It's about a guy ,the MC ,which inherits the power of an ancient vampire ,a really powerful one.At the beginningthe MC was just a normal guy with a normal life ,but that incident totally changed his life.Now he's a vampire with incredible latent powers...and a strong tendency for nose bleeding every time he's a little aroused :3 .Than came a girl who'll change his already not-so-normal life and turn it into an even-more-not-so-normal life...So nice of her...And so it's with that nice duo that the story begin.I'm not gonna tell you everything about the plot of course ,but for me it was a really interesting one.The world itself is interesting with all of those not-human peoples ,that city full of \"monsters\" living more or less together ,the story is interesting ,the MC progression is nice to follow.Nah really ,that story is excellent.\\n\\n\r\nArt (9) : Perfect.I can't say anything else.The characters are awesomely made ,it's really colored ,actions are really well made and fast paced ,the ecchi scene are...*nosebleed*...Emmm sorry for that.The only little thing which is ,for me ,the little black spot on this pure white canvas (And there is nothing racist in that !) is that the main girl and the MC's little sister really look like the sames.I've spent so much time asking myself \"Is she he sister or the other one?\" and had so much hard time for differencing them.That's the only thing I can reprove about the chara design.\\n\\n\r\nSound (8) : Two fucking awesome opening ! If you like rock-like japanese songs than you'll love those opening.The OST of the anime is really great too and feat perfectly with each kind of situation in it.\\n\\n\r\nCharacters (8) : A MC that I'm so jealous about because he's a vampire and is surrounded by so cute girls.But he have a lot of style so I half pardon him.The girl MC which look totally like the MC's sister but stay really cute...Even if she often ruin the epicness of some battle with her punchline \"No senpai..It's OUR fight !\".Oh god ,how many time have I said to myself \"Shut up please and let him fight alone this time !\".Of course with that duo you will find ,the kind-of childhood friend (which remind me a lot Lucy from fairy tail sometimes) secretly in love for the MC (Aaaah classical ,why are you classical) ,the tsundere (*-*) who often help the MC even if she doesn't do that for him ,it's just a coincidence ,it's clearly not because she like him or something like that ! (How much I love tsun-tsun when they say that with a red blushing face *-*).You'll find a goth-loli sensei too (so cute *-*) who look really close to the MC for some obscur reasons.so yea the characters are many and a lot of them are interesting or touching.\\n\\n\r\nConclusion : That anime have everything I like.It have action ,it have ecchi ,it have love triangle/harem style love ,it have a strong and interesting plot ,some mysteries ,it have a lot of great combats with flashy powerful attack ,it have vampire and others creatures of all kind.You like those kind of thing? You really like all of those things?...Then why are you still reading me?! Go watch that anime right know and enjoy ,you baka ! >:3",
            "date": "2015-03-01T17:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 181492,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486047.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dai_Kina",
                "username": "Dai_Kina"
            },
            "url": "https://myanimelist.net/reviews.php?id=181492"
        },
        {
            "content": "This series has become one of my all-time faves! It's not just about the lead male who happens to be a vampire, though it does seem to lean towards the harem side at times. It is centered around the entire cast of characters. Though it's not the most original, the storyline is pretty great, and it flows smoothly. The way it is portrayed and developed is very unique. Even though it gets side tracked at times due to romance. Each and every episode continued to draw me in, and were entertaining! The development of the characters is very well done, and the relationships between thosecharacters are well defined! The series has a ton of action, but has its fair share of fan service as most series do. The art in this series is excellent, and there are very well placed comedic scenes that don't interrupt the flow. Overall, it's a very well rounded series. Though I secretly hope for more episodes....",
            "date": "2014-03-28T14:53:00+00:00",
            "helpful_count": 10,
            "mal_id": 137569,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=137569"
        },
        {
            "content": "Simply garbage.\r\nWas rage inducing to the point where it made me write my first review to record this frustration.\r\nDropped it a year ago and tried it again this year to hope that I was wrong to drop it, but I just proved myself right.\r\nStory is atrocious, very predictable, felt like I'm watching an anime with modern arts, but story that was written in 1980's.\r\nAll the female characters dismayed me, especially the pony tail girl with glasses, because she was the reason why I decided to drop this trash. I really hate it when a character disregards others' opinion and just acts rash, although I dounderstand that it is her characteristic and all, but there was a better way to do it. However, I will not dig into it due to possible spoiler.\\n\\n\r\nAt some point, the male protagonist was eating soft a sandwich, but he sounded like he was eating an apple.\\n\\n\r\nIt was somewhat \"enjoyable\" until this brain-dead character showed up and went all \"pant pant my beloved roommate, no one shall touch her, and I won't even listen to what the person next to her has to say since everything I assume is true\"\\n\\n\r\nNo logic at all, the guy was attacked, so his system tried to defend itself, then the offender was asking why hes doing that. Like what? No shit, you attacked him, he would do something right? Felt like I was chocking on a bread that had apple like texture while I was watching this supposedly, action, thrilling, breath taking scene.\\n\\n\r\nOverall, I really hate to drop an anime, because I hate stopping something midway, but if I had to stop it out of consideration for my health. Literally, I was about to get cancer had I finished the series.\\n\\n\r\nThere are many anime that have the same plot line with similar characters, but I was able to finish those. However, this anime was the cluster of all those stupid concepts.\\n\\n\r\nBut, if you read others' reviews, people in general seemed to enjoyed this anime.\\n\\n\r\nI'm pretty sure the novel, original story, is good hence that is why the anime was created. BUT,  the people who could not bring out the potential the novel might have, I really want them to rethink their job. Because, they will kill me eventually.\\n\\n\r\nBut, waddayaknow, I'm dumb enough to re-attempt this anime later in my life in the hopes of completing the anime that I started which I regret from the bottom of my heart.",
            "date": "2017-02-28T21:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 241643,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3028049.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JulyL",
                "username": "JulyL"
            },
            "url": "https://myanimelist.net/reviews.php?id=241643"
        },
        {
            "content": "I'm not sure why MAL didn't tag this also as harem, but it probably deserves that tag too.\r\nSo I guess I'll start off with the part that I enjoyed the most from this anime, and it was the art style. Since I'm not an art person, I'm not sure if I'm even using that terminology correctly, but I liked the character designs and how everything else is drawn in general and that was the biggest reason I kept watching.\r\nThe OST was good, there's one track off the top of my head that I really like, but in general while watching I never thought to myselfthat I disliked the OST.\\n\\n\r\nMy one main gripe was that the main character kept getting his limelight stolen from him. I don't need the main character to save the day all by himself all the time, but it'd be nice if he would beat at least one bad guy by himself.",
            "date": "2014-07-14T14:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 151991,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2983005.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ErenxMikasa",
                "username": "ErenxMikasa"
            },
            "url": "https://myanimelist.net/reviews.php?id=151991"
        },
        {
            "content": "*THIS REVIEW FREE OF SPOILERS*\r\nI'm a beginner here so don't expect much from me. I just find this anime by messing with the search function and interested to watch it. Since all of the aspect is awesome, I don't hold it back now.\r\nStory 9/10\r\nI like the story but some part are make me disappointed, really disappointed. But I like the fight part, it like written very good. And I also didn't really bothered by fanservices, I just enjoy all of it. Not many complains from me for the story but I hope they write the story more better if they want to make second season.\r\nArt10/10\\n\r\nThe art is so nice, I never seen any art like this before, it just like very colourful and the character is nice, even some scene the character hands, or legs, or maybe head is ugly, no complain from me anyway.\\n\\n\r\nSound 10/10\\n\r\nOP and ED of this anime isn't very bad, I ever saw more worst OP and ED anime. The character voice is nice too, the fight scene sound is nice too, well no complain from me either.\\n\\n\r\nCharacter 10/10\\n\r\nCharacter development is very important here, but I not very bothered to score it though. But I didn't have any complain so let's move on.\\n\\n\r\nEnjoyment 10/10\\n\r\nYeah, you can say I really enjoyed this show. When I watch some episodes last day, I just thought \"Am I force myself to watch this?\" and after I completed this, I got the answer, it was no. I didn't force myself anyway, I just enjoyed the show.\\n\\n\r\nOverall 10/10\\n\r\nNot much I gonna say here but I really like almost all aspect of this anime, so I think this will be enough, so see you later.",
            "date": "2015-12-08T06:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 205029,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802833.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZinxSter",
                "username": "ZinxSter"
            },
            "url": "https://myanimelist.net/reviews.php?id=205029"
        },
        {
            "content": "Strike the Blood is not the typical vampire anime, its not the apocalyptic universe of Hellsing and neither a unity like in vampire knight - it is another mixed approach on the almost untouched franchise.\r\nMy Name is Ryoki and Welcome to my Review of the Anime Strike the Blood. \r\nThis Review may contain minor, not plot relevant spoilers. If you dont like spoilers at all, then please scroll away.\r\nThe Story has you follow the young highschooler Akatsuki Kojou, in the first minutes it appears like everything is normal right? wrong. Akatsuki lives on an island where magical beings from werewolf over vampires towitches exist. In this World there exist 3 uber-vampires which are called Progenitors, naturally as you can take from it - those are incredibly strong and warlords for the vampires. Akatsuki, though still denying it, is the fourth of them and thus also seen a threat for the human world. The Lion-Organisation, a council of specialiced magician, then decides to send her Disciple Yukina to watch him and is allowed to take actions against him should he try something stupid or become a too big threat. The story has an extremely good premise , unfortunately it is very predictible and doesnt have much clever twists - it shines though in emotional situations and fights - so it is very much up to your self to decide if you like it or not. I personally feel that Strike the Blood has about 5 main plotpoints that repeat in each arc:\\n\\n\r\n-Kojou goes to school\\n\r\n-Kojou gets scolded by his teacher/friend\\n\r\n-Yukina tells him that she will always oversee him\\n\r\n-Kojou gets beaten down and drinks blood from a woman beside him and awakens a new familiar\\n\r\n-Kojou says his touching speach and Yukina her catchphrase in harmony with him and they defeat the enemy\\n\\n\r\nAkatsuki Kojou personally is the typical failing highschooler that you know from other animes like Tokyo Ravens' Harutora for example. Beside his powers, that he had mysteriously obtained by the last progenitor - he is one that protects his friends. \\n\r\nYukina on the other hand is our tsundere lead, sent by the lion organisation to  observe Kojou. She keeps trail on him , searches for him when he's in danger and she is a sword shaman. A sword shaman is a shaman that not really supports many spirits but one and naturally she or he uses a bladed weapon like for Yukinas case ,,Schneewalzer'' the magical spear that cuts through all magic. You unfortunately dont get much background in the whole 24 episodes, there are really just a few scenes of kojous and yukinas past while much more things are explained about his friend Aiba and others. If you want to know more about them, you will certainly have to read the wiki.\\n\r\nThe Art in Strike the blood gives you a wild ride, certainly. I loved the amazing fights and also the use of magic.My most favorite part is the angel transformation itself it is scary and also impressive - just as it would need to be. While I'd wish that the sound would be as good as the artstyle, it unfortunately lacked a lot behind , there was just a few times where there was real tension while the others just seemed to be simplistic.The first opening did its job well but the second one didnt seem a good choice to me, i wished it would have been a much more epic one.\\n\\n\r\nBased on my opinion on story, art , sound , character and overall enjoyment -i issue Strike the blood a solid 7.\\n\\n\r\nBetter Stream it and wait before buying it , until you know that you really like the anime.I hope this review could you help with your choice a little.",
            "date": "2014-12-07T13:03:00+00:00",
            "helpful_count": 8,
            "mal_id": 171355,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3791925.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RyokiJurushi",
                "username": "RyokiJurushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=171355"
        }
    ],
    [
        {
            "content": "The tags \"Action, Ecchi, Fantasy, School, Shounen, Vampire, Supernatural\" actually summarize the show pretty well, with the exception of \"school\" perhaps. If you want to watch a normal guy who stumbles upon ridiculous powers and then proceeds to save the world and get a lot of female attention; then here you go. \r\nOne of the things to appreciate here is that what you see is what you get. It's a straightforward anime you can get some escapism/ good sequences out of (be them of the girls or of the action). I also think that the first few episodes are quite representative of the series asa whole; so your interest should be fairly easy to gauge early on.\\n\\n\r\n-Story\\n\r\n7/10 - as expected, the story isn't outstanding, it simply does its job here. Strike the blood's strong point is not going to be its plot. The story works in arcs, with new villains/ girls being added or focused on in each arc. There are some overall trends and developments but its nothing special. I'd call it overly simplistic - however actually for a show that I watched to just distract myself for an hour or so I found this to be a positive. I'm not sure if some of the satire or irony that came across was intended, but if it was then I tip my hat to the writers.\\n\r\nThe story does work for the genre(s) in mind here - pretty much the plot will be bent to better accommodate scenes where Kojou can be a hero or save the girl or can get into a better fight. But that's fine because that's why people will watch the show in the first place.\\n\r\nWithout wanting to give too much away, I think certain plot devices were quite clever. Overall I think the plot serves its function quite well, but because the plot is obviously going to be side-lined in such a series there is a limit to how good it is.\\n\\n\r\n-Art\\n\r\n9/10 - Probably the anime's best point is the art. The characters designs, as well as the background and effects for fights, etc. are well done and ultimately are very effective. The art style is certainly easy on the eyes, and the sequences often fit the anime well.\\n\r\nI can't really think of many negatives here - perhaps some money was saved on certain designs but in my opinion the art here almost makes the show.\\n\\n\r\n-Sound\\n\r\n7/10 - Like most modern animes, there really isn't much to comment on here as its just simply decent. I thought the OPs were fine, as were the endings. They are not something I'd personally want to listen to outside of the show, alongside the background music, but they contribute pretty much as you'd expect them too.\\n\r\nThe voice acting here is good as far as I can tell. Kojou isn't meant to be super charismatic so it fits the plot, but its nothing to write home about.\\n\\n\r\n-Character\\n\r\n6/10 - The characters are ok, given that the pretense of the show is to break character models and focus on action and harem.\\n\r\nKojou is (axiomatically) fairly likable and for most people easy to relate to. This is no surprise given the escapism theme (/self insert theme). I don't particularly like Kojou, and I found him a bit overly simplistic. But the fact that I have an opinion is evidence for him actually having a character (which is more than can be said for certain animes in similar genres).\\n\r\nThe girls are all quite distinct and well developed, apart from their at times inexplicable devotion to Kojou (but then again, harem). I think Himeragi Yukina probably has the best developed character, and she actually has some development/ perspective added, although this is also stunted because of the harem nature of the show.\\n\r\nThe villains are, in general, awful and almost completely one dimensional. But it doesn't really matter because most of the time they are on screen they just get destroyed by Kojou.\\n\\n\r\nTl;dr - it's harem, don't expect interesting or insightful characters. For a harem, the characters are ok.\\n\\n\r\n-Enjoyment\\n\r\n8/10 - Although the show has its flaws, its quite good fun to watch, and I found it a nice contrast to studying. Because of the art and arc-type plot, it's something that could quite easily be re-watched or returned to, which is a positive IMO.\\n\r\nI would say that your enjoyment of this anime is very dependent on how much you enjoy action and/or harem and/or supernatural genres. The Kojou/Yukina relationship is ok to follow, but this is not a romance anime, and it's something I'd recommend watching when you want to have a break rather than something to stimulate your brain.\\n\\n\r\n-Overall\\n\r\n7/10. Again, the art, the escapism and the straightforward nature of this show are its strong points. It's generic, but I'd say it beats most other shows in similar genres. Why? There's nothing that groundbreaking, just a few subtle nuances that go unnoticed individually but actually contribute to making this show quite enjoyable. Unfortunately the show does fall flat on its face at times for taking itself too seriously and shoe-horning itself into arcing episodes, where it probably had potential to be a better overall show if it avoided this. As is, it remains something lighthearted that most young guys will probably enjoy once or twice (if you enjoy the first few episodes, you'll enjoy the rest. Despite the flaws, there is something to be appreciated here.)",
            "date": "2014-05-07T16:27:00+00:00",
            "helpful_count": 173,
            "mal_id": 142619,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/afterwards",
                "username": "afterwards"
            },
            "url": "https://myanimelist.net/reviews.php?id=142619"
        },
        {
            "content": "It’s not hard to figure out what Strike the Blood might be about at first even if you’re coming into the show completely fresh. The key words are ‘blood’ and ‘strike’ where the latter is when our main male protagonist Akatsuki Kojo does his mojo to satisfy his blood lust. There’s hardly anything too original related this series. After all, we get the typical mysterious guy meets young girl in a city on an ordinary day. Then, a not-so-normal event happens and the duo gets caught in events they didn’t think could get both involved. But if we add everything together, Strike the Blood comestogether as a little more than a show to induce nosebleeds. \\n\\n\r\nStrike the Blood is an animated series based off the light novel of the same name written by Gakuto Mikumo. This is not his first work as he has previously been involved with series such as Dantalian no Shoka, the Zettai Karen novels, and Asura Cryin’. What he brings into Strike the Blood has a little taste of all of those elements in his previous works but transform it into a meat package – a series with a main protagonist that feeds off of others to control its users’ familiars. \\n\\n\r\nAn anime series involving with vampires. That’s hardly original in any sense either with its generics. There’s plenty of anime that followed similar ideas such as Vampire Knight, Karin, or Blood+. Strike the Blood takes our main male protagonist Akatsuki Kojo and makes him into a big name in a big city. For instance, most people who knows about his origins and status as the Fourth Progenitor, the world’s strongest vampire. As the title strikes both a bit of fear and respect, it’s no surprise that he is a man to take notice of especially for his observer, Yukina Himeragi. For the duo, their relationship begins kicks off with a rocky start loaded with misunderstandings, confusion, and animosity. Given the fact that Yukina’s job is to observe Akatsuki makes their relationship seem even more awkward as the former would be labeled as a stalker in some ways. At the same time, Akatsuki becomes annoyed by her presence. It’s also not exactly the best combination with Yukina’s anti-progenitor spear always on hand. It seems to serve as a warning sign should Akatsuki goes out of control. Over time however, the duo gets along better with Yukina even developing a seemingly crush on the young man. Outcomes like this should not be taken as a surprise however. While the duo lacks strong chemistry, they share a similar feeling towards those they encounter and the city they live in. It’s through their willingness to help others that ties them together to make the duo stronger.\\n\\n\r\nBased off a light novel series, the series divides itself in arc format with a certain set of episodes focusing on a specific event/character/conflict that requires a solution. In total, there are 7 arcs covering the light novels. More importantly is the fact that each arc focuses on a different character with a different otherworldly conflict. It brings out the diversity that the audience can get accustomed to. There’s all types of otherworldly beings that the show focuses on whether it’s vampires, werewolves, angels, or witches. Along with that, each arc also progresses Akatsuki’s relationships with others as he gets stronger. Unfortunately, his lack of characterization doesn’t shine with his past being left in unexplored territories. This falls under a similar case for Yukina as the audience hardly knows about them beyond their purpose on the surface. Other characters of course also plays their roles in each arc, some more than others with a particular few getting veritable moments. But because each arc changes its tone, audience should be ready to adjust themselves to match the mood with its themes. There might also be some sort of hidden moral that progresses the story although most of it is obscure and seems cliched . Unfortunately for Akatsuki, there’s little focus on his goals or morals as the show itself doesn’t give an impression as if it he had one at all in the first place. With the way he is dressed. Akatsuki is more of the lone wolf and he only gets into situations because of his status. \\n\\n\r\nWhile the word ‘diverse’ can be used to describe a favorable stance to adapt an anime’s character cast, there is also generics that makes up the other half. The majority of the main characters are female that falls under some sort of characteristic that comes off as generic as it can be. We have Yukina, the girl that observes Kojo 24/7 as her role. There’s the typical classmate Asagi Aiba with an obvious crush on Kojo. Nagisa Akatsuki plays the role of the little sister with her chatty mouth but lack of understanding of the supernatural world. Then, there’s the tsundere Sayaka Kirasaka whom often says things that means the opposite way around. Each arc also features a prominent character that is the focus of its story. Most of them are always female and shouldn’t be a surprise with a show like Strike the Blood. It’s predictable with most endings of each arc with Akatsuki doing the striking and blood spilled for authentic reasons. \\n\\n\r\nThe action of Strike the Blood can be described as thrilling but not anything that blows itself out of the water. If I had to describe it, it would fall under the line of dangerous but also hectic. Each arc features a different conflict so the action tends to diverse itself a bit in terms of presentation. However, one key factor always strikes at heart with Akatsuki’s blood lust. The earlier stages plays it off as a necessity but later on ventures into a more erotic allurement. It shouldn’t be surprising at all with hints given already featuring its fan service moments. There’s the pantsu, honey trap, and misunderstandings all over the place that brings out Strike the Blood’s generics to its core. Surprisingly enough, the show omits the traditional onsen/beach episode. Perhaps it was too busy focusing on its conflicts in each arc to given our characters a vacation or it wanted to go beyond its setting. Who knows? What it’s known is the fact that Akatsuki always gets his fun (not the way he sees it though) in each and every single arc. Fun itself can also give the audience different impression. The show sometimes likes to make fun of itself with little gags. Even the organization Yukina belongs to is hard to take serious at first with a name like “Lion King”. We also can’t forget about some of the dialogues that comes out in the wrong way with most coming out as cheesy. Finally, there’s also bits of romance. Unfortunately, that territory is something Akatsuki seems to have the least interest in. Despite obvious advances, Akatsuki doesn’t seem to show actual interest in any of the girls that approaches him besides satisfying his blood lust. Every meal means he gets a little satisfaction but not in a romantic sense. If you’re looking for a developing romantic story, Strike the Blood is the wrong place to be. Akatsuki is just not a bachelor for his candidates.\\n\\n\r\nSilver Link animated Strike the Blood. On a technical level, the style of the series fits well with its supernatural themes. The Demon District, Itogami City also gives off an impression of aspects with its advancing arts. Most otherworldly beings are depicted accurately with credibility. Unfortunately, some of the character designs lacks a bit with any unique features. The school uniforms looks generic and hardly stands out. Akatsuki’s design makes him look like a loner with his hood covering his head that viewers will feel less attached to. Other characters such as Nagisa Minamiya has appearances that contrasts their age. Supporting main characters are also hardly noticeable despite some of their status. On the other hand, the background art of its city gives an impression of a luxurious display with its aquatic-like attributes.\\n\\n\r\nSoundtrack can come off as a mixed bag. On the surface, it is consistent to match its style. But at the same time, it can come off as just being there with nothing to focus directly on. The OP and ED songs offers a montage of the main characters as well as possible foreshadowing. With a show like Strike the Blood though, the arcs can be predictable already anyways. But for what’s worth, most of the characters’ voice acting is remarkable. The only sting is the dialogues themselves that comes off as cheesy and lacks distinguishing moments. However, I do give praise to their voice mannerism especially for Yukina (Risa Taneda). Even though she just began recently with animated voice acting, there’s promising potential for her with a role of a main character.\\n\\n\r\nIn the end, Strike the Blood is another typical series with nothing stellar that strikes hard at home. It has its harem vibes, the fan service, the gimmicky gags, and predictable arc conclusions. However, it does bring out a diverse cast of characters that offers attention. Not only that but Akatsuki isn’t your typical wimpy main lead. He often takes charge despite not like being part a conflict. If only the show focused on him more rather than adding a girl to his harem every arc would bring out much more potential. On the other hand, each arc does have potential with its diversity. While some of it is colored with gags, it does progress the story’s overall themes. It could take a bit of patience to get used to this show overall in the end but that’s how it is really.\\n",
            "date": "2014-03-28T19:04:00+00:00",
            "helpful_count": 101,
            "mal_id": 137623,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=137623"
        },
        {
            "content": "​Thunder's Review no.4: Strike the Blood\r\nI followed this anime whole way down to the hell where it have ended. Much virgin blood was sucked and a lot of underwear exposed. Occasionally I enjoyed the ride but the road was rocky and full of holes. Those holes were full of predictable randomness not seen in ages and suited final destination perfectly. Welcome among all these vampires, witches and loli teachers, this is Strike the Blood. \r\nThe Story 2/10\r\nThe best way to describe this show is simply saying that it's a harem with vampires and magic. Beginning is generic but fairly interesting, there was some space fordevelopment but all hope for the good story is quickly washed away in a couple of episodes. The world that could be interesting setting with different vampire lords and organizations controlling it is never explained to us and all we see throughout the whole series is one city.\\n\\n\r\nOur protagonist is of course your typical high school student who accidentally happens to be the strongest vampire in the world, oh and there are a lot of girls falling for him just because he's a nice guy. And do I have to mention that Itogami City that he's living in is a place that all demons are sent to to live in \"secret\"?(weekly destroy the city and a lot of explosions scenario)There is nothing outstanding and even decently original or interesting in the Strike the Blood's story, actually there is no plot! All plot lines are resolved in the series of short arcs, few episodes long each. Episodic nature at least suit Strike the Blood as a one time per week time waster. I doubt that I would care to watch something with no overall plot, episode after episode constantly.\\n\\n\r\nOkay so we know that there is arguably no plot, then what's with those episodic arcs? Well, this is old shounen formula done even worse than usual. Villain of the week appear, our main character can't bit him but then just get power up by turning his vampire urges on and sucking blood out of the one of attractive girls in the show (read, any girl in the show). It ended with me just waiting for some girl to undress and be done with it. It was funny first time but seriously EVERY time?! The only times when you'll be surprised will be those moments when they introduce new characters or threats to the city. I doubt I've ever seen such a random plot twists. There is absolutely no foreshadowing, everything is just thrown at you without warning.\\n\\n\r\nStrike the Blood doesn't handle its more serious plot twists well, actually when serious stuff  is happening your only motivation for keeping watching is another ecchi moment or some short fight scene. Fight scenes can be fairly enjoyable, at least at the beginning, but there is barely any tactic involved and all characters are just screaming names of their insane shounen attacks again and again and again... Overall I think that best parts of the show was those that nothing happens in and all the characters were just fooling around. Seriously, comedy parts were the only think I was interested in and every week I prayed to myself for as much of it as possible.\\n\\n\r\nI don't want to spoil wonderful ending for you, just know the word that describe it best: random.\\n\\n\\n\r\nThe Animation and the Art 6/10\\n\r\nAnimations in Strike the Blood are fluid enough, especially in fight scenes. Characters are well drawn and there are some really attractive girls out there if you're in for that kind of stuff. Some backgrounds may be call beautiful and overall animations and art stands on more than decent level, but is drowned down by some cgi. What this anime misses is original art style, especially on characters. There is nothing that make me remember how characters looked. I can barely remember which girl had which hair style. On the other side you usually doesn't remember pretty girl from the porn video you watched so I guess it's fine.\\n\\n\\n\r\nThe Sound 6/10\\n\r\nBoth openings were ok, at least when it comes to watching them once per week. Overall soundtrack wasn't bad and was kind of nice background music but nothing more than that. There was no tracks that stand out enough to make me listing to them afterwards, I'm sad every time it happens. Music is very important part of every show and this anime really needed something to make up for the random story. Sadly music wasn't this something.\\n\\n\r\nAs far as voice acting goes I don't have anything special to say about it, it wasn't bad but I heard better.\\n\\n\\n\r\nThe Characters 4/10\\n\r\nIn show with such a troublesome plot there should be great characters to make up for it. When characters in Strike the blood aren't worst I've seen, they are not that great either. Our main male lead, Akatsuki Kojou is fairly likeable but also fairly generic teenager that a lot of girls are falling for just because he's a vampire that sucked their blood. There is also our main female lead Himeragi Yukina. She can handle herself in a fight and are ready to beat up Akatsuki every time he do some perverted thing he haven't actually done. There are of course few other girls that are there to interact with Kojou in interesting ways (\"cough\", fanservice). Some characters have interesting backstories to them when others have almost none. We get to know most things about most secondary character within duration of few sentences. So basically we don't have a reason to care about most characters in the show.\\n\\n\r\nOur main cast get some simple character development, but it's very slow development and by the show's end characters aren't much different than by its start.\\n\\n\r\nI guess all characters do their job as plot devices, even if they are there this whole time to do something important just once. Just don't go in this show expecting some interesting individuals with their own ideologies that actually makes sense. Villains are unworthy of mentioning. When the biggest part of characters are mediocre, villains in this anime are below that standard. Their goals are simple and simply evil. At least we have decent quantity of attractive girls to look at.\\n\\n\\n\r\nThe Enjoyment 5/10\\n\r\nWhen Strike the Blood doesn't try to be serious it's actually quite enjoyable. Too bad that it didn't have more comedy or maybe some overall plot but I guess it would not work with that sort of show. There is nothing outstanding about it, soundtrack and animations are just decent. You can still probably like it more than I do if you really like anime stereotypes and you didn't grew tired of them yet.\\n\\n\\n\r\nOverall 4/10\\n\r\nStrike the blood is rather mediocre show that failed when it counts the most. What we got is vampire teenager with harem of girls, a lot of anime stereotypes, good comedy that was a light in the dark in this show, messy \"plot\" that ended in a very random way and a group of rather weak characters. It wasn't worst thing that I've seen and sometimes you need something mediocre to appreciate better works.\\n",
            "date": "2014-04-02T10:48:00+00:00",
            "helpful_count": 60,
            "mal_id": 138327,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3497631.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Kaminari-sama",
                "username": "Kaminari-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=138327"
        },
        {
            "content": "My expectations for Strike the Blood were simple: I wanted lots of action with some romance thrown in. Instead, I feel like I got the opposite. Overall, I was disappointed in some areas and pleasantly surprised in others. Though I don't regret watching it, I wish the show had only 12 episodes instead of 24.\r\nStory: 6\r\nTo put it simply, the story for this show is mediocre. It isn't outstanding, but nor is it bad. It simply fulfills its duty to carry along the main premise of the show, which focuses more on the relationships between characters (primarily, of course, between the leading hero Koujo andthe ladies).  The show is divided into several arcs, which range from 2-5 episodes long. After the first few arcs, a general pattern of events begins to emerge and repeat itself. Though this has no real severe implication on the show, it does make it a bit predictable.  \\n\\n\r\nThe only significant issue I have with the plot is that it never addresses the circumstances in which Kojou becomes the Fourth Progenitor. Though it is mentioned several times in the show and there are a few short flashbacks, the questions surrounding Kojou's mysterious transformation are left unanswered--though I suppose that if there's a possibility for a second season they could be answered then. \\n\\n\r\nArt: 10\\n\\n\r\nBy far the best thing about this show was the art.  Very crisp, exciting animation, with exciting colors and fantastic fight choreography totally fulfilled my expectations.  Character designs were spectacular, the magic was interesting, and the scenery was beautiful. \\n\\n\r\nSound: 7\\n\\n\r\nThe sound was not particularly memorable. It, like the plot, fulfilled its purpose, though unless you're paying attention, it's not very noticeable.  The OPs and endings were fine, but not anything out of the ordinary.\\n\\n\r\nCharacter: 5\\n\\n\r\nThe characters in a romantic show, especially a harem, are its driving force, and I feel like this is where Strike The Blood's mediocrity prevails. \\n\\n\r\nI found the main character, Kojou a bit two-dimensional and simplistic.  He was likeable, handsome, decent, heroic, and pretty much everything a good (but not particularly interesting) protagonist should be. He had only a few minor flaws, leaving little room for character development or improvement.  \\n\\n\r\nThe girls in the show, however, are a different story.  Their personalities are more clearly defined and more developed than Kojou's, and they don't really follow archetypes, so they're certainly more interesting. Himeragi, the female lead, is the most developed, and she undergoes the most noticeable character development in the whole show.  \\n\\n\r\nThe one thing that bugged me most about the girls, however, is that no matter how smitten they were with the main character, they constantly berated him, calling him an indecent pervert even in situations that are totally out of his control (this is especially true of the main female character, Himeragi.) Though I can understand that this was meant to be comedic relief, hearing \"HENTAI\" screamed in various high pitched girly voices episode after episode starts to grate on one's nerves. \\n\\n\r\nSupporting/side characters were incredibly bland.  For example, Kojou's male friend with headphones was so underdeveloped that those are the only two things I can  remember about him. A few side characters, like the First Progenitor, could have been really interesting, but they were sort of put on the back burner to all of the romance going on.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nThis is the sort of show I'd recommend to someone who wanted to shut off their brain for a while, watch some cool magic, and see a couple panty shots. It certainly wasn't bad, and I can't say I disliked it, but overall, it fell straight into the mediocre category.",
            "date": "2014-07-03T21:45:00+00:00",
            "helpful_count": 59,
            "mal_id": 150243,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3088041.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MachinaEm",
                "username": "MachinaEm"
            },
            "url": "https://myanimelist.net/reviews.php?id=150243"
        },
        {
            "content": "Based off the light novel was written by Gakuto Mikumo, \r\nThe story tells us a boy named Akatsuki Kojou, that turns out to be The Fourth Progenitor, the world's strongest vampires in the world. He was followed by a girl named Yukina Himeragi, who came from the Lion King organization to observe the Fourth Progenitor.\r\nI found out the two lines above really offers me a unique set-up of an anime,  and the genres \"Action+Ecchi\" really offers us a combination of a real action and a desirable fan service. But not the story.The plot is divided into several simplistic arcs, that actually works with theentire series. The problem of Strike the Blood is the poor story execution that turns out to be a dull for someone who doesn't really into Action or Ecchi genres.And to make things worst, there are some plot holes about how Kojou become the Fourth Progenitor too. Besides that, some people may think Strike the Blood is cool, and some people maybe think it's one of those typical Harem that ruins their senses, but in the reality, it has a decent story indeed.\\n\\n\r\nThe most precious diamond that lies in the anime is the Animation , like almost every modern anime in this era, they all offers us a great animation. We have a catchy and clear art, with an amazing visual effects and fighting scenes. It's really the main attraction of the anime itself.\\n\\n\r\nThere is not much to talk about in the sound section, but I found my heart racing when hearing the 1st opening song \"STRIKE THE BLOOD\" which sung by Kishida Kyoudan & The Akeboshi Rockets. Meanwhile, the 2nd opening song, & the endings is decent. The seiyuu did fairly well when bringing such character to the screen.\\n\\n\r\nWell, most anime have a serious problem on the character section, Strike the Blood is the perfect example of it. In the early episode of the series, Strike the Blood really promising us a meaningful development.\\n\\n\r\nBut the reality didn't accept that wish, there is no meaningful development that grows. The only thing we have is a simple division character.In the main character, we have our male lead Akatsuki Kojou, the Fourth Progenitor. And since the Fourth Progenitor is the strongest vampire in the world, of course there is no trouble when Kojou faces the enemies by himself (Notes: He sometimes really weak and then get helped by his own harem). Then, beside our male lead we have a collection of girls that fell in love with our male lead, the male lead gain strength by drinking the virgins blood. With that combination ahead of us, the characters became a real messy. And besides that, most of the enemy is doesn't get a development because they all defeated by Kojou in the end of the arc. \\n\\n\r\nAlthough Strike the Blood has some mistakes in the execution, I found the title itself memorable in my brain. Since this is a Shounen anime, women may not found this anime interesting. It is recommended to those who prefer action than story and prefer fan service than development. Overall, it is decent and fairly enjoyable....",
            "date": "2014-12-10T04:42:00+00:00",
            "helpful_count": 45,
            "mal_id": 171653,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=171653"
        },
        {
            "content": "\"This is my fight!\" \r\n\"No, this is our fight!\" \r\n- Akatsuki Kojou & Himeragi Yukina, respectively; dialogue from perhaps every episode of the entire anime.\r\nAnd by the end of the series, I have realized that it was my fight as well - I had to fight the urge to drop the series as a whole. The story begins with the main character, Akatsuki Kojou, who is the epitome of the standard harem protagonist. He is forced to accept his new found vampire powers and the misunderstandings that come with it, misunderstandings meaning a flock of girls including the main heroine, Himeragi Yukina. It is thestandard harem/ecchi/supernatural anime. And yet the anime leaves so much to be desired.\\n\\n\r\nStory: 5/10\\n\r\nThe story teeters between explaining too much and answering too little - the anime quite frequently drops embellished familiar names one after the other, while shying away from actual plot background. At the end of the anime, we are left with snippets of Kojou's vampiric origins, an uneasy plot device, and a flimsily assembled \"conclusion\" that abruptly ends the show. \\n\\n\r\nArt: 7/10\\n\r\nThe saving grace of this show. The fights were appropriately coordinated, well drawn, and were exciting to watch. The characters looked pretty in all but the budget scenes (which were sporadic but easy to point out). \\n\\n\r\nSound: 6/10\\n\r\nThe soundtrack was decent, despite the fact that it seemed like the entire show had only maybe three or four OSTs not including the OP and ED. It did its job and did not detract from the show. \\n\\n\r\nCharacters: 5/10\\n\r\nEvery character fell flat and did not stir a sense of personality. Kojou's interaction with every single girl can only be described as irritatingly futile. From the span of 24 episodes, not once did Kojou feel like he was developing as a character. With perspective to the main antagonist, his main reason for being is that he was adequately bored enough to become a villain. I found myself only drawn to liking one character, Astarte, if only because she was purposefully written as one dimensional and not an irritating mess of a character.\\n\\n\r\nEnjoyment: 6/10\\n\r\nBy the end, I was left with more questions than I had when I started the anime, a puzzling sense of confusion, and slight relief that I don't have to watch Strike the Blood anymore. The fight scenes were pleasant to watch but I cannot say the same for the rest of the show. The comedy was bland, the fan service was blatant and mediocre, and the potential harem/romance was forced at best.\\n\\n\r\nOverall: 5/10\\n\r\nA good anime to watch when you have more free time than you wish you had. A must-see if you're a fanatic of exceedingly mediocre anime with fan service, jumbled fantasy plots, and underdeveloped characters.",
            "date": "2015-06-26T02:57:00+00:00",
            "helpful_count": 26,
            "mal_id": 191301,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4695260.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/paoya",
                "username": "paoya"
            },
            "url": "https://myanimelist.net/reviews.php?id=191301"
        },
        {
            "content": "I REALLY NEED TO WRITE A REVIEW FOR THIS ANIME, BECAUSE IT HAS REALLY GOT ON MY TITS. BEAR IN MIND THAT I DROPPED THIS AFTER FINISHING EPISODE 12.\r\nStory 7/10\r\nThe actual plot of this anime was interesting, and a new take on something that has been done many times before. The story revolves around the Fourth Primogenitor is the world's strongest vampire, who is a high school boy called Kojou Akatsuki.  The Lion King Organisation send a skilled middle schooler, Yukina Himeragi, to be his observer.  The anime is split up into different arcs, all about four episodes long, and each unveiled newthings about the characters, and wasn't that boring.  \\n\\n\r\nArt 8/10\\n\\n\r\nI really did like the art in this anime, especially during fight scenes.  The character design was good, and it was quite cleanly drawn (I hate when anime has a messy looking art type, you feel).\\n\\n\r\nSound 8/10\\n\\n\r\nI really loved the opening theme, like damn.  I feel that was one of the only things that kept me going for so long. The ending was good too, however, although the music during fights/emotional scenes was satisfactory, it wasn't exactly epic, so I give it 8.\\n\\n\r\nCharacter 5/10\\n\\n\r\nNOW HERE IS WHERE THE ANIME COMPLETELY FAILED FOR ME.  At first, I was like, okay, I like Kojou, I like Himeragi, this is cool, I hope they get together, etc. Then suddenly there was another female character in love with him.  Then another. Then another. LIKE JESUS CHRIST, CANT WE HAVE ONE FEMALE CHARACTER WHO ISNT IN LOVE WITH HIM?? Not only that, these characters weren't even that well developed in my mind! Sure, they all had backstories, but there are so fucking many of them, that the writers can't actually go properly into any of them!! Jesus Christ. I couldn't deal with it.\\n\\n\r\nEnjoyment 4/10\\n\\n\r\nAll the points mentioned in my characters review section took away at least five points.  The other one point probably came from the fact the anime just isn't what I usually enjoy. The whole character stuff really ruined the whole anime for me basically.\\n\\n\r\nTherefore, my overall rating for this anime is 6/10.  If you enjoy watching a ton of female characters all be so caught up on this one guy so often, then you might like this anime.  I guess I would recommend it to fans of action, and vampire anime too.  \\n\\n\r\nTry the anime for yourself instead of deciding not to because of this review or anything.  I'm just really picky with anime. \\n\\n",
            "date": "2014-02-10T10:31:00+00:00",
            "helpful_count": 21,
            "mal_id": 132143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3437689.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pyrospyr",
                "username": "pyrospyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=132143"
        },
        {
            "content": "I am very disappointed with this anime. The story does not connect at all and each episode they just make up crap and make the main character overpowered as fuck when all he does is slouch around all day and getting turned on by lolis. The other main character Himeragi is just a total tsundere (in my definition they are just annoying, stubborn, impulsive, bitches) and blames everything on Akatsuki for things he doesnt do like being friendly with another girl she act as if they've been married for 40 years and he cheating on her when theres no chemistry. Also they are copying ideasfrom other animes which make them cliche not to mention how childish it is. If an admin reads this please change the rating to 10 years or younger because this is worse than Devil Survivor 2 (most cliche anime ive seen other than fate/stay)",
            "date": "2014-02-23T21:29:00+00:00",
            "helpful_count": 20,
            "mal_id": 133687,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3489015.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Lebrando",
                "username": "Lebrando"
            },
            "url": "https://myanimelist.net/reviews.php?id=133687"
        },
        {
            "content": "\"This is my review,\"\r\n\"No senpai, this is our review!~\"\r\nOkay, okay, Yukina. I get it, I get it. This is OUR review. -COUGH- Ahem.\r\nAnyway, let's get down to business. How do I describe Strike The Blood? I feel Strike The Blood was one of the best animes this winter. While other people found it quite mediocre, or annoying at times. Which, yes, I do agree that line did get annoying but I was able to ignore it because the plot drilled me into the series.\r\nI've enjoyed the character growth within the show. Some characters are unfortunately hated, but I'll give a summary of why I enjoyedthis series.\\n\\n\r\nYou have Kojou Akatsuki, the male protagonist. Who is a vampire, he struggles every day life whether it is selfish or not to keep living a normal life then he gets wrapped up in dangerous things. I felt like his character grew with Yukina, while a lot of people may hate her but the reasons for her behavior is quite reasonable in my opinion; considering she didn't know how to socialize or know how to act like a normal human being. She was able to understand more being around Kojou.\\n\\n\r\nI also enjoy the fact that this series didn't just FOCUS on Kojou and Yukina. I found the other cast got a decent amount of screen time as well. There wasn't many characters that annoyed me except for one, but I liked the consistency of the show; while the show has been done many times and isn't completely original. I loved the fact that Yukina wasn't in the same school as Kojou just to observe him, she was in another school. I would go into more, but I don't want to spoil for those who haven't gave it ago. This was just a fun series to experience this year; that made me want more and more.\\n\\n\r\nSo for the story, I will give an 8. Only because, I feel like there is a lot of things missing that need to be answered. This score will change if there is a second season.\\n\\n\r\nAnd characters I will give a 7, their personalities meshed very well with the series and I loved how they all interacted with each other. It's like you can feel part of their group. I also enjoy the fact all of them got a good amount of screen time, though I wish Motoki got a little bit more than he had. He was amazing, and I can't stop thinking about Alvin from Tales of Xillia when I look at Motoki. I swear, those two look alike. OKAY, OKAY, back on topic. XD. I just hope if we get a second season, we'll get into more details about everyone's past lives since with the series being rather short and with so much going on, they didn't have time to fill in gaps about their pasts. This way I can really understand the characters at their full potential.\\n\\n\r\nThe art was crisp and clean, it was pretty to look at. However, they could've done without the green outlining or bright colors that may hurt the eyes at times. I think that was my only beef with the art other than it looking pretty. So I will give the animation a 8. Only because the animation sort of looked blurred at times which I hope they fix in the next season if there is one. I don't know how well the sales have been for this series, but I do plan to buy so it can work its way into a second series.\\n\\n\r\nI found the sound tracks amazing, mainly the opening and endings. The sound track itself wasn't really memorable except when shit was about to go down. I only liked some of the soundtracks; so the sound I will give a 7. \\n\\n\r\nEnjoyment? Well, what can I say? It was a fun ride while it lasted. It was sad to see this series end. I've written a review about this show before but unfortunately my comment had gotten removed so I am rewriting this. My overall enjoyment was 9.\\n\\n\r\nI've already gave a review how I felt about the characters and another thing I like to add. I like how there wasn't TOO much fighting over the main male; and that Yukina didn't beat him up all the time, she scolded him yes a couple of times but she didn't take it too far like most tsunderes do. So I give Yukina quite a lot of props. I enjoyed that she didn't question much of Kojou and instead, trusted the guy. So despite what people may say about Yukina, I give her quite a bit of respect than most main females. Although, my main favorites were Sayaka and La Folia. : D OKAY,BEFORE I GET TOO RAMBLING ABOUT THIS ANIME.\\n\\n\r\nOverall, I give it a 9 out of 10.\\n\\n\r\n-v-\\n\\n\r\nForgive me, I suck at reviews. :'D\\n",
            "date": "2014-08-19T17:32:00+00:00",
            "helpful_count": 19,
            "mal_id": 157175,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2088817.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShionxChan",
                "username": "ShionxChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=157175"
        },
        {
            "content": "\"This is our fight\" - Yukina Himeragi\r\nNow, we're down to the last 2-cour fall anime I watched \"Strike the Blood\". This anime is produced by Silver Link who produced the comedy \"Baka & test\" which I enjoyed a lot. This anime is directed by Hideyo Yamamoto.\r\nSTORY (5):\r\nThe story follows Akatsuki Kojou, who became the 4th primogenitor, 3 months ago, after the original spirit of the 4th primogenitor come into Kojou's body. The 4th primogenitor is said to be the strongest vampire in the world and is accompanied by 12 familiars. When the government and Lion King organization received news on the 4th primogenitor, they ordereda Sword Shaman known as Yukina Himeragi, to find the 4th primogenitor and take the 4th primogenitor down. \\n\\n\r\nThat's basically the intro of the story, and what you're going to expect from there on are a bunch of misunderstandings, action scenes and wacky situations in soon.\\n\\n\r\nThe story covers 7 chapters of the light novel. In fact, I researched that the light novel has 10 chapters. \\n\\n\r\nThe story starts off as interesting but as each chapter goes by, it keeps going more downhill. It is due to the fact that too many characters are introduced. I will get to the characters section later.\\n\\n\r\nART (6):\\n\\n\r\nThe character designs are good and the animation is good. In fact, the action scenes are cool. \\n\\n\r\nSOUND (6):\\n\\n\r\nI liked the 1st and 2nd opening. The 1st opening is the name of the title itself. It was sang by Kishida Kyodan. The 2nd opening is \"Fight 4 Real\" by Altima. the 2nd opening is very energetic and lively. I also liked the 1st ending \"Strike my soul\" by Yuka Iguchi especially the 2nd ending \"Signal\" by Kanon Wakeshima. The 2nd ending \"Signal\" has a more relaxing and smooth tone than compared to the other songs.\\n\\n\r\nCHARACTER (4):\\n\\n\r\nThe biggest downfall with the show is the characters. The characters are real but they did not have enough depth to them. The problem with the anime is that every chapter, they introduce many characters. Because of that, the value of the character diminishes. It is just like in a workplace, if there are too many people in the workplace, the work and productivity gets less and less.\\n\\n\r\nMost girls like to bang on Akatsuki Kojou like Yuuma, la Folia and even Sayaka.\\n\\n\r\nAsagi Aiba & La Folia are the most interesting characters but sadly, they didn't have enough material for them to work on.\\n\\n\r\nDimitri Vatler was an interesting character but sadly he didn't have much time for his development.\\n\\n\r\nWhen Nina possesses Asagi, Asagi manages to become a better character.\\n\\n\r\nYukina Himeragi is jealous when Akatsuki Kojou is around with different girls. Yukina Himeragi says \"Senpai\" just like Mirai Kuriyama from Beyond the Boundary. The difference is that Yukina Himeragi's tone of voice is more serious. Both characters are voiced by Risa Taneda.\\n\\n\r\nSayaka Kirasaka is your typical tsundere. Normally when Akatsuki Kojou does something nasty, she gets angry and hits him. \\n\\n\r\nAre you serious? Why do I see this in most harem anime? When a guy does something wrong, a girl beats him up.\\n\\n\r\nSayaka is the most annoying girl out of the bunch. Normally, tsunderes are my least favorite girls in anime. In fact, tsunderes are the most overused characters in anime.\\n\\n\r\nThis is why I said that the problem with this anime is that it introduces a lot of girls and that these girls have not enough material to work with.\\n\\n\r\nCONCLUSION (5):\\n\\n\r\nSilver Link made a great comedy Baka & Test. But after making \"Strike the blood\", I am starting to worry about Silver Link because they run out of interesting ideas from there. \\n\\n\r\nStrike the Blood unfortunately suffers from the same problem as Sword Art Online in the sense that Sword Art Online introduces too many characters that the value of characters diminish. \\n\\n\r\nIf you want me to care about the characters, you need to work on their relationships rather than introduce too many characters.\\n\\n\r\nThis anime had interesting opening and ending theme. It had great animation. However, the animation and the opening and ending theme didn't save the show. \\n\\n\r\nThe story was cliched especially the characters.\\n\\n\r\nUnfortunately, I didn't come in with a 4 in mind. So, I give this anime a 5 out of 10.\\n",
            "date": "2014-03-27T09:32:00+00:00",
            "helpful_count": 16,
            "mal_id": 137223,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=137223"
        },
        {
            "content": "This is going to be my first review in a long time and sorry for the gramatical mistackes i make.\r\nSo a while ago when the anime was not still out i read the first couple of chapters of the manga.I think it was 6.I liked it soo much and when i heard that a anime is being made i stopped reading in order not to spoil it later.So lets begin:\r\nStory 4/10\r\nThe story starts interesting its about a boy called Akatsuki Kojou who 3 months ago became the 4th Progenitor the strongest vampire accompanied by 12 familliars.Well i expected a overpowered badass main character but itdidnt turn that way.So if you are looking for a such character this is not a show for you.I'm not saying he is weak or wimpy like some other characters but whenever there is a fight that woman (the main heroine) says ,,It's not only your fight its ours\".So we never actualy see him going full power.As the story goes you will find your self more and more bored.One of the problems in the story is that after one arc finishes the second begins right away not leaving any space for the character development.\\n\r\nArt 7/10\\n\r\nThe characters are well desinged and the battles are really well done.Thats about it.\\n\r\nSound 5/10\\n\r\nThe opening and the ending didnt really leave much impresion on me.I guess they were average.\\n\r\nCharacter 4/10\\n\r\nThe problem with the characters is that they are intruduced quickly.I dont even remember the names of anyone of them exept the main guy.The villans were just evil for the sake of it and there wasnt much background for the characters.To put it simply they were there just for Kojou to take blood from them.\\n\r\nEnjoyment 6/10\\n\r\nThe show wasnt entirely bad.If they made a little more efort in the plot and at least made it so that i could at least remember the character names it would have been one of the better animes i have watched.\\n\r\nOverall 5,2/10\\n\r\nWell if you have nothing to watch or a lot of free time i would reccomend this anime",
            "date": "2014-04-06T10:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 138961,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RealityEater",
                "username": "RealityEater"
            },
            "url": "https://myanimelist.net/reviews.php?id=138961"
        },
        {
            "content": "It's so bad, it's good. Seriously I can't get enough of these idiots probably because it reminds me of the good ol' middle school writing days. Though all the character battle monologues makes me want to cry blood. Speaking of characters, they're so flat, they remind me of how humpless my chest is, which is depressing. The only good thing about the characters is they're animated well enough that they could become the golden aesthetic calf of some fangirl club.But in short, they are depressing. \r\nThere really isn't much to say about this series because it's the typical anime. A lot of fan service andthe ecchi is thrown around in the most awkward of ways. Like serious, they will make a girl appear magically on the main character in a vain attempt in being relevant. \\n\r\nIt's disappointing. \\n\r\nSO I'll give you the real. If you're the type to get a kick out of idiocy or you get off on cheap ecchi, THIS is the anime for you. Everyone else should avoid it like a kid with asthma to an approaching dust storm.",
            "date": "2015-11-22T06:57:00+00:00",
            "helpful_count": 12,
            "mal_id": 203944,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4736435.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kofuku-chan",
                "username": "Kofuku-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=203944"
        },
        {
            "content": "So this anime is a typical sort of harem (romancey) action, magic futurey type anime, which sort of reminds me of things like a certain magical index and even rosario + vampire.\r\nSo the good:\r\nIts fun to watch, if you enjoy anime like raildex, or harem action it has the typical funny ecchi scenes you see when the character accidentally does something pervy. It has awesome action with cool magic effects, and its proper action where people bleed and get hurt. \r\nI found the characters quite fun to watch, with varying personalities that you see on a typical harem. The story line had quite a fewarcs, a lot of which are done quite well explaining everything thats going on compared to other anime which either breezes through the story line for the action, or screws up the action doing nothing but story and text. The action scenes also feel really interesting and fun to watch and character development although a little low is quite good.\\n\\n\r\nThe not as good:\\n\r\nThe biggest problem with the anime is how typical it is to others, the action harem ecchi plot is the exact same as you would see in any other harem ecchi action. The character personalities are the exact same as normal anime of that genre and the biggest problem is it doesn't do much different, they attack difficult enemies, theres a few romancey like themes, and its all really the same.\\n\\n\\n\r\nConclusion:\\n\r\nHonestly even though the anime doesn't deviate to others of that particular genre I friggen loved it, it felt fresh and new considering the character personalities are used so much. I was engaged more so in this anime then a lot of others I've seen. The arcs I felt was done really well in the anime, with none of them feeling like they ended too quickly or too slowly except the last one. And its something I really wanted to watch, something where I felt on the edge of my seat, I enjoyed my whole time and nothing too huge happened on the plot that would put me off from watching it.\\n\\n\r\nTLDR\\n\r\nIf you enjoy typical harem, action romancey, ecchi anime with magic, and demons and stuff, you will probably love this anime. If you don't though this anime probably won't be on the top of your list of anime to watch.",
            "date": "2014-03-31T13:50:00+00:00",
            "helpful_count": 12,
            "mal_id": 138109,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2379187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/trustnoone",
                "username": "trustnoone"
            },
            "url": "https://myanimelist.net/reviews.php?id=138109"
        },
        {
            "content": "I found the strong point in this series being the story. In the first few episodes, it was intriguing, and the story was progressing well. It presents a great deal of mystery and potential. The way the characters are introduced is clever, and each episode masterfully presents a captivating theme throughout, and ends with you desperately wanting to know what happens next. Sadly, as it moves on, and the harem aspect becomes more apparent, the story slowly dies. Instead of the action, fights, and moving moments, fan service becomes commonplace. As for character background, the only character with a fleshed out back story wouldbe Kojou. The flashbacks and pieces of his memories seem to evidently hide huge secrets and momentous events, yet the series keeps a veil of secrecy over his past the entire while. As for the other characters, most lacked a back story entirely. Despite being liable to having an enthralling past, the anime seemed to be hesitant to touch on any of it, and when it does, it usually ends with one scene, and never progresses whatsoever. The animation, however, is very good. The movements of the characters don't seem clumsy or unnatural and action is generally fluid. The varying BGM is played at appropriate scenes, and enhances the overall feeling of the scene. Overall, a good series.",
            "date": "2014-11-10T20:42:00+00:00",
            "helpful_count": 12,
            "mal_id": 168155,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4245477.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kaou",
                "username": "Kaou"
            },
            "url": "https://myanimelist.net/reviews.php?id=168155"
        },
        {
            "content": "I rarely say that easily but that anime is epic and full of quality ! I've watched the 24 episodes one shot ,eating in front of it ,skipping sleeping hours because each episode end made me have the urge to watch the next one.I've rarely been so much into an anime ,this one is definitely one of my favorite one ! Let's examine it :\r\nStory (8) : The story can sound classical for some peoples ,but for my own I find it original and really interesting.It's about a guy ,the MC ,which inherits the power of an ancient vampire ,a really powerful one.At the beginningthe MC was just a normal guy with a normal life ,but that incident totally changed his life.Now he's a vampire with incredible latent powers...and a strong tendency for nose bleeding every time he's a little aroused :3 .Than came a girl who'll change his already not-so-normal life and turn it into an even-more-not-so-normal life...So nice of her...And so it's with that nice duo that the story begin.I'm not gonna tell you everything about the plot of course ,but for me it was a really interesting one.The world itself is interesting with all of those not-human peoples ,that city full of \"monsters\" living more or less together ,the story is interesting ,the MC progression is nice to follow.Nah really ,that story is excellent.\\n\\n\r\nArt (9) : Perfect.I can't say anything else.The characters are awesomely made ,it's really colored ,actions are really well made and fast paced ,the ecchi scene are...*nosebleed*...Emmm sorry for that.The only little thing which is ,for me ,the little black spot on this pure white canvas (And there is nothing racist in that !) is that the main girl and the MC's little sister really look like the sames.I've spent so much time asking myself \"Is she he sister or the other one?\" and had so much hard time for differencing them.That's the only thing I can reprove about the chara design.\\n\\n\r\nSound (8) : Two fucking awesome opening ! If you like rock-like japanese songs than you'll love those opening.The OST of the anime is really great too and feat perfectly with each kind of situation in it.\\n\\n\r\nCharacters (8) : A MC that I'm so jealous about because he's a vampire and is surrounded by so cute girls.But he have a lot of style so I half pardon him.The girl MC which look totally like the MC's sister but stay really cute...Even if she often ruin the epicness of some battle with her punchline \"No senpai..It's OUR fight !\".Oh god ,how many time have I said to myself \"Shut up please and let him fight alone this time !\".Of course with that duo you will find ,the kind-of childhood friend (which remind me a lot Lucy from fairy tail sometimes) secretly in love for the MC (Aaaah classical ,why are you classical) ,the tsundere (*-*) who often help the MC even if she doesn't do that for him ,it's just a coincidence ,it's clearly not because she like him or something like that ! (How much I love tsun-tsun when they say that with a red blushing face *-*).You'll find a goth-loli sensei too (so cute *-*) who look really close to the MC for some obscur reasons.so yea the characters are many and a lot of them are interesting or touching.\\n\\n\r\nConclusion : That anime have everything I like.It have action ,it have ecchi ,it have love triangle/harem style love ,it have a strong and interesting plot ,some mysteries ,it have a lot of great combats with flashy powerful attack ,it have vampire and others creatures of all kind.You like those kind of thing? You really like all of those things?...Then why are you still reading me?! Go watch that anime right know and enjoy ,you baka ! >:3",
            "date": "2015-03-01T17:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 181492,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486047.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dai_Kina",
                "username": "Dai_Kina"
            },
            "url": "https://myanimelist.net/reviews.php?id=181492"
        },
        {
            "content": "This series has become one of my all-time faves! It's not just about the lead male who happens to be a vampire, though it does seem to lean towards the harem side at times. It is centered around the entire cast of characters. Though it's not the most original, the storyline is pretty great, and it flows smoothly. The way it is portrayed and developed is very unique. Even though it gets side tracked at times due to romance. Each and every episode continued to draw me in, and were entertaining! The development of the characters is very well done, and the relationships between thosecharacters are well defined! The series has a ton of action, but has its fair share of fan service as most series do. The art in this series is excellent, and there are very well placed comedic scenes that don't interrupt the flow. Overall, it's a very well rounded series. Though I secretly hope for more episodes....",
            "date": "2014-03-28T14:53:00+00:00",
            "helpful_count": 10,
            "mal_id": 137569,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=137569"
        },
        {
            "content": "Simply garbage.\r\nWas rage inducing to the point where it made me write my first review to record this frustration.\r\nDropped it a year ago and tried it again this year to hope that I was wrong to drop it, but I just proved myself right.\r\nStory is atrocious, very predictable, felt like I'm watching an anime with modern arts, but story that was written in 1980's.\r\nAll the female characters dismayed me, especially the pony tail girl with glasses, because she was the reason why I decided to drop this trash. I really hate it when a character disregards others' opinion and just acts rash, although I dounderstand that it is her characteristic and all, but there was a better way to do it. However, I will not dig into it due to possible spoiler.\\n\\n\r\nAt some point, the male protagonist was eating soft a sandwich, but he sounded like he was eating an apple.\\n\\n\r\nIt was somewhat \"enjoyable\" until this brain-dead character showed up and went all \"pant pant my beloved roommate, no one shall touch her, and I won't even listen to what the person next to her has to say since everything I assume is true\"\\n\\n\r\nNo logic at all, the guy was attacked, so his system tried to defend itself, then the offender was asking why hes doing that. Like what? No shit, you attacked him, he would do something right? Felt like I was chocking on a bread that had apple like texture while I was watching this supposedly, action, thrilling, breath taking scene.\\n\\n\r\nOverall, I really hate to drop an anime, because I hate stopping something midway, but if I had to stop it out of consideration for my health. Literally, I was about to get cancer had I finished the series.\\n\\n\r\nThere are many anime that have the same plot line with similar characters, but I was able to finish those. However, this anime was the cluster of all those stupid concepts.\\n\\n\r\nBut, if you read others' reviews, people in general seemed to enjoyed this anime.\\n\\n\r\nI'm pretty sure the novel, original story, is good hence that is why the anime was created. BUT,  the people who could not bring out the potential the novel might have, I really want them to rethink their job. Because, they will kill me eventually.\\n\\n\r\nBut, waddayaknow, I'm dumb enough to re-attempt this anime later in my life in the hopes of completing the anime that I started which I regret from the bottom of my heart.",
            "date": "2017-02-28T21:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 241643,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3028049.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JulyL",
                "username": "JulyL"
            },
            "url": "https://myanimelist.net/reviews.php?id=241643"
        },
        {
            "content": "I'm not sure why MAL didn't tag this also as harem, but it probably deserves that tag too.\r\nSo I guess I'll start off with the part that I enjoyed the most from this anime, and it was the art style. Since I'm not an art person, I'm not sure if I'm even using that terminology correctly, but I liked the character designs and how everything else is drawn in general and that was the biggest reason I kept watching.\r\nThe OST was good, there's one track off the top of my head that I really like, but in general while watching I never thought to myselfthat I disliked the OST.\\n\\n\r\nMy one main gripe was that the main character kept getting his limelight stolen from him. I don't need the main character to save the day all by himself all the time, but it'd be nice if he would beat at least one bad guy by himself.",
            "date": "2014-07-14T14:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 151991,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2983005.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ErenxMikasa",
                "username": "ErenxMikasa"
            },
            "url": "https://myanimelist.net/reviews.php?id=151991"
        },
        {
            "content": "*THIS REVIEW FREE OF SPOILERS*\r\nI'm a beginner here so don't expect much from me. I just find this anime by messing with the search function and interested to watch it. Since all of the aspect is awesome, I don't hold it back now.\r\nStory 9/10\r\nI like the story but some part are make me disappointed, really disappointed. But I like the fight part, it like written very good. And I also didn't really bothered by fanservices, I just enjoy all of it. Not many complains from me for the story but I hope they write the story more better if they want to make second season.\r\nArt10/10\\n\r\nThe art is so nice, I never seen any art like this before, it just like very colourful and the character is nice, even some scene the character hands, or legs, or maybe head is ugly, no complain from me anyway.\\n\\n\r\nSound 10/10\\n\r\nOP and ED of this anime isn't very bad, I ever saw more worst OP and ED anime. The character voice is nice too, the fight scene sound is nice too, well no complain from me either.\\n\\n\r\nCharacter 10/10\\n\r\nCharacter development is very important here, but I not very bothered to score it though. But I didn't have any complain so let's move on.\\n\\n\r\nEnjoyment 10/10\\n\r\nYeah, you can say I really enjoyed this show. When I watch some episodes last day, I just thought \"Am I force myself to watch this?\" and after I completed this, I got the answer, it was no. I didn't force myself anyway, I just enjoyed the show.\\n\\n\r\nOverall 10/10\\n\r\nNot much I gonna say here but I really like almost all aspect of this anime, so I think this will be enough, so see you later.",
            "date": "2015-12-08T06:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 205029,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802833.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZinxSter",
                "username": "ZinxSter"
            },
            "url": "https://myanimelist.net/reviews.php?id=205029"
        },
        {
            "content": "Strike the Blood is not the typical vampire anime, its not the apocalyptic universe of Hellsing and neither a unity like in vampire knight - it is another mixed approach on the almost untouched franchise.\r\nMy Name is Ryoki and Welcome to my Review of the Anime Strike the Blood. \r\nThis Review may contain minor, not plot relevant spoilers. If you dont like spoilers at all, then please scroll away.\r\nThe Story has you follow the young highschooler Akatsuki Kojou, in the first minutes it appears like everything is normal right? wrong. Akatsuki lives on an island where magical beings from werewolf over vampires towitches exist. In this World there exist 3 uber-vampires which are called Progenitors, naturally as you can take from it - those are incredibly strong and warlords for the vampires. Akatsuki, though still denying it, is the fourth of them and thus also seen a threat for the human world. The Lion-Organisation, a council of specialiced magician, then decides to send her Disciple Yukina to watch him and is allowed to take actions against him should he try something stupid or become a too big threat. The story has an extremely good premise , unfortunately it is very predictible and doesnt have much clever twists - it shines though in emotional situations and fights - so it is very much up to your self to decide if you like it or not. I personally feel that Strike the Blood has about 5 main plotpoints that repeat in each arc:\\n\\n\r\n-Kojou goes to school\\n\r\n-Kojou gets scolded by his teacher/friend\\n\r\n-Yukina tells him that she will always oversee him\\n\r\n-Kojou gets beaten down and drinks blood from a woman beside him and awakens a new familiar\\n\r\n-Kojou says his touching speach and Yukina her catchphrase in harmony with him and they defeat the enemy\\n\\n\r\nAkatsuki Kojou personally is the typical failing highschooler that you know from other animes like Tokyo Ravens' Harutora for example. Beside his powers, that he had mysteriously obtained by the last progenitor - he is one that protects his friends. \\n\r\nYukina on the other hand is our tsundere lead, sent by the lion organisation to  observe Kojou. She keeps trail on him , searches for him when he's in danger and she is a sword shaman. A sword shaman is a shaman that not really supports many spirits but one and naturally she or he uses a bladed weapon like for Yukinas case ,,Schneewalzer'' the magical spear that cuts through all magic. You unfortunately dont get much background in the whole 24 episodes, there are really just a few scenes of kojous and yukinas past while much more things are explained about his friend Aiba and others. If you want to know more about them, you will certainly have to read the wiki.\\n\r\nThe Art in Strike the blood gives you a wild ride, certainly. I loved the amazing fights and also the use of magic.My most favorite part is the angel transformation itself it is scary and also impressive - just as it would need to be. While I'd wish that the sound would be as good as the artstyle, it unfortunately lacked a lot behind , there was just a few times where there was real tension while the others just seemed to be simplistic.The first opening did its job well but the second one didnt seem a good choice to me, i wished it would have been a much more epic one.\\n\\n\r\nBased on my opinion on story, art , sound , character and overall enjoyment -i issue Strike the blood a solid 7.\\n\\n\r\nBetter Stream it and wait before buying it , until you know that you really like the anime.I hope this review could you help with your choice a little.",
            "date": "2014-12-07T13:03:00+00:00",
            "helpful_count": 8,
            "mal_id": 171355,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3791925.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RyokiJurushi",
                "username": "RyokiJurushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=171355"
        }
    ],
    [
        {
            "content": "Strike the Blood seems your typical Vampire story. Plenty of female to bite on. Plenty of fights and even more romance that no one seems to realize is there. Seriously though. It is obvious to us, but none of the characters progress beyond a \"I like you a bit\" point. What Strike the Blood does have that sets it a bit apart is it's own little world. Many animes have combined Technology and magic, but it's usually left in 2 separate worlds that interact with each other on an occasional basis. STB split that and threw it all into a nutshell the side of aman-made island. \\n\\n\r\nCurrent summary based on the released season:\\n\\n\r\nPros- Animation and art are definitely current. Crisp images and clear battles make you understand the flow of the show. Aerial images clearly define what you are viewing without leaving a blob of grey in the corner to make up for time. The soundtrack wasn't half bad. Some re-used themes in the music from other animes of a similar genre, but not so much that you get bored with them.\\n\\n\r\nCons- Romance. It's there, but not enough. How can you expect a \"Harem\" anime to get away without any true romance? Not going to happen. Visual cues tell us some, but are not enough for a majority of the audience. There is no true background. Similar shows have had this issue with \"Something bad happened to our main hero but we won't tell you what it was.\" Bakemonogatari is an example of this. With any luck they will work with this and make a second season that explains a bit more and introduces the Romance aspect into the anime more. \\n\\n\r\nCons - (Possible spoilers)   Spoilers are against the rules, but some of my cons have to do with particular aspects of the anime. Please stop reading at this point if you have not watched the show yet:  As stated before, there is plenty of room for advancement into a second season, but out ending (Post episode 24 credits) kind of kills that by giving too much away. The primary battle catchphrase. It took me a while, but it became part of the show. At some point she needed to butt out and let him do something without her. \\n\r\n(Possible spoiler cont.)\\n\r\nFinal Con - Lack of character backgrounds on several of the primary females. It becomes well obvious in the last half of the show that Asagi is something special and non-human. Art choices to have a characters eyes glow or change color is an indication of this, but we are never told what it was. Kanase was completely ignored after her arcs expect for the casual pop in in random episodes. This happens for every character. We are given a 30 second explanation of who they are and then we dive into the story. A bit more would be helpful in this and could have expanded the arcs across more than just 3 or 4 episodes. \\n\\n\r\nOverall - I liked the show for what it is and for what it lacks. I see room for improvement in a second season and wish the company the best of luck. Let's hope they review sites like these to see what it is that people want and need.",
            "date": "2014-04-29T19:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 141799,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3720573.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheangryRogue",
                "username": "TheangryRogue"
            },
            "url": "https://myanimelist.net/reviews.php?id=141799"
        },
        {
            "content": "Sometimes you just want to turn off your mind and watch a typical ecchi harem anime. You don’t expect too much of it and just want enough fanservice to get you through your rough day. So when you start watching and see the number of episodes you think “Hmm 24 episodes, isn’t it usually 12? Well then this must have some kind of good plot to be this long.” Then you start it, finish it and wonder why the fuck this was made?!\r\nStory 2/10\r\nI want to say this is just a typical ecchi harem show with some action, but it isn’t. Aside from the largecast of girls to fit different fetishes and the plain main character that everyone falls for along with the occasional panty shot and the mc getting hit for walking in on them or doing something indecent which isn’t even their fault, it isn’t really like your typical ecchi harem show.\\n\r\nThe plot of the show is well… there is no plot. It starts off with our bland OP protagonist who is one of the strongest beings in the world, so they have a little girl oversee him to see if he should be disposed of or not. Initially I thought the organization sending her had some underlying goal in mind, since there is no way they would send a 14(?) year old to handle one of the 4 strongest beings in the world with one of their strongest weapons, but yeah no they actually did that… \\n\r\n3 months prior to the show MC was just a normal guy, but got vampiric\t powers from the previous strongest vampire. They add a little mystery to that, by not telling us exactly what happened. But they never tell us anything about it because fuck you go read the light novel. In 24 episodes they tell you nothing about the only plot line in this show. The whole show is basically just some episodic arcs with one arc having an event from another arc that the show doesn’t cover so it ends with having some loose ends. \\n\r\nThe story has a lot of supernatural beings in it, since the location of where the story takes place is a city full of supernatural creatures that have been “tamed” as in they have a collar, look like humans and the collar goes off when they transform and use magic, but the show never does anything with this.\\n\r\nSince it’s an ecchi, school harem show, you expect it to have that as the main vocal point. But while watching it, I didn’t really feel like that was the main focus of the story. I didn’t really feel like it was just trying to be an ecchi show with a stupid plot put into it. It had quite a few moments where it felt like it wanted to be taken seriously which made me question what they wanted to convey in this story. Did it try to convey that humans are the actual monsters instead of the supernatural creatures? Nope that was never mentioned like I said they didn’t really do anything with it. Well then does it try to show how monsters and humans can live together? Well they do live side by side, but the show doesn’t really make it 100% clear if everyone is aware of that. Even if they are tamed there are so many explosions in the city and shit happening that I wouldn’t know why anyone would want to live here. Well maybe it was about the mc’s friends accepting him as a supernatural creature. Although he mentions telling his friends and it’s frequently asked what is really happening there is always something happening just so he won’t have to tell them for the convenience of the plot. Actually not even convenience, since the story would probably work better if he just tells them. There really is no need to hide this especially for 24 episodes. Same thing for the romance in his harem. Every time there was some progression it’s immediately stopped by having something random happening. For example one of the characters say “I’ll explain what this kiss means on Saturday”. Saturday comes, now I’m stuck on this inhabited island and we’ll never talk about this plot line again. Aside from the fact that it’s stupid that this needs to be explained, it has some real flip the table moments for this. If it wasn’t already obvious for everyone in the beginning, the last episode already tells you who the mc will end up with.\\n\r\nSpeaking of the last episode, well it just kind of ended. It was not a bad ending or anything it was just, well, there is more, but you need to read the source material.\\n\r\nThe only thing I really enjoyed about the show were the ecchi moments and the occasional good comedy that made me chuckle.\\n\\n\r\nCharacters 3/10\\n\r\nOh boy, well if you thought the story was bad, the characters are also quite bad. Not as bad as the story, but still pretty bad.\\n\r\nKojou (mc): He is your typical nice guy, he says the typical nice things which instantly makes the girls uncontrollably wet, shaking their legs and drooling with lust because which girl wouldn’t if you tell her she looks good in that piece of clothing. Though seriously they all just fall for him for reasons I’ll list in a few moment. Like I previously mentioned he’s an op vampire, although he’s only op at the very last moment of every fight. It basically goes like this they fight the villain, Kojou is useless, Himeragi (the other mc) is holding her own, but they can’t defeat the villain so Kojou needs to get a power up, but he can’t get the power up because his familiars don’t see him as their master yet, because he hasn’t drank any blood. So obviously instead of just cutting the hand of the girl and drinking the blood, he needs to get excited, so the girls OBVIOUSLY need to undress, make out and then he can drink their blood (note that although I’m saying this very sarcastically these were the only real moments I enjoyed). He then gets his power up and defeats the villain. Now note that his power up becomes completely useless against the next villain because every fucking familiar only works on the specific villain that he needs to face at that time, because you know plot convenience.\\n\r\nOn to the other characters we have:\\n\r\nHimeragi: The girl who will beat up Kojou for perverted things that weren’t even his fault. She’s also a good fighter who can hold her own. Initially she seemed to be one of the only 2 characters who weren’t bland, but her personality basically stays the same throughout the show just like all the other characters and besides holding her own in a fight, I don’t really see any real personality traits.\\n\r\nAsagi: The blond (Best) girl who’s the only one with a sort of personality and actually tries to further her romance, which makes you root for her, but because of plot convenience that progression comes to a halt and we all know that the best girl never ends up with MC (so fuck!!!!!).\\n\r\nLittle sister: She is in there because we need a cute sister. She has a “tragic” backstory for one scene, but this is never really expanded upon, so you can forget about it since her being in the show wouldn’t have made any difference. Also one of the very few girls that don’t want to fuck Kojou. (No incestual she’s actually not blood related moments here. Surprising honestly).\\n\r\nLoli teacher: Because we need a loli teacher. She’s competent in fighting whenever the plot needs her to be and is very serious. She is also not interested in Kojou (as far as I can tell).\\n\r\nTsundere girl: The ponytail girl who likes Kojou, but can’t admit it. She has some cute moments and surprisingly doesn’t come in between the relationship of the other (on purpose).\\n\r\nNice princess(?) girl: Who just wants to make advances on Kojou because???\\n\r\nChildhood friend: because we need a childhood friend and she likes Kojou because he’s her childhood friend. I know that doesn’t make any sense, but just go with it.\\n\r\nThere are 4 other sort of important side characters, but we don’t care about them. To sum it up, there is a maid girl with no personality, the sort of oni-chan girl, the gay OP guy who only fights when it’s convenient for the plot and that other male character that seemed important, but wasn’t really.\\n\r\nThe villains were your typical villain of the week spread out over 3-4 episodes. They weren’t memorable in the least. Sure they had some motives, but they were all really forgettable, hell they weren’t even threatening. There was not one time I felt like any of the characters where in any real danger, I don’t mean in a plot armor kind of way, but there was just no tension in the fights. Sure there were some close calls, but you always knew it wasn’t the end for them. \\n\r\nOverall none of the characters where really interesting or had any real development except for the best girl, Asagi. But at least all the girls were really cute and none of them were annoying well except for Himeragi when she hits Kojou for no reason. Especially when it’s not even a misunderstanding… \\n\\n\r\nAnimation 6/10\\n\r\nThe animation was pretty solid overall, especially the fight scenes even though the fight’s became pretty repetitive over time, but that doesn’t have anything to do with the animation which they did a pretty good job on. Like I mentioned before the girls were also really cute so ( ͡° ͜ʖ ͡°) I mean uhm the art style is really nice, though girls tend to look a bit similar apart from hair style.\\n\\n\r\nSound 6/10\\n\r\nI honestly don’t recall any ost aside from the song at the end of a fight and I can’t be bothered to listen to the ost, so I’ll just judge it mostly on the opening and ending which were both pretty good. The 2nd opening actually made the series seem better than it was.\\n\\n\r\nEnjoyment 4/10\\n\r\nAs you could probably tell, I did not enjoy this anime very much. I went into this expecting this to be just a popcorn ecchi flick that would be 12 episodes, but instead I got THIS thing that for some reason exists and recently even got 2 ova’s. That actually had the ecchiness I was searching for.\\n\\n\r\nOverall 4/10\\n\r\nI feel like this series just lacks a plot, it could have been something more if it actually used its plot elements, expanded on the world and actually tried to do something original with it. The best thing about this show is the stereotypes and ecchi scenes which is obviously not a good thing. It’s definatly not the worst thing I’ve seen, but it could’ve been a lot better. I wouldn’t really recommend this show to anyone you’re better of watching dxd or testament.\\n",
            "date": "2016-01-16T16:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 208687,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1975556.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/GodspeedK",
                "username": "GodspeedK"
            },
            "url": "https://myanimelist.net/reviews.php?id=208687"
        },
        {
            "content": "If you like an anime there the main character actually has vampiric good powers this is the one. Granted thats most of what for me this anime got going in many ways and some other things that i will explain.  \r\nStory: Yeah the story gave me a reverse Rosario x vampire feeling meaning that in this case its not all the girls whos got all the big powers but here the Main character is kinda the Vampiric main character. It does leave things to be explained later though i can sorta forgive it since i know there will be a sequel but i knowthere will be some who doesnt like that an anime has this gaps that needs to be filled to make everything makes sence. The story lacks something that i can feel maybe its because that they based it on a novel i dont know but you can definitely feel it. I also like how they explain the superpowered vampires and how there is actually a story and explanation for this island that the story is mostly based in. \\n\\n\r\nSound is nice an all but it fits well with the theme and the first opening is something you remember after hearing it. \\n\\n\r\nCharacters: I did like how the main character diverted a little from the typical mc in these types in the anime but i still see the generic girls in it. There is really much that surprises me when it comes to characters in this anime.  I can see why many female characters have to fall for him but it still pains me to see the similarity with many other anime when you look at those character flaws. \\n\\n\r\nIf being entertained was what i watched this anime then yes it has many good things going for it but that , the consept and the battle scenes is what it has going for it. \\n\\n\r\nOverall this anime has flaws like many other anime of this type. The story feels rushed and there is a lack of depth at time but other than that this anime works to become something good that atleast deserve a 7 but not much more since i would like to see something more original for to give it higher.",
            "date": "2016-10-11T03:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 231584,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=231584"
        },
        {
            "content": "Coming into this anime, I had hopes to see something new or at least spectacular. I was, however, disappointed. Strike the Blood was one of those standard harem, action animes, but it was good in many aspects.\r\nStory: 7\r\nStrike the Blood doesn't really have an overarching story line. It is very episodic with every arc ending with the famous phrase, \"No senpai, this is our fight!\" It is episodic in a sense that each arc doesn't really correlate that well with the other arcs, however, it is not episodic in the sense that each episode is a standalone. Most arcs are 4 episodes long, with afew exceptions. Each arc also ends with the introduction of more girls into our beloved main character's harem, and our MC gets even stronger. There is also the occasional blood sucking... but I'll get into that later.\\n\\n\r\nArt: 8\\n\r\nStrike the Blood's art wasn't the best, but it wasn't bad either. Nice background stuff, the characters looked different, sort of, battle scenes looked cool, but a little repetitive towards the end. Overall good art, but not extraordinary.\\n\\n\r\nSound: 6\\n\r\nThe OPs and the endings were not to my liking... at all. The other sounds were just fine, with one exception. The blood sucking scenes were just too much for me. The girls made an excessive amount of... weird? noises. I hope you guys know what I'm talking about because I'm not going into it any further.\\n\\n\r\nCharacter: 7\\n\r\nThe characters were likeable for the most part. The main character is cool as are the girls in his harem. This anime has most of the archetypes filled as well, including the middle school friend, the tsundere, and the outgoing girl. However, there was little character development for most of the characters, except for, of course, all of the girls developing feelings for the MC.\\n\\n\r\nEnjoyment: 7\\n\r\nThis was one of those animes where once the arc starts, you just want to finish it, but then you think to yourself that arcs aren't that long and so you watch another one and this goes on and on and on... Each individual arc is enjoyable, a little predictable but nonetheless enjoyable. Seeing the MC's power level go up through the series in also cool, but he does suffer from the \"god-mode syndrome.\" Where, if he can't beat an antagonist, he powers up and beats him and this cycle repeats forever and ever and ever. It was good humored though and plenty of awkward/embarrassing scenes, as well as the funny scenes.\\n\\n\r\nOverall: 7\\n\r\nThis anime is like many, where you have to go in without a plan in mind and just go with the flow. I would recommend this anime is you don't want anything too serious and want to see the same sequence repeated over and over and over again. Barring the bad parts, this anime showed a good harem, with comedy and the occasional action scene.",
            "date": "2014-08-12T21:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 156355,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3814779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Potaato",
                "username": "Potaato"
            },
            "url": "https://myanimelist.net/reviews.php?id=156355"
        },
        {
            "content": "In the beginning of the anime I had high hopes because it started off as a very new anime experience. Over time though the anime slowly started to deteriorate with its repetitive, overused, slightly aggravating,  \"no senpai this is our fight\". But aside from that there was a lot of holes in the anime and i doubt they will come out with season 2.\r\nThe characters were great for moe moe lovers. The main character Himeragi, Yukina is a middle schooler. I loved all the characters and times I laughed at what they say. But the only reason I have characters an 8 is becauseYukina kept saying \"no senpai this is our fight\".\\n\\n\r\nThe story has lots of holes but overtime it just skips over many things and makes me very curious why they did not just remove the whole things.\\n\\n\r\nBut overall the anime is a 7 imo because I loved the characters and the story does make sense if you think a little bit. I gave sound a 5 because I truly have no idea what they mean by sound. If music I have no idea because I watch plot but I do have pretty good speakers.",
            "date": "2015-07-27T04:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 194442,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4611764.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Improer",
                "username": "Improer"
            },
            "url": "https://myanimelist.net/reviews.php?id=194442"
        },
        {
            "content": "This is one of the best anime I have watched in a while! The story was great, it wasn't stolen from another anime, and there was a lot of fan service. This reached rank 4 of my favorites list!\r\nYour average ordinary HS student becomes a vampire overnight. He also happens to be the strongest vampire that's ever lived! And he doesn't want any of the power. Our MC spends most of his time helping others, rather than being selfish. Even going to the point of sacrificing his life for the young woman he loves. Multiple times.\r\nThe story is excellent! you get to learn about thecharacters, and actually, start to fall for them yourself! And the fan service doesn't hurt either. \\n\\n\r\nI didn't have any complaints, except that the first season ended to fast for me. Then again, I did binge it over the past few hours, so that could be the issue!\\n\\n\r\nIf you're reading this review, do me a favor. At the end of every \"Arc\" there is an extended scene. Usually every three to four episodes. Be sure to watch those, as you will be lost in the next episode. I had to go back and watch them, just to not be so lost!\\n\\n\r\nAlso, be sure to finish ep 24 in the same manner. One of the characters from ep 23 and 24 gets revealed, and it's pretty awesome! No spoilers, but it's kinda a mix between our OP MC Vampire and the gal he loves that happens to be badass with a spear! You can make your own assumptions from here!\\n\\n\r\n-JNutt22",
            "date": "2018-11-17T03:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 294212,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875813.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JNutt22",
                "username": "JNutt22"
            },
            "url": "https://myanimelist.net/reviews.php?id=294212"
        },
        {
            "content": "Story 8/10\r\nArt 10/10\r\nSound 9/10\r\nCharacter 5/10\r\nThe only reason why I put it so low is because of Himeragi who is so fg annoying as hell. Sorry, but I didn't like her at all in the story. She pissed me off more than anything. Sure the anime is great, but Himeragi is just too annoying.. I cant stand her at all.\r\nThe other downside is Kojou who seems to never be able to do anything at all because of Himeragi.  Himeragi is somewhat scrapping the story, in my opinion.\r\nEnjoyment 7/10 Same reason as Character mostly\r\nOverall 7/10",
            "date": "2016-12-15T07:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 235489,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5772210.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Akashiya_Yuki",
                "username": "Akashiya_Yuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=235489"
        },
        {
            "content": "After watching this anime, I decided to write a short poem about it. \r\nRoses are red, \r\nFrom now on this is my fight,\r\nNo senpai, this is our fight. \r\nJokes aside,\r\nStory: 7\r\nThis anime has a mediocre storyline, but sometimes just sometimes its unpredictable. The fight scene is great and just in case you don't know that they're going to win the fight, you'll hear the Himeragi's catchphrase.\r\nArt: 8\r\nIts artwork is ok for its time. The animation is pretty fluid and coordinated. The character designs are good and they are pretty well drawn.\r\nSound: 9 \r\nThe opening and closing are great and I really like it. Thesoundtracks are also made very well. \\n\\n\r\nCharacter: 8\\n\r\nThe character development is great and overall it is pretty good. Since I've watched all the seasons, as for his background on how he got his powers, watch the sequel and you'll get it. They have diverse characters and overall I'm ok with the characters.\\n\\n\r\nEnjoyment: 9\\n\r\nThis show if one of those shows that you will rewatch when you feel bored. \\n\\n\r\nOverall: 8 \\n\\n",
            "date": "2018-10-28T08:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 292835,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4869040.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShiBroke",
                "username": "ShiBroke"
            },
            "url": "https://myanimelist.net/reviews.php?id=292835"
        },
        {
            "content": "FREE SPOILER\r\nFirst of all, maybe im late to watch this anime, but i do like to give an review about this anime. my friend recommend this anime to me, i just finished this anime like an hour ago.\r\nStory : From the plot strike the blood, i do really like how the story works, they always make thing complicated after finish 1 problem, thats make this anime even better !\r\nArt : Nothing special about the art, it look same like usuall with a great visual. but still.. i like the art\r\nSound : they make the sound for every character look impresive, i really like their sound.and about the backsound, sound effect, thats also good.\\n\\n\r\nCharacter : hahaha (harem) yea, this is harem anime, moan moan moan everytime he touch you xD more girls to come, more this harem complicated.\\n\\n\r\nEnjoyment : yes i do enjoy this anime. why ? because of the fight scene look interesting for me, the fight between character seems cool for me.",
            "date": "2018-10-06T22:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 291100,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7133970.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MarcoZero",
                "username": "MarcoZero"
            },
            "url": "https://myanimelist.net/reviews.php?id=291100"
        },
        {
            "content": "As anime viewers we are all searching for the next magnificent series that will get us hooked almost instantly. To be honest this is not the case for Strike the Blood. In no case does this mean that this particular series is a failure but it's also not a masterpiece.\r\nStrike the Blood is a typical harem/superpower/vampire fun series. It is the type of series that will help you relax and laugh through accidental sexual encounters and/or accidents. \r\nStory: 7\r\nAs I already said the story is pretty generic and in most cases you are almost certain as to what it is going to happen. Then againjust because you know does not make the whole experience less enjoyable. Yes there could have been more effort given to the story as a whole but the fact is that the way it is now it's quite efficient for the genre of the series. \\n\\n\r\nArt : 7\\n\\n\r\nThe art is pretty good in general. Personally I have some doubts about a couple of background things but I would not want to spoil anybodys fun. The characters are pretty well drawn although they are pretty classic and standardized. The transformations and usage of super-powers is quite nice. It is clear that the artistic team put a lot of effort to make the fighting sequences more appealing to the viewers. \\n\\n\r\nSound : 4\\n\\n\r\nThe soundtrack was not anything exceptional.. At best you could describe it as decent. Both openings were pretty good but thats about it. Despite having finished watching it less than 30 minutes, I cannot for the life of me, remember another instance where the music excited me. Even in the fighting scenes the music was pretty underwhelming.\\n\\n\r\nCharacter : 8\\n\\n\r\nEven though character development was not a priority for this series I found the majority of the main and supporting characters quite enjoyable. There were some cases where one could relate to their 'plight'. What I enjoyed most is the fact that each female character had a very different origins story and motivation to assist our main protagonist. It really put me in the mood to read the light novel and manga in order to get all the information.\\n\\n\r\nEnjoyment & Overall : 7\\n\\n\r\nAs I said before this is by no means a masterpiece series. This is a good, fun and predictable series ideal for relaxation and enjoyment. \\n\\n\r\nIf you are looking for something that would get you hooked please move along you will not find this here.",
            "date": "2014-05-20T10:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 143923,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=143923"
        },
        {
            "content": "Well when it comes to the tag \" Ecchi \", i dont think people are fair when they judge an anime and Strike the Blood is a prime example of an underrated show that never get the credit it deserves.\r\nStrike the Blood, also known in short form as SutoBura, is a Japanese light novel series by Gakuto Mikumo with a 24-episode television anime adaptation by Silver Link. The story follows the adventures of Kojou Akatsuki, a vampire in high school who is a bit reluctant to show his powers, and Yukina Himeragi, a teenage Sword Shaman apprentice who is sent to observe him.\r\nI find itextremely rare when a shounen show is very well executed., no suddenly overpower MCs, no comeback to death, everything is explain very detailed. The characters are a bit typical in kind of ecchi animes you can get but that's fine for me coz they're actually very entertaining to watch from the badass girls to the genuine bad guy, everthing is smooth and the ending was satisfied.\\n\\n\r\nThe animation quality is amazing, awesome action scenes, beautifully drawned characters. The music is above average, the op and ed is quite good.\\n\\n\r\nWell if you love an action anime with a little ecchi, this anime is for you.",
            "date": "2015-06-30T06:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 191794,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489573.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/johnbradshaw",
                "username": "johnbradshaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=191794"
        },
        {
            "content": "Kojou, an ordinary human, is mysteriously transformed into one of the four strongest beings on the planet; it only makes sense for him to get a half dozen instant girlfriends right? Strike the Blood is an ecchi-based action/fantasy/harem that borders on something between Campione and Toaru Majutsu no Index. The underlying premise and harem aspects are similar to Campione and the protagonist and magic/technology-based setting is similar to that in Index. Unlike many other typical action harems, this show strikes a good balance between ecchi and action. Add in some chain-inducing cliffhangers with good overall plot cohesion and this starts to stand out from thepack. Despite some repetitively shonen aspects and countless ecchi accidents, the show still comes across as enjoyable. If you're looking for an ecchi-based harem with a bit of action, this is one of the better ones.\\n\\n\r\nAnimation:\\n\r\nThe animation is well done. The show takes place on a floating island, a unique setting with a strange mix of technology, magic, and demons. The lighting creates a nice tense atmosphere when appropriate. Backgrounds are above average as are effects; I only noticed a few instances of CGI. The character styling is likewise very good. The show presents a wide range of female archetypes, though the tsundere personality is present in various flavors. Emotional details aren't as good as you'd expect from a full-on romance, but are present enough to give the characters greater depth than competing shows such as Aria the Scarlet Ammo and Maken-ki. Some of the girls are quite well endowed, especially considering their age. They also have a fairly good variety in their wardrobe, something nice given the duration of the show. There are certain drawing inconsistencies, though, where clothing mysteriously changes color. Minor faults aside, I was pleased at the variety and attention given to the many heroines.\\n\\n\r\nThis show has a substantial amount of action as well as ecchi. Kojou is an immortal vampire, but that doesn't mean the numerous antagonists won't try to take him down. Expect a lot of blood (fair game given the series' title) and a bit of gore as Kojou is hacked, impaled, and otherwise \"killed\". As the series progresses, he gains control over various familiars, which are powerful summoned beings. The ability is very similar to that of the protagonist in Campione, though the actual familiars remind me quite a bit of the personas in Persona 4. Expect a lot of action with decent choreography and lots of effects. Some of the attacks do get a bit old given that the heroines all only have one signature move. Speaking of the heroines, expect them to be constantly abused by Kojou. Whether it is an accidental fondling or unintentional cleavage glance, he is constantly getting in trouble with various girls. What sets this series apart is the level of physical confirmation in the character relationships. Expect a fair amount of skin rubbing, suggestive positions, kissing, and neck biting (with expected hentai-level utterances). Whether you're looking for a thriller or an ecchi show with some actual romance, this has you covered.\\n\\n\r\nSound:\\n\r\nThe show has 2 OPs and 2 EDs. The first rock based OP is a fitting, fast paced work with a fair melody. It blends very well with the slightly slower, rock based ED. The vocal melody is only average, but the intro guitar melody is catchy. The second pair of OP/ED is slightly darker in tonality. The OP is very distinctively Altima; it really reminds me of Accel World. The ED is the only slow piece you'll find in the entire series; it works really well as a cool down from the action in the show. The show's BGM is supportive but only fair overall, with only a few memorable tracks.\\n\\n\r\nThe VA work is well done in the show. Large props to Yoshimasa Hosoya for creating a more proactive yet still lazy version of Touma from Index. Many of the female VAs also do a really great job. Risa Taneda, Asami Seto, Ikumi Hayama, and Hisako Kanemoto all do an outstanding job in their respective roles. All the gals feel distinct despite sharing some tsundere elements. If I had any complaints in this category, it would be against the script rather than the VAs. The extremely long attack-prepping names are quite annoying and reminiscent of Code Breaker. Likewise, certain lines are repeated to the extent that my ears wanted to bleed.\\n\\n\r\nStory:\\n\r\nThis is where things get a bit complicated. As in Campione, it follows a \"rising star\" who, with the assistance of his ever-growing harem, manages to fight off successive arcs of forgettable villains. And like Toaru, the main story progresses while giving hints that larger, unknown, forces are at work. So yes, this is a harem. But it is one that also integrates a relatively deep and intricate story.\\n\\n\r\nThe show is broken down into consecutive arcs that build upon each other. Though some arcs are clearly better than others, expect a lot of action and cliffhangers in all of them. Each arc has its own rising action, climax, and resolution. Typically, the resolution includes a nice dosage of ecchi to round out the action. The arcs don't feel like they get any more important as the story progresses, so don't expect the importance of the arcs to increase. If anything, the final arc is in itself a conclusion, giving a sneak peak of the future. It's a really good way to end the series on a positive note.\\n\\n\r\nThis show borrows a lot of themes and concepts found in other shows. However, it integrates them well into a uniform, mostly-cohesive plot line that is well executed. Never did I feel that the ecchi was overkill, and likewise the action was never overwhelmingly dominant. Yes, there are definitely plot holes. Yes there are definitely incredulous moments where Kojou is miraculously saved by mysterious forces. Despite these, the show still resonates positively for me.\\n\\n\r\nThere is definitely some chatter about whether there will be a sequel. The fact that there are so many unanswered questions and the feeling that Kojou is just a pawn in a greater scheme do seem to lend well to a second season. However, it's going to be hard to top what they did in the last arc for a conclusion.\\n\\n\r\nCharacter:\\n\r\nKojou stands out positively among harem protagonists. Despite his god status, he never feels quite as all-powerful or dominant as the protagonist in Campione. Yet he is forced to fight for the island and what he believes is right, finally accepting his power with the help of the guiding Yukina. I will admit that he still is a bit slow when it comes to romance.\\n\\n\r\nAs for the girls, they have a wide range of personalities but all develop feelings for Kojou. Some of the girls are well developed, Yukina in particular. Others could have used a bit more exposition. The slow descent towards infatuation felt very natural with Yukina. With some of the other girls, they somehow went from \"I hate you\" to \"Please feast on my blood\" within a span of a few minutes. This is partly negated by the fact that the girls are often involved in conflict over Kojou, often in a subtle way; complicated no doubt by their relationships with each other. This depth of relationships was pretty fun to explore.\\n\\n\r\nI typically don't like shows that involve a large number of supporting characters. This show is one of the few exceptions; supporting characters are well utilized and often play key roles in various arcs. Some of the supporting characters have unknown goals, creating an additional dimension where you have to guess whether they will assist or hinder Kojou. Really, the only annoyances in this category are the boilerplate antagonists and the fact that the city seems to overlook the hundreds of secret-service-like agents getting slaughtered seemingly nightly.\\n\\n\r\nValue:\\n\r\nI thoroughly enjoyed this show. I felt the pacing was just right with intense action flowing smoothly into light-hearted ecchi. The protagonist is strong, but not so strong that you'd immediately put the \"invincible\" label on him. His relationships with the girls are enjoyable, and the overall story is well executed. While this show definitely has its share of faults, I feel that it was a much more complete package than many other ecchi-based action/harems. Definitely give this show a try, and try to go one arc at a time lest you enjoy the agony of ending on a cliffhanger.",
            "date": "2016-02-11T00:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 210646,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=210646"
        },
        {
            "content": "Strike the Blood was quite interesting. The setting is what I found the most interesting though. The man made island made of magic and metal. But Himeragi's character was soooooo annoying. I suppose it's because I'm not a fan of overly jealous females. But I felt like she was way too conceited. Always yelling about how kojou was ogling her body and such. But oh well. It definitely made her character more interesting  but at the same time, she should've been focusing on more important things and instead was worried about kojou being with other girls. I also felt like the show was moreabout Himeragi than Kojou. Maybe it was supposed to be. But I thought that it was going to be more about kojou and kojou realizing his power. I didn't get what I was expecting but the show was still entertaining. I probably should read some reviews first, the harem situation and all the perverted situations that he ended up in started to get annoying after a while. But because I have to finish what I start, I finished it. No regrets of course, but be prepared.",
            "date": "2015-06-21T19:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 190879,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4684001.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KuiiMo",
                "username": "KuiiMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=190879"
        },
        {
            "content": "Senpai! Alright I am going to be writing the most biased review of my favorite series ever. So this anime was my introduction to harems and with that sent me into loving anime. What I liked about this series was mainly the relationship between Kojou and Yukina, between them was something that is beautiful :') also I like the intensity and the action it was also really nice. I just really love the series. You may hate it, but I think that this anime is a great one if you want something that will hook you in. Sorry if this is not a normal reviewit has been 6 months since I have seen it, so I will watch it again today, but I really do think that this anime had everything up to snuff, except the senpai thing, that got a little old.",
            "date": "2015-06-11T18:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 190118,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4667366.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Psychoninja",
                "username": "Psychoninja"
            },
            "url": "https://myanimelist.net/reviews.php?id=190118"
        },
        {
            "content": "Disclaimer: I rate anime and manga on the pure enjoyment factor since that is what I look for in anime/manga (what's the point if it's not fun?). If some other factor(s) heavily affect(s) my enjoyment of said anime/manga I will mention so. Also I hate typing long reviews so this won't be that long. Now into the review.\r\n    The first two episodes were probably the best. They introduced the cast and how all this stuff works. In fact, the first two episodes were mildly amusing. The problem? The next 22 episodes. The entire show repeats itself. Each battle takes two episodes andbasically the exact same thing happens OVER AND OVER AGAIN! The entire plot; new enemy shows up, protagonist does some stuff, protagonist fights new enemy, protagonist drinks blood of some perverted girl in his large harem, gains a new minion to fight for him, happy ending. I'm not kidding. Literally. That is every episode group (two episodes are used for one) EXACTLY. There is a few minor differences but the main plot is always the same and boring as hell after watching it OVER AND OVER AGAIN. \\n\\n\r\nOh and did I mention they ended with a shitty time travel ending to generate interest in a second season? Seriously, that's probably the worst way to make a cliffhanger. Total crap shoot of an anime. My recommendation?\\n\\n\r\nSpend your time on a decent anime instead of this.",
            "date": "2016-11-15T16:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 233820,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4666097.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/CrazyLasagna",
                "username": "CrazyLasagna"
            },
            "url": "https://myanimelist.net/reviews.php?id=233820"
        },
        {
            "content": "Strike the Blood. A must watch!\r\nOkay. Well, first of all, this anime was never on my continuously growing watch list.\r\nAnd I said was. And this was because of the lousy thumbnail or cover art or whatever you call that. But this anime proved the saying that you must judge the book not by its cover, or in this case, do not judge an anime by its cover.\r\nAfter watching a few episodes, it is really great! It has a great mix of action, romance, ecchi and comedy at times. It was really a great watch. The story was great, though overused for some I guess.Each episodeis well executed leaving some hangers behind leaving you wanting for more, wanting to know what will happen in the next episode. \\n\\n\r\nThe soundtrack is also great. It has a mix of soft sad sts, and fast-paced adrenaline rushing sts. And not to include a badass opening theme song.\\n\\n\r\nIt maybe good but it definitely have some flaws, like too much girls for the main protagonist and the fight scenes were a bit dull and overly used techniques were used by the main characters.\\n\\n\r\nThis maybe a biased review but this anime is worth watching. My final score would be 9. :)",
            "date": "2014-03-27T11:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 137247,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1861758.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KandaSorata",
                "username": "KandaSorata"
            },
            "url": "https://myanimelist.net/reviews.php?id=137247"
        },
        {
            "content": "Strike the Blood is one of the sexier animes out there. The story isn't very rich and is a generic \"new enemy, new strategy, find a way to defeat him, move to the next one\" show. The main character's development moves a bit slowly for my taste but hopefully that's indicative of multiple seasons. The action is a bit generic as well, but better than some. What sells this anime though is its harem quality. The characters are attractive and the show is quite ecchi, without going too much into cliches. It has potential, that's for sure, and the manga is probably quite a bitbetter. A good quality about this show is that even though it involves vampires, it strays from the general vampire setup and gives some semblance of originality. I give this show a 7 or 8 overall and a 8 or 9 in terms of the ecchi world.",
            "date": "2014-05-12T00:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 143053,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3404479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/UponAShallowBay",
                "username": "UponAShallowBay"
            },
            "url": "https://myanimelist.net/reviews.php?id=143053"
        },
        {
            "content": "strike the blood definitely has its moments where it has you hyped and dying to see what comes next with it being visually stunning and continuously changing with its plot, but i personally find the beginning to be slightly slow in getting the viewer interested into the story but it without a doubt has u submersed into it as everything progresses throughout the story with the complicated flirtatious romance that is going around in a wild love circle between the majority of the characters. the fan service can be slightly overwhelming to some viewers and may push some female viewers away but for those whoenjoy or can get past it they will see how it deepens the bonds between the characters with the fourth progenitors vampiric urges and how he decides to face the problems that confront him.overall this is a great anime and i highly recommend it to those who enjoy a more unique less generic fighting style and a more graphic romance with a bit of adventure included then this is defiantly for you.",
            "date": "2014-05-17T18:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 143611,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3782045.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Holyducky",
                "username": "Holyducky"
            },
            "url": "https://myanimelist.net/reviews.php?id=143611"
        },
        {
            "content": "What happened?  \r\nThis anime's story started out very strong and kept my interest for at least the first 3 episodes.  Around the 5th I started having misgivings about it though.\r\nA solid story turned to bland and by the end your only watching the last 2 episodes to say \"I Finished It\".  \r\nIt feels the ending was rushed out the door, there's some really bad animation sequences in the last 2 episodes, and the timing seemed really \"off\".  Characters appeared from nowhere with neither fanfare or explanation too.  It's not until the end you get their introduction and by then it'sfar too late.  The story line was just garbled up with no saving in sight. \\n\\n\r\nSo if you want to waste your time on this anime then go ahead.  While it's not complete rubbish it's also nothing to write home to mom about either.  If given the option to do it all again... I'd say \"No thank you.\"",
            "date": "2015-10-07T12:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 200712,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1112169.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thumpz99",
                "username": "thumpz99"
            },
            "url": "https://myanimelist.net/reviews.php?id=200712"
        },
        {
            "content": "The protagonist, Kojou Akatsuki, is considered out of luck, being gifted a position as 4th Progenitor by his predecessor. Due to his new position as 4th Progenitor, his everyday life as a normal boy schooler changed and surrounded by many abnormal people nowadays. From observers, Sword Shaman, War Dancer, a mage, royal family, to other Progenitors. Not all of em is a woman of course. The way he lives his life now is full of bloodshed and showdown, circling around in daze cases. Somehow with the power he has in the present anyway, he can do something for the sake of others.Like other anime series for genre action and fantasy with nice graphics & artworks as the main point, Strike The Blood is also that one, outstanding fighting scenes with the good details on its aspect. The colouring is not an eyesore, just deeper but with good radiant. The feeling of enormous battle is intense, that's how I enjoy this series.\\n\r\n    The characters development is quite good even with the episodic type of story, we can see how these characters grow up a little bit. Sometimes an episode will just focus to a character but on the other hand the viewers can also find the case when more than just two characters involved and gives more colour to the story. Since this anime isn't the type to just set the viewer eyes to just certain persons, it is easy to detect other characters present—yet there are sooo minor here. Can't describe if I have a crush for those minor characters too lol\\n\\n\r\n    Errr..what's next? Strike The Blood theme songs I guess. Well, this series has 4 theme songs, each two songs for OP and ED. Strike The Blood OP first halfway by Kishida Kyoudan & The Akeboshi Rockets \"Strike the Blood (ストライク・ザ・ブラッド)\" and \"Fight 4 Real\" by ALTIMA. And for the #1 ED theme song is sung by Kanon Wakeshima  \"Strike my soul\", and #2 is sung by Yuka Iguchi \"Strike my soul\". I can't say much seeing that these four are simply decent.\\n\\n\\n\r\nFrom all aspects above, I rate the series 7+\\n\r\nPros:\\n\r\nNice graphics\\n\r\nWith so shounen plot, characters improvement still have its portion\\n\\n\r\nCons;\\n\r\nMany unusual terms, hard to remember\\n\r\n(For me it's so unfortunate) Episodic plot\\n\r\nIt's harem is damn maximal",
            "date": "2016-07-23T22:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 224800,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224800"
        }
    ],
    [
        {
            "content": "Cock-Block the anime. That is what this is. If you came to see a overpowered vampire lord beat the hell out those who deny him the ability to have a harem you will be surely disappointed. But at the same time let me say that this anime suffers from the all too common \"It's bad because it wasn't what I was expecting it to be\". What I just said might sound conflicting and even as I wrote it and am writing this it still seems to be. Let me explain.....\r\nOne look at the tags this anime has to offer and you can sum up theentirety of this show. A vampire who goes through the show unintentionally building a harem through no reasons other than the fact that he is a vampire and looks like every other MC. Oh and by the way he is also nice. That's all this anime is, there is nothing original about it, the only decent thing it accomplishes is it's world building but with all the possibilities they give themselves thanks to the world they have created, they completely and utterly squander it. Horribly. Everything about this anime is so basic that you could use it as a template to become a star in the world of neckbeards.\\n\\n\r\nDue to the possibilities that this anime gives themselves, they could do so much with it but instead they do nothing. Or at least nothing note worthy. The characters are basic, the plot is basic, the art is basic, it's just basic. That is if you're looking for a decent anime involving a powerful harem leading vampire king endlessly overpowering all those who would oppose him and building up his kingdom and be recognized just like all the other... well you get it. But no, that's not what this anime is nor is it what it tries to do. This anime is, and should be used, as possible boner build up materiel before you switch to something more powerful.\\n\\n\r\nNow let me further explain why I called this the cock-block anime. \"No Senpai this is out fight\" Ow0 That is what you're going to get every time something is about to happen. I am not trying to spoil anything all I am saying is do not expect anything meaningful or interesting to happen with the main character. Every time something could happen involving the main character and another character, our side support comes in and cucks him yelling the all too familiar line of \"No Senpai this is our fight\". \"Please for the love of God stop\" is a line I found myself saying over and over as I struggled to finish this anime as I don't like dropping.\\n\\n\r\nI would recommend not watching this, it's just not really worth the time in my opinion. If you have nothing else to do or for some reason feel like you have to watch it, then all I can really say is just don't expect much out of it. Even in the world of ecchi harem, it's pretty bad and the ecchi is rather mild if that's what you're looking for.",
            "date": "2019-02-16T21:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 301825,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4818370.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/krazykombat",
                "username": "krazykombat"
            },
            "url": "https://myanimelist.net/reviews.php?id=301825"
        },
        {
            "content": "Although i have tried not to put any real spoilers in, there may be one or two but nothing that would spoil the ending.\r\nSummary: Overall 7: Could have been better, especially with 24 episodes, there wasn't that much character development.  If this anime sounds like something you might enjoy, i recommend watching about 6-8 episodes, if you enjoy it then carry on watching, if its not really your cup of tea don't bother continuing, the same thing happens over and over again just with a different bad guy.\r\nStory 6: i really like the concept and the ideas within the story however there was noprogression.  The main guy was pretty much the same at the end as he was in the beginning.  everything seemed repetitive, i guess there are some things that were put in for that reason, but ultimately it got tiring.  Also i really wanted there to be some sort of progression with Asagi, but it never happened, even after Kojou promised her many times he would tell her what was going on, I wanted to see how that relationship would have worked out.  I think it spent too much time on Kojou and Yukina (i suppose they are the mains though so this isnt much of a complaint).\\n\\n\r\nArt 8: Standard modern style of anime, cant really say anything other that it was standard anime.\\n\\n\r\nSound 8: Again, fairly straightforward.  decent sound effects and the voices for the characters were pretty good.  the main guys voice annoyed me at first but after about episode 3 i was fine with it.\\n\\n\r\nCharacter 6: I liked all of the characters really. however the ones that are classed as side characters (even though they are fairly main) i preferred over the main two.  i also think since it was 24 episodes long, more character progression could have taken place.  when a new character was introduced, the relationship to the main was pretty much sorted at that moment, there was no real advancement, even between the two mains.  I also think too much time was spent on the interaction between the two mains and not enough between Kojou and the other girls that were attracted to him.  I know this doesnt sell itself as a harem but it blatantly is, so i think they should have spent more time on other characters relationships to Kojou.\\n\\n\r\nEnjoyment 6:  I enjoyed Strike the blood at first but then found myself wishing something different would happen in each of the arks, they were very repetitive.  By episode 18 i was thinks \"when will this end, i have to finish it off now but i really wish something else would happen\".\\n\\n\r\nOverall 7 (i used a calculator to get an average of 6.8, Yes i really am that sad): Its never good when you're wishing an anime to end, but unfortunately thats what Strike the Blood did to me.  I really like the concept and the ideas in the story, i only wish they were done better and as ive said many times in this review, i wish each ark wasnt a repeat of the last.\\n\r\nI can understand why people will watch this anime and think it is really good though.  i would not tell anyone not to watch it, however, for me it was just off, nearly a perfect fit for me, but there were just those few little things that lowered its overall score.",
            "date": "2014-06-10T11:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 146541,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1271685.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jambai",
                "username": "jambai"
            },
            "url": "https://myanimelist.net/reviews.php?id=146541"
        },
        {
            "content": "Actually, I feel like this a really easy anime to review. And because of that, I'm going to make it short (easy to read), and still what would have been immensely helpful to me.\r\nIf you don't like the relationship between Kojo and Yukina, it doesn't change. Drop the anime. I really don't like to drop anime because usually there are redeeming qualities and I want to know how everything plays out. But in my opinion, their relationship really is a deal breaker.\r\nOtherwise, this is going to fit the bill of your other \"powerful protagonist series\". I enjoy these kinds of series, and excluding Yukina andKojo, this would have been no exception. Kojo is cool, there's action, excitement, I definitely feel like the plot/whatever is original enough, and it's enjoyable. Something I would want to watch.\\n\\n\r\nIf you don't enjoy the powerful protagonists, and you don't enjoy Yukina, then definitely don't watch this anime. If you just don't like their relationship, I really wouldn't recommend it, I would just drop it. Otherwise, this is a really solid show to enjoy watching.\\n\\n\r\nAs a final note, WOW, the front page reviews are novels. If you'll just trust me guys, really, it's simple.",
            "date": "2015-12-30T22:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 207355,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Falo13",
                "username": "Falo13"
            },
            "url": "https://myanimelist.net/reviews.php?id=207355"
        },
        {
            "content": "(WARNING) This review contains spoilers. Best to go watch before you read. \r\nReview Video: https://youtu.be/ZpSXIm7GbEA\r\n---------------------------------\r\nSo many unanswered questions.\r\nAs we all may know kadokawa is famous for their  harem/demonic/ ecchi series. High School DXD, Testament of New Devil Sister, and High School of The Dead. Today we are going to be looking at one of their series that came out in 2013 \"Strike the Blood\".Now before we get too far into this, I want to let you all know, that even though I'm going to be pointing out some good and bad in this review. I actually did enjoy the series to the point ofre-watching. \\n\\n\r\npremise: \\n\r\nThe, basic story, is focused around our protagonist Koujo and our female heroine Himeragi. koujo was your normal every day highschool student until a prior vampire acquaintance of his forces him to become her successor. Known as a progenrator. \"Spoiler\" Koujo is said to be the strongest.\\n\\n\r\nList of questions 1: useless hoody\\n\r\n Straight out of Episode one I already had questions, like why our main  character is walking around with a hoody on complaining about the heat. I guess it could be to conceal his identity as a vampire or hide from the sun. But then again we have this other vampire dude  who is able to walk around in day light and is just fine. not to mention Kojou's vampiric instincts and traits don't even start to show till he is turned on by the opposite sex, so why the hoody? \\n\\n\\n\r\nIn the story about midway into episode 1 We find Koujo going through a motion like he's suffering from a killer hangover or migraine. This was brought on by Himeragi questioning him about how he was once human and was able to become a progenator. Koujo then replies \"Sorry, himeragi I can't remeber anything from that time, every time i try I'm wracked with pain..\". .... Uh ok.. What and Why does this happen? The story never goes in any further as to why koujo can't remember, anything from the incident.  or as to who or what is responsible for it. I can only assume, that Avorora some how erased his memories, or that this is the price he had to pay for becoming the 4th progenator. In episode 1 we see scenes that serve as flash backs where Koujo attempts to stop Avarora from doing something before she turns to ash in his hands\" But nothing that shows where him becoming a vampire starts, or anything that references why he can't remember anything from the incident. The only other thing I can think of is, maybe it's trama from the incident. Or The writer just felt they had to add some type of drama to the story in that regard, but then completely forgot what the reason behind the drama was.  it leaves us in the dark about it, as this topic  is never brought to light again through out the rest of the series. \\n\\n\\n\r\nNow don't get me wrong this series has it's good points. It's got some pretty good comedy moments, and if your into the ecchi like I am you got pretty much all you need, I mean it's kadokawa. But the story leaves so many unanswered questions. For example: in episode 15 and 16 Why Kojou's sister just so happens to inhabit Avarora's spirit. And Why Kojou's mother knows about it, not to mention how kojou denies the fact that his mother has  any idea that he's a vampire, even though we know she does because she knew he was injured in the exact spot where himeragi's spear hit him.  I even watched the OVA's  thinking that maybe we could find out more about these unexplained events. But nope the OVA'S  just dove into a completely different plot. \\n\\n\r\nSome other things that really just grind on my nerves. Was the constant over use of  \"From here on this is my fight!\" \"NO senpai this is our fight\" they could of at least switched the lines between the characters every once in awhile. To mix it up a bit. \\n\\n\r\nThere's still time for me to speak about how I loved that the Akebanashi Rockets did the first opening theme. I wasn't too found of the second theme though, I've never been a fan of Japanese mixed with English themes. \\n\\n\r\nAs far as the series is in general I honestly believe the whole harem thing was done way better in High School DXD and Testament of New Devil Sister. The irony in that is DXD was released one year prior of Strike the Blood, and Testament of Sister new Devil was released two years after. But on a scale of 1-10 this series ranks a anywhere from 5 to a 7  in my honest opinion. It's watchable, funny, and matches it's genre tags. So if you like harem Ecchi series, Give this one a go. But avoid if you want a full story.\\n\\n\\n",
            "date": "2016-04-30T09:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 217499,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5290831.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OtakuDeity",
                "username": "OtakuDeity"
            },
            "url": "https://myanimelist.net/reviews.php?id=217499"
        },
        {
            "content": "This is a thoroughly average anime that doesn't really stand out at any off its aspects.\r\nWe have a story about formerly normal guy that recently got super powers. There's shounen, some comedy, and attempts at ecchi, romance and fanservice. \r\nStory:\r\nFairyl weak, but does its job. The story pretty much follows every trope of the genres involved, and occasionally tries to play with ecchi, fanservice, and jokes that revolve around getting protagonist into \"ecchi\" situation, and then getting him called a pervert Those situations are somewhat awkwardly handled on some occasiona. Mostly the story maintains average quality, with exception of the few last episodes that werequite awful. Lots of highly predictable and stereotypical interactions and story elements.\\n\\n\r\nArt:\\n\r\nStandard anime art for those days. Triangular faces, details only when necessary. I've seen worse, though, so it is a fairly well done \"standard modern anime art\", and not an attempt to cut costs at every corner.\\n\\n\r\nSound:\\n\r\nSome interesting tunes in background, but nothing really stands out.\\n\\n\r\nCharacters:\\n\r\nHighly cliched and stereotypical interactions between characters. Characters are quite close to their stereotypes, don't deviate from them too much, which results in somewhat wooden interactions. Protagonist is clueless around women, thankfully he isn't spineless. \\n\\n\r\nEnjoeyemen:\\n\r\nAside from bad episodes at the end, the show doesn't give a reason to hate it. At the same it is not exceptional by any means, and may occasionally produce a chuckle or two. Meaning I wasn't bored to death it, but I could probably watch something better instead.\\n\\n\r\nOverall:\\n\r\nMay be worth a watch if you're into shounen anime or want to watch couple of fights. The protagonist, thankfully, doesn't turn angst and preaching to eleven, and only occasionally starts shouting obvious, which makes it tolerable. If you're looking for ecchi or harem comedy, there are better animes out there (To Love Ru, Ben-Tou, etc). This anime handles ecchi in awkward manner, plus there's not much of it, and romantic/\"harem-comedy\" kind of interactions are incredibly stereotypical and sometimes feel forced.\\n\\n\r\nSo, basically, it is a relatively light (despite having blood in it) anime to watch, if you have some time to kill. I found few ending episodes to be cringe worthy, but I suspect that at this point studio might've run out of light novel material.",
            "date": "2016-12-25T03:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 236450,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=236450"
        },
        {
            "content": "Itogami Island is an artificial island not far from Tokyo, one of the many \"Demon Districts\" that was home to demons and other mythical creatures. They live along side humans and were protected as endangered species while under observation for research. Kojou Akatsuki had discovered himself one day as a vampire with no memories of his past as a human. Not only that, he wasn't the average vampire either. He had become the \"Fourth Progenitor\", a powerful vampire that who can take out an entire human army if he desired. However, he has no such thoughts and continues living as a normal senior high studentas best as he can while keeping it all a secret. One day Yukina Himeragi is sent by the Lion Organisation in Japan to observe him and was to eliminate him if he was considered a threat. Meanwhile, not all is at peace and Kujo soon finds himself relunctantly honing his skills to protect himself and the island as he is caught up in various incidents.\\n\\n\r\nShow's based on a light novel series and has an interesting world setting. It's not the first time a Japanese title tried to fuse technology and magic together though. Despite the protagonist Kojou being a vampire, the main plot is more about how humans and demons try to live together in harmony but obviously some aren't happy with the way things are. Kojou having just gained the power of a vampire happens to experience both sides of the world and ends up wanting to maintain the peace. His genuinely nice character and heroism ends up winning the hearts of all the girls he comes up across.\\n\\n\r\nOf course, this also becomes an excuse for ample fan service as there is plenty of nudity and your usual \"accidental\" sensual situations like groping. The female cast willingly tries to arouse Kojou so that he would take their blood during \"dire\" situations so that he can awaken and take command of a new power. Obviously the show is aimed at the male audience but at the same time, there's just enough happening to stop the show from turning into a complete mindless fan service show. And believe it or not, there's actually romance.\\n\\n\r\nOther than that, background art's good and fight scenes are short but well animated and intense. There's a bit of gore but not too many. The OST is good too but the theme songs are so-so. Characters are cute - you've got Yukina who's easily flustered and, Natsuki a loli AKA \"Witch of The Void\", a firm teacher fond of gothic fashion. It's fun watching your usual Anime personalities bicker and, your nice guy completely oblivious to all the girls falling for and fighting over him despite all their initiative. The lines \"This is my fight!\" followed by \"No, Senpai. It's our fight!\" becomes pretty stale.\\n\\n\r\nThe plot barely moves in season 1 and feels like Kojou is fighting against lots of random terrorists at first although, maybe it was just building up the relationships between the characters and revealing more of the world setting. It isn't until the last few episodes of the show, does the story go back to Kojou and reveal more about his powers and forgotten memories.\\n\\n\r\nOne for the guys.",
            "date": "2018-09-18T06:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 289330,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7426800.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xcomprr",
                "username": "xcomprr"
            },
            "url": "https://myanimelist.net/reviews.php?id=289330"
        },
        {
            "content": "Honestly, don't think I've been more disappointed in a anime before.  \r\nFirst let's start with how bad annoying the characters are.  Kojou Akatsuki becomes what they call in the story the Fourth Primogenitor which is supposed to be the strongest vampire alive.  Yea, no instead what we're shown in some weakling, that gets followed by one of the many girls added to his harem (every arc he bites a new girl and they become an addition lol) named Yukina.  Yukina is a middle school girl that is tasked with OBSERVING Kojou.  Observing is supposed to be just watching him andmake sure he doesn't do anything evil.  What she really does is carry this weakling every fight, and get in the way every fight.  Along with with that she for some reason regulates and gets upset whenever he meets another girl?\\n\\n\r\nOh, I forgot to add the harem this guy Kojou has is pulled from not only High School students because you know he's in High School but also the friends of his younger sister in Middle School.  Okay, but what about the world's strongest vampire?  What powers does he show off?  How awesome is he?  He's the furthest from a badass awesome main character as you can get.  Let me explain the cycle for each arc: Kojou the Weakling goes to fight someone, he gets killed (but not really because he's an immortal vampire, the newest addition to the harem lets Kojou bite their neck (but you just know the observer/stalker Yukina has to have a part in this as well because apparently she has to control that as well), Kojou then gets a new familiar after biting neck, he wins, yay new girl added to harem AND for the next arc start the whole transition over.\\n\\n\r\nNow the story.  We start off with Kojou just being the Fourth Primogenitor, we get weird flashbacks about the time it happened but there's literally not a single explanation about what actually happened.  The plot is lackluster, boring and basically recycles the same thing again and again.  I don't think I've seen a more boring anime since I started watching and that's saying a lot.",
            "date": "2018-03-06T21:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 273240,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6476614.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/sbmike",
                "username": "sbmike"
            },
            "url": "https://myanimelist.net/reviews.php?id=273240"
        },
        {
            "content": "They managed to make a show about vampires completely bloodless.\r\nAbout the kindest thing you can say for Strike the Blood is that it's not screamingly bad in any particular way. Rather it's uniformly, monotonously bad; bad in every single way that an anime of its general description might turn out to be bad. Now bad shows are a fact of life and nothing to get excited about, but the fandom's toleration and acceptance for bad shows like this is a real shame and only encourages the studios to keep turning them out instead of something actually worthwhile.\r\nSutoBura actually begins reasonably well. True, the first episodebegins with an unnecessary and confusing narrative prologue, in which anonymous voices portentously explain the main character's back story, but after that the actual content is solid if unimaginative. We're introduced to the setting of an artificial island city built to safely contain magic-users and demons away from the main Japanese population – an effective concept that should have starred as practically a character in itself, but ends up in later episodes feeling completely neglected and undistinguished from any random ward of Tokyo. We meet the two main characters and set up some promising tensions between them. Himeragi, apparently, has been assigned by some kind of powerful supernatural organization to investigate Akatsuki, who simply wants to be left alone in peace despite his recent unwanted conversion to one of the world's most powerful vampires, and therefore a focus of intrigue and suspicion. Of course, they're a young boy and an even younger girl, and the usual tsundere harem love-hate dynamic is clearly seen to be developing. And there's an action scene involving some random street punks that, if a bit of a cliched throwaway in concept, at least does introduce both main characters' fighting styles and supernatural powers. Okay, none of this is earth-shattering but it does at least seem to set up a serviceable, not-too-serious high school harem action comedy-drama, which is all I was ever looking for here.\\n\\n\r\nAnd then, over the interminable 23 following episodes, it falls apart faster and more comprehensively than one would have thought possible. The series develops into a series of 2-4 episode arcs that are effectively \"Monster of the Week\" affairs. But the plot-development scenes that string the fights together are interminable, wooden gab-fests. We're lectured about complex conspiracies and clashes among a host of supernatural factions that never have any clear motivation and never actually appear on screen. And none of it really matters anyway because the resolution inevitably comes in an unimaginative fight sequence decided by the protagonists' inherently superior magical powers, while the villains stand around shouting something along the lines of \"Masaka! Is this the power of yada yada, that can defeat even my blah blah??\" But maybe we should be grateful for the sheer incomprehensibility of the supernatural bullshit, since when the plot turns on ordinary human powers it's often laughably illogical.\\n\\n\r\nAfter the first arc we're introduced to a recurring semi-villain character who adds a delicious extra layer of inanity by showing up every so often, after something (apparently?) important has occurred, to stroke his chin and muse aloud evil-ly about how whatever the fuck just happened was actually just a brilliant manipulation he engineered in accordance with his own, still deeper plan. Pay attention, aspiring writers, this is how you make it in the light novel business.\\n\\n\r\nAs for the lighter, high school harem aspect of the show? The food is terrible and the portions are too small. The Himeragi relationship starts out okay but settles into an unimaginative tsundere thing; she's constantly \"accusing\" Akatsuki of horrible crimes such as wanting to kiss girls, but of course, these accusations are baseless and crazy since he's actually a passive, clueless dork. The other girls mostly just lust after Akatsuki for no real reason, some adding their own halfhearted \"actually I hate you\" tsundere routine and some not, according to taste. There's very little in the way of humor or entertaining byplay, mostly just Akatsuki walking in on girls, over and over. The attendant fanservice shots aren't even very good on a purely pornographic level; they're both artless and, largely, tame.\\n\\n\r\nEven the chud who wrote this couldn't quite miss that vampires are supposed to be awesome inhuman monsters and that vampirism is all about power and sex. Akatsuki is introduced as someone fairly revolted by blood-sucking, having always suppressed his urges. Of course, he ends up forced into it by circumstances, and of course it's with a cute girl who he's already in some kind of ambiguous relationship with. But the resultant story beats are rushed and emotionless. The perpetrator doesn't fret much over the monstrous nature of the act, and doesn't afterwards struggle with an increased thirst for blood and compulsion to feed on innocent victims. The \"blood donor\" doesn't seem to really risk anything in the process; she's neither traumatized nor transfixed. She just makes a little bit of a sex moan and then falls asleep for a while and then afterwards everything's cool. You'd say it had all the human consequences of a botched grope session between two teenagers in the gym equipment room, except that actually, that's overstating it, if you consider how emotionally fraught that kind of thing is when conducted among actual human teenagers rather than poorly written anime protagonists.\\n\\n\r\nOn a purely visual level Strike the Blood is mostly serviceable though not pretty. The budget seems to have gone mostly into fight scenes (not that these are lavish) and a lot of the slower, talky scenes are virtually static, with characters' facial expressions sometimes mismatched to their VAs' performances. There are a few moments of outright \"QUALITY\" and a number of what seemed like contrived excuses to cut down on animation expenses, such as a scene staged on a cargo ship among featureless shipping containers and a fight involving stiff, clumsy looking robot soldier enemies. As I said up front, none of this stuff is really outrageously bad, it just provides no relief from the all-around badness. Nor do the unmemorable soundtrack and voice performances.\\n\\n\r\nOn the whole this is just not worth anyone's time, and a prime example of the plague of god-awful light novel adaptations that is ruining anime.",
            "date": "2017-12-27T11:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 266535,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5958412.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/2dWasAMistake",
                "username": "2dWasAMistake"
            },
            "url": "https://myanimelist.net/reviews.php?id=266535"
        },
        {
            "content": "Warning this review may contain spoilers.\r\nFirst impressions, so my thoughts where ok this is probably going to a generic light novel harem show with probably a few interesting or entertaining about it.\r\nI was getting a feeling that this show is going kind of like a certain magical index and for the most it kind of was. \r\nStory, 5/10\r\nSo the story of strike the blood is basically like most generic light novel harem story's like for example  a certain magical index or Shakugan no Shana.\r\nBut to go into  more detail what the story is actually about.\r\nThe story's Starts off with are main kojou akatsukiwho though a series of events becomes a vampire while he is living in the demon district of itogami city which is a man made island of the cost of Japan where super natural beings known as D types,(which are basically vampires, demons and what ever else)\\n\r\nthat live side by side with humans. Which is happening because of a treaty  between humanity and the three vampires known progenitors who rule over certain areas of the world.\\n\\n\r\nWe then find out that that kojou is no ordinary vampire, big shocker there \\n\r\nbut a vampire known as progenitor.\\n\r\nHe is known as the  infamous forth progenitor which is a title that is basically demonetized as an agent of chaos which seeks to destroy the Balance  of the world and what not.So while trying to hide the fact he not longer human or this progenitor vampire.\\n\r\nHe then finds out that he is being watched by an agent of the secret organization lion king named  yukina himeragi a sword shaman apprentice, god that's a mouth full.\\n\r\nWho has been tasked to watch him and to kill him if he ever becomes a threat to the stats quo. Even though from what I have seen he seems that he only a threat to the purity of the local girl population that seem to throw them selfs at him but that besides the point.\\n\r\nSo basically the story is about the day to day adventures of kojou and yukina.\\n\r\nWhich are pretty much the cliche of day to day adventures which nothing much interesting about them. You got evil corporation, terrorists and people who want to blow up shit because reasons. \\n\r\nBasically what happens in the story is that  things are pretty normal you all the school life and harem what not then shit goes down with some bad guys then main character drinks another girl blood gets power up and then beets bad guy and  repeat and that is the plot in a nutshell.\\n\\n\r\nNow I don't have much of a problem with this kind of bare bones story.\\n\r\nBecause even story's like this have sort of charm to them and strike the blood seems perfectly fine being just that.\\n\r\nWhich is fine because at lest it being honest about what it actually is unlike shows like  sword art online or shakugan no shana which tried to make it seem more deeper than it actually was. Because when you pull back the layers you can see for what it is plan as day a generic light novel  harem show.\\n\r\nBut the flip side to that It's very generic and full of the usual tropes and cliches.\\n\r\nI think in retrospect  what could have made this show stand out more is that it of been about the main character slowly building his own kingdom from the ground up or makeing some sort of name for himself While picking up more chicks In between.\\n\r\nWouldn't that be more interesting.\\n\r\nBecause This lion king organization is afraid that he going to do that.\\n\r\nPlus in the anime it has been confirmed at the end of the anime that he dose actually build himself an actual kingdom in the future. \\n\\n\\n\r\nCharacters, 5/10\\n\\n\r\nThe main character kojou is pretty bland to say the lest when it comes to his personality. He basically the nice guy which you should never ever piss off.\\n\r\nBecause when his wifus get hurt then shit is going down.\\n\r\nBut I guess one good thing about is that he quite intelligent and try's to figure out ways to deal with his opponents so I will give props to that.\\n\\n\r\nThe side character are pretty much the usual harem stereotypes.\\n\\n\r\nYou got the love interest, you got the child hood friend and etc. \\n\\n\r\nNow even though they where pretty generic for the most part I had quite a bit of fun watching the character interactions.\\n\\n\\n\r\nArt, 6/10 \\n\\n\r\nThe animation was ok for the most part.\\n\r\nNothing amazing about it, but at the same time it isn't a bad looking show.\\n\\n\r\nThe art style is pretty generic nothing really stands out.\\n\\n\r\nThe character design are also generic.\\n\\n\\n\r\nSound, 5/10\\n\\n\r\nBoth op and end songs didn't really stand out that much to me.\\n\r\nBut I think the only one I liked was probably the second op because it had an ok beet to it. But other than very thing else was pretty forgettable for me.\\n\\n\r\nSo if you like ost you probably not going to find any thing of interest here.\\n\r\nBut you know ost are subjective so there may be something that may have your attention.\\n\\n\r\nEnjoyment, 6/10\\n\\n\r\nKnow even though I found  this show quite generic in retrospect.\\n\\n\r\nI did find it quite entertaining.\\n\\n\r\nI kind of like that even for today's stands it pretty tame for a harem which meet I wasn't always going to have boobs in my face all the god dam time.\\n\r\nPlus I also like how straight forward it is in story and characters which kind of makes it relaxing to watch. \\n\r\nWhich is quite funny because this show has quite a bit of action in it.\\n\\n\\n\r\nOverall, 6/10\\n\\n\r\nIf your new to anime then I think that strike the blood would be a pretty ok show to help you get into anime more, because it is quite generic with all the usual tropes and cliches that you would find in there types of story's so it a very good entry level show.\\n\\n\r\nNow if your an experienced anime watcher then probably stay away.\\n\r\nBut if your into harems and all that good stuff and what to watch strike the blood for that you can probably find it better else where in another show.\\n\\n\\n\\n",
            "date": "2016-06-25T02:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 221835,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4681991.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Biogundam",
                "username": "Biogundam"
            },
            "url": "https://myanimelist.net/reviews.php?id=221835"
        },
        {
            "content": "So I come fresh, never read the LN or manga. And I usually love what I watch but I'm torn on this one. I don't know what's up with this anime. It's like trying all ind of genre and story. All 24 episode only filled with action, no interlude, no some kind of break, no character explanation, and just jamming the story with no background what so ever.\r\nAll of the bad guys don't have any kind of explanation or connection to the story. They're bad because they're bad guys. The story never really move forward, just another \"Ah. Bad guys show up, get new power,beat the bad guys\". There is a lot of character but all of them are really shallow or background that never explained.\\n\\n\r\nIf you're doing something, do it right. Planning to do romance or love then don't do it half way.",
            "date": "2017-11-07T00:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 262706,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4707765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PoDH",
                "username": "PoDH"
            },
            "url": "https://myanimelist.net/reviews.php?id=262706"
        },
        {
            "content": "Hello AnimeArbiter here and I have taken the task to review “Strike the Blood” today!\r\nNow that I have finished watching it, I just have one word to say. No two words actually. Virgin blood and panties. These two words pop into my head when I hear the title of the show. My journey through the story have been not very comfortable, many bumps and several holes that were made by moles. Anyway, let us start with the judging!\r\n(The story 3 out of 10)\r\nThe plot in a simple way to say is about vampires, magic, and harem of course. Beginning is unoriginal and very generic, butI will not hold it against the show because many other ones does have the same start and I did not hold it against them either. Now the story is one of most important parts for me, I am the type who can watch a show with bad art if it has a great story. \\n\\n\r\nWe have the random typical high-school student who becomes the “Fourth Progenitor”. Which is the equivalent of a vampire lord in other shows and it exists only three other lords aside from him. Now the question is how did he become like this? Well it was nothing interesting there, just an accident.\\n\\n\r\nThe harem part is bad as always. Now I have nothing against harems, but I am tired girls falling in love with the protagonist just because he is a “nice guy”. Honestly is just gets tiring and it makes me just wonder why not just make one of the girls the type who is power hungry or someone he have known for a big part of his life and had contact with a lot. So do not get your hopes up for this part. Anyway, the fanservice is nice and they do not overdo it to the point that it destroys the mood all the time and that is a plus.\\n\\n\r\nBack to our protagonist he lives in Itogami City. This is the place that all demons is to be sent to live “secretly”. Because we all know that in anime that always works with all those explosions and destruction. I think we will just leave it up to anime logic and go on.\\n\\n\r\nWhat I think is worst is with the story is the predictability in “Strike the Blood”. It can be compared to Rosario + Vampire and we all know how predictable that was if you have watched it. As usual, we have our daily guest Mr. Villain doing something “evil” and the protagonist can’t defeat him so what does he do? Well it is sucking time! No, not that kind of sucking you are thinking about, but the blood of one the attractive girls and bam! We have the power up that the main character gets and beats Mr. Villain and like that, it happens every time. This was okay the first and second time, but doing that again the next time and then doing that again after that and so forth got irritating very fast.\\n\\n\r\nPlot twist is one more thing I want to talk about, this part of the story it does not handle very well. My only motivation was the fighting scenes that I admit was a bit enjoyable even though it was predictable.\\n\\n\r\n(The art 7 out of 10)\\n\\n\r\nI liked the art it was pleasing and nice, nothing groundbreaking though. What they should have done though is to make the characters unique, because most of them did not stand out and you will most likely forgot about them. As said earlier it is pleasing to watch and is nice, but what it lacks is an original style.\\n\\n\r\n(The sound 6 out of 10)\\n\\n\r\nAverage at best barely six out of 10 if it was not for the ok openings and nice background music occasionally. Other than that, it was generic and nothing that stood out.\\n\r\n(The story 4 out of 10)\\n\r\nThe characters are normal, nothing outstanding. We have the normal high school mc that is somebody special for some reason. The characters in the show is most likely ones that you will forget about in maybe a month or two.\\n\\n\r\n(The overall 5 out of 10)\\n\\n\r\nEven though the horrible story and disappointing characters I still have to give it a 5 out of 10 because I enjoyed the show a bit when I watched this on a tiring Friday and I enjoyed it because it didn’t have this complex story and that is the occasion I recommend this for. When you are tired from school or any type of work and you want something simple to then this is what I would recommend.\\n",
            "date": "2015-07-01T13:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 191942,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642855.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Project-Emrys",
                "username": "Project-Emrys"
            },
            "url": "https://myanimelist.net/reviews.php?id=191942"
        },
        {
            "content": "When I was first introduced to STB (Strike the Blood) by someone whose taste in anime generally matches mine, I was a bit surprised. I didn't think that a show with tags like \"ecchi\" and \"harem\" could be what I consider a good show. My, was I wrong.\r\nAs you may have noticed from my rating for this show (8), I actually really enjoyed it. For me this is a very casual show, one that you can pick up or \"pause\" any time, as it doesn't have a very important story to follow or any details that you have to be careful not to miss ifyou want to enjoy STB to it's fullest, because the show's strengths lie not in the story, but in the simple and fun stupidity accompanied by some pretty good action and of course don't forget the ecchi part of it (unless it's not a something you like at all, in which case, this show is probably not going to be all that enjoyable for you.)\\n\\n\r\nPerhaps, what I like best about STB is that it doesn't pretend to be what it isn't. It doesn't pretend to have a complex story or deep character development. It's got simple fun, pretty action and it's perverted as hell. In other words, it doesn't do all that much, but what it does, it does great.\\n\\n\r\nTo summarize, this is a show that I enjoyed quite a bit and if you are looking for something \"light\" and easy to watch, you're probably going to enjoy it too.\\n",
            "date": "2017-07-25T00:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 253727,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201503.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Akan3",
                "username": "Akan3"
            },
            "url": "https://myanimelist.net/reviews.php?id=253727"
        },
        {
            "content": "Strike The Blood What It Doesn't Strikes!\r\nStory: The originality is actually surprising with a isolated Japan island filled with demons which the humans fears. I like vampires myself that what intrigued me to watch. Now the explaining of the story is where it falls it. I didn't understand of what was thrown to me in this terrible plot. The Ecchi isn't nothing special either. I dropped this anime, and went back to Keijo at least that anime can keep my interest.\r\nArt: Its nothing special I've seen better its average\r\nSound: The 2 episodes had decent soundtracks, I can't speak for the rest of the episodes.\r\nCharacter: Whatwe have are boring characters that are not nothing special\\n\r\nEnjoyment: I didn't enjoyed it the Ecchi didn't save it for me.  Keijo does ecchi better, and the funny plot is a lot enjoyable.\\n\r\nOverall: I'm never coming back to this anime. I'm happy I dropped it because I would of been suffering. Go watch something else than this garbage filled anime.",
            "date": "2016-12-11T21:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 235301,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5894948.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Shinbu",
                "username": "Shinbu"
            },
            "url": "https://myanimelist.net/reviews.php?id=235301"
        },
        {
            "content": "Strike the blood was not what I expected when seeing the ecchi elements within the anime, which kind of ruined it for me as it didn't seem quite justified or necessary for the story, so it looked more like fan-service.\r\nI was drawn to the anime as the main female protagonist has a large sharp weapon, and she is indeed a strong character and not to be messed around with, but I felt there was not enough back story for her, or any of the other characters for that matter.\r\nThe main protagonist, being the vampire, disappointed me as it took on the typical pretty boy vampirestereotype but I guess it is unique when looking at it in an ecchi point of view.\\n\r\nAnother is that there is an obvious love story between two certain characters but this never develops into an actual romance which is a main reason to why I continued to watch this anime. \\n\r\nOverall I feel it was rushed and it should have gone into more character background but its an easy watch if you are unsure of what anime to watch next.\\n\r\n:)",
            "date": "2014-06-26T12:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 148773,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624723.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/emupingu",
                "username": "emupingu"
            },
            "url": "https://myanimelist.net/reviews.php?id=148773"
        },
        {
            "content": "This show is literal shit.  There is no overall story, just a lot of story arcs with no depth and barely any connection.  Every fight scene has the same lines at some point, and they are literally the worst lines  I have ever heard, at least it seems that way after you hear them about ten times.  So much of the plot is left unexplained because why  explain something when it makes no sense? After all its better to leave your watchers completely clueless as to who some people are for the entirety of the show.  Its so badit needs a second season just to fill in all the HUGE PLOT HOLES FOR WHICH EXPLANATIONS ARE NOT EVEN ATTEMPTED.  However, the one thing this show does well is the art, and the soundtrack, while not being too noticeable, is actually kind of nice and enjoyable.  If you want to watch young girls getting their blood sucked and mostly undressed, while calling the main character a pervert, I guess its ok. (Other anime do it better however in my opinion.)  I guess overall its kind of an enjoyable waste of your time.  However, quite a few shows do the same thing as this show (have a vampire main character in a harem setting), but they do it much better and more enjoyably.",
            "date": "2018-04-02T20:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 276609,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Conquerorofdoom",
                "username": "Conquerorofdoom"
            },
            "url": "https://myanimelist.net/reviews.php?id=276609"
        }
    ]
]