[
    [
        {
            "content": "This show is not yuri. I don't want to spend a lot of time on that fact, so I'll just throw it out there immediately and move on.\r\nSo, MAL review reader, if you're reading this line, you probably started your trek of this review by checking out the number I dropped in the \"Overall Rating\" section. Intrigued, perhaps you even clicked those words to bring up the breakdown of numbers I awarded the show for various aspects of its creation. You would then have noticed the number \"10\" in the story section and probably asked yourself, \"What? A perfect 10 in story for a comedy?How does that make sense?\"\\n\\n\r\nNormally I would not so directly reference the scores I gave in my actual review; the review is for explaining them, not reiterating them. They're just numbers, anyway. But I feel this worth the mention as it is, in fact, the most crucial part of the review and why the show is so great. I do not consider Love Lab's story worth a 10 because it's deep, or unique, or emotional, or ingeniously crafted. I give it a 10 because it is a comedy executed perfectly.\\n\\n\r\nLove Lab, first and foremost, knows it is a comedy. What does that mean? It means that through everything it does, it stays comical. It will always keep you laughing (if its style of comedy does that for you, of course). Does it have dramatic subplots? Oh yes. Three, in fact. Yet even at the climax of these subplots, it stays funny. In fact, sometimes that's the funniest part. \\n\\n\r\nAnd yet, at the same time, it never sacrifices suspense for the comedy. It's paradoxical in a way, but the show remains both serious and funny at the same time. Within the suspension of disbelief the show works under, the ways these problems manage to work themselves out are both believable and funny.\\n\\n\r\nNow, one of the worst crimes a comedy can commit is to throw in a dramatic subplot out of nowhere to arbitrarily heighten tension, then forget it when it's done and go back to normal. Well, once again, Love Lab dodges this bullet. Every dramatic subplot has something to do with the point of the show (which, if you weren't aware, is a group of girls researching how to be popular with boys), is led up to, and continues to effect the story of the show and its characters throughout. The final climax of the series is actually the culmination of the event that began the daily lives of the Fuji Girl's student council in the first place and had been building up all along.\\n\\n\r\nIf that's not comedy done right, I don't know what is. But now, where would we be without our cast?\\n\\n\r\nWith all the praise I gave the story, the characters, too, must be good, right? Of course they are. Maybe not as perfectly crafted as the story, but still plenty good. First up is Riko, the tomboyish \"wild\" one. She has zero relationship experience, but her personality makes her pretty popular with the girls. However, when she walks in on student council prez Natsuo, known around school for being beautiful, kind, and just all around perfect making out with a hug pillow (Yes, really. Not exaggerating)...one thing leads to another and Natsuo, desperate to know how to be popular with boys, ends up believing Riko has tons of relationship experience. She has been around boys a lot...but always AS one of them, not WITH any of them.\\n\\n\r\nThus begins the relationship with Natsuo as the crazy and Riko as her straight man, even if the reason for it is a bit of a lie. Most of the show's time is spent with these two, and as they grow closer, Riko's secret becomes tougher to keep and even tougher to admit.\\n\\n\r\nBut that isn't all. Coming in to help with the love research will be Suzune, the klutz and shy girl, Yuiko, the slightly-childish and somewhat tsundere, and Sayori, the money-loving and merciless smart girl. Suzune and Yuiko, unfortunately, do not really get a chance to shine. One can only do so much in 13 episodes. That doesn't mean, however, that their characters are not well realized and put to use. Suzune's shy nature, while the center of multiple jokes, is also put to use as a way to distract faculty members when the student council needs to get a hold of the broadcasting room. Yuiko and Sayori make a comedy duo not unlike Riko and Natsuo, though in this case it is Sayori treating Yuiko as her butt monkey (don't worry, it's funny in context). Both of them also believe Riko's lie about being popular and further escalate the challenges of keeping or admitting it.\\n\\n\r\nBut Sayori doesn't believe Riko's lie. Naw, she's sharp and sees through Riko. But she's not just going to let it loose; she wants to use it to her advantage and have some fun, so she does. But for as clever as she is, she manages to get into some trouble of her own, and when it comes time to face the consequences, which she is completely prepared to do, what becomes even harder for her is allowing her friends to share in the blame with her.\\n\\n\r\nOh, there are boys in this show, too. Crazy, right? A cute-girls-doing-cute-things show with sausage? I already said it's not yuri, so it shouldn't be that much of a surprise. One might expect the appearance of boys to be a strange turn that doesn't work well in the show, but the opposite is the truth. If anything, the scenes with the male characters only serve to make the show and its characters even better, allowing them to grow in a way one normally wouldn't expect from this kind of show. It's also simply a nice diversion from the paths these shows usually take.\\n\\n\r\nAnd honestly, I love yuri, but I'm happy for the inclusion of boys here (I know I said I didn't want to spend much time on this, but you've already gotten past the most important part of the review). These shows have a tendency to be kind of sort of maybe pretending to be yuri but not officially yuri so they can say it's not yuri and not polarize any given subset of fans but it's kind of sort of maybe pretending to be yuri so it gets the yuri fans, too. That's cute for a while, but, quite frankly, I'm sick of that shit. Be yuri or don't be yuri. Love Lab replies, \"We are not yuri.\" Thank you, Love Lab. Thank you for being straight with me.\\n\\n\r\nHm, okay, technicalities now. Art and music are both in the decent/good area. They're not nearly bad enough to take the show down at all, but they also don't do a whole lot to enhance one's experience. To sum it up in one word, they are \"fine.\" Standard. The character designs aren't wholly unique but distinctive enough to set them apart and animation is largely smooth, mistakes mostly being minor and unnoticeable if you aren't looking for them. The OP and ED are both pretty generic (actually, I found the OP annoying), though the insert music does tend to fit quite well and give the show a good mood when applicable.\\n\\n\r\nIf you're tired of the standard cute-girls-doing-cute-things formula but still want to see a good one, check out Love Lab. That was my situation. Heck, if you never even liked the standard cute-girls-doing-cute-things formula, you may still like this. It really isn't easily judged by its cover or title because it's just so much better than what it appears to be.\\n",
            "date": "2013-09-28T15:13:00+00:00",
            "helpful_count": 207,
            "mal_id": 114581,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/69585.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Florete",
                "username": "Florete"
            },
            "url": "https://myanimelist.net/reviews.php?id=114581"
        },
        {
            "content": "Well ... that was a freaking surprise. If someone told me, based on that synopsis, that Love Lab is a hilarious and heartwarming journey all through, I'd have him jump off a cliff into my love lab of death. Glad no one did. Regrets would be far too many.\r\nSo, where do I even begin? It's quite hard seeing as I'm still kind of thinking about the anime. I'll just begin by saying this: do not let title or the synopsis drive you off. If you think that this anime is filled with cute girls (it kind of is) doing cutesy things (it kind of is)and that's all it is, then you're wrong. Not blaming you though, I only decided to watch this after seeing a short, hilarious clip on YouTube. So yeah ...\\n\\n\r\nThe story is surprisingly good. Where majority of anime comedies fail, Love Lab managed to go up a notch. Almost nothing in the anime happens just so \"you can have a couple of laughs\". Somewhere, somehow, it all kind of ties up to the end of the story and the conclusion. It starts in a light tone which continues all throughout. Yeah, there's some drama, but it's not over the top. It doesn't try to shove tears into viewers eyes or anything. It's simply there to give more depth to already great characters. \\n\\n\r\nThe story follows Riko and Mika, two seemingly total opposites when it comes to ... well, everything. Mika is a perfect girl, nicknamed even \"Princess\", while Riko is a tomboy, nicknamed \"The Wild One\". They're both admired by other girls in the school but for all the different reason. Fate (and by fate I mean teacher) has its hands in them meeting one another and then the adventure begins. Along the way they're joined with some other (equally hilarious) characters and you're bound to like at least one of them, if not all. To be quite frank, the story is not deep, but it's extremely well executed. It's a story about friendships and how lies sometimes make it hard. Nonetheless, everything that happens is a part of the story. It's not just a sidetrack business trying to make you laugh.\\n\\n\r\nAnother impressive part of Love Lab are the characters. There are five main characters (seven if you include guys), and they're all enough unique to have their own charms and likeness to them. Mika is a delusional perfectionist who does everything on her own and wants desperately to have a boyfriend. Riko is her straight counter-part, who's \"Master of love\", and never fails to make you laugh with her comments. She's not as smart as Mika, but you admire her for what she is. Then you have Suzune, shy and timid but equally enthusiastic about their quest to learn how to seduce boys. There's also another duo of hilarity, Sayori and Yuiko; Sayori being composed, seemingly cold and detached person with quirky remarks and affinity for money, and Yuiko being not-so-annoying tsundere. All of them have distinct personalities and they all bring something to the table when it comes to comedy. \\n\\n\r\nYou see them grow closer and closer as friends, and you actually believe in their friendship and you feel worried when it feels as if it's going to collapse. There are some over the top moments, but most of the time it's down to earth funny. \\n\\n\r\nWhen it comes to the production department, it's nothing amazing but it's good enough looking to the eyes. Anime-only-comedy was done extremely well, and I really loved most of the expressions of the characters. They were cute when they were meant to be cute, and they were extremely ugly when they were meant to be ugly. Backgrounds were lacking but that's to be expected from character-focused anime so no complains there. Soundtrack was lacking as well but, from what was there, it fit solidly. \\n\\n\r\nOverall, Love Lab was extremely well done, definitely above average and on sub-par with some other hilarious comedies. Its drama wasn't there to suddenly shift the tone to dark and try to appear more mature, but to give more depth to already established characters. I really do recommend Love Lab if for nothing else but its hilarity.",
            "date": "2014-05-10T13:19:00+00:00",
            "helpful_count": 70,
            "mal_id": 142903,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=142903"
        },
        {
            "content": "I almost didn't watch this show.\r\nMy friend was giving me the rundown on this season's lineup, and mentioned that he was disappointed that the Yuru Yuri crew were working on a show that was being described as being, \"Yuru Yuri, but lewder.\" I was a bit sad, Yuru Yuri is one of my all time favorite shows, and seeing the talent behind it make, what I assumed to be, a show with the fan service dial cranked up to 11 was just a let-down. Fan service won't put me off a show altogether, but if its the central focus of the show, I tend tohave a diminished interest.\\n\\n\r\nWhoever came up with that description of Love Lab is a monster, and should feel bad. This show is nothing at all like it was described to me.\\n\\n\r\nContent wise, it's not dirty at all, the subject matter of practicing for love is presented in a charmingly innocent way. With characters who are all oblivious but earnest in wanting to know just what it takes to find love. Little to no fan service through the entirety, just smart and well paced humor with fairly low stakes character drama.\\n\\n\r\nThe art and animation are incredible, with a very good flow and perfect snap when they want to punctuate a gag. Everything flows just right, and it just FEELS good to watch. Character design fits its tone perfectly, and the voice talent is spot on.\\n\\n\r\nSure, it's another slice of life anime about high school girls in an incredibly specific and idiosyncratic club, but it does it well enough to be worth watching by fans of fun comedies.\\n\\n\r\nSo, ignore what you heard and check this one out. If you remember the awkward days of trying to understand what it meant to find love, or just like funny slice of life shows, then check this one out.\\n\\n\r\nLove Lab ended up being my surprise favorite of the season, and it demands your attention.",
            "date": "2013-07-23T13:58:00+00:00",
            "helpful_count": 59,
            "mal_id": 106501,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1771045.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SpleenMachine",
                "username": "SpleenMachine"
            },
            "url": "https://myanimelist.net/reviews.php?id=106501"
        },
        {
            "content": "Of all the things that exist in the world, perhaps one of the most debated for centuries is the concept of 'love'. Like seriously, what exactly is love? Is it a feeling towards someone you hold dearly for? Or is it perhaps something we humans are born to be part of? Or whatever the case, I'm not a scientist here to discuss the concept of love. However, what I am here to discuss is this cute little series known as Love Lab that debuted during the summer of 2013.\r\nLove Lab (also known as Renai Lab) is an anime series based off of the 4-koma ofthe same name. The series is written by the author Ruri Miyahara whom has little presence in the manga industry. Her other work known as Bokura wa Minna Kawaisou also has similar themes involving love in a slice of life story with awkward comedy, drama, and romance. However, Love Lab is a little different because it takes the idea of love and focuses it on exclusively as a sort of experiment. Our main characters at Fujisaki Girls Academy plays the role of the scientists and tries to find out exactly what love is through these so called \"love experimentation\".\\n\\n\r\nFor starters, Love Lab's concept consists of the idea of discovery. This primarily focuses on discovering how to attract the opposite gender and what love is. It's quite a difficult task because there are all sort of mishaps dealing with love. I mean, think of this way....when you first fell in love, how did that feel like? At any rate, the experiments dealing with the discovery of love and its concepts are explored at Fujisaki Girls Academy. The school itself is famous and pretentious because its school body is composed of well mannered students with elegance. A primarily example is Natsuo Maki, the Student Council President. With her elegance and beauty, she almost seems to be the perfect example of a Yamato Nadeshiko. Hmm, or is she?....\\n\\n\r\nAmong its other cast members is Riko Kurahashi, an admired girl but with a rather tomboyish personality. She is one of those girls where is very straightforward with their brutal honesty. In fact, she is even known by others as 'The Wild One'. This is clearly evidenced in the first episode with her actions. Coupled by the fact that she grew up with a little brother younger than herself, expect Riko to be the contrasting side of Maki. If Maki represents the princess, then Riko would be the beast. Then, there are also other characters of the series also become member of the school's life as they are on the journey of perfecting their discovery of....love.\\n\\n\r\nBecause the series takes place at all-girl school, expect some undertone yuri. However, this is rather a facade because the tone is actually not as explicit as people may think. This is more evident later on when other characters enters the story that degrade this genre. (if it can be considered one at all for this series). To put it simply, it's NOT yuri.\\n\\n\r\nWhat makes Love Lab entertaining though are a variety of its ideas. The surprising concept is immediately presented when Riko discovers Maki with her obsession. It doesn't help Maki disprove her case as she is caught red handed with a toy that she practices on. While this is essentially seen as a joke, it's clear that Maki is actually serious about romance. She hopes to make the hearts of boys go 'doki doki'. In reality though, she is already considered elegant with a beautiful face and figure. This is prove especially later on when she actually has several chance encounters with the opposite gender. \\n\\n\r\nAs for the experiments go, the theme focuses on love and its various little gags. The fun part typically involves with Maki and she tries to practice with situations that she believe will trigger 'flags'. In a way, her ideas can be relatable to otome games. Unfortunately for her though, these concepts don't always apply to reality and she learns it the hard way. Furthermore, her denseness on the concept of love makes her go to extreme measures with delusional ideas on several occasions. These experiments varies in many degrees as the girls tries at all sort of weird ideas. It's not very simple to explain so it's better to watch the series yourself to see what's going on. However, it can be relatable to high school experiences. Remember the first time you asked out someone? However, the process of actually verbally ask the question is a lot harder than it seems. It takes trials and error to get the right response usually. Here, the girls are in a similar situation.\\n\\n\r\nBeing tagged as comedy also, expect Love Lab to have many humorous dialogues and absurd character interactions. There are moments where we can't help but laugh with Maki's behavior regarding to the experiments. In fact, her initial encounter with Riko becomes an abrupt bubble burst with humor. Riko on the other hand is fun to watch as she becomes a sort mentor to Maki. It's like teacher and apprentice without the light sabers.\\n\\n\r\nAt some point though, Love Lab might become a chore to watch if decide to follow it all the way through. For one thing, we should want Maki to succeed and unlock the doors behind romance. However, the key to opening it often has her grasping on the wrong set of the key chain. This is proven by her naive ideas and because she lacks experience involving actual interactions with the opposite gender. Also, Maki often interprets almost everything as serious and often fails to recognize words behind the meaning. This is proven later on when she gets into a situation where she gets trapped in a zone of confusion. Additionally, Love Lab often tries a bit too hard and the ideas are cliched. These ideas are usually seen in most romantic comedies but here is taken as a joke. Unlike capturing targets similar to TWGOK (The World God Only Knows), the girls often finds themselves to be the targets.  \\n\\n\r\nArtistic wise, the series is pretty generic in its designs. The only two characters that seems to stand out among the others are our two lead female protagonists – Maki and Riko. Maki is designed to look, dress, and act elegant. Riko on the other hand has that tomboyish look for her hairstyle. She even changes her hairstyle too but no one seems to notice it. Two of the supporting characters also goes along with glasses to their design that makes them seem more mature and geeky. Yuiko Enomoto's eyebrows are also designed to look noticeable and commented on many times throughout the show. Finally, there's also the school design that gives off that girlish feeling. It's a girly show after with girls trying to learn romance.\\n\\n\r\nAs far as soundtrack goes, Love Lab once again adapts that girlish tone through its OP song, “Love Shitai”. Hearts are clearly seen in the song along with blushing moments of the girls. The OST itself is lighthearted but maintains a poor position because the majority of the series focuses on romance rather than a music band. However, Riko's VA Manami Numakuma does a terrific job in her role because of her tomboyish personality. Her tone of voice clearly presents the vocals of a tomboy. The way she speaks truly makes her the “Wild One”.\\n\\n\r\nI won't say I love Love Lab but it's definitely something fun to watch to pass time by. It has its moments with the girls and what they do at school. In many ways, we see a familiar side to what girls think of the opposite gender as a rather entertaining outlook on the anime industry. Usually, it's the guys that goes after the girls like no tomorrow. But here, the girls wants to learn about love, educate themselves with romance, and maybe even earn themselves a boyfriend. Ultimately, this series might seem to be a bit different but it's certainly can be worth the time to watch through. Love Lab isn't just about experiments of love but also about discovery through experiences.",
            "date": "2013-11-11T16:09:00+00:00",
            "helpful_count": 54,
            "mal_id": 120005,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=120005"
        },
        {
            "content": "Before I start officially start this review, let me make one thing clear. Love Lab is a full-time comedy anime. Those who don't like comedy, please stay away from this anime. Don't go around giving Love Lab a low score. It will stop those comedy lovers out there from watching Love Lab. On with the review.\r\nUp till now thousands of animes have been released and among these animes we have Love Lab. A small 13 episode comedy anime. Now, what is the plot in Love Lab? Well, it is about the members of the student council in an all girls middle school. The funny partof the plot is that these young girls are secretly doing some 'research' on how to make boys fall for them despite the fact that none of these girls has had any sort of love experience with any boy.\\n\\n\r\nLet's talk about the story in Love Lab. As you might know that many comedy animes don't have a proper story and they rely mostly on unlinked episodes with loads of funny scenes. This is not the case in Love Lab. There is actually a well built story here. You know those animes with good stories where you can tell how it will end halfway through? Well the best thing about this particular anime is that it won't turn out as you think it would. Apart from being well planned, the way the story progresses is totally unpredictable. You will find instances in this anime where you would think of an obvious ending, but it won't end that way. Some characters starting off as antagonists will quickly change to the protagonist and give a whole different view of how things will end. To start off Love Lab, a great introduction to the characters was given so that you know what kind of people you will face. The story progresses quite beautifully. They bring about unexpected events and don't go according to what you think. The story doesn't go the expected way. It felt nice to just go where the story took you and not being able to see the ending beforehand. The ending this anime gave was by far the best ending to an anime I have seen till now. The ending really brought me to tears. They gave it an obvious ending which most won't expect. \\n\\n\r\nComing to the artwork and sound. It's what you would expect from an anime released in 2013, pretty decent. The artwork is not boring as to make you want to drop this anime. It is pretty neat. \\n\\n\r\nEvery anime along with a good storyline should also have well developed characters in order to stay interesting. The way they portray the characters is worth praise here. Unlike some animes, the number of characters was kept low. Some extra characters were added only for the purpose of adding some more comedy to the already funny anime and they had no role in the progress of the story. We are introduced to 5 main characters who are members of the student council.\\n\r\nFirst off we have Maki Natsuo, the vice-president (later president) of the student council. She is a pretty and talented girl who is top in her class. The problem (and main source of comedy) is that she has had no interaction with boys and wants to. She started 'love research' after caught kissing huggy (a large pillow) as practice. She was caught by our next character, Riko Kurahashi. Assistant of the president, Riko is sort of a tomboy and told a lie that started to haunt her every time love research was brought up. Then there is Suzune, a first year middle schooler. She is a clumsy little girl and her clumsiness is one of the main sources of comedy. Then there is Yukio Enomoto, the president (later vice-president) of the council. We also have Sayo, the treasurer. She has a sort of sadistic personality and is the only one who doubts Riko but still plays along. The weird personalities of these characters and their somewhat stupid actions is what makes Love Lab enjoyable.\\n\\n\r\nLove Lab is a brilliant anime. It's hard to tell how good an anime is in words or without spoilers. If you want a good laugh, you might as well give Love Lab a shot. You are sure to enjoy it.\\n\\n\\n\r\nI hope this review was good. Please do comment and give any suggestions on how I could make my review better. :-)",
            "date": "2013-10-06T08:04:00+00:00",
            "helpful_count": 21,
            "mal_id": 115739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650363.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yamada2",
                "username": "Yamada2"
            },
            "url": "https://myanimelist.net/reviews.php?id=115739"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nIn many ways, love is a skill. It takes practice, determination, and a little bit of luck in order to fully master its ways. Love is used with romance; it can take on many different forms, and can be applied to many different situations. So, how can one deal with the vast amount of possibilities? Love Lab aims to tackle this problem, and what we are left with is one of the best comedy shows that I have ever seen.\r\nSTORY\r\nLove Lab starts off quite simply. \"Wild Kid\" Riko one day stumbles upon \"Princess Fuji\" Maki doing something quiteout of character. And from that encounter, the rest of the show follows.\\n\\n\r\nThe point of the show is literally in the title. The student council conducts \"love labs\" in order to train themselves to become better lovers and therefore engage in romantic developments. In this way, the show becomes an interesting mix of episodic and story arcs. Much of what happens appears to be standalone, but in actuality, the actions they all take and the things they do affect what happens as the story evolves. This type of \"story-telling\" worked wonderfully because it allowed it to jump from their \"love lab\" escapades, to weaving a narrative, then back to more \"love lab\" shenanigans.\\n\\n\r\nThis is a comedy show. As such, the vast majority of what happens is entirely comical and hilarious in nature. However, the show does introduce somewhat significant pieces of drama. But thankfully, none of it feels forced or unsatisfying. Rather, it aligns well with the way the show presents itself. This is because it again employs this mix of two different brands. Meaning, it doesn't just sit on being dramatic, instead going between funny and emotional in a sinusoidal pattern. This is mainly the reason why the drama never feels out of place.\\n\\n\r\nIn Love Lab, its overall (and pretty much only) theme that is explored is the idea of what it means to be a friend. Having someone to rely on during good and bad times, someone to be honest with not only yourself but with them as well; the show does a nice job of delving into many different friend-like scenarios. Now, this idea isn't groundbreaking: many shows look at \"the power of friendship.\" And while Love Lab doesn't knock it out of the park, their ideas are noted and at least appreciated.\\n\\n\r\nANIMATION\\n\\n\r\nDespite what LL may look like from the outside, its actual animation is pretty darn good.\\n\\n\r\nThe show uses a rather generic looking art-style. There are no highly detailed locations, intricate character designs, or clever uses of light and shadow. In this regard, the art isn't exactly appealing. However, that isn't to say that it is bad to look at. For the most part, it is just \"there.\"\\n\\n\r\nIn contrast, the animation is great. It contains fluid character movements, detailed facial expressions, and excellent use of both standard and \"comedic\" designs. It's rather funny to see a show like this be animated so nicely. As a viewer, one starts to notice the extra frames in their arm movements, the ways their eyes move, and the attention to detail for their hair and other objects.\\n\\n\r\nI touched on it slightly, but definitely one of the best parts in terms of animation comes from the expressions they are given. Whether it be extremely happy with shades of blushing or quite depressing with glistening eyes, the show incorporates many different reactions that are always on point in comedic timing.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe characters of Love Lab are mostly good. I'll stick to the main five since the rest are largely unimportant.\\n\\n\r\nThe weakest of the bunch goes to Eno. A classic \"tsundere,\" she is rather bossy and rude at times, but her underlying feeling of justice and caring makes her a good person to have around. I'm a fan of this type of girl. But the problem was that she was probably the most underutilized. She would often retort back with a \"Shut up!\" in most situations, but she did have her moments throughout the show.\\n\\n\r\nSuzu is next. Extremely shy, terribly clumsy, and horribly unfit, she seems quite pitiable on paper. However, her kind demeanor and optimistic attitude makes her nicer than any other person. Always looking to be like her seniors, she does her best to aid the group when it comes to their endeavors. Her schtick was always funny to see, and seeing her deviate from her character or go above and beyond it was constantly hilarious.\\n\\n\r\nThe wise and mature one among the student council, Sayori is understanding, defensive, and has a strange obsession with money. While she mostly contains her feelings and teases Riko to no end, she is rational and respectful in the situations that she is put in. During the show, she actually gets her own arc, which allows us to see more of the girl behind the glasses. She isn't super funny on her own, but instead plays well off of the rest of the cast.\\n\\n\r\nRiko, a.k.a \"Wild Kid,\" a.k.a \"W-K,\" is your typical tomboy. She's both forward and passive. She cares deeply for her friends, especially Maki, and doesn't like to see them get hurt in the slightest. Willing to do anything for anyone, she is what you call a \"best friend.\" On top of all this, she is easily one of the funniest characters from the show. Her constant bashing, her playful teasing, and her hilarious reactions to the happenings of the group make her a joy to behold.\\n\\n\r\nBy far the best character, and now personally one of my all-time favorites, is Maki. Talented, beautiful, nice beyond words, and actually a little strange, I can't say enough about her. She's incredibly funny and her love to love is endearing. It is literally impossible not to have a huge grin on your face whenever she is on-screen. She alone should make you watch this one.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is actually quite catchy. I especially like the beginning and the ending where the characters are \"singing\" along with it. It fits the show nicely due to the overall upbeat nature that it brings. The ED, like its visuals, does kind of feel like a car song, if that makes sense. It kind of just makes you want to go. That, and their own little \"Go!\" is really adorable.\\n\\n\r\nThe soundtrack is fine for what it is, but I actually found the use of the varying and unique sound effects to be strong. There are many different types, such as with the slap-sticks or the transition piece that work really well.\\n\\n\r\nVoice acting-wise, I found Maki's, Riko's, and Eno's performances to be quite above average. Not only do their voices fit perfectly, but they do a really swell job at making the characters act and feel as they should.\\n\\n\r\nENJOYMENT\\n\\n\r\nIt probably goes without saying at this point, but I absolutely loved this one. I'm a huge sucker for romance, and while the show isn't about romantic relationships, its interesting premise of focusing on romantic happenings was so much fun to watch.\\n\\n\r\nI busted out laughing every time Maki would squeal with delight, I adored Riko breaking the fourth-wall, I smiled at Eno falling for \"Makio,\" I loved them overreacting to many situations; there wasn't an episode where I wasn't laughing or smiling the whole way through (minus the drama parts!).\\n\\n\r\nThere's not much more to say here, to be honest. I loved every second of it, and my only wish was that there was more. Love Lab has easily taken a spot among my favorite comedies, and I will be eagerly waiting for season two. Because we can always use a little more love in our lives time and again.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, mixes slice-of-life and arcs in conjunction with comedy and drama to nice effect\\n\\n\r\nAnimation: Good, plain art style but really well done actual animation\\n\\n\r\nCharacters: Good, Maki is fantastic, Riko is great, and the rest support them\\n\\n\r\nSound: Great, good OP and ED, nice use of sound effects, above average VA work\\n\\n\r\nEnjoyment: Great, smiles and laughs for the entire ride\\n\\n\r\nFinal Score: 9/10",
            "date": "2014-10-28T03:02:00+00:00",
            "helpful_count": 12,
            "mal_id": 166501,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=166501"
        },
        {
            "content": "I finish this series right before I start to write this review. To sum it up, I would say this daily-style anime exceeds my expectation. The main reason behind this statement is its story is much better than others’. Anyway, I recommend this anime to everyone who enjoys in this kind of anime, such as “Is the order a rabbit?”, “New Game”, and etc. \r\nMany factors in Anime are satisfied by high quality. \r\nArt, the overall quality of Art is stable. Many details are handled well. The quality can be compared with “New Game. “\r\nMusic plays an important role in a number of plots. Itdoes its duty that is to bring the audiences into the show. Although, in my opinion, the opening and ending theme are not outstanding. \\n\\n\r\nCharacters, from my point of views, are build extraordinarily. Maybe the reason that makes me have this though is this anime is from 2013. Compared to current characters, there are some differences. After all, every character in this anime is unique. Theirs personalities are impressive on the positive side. \\n\\n\r\nStory plays a crucial part in this daily comedy. It makes this anime not be boring. The boring I mean here is there doesn’t exist some crucial events but nothing important. For instance, although “Is the order a rabbit?” is an outstanding daily-style anime, what it lacks are in this anime. There are several important plots in these 13 episodes. Every single plot makes the audience realize that “Look! We got some interesting story.”\\n\\n\r\nConclusively, this anime is worthy to watch. I recommend to you who needs some laughs in your life.",
            "date": "2018-02-02T02:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 270398,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437796.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ching-Chan_Kyo",
                "username": "Ching-Chan_Kyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=270398"
        },
        {
            "content": "Since this was recommended to by a girl, I already knew it would be good. Then, I found out it involves relationship issues... Talking about romance, without featuring it at all is trully original...\r\n{STORY - 6/10}\r\nA small group of girls giving love advices? Eventhough they don't know a thing about it? Pretty original! Love Lab is about \"how to be romantic\", as it literally gives out lessons to help young girls on getting that special guy's attention.\r\nFinding Maki on a embarassing situation with her own \"kissing\" dakimakura (body pillow) suddenly turna Riko into the student council's assistant. Her first task: teaching our princess how toget closer to a boy and make him interested on her.\\n\\n\r\nProblem is that Riko has no experience and her extremelly tomboyish behavior triggered many rejections from her classmates all over the years past. One single lie convinces Maki the contrary and the admiration she shows is big enough to take Riko down for good... How long will this act last?\\n\\n\r\nInside a school made for girls, obviously that others may want to learn something from the \"Love Master\". All focus from the council now goes to resolving romantic issues and this is fantastic!\\n\\n\r\n{ART - 7/10}\\n\\n\r\nAside the \"sweet\" design used on Love Lab, a lot of short \"special\" animation sequences are featured. High speed chases, dark auras and many background changes are some of the nice extras we can notice while watching it.\\n\\n\r\nOverall art is quite simple, specially when it reffers to the characters. Still, the main ones are distinctive on appearance matters and the low-contrast style is gorgeous!\\n\\n\r\n{SOUND - 8/10}\\n\\n\r\nPerfectly matching songs were used on both intro and ending sequences. \"Love Shitai\", about getting in love, and \"Best Friends\", based on these five girls relation, are cheering and joyful, nice to hear, being performed by the main voice actresses, under the name of \"Fuji-Jo Seitokai Shikkou-Bu\". Onto the cast's choice, voices fit well to all characters!\\n\\n\r\n{CHARACTER - 6/10}\\n\\n\r\nMembers from the Fujisaki Academy's student council, every one being a love initiate, represent somd of main the possible kinds of girl a male student from junior high may fall in love with.\\n\\n\r\nRiko, violent and rough, gets constantly avoided and rejected, but she her strong-willed and protective attitude is what steals the spotlight. Maki, sensible and gentle, is the one who shows most interest on starting a love relationship with someone. Her beauty is what attracts everyond nearby.\\n\\n\r\nSuzu, cute and shy, is always making mistakes and admires Riko from deep inside. Eno, dedicated and proud, is the only true friend from Sayo, whose cold and anti-social personality prevents her from interacting with her classmates.\\n\\n\r\n {ENJOYMENT - 9/10}\\n\\n\r\nIt was a very good comedy and improved a bit of my knowledge about girls in general. All the tips I saw in here aren't useful for me to approach any, but those are a great way to understand something about them.\\n\\n\r\n{OVERALL - 7/10}\\n\\n\r\nAn accidental encounter turns Riko's life upside down and she steps into a mess that only gets bigger and bigger. Dating isn't allowed and the council shouldn't be caring about the students' love issues. However, Maki's determination on finding the prince of her dreams persuades Riko onto helping her and trouble after trouble will meet Love Lab!",
            "date": "2013-12-17T17:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 124371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=124371"
        },
        {
            "content": "[Spoiler Free Review!]\r\nLove Lab. Whilst the name may be somewhat off-putting, this anime deserves a solid 8/10. It's not overwhelmingly unique or captivating but it does what a slice of life comedy is meant to do and in all honesty, it does it pretty well.\r\nStory: 7\r\nThe story is good. There is a main plot line that's easy to follow with some side stories thrown in here and there. That being said, there are very few moments where one feels engaged in the story line. It's predictable, to say the least. There are, however, some decent tensions regarding Riko's lies. They kind of make you wantto pause the video to relieve yourself of the awkwardness but that's a sign of good writing. This show has a lot of funny moments and with a satisfactory ending, it deserves a good 7/10 in terms of story (which is pretty high for a slice of life, in my books).\\n\\n\r\nArt: 5\\n\\n\r\nLove Lab was released in 2013, so I wasn't expecting anything great in terms of art. However, the art and animation almost seemed like it was older than that. There's nothing awful about it, I just feel like it lacks vibrancy in places (especially at school). In terms of character design, the characters all look very different in terms of faces and hair, which is a plus. Although, Mizu's face and glasses seemed very poorly designed and animated in some scenes, which kind of made me dislike her character, sadly. I'm harsh when it comes to art and this is unfortunately only deserving of a 5.\\n\\n\r\nSound: 8\\n\\n\r\nThe OP and ED were catchy (especially the OP) but not incredibly so. The soundtrack wasn't too noticeable most of the time but had its moments. The voice acting is good. All character's voices suited their personas and there are a few familiar actors, which is always a plus. Riko has a particularly attractive voice in my opinion so... 8!\\n\\n\\n\r\nCharacters: 9\\n\\n\r\nSo close to being a perfect 10, honestly. The show has an eclectic mix of characters who, whilst aren't the most unique, are this anime's strongest aspect. They aren't introduced too quickly so we have time to grow fond of them before new ones are introduced and the creators also seemed to keep up a steady pace of introducing new characters, which really kept it feeling fresh throughout the series. They're are all unique and there are a lot of likable, funny side characters too! The only thing Love Lab lacks in terms of characters is development. However, the anime is a 13 episode slice of life comedy and one would be considered insatiable to expect fleshed-out character development from it.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nAll of these features combined left me feeling quite fulfilled whilst watching and after finishing Love Lab. It's a casual slice of life comedy. Great stuff if you just want a break from stress or don't want something too complex and serious.\\n\\n\r\nOverall: 8/10\\n\\n\r\nI'd recommend this anime to watch. Its re-watch value is also decent, considering that most of the jokes are the kind that make you laugh in the moment, but are also forgotten over time. If you like slice of life comedies, you'll like Love Lab. However, don't be mislead by the \"romance\" tag. Whilst the main goal of the characters is \"love research\", the main theme of the series is the friendships between the characters. As long as you go into this anime not expecting any romance, you'll enjoy it.",
            "date": "2015-06-04T21:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 189574,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4640167.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Blue_Miku",
                "username": "Blue_Miku"
            },
            "url": "https://myanimelist.net/reviews.php?id=189574"
        },
        {
            "content": "Let's get one thing out of the way first: the show's not yuri. It definitely isn't! I was surprised that it was seeing that it was. Prejudice aside, Love Lab was a fun-ride for me after it's 13 episodes.\r\nThe show's protagonist is Riko Kurahashi, a tomboy who attends Fuji Academy - a prestigious school known for its well-behaved female students - who is greatly admired by the female students, entitling her as \"The Wild One\". One day she accidentally discovers Maki Natsuo - the academy's student council president and model student - kissing a hug pillow (\"dakki\") and claims to be learning romance. Consequently, Rikabecame Maki's aid for love research and is followed by several other female student council members.\\n\\n\r\nThe story was classic comedy. It always end with Riko punishing or reprimanding Maki for her idiocy yet her mischief that stems from her devotion of knowing romance gets more elaborate and comedic as the show progresses. Though the show greatly emphasizes enjoyable friendship which is rather nice and warming to the audience. All characters are unique and I don't find either one of them despicable, even I find Sayori's schemes and way of talking to other characters very funny.\\n\\n\r\nAside from girls, some guys are introduced as well, which share a very special relationship with Riko, both good and somewhat bad. Their interactions with her were one of the ways to get Riko all flustered in contrast where she acts cool and reasonable at her school. Seeing this shows how female she still is despite her boyish-characteristics. The ending was a good ending for everyone as it proves that deceiving someone is never the root of a great friendship, knowing that made me reflect on myself which was very enlightening.\\n\\n\r\nVisual and audio quality were decent and voice acting was great as always. \\n\\n\r\nOverall, Love Lab! is where you can escape from the common harem genre, which is very refreshing. You get fun characters and a decent story if not all bland. Either way, it all depends on your preferences.",
            "date": "2013-11-07T10:28:00+00:00",
            "helpful_count": 7,
            "mal_id": 119563,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JonBort",
                "username": "JonBort"
            },
            "url": "https://myanimelist.net/reviews.php?id=119563"
        },
        {
            "content": "The schoolgirl comedy genre is something which has just gotten increasingly ubiquitous in anime of late, but contrary to what one might expect, anime studios keep finding ways to make series from the formula which stand out. Studio Dogakobo--who previously produced the anime Yuru Yuri in the same genre--have with Love Lab found another anime that is case in point to that.  Likable and refreshing, this is an anime worth watching for someone with even a passing interest in the genre.\r\nLove Lab is well produced. The art looks great and I never noticed much in the way of bad animation. Sound is good too--backgroundmusic is appropriate and the opening and ending theme are both really cute and fun. The voice acting is where it really shines on the production front though. The voice actresses have impeccable timing and exquisite delivery, which just makes the comedy funnier and the proceedings seem all the more natural and fun. \\n\\n\r\nWhich brings me to one of the reasons Love Lab stands out in its genre. The comedy is really good. Humor is subjective, I know, but for me, I can't think of very many similar shows that made me laugh and smile more. The comedic writing is excellent and the characters play off of each other impeccably. At its core its your basic boke and tsukkomi act, but it does it so well it's all more satisfying than it usually is. \\n\\n\r\nThe other big reason Love Lab stands as something unique is its plot. Most series in the genre seem content to offer separate snapshots into the girls' lives that maybe in some cases build toward something but don't usually connect directly. Love Lab, on the other hand, connects together in more obvious ways. The episodes actually end with a \"to be continued\" and there are usually plot hooks setting up what is going to happen next. The continuous feel works to it advantage, making it feel more like a complete story even if it is at its core still a collection of amusing events in the lives of a set of schoolgirls.\\n\\n\r\nNow the schoolgirls themselves are an interesting bunch. Good characters are needed in these shows and Love Lab has them. At its core are: Riko, the tomboyish lead who ends up getting dragged onto the student council as an advisor where she must unconvincingly pretend she is a master of love; and Maki, the student council president who is kind of a completely ridiculous idiot and, in her utter cluelessness, is eager to receive Riko's guidance. The two are in time joined by three other girls: shy secretary Suzu who is clumsy and cute; the manipulative and cunning treasurer Sayo who likes playing games with the others, particularly Riko; and the student council VP Eno who is a ridiculous aggressive tsundere character who seems to frequently make a fool of herself. All of them are well developed and produce laughs as they interact both witch each other and a cast of supporting characters that is in time introduced.\\n\\n\r\nSo in short, Love Lab is great fun. With good characters, well produced, actual continuing story and excellent humor, it has a lot to offer. Very strongly recommended.\\n\\n\r\nUpdate: Upon completion, I ultimately bumped my score of Love Lab up to a ten in score. It was impressive from the start and in the end it didn't let me down anywhere. The characters are so lively and fun to watch and also dynamic and engaging, the humor is so consistent, and the sheer fact that it pulled off the feat of staying true to its genre while also offering up an interesting enough ongoing plot that it never stopped being rewarding. I find myself unable to think of anything more I wanted from the show, aside from more of it as soon as possible. Anime comedies are seldom this remarkably solid.",
            "date": "2013-08-17T08:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 110051,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=110051"
        },
        {
            "content": "Much to my dissatisfaction let me start off saying despite a few other reviews I saw this show is not shoujo ai. The opening also points to this possibility however don't get your hopes up. It's not there so if you're looking for a cutesy yuri don't go for this, but that doesn't mean you should drop it either.\r\n\tIf you like moe shows you'll like this and if you like comedy this is also a winner. At its core Love Lab is a comedy and no matter how serious the tone it always delivers a joke and never misses the punch line. It delivers plentyof fun moments and does a good job of not deviating too much from the main goal of keeping you laughing.\\n\\n\r\n\tThe plot itself is not going to blow your mind or set new lines for what a comedy should be so just expect the common place cute girls doing cute things and trying to learn about boys, but actually hilarious in comparison to something like K-ON! The main characters are your standard fare of cookie-cutter archetypes don't expect much on this front. That is not necessarily a bad thing though because the show works and flows nicely this way and will deliver at least one or two characters you'll like.\\n\\n\r\n\tThe art for this show is very familiar and nothing too new or impressive. It does keep the same style throughout. On the animation side of things Love Lab starts off with some pretty visuals and nice flowing scenes that are very well animated and looks surprisingly good for a moe comedy. However the animation doesn't keep this quality through all the episodes, and falls off quickly. It seems only the more emotional scenes get this treatment and it's a shame because it looks awesome.\\n\\n\r\n\tThe sound in Love Lab is also nothing too impressive, but it's good enough to not take away from the rest of the show. The voice actors portray the characters well. The only thing is that they're the same voices you hear in all moe comedies. The music is nice and accommodates the scenes nicely, but is overall forgettable outside the OP. The ED isn't anything that great either, and I found myself skipping it a few times just to get to the next episode.\\n\\n\r\n\tOverall Love Lab is just another moe comedy with not too much going for it, but at the same time seems to hold something special that not all the others have. It's funny and it doesn't stray from this path other than once or twice to add drama and even then it's always just setting up the punch line for another joke. Its fun and entertaining if you like innocent, romance themed humor or cute girls interacting with each other.\\n\\n\r\n\tI give Love Lab a 6.5 out of 10 but MAL won't let me do that so 6 because I round down.\\n",
            "date": "2014-01-16T09:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 128969,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482521.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FreakyTy",
                "username": "FreakyTy"
            },
            "url": "https://myanimelist.net/reviews.php?id=128969"
        },
        {
            "content": "Despite the art to be mediocre, the sound design being cheesy, and the characters almost being generic, this anime gave me some laughs. What I adored most about this anime is how animated it really is. The animators of this show didn't hold back their creativity when making Love Lab. Hell the ending moved me because the animations made the characters become alive. \r\nIf I were to describe the characters, I would call them generic. However, it never bored me because Love Lab had clever skits and wonderful animations, it made the characters memorable. There were some episodes that were mediocre and some skits werevery obnoxious since they were repeated till the very end. \\n\\n\r\nThe most enjoyable part of the show is the first episode. The animations on the episode were very on point, the two characters had this dynamic that made me laugh, and the story was too ridiculous. It got me to keep watching till the very end, and I enjoyed it. \\n\\n\r\nI do wish Love Lab has a sequel, but sadly I don't think that will be coming. In the future, I might watch this again.",
            "date": "2018-09-06T17:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 288352,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6190384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PapaRonny",
                "username": "PapaRonny"
            },
            "url": "https://myanimelist.net/reviews.php?id=288352"
        },
        {
            "content": "When I watched “Love Lab” for the first time, I was amazed at how interesting this story was. The funny thing about the show was how well the characters were developed, mainly Sayori, Maki and Riko. Those characters shined in the first 7 episodes when they talked about how they go along with romance, while at the same time trying to make sure the girls-only school doesn’t know that much about it. Sayo is one of the cool characters that doesn’t have to be liked like Riko, or try hard to get love like Maki and Eno. However, she is a sort of a balancebetween these characters, as they sort of represent a battle between two worlds.\\n\\n\r\nAs for Eno and Suzu, the next 6 episodes dealt with their two different personalities; one wanting to be a leader while not really knowing how much to lead because of Riko’s popular personality, and the other so shy that she wants to be popular, but not wanting to be too much of an outcast.\\n\\n\r\nRiko has her flaws, too. Besides being overconfident and flimsy, she does wish about what it would be like to have a boyfriend without having the “tomboy” look, whereas Maki has very wild expectations that don’t come close to reality. When it comes to dating, it’s like her visualizing kissing a body pillow: you won’t come too far with actual romance and relationship skills.\\n\\n\r\nLove Lab is a good show if you wonder how a school-themed show can be enjoyable and quirky at the same time. Most of the school-themed tropes aren’t as evident as most school-themed shows, but the jokes about high school love interests being something that must happen in your life if you want to have an “authentic” relationship, will hit you hard, when they weren’t trying to be serious.",
            "date": "2018-08-18T21:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 286847,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6237609.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/albertbrown",
                "username": "albertbrown"
            },
            "url": "https://myanimelist.net/reviews.php?id=286847"
        },
        {
            "content": "Love Lab is one of those very deceptive shows where you look at the season preview and go \"wow more girls doing club things in high school such original wow very unique\". Under that stereotypical shell however, there's a great show. Hopefully you know what you're getting into by picking something from the SoL category and you'll treat this recommendation as such.\r\nThe comedic value mostly comes in the form of the Straight Man/Funny Man routine made famous by comedic duos like Abbot & Costello and Laurel & Hardy. A lot of SoL shows tend to have a pair like this but it's usually limited toone pair and they tend to ride one type of joke throughout the show. What sets this apart from others is that the characters aren't bound to each other: even characters that don't get much screentime with the main cast in the anime are lively and can mingle with said main cast. The best example of this would be the newspaper association's interaction with the student council from episode to episode in which they have a part. There are jokes that come up more than once, but there's enough breathing room and minor detail change between their repetition.\\n\\n\r\nThe story isn't really impressive. The overarching conflict is something that can be drawn from a simple skim of the synopsis: a big misunderstanding. If you've watched  enough anime, \"misunderstandings\" are all too common a plot device and can sometimes end up defining all interactions one character is involved in. The day to day love research subplots make up for this by giving us introspect into the cast on top of giving us some pretty funny scenes. The story does keep you interested in what's going to happen next and always ends on a proper cliffhanger, however, which a lot of shows which attempt an overarching plot sometimes can't do.\\n\\n\r\nMy biggest weakness when it comes to talking analytically about shows is that I'm no art/music critic - I leave that to people who are much more knowledgeable about the arts. From the shows I've watched, I felt that the music was pretty average. Scenes that relied on different music to set moods worked well, but I can't say that I'd remember Love Lab's soundtrack 6 months from now. I've grown used to shows relying on one jingle for some minor background noise, but the OP, ED, and character songs were all very well done and enjoyable to listen to. Some people like to skip OPs and EDs after watching them once - I'm one of those people. However, I ended up sitting through each OP and ED with ease. The seiyuus doing their character songs in character was certainly a point booster. I'm not really that great at finding QUALITY moments that aren't painfully blatant, but most scenes were well detailed. There are placeholders for background characters as you get later into the show, but when concerned with active characters (not necessarily the main cast) there weren't any major QUALITY moments I can remember as of now. The color pallet used is very warm, reminiscent of shows like Nichijou and SYD. There were some very funny animated scenes: case in point, a LOT of animated .gif files are floating around on a number of image-sharing/social websites.\\n\\n\r\nThe characters are possibly my favorite point to talk about. Like with all works of fiction, the viewer wants to feel like they can relate to the characters in the show and the problems they go through. This is usually a stretch for SoL shows where it's mostly cute girls doing cute things cutely sometimes with light yuri undertones and a few gags. Love Lab gets the character score I gave it because it hit the mark for realistic and understandable characters. While there are certain tropes that come with your standard high-school cast and any show that has a Straight Man/Funny Man routine, Love Lab manages to keep things grounded in reality. Everyone is flawed in one way or another, and there are no hyper-dense characters that are just totally oblivious to the feelings and actions of the other characters around them. While inter-character conflicts are short in the interest of time, enough background is given to us so that we can put 1 and 1 together. A popular arguing point is that a male target audience is unable to relate to a gaggle of high-school girls in a club or council of some sort, but it's not the characters we're relating to - it's the actions they take and the thoughts they have and the feelings they experience. What's most refreshing about the Love Lab cast as characters is that their decisions in serious scenes don't leave you asking \"What logical path would one have to take to even THINK of arriving at that conclusion?\". I'm honestly not going to touch upon anything relating to \"yuri undertones\" besides this sentence and the next because that topic was argued ad nauseum during the show's debut. Although I liked shows like YuruYuri and Yuyushiki quite a bit, those \"undertones\" don't exist in Love Lab despite people's insistence on them being there and it would have brought my rating of the show down quite a fair bit if there actually were strong \"undertones\".\\n\\n\r\nWhile obviously not perfect, Love Lab is easily worth watching if you're looking for something not your run-of-the-mill SoL show. I dislike the arbitrary number system for giving something a rating because there are too many grey areas in evaluating a piece of media that a simple number can't express what makes up that grey area, but I default to the Anthony Fantano rating system: Love Lab gets a strong, beefy 8 out of 10. I'd possibly go so far as to stretch it to a light 9 which I reflect in my own list rating.",
            "date": "2013-09-27T11:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 114433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3112859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gr8stalin",
                "username": "gr8stalin"
            },
            "url": "https://myanimelist.net/reviews.php?id=114433"
        },
        {
            "content": "Love Lab was an anime I pretty much only started watching because it was newly airing and, honestly, I probably wouldn't have bothered with it otherwise, but boy am I glad I did. It's a sweet hidden gem that performed well (despite a few problems I'll address) and is something that everyone should at least give a try, especially fans of \"cute girls doing cute things\" anime, which is exactly what this is.\r\nThis anime starts off, and remains, pretty simple. It gave me some Oniisama e vibes in the first episode, from the intensely shoujo ai vibes of the female cast to the gentle worshipand admiration of some of the students to the light cherry blossoms flowing between sweet girls at a prestigious school. However, this did not turn out to be the plot-filled twists of drama that Oniisama e was and is very much a slice of life comedy from start to finish. It's light hearted and doesn't really need very much commitment if you're after something relaxing.\\n\\n\r\nOur heroines, Maki and Riko, are both the idols of the all girls' schools they attend, Fuji High, although for very different reasons. Maki, the sweet and prim \"Fuji's Princess\", for single handedly running the student council and being utterly perfect in every way, and Riko, the \"Wild One\", whose disregard for uniform policies and paying attention in class catches the attention of the other very well behaved students. When these two idols end up being in the school council together, many people might've expected their personalities to clash. However, they bond immediately over a desire for love and their relationship grows as the school council and the love research it undergoes do too.\\n\\n\r\nThis format worked extremely well. It wasn't entirely plotless, but also never got too complicated. The characters and their gags blended together into a genuinely enjoyable storyline that felt very much like what a slice of life should be - nothing too serious, but also that doesn't just become the same things over and over again. It mostly worked so well because of the characters, who are very much one of this anime's strong points.\\n\\n\r\nThe main five of the student council are really the only ones present often enough to receive things like character development, but all of these girls are extremely likeable and watching them interact is a thing of joy. Their chemistry was through the roof, leading to the inevitable question of \"will this be yuri?\" - a question that they, perhaps deliberately, left mostly unanswered. This does lead me to the anime's main fault though, and that is the introduction of what can only be described as love interests.\\n\\n\r\nPartway through the series, two boys are introduced and both as childhood friends of Riko. Their purpose is rather clear - Satoshi and Jan are there to entice Maki and Riko's development and probably eventually become their boyfriends. However, nothing about this scenario was particularly done well, especially for an audience continuously teased by yuri themes in not just this anime. The situation would've been fine if the boys actually had screentime and development, but they barely ever appear, and only ever to be shown as nothing more than love interests. They're not important to the plot otherwise and, despite adding some comedy, feel slightly obnoxiously and haphazardly flung onto the plot like an afterthought of \"ah, yes, this has to be het!\" that almost all animes resort to in the face of yuri, even though it was yuri the creators themselves put in place via the choice of having the girls constantly blush at each other and swoon over circumstances like Maki's crossdressing.\\n\\n\r\nOverall, the boys mostly just felt pretty disappointing. It was incredibly hard to ship them with girls they spent next to no time with, in comparison with girls that literally spent the entire anime building their relationship together. There was very much a difference here between just ignoring the yuri suggestions and ending the anime ambiguously (as many animes did before them) and trying to tear these themes apart with shabbily lobbed characters. It was a real let-down and almost felt like it undermined the girls' friendships by brushing any suggestion of something more into a raging fire of \"no, you have to ship them with these generic archetype boys we just flung at you\".\\n\\n\r\nHowever, despite these faults, the anime was by no means dragged down to being bad because of it - it really hardly affected my overall opinion at all, despite some disappointment. The art in particular was astoundingly beautiful and the characters had a real charm to them - it was definitely something about their eyes that drew you in. The animation was just consistently fluid throughout and it was incredibly beautiful to both look at and listen to. It was all very light hearted with bright colours, a very fun OP and ED and some good girly voice acting that felt like you were listening to real highschoolers.\\n\\n\r\nIt all lead to what was a very enjoyable anime. I looked forward to watching this every week, even though a highly predominant romance genre is not something I'd ever call my type of anime at all. Maki and Riko, and their genuinely beautiful relationship, were the anime's shining star, and if you enjoy what you see of that in the first few episodes then you should carry on to the end, because it really only gets better. I'd really thoroughly recommend Love Lab to pretty much anyone, whether they're in the for or against yuri boat.",
            "date": "2013-09-28T03:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 114511,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2249247.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/straggy",
                "username": "straggy"
            },
            "url": "https://myanimelist.net/reviews.php?id=114511"
        },
        {
            "content": "To summarize this show quickly, it’s the story about the Student Council at Fujisaki Girls Academy who makes an effort to study love and romance to help themselves find love successfully, as well as advise their fellow student body. Maki the Student Council President is a bit naive and ropes in the edgy wild one, Riko, to advise the girls on what they should do to find love. Hesitant to accept, Riko gets pulled in while lying to all the girls that she has copious amount of boy suitors and her popularity outside of the high school. Luckily for her the girls don’t catch on,and antics ensue with the girls struggling to keep Love Lab a secret from the faculty while also aiding their fellow classmates. The dangers aren’t too serious though, as this show is mostly light and fun, with serious moments being on the back burner for the duration of most of the episodes.\\n\\n\r\nThe Characters\\n\\n\\n\r\nThe show is very good at roping you into the student council as Maki, (the secondary protagonist) has an infectious personality. You sympathize more with Riko, (the main protagonist) as she is a bit more level headed, but you still enjoy the banter between the two of them. They are the two main drivers of the plot, but intermixed is the gentle yet clumsy Suzu, the stubborn but convicted Enomoto and the cunning yet well-intentioned Mizushima. Each character has qualities to like about them, and none of them are people you couldn’t consider yourself getting along with. They’re probably too perfect but that’s ok. The show is pretty idealized and not too serious so it’s ok that the characters are idealized as well. I give this aspect of the show a 7.5 out of 10 as the characters although not riddled with too many flaws for a dynamic show, are still likeable and feel very real as people, especially when interacting together.\\n\\n\r\nThe Story\\n\\n\r\nAs summarized earlier, the story is pretty simple. It’s mostly about young girls having fun, and it accomplishes that fun aspect very well. It attempts to bring in conflicts if you can call it that, but it doesn’t surprise the audience as we know of course things will be resolved in no time. Although this makes it pretty predictable, we shouldn’t expect a show directed towards a younger demographic to do much beyond that. At least the conflicts are interesting and explore new ideas that young girls have to face. Contrasting that is the funny moments in the show which were executed perfectly. I was laughing along with them, and the comedy succeeds because of the strength they accomplish with developing the characters. We learn to like every character because it delves into each characters’ back story, even if just for a little bit. Getting to know what to expect from each character makes the comedy that much funnier as we see the dynamics between the girls play out with their contrasting personalities. And that’s all and good, but the question is, and I mean obviously it would be on your mind since this show is called Love Lab, how’s the romance? And I would answer you… underdeveloped. The show pushes forward friendship first, with love much farther on the list. This short season just gives you a taste for all that Love Lab has to offer, so anyone wanting more from it has to turn to the manga. So with all those elements put together I give the story a 7.0 out of 10. Its comedy is bang on, but it lacks in most other regards to make it shy of a higher score. But for young girls, this show is a must see for sure. For women my age however? (I’m 22) It’s more a nostalgic revisit to the easy times when you were first learning about love.\\n\\n\r\nThe Message\\n\\n\r\nNow, one thing I did not expect from a shoujo comedy series was just how deep this show got at times (Refer to image above from episode 9, it’s an artistic metaphor). There were a lot of moments where I thought damn, these girls are really just amazing people, they try to be nice to everyone and help each other grow and mature in a constructive way. This isn’t one of those mean girls episodics, the girls learn from each other in a positive way. And as I mentioned before, there’s never any real dangers because the girls are such a together group, and their hard work pays off for them. The show demonstrates what real friendship is, that what it takes to be a good person isn’t always easy, and that being confident in yourself will gravitate others towards you. Just a lot of fuzzy nice messages that are often overlooked in animes, especially those geared towards a younger audience. The message of this show is what kept me watching, because easily a young adult woman would have nothing to relate to this show otherwise. If you’re curious and you’re a little older, maybe give this title a try, if not for this reason. I give the message a 9.0 out of 10. For obvious reasons mentioned above, it made the show stand out this season.\\n\\n\r\nThe Verdict\\n\\n\r\nThis show is complex for the overthinker and simple for those just looking for a sweet laugh. But did I enjoy it? Yes! I’m not eager to admit that I liked a fluffy shoujo anime but I believe it accomplished a little more than most shoujos tend to. It was pleasant returning week after week to watch the latest episode as it was continually giving a new experience instead of boring me.  Although it ended just as new ideas were developing, it’s only 13 episodes long and I intend to look into the manga to get my Love Lab fix. Compiling my score it gets a solid 7.8 out of 10. Not perfect, but probably a bit more perfect for young girls, especially those in their tweens to early teens. \\n\\n\r\nChristina\\n\\n\r\nvia modernjosei.tumblr.com",
            "date": "2013-10-02T11:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 115099,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3212647.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/modernjosei",
                "username": "modernjosei"
            },
            "url": "https://myanimelist.net/reviews.php?id=115099"
        },
        {
            "content": "I picked up Love Lab while looking for a new shoujo ai-themed show to watch. I was pleasantly surprised by it, despite the lack of actual shoujo ai. There is some borderline subtext if you squint, but the show largely encompasses friendship, everyday life and some basic lessons of life (i.e. don't lie).  \r\nStory: 7/10\r\nThere's not much of a plot in Love Lab, as you might expect, following the day-to-day lives of a bunch of highschool girls. But there is a point to the story, even if it's something as simple as having good morals. Of course I've seen more done in 13 episodesthan was done with LL but I enjoyed it for the fact that it was short, to the point, and not one moment of it was boring. In fact I can't remember the last time I finished a series faster.\\n\\n\r\nArt: 6/10\\n\r\nI'm usually not a fan of moeblob-type designs but the hilarious facial expressions and the beautiful background imagery of LL was enough for me. The colours are subtle and pastel-ish but lovely all the same. \\n\\n\r\nSound: 6/10\\n\r\nI wasn't a fan of the OP or the ED and the BGM was nothing memorable, but I've definitely heard worse. The soundtrack for LL isn't the strongest. \\n\\n\r\nCharacter: 8/10\\n\r\nAll of the characters are a refreshing take on the shoujo/slice of life genre. Even though some do live up to the stereotypes that their designs are known for (i.e. Suzu being a shy klutz, Natsuo being the \"princess\" of Fuji-girls and rich etc), every single one of them has flaws, as well as things that make them memorable. Riko is the most entertaining of the bunch and definitely my favourite overall apart from Enomoto, whose tsundere-ness is an ongoing gag. There was only one or two characters I wasn't fond of by the end of the show. \\n\\n\r\nEnjoyment: 8/10\\n\r\nI blitzed this series in a matter of days because of how much I liked it. LL is a light-hearted show that provides a nice change of pace for someone like myself, who typically prefers anime with dark themes. \\n\\n\r\nOverall: 7/10\\n\r\nLL may never be hugely popular, but it does stand out as one of the few shoujo shows that has something different about it. I initially was wary of watching it due to the nature of the artwork and the way it presented from the synopsis, as the whole love research thing sounded ridiculous, but it works so well.",
            "date": "2013-11-01T22:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 119023,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68040.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/halfthewords",
                "username": "halfthewords"
            },
            "url": "https://myanimelist.net/reviews.php?id=119023"
        },
        {
            "content": "Love Lab,as seen in the preview,is about a group of middle school girls as they try to prepare themselves to eventually fall in love.\r\nStory:\r\nThe series has a very good start,it is very neatly paced.Nowhere will we feel that  it is progressing at a fast or a slow rate.Riko is mistaken to be an expert in matters of love and she has to maintain that facade due to her rather proud nature.This seemed interesting,but the later episodes brought this up too much for the shows good.After some point,it all does not ring true,and we are not that interested anymore as to how this issue willbe resolved.Many characters are not given much screen time and they seem underdeveloped.If there is a season 2 planned,this may be rectified in it,but as this series stands now,it is quite weak.\\n\\n\r\nArt:\\n\r\nI won't dwell much on this but it quite good,one of the best characters of this anime,in fact.\\n\\n\r\nSound:\\n\r\nNothing memorable,but it works.\\n\\n\r\nCharacters:\\n\r\nEven though it feels as though we have seen all the characters somewhere before in other anime's,the interactions between them are quite refreshing at times,so much that the fact that they seem cliche does not seem a bother.Some characters were not adequately developed,and i hope a 2nd season will address this issue.\\n\\n\r\nEnjoyment:\\n\r\nI really enjoyed the first half of the anime,but for some reason,the second half was not as enjoyable.The jokes just do not seem as funny.The main reason i rated this a 6 was the ending.I was disappointed in it.I expected so much more.Maki's character lost it's freshness for me around the middle of the series.Only sayo seemed interesting as the story progressed,and to a lesser extent,yuiko.\\n\\n\r\nAs for my final verdict,this is quite good,just does not have the 'something special' to elevate it to higher position compared to other high school comedies. \\n",
            "date": "2014-05-15T11:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 143375,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3644167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Maggot_Brain",
                "username": "Maggot_Brain"
            },
            "url": "https://myanimelist.net/reviews.php?id=143375"
        },
        {
            "content": "This is a feel good anime and a good one at that. It starts out pretty dull and generic but then turns really emotionall and funny throughout the entire thing. The characters have flaws and can make misstakes and will do misstakes, this is something that i like and that Love Lab does extremly well. I would recommend this to anyone as it's extremly fun and weird but can still be emotionall when it needs to be. This quickly became one of my favorites. Some might not like the artstyle but this is something that you'll quickly look past if you start to watch it.If you like anime in generall this is a anime which you mustn't miss out on.",
            "date": "2015-11-09T07:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 203047,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LaughingElk",
                "username": "LaughingElk"
            },
            "url": "https://myanimelist.net/reviews.php?id=203047"
        }
    ],
    [
        {
            "content": "This show is not yuri. I don't want to spend a lot of time on that fact, so I'll just throw it out there immediately and move on.\r\nSo, MAL review reader, if you're reading this line, you probably started your trek of this review by checking out the number I dropped in the \"Overall Rating\" section. Intrigued, perhaps you even clicked those words to bring up the breakdown of numbers I awarded the show for various aspects of its creation. You would then have noticed the number \"10\" in the story section and probably asked yourself, \"What? A perfect 10 in story for a comedy?How does that make sense?\"\\n\\n\r\nNormally I would not so directly reference the scores I gave in my actual review; the review is for explaining them, not reiterating them. They're just numbers, anyway. But I feel this worth the mention as it is, in fact, the most crucial part of the review and why the show is so great. I do not consider Love Lab's story worth a 10 because it's deep, or unique, or emotional, or ingeniously crafted. I give it a 10 because it is a comedy executed perfectly.\\n\\n\r\nLove Lab, first and foremost, knows it is a comedy. What does that mean? It means that through everything it does, it stays comical. It will always keep you laughing (if its style of comedy does that for you, of course). Does it have dramatic subplots? Oh yes. Three, in fact. Yet even at the climax of these subplots, it stays funny. In fact, sometimes that's the funniest part. \\n\\n\r\nAnd yet, at the same time, it never sacrifices suspense for the comedy. It's paradoxical in a way, but the show remains both serious and funny at the same time. Within the suspension of disbelief the show works under, the ways these problems manage to work themselves out are both believable and funny.\\n\\n\r\nNow, one of the worst crimes a comedy can commit is to throw in a dramatic subplot out of nowhere to arbitrarily heighten tension, then forget it when it's done and go back to normal. Well, once again, Love Lab dodges this bullet. Every dramatic subplot has something to do with the point of the show (which, if you weren't aware, is a group of girls researching how to be popular with boys), is led up to, and continues to effect the story of the show and its characters throughout. The final climax of the series is actually the culmination of the event that began the daily lives of the Fuji Girl's student council in the first place and had been building up all along.\\n\\n\r\nIf that's not comedy done right, I don't know what is. But now, where would we be without our cast?\\n\\n\r\nWith all the praise I gave the story, the characters, too, must be good, right? Of course they are. Maybe not as perfectly crafted as the story, but still plenty good. First up is Riko, the tomboyish \"wild\" one. She has zero relationship experience, but her personality makes her pretty popular with the girls. However, when she walks in on student council prez Natsuo, known around school for being beautiful, kind, and just all around perfect making out with a hug pillow (Yes, really. Not exaggerating)...one thing leads to another and Natsuo, desperate to know how to be popular with boys, ends up believing Riko has tons of relationship experience. She has been around boys a lot...but always AS one of them, not WITH any of them.\\n\\n\r\nThus begins the relationship with Natsuo as the crazy and Riko as her straight man, even if the reason for it is a bit of a lie. Most of the show's time is spent with these two, and as they grow closer, Riko's secret becomes tougher to keep and even tougher to admit.\\n\\n\r\nBut that isn't all. Coming in to help with the love research will be Suzune, the klutz and shy girl, Yuiko, the slightly-childish and somewhat tsundere, and Sayori, the money-loving and merciless smart girl. Suzune and Yuiko, unfortunately, do not really get a chance to shine. One can only do so much in 13 episodes. That doesn't mean, however, that their characters are not well realized and put to use. Suzune's shy nature, while the center of multiple jokes, is also put to use as a way to distract faculty members when the student council needs to get a hold of the broadcasting room. Yuiko and Sayori make a comedy duo not unlike Riko and Natsuo, though in this case it is Sayori treating Yuiko as her butt monkey (don't worry, it's funny in context). Both of them also believe Riko's lie about being popular and further escalate the challenges of keeping or admitting it.\\n\\n\r\nBut Sayori doesn't believe Riko's lie. Naw, she's sharp and sees through Riko. But she's not just going to let it loose; she wants to use it to her advantage and have some fun, so she does. But for as clever as she is, she manages to get into some trouble of her own, and when it comes time to face the consequences, which she is completely prepared to do, what becomes even harder for her is allowing her friends to share in the blame with her.\\n\\n\r\nOh, there are boys in this show, too. Crazy, right? A cute-girls-doing-cute-things show with sausage? I already said it's not yuri, so it shouldn't be that much of a surprise. One might expect the appearance of boys to be a strange turn that doesn't work well in the show, but the opposite is the truth. If anything, the scenes with the male characters only serve to make the show and its characters even better, allowing them to grow in a way one normally wouldn't expect from this kind of show. It's also simply a nice diversion from the paths these shows usually take.\\n\\n\r\nAnd honestly, I love yuri, but I'm happy for the inclusion of boys here (I know I said I didn't want to spend much time on this, but you've already gotten past the most important part of the review). These shows have a tendency to be kind of sort of maybe pretending to be yuri but not officially yuri so they can say it's not yuri and not polarize any given subset of fans but it's kind of sort of maybe pretending to be yuri so it gets the yuri fans, too. That's cute for a while, but, quite frankly, I'm sick of that shit. Be yuri or don't be yuri. Love Lab replies, \"We are not yuri.\" Thank you, Love Lab. Thank you for being straight with me.\\n\\n\r\nHm, okay, technicalities now. Art and music are both in the decent/good area. They're not nearly bad enough to take the show down at all, but they also don't do a whole lot to enhance one's experience. To sum it up in one word, they are \"fine.\" Standard. The character designs aren't wholly unique but distinctive enough to set them apart and animation is largely smooth, mistakes mostly being minor and unnoticeable if you aren't looking for them. The OP and ED are both pretty generic (actually, I found the OP annoying), though the insert music does tend to fit quite well and give the show a good mood when applicable.\\n\\n\r\nIf you're tired of the standard cute-girls-doing-cute-things formula but still want to see a good one, check out Love Lab. That was my situation. Heck, if you never even liked the standard cute-girls-doing-cute-things formula, you may still like this. It really isn't easily judged by its cover or title because it's just so much better than what it appears to be.\\n",
            "date": "2013-09-28T15:13:00+00:00",
            "helpful_count": 207,
            "mal_id": 114581,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/69585.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Florete",
                "username": "Florete"
            },
            "url": "https://myanimelist.net/reviews.php?id=114581"
        },
        {
            "content": "Well ... that was a freaking surprise. If someone told me, based on that synopsis, that Love Lab is a hilarious and heartwarming journey all through, I'd have him jump off a cliff into my love lab of death. Glad no one did. Regrets would be far too many.\r\nSo, where do I even begin? It's quite hard seeing as I'm still kind of thinking about the anime. I'll just begin by saying this: do not let title or the synopsis drive you off. If you think that this anime is filled with cute girls (it kind of is) doing cutesy things (it kind of is)and that's all it is, then you're wrong. Not blaming you though, I only decided to watch this after seeing a short, hilarious clip on YouTube. So yeah ...\\n\\n\r\nThe story is surprisingly good. Where majority of anime comedies fail, Love Lab managed to go up a notch. Almost nothing in the anime happens just so \"you can have a couple of laughs\". Somewhere, somehow, it all kind of ties up to the end of the story and the conclusion. It starts in a light tone which continues all throughout. Yeah, there's some drama, but it's not over the top. It doesn't try to shove tears into viewers eyes or anything. It's simply there to give more depth to already great characters. \\n\\n\r\nThe story follows Riko and Mika, two seemingly total opposites when it comes to ... well, everything. Mika is a perfect girl, nicknamed even \"Princess\", while Riko is a tomboy, nicknamed \"The Wild One\". They're both admired by other girls in the school but for all the different reason. Fate (and by fate I mean teacher) has its hands in them meeting one another and then the adventure begins. Along the way they're joined with some other (equally hilarious) characters and you're bound to like at least one of them, if not all. To be quite frank, the story is not deep, but it's extremely well executed. It's a story about friendships and how lies sometimes make it hard. Nonetheless, everything that happens is a part of the story. It's not just a sidetrack business trying to make you laugh.\\n\\n\r\nAnother impressive part of Love Lab are the characters. There are five main characters (seven if you include guys), and they're all enough unique to have their own charms and likeness to them. Mika is a delusional perfectionist who does everything on her own and wants desperately to have a boyfriend. Riko is her straight counter-part, who's \"Master of love\", and never fails to make you laugh with her comments. She's not as smart as Mika, but you admire her for what she is. Then you have Suzune, shy and timid but equally enthusiastic about their quest to learn how to seduce boys. There's also another duo of hilarity, Sayori and Yuiko; Sayori being composed, seemingly cold and detached person with quirky remarks and affinity for money, and Yuiko being not-so-annoying tsundere. All of them have distinct personalities and they all bring something to the table when it comes to comedy. \\n\\n\r\nYou see them grow closer and closer as friends, and you actually believe in their friendship and you feel worried when it feels as if it's going to collapse. There are some over the top moments, but most of the time it's down to earth funny. \\n\\n\r\nWhen it comes to the production department, it's nothing amazing but it's good enough looking to the eyes. Anime-only-comedy was done extremely well, and I really loved most of the expressions of the characters. They were cute when they were meant to be cute, and they were extremely ugly when they were meant to be ugly. Backgrounds were lacking but that's to be expected from character-focused anime so no complains there. Soundtrack was lacking as well but, from what was there, it fit solidly. \\n\\n\r\nOverall, Love Lab was extremely well done, definitely above average and on sub-par with some other hilarious comedies. Its drama wasn't there to suddenly shift the tone to dark and try to appear more mature, but to give more depth to already established characters. I really do recommend Love Lab if for nothing else but its hilarity.",
            "date": "2014-05-10T13:19:00+00:00",
            "helpful_count": 70,
            "mal_id": 142903,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=142903"
        },
        {
            "content": "I almost didn't watch this show.\r\nMy friend was giving me the rundown on this season's lineup, and mentioned that he was disappointed that the Yuru Yuri crew were working on a show that was being described as being, \"Yuru Yuri, but lewder.\" I was a bit sad, Yuru Yuri is one of my all time favorite shows, and seeing the talent behind it make, what I assumed to be, a show with the fan service dial cranked up to 11 was just a let-down. Fan service won't put me off a show altogether, but if its the central focus of the show, I tend tohave a diminished interest.\\n\\n\r\nWhoever came up with that description of Love Lab is a monster, and should feel bad. This show is nothing at all like it was described to me.\\n\\n\r\nContent wise, it's not dirty at all, the subject matter of practicing for love is presented in a charmingly innocent way. With characters who are all oblivious but earnest in wanting to know just what it takes to find love. Little to no fan service through the entirety, just smart and well paced humor with fairly low stakes character drama.\\n\\n\r\nThe art and animation are incredible, with a very good flow and perfect snap when they want to punctuate a gag. Everything flows just right, and it just FEELS good to watch. Character design fits its tone perfectly, and the voice talent is spot on.\\n\\n\r\nSure, it's another slice of life anime about high school girls in an incredibly specific and idiosyncratic club, but it does it well enough to be worth watching by fans of fun comedies.\\n\\n\r\nSo, ignore what you heard and check this one out. If you remember the awkward days of trying to understand what it meant to find love, or just like funny slice of life shows, then check this one out.\\n\\n\r\nLove Lab ended up being my surprise favorite of the season, and it demands your attention.",
            "date": "2013-07-23T13:58:00+00:00",
            "helpful_count": 59,
            "mal_id": 106501,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1771045.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SpleenMachine",
                "username": "SpleenMachine"
            },
            "url": "https://myanimelist.net/reviews.php?id=106501"
        },
        {
            "content": "Of all the things that exist in the world, perhaps one of the most debated for centuries is the concept of 'love'. Like seriously, what exactly is love? Is it a feeling towards someone you hold dearly for? Or is it perhaps something we humans are born to be part of? Or whatever the case, I'm not a scientist here to discuss the concept of love. However, what I am here to discuss is this cute little series known as Love Lab that debuted during the summer of 2013.\r\nLove Lab (also known as Renai Lab) is an anime series based off of the 4-koma ofthe same name. The series is written by the author Ruri Miyahara whom has little presence in the manga industry. Her other work known as Bokura wa Minna Kawaisou also has similar themes involving love in a slice of life story with awkward comedy, drama, and romance. However, Love Lab is a little different because it takes the idea of love and focuses it on exclusively as a sort of experiment. Our main characters at Fujisaki Girls Academy plays the role of the scientists and tries to find out exactly what love is through these so called \"love experimentation\".\\n\\n\r\nFor starters, Love Lab's concept consists of the idea of discovery. This primarily focuses on discovering how to attract the opposite gender and what love is. It's quite a difficult task because there are all sort of mishaps dealing with love. I mean, think of this way....when you first fell in love, how did that feel like? At any rate, the experiments dealing with the discovery of love and its concepts are explored at Fujisaki Girls Academy. The school itself is famous and pretentious because its school body is composed of well mannered students with elegance. A primarily example is Natsuo Maki, the Student Council President. With her elegance and beauty, she almost seems to be the perfect example of a Yamato Nadeshiko. Hmm, or is she?....\\n\\n\r\nAmong its other cast members is Riko Kurahashi, an admired girl but with a rather tomboyish personality. She is one of those girls where is very straightforward with their brutal honesty. In fact, she is even known by others as 'The Wild One'. This is clearly evidenced in the first episode with her actions. Coupled by the fact that she grew up with a little brother younger than herself, expect Riko to be the contrasting side of Maki. If Maki represents the princess, then Riko would be the beast. Then, there are also other characters of the series also become member of the school's life as they are on the journey of perfecting their discovery of....love.\\n\\n\r\nBecause the series takes place at all-girl school, expect some undertone yuri. However, this is rather a facade because the tone is actually not as explicit as people may think. This is more evident later on when other characters enters the story that degrade this genre. (if it can be considered one at all for this series). To put it simply, it's NOT yuri.\\n\\n\r\nWhat makes Love Lab entertaining though are a variety of its ideas. The surprising concept is immediately presented when Riko discovers Maki with her obsession. It doesn't help Maki disprove her case as she is caught red handed with a toy that she practices on. While this is essentially seen as a joke, it's clear that Maki is actually serious about romance. She hopes to make the hearts of boys go 'doki doki'. In reality though, she is already considered elegant with a beautiful face and figure. This is prove especially later on when she actually has several chance encounters with the opposite gender. \\n\\n\r\nAs for the experiments go, the theme focuses on love and its various little gags. The fun part typically involves with Maki and she tries to practice with situations that she believe will trigger 'flags'. In a way, her ideas can be relatable to otome games. Unfortunately for her though, these concepts don't always apply to reality and she learns it the hard way. Furthermore, her denseness on the concept of love makes her go to extreme measures with delusional ideas on several occasions. These experiments varies in many degrees as the girls tries at all sort of weird ideas. It's not very simple to explain so it's better to watch the series yourself to see what's going on. However, it can be relatable to high school experiences. Remember the first time you asked out someone? However, the process of actually verbally ask the question is a lot harder than it seems. It takes trials and error to get the right response usually. Here, the girls are in a similar situation.\\n\\n\r\nBeing tagged as comedy also, expect Love Lab to have many humorous dialogues and absurd character interactions. There are moments where we can't help but laugh with Maki's behavior regarding to the experiments. In fact, her initial encounter with Riko becomes an abrupt bubble burst with humor. Riko on the other hand is fun to watch as she becomes a sort mentor to Maki. It's like teacher and apprentice without the light sabers.\\n\\n\r\nAt some point though, Love Lab might become a chore to watch if decide to follow it all the way through. For one thing, we should want Maki to succeed and unlock the doors behind romance. However, the key to opening it often has her grasping on the wrong set of the key chain. This is proven by her naive ideas and because she lacks experience involving actual interactions with the opposite gender. Also, Maki often interprets almost everything as serious and often fails to recognize words behind the meaning. This is proven later on when she gets into a situation where she gets trapped in a zone of confusion. Additionally, Love Lab often tries a bit too hard and the ideas are cliched. These ideas are usually seen in most romantic comedies but here is taken as a joke. Unlike capturing targets similar to TWGOK (The World God Only Knows), the girls often finds themselves to be the targets.  \\n\\n\r\nArtistic wise, the series is pretty generic in its designs. The only two characters that seems to stand out among the others are our two lead female protagonists – Maki and Riko. Maki is designed to look, dress, and act elegant. Riko on the other hand has that tomboyish look for her hairstyle. She even changes her hairstyle too but no one seems to notice it. Two of the supporting characters also goes along with glasses to their design that makes them seem more mature and geeky. Yuiko Enomoto's eyebrows are also designed to look noticeable and commented on many times throughout the show. Finally, there's also the school design that gives off that girlish feeling. It's a girly show after with girls trying to learn romance.\\n\\n\r\nAs far as soundtrack goes, Love Lab once again adapts that girlish tone through its OP song, “Love Shitai”. Hearts are clearly seen in the song along with blushing moments of the girls. The OST itself is lighthearted but maintains a poor position because the majority of the series focuses on romance rather than a music band. However, Riko's VA Manami Numakuma does a terrific job in her role because of her tomboyish personality. Her tone of voice clearly presents the vocals of a tomboy. The way she speaks truly makes her the “Wild One”.\\n\\n\r\nI won't say I love Love Lab but it's definitely something fun to watch to pass time by. It has its moments with the girls and what they do at school. In many ways, we see a familiar side to what girls think of the opposite gender as a rather entertaining outlook on the anime industry. Usually, it's the guys that goes after the girls like no tomorrow. But here, the girls wants to learn about love, educate themselves with romance, and maybe even earn themselves a boyfriend. Ultimately, this series might seem to be a bit different but it's certainly can be worth the time to watch through. Love Lab isn't just about experiments of love but also about discovery through experiences.",
            "date": "2013-11-11T16:09:00+00:00",
            "helpful_count": 54,
            "mal_id": 120005,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=120005"
        },
        {
            "content": "Before I start officially start this review, let me make one thing clear. Love Lab is a full-time comedy anime. Those who don't like comedy, please stay away from this anime. Don't go around giving Love Lab a low score. It will stop those comedy lovers out there from watching Love Lab. On with the review.\r\nUp till now thousands of animes have been released and among these animes we have Love Lab. A small 13 episode comedy anime. Now, what is the plot in Love Lab? Well, it is about the members of the student council in an all girls middle school. The funny partof the plot is that these young girls are secretly doing some 'research' on how to make boys fall for them despite the fact that none of these girls has had any sort of love experience with any boy.\\n\\n\r\nLet's talk about the story in Love Lab. As you might know that many comedy animes don't have a proper story and they rely mostly on unlinked episodes with loads of funny scenes. This is not the case in Love Lab. There is actually a well built story here. You know those animes with good stories where you can tell how it will end halfway through? Well the best thing about this particular anime is that it won't turn out as you think it would. Apart from being well planned, the way the story progresses is totally unpredictable. You will find instances in this anime where you would think of an obvious ending, but it won't end that way. Some characters starting off as antagonists will quickly change to the protagonist and give a whole different view of how things will end. To start off Love Lab, a great introduction to the characters was given so that you know what kind of people you will face. The story progresses quite beautifully. They bring about unexpected events and don't go according to what you think. The story doesn't go the expected way. It felt nice to just go where the story took you and not being able to see the ending beforehand. The ending this anime gave was by far the best ending to an anime I have seen till now. The ending really brought me to tears. They gave it an obvious ending which most won't expect. \\n\\n\r\nComing to the artwork and sound. It's what you would expect from an anime released in 2013, pretty decent. The artwork is not boring as to make you want to drop this anime. It is pretty neat. \\n\\n\r\nEvery anime along with a good storyline should also have well developed characters in order to stay interesting. The way they portray the characters is worth praise here. Unlike some animes, the number of characters was kept low. Some extra characters were added only for the purpose of adding some more comedy to the already funny anime and they had no role in the progress of the story. We are introduced to 5 main characters who are members of the student council.\\n\r\nFirst off we have Maki Natsuo, the vice-president (later president) of the student council. She is a pretty and talented girl who is top in her class. The problem (and main source of comedy) is that she has had no interaction with boys and wants to. She started 'love research' after caught kissing huggy (a large pillow) as practice. She was caught by our next character, Riko Kurahashi. Assistant of the president, Riko is sort of a tomboy and told a lie that started to haunt her every time love research was brought up. Then there is Suzune, a first year middle schooler. She is a clumsy little girl and her clumsiness is one of the main sources of comedy. Then there is Yukio Enomoto, the president (later vice-president) of the council. We also have Sayo, the treasurer. She has a sort of sadistic personality and is the only one who doubts Riko but still plays along. The weird personalities of these characters and their somewhat stupid actions is what makes Love Lab enjoyable.\\n\\n\r\nLove Lab is a brilliant anime. It's hard to tell how good an anime is in words or without spoilers. If you want a good laugh, you might as well give Love Lab a shot. You are sure to enjoy it.\\n\\n\\n\r\nI hope this review was good. Please do comment and give any suggestions on how I could make my review better. :-)",
            "date": "2013-10-06T08:04:00+00:00",
            "helpful_count": 21,
            "mal_id": 115739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650363.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yamada2",
                "username": "Yamada2"
            },
            "url": "https://myanimelist.net/reviews.php?id=115739"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nIn many ways, love is a skill. It takes practice, determination, and a little bit of luck in order to fully master its ways. Love is used with romance; it can take on many different forms, and can be applied to many different situations. So, how can one deal with the vast amount of possibilities? Love Lab aims to tackle this problem, and what we are left with is one of the best comedy shows that I have ever seen.\r\nSTORY\r\nLove Lab starts off quite simply. \"Wild Kid\" Riko one day stumbles upon \"Princess Fuji\" Maki doing something quiteout of character. And from that encounter, the rest of the show follows.\\n\\n\r\nThe point of the show is literally in the title. The student council conducts \"love labs\" in order to train themselves to become better lovers and therefore engage in romantic developments. In this way, the show becomes an interesting mix of episodic and story arcs. Much of what happens appears to be standalone, but in actuality, the actions they all take and the things they do affect what happens as the story evolves. This type of \"story-telling\" worked wonderfully because it allowed it to jump from their \"love lab\" escapades, to weaving a narrative, then back to more \"love lab\" shenanigans.\\n\\n\r\nThis is a comedy show. As such, the vast majority of what happens is entirely comical and hilarious in nature. However, the show does introduce somewhat significant pieces of drama. But thankfully, none of it feels forced or unsatisfying. Rather, it aligns well with the way the show presents itself. This is because it again employs this mix of two different brands. Meaning, it doesn't just sit on being dramatic, instead going between funny and emotional in a sinusoidal pattern. This is mainly the reason why the drama never feels out of place.\\n\\n\r\nIn Love Lab, its overall (and pretty much only) theme that is explored is the idea of what it means to be a friend. Having someone to rely on during good and bad times, someone to be honest with not only yourself but with them as well; the show does a nice job of delving into many different friend-like scenarios. Now, this idea isn't groundbreaking: many shows look at \"the power of friendship.\" And while Love Lab doesn't knock it out of the park, their ideas are noted and at least appreciated.\\n\\n\r\nANIMATION\\n\\n\r\nDespite what LL may look like from the outside, its actual animation is pretty darn good.\\n\\n\r\nThe show uses a rather generic looking art-style. There are no highly detailed locations, intricate character designs, or clever uses of light and shadow. In this regard, the art isn't exactly appealing. However, that isn't to say that it is bad to look at. For the most part, it is just \"there.\"\\n\\n\r\nIn contrast, the animation is great. It contains fluid character movements, detailed facial expressions, and excellent use of both standard and \"comedic\" designs. It's rather funny to see a show like this be animated so nicely. As a viewer, one starts to notice the extra frames in their arm movements, the ways their eyes move, and the attention to detail for their hair and other objects.\\n\\n\r\nI touched on it slightly, but definitely one of the best parts in terms of animation comes from the expressions they are given. Whether it be extremely happy with shades of blushing or quite depressing with glistening eyes, the show incorporates many different reactions that are always on point in comedic timing.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe characters of Love Lab are mostly good. I'll stick to the main five since the rest are largely unimportant.\\n\\n\r\nThe weakest of the bunch goes to Eno. A classic \"tsundere,\" she is rather bossy and rude at times, but her underlying feeling of justice and caring makes her a good person to have around. I'm a fan of this type of girl. But the problem was that she was probably the most underutilized. She would often retort back with a \"Shut up!\" in most situations, but she did have her moments throughout the show.\\n\\n\r\nSuzu is next. Extremely shy, terribly clumsy, and horribly unfit, she seems quite pitiable on paper. However, her kind demeanor and optimistic attitude makes her nicer than any other person. Always looking to be like her seniors, she does her best to aid the group when it comes to their endeavors. Her schtick was always funny to see, and seeing her deviate from her character or go above and beyond it was constantly hilarious.\\n\\n\r\nThe wise and mature one among the student council, Sayori is understanding, defensive, and has a strange obsession with money. While she mostly contains her feelings and teases Riko to no end, she is rational and respectful in the situations that she is put in. During the show, she actually gets her own arc, which allows us to see more of the girl behind the glasses. She isn't super funny on her own, but instead plays well off of the rest of the cast.\\n\\n\r\nRiko, a.k.a \"Wild Kid,\" a.k.a \"W-K,\" is your typical tomboy. She's both forward and passive. She cares deeply for her friends, especially Maki, and doesn't like to see them get hurt in the slightest. Willing to do anything for anyone, she is what you call a \"best friend.\" On top of all this, she is easily one of the funniest characters from the show. Her constant bashing, her playful teasing, and her hilarious reactions to the happenings of the group make her a joy to behold.\\n\\n\r\nBy far the best character, and now personally one of my all-time favorites, is Maki. Talented, beautiful, nice beyond words, and actually a little strange, I can't say enough about her. She's incredibly funny and her love to love is endearing. It is literally impossible not to have a huge grin on your face whenever she is on-screen. She alone should make you watch this one.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is actually quite catchy. I especially like the beginning and the ending where the characters are \"singing\" along with it. It fits the show nicely due to the overall upbeat nature that it brings. The ED, like its visuals, does kind of feel like a car song, if that makes sense. It kind of just makes you want to go. That, and their own little \"Go!\" is really adorable.\\n\\n\r\nThe soundtrack is fine for what it is, but I actually found the use of the varying and unique sound effects to be strong. There are many different types, such as with the slap-sticks or the transition piece that work really well.\\n\\n\r\nVoice acting-wise, I found Maki's, Riko's, and Eno's performances to be quite above average. Not only do their voices fit perfectly, but they do a really swell job at making the characters act and feel as they should.\\n\\n\r\nENJOYMENT\\n\\n\r\nIt probably goes without saying at this point, but I absolutely loved this one. I'm a huge sucker for romance, and while the show isn't about romantic relationships, its interesting premise of focusing on romantic happenings was so much fun to watch.\\n\\n\r\nI busted out laughing every time Maki would squeal with delight, I adored Riko breaking the fourth-wall, I smiled at Eno falling for \"Makio,\" I loved them overreacting to many situations; there wasn't an episode where I wasn't laughing or smiling the whole way through (minus the drama parts!).\\n\\n\r\nThere's not much more to say here, to be honest. I loved every second of it, and my only wish was that there was more. Love Lab has easily taken a spot among my favorite comedies, and I will be eagerly waiting for season two. Because we can always use a little more love in our lives time and again.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, mixes slice-of-life and arcs in conjunction with comedy and drama to nice effect\\n\\n\r\nAnimation: Good, plain art style but really well done actual animation\\n\\n\r\nCharacters: Good, Maki is fantastic, Riko is great, and the rest support them\\n\\n\r\nSound: Great, good OP and ED, nice use of sound effects, above average VA work\\n\\n\r\nEnjoyment: Great, smiles and laughs for the entire ride\\n\\n\r\nFinal Score: 9/10",
            "date": "2014-10-28T03:02:00+00:00",
            "helpful_count": 12,
            "mal_id": 166501,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=166501"
        },
        {
            "content": "I finish this series right before I start to write this review. To sum it up, I would say this daily-style anime exceeds my expectation. The main reason behind this statement is its story is much better than others’. Anyway, I recommend this anime to everyone who enjoys in this kind of anime, such as “Is the order a rabbit?”, “New Game”, and etc. \r\nMany factors in Anime are satisfied by high quality. \r\nArt, the overall quality of Art is stable. Many details are handled well. The quality can be compared with “New Game. “\r\nMusic plays an important role in a number of plots. Itdoes its duty that is to bring the audiences into the show. Although, in my opinion, the opening and ending theme are not outstanding. \\n\\n\r\nCharacters, from my point of views, are build extraordinarily. Maybe the reason that makes me have this though is this anime is from 2013. Compared to current characters, there are some differences. After all, every character in this anime is unique. Theirs personalities are impressive on the positive side. \\n\\n\r\nStory plays a crucial part in this daily comedy. It makes this anime not be boring. The boring I mean here is there doesn’t exist some crucial events but nothing important. For instance, although “Is the order a rabbit?” is an outstanding daily-style anime, what it lacks are in this anime. There are several important plots in these 13 episodes. Every single plot makes the audience realize that “Look! We got some interesting story.”\\n\\n\r\nConclusively, this anime is worthy to watch. I recommend to you who needs some laughs in your life.",
            "date": "2018-02-02T02:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 270398,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437796.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ching-Chan_Kyo",
                "username": "Ching-Chan_Kyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=270398"
        },
        {
            "content": "Since this was recommended to by a girl, I already knew it would be good. Then, I found out it involves relationship issues... Talking about romance, without featuring it at all is trully original...\r\n{STORY - 6/10}\r\nA small group of girls giving love advices? Eventhough they don't know a thing about it? Pretty original! Love Lab is about \"how to be romantic\", as it literally gives out lessons to help young girls on getting that special guy's attention.\r\nFinding Maki on a embarassing situation with her own \"kissing\" dakimakura (body pillow) suddenly turna Riko into the student council's assistant. Her first task: teaching our princess how toget closer to a boy and make him interested on her.\\n\\n\r\nProblem is that Riko has no experience and her extremelly tomboyish behavior triggered many rejections from her classmates all over the years past. One single lie convinces Maki the contrary and the admiration she shows is big enough to take Riko down for good... How long will this act last?\\n\\n\r\nInside a school made for girls, obviously that others may want to learn something from the \"Love Master\". All focus from the council now goes to resolving romantic issues and this is fantastic!\\n\\n\r\n{ART - 7/10}\\n\\n\r\nAside the \"sweet\" design used on Love Lab, a lot of short \"special\" animation sequences are featured. High speed chases, dark auras and many background changes are some of the nice extras we can notice while watching it.\\n\\n\r\nOverall art is quite simple, specially when it reffers to the characters. Still, the main ones are distinctive on appearance matters and the low-contrast style is gorgeous!\\n\\n\r\n{SOUND - 8/10}\\n\\n\r\nPerfectly matching songs were used on both intro and ending sequences. \"Love Shitai\", about getting in love, and \"Best Friends\", based on these five girls relation, are cheering and joyful, nice to hear, being performed by the main voice actresses, under the name of \"Fuji-Jo Seitokai Shikkou-Bu\". Onto the cast's choice, voices fit well to all characters!\\n\\n\r\n{CHARACTER - 6/10}\\n\\n\r\nMembers from the Fujisaki Academy's student council, every one being a love initiate, represent somd of main the possible kinds of girl a male student from junior high may fall in love with.\\n\\n\r\nRiko, violent and rough, gets constantly avoided and rejected, but she her strong-willed and protective attitude is what steals the spotlight. Maki, sensible and gentle, is the one who shows most interest on starting a love relationship with someone. Her beauty is what attracts everyond nearby.\\n\\n\r\nSuzu, cute and shy, is always making mistakes and admires Riko from deep inside. Eno, dedicated and proud, is the only true friend from Sayo, whose cold and anti-social personality prevents her from interacting with her classmates.\\n\\n\r\n {ENJOYMENT - 9/10}\\n\\n\r\nIt was a very good comedy and improved a bit of my knowledge about girls in general. All the tips I saw in here aren't useful for me to approach any, but those are a great way to understand something about them.\\n\\n\r\n{OVERALL - 7/10}\\n\\n\r\nAn accidental encounter turns Riko's life upside down and she steps into a mess that only gets bigger and bigger. Dating isn't allowed and the council shouldn't be caring about the students' love issues. However, Maki's determination on finding the prince of her dreams persuades Riko onto helping her and trouble after trouble will meet Love Lab!",
            "date": "2013-12-17T17:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 124371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=124371"
        },
        {
            "content": "[Spoiler Free Review!]\r\nLove Lab. Whilst the name may be somewhat off-putting, this anime deserves a solid 8/10. It's not overwhelmingly unique or captivating but it does what a slice of life comedy is meant to do and in all honesty, it does it pretty well.\r\nStory: 7\r\nThe story is good. There is a main plot line that's easy to follow with some side stories thrown in here and there. That being said, there are very few moments where one feels engaged in the story line. It's predictable, to say the least. There are, however, some decent tensions regarding Riko's lies. They kind of make you wantto pause the video to relieve yourself of the awkwardness but that's a sign of good writing. This show has a lot of funny moments and with a satisfactory ending, it deserves a good 7/10 in terms of story (which is pretty high for a slice of life, in my books).\\n\\n\r\nArt: 5\\n\\n\r\nLove Lab was released in 2013, so I wasn't expecting anything great in terms of art. However, the art and animation almost seemed like it was older than that. There's nothing awful about it, I just feel like it lacks vibrancy in places (especially at school). In terms of character design, the characters all look very different in terms of faces and hair, which is a plus. Although, Mizu's face and glasses seemed very poorly designed and animated in some scenes, which kind of made me dislike her character, sadly. I'm harsh when it comes to art and this is unfortunately only deserving of a 5.\\n\\n\r\nSound: 8\\n\\n\r\nThe OP and ED were catchy (especially the OP) but not incredibly so. The soundtrack wasn't too noticeable most of the time but had its moments. The voice acting is good. All character's voices suited their personas and there are a few familiar actors, which is always a plus. Riko has a particularly attractive voice in my opinion so... 8!\\n\\n\\n\r\nCharacters: 9\\n\\n\r\nSo close to being a perfect 10, honestly. The show has an eclectic mix of characters who, whilst aren't the most unique, are this anime's strongest aspect. They aren't introduced too quickly so we have time to grow fond of them before new ones are introduced and the creators also seemed to keep up a steady pace of introducing new characters, which really kept it feeling fresh throughout the series. They're are all unique and there are a lot of likable, funny side characters too! The only thing Love Lab lacks in terms of characters is development. However, the anime is a 13 episode slice of life comedy and one would be considered insatiable to expect fleshed-out character development from it.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nAll of these features combined left me feeling quite fulfilled whilst watching and after finishing Love Lab. It's a casual slice of life comedy. Great stuff if you just want a break from stress or don't want something too complex and serious.\\n\\n\r\nOverall: 8/10\\n\\n\r\nI'd recommend this anime to watch. Its re-watch value is also decent, considering that most of the jokes are the kind that make you laugh in the moment, but are also forgotten over time. If you like slice of life comedies, you'll like Love Lab. However, don't be mislead by the \"romance\" tag. Whilst the main goal of the characters is \"love research\", the main theme of the series is the friendships between the characters. As long as you go into this anime not expecting any romance, you'll enjoy it.",
            "date": "2015-06-04T21:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 189574,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4640167.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Blue_Miku",
                "username": "Blue_Miku"
            },
            "url": "https://myanimelist.net/reviews.php?id=189574"
        },
        {
            "content": "Let's get one thing out of the way first: the show's not yuri. It definitely isn't! I was surprised that it was seeing that it was. Prejudice aside, Love Lab was a fun-ride for me after it's 13 episodes.\r\nThe show's protagonist is Riko Kurahashi, a tomboy who attends Fuji Academy - a prestigious school known for its well-behaved female students - who is greatly admired by the female students, entitling her as \"The Wild One\". One day she accidentally discovers Maki Natsuo - the academy's student council president and model student - kissing a hug pillow (\"dakki\") and claims to be learning romance. Consequently, Rikabecame Maki's aid for love research and is followed by several other female student council members.\\n\\n\r\nThe story was classic comedy. It always end with Riko punishing or reprimanding Maki for her idiocy yet her mischief that stems from her devotion of knowing romance gets more elaborate and comedic as the show progresses. Though the show greatly emphasizes enjoyable friendship which is rather nice and warming to the audience. All characters are unique and I don't find either one of them despicable, even I find Sayori's schemes and way of talking to other characters very funny.\\n\\n\r\nAside from girls, some guys are introduced as well, which share a very special relationship with Riko, both good and somewhat bad. Their interactions with her were one of the ways to get Riko all flustered in contrast where she acts cool and reasonable at her school. Seeing this shows how female she still is despite her boyish-characteristics. The ending was a good ending for everyone as it proves that deceiving someone is never the root of a great friendship, knowing that made me reflect on myself which was very enlightening.\\n\\n\r\nVisual and audio quality were decent and voice acting was great as always. \\n\\n\r\nOverall, Love Lab! is where you can escape from the common harem genre, which is very refreshing. You get fun characters and a decent story if not all bland. Either way, it all depends on your preferences.",
            "date": "2013-11-07T10:28:00+00:00",
            "helpful_count": 7,
            "mal_id": 119563,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JonBort",
                "username": "JonBort"
            },
            "url": "https://myanimelist.net/reviews.php?id=119563"
        },
        {
            "content": "The schoolgirl comedy genre is something which has just gotten increasingly ubiquitous in anime of late, but contrary to what one might expect, anime studios keep finding ways to make series from the formula which stand out. Studio Dogakobo--who previously produced the anime Yuru Yuri in the same genre--have with Love Lab found another anime that is case in point to that.  Likable and refreshing, this is an anime worth watching for someone with even a passing interest in the genre.\r\nLove Lab is well produced. The art looks great and I never noticed much in the way of bad animation. Sound is good too--backgroundmusic is appropriate and the opening and ending theme are both really cute and fun. The voice acting is where it really shines on the production front though. The voice actresses have impeccable timing and exquisite delivery, which just makes the comedy funnier and the proceedings seem all the more natural and fun. \\n\\n\r\nWhich brings me to one of the reasons Love Lab stands out in its genre. The comedy is really good. Humor is subjective, I know, but for me, I can't think of very many similar shows that made me laugh and smile more. The comedic writing is excellent and the characters play off of each other impeccably. At its core its your basic boke and tsukkomi act, but it does it so well it's all more satisfying than it usually is. \\n\\n\r\nThe other big reason Love Lab stands as something unique is its plot. Most series in the genre seem content to offer separate snapshots into the girls' lives that maybe in some cases build toward something but don't usually connect directly. Love Lab, on the other hand, connects together in more obvious ways. The episodes actually end with a \"to be continued\" and there are usually plot hooks setting up what is going to happen next. The continuous feel works to it advantage, making it feel more like a complete story even if it is at its core still a collection of amusing events in the lives of a set of schoolgirls.\\n\\n\r\nNow the schoolgirls themselves are an interesting bunch. Good characters are needed in these shows and Love Lab has them. At its core are: Riko, the tomboyish lead who ends up getting dragged onto the student council as an advisor where she must unconvincingly pretend she is a master of love; and Maki, the student council president who is kind of a completely ridiculous idiot and, in her utter cluelessness, is eager to receive Riko's guidance. The two are in time joined by three other girls: shy secretary Suzu who is clumsy and cute; the manipulative and cunning treasurer Sayo who likes playing games with the others, particularly Riko; and the student council VP Eno who is a ridiculous aggressive tsundere character who seems to frequently make a fool of herself. All of them are well developed and produce laughs as they interact both witch each other and a cast of supporting characters that is in time introduced.\\n\\n\r\nSo in short, Love Lab is great fun. With good characters, well produced, actual continuing story and excellent humor, it has a lot to offer. Very strongly recommended.\\n\\n\r\nUpdate: Upon completion, I ultimately bumped my score of Love Lab up to a ten in score. It was impressive from the start and in the end it didn't let me down anywhere. The characters are so lively and fun to watch and also dynamic and engaging, the humor is so consistent, and the sheer fact that it pulled off the feat of staying true to its genre while also offering up an interesting enough ongoing plot that it never stopped being rewarding. I find myself unable to think of anything more I wanted from the show, aside from more of it as soon as possible. Anime comedies are seldom this remarkably solid.",
            "date": "2013-08-17T08:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 110051,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2621361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/raritydash",
                "username": "raritydash"
            },
            "url": "https://myanimelist.net/reviews.php?id=110051"
        },
        {
            "content": "Much to my dissatisfaction let me start off saying despite a few other reviews I saw this show is not shoujo ai. The opening also points to this possibility however don't get your hopes up. It's not there so if you're looking for a cutesy yuri don't go for this, but that doesn't mean you should drop it either.\r\n\tIf you like moe shows you'll like this and if you like comedy this is also a winner. At its core Love Lab is a comedy and no matter how serious the tone it always delivers a joke and never misses the punch line. It delivers plentyof fun moments and does a good job of not deviating too much from the main goal of keeping you laughing.\\n\\n\r\n\tThe plot itself is not going to blow your mind or set new lines for what a comedy should be so just expect the common place cute girls doing cute things and trying to learn about boys, but actually hilarious in comparison to something like K-ON! The main characters are your standard fare of cookie-cutter archetypes don't expect much on this front. That is not necessarily a bad thing though because the show works and flows nicely this way and will deliver at least one or two characters you'll like.\\n\\n\r\n\tThe art for this show is very familiar and nothing too new or impressive. It does keep the same style throughout. On the animation side of things Love Lab starts off with some pretty visuals and nice flowing scenes that are very well animated and looks surprisingly good for a moe comedy. However the animation doesn't keep this quality through all the episodes, and falls off quickly. It seems only the more emotional scenes get this treatment and it's a shame because it looks awesome.\\n\\n\r\n\tThe sound in Love Lab is also nothing too impressive, but it's good enough to not take away from the rest of the show. The voice actors portray the characters well. The only thing is that they're the same voices you hear in all moe comedies. The music is nice and accommodates the scenes nicely, but is overall forgettable outside the OP. The ED isn't anything that great either, and I found myself skipping it a few times just to get to the next episode.\\n\\n\r\n\tOverall Love Lab is just another moe comedy with not too much going for it, but at the same time seems to hold something special that not all the others have. It's funny and it doesn't stray from this path other than once or twice to add drama and even then it's always just setting up the punch line for another joke. Its fun and entertaining if you like innocent, romance themed humor or cute girls interacting with each other.\\n\\n\r\n\tI give Love Lab a 6.5 out of 10 but MAL won't let me do that so 6 because I round down.\\n",
            "date": "2014-01-16T09:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 128969,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482521.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FreakyTy",
                "username": "FreakyTy"
            },
            "url": "https://myanimelist.net/reviews.php?id=128969"
        },
        {
            "content": "Despite the art to be mediocre, the sound design being cheesy, and the characters almost being generic, this anime gave me some laughs. What I adored most about this anime is how animated it really is. The animators of this show didn't hold back their creativity when making Love Lab. Hell the ending moved me because the animations made the characters become alive. \r\nIf I were to describe the characters, I would call them generic. However, it never bored me because Love Lab had clever skits and wonderful animations, it made the characters memorable. There were some episodes that were mediocre and some skits werevery obnoxious since they were repeated till the very end. \\n\\n\r\nThe most enjoyable part of the show is the first episode. The animations on the episode were very on point, the two characters had this dynamic that made me laugh, and the story was too ridiculous. It got me to keep watching till the very end, and I enjoyed it. \\n\\n\r\nI do wish Love Lab has a sequel, but sadly I don't think that will be coming. In the future, I might watch this again.",
            "date": "2018-09-06T17:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 288352,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6190384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PapaRonny",
                "username": "PapaRonny"
            },
            "url": "https://myanimelist.net/reviews.php?id=288352"
        },
        {
            "content": "When I watched “Love Lab” for the first time, I was amazed at how interesting this story was. The funny thing about the show was how well the characters were developed, mainly Sayori, Maki and Riko. Those characters shined in the first 7 episodes when they talked about how they go along with romance, while at the same time trying to make sure the girls-only school doesn’t know that much about it. Sayo is one of the cool characters that doesn’t have to be liked like Riko, or try hard to get love like Maki and Eno. However, she is a sort of a balancebetween these characters, as they sort of represent a battle between two worlds.\\n\\n\r\nAs for Eno and Suzu, the next 6 episodes dealt with their two different personalities; one wanting to be a leader while not really knowing how much to lead because of Riko’s popular personality, and the other so shy that she wants to be popular, but not wanting to be too much of an outcast.\\n\\n\r\nRiko has her flaws, too. Besides being overconfident and flimsy, she does wish about what it would be like to have a boyfriend without having the “tomboy” look, whereas Maki has very wild expectations that don’t come close to reality. When it comes to dating, it’s like her visualizing kissing a body pillow: you won’t come too far with actual romance and relationship skills.\\n\\n\r\nLove Lab is a good show if you wonder how a school-themed show can be enjoyable and quirky at the same time. Most of the school-themed tropes aren’t as evident as most school-themed shows, but the jokes about high school love interests being something that must happen in your life if you want to have an “authentic” relationship, will hit you hard, when they weren’t trying to be serious.",
            "date": "2018-08-18T21:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 286847,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6237609.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/albertbrown",
                "username": "albertbrown"
            },
            "url": "https://myanimelist.net/reviews.php?id=286847"
        },
        {
            "content": "Love Lab is one of those very deceptive shows where you look at the season preview and go \"wow more girls doing club things in high school such original wow very unique\". Under that stereotypical shell however, there's a great show. Hopefully you know what you're getting into by picking something from the SoL category and you'll treat this recommendation as such.\r\nThe comedic value mostly comes in the form of the Straight Man/Funny Man routine made famous by comedic duos like Abbot & Costello and Laurel & Hardy. A lot of SoL shows tend to have a pair like this but it's usually limited toone pair and they tend to ride one type of joke throughout the show. What sets this apart from others is that the characters aren't bound to each other: even characters that don't get much screentime with the main cast in the anime are lively and can mingle with said main cast. The best example of this would be the newspaper association's interaction with the student council from episode to episode in which they have a part. There are jokes that come up more than once, but there's enough breathing room and minor detail change between their repetition.\\n\\n\r\nThe story isn't really impressive. The overarching conflict is something that can be drawn from a simple skim of the synopsis: a big misunderstanding. If you've watched  enough anime, \"misunderstandings\" are all too common a plot device and can sometimes end up defining all interactions one character is involved in. The day to day love research subplots make up for this by giving us introspect into the cast on top of giving us some pretty funny scenes. The story does keep you interested in what's going to happen next and always ends on a proper cliffhanger, however, which a lot of shows which attempt an overarching plot sometimes can't do.\\n\\n\r\nMy biggest weakness when it comes to talking analytically about shows is that I'm no art/music critic - I leave that to people who are much more knowledgeable about the arts. From the shows I've watched, I felt that the music was pretty average. Scenes that relied on different music to set moods worked well, but I can't say that I'd remember Love Lab's soundtrack 6 months from now. I've grown used to shows relying on one jingle for some minor background noise, but the OP, ED, and character songs were all very well done and enjoyable to listen to. Some people like to skip OPs and EDs after watching them once - I'm one of those people. However, I ended up sitting through each OP and ED with ease. The seiyuus doing their character songs in character was certainly a point booster. I'm not really that great at finding QUALITY moments that aren't painfully blatant, but most scenes were well detailed. There are placeholders for background characters as you get later into the show, but when concerned with active characters (not necessarily the main cast) there weren't any major QUALITY moments I can remember as of now. The color pallet used is very warm, reminiscent of shows like Nichijou and SYD. There were some very funny animated scenes: case in point, a LOT of animated .gif files are floating around on a number of image-sharing/social websites.\\n\\n\r\nThe characters are possibly my favorite point to talk about. Like with all works of fiction, the viewer wants to feel like they can relate to the characters in the show and the problems they go through. This is usually a stretch for SoL shows where it's mostly cute girls doing cute things cutely sometimes with light yuri undertones and a few gags. Love Lab gets the character score I gave it because it hit the mark for realistic and understandable characters. While there are certain tropes that come with your standard high-school cast and any show that has a Straight Man/Funny Man routine, Love Lab manages to keep things grounded in reality. Everyone is flawed in one way or another, and there are no hyper-dense characters that are just totally oblivious to the feelings and actions of the other characters around them. While inter-character conflicts are short in the interest of time, enough background is given to us so that we can put 1 and 1 together. A popular arguing point is that a male target audience is unable to relate to a gaggle of high-school girls in a club or council of some sort, but it's not the characters we're relating to - it's the actions they take and the thoughts they have and the feelings they experience. What's most refreshing about the Love Lab cast as characters is that their decisions in serious scenes don't leave you asking \"What logical path would one have to take to even THINK of arriving at that conclusion?\". I'm honestly not going to touch upon anything relating to \"yuri undertones\" besides this sentence and the next because that topic was argued ad nauseum during the show's debut. Although I liked shows like YuruYuri and Yuyushiki quite a bit, those \"undertones\" don't exist in Love Lab despite people's insistence on them being there and it would have brought my rating of the show down quite a fair bit if there actually were strong \"undertones\".\\n\\n\r\nWhile obviously not perfect, Love Lab is easily worth watching if you're looking for something not your run-of-the-mill SoL show. I dislike the arbitrary number system for giving something a rating because there are too many grey areas in evaluating a piece of media that a simple number can't express what makes up that grey area, but I default to the Anthony Fantano rating system: Love Lab gets a strong, beefy 8 out of 10. I'd possibly go so far as to stretch it to a light 9 which I reflect in my own list rating.",
            "date": "2013-09-27T11:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 114433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3112859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gr8stalin",
                "username": "gr8stalin"
            },
            "url": "https://myanimelist.net/reviews.php?id=114433"
        },
        {
            "content": "Love Lab was an anime I pretty much only started watching because it was newly airing and, honestly, I probably wouldn't have bothered with it otherwise, but boy am I glad I did. It's a sweet hidden gem that performed well (despite a few problems I'll address) and is something that everyone should at least give a try, especially fans of \"cute girls doing cute things\" anime, which is exactly what this is.\r\nThis anime starts off, and remains, pretty simple. It gave me some Oniisama e vibes in the first episode, from the intensely shoujo ai vibes of the female cast to the gentle worshipand admiration of some of the students to the light cherry blossoms flowing between sweet girls at a prestigious school. However, this did not turn out to be the plot-filled twists of drama that Oniisama e was and is very much a slice of life comedy from start to finish. It's light hearted and doesn't really need very much commitment if you're after something relaxing.\\n\\n\r\nOur heroines, Maki and Riko, are both the idols of the all girls' schools they attend, Fuji High, although for very different reasons. Maki, the sweet and prim \"Fuji's Princess\", for single handedly running the student council and being utterly perfect in every way, and Riko, the \"Wild One\", whose disregard for uniform policies and paying attention in class catches the attention of the other very well behaved students. When these two idols end up being in the school council together, many people might've expected their personalities to clash. However, they bond immediately over a desire for love and their relationship grows as the school council and the love research it undergoes do too.\\n\\n\r\nThis format worked extremely well. It wasn't entirely plotless, but also never got too complicated. The characters and their gags blended together into a genuinely enjoyable storyline that felt very much like what a slice of life should be - nothing too serious, but also that doesn't just become the same things over and over again. It mostly worked so well because of the characters, who are very much one of this anime's strong points.\\n\\n\r\nThe main five of the student council are really the only ones present often enough to receive things like character development, but all of these girls are extremely likeable and watching them interact is a thing of joy. Their chemistry was through the roof, leading to the inevitable question of \"will this be yuri?\" - a question that they, perhaps deliberately, left mostly unanswered. This does lead me to the anime's main fault though, and that is the introduction of what can only be described as love interests.\\n\\n\r\nPartway through the series, two boys are introduced and both as childhood friends of Riko. Their purpose is rather clear - Satoshi and Jan are there to entice Maki and Riko's development and probably eventually become their boyfriends. However, nothing about this scenario was particularly done well, especially for an audience continuously teased by yuri themes in not just this anime. The situation would've been fine if the boys actually had screentime and development, but they barely ever appear, and only ever to be shown as nothing more than love interests. They're not important to the plot otherwise and, despite adding some comedy, feel slightly obnoxiously and haphazardly flung onto the plot like an afterthought of \"ah, yes, this has to be het!\" that almost all animes resort to in the face of yuri, even though it was yuri the creators themselves put in place via the choice of having the girls constantly blush at each other and swoon over circumstances like Maki's crossdressing.\\n\\n\r\nOverall, the boys mostly just felt pretty disappointing. It was incredibly hard to ship them with girls they spent next to no time with, in comparison with girls that literally spent the entire anime building their relationship together. There was very much a difference here between just ignoring the yuri suggestions and ending the anime ambiguously (as many animes did before them) and trying to tear these themes apart with shabbily lobbed characters. It was a real let-down and almost felt like it undermined the girls' friendships by brushing any suggestion of something more into a raging fire of \"no, you have to ship them with these generic archetype boys we just flung at you\".\\n\\n\r\nHowever, despite these faults, the anime was by no means dragged down to being bad because of it - it really hardly affected my overall opinion at all, despite some disappointment. The art in particular was astoundingly beautiful and the characters had a real charm to them - it was definitely something about their eyes that drew you in. The animation was just consistently fluid throughout and it was incredibly beautiful to both look at and listen to. It was all very light hearted with bright colours, a very fun OP and ED and some good girly voice acting that felt like you were listening to real highschoolers.\\n\\n\r\nIt all lead to what was a very enjoyable anime. I looked forward to watching this every week, even though a highly predominant romance genre is not something I'd ever call my type of anime at all. Maki and Riko, and their genuinely beautiful relationship, were the anime's shining star, and if you enjoy what you see of that in the first few episodes then you should carry on to the end, because it really only gets better. I'd really thoroughly recommend Love Lab to pretty much anyone, whether they're in the for or against yuri boat.",
            "date": "2013-09-28T03:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 114511,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2249247.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/straggy",
                "username": "straggy"
            },
            "url": "https://myanimelist.net/reviews.php?id=114511"
        },
        {
            "content": "To summarize this show quickly, it’s the story about the Student Council at Fujisaki Girls Academy who makes an effort to study love and romance to help themselves find love successfully, as well as advise their fellow student body. Maki the Student Council President is a bit naive and ropes in the edgy wild one, Riko, to advise the girls on what they should do to find love. Hesitant to accept, Riko gets pulled in while lying to all the girls that she has copious amount of boy suitors and her popularity outside of the high school. Luckily for her the girls don’t catch on,and antics ensue with the girls struggling to keep Love Lab a secret from the faculty while also aiding their fellow classmates. The dangers aren’t too serious though, as this show is mostly light and fun, with serious moments being on the back burner for the duration of most of the episodes.\\n\\n\r\nThe Characters\\n\\n\\n\r\nThe show is very good at roping you into the student council as Maki, (the secondary protagonist) has an infectious personality. You sympathize more with Riko, (the main protagonist) as she is a bit more level headed, but you still enjoy the banter between the two of them. They are the two main drivers of the plot, but intermixed is the gentle yet clumsy Suzu, the stubborn but convicted Enomoto and the cunning yet well-intentioned Mizushima. Each character has qualities to like about them, and none of them are people you couldn’t consider yourself getting along with. They’re probably too perfect but that’s ok. The show is pretty idealized and not too serious so it’s ok that the characters are idealized as well. I give this aspect of the show a 7.5 out of 10 as the characters although not riddled with too many flaws for a dynamic show, are still likeable and feel very real as people, especially when interacting together.\\n\\n\r\nThe Story\\n\\n\r\nAs summarized earlier, the story is pretty simple. It’s mostly about young girls having fun, and it accomplishes that fun aspect very well. It attempts to bring in conflicts if you can call it that, but it doesn’t surprise the audience as we know of course things will be resolved in no time. Although this makes it pretty predictable, we shouldn’t expect a show directed towards a younger demographic to do much beyond that. At least the conflicts are interesting and explore new ideas that young girls have to face. Contrasting that is the funny moments in the show which were executed perfectly. I was laughing along with them, and the comedy succeeds because of the strength they accomplish with developing the characters. We learn to like every character because it delves into each characters’ back story, even if just for a little bit. Getting to know what to expect from each character makes the comedy that much funnier as we see the dynamics between the girls play out with their contrasting personalities. And that’s all and good, but the question is, and I mean obviously it would be on your mind since this show is called Love Lab, how’s the romance? And I would answer you… underdeveloped. The show pushes forward friendship first, with love much farther on the list. This short season just gives you a taste for all that Love Lab has to offer, so anyone wanting more from it has to turn to the manga. So with all those elements put together I give the story a 7.0 out of 10. Its comedy is bang on, but it lacks in most other regards to make it shy of a higher score. But for young girls, this show is a must see for sure. For women my age however? (I’m 22) It’s more a nostalgic revisit to the easy times when you were first learning about love.\\n\\n\r\nThe Message\\n\\n\r\nNow, one thing I did not expect from a shoujo comedy series was just how deep this show got at times (Refer to image above from episode 9, it’s an artistic metaphor). There were a lot of moments where I thought damn, these girls are really just amazing people, they try to be nice to everyone and help each other grow and mature in a constructive way. This isn’t one of those mean girls episodics, the girls learn from each other in a positive way. And as I mentioned before, there’s never any real dangers because the girls are such a together group, and their hard work pays off for them. The show demonstrates what real friendship is, that what it takes to be a good person isn’t always easy, and that being confident in yourself will gravitate others towards you. Just a lot of fuzzy nice messages that are often overlooked in animes, especially those geared towards a younger audience. The message of this show is what kept me watching, because easily a young adult woman would have nothing to relate to this show otherwise. If you’re curious and you’re a little older, maybe give this title a try, if not for this reason. I give the message a 9.0 out of 10. For obvious reasons mentioned above, it made the show stand out this season.\\n\\n\r\nThe Verdict\\n\\n\r\nThis show is complex for the overthinker and simple for those just looking for a sweet laugh. But did I enjoy it? Yes! I’m not eager to admit that I liked a fluffy shoujo anime but I believe it accomplished a little more than most shoujos tend to. It was pleasant returning week after week to watch the latest episode as it was continually giving a new experience instead of boring me.  Although it ended just as new ideas were developing, it’s only 13 episodes long and I intend to look into the manga to get my Love Lab fix. Compiling my score it gets a solid 7.8 out of 10. Not perfect, but probably a bit more perfect for young girls, especially those in their tweens to early teens. \\n\\n\r\nChristina\\n\\n\r\nvia modernjosei.tumblr.com",
            "date": "2013-10-02T11:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 115099,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3212647.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/modernjosei",
                "username": "modernjosei"
            },
            "url": "https://myanimelist.net/reviews.php?id=115099"
        },
        {
            "content": "I picked up Love Lab while looking for a new shoujo ai-themed show to watch. I was pleasantly surprised by it, despite the lack of actual shoujo ai. There is some borderline subtext if you squint, but the show largely encompasses friendship, everyday life and some basic lessons of life (i.e. don't lie).  \r\nStory: 7/10\r\nThere's not much of a plot in Love Lab, as you might expect, following the day-to-day lives of a bunch of highschool girls. But there is a point to the story, even if it's something as simple as having good morals. Of course I've seen more done in 13 episodesthan was done with LL but I enjoyed it for the fact that it was short, to the point, and not one moment of it was boring. In fact I can't remember the last time I finished a series faster.\\n\\n\r\nArt: 6/10\\n\r\nI'm usually not a fan of moeblob-type designs but the hilarious facial expressions and the beautiful background imagery of LL was enough for me. The colours are subtle and pastel-ish but lovely all the same. \\n\\n\r\nSound: 6/10\\n\r\nI wasn't a fan of the OP or the ED and the BGM was nothing memorable, but I've definitely heard worse. The soundtrack for LL isn't the strongest. \\n\\n\r\nCharacter: 8/10\\n\r\nAll of the characters are a refreshing take on the shoujo/slice of life genre. Even though some do live up to the stereotypes that their designs are known for (i.e. Suzu being a shy klutz, Natsuo being the \"princess\" of Fuji-girls and rich etc), every single one of them has flaws, as well as things that make them memorable. Riko is the most entertaining of the bunch and definitely my favourite overall apart from Enomoto, whose tsundere-ness is an ongoing gag. There was only one or two characters I wasn't fond of by the end of the show. \\n\\n\r\nEnjoyment: 8/10\\n\r\nI blitzed this series in a matter of days because of how much I liked it. LL is a light-hearted show that provides a nice change of pace for someone like myself, who typically prefers anime with dark themes. \\n\\n\r\nOverall: 7/10\\n\r\nLL may never be hugely popular, but it does stand out as one of the few shoujo shows that has something different about it. I initially was wary of watching it due to the nature of the artwork and the way it presented from the synopsis, as the whole love research thing sounded ridiculous, but it works so well.",
            "date": "2013-11-01T22:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 119023,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/68040.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/halfthewords",
                "username": "halfthewords"
            },
            "url": "https://myanimelist.net/reviews.php?id=119023"
        },
        {
            "content": "Love Lab,as seen in the preview,is about a group of middle school girls as they try to prepare themselves to eventually fall in love.\r\nStory:\r\nThe series has a very good start,it is very neatly paced.Nowhere will we feel that  it is progressing at a fast or a slow rate.Riko is mistaken to be an expert in matters of love and she has to maintain that facade due to her rather proud nature.This seemed interesting,but the later episodes brought this up too much for the shows good.After some point,it all does not ring true,and we are not that interested anymore as to how this issue willbe resolved.Many characters are not given much screen time and they seem underdeveloped.If there is a season 2 planned,this may be rectified in it,but as this series stands now,it is quite weak.\\n\\n\r\nArt:\\n\r\nI won't dwell much on this but it quite good,one of the best characters of this anime,in fact.\\n\\n\r\nSound:\\n\r\nNothing memorable,but it works.\\n\\n\r\nCharacters:\\n\r\nEven though it feels as though we have seen all the characters somewhere before in other anime's,the interactions between them are quite refreshing at times,so much that the fact that they seem cliche does not seem a bother.Some characters were not adequately developed,and i hope a 2nd season will address this issue.\\n\\n\r\nEnjoyment:\\n\r\nI really enjoyed the first half of the anime,but for some reason,the second half was not as enjoyable.The jokes just do not seem as funny.The main reason i rated this a 6 was the ending.I was disappointed in it.I expected so much more.Maki's character lost it's freshness for me around the middle of the series.Only sayo seemed interesting as the story progressed,and to a lesser extent,yuiko.\\n\\n\r\nAs for my final verdict,this is quite good,just does not have the 'something special' to elevate it to higher position compared to other high school comedies. \\n",
            "date": "2014-05-15T11:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 143375,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3644167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Maggot_Brain",
                "username": "Maggot_Brain"
            },
            "url": "https://myanimelist.net/reviews.php?id=143375"
        },
        {
            "content": "This is a feel good anime and a good one at that. It starts out pretty dull and generic but then turns really emotionall and funny throughout the entire thing. The characters have flaws and can make misstakes and will do misstakes, this is something that i like and that Love Lab does extremly well. I would recommend this to anyone as it's extremly fun and weird but can still be emotionall when it needs to be. This quickly became one of my favorites. Some might not like the artstyle but this is something that you'll quickly look past if you start to watch it.If you like anime in generall this is a anime which you mustn't miss out on.",
            "date": "2015-11-09T07:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 203047,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LaughingElk",
                "username": "LaughingElk"
            },
            "url": "https://myanimelist.net/reviews.php?id=203047"
        }
    ],
    [
        {
            "content": "If school life, plotless, \"cute girls doing cute things\" moeblob isn't your thing, you're in luck: this isn't any of that. Despite the schoolgirls being in school doing school-like things (like being on their absurdly powerful student council), this is not a 4-panel gag comic brought to life in a series of episodic moments. Rather, it's a coherent, consistent, and compelling story, told in thirteen chapters, each delivering the perfect mix of both comedy, and a touching story of the progression of an unlikely friendship between two very different girls, and the strange cast of characters that surround them. \r\nAnd ultimately it is the charactersthat I always remember and go back to look at again and again, as they are so very interesting, charming, funny, and beautiful, in their own very flawed and hilarious ways. While it has a consistent, forward-moving plot, it is really the characters that move the story along, and in the process, make themselves relatable and memorable. \\n\\n\r\nLove Lab really is unlike any other anime I've seen; certainly unlike any other school life romance or comedy. That unique quality it has, that I can't quite place, is what  keeps drawing me in for multiple viewings since it first aired; this is the only anime title I've watched in its entirety multiple times, and the only one I feel unashamed to give a full \"Masterpiece\" rating to without qualification or reservation.\\n",
            "date": "2017-07-29T23:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 254201,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1780327.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tcfenstermaker",
                "username": "tcfenstermaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=254201"
        },
        {
            "content": "This was a great show full of girl power and comedy. Maki's squealing always got me; so hilarious. The show is full of peculiar girls with great humor. If you like unconventional and funny then you should watch this. It was a breath of fresh air. Made me want to go bond with my gfs more. Enjoy the show! I know I did.\r\nThis was a great show full of girl power and comedy. Maki's squealing always got me; so hilarious. The show is full of peculiar girls with great humor. If you like unconventional and funny then you should watch this. It was a breathof fresh air. Made me want to go bond with my gfs more. Enjoy the show! I know I did.",
            "date": "2016-09-09T22:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 228675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4744957.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Psstboo",
                "username": "Psstboo"
            },
            "url": "https://myanimelist.net/reviews.php?id=228675"
        },
        {
            "content": "Many times I've tried the crunchyroll random button, and the fourth time I got Love Lab, another comedy about a group of... amusing middle school girls. While YuruYuri is more of a slice of life show Love Lab is more of a raunchy comedy. I don't want to use a synopsis because of the spoiler but it is funny and worth the watch. And that's coming from someone who generally doesn't seek out shows like this. It’s hard to review a comedy because humor is subjective; just because I laughed throughout doesn’t mean everyone else will. Some may find Riko unlikable. some may find thiswholly inappropriate behavior for middle school girls. Some may dismiss it as moe trash. I’d say those people are overthinking it with this series. It’s funny and raunchy without being pretentious and preachy. \\n",
            "date": "2017-05-02T13:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 246836,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=246836"
        },
        {
            "content": "Story: 4/10\r\nThere's not really much of a story, since this anime is more like a slice of life than anything. Yea, there's romance, but nothing really develops this season (assuming there's going to be a second) so there's not really any romantic scenes. That said, I wasn't really expecting there to be any amazing plot, so it's fine on my part.\r\nArt: 7/10\r\nArt styles are up to preference. I personally liked it, but it's not like top of the line art style with fancy colors, it's just a sort of standard girly and colorful art style like most animes with main girl casts are nowadays. Agood art style, in my opinion, would be something like Gochuumon wa Usagi Desu ka ?\\n\\n\r\nSound: 9/10\\n\r\nNot exactly sure what's meant by this, but I guess all the voice actors fit well. All the characters had a different tone so it's easy to recognize them.\\n\\n\r\nCharacter: 8/10\\n\r\nIn terms of characters, they don't bring anything new to the table. One's a tomboy, one's a girly girl, one's a shy glasses girl, another a tsundere (with red hair to match up too!), and the last one is a girl that is.. Idk, how to describe but kinda like she knows everything lol. If you've watched Working!! then she's basically Souma. They all have their own little traits of course, nothing new. But I liked the characters and each of them brought a different aspect to the anime. They're all different too.\\n\\n\r\nEnjoyment: 10/10\\n\r\nOmg, I loved this anime so much. I literally laughed out loud every episode! This is like my ideal comedy anime. I'm not gonna call this a rom-com cuz it's barely, but it's not yuri so .-. But I really loved the comedy in this anime and it cracks me up every time xD The anime really did a great job of making you stay on your toes and giggle every 5 minutes\\n\\n\r\nOverall: 9/10\\n\r\nOverall, this is a really unique anime concept that has never really been done before. That said, not much story to it and the characters still stand to some of the basic traits of all girls in anime, but I enjoyed this one a lot. Not only was it really fun to watch, but it was a really hilarious anime, probably haven't laughed this much from one anime ever, so that's a definite plus!",
            "date": "2017-01-12T04:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 238111,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AlexanderA646",
                "username": "AlexanderA646"
            },
            "url": "https://myanimelist.net/reviews.php?id=238111"
        },
        {
            "content": "Love Lab\r\nArt\r\nI really liked the art of this show. It didn’t really impose on itself too much and even though they were in the same uniforms a lot of the time, the change in hairstyles for the main character was actually a nice touch. This comes into play in the story, but that’s beside the point. I felt that while there were a few things that I would have liked to see changed when they were introduced, they were actually things used by the story to get a laughable moment. This really was a pleasant show to look at and at no point did ifeel like I would stop watching because of the art.\\n\\n\r\nSound/Music\\n\r\nThe music in the show itself was sub-par. This is really where the show fell short for me. The music really wasn’t anything spectacular and I found myself being more interested in the story than the music itself. On the sound part of this, things did a little bit better. There was a good balance of comic relief moments as well was soft music to help set the mood for a more dramatic scene (what few there where). Truly the sound direction really could have done a lot more and been a lot better, but due to the content of the show itself, I can understand why this might have been put on the back burner.\\n\\n\r\nStory\\n\r\nWe meet Riko, deemed the “Wild Kid” by her classmates at an all-female middle school. When she goes to check on something from the student council she finds the Student Council President, Maki, Kissing a body pillow with a crudely drawn boy on it. Understandably in shock she tries to get away, but then Maki begins to cry and thinks that her secret is out, in an effort to help her get better at romance, and stop her from kissing a pillow, she agrees to help her conduct “love labs” to get better at romance. However two things seem to be standing in Riko’s way: The fact that romantic relationships are forbidden by their school, and Riko has never had any experience herself! Maki assumes she is popular and has had a lot of boyfriends and Riko can’t bring herself to tell the truth. The story picks up from there with the inclusion of a cast of characters that each are unique (albeit Cliché) and fun to watch grow together.\\n\\n\r\nPersonal Reflection\\n\r\nThe first episode Thumbnail was a little weird and I wasn’t quite sure what to expect. But after the crazy antics and one laugh after another, I was hooked. I found that even though the characters were a little generic and the sound wasn’t amazing, the show had a charm that I really enjoyed. There was one part that I was a little weirded out by, which was a scene that had the characters in black face; that should have been avoided.  Over the course of the show, there was a change in tone and it became less about the Love Labs and more about the friendships between the characters. I have seen this kind of shift happen before, but it never felt quite this smooth and natural. While the end slate left it open to a sequel series I am happy that it ended when it did. Love Lab is a perfect example of how a goofy comedy and slice of life show can have real heart and turn into a show that feels genuine. When the silence hung in the air during the last episode, I found myself holding my breath, waiting for what was to come next, and I hope you do too.\\n\\n\r\nOverall Rating: 7/10\\n",
            "date": "2016-07-09T10:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 223569,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4688864.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chiburo",
                "username": "Chiburo"
            },
            "url": "https://myanimelist.net/reviews.php?id=223569"
        },
        {
            "content": "So basically this anime is about girls trying to come up with techiques to fall in love. All the side girls believe the main girl's lie about being a romantic expert. She does feel bad about the lie though. What makes this anime funny is all the crazy and wacky stuff the girls do to try and get men. All the characters are funny and weird in their own way. Now this is labeled romance but it's more of a friendship anime and the topic is love. All the girls become close friends while pursuing love.  This is more of a girly anime withnot much ecchi at all. But the girls being naive about men and their ''innocent schoolgirl'' image are just too cute. The anime can be heart warming but its mostly good for laughs and cuteness. I say its great for girls but men can watch it too since it's damn funny.",
            "date": "2016-06-16T11:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 220879,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4600871.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yoshihiro56",
                "username": "yoshihiro56"
            },
            "url": "https://myanimelist.net/reviews.php?id=220879"
        },
        {
            "content": "***Spoiler free review***\r\nLove Lab is one of those many (and when I say many I really mean millions) cutesy girl anime that revolve around a school setting. Furthermore it takes place at an all girl’s high school where everyone is petrified to even be near a man thus bringing us to Love Lab quirky but somewhat plausible premise. It is a flawed show...but I still love it.\r\nStory: 4/10\r\nI found the premise of the show extremely superficial since I find it hardly believable that these girls would have almost no experience even being around boys. Basically these girls start up a “Love Lab” as a partof the student council. They would take questions on love (which they have no clue about) from students that asked and somehow answer them. This however was easy to look past (for me at least) since the characters were really the stars of the show. You can draw comparisons to K-On in this setting; you didn’t watch K-On for the music aspect of the show but rather the character interactions. The same applies here as if you are seriously watching this show for the plot then you have very low standards.\\n\\n\r\nAnimation: 6/10\\n\\n\r\nThis just may be my weirdness but I swear at one point in the show the animation quality dropped down. I feel as if things like how the character’s hair flowed or the clarity of background objects just suddenly lost effort. Regardless the show sports some okish visuals. Each character is very appealing to look at (eyes yum) but other than that I feel as if everything else was just passable.\\n\\n\r\nSound: 4.5/10\\n\\n\r\nNothing really stood out here. Some ok tunes but I didn’t find anything over the top. Didn’t like the OP or ending stuff either.\\n\\n\r\nCharacters: 8/10\\n\\n\r\nI LOVED all the characters except the annoying vice president Maki. Other than her, all the other characters really flowed well with each other and brought some sort of enjoyment to what was going on. My personal favorite was Enomoto since she eventually starts to open up to the club and provide some helpfulness.\\n\\n\r\nOverall: 5.6/10\\n\\n\r\nOverall the show was pretty bland but I did end up enjoying it. Loved the character interactions and there were some moments of awesomeness on the animation front (though VERY limited). I would recommend this anime as one of those rainy day type stuff you watch when there is literally nothing left.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-05-15T22:01:00+00:00",
            "helpful_count": 0,
            "mal_id": 247789,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247789"
        }
    ]
]