[
    [
        {
            "content": "After finishing \"Gugure! Kokkuri-san\" I had to think to myself: What makes an anime good?  Is it the person's expectations going in?  Because I came for the comedy and at no point throughout the entirety of the show was I ever disappointed.  In fact, comedy is the only thing that this show even makes an attempt at, and boy does it do it well (although there is a recurring message in the show if you can pick it out).  I'll try my best to tell you my thoughts on the show, and if you hate the very core of my beingafter this review than I'm sure we can talk it out like civilized people.\\n\\n\r\nCharacters- The show has a diverse and hilarious cast to ensure that you will laughing at, at least 1 of the 5 gags/jokes this show throws at you per minute. 8/10\\n\\n\r\nI'm starting with characters because to be honest... If you don't like the characters you will not enjoy the show.  Kokkuri himself is portrayed as an attractive spirit struggling with a mid-life crisis due to him fearing for his relevance in the the modern world.  Although he's a man he has many intricacies that one would normally associate with women.  This takes form (literally) later on in the show.  Now Kohina can be a really hit or miss character with some people.  Her design is extremely deformed in comparison to all of the other characters (which turns a lot of people off), but anyone who is familiar with \"Oyasumi Punpun\" should have at least some idea of whats really going on there.  She is the center of all insanity that happens in each episode.   Shigaraki was probably my favorite character although he started out as my least favorite.  Another spirit who often brings misfortune to others, but despite this he is a true romantic.  Inugami is yandere dog who died from neglect but was reincarnated into the world as a spirit.  He/she gender swaps often due forgetting his/her gender in the previous life.  Characters interactions were entertaining throughout.\\n\\n\r\nSound/art- My roommate walked in on me dancing to the opening and said \"wtf are you doing bro.\" 10/10 \\n\\n\r\nThe opening is cleverly done, full of personality, and of course catchy as hell.  The ending is good as well, and the shows OST is funny sounding... in the best way possible.  As for the art I'd say its completely average.  I mean sure it has a certain style to it, but in comparison to many other shows released this year there really is nothing notable about it.\\n\\n\r\nStory- Its serves its purpose as being the catalyst for the numerous gags, jokes, and satirical content this show offers. 6/10\\n\\n\r\nFrom the first 2 episodes you will know whether this show is for you or not.  The series seems to enjoy taunting its viewers with scenarios that in many other shows would be clear indicators of: DRAMA INCOMING! only to slap you along with your expectations across the face.  This happens a lot.  But its FUNNY EVERY TIME.  Although I'd be lying if I said I didn't want to see some drama play out.  Either way the synopsis pretty much says it all, and the way the story presents itself is favorable.\\n\\n\r\nConclusion- If you want some laughs look no further! This is your show!  If you want anything else... Its a questionable endeavor.  I gave it a great 8 because not many shows can make me laugh as much as this one did.\\n\\n\r\nShould Watch:\\n\r\n-If Satire/parody is your thing, because this show has every western/Japanese pop culture gag you can think of.\\n\r\n-Had a rough day? Just sit back and laugh it off!\\n\r\n-Fun Characters that will grow on you.\\n\\n\r\nShould avoid:\\n\r\n-If you want some sort of meaningful romance/drama.\\n\r\n-Some gags get repetitive\\n\\n\\n\\n\\n",
            "date": "2014-12-21T06:46:00+00:00",
            "helpful_count": 117,
            "mal_id": 173441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3194647.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GoS1234",
                "username": "GoS1234"
            },
            "url": "https://myanimelist.net/reviews.php?id=173441"
        },
        {
            "content": "Gugure Kokkuri-San has come to an end. Another ending which make me feel ugh, what to watch again. Honestly this is the funniest anime to watch in 2014. This reminds me of barakemon and Gekkan Shoujo Nozaki Kun, those two anime shows were really great. I really like the voice actors typically Daisuke Ono, who voice of course Kokkuri and Sensei from Barakemon.\r\nSo here are my results:\r\nStory: 8/10, I thought it might follow the plot story like Inugami running away from home and thought he will be search by the members on EP 10, but well he is completely ignored. Funny, it may contain mixup plots since it' published in Manga, so yeah.but still it's good to watch\\n\\n\r\nArt: 8/10, I have no comments on this, but good job on Kokkuri-San especially when she's a girl. \\n\\n\r\nSound:9/10, The OP song was really catchy, I couldn't bear to skip it. The ED song to was really touching, that feel, you know.\\n\\n\r\nCharacter: 8/10, They are okay, I can say but what I wish is to see Kohina real emotions but nahh, she rather be a doll and eating cup noodles, I respect that, cause i eat cup noodles too\\n\\n\r\nLastly enjoyment : 10/10, I say this is really a good anime to watch though it has mix plots and weird stuffs, but it's a good time to watch after doing some stressing works, yeah.\\n\\n\r\nOverall: 9/10\\n\\n\\n\r\nThis was a good anime to watch and I rank 2nd after Amagi brilliant park for this. \\n\r\nI totally RECOMMEND all of you to watch this anime, not Amagi of course.\\n\\n\\n\r\nI hear there's a special 5mins episode for this, hope it will be funnier!\\n\\n\r\nAnd hopefully there will be 2nd season, IF.\\n\\n\r\nThanks! Peace",
            "date": "2014-12-25T10:57:00+00:00",
            "helpful_count": 43,
            "mal_id": 174255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=174255"
        },
        {
            "content": "Amusing, funny, and full of heartwarming moments, Gugure! Kokkuri-San managed to captivate me with it's unique charm and cast of characters.\r\nThere were too many things I liked about this show so I'll try and keep it short and sweet, just like Kohina.\r\nPerhaps the best thing I loved most was the characters. Ordinarily, I like unique Anime shows, that offer a large to Medium variety of characters. However, Gugure! Kokkuri-San has such a small amount of characters and I just loved them. The characters of the show are obviously from Japanese mythology and games. These spirits that are supposed to be terrifying all have such thepersonalities and characteristic traits given to them that were just so hilarious. Their jokes, slapstick, relationships (how they got along)  and gags were something that I really enjoyed seeing.\\n\\n\r\nThe story is there, however it is more like you're just watching the daily lives of a little girl who thinks she's a doll interact and live with 3 spirits. One thing that bothered me just a little was that there was no real backstory. Kokkuri mentions a few times during the show about how he's been aware and has seen Kohina in the past before being summoned to her, however nothing else is explained. Which really makes me question what was the point of adding that into the show if there wasn't going to be any explanation.\\n\\n\r\nThe artwork and character designs done for the show were varied in my opinion. Some were good some were bad, other moments I just didn't care too much. \\n\\n\r\nThe soundtrack isn't that bad either, the opening song can be a bit of an ear-worm at times, and the ending song was pretty decent, I liked how the characters would change every few episodes.\\n\\n\r\nMy final thoughts are that I would highly recommend this show to anyone, especially if you just want to laugh and be entertained without having to think too much.\\n\\n\r\nOverall rating is 8/10 for being a very good and refreshing comedy while representing the unique side of anime. Lastly, Gugure! Kokkuri-San did a pretty damn good job at adding a unique spin and take on Japanese Mythology.",
            "date": "2016-02-12T17:17:00+00:00",
            "helpful_count": 37,
            "mal_id": 210762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=210762"
        },
        {
            "content": "Gugure! Kokkuri-san is a 'good' anime where the term 'good' surely requires a lot of explanation. For while I enjoyed it to some extent, I won't be extremely eager to recommend it to someone else. Let me explain. Unlike some animes that might not mess up in various ways but their positives are not so appealing either to get them a 9 or 10, Kokkuri san has both positives and negatives.\r\nPlot wise, there isn't much except the appearance of the different ghostly characters in the anime and how interact with Kohina - the protagonist of sorts around which the entire story revolves. Thus it isan episodic anime, other than the characters popping at intervals, there is no bigger plot. And honestly the plot here doesn't matter as much as the characters and the entertainment they give. However there are certain themes tackled in separate episodes that are well developed and rather appealing to watch. They can be given credit.\\n\\n\r\nThe art is good - the scenery's are nice, colorful, the anime gives off a happy vibe to it and most of the characters are also drawn well. And the music was good - it was complimenting, setting the mood and over all I was fond of it.\\n\\n\r\nThe real critique starts here: As with episodic animes, the entire anime boils down to the enjoyment. Did you enjoy it? Did the previous episode make you want to watch the next? And the entertainment in such episodes depends greatly on the characters. How did THEY tackle the episode. It isn't a matter of plot - they could be going to a theme park or beach, or cleaning the house, but how they manage to execute it - and since this is a comedy anime, how many laughs did we get out of it.\\n\\n\r\nKeeping in mind those criteria, the two characters that are introduced since the start of the anime (and I consider those two as the 'main' characters since one is Kohina - the girl around which the anime revolves and the other is the one after whom the anime is named), Kokkuri-san and Kohina are first to be discussed. And these two strike off very well together.\\n\\n\r\nKohina - a girl self believing she is a doll who goes off with philosophical monologues that even depress the aged spirit and the aged spirit (that doesn't look aged) that despite craving to be feared finds the unstable state of Kohina too pitiful to leave her alone. She depresses him, he gets over it, she eats cup noodles, he disposes off them. She and he... they just develop a chemistry that compliment each other very well. Her retorts and his retorts work well with giving the viewer good, light, family comedy.\\n\\n\r\nHowever when the rest of the spirits start pouring in, the anime turned from very good to mediocre. The characters are also in one way or the other attached to Kohina (except Shigaraki who is just there for fun - but he too is perverted) but their attachment is forced. Now that in itself doesn't seem like a bad trait, the show is comedy, there is no reason to stick to extremely believable progression as long as we get comedy right? But that is where the show loses appeal. The punch lines/events associated with the other characters all seem forced in contract to Kokkuri-san and they just don't hit the nail. And you see them trying to be funny but they just can't get it right mot of the time. At times, yea - they manage to get a comical flurry - but rarely. Furthermore, they made the rest of the characters way too 1-Dimensional to like. Yes, Kokkuri-san is no Kurono from Gantz either - he isn't the best example of a 3-D char but his traits shown are not excessively questionable - or you don't find the reason to question them. For the rest of the characters, they just seemed like medicore fillers in a decent anime.\\n\\n\r\nAnd when the fillers are there for more than half of the anime - it gets boring. True, there are certain comical moments combining all the chars but the expectations given by the duo in the start did leave me a little disappointed till the end.\\n\\n\r\nSo, if you are looking for a decent, light comedy anime that you can watch with someone who doesn't have a very specific taste, then it is a good choice. However, if you are looking for a really good attempt at comedy that definitely delivers epic fun, then sorry - it has its moments, but I won't recommend it to you on those basis. \\n\\n\r\nThank you reading and whether you agree or not, I am glad to discuss so any constructive feedback or discussion is welcome!",
            "date": "2015-03-31T08:16:00+00:00",
            "helpful_count": 35,
            "mal_id": 184238,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3229339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NotenSMSK",
                "username": "NotenSMSK"
            },
            "url": "https://myanimelist.net/reviews.php?id=184238"
        },
        {
            "content": "I wasn't sure what to expect starting this show. But am I ever glad I did start this show. \r\nSTORY:\r\nFirst thing's first: if you're looking for a deep story that will make you rethink your life, you've come to the wrong place. However, the story is very cute, and hilarious. I rarely laugh at shows, and with this one I found myself laughing at almost every episode, I thoughly enjoyed this show. And while it may not be the deepest story out there, or even very moving, it does have it's sweet moments that are lovely in their own respect. \r\nNot great plot-wise, but stillamazing.\\n\\n\r\nART:\\n\r\nFor the most part the art is great. It's cute and really helps with the humor of the show. There are some scenes where some of the characters have more realistic features, and those moments threw me off, but it's definitely nothing to not watch the show over. Overal the animation is amazingly cute and helps with the humor of the show in amazing ways.\\n\\n\r\nSOUND:\\n\r\nThe soundtrack, as one might expect for such a humourus show is very playful and super fun to listen to. While it may not be a soundtrack that you'd listen to outside of the show, it definitely is one that helps with story telling and mood-making and is definitely a big plus for this show. (The theme song has been stuck in my head since I started watching it too, haha)\\n\\n\r\nCHARATER:\\n\r\nThis is where the show really shines. While all of the characters may be very very VERY stereotypical, they are also all very loveable, and it's the character interactions that is what makes this show so great. Even characters like Inugami, who I absolutely hated at first, by the end I loved so much simply because, while they may be very flat characters, they are very enjoyable, and will make you laugh.\\n\\n\r\nOVERALL:\\n\r\nThis show is a form of pure comedy, and if you're not into comedy, you're probably better off elsewhere. However, that being said, it does what it does VERY well, and if you're ever looking for a good laugh I would HIGHLY recommend this show. It's not a show that does it all, but it does what it does very very well. If you're ever in need of cheering up, or just want a good laugh, Gugure! Kokkuri-san is a show that is very worth your time.",
            "date": "2015-02-18T17:20:00+00:00",
            "helpful_count": 20,
            "mal_id": 180756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4299141.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/swirrlix",
                "username": "swirrlix"
            },
            "url": "https://myanimelist.net/reviews.php?id=180756"
        },
        {
            "content": "Gugure! Kokkuri-san follows the episodic adventures of various Japanese supernatural creatures and Kohina, a self-proclaimed 'doll'. As the events are disjointed scenarios from episode to episode, the show relies wholly on it's comedy to gain viewship--however, this comedy is not at all top notch for being the one savior of the program.\r\nNone of the different endeavors of the characters from episode to episode are new, or presented in a refreshing way. A girl summons a ghost because she is lonely, and said ghost becomes her substitute mom, as, for some reason, those in charge of Gugure! felt the need to throw in angst in anotherwise comedic plot. While there are moments where the emotion and relationships between the characters shine through, it's all a bit disjointed. \\n\r\nAdditionally, for a comedy, many of the jokes fall quite flat. There were times earlier one when I genuinely got a good laugh out of an episode, but that was back in the character introduction stages very early on. As Gugure! pushed to provide more of an emotional message of family or togetherness or what have you, getting laughs became second priority though that was the anime's strength.\\n\r\nIn the end, Gugure! goes out not with a bang, but with a fizzle, retelling the age old 'friends are forever' cliche to close out episode twelve. Nothing new, memorable or humorous here.\\n\\n\r\nA lot of the anime's best humor may lie in it's visual gags; when Gugure! is trying to be funny, the art is very on point. Images of Kohina's eyes coming off like stickers and the tanuki morphing into a grown man in Kohina's clothes come to mind.\\n\r\nOtherwise, for an anime at the end of 2014, I was not exactly impressed--not to say there were crossed eyes and miniature misshapen limbs all over the place, but the animation was nothing progressive.\\n\\n\r\nSound was what is expected from a sort of parody/comedy anime like this one, and there is nothing really worth mentioning here as well. \\n\\n\r\nCharacters, even the main ones, were very one note, which is something common but still depressing to see. Once introduced, most of the material coming from each personality was very predictable, and thus short lived. At times, it was almost as if the characters themselves were forcing out the laughter, and I could almost here the Kokkuri-san himself losing his voice over all the yelling that defined his nagging personality type. It all seemed a bit forced at times, and relaxed in others, creating an uncomfortable uneveness.\\n\r\nAs is the case with tropes, the possibility of finding a favorite character is there. Unfortunately, throughout the course of the show I did find my favorite, and pitied them, a side character, more than Kohina, whose loneliness kept getting shoved in my face for plot reasons. Sorry Kohina, your  monotone loner act makes you too flat and static for my liking.\\n\\n\r\nEnjoyment decreased over time, sloping downward during the process of the jokes getting stale. This particular series may be better to viewers who are not already well immersed in anime, but know that there are also many references to Japanese culture that go unexplained and may deter a newer fan. \\n\r\nWikipedia if you will, laugh stiffly if you will--I will mostly like smoothly move on from a supernatural comedy that is, in the end, a bit bland.",
            "date": "2014-12-21T16:22:00+00:00",
            "helpful_count": 14,
            "mal_id": 173505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3863993.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MangakaNotlora",
                "username": "MangakaNotlora"
            },
            "url": "https://myanimelist.net/reviews.php?id=173505"
        },
        {
            "content": "Gugure Kokkuri-San is a very cute anime and I enjoyed it. This is a great show to watch on the weekend when you have not much else to do. The idea is interesting and the show is high up there on my favourites.\r\nStory: 6 It's not too special because there's nothing to be achieved or done. The first half of the show was very entertaining, but later on I became bored. The comedy aspect helps the show deliver a story and keep you content.\r\nArt: 10 The art style is great, not much else to say. \r\nCharacter: 10 Each character has their own powerful personality uniqueto him or her. The character designs suits each character well.\\n\\n\r\nEnjoyment: 7 The element this show plays on most is comedy and it excells at that. I didn't enjoy it as much on the second half, but I was content. Character communication is very entertaining. I wish some characters showed up more often however.\\n\\n\r\nOverall: 7 A show I am glad that I watched.",
            "date": "2015-03-04T15:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 181701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3636011.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ninjakato-San",
                "username": "Ninjakato-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=181701"
        },
        {
            "content": "(may contain minor spoilers)\r\nI don’t usually write reviews and I’m not, by any means, an “expert” in anime but about this one I really felt the need to write one so here we are.\r\n“Gugure! Kokkuri-san” is a sort of slice-of-life comedy with supernatural involved. Now, after knowing this and reading the synopsis above we may somewhat expect what the anime is going to be about.\r\nEven though I said I’m no expert in anime (and I’m definitely not), as an avid fan of comedies I’ve watched quite a lot of them and I end up having the need to talk about them. Now, in my opinionthere are many great comedy animes out there that are not as high rated as this one currently is. Could it be because it actually was not all that well executed? They had a special kind of humour directed to a specific audience? Whatever may be the reason, comparing some of them to this one I found myself askig 'Does Gugure! Kokkuri-san' deserve all the praise it is getting?” In my honest opinion, it doesn’t really. Let’s separate the review by parts then.\\n\\n\r\nStory:\\n\r\nKohina is a girl who says she’s a doll and that one day ended up summoning Kokkuri-san After that a bunch of characters are introduced and they started living together in Kohina’s house. There isn’t exactly a “serious” plot but I that’s normal from a slice-of-life. All in all it had small subplots here and there that worked alright. Not much to say here. Hopefully I'm not forgetting anything important.\\n\r\nStory gets an 6/10. With the variety of characters it could have done much better.\\n\\n\r\nArt/Animation:\\n\r\nThe art is fine, nothing too special nor new. Kokkuri-san looks like a copy of Tomoe from “Kamisama Hajimemashita” but I’m not going to complain about that. The animation was ok for most of the anime as well, I dind’t notice a moment where it got worse.\\n\r\nArt gets an 7/10 for it could be much better and fresh.\\n\\n\r\nSound:\\n\r\nOh, the opening song is quite catchy and the ending is good as well, very relaxing to listen to. The voice actors did a good job on their roles as well and made this anime much better. Nothing much to say about the BGM, it was ok for most of the times.\\n\r\nSound gets an 9/10\\n\\n\r\nCharacter:\\n\r\nWell, if this anime isn’t following a specific plot then the characters have to be the ones to carry the anime. We have quite a few here altough the only ones who stand out more are definitely Kohina and Kokkuri-san with Inugami coming 3rd place here. There’s no explanation about the backstory of most of them and the most developed character is probably Kokkuri-san as he adapts to his life with Kohina and company.\\n\r\nCharacters get a 7/10\\n\\n\r\nEnjoyement:\\n\r\nNow here comes one that is really important for my ratings. I have to say I had great expectations for this anime after the 1st and 2nd episodes. They felt new and refreshing and the jokes were well played during those first episodes but after these I felt my enjoyement dropping. Maybe it was because I wasn’t feeling like watching it at the time? I don’t know but I ended up disappointed with the way the anime went as it didn’t seem to want to go anywhere precisely. New characters appeared just for 1 or 2 episodes and then were forgotten and I didn’t find the jokes as funny as before, they felt repetitive and forced and that’s something I can’t stand in a comedy anime, it has to work fluently. I really wanted to give it a 7 or na 8 but for these reasons\\n\r\nEnjoyement gets an 6/10 \\n\\n\r\nOverall\\n\r\nGugure! Kokkuri-san is not, by any means, a bad anime, it is quite enjoyable and heartwarming but I feel that it could have been much better. Still, if you enjoy comedies and would like to watch a bunch of supernatural beings and a little girl getting into troublesome and ridiculous situations then give this anime a shot. You may find it much better than I did, it is all up to oneself :)\\n\r\nOverall I ended up droping the score from na 8 to a 7/10 but it still was worth the time.\\n\\n\r\nThank you and I hope this was helpfull",
            "date": "2015-01-11T19:18:00+00:00",
            "helpful_count": 12,
            "mal_id": 177479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1430267.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Panda_Hero-",
                "username": "-Panda_Hero-"
            },
            "url": "https://myanimelist.net/reviews.php?id=177479"
        },
        {
            "content": "Gugure! Kokkuri-san is probably the underdog anime of the Fall season along with Bahamut: Genesis. This anime will give you certain vibes that will make you reminisce about either Barakamon or Gekkan Shoujo Nozaki-kun or even both. The entire anime consists of comedies and gags wherein some might enjoy while others might find it ordinary or poor and hence, this anime is not for all of those comedy lovers who have varied opinions when it comes to the genre 'comedy'.\r\nStory (5/10):\r\nThere is no general plot or storyline where this show follows. The synopsis, which skims through the first episode in its entirety is the onlyentity that can be called as a plot. Other than that, this anime follows an episodic pattern with no continuity from the first episode. Since this anime is episodic in nature, some might find it boring or might feel like dropping it if they are to watch it in one sitting owing to some repetitive jokes and gags. Sometimes, the gags were kind of predictable and you will get the feeling that what you were expecting and thinking in your mind was going to happen next.\\n\\n\r\nArt (6/10): \\n\r\nPretty normal with nothing in particular standing out and then there is the obligatory distortion in the characters' eyes that you normally expect to see in every anime that you come across. The backgrounds, especially the buildings and the surroundings including the environment were well animated and rendered. \\n\\n\r\nSound (7/10): \\n\r\nThe OP was performed by the three ghosts viz., Kokkuri, Inugami and Shigaraki and it was catchy with Kokkuri being the lead singer while the other two passing and hurling unnecessary comments in between. The ED by Atsushi Suemitsu, who performed the OP for Nodame Cantabile, was pretty melodious and was pleasant to listen to. Since ancient ghosts were involved in the story, the OSTs at times incorporated some traditional Japanese music using the shamisen and also some spooky tunes. All the OSTs involving shamisen were nice to listen to and the timing of the music were good too.\\n\\n\r\nCharacter (9/10):\\n\r\nThis is where the anime excels the most. Characterization was way too brilliant and perfectly suited the theme of the anime. Kohina's character is very intriguing and the things that she says with such nonchalance and straight face are always amusing to watch. Each of the three ghosts have their own quirks while the other side characters' antics and the trouble they got themselves into were also a joy to watch. The interactions between Kohina and the three ghosts were so natural and felt it was realistic to a certain degree. Do take note of what they are saying and you'll laugh out loud in many instances.\\n\r\nThe voice-crew had great extravagance and experience and each of the characters' voices perfectly suited. I felt that Daisuke Ono (Kokkuri-san) was performing too flashily at times and was exaggerating with the reactions. Yukari Tamura's blissful voice was in charge of the narration part while the veteran Jouji Nakata voiced Shibaraki. Takahiro Sakurai and Chiwa Saito voiced Inugami.\\n\\n\r\nEnjoyment (8/10): \\n\r\nCannot really say that I did not enjoy the anime while watching it. The purpose of many comedy anime is to make us enjoy with their gags and witty jokes and Gugure! did just that. Felt that sometimes the jokes were repetitive and were way too predictable but other than that, this provides us genuine laughter. \\n\\n\r\nOverall (7/10):\\n\r\nNice jokes, great characterization, decent animation and virtually no storyline; all these combined to give Gugure! Kokkuri-san. This is the anime for you if you want to just pass away the time while enjoying it at the same time. The episodes where Shibaraki gets involved is are always a joy to watch and he gives us some good quotes regarding life. Wherever there is Shibaraki, there is drama involved in the anime. \\n\\n\r\nPS: Shibaraki is the best among the three ghosts. \\n",
            "date": "2014-12-27T03:51:00+00:00",
            "helpful_count": 12,
            "mal_id": 174519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2717523.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bleachsai",
                "username": "bleachsai"
            },
            "url": "https://myanimelist.net/reviews.php?id=174519"
        },
        {
            "content": "Gugure! Kokkuri-san is a quirky anime. It has no plot and is a bit strange at times. This is an anime where, sometimes, you are so clueless that you have to laugh at it. That's why it's a comedy.\r\nAnd yes, I did enjoy the weirdness of this anime. Sometimes, when my older sister got bored, she'd went into my room to see what I was doing. I had to pause several times to explain what was happening, because she never seen it, but most of the time I didn't know how to explain it because it was so weird.\r\nYes, there are some almost inappropriate scenesin it, but it's for the laughs. And there are also some scenes where you are either blushing so hard because something is so cute or there is a romantic scene; you just don't know what to expect when you click the button to the next episode.\\n\\n\r\nI highly recommend Gugure! Kokkuri-san to people who love quirky anime with no plot.",
            "date": "2014-12-23T08:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 173803,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495079.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HeyHarp",
                "username": "HeyHarp"
            },
            "url": "https://myanimelist.net/reviews.php?id=173803"
        },
        {
            "content": "Gugure! Kokkuri-san is one of those shows that are a rare gem to find when mixed in season where big name shows like Psycho Pass 2 and Tokyo Ghoul, take all the attention.    This show, like stated in one of the other top reviews, proves that you do not need big boobed women, gore and blood, harems, etc. to have a good show.\r\nStory:   The story for this, is really straight forward.  A very odd girl named Kohina, lives alone in a house and does nothing but eat cheap bowl's of noodles.  She then performs a ritual of sortsto call out for Kokkuri-san.  She is able to summon him, and after a while, Kokkuri-san takes it in hear to constantly haunt her, and help her with things such as eating better.   Through out the show, other characters are introduced and some of these characters are demons who decide to also haunt Kohina, while others do not.\\n\\n\r\nFrom there, the story just flows  on episodes having random encounters and issues that they face in life and each episode is unique in its own way.   So if you are someone who is looking for a deep story, then this might be for you, but if you can handle the lacking of deep story, then you will be fine.\\n\\n\\n\r\nCharacters:   This is where the show shines.   There are various characters through out the show that are introduced, and some are even used more than once.   The characters are different from each other, and vary in personalities.   The types of characters range from caring and sincere, to perverted or obsessive.   It is hard to say which character was my favorite, because they each had their unique moment, and while some where short lived, others had more serious moments that had you think better of them.   However, I am always a sucker for the sad-story-turned-sweet, so I will say that episode 10, the introduction of Kureha, was my favorite.  I won't spoil it, but if you watch it, you will see why it is beautiful.\\n\\n\\n\r\nArt:   The visuals are nicely done, the backgrounds are beautiful, the characters are nicely done as well, so nothing much to say here aside from it being good quality.\\n\\n\\n\r\nSounds/Music:   The sounds were good, but the music, was amazing.  Just hearing the OP, made me realize that this show was going to be good, and man was it.   The OP is very catchy and energetic, but also progressive through out the show.   The very first intro, has the basics in it, but as the series progresses, there are more characters seen in it, and those who are in it already, do something different.   Its very clever of them to do this.   Also, the music used through out, was well done as was the ending song.   A very short but simple song that I personally liked, was the Kureha theme song used in the beginning of episode 10.   So beautiful.\\n\\n\\n\r\nOverall:  Gugure! Kokkuri-san is a great show that people of many ages can enjoy.  The humor is not too raunchy for kids, while not too childish for adults.  If you are a person who enjoys stories, then this might not be the one for you, but if you enjoy good overall comedy mixed with interesting characters, then I recommend picking this up and giving it a go.    If not, then at the very least, watch episode 10.  Beautiful episode.  \\n",
            "date": "2014-12-21T07:44:00+00:00",
            "helpful_count": 11,
            "mal_id": 173445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=173445"
        },
        {
            "content": "Barakamon has left an empty hole in my heart. After watching the first episode of Gugure! Kokkuri-san I felt like I might have found something similar, yet much better. How disappointed I was. There isn't really a central plotline there to speak of. The attempts at character development are pathetic. Humor is mediocre.\r\nOverall...meh...if you have nothing to do, give it a shot, otherwise, go watch barakamon. I liked it a lot more.",
            "date": "2014-12-23T12:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 173827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4070723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Geanie",
                "username": "Geanie"
            },
            "url": "https://myanimelist.net/reviews.php?id=173827"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nPeople in society often believe in a wide range of \"things:\" religion, luck, and destiny are some of the first to come to mind. Some believe what they do to find comfort while others use it as a means to explain the impossible. Another common belief includes beings of the supernatural variety. In other words, ghosts. Spirits that are caught between the land of the living and the dead, forced to perform some duty before passing on completely. While such creatures are typically associated with horror, that isn't always the case. And Gugure! Kokkuri-san aims to make sucha statement a truthful one.\\n\\n\r\nSTORY\\n\\n\r\nThe tale begins one day when Kohina, a young girl, begins to play a game of \"Kokkuri-san.\" Surprisingly, the game works, summoning the fox-like spirit. When he sees the little girl's living habits, he decides to stay and help her on a daily basis.\\n\\n\r\nThe meat of the anime is strictly comedy. Its focus is on making the audience laugh at nearly all times. It relies mostly on visual gags, referential humor, and character quirks to achieve the intended effect. It's usually able to balance each of these aspects nicely enough, making the jokes feel varied despite them using the same tactics over and over. Kohina's doll persona has a shocking amount of uses, watching Inugami receive abuse never got old, and throwbacks to famous movies and shows were duly noted. At the same time, the show adopts an episodic format that actually contains a good amount of crossover. A scenario at the beginning of the episode may find relevance later on, or anywhere in between, rewarding the viewer who is paying a bit more attention to these more dialogue-dependent jokes.\\n\\n\r\nEarlier, the term \"nearly\" was used to describe Gugure's focus. \"Nearly\" because it also sets its sights on two separate themes that are not as executed as nicely as the comedy itself: the idea of simply enjoying what life as to offer and the difficulties of isolation. The former derives from not only the final episode, but much of what goes on leading up to it. Life isn't about what was or can be, but about enjoying what happens now. People come and go, and not everything is going to be jubilant at all times, but as long as you relish the moment for what it is, there really isn't anything more to wish. Now, due to the ridiculous nature of the comedy, the message isn't as defined. It's easy to enjoy life when fantastical things are happening within it: having an evil ghost buddy, having an alien for a classmate, and following a boy-turned-girl fox spirit around town. The luxury of having the enjoyment come to you as opposed to seeking it is prevalent within Gugure, but the latter is a stronger idea overall.\\n\\n\r\nThe second motif is centered around the idea of isolation, what it harbors, and how to fix it. Many of the characters, and more specifically Kohina, have an affinity for being lonely. Their backgrounds provide where such dependencies come from, and at times, it seems to take itself seriously. These moments, though, are quick to be forgotten with another gag or joke to take its place. The show has this weird attachment to wanting us to care more deeply for Kohina and the rest, but then uses them shortly after for another laugh rather than reflecting on the idea presented. This is fine, since the comedy is the focus, but then such \"emotional\" moments lose their impact.\\n\\n\r\nANIMATION\\n\\n\r\nThe art within Gugure is rather simple in nature. Much of what occurs takes place within Kohina's abode, but the group does visit other locations. Forests, the city, and the school are frequented, but they're more just there as okay scenery rather than something to be marveled at.\\n\\n\r\nThe character designs are better. All of the characters have their \"real\" persona and their \"character\" persona. For example, Inugami looks like a normal human but can transform into a small, purple puppy. Even Kohina maintains both sides, with the regular form barely making itself known over the course of the anime. Either way, all of the designs are either cute when they need to be, or distinct enough to make the characters known for what they are. Kokkuri's bell, Kohina's rectangular eyes, and Shigaraki's sake holder are all traits they maintain from beginning to end, and are nice details that the art is usually lacking.\\n\\n\r\nThe actual animation is typically average at best. Being a comedy, it uses the lesser amount of animation to its advantage to make movements seem more hysterical. Still, it can pull through during certain bits, such as Kohina attempting to take a scolding from Kokkuri. It doesn't happen a lot, but the anime does what it can with the animation it was given.\\n\\n\r\nCHARACTERS\\n\\n\r\nGugure relies on the characters to deliver the comedy. They mostly stick to their shticks to do so, with some performing better overall than others.\\n\\n\r\nShigaraki is an older gentleman who finds himself living with Kohina later than the rest. Usually scrapped for cash, he is often found drinking away without a care in the world. But deep down, he has more sympathy for others when compared to the entire cast. Willing to help his fellow spirits and Kohina, despite his relaxed nature, makes him the rock of the group. Sadly, he is perhaps the weakest character because of it. Being the silent watcher causes him to be the least memorable, and subsequently the least funny.\\n\\n\r\nWith his name in the title, Kokkuri plays a large part within the anime for every episode. A clean freak, emotional, and unable to handle stressful situations, many laughs are had at the expense of his well-being. To him, Kohina's health comes first before anything else. He isn't afraid to go above and beyond normal reactions to situations, often deferring to violence or stalker-like tendencies. While he may hate dealing with the troubles that his housemates bring, there is no denying that he cherishes the fact that these new people in his life have made the present more fun than ever before.\\n\\n\r\nInugami is easily the strangest of the bunch. His adoration for Kohina is almost unbelievable, but he maintains a rather calm demeanor when she is not present. Being able to switch genders at will, she doesn't have any qualms with becoming the type of person that Kohina wants. Like dogs in general, he is willing to trust others to a fault. Before being included in the group, she was unsure of the kindness of people in the world. Now, he is fully aware of the good that the world can bring.\\n\\n\r\nThe star, the funniest, and the best of the cast is, not surprisingly, Kohina. In love with cup noodles, she often acts like a doll as an ingrained defense mechanism. She has difficulty smiling, but not so much difficulty in getting others to do the same. Even though she behaves in an unorthodox manner, she's the only human within the group. Her ability to attract supernatural beings is evident, as is her adorable way of speaking. All of her time alone may have caused her to become quite distant, but in time, Shigaraki, Inugami, and Kokkuri should be able to get her back on the right track.\\n\\n\r\nWhat's interesting with the cast is that everyone involved, even the side characters, have an obsession of some kind. Some are more obvious than others: Shigaraki loves women, Kokkuri loves to protect Kohina. Some are more subtle simply because we don't see them much: Kureha loves her beloved, Jimeko loves having friends. For the most part, the fascinations the characters have provide the setting for the comedy to unfold. At the same time, however, it gives a look at what it means to love something to death so dearly. In this case, the portrayal is that having an obsession is okay, as long as it doesn't bring harm to oneself or anyone. Inugami's can be seen as detrimental, while Kohina's is fine as long as she is supplementing herself elsewhere.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is really funky. The beginning part utilizes both singing and regular speaking parts to give a hilarious mix that perfectly fits with the anime itself. The half-way part is whimsical, with the last portion continuing that sweet disco feel.\\n\\n\r\nAs for the ED, it is oddly sad. The soft piano playing and simple singing give it a relaxing feel that helps to calm the viewer down from what happened during the episode itself. The bells and ending double-vocals end the piece on a happier note, giving the song more power than it really deserves to have.\\n\\n\r\nThe soundtrack contains quick and fun tracks, and more serene ones to fit the situation. One track in particular, the acoustic guitar playing with the vocalist \"singing\" with it is very catchy and fun to hear.\\n\\n\r\nThe voice-acting sees above-average performances all around, with Kohina taking the lead. Ryou Hirohashi does a wonderful job as the lovable, doll-like girl. A special shout-out to the narrator for also doing a good job of contributing to the comedy.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one actually got me to laugh for every episode. I wasn't laughing at every single moment, only usually when Kohina and Inugami were on-screen acting like their typical selves. Kohina especially is able to be the right amount of cute, mean, hilarious, and real all at the same time in order to get the laughs out of the audience.\\n\\n\r\nBut there is someone I liked even more than Kohina. And that was Jimeko. She only truly has the fifth episode showcasing her, but I loved her by the end of it. It may just be my inner-\"moe\" coming through, but her tiny arc was adorable beyond measure. It therefore made me sad to witness that she was almost never included again within the show.\\n\\n\r\nAs it is, Gugure! Kokkuri-san is an above average comedy with great music and a funny cast of characters. It may seem wacky, but Kohina and the gang provide a fun little show worthy of your time.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, pure comedy, thematically lost\\n\\n\r\nAnimation: Fine, okay art, good character designs, average actual animation\\n\\n\r\nCharacters: Fine, Kohina, Kokkuri, Inugami, and Shigaraki are funny and obsessed\\n\\n\r\nSound: Great, good OP, good ED, good soundtrack, good VA work\\n\\n\r\nEnjoyment: Fine, needed more Jimeko\\n\\n\r\nFinal Score: 6/10",
            "date": "2014-12-28T12:26:00+00:00",
            "helpful_count": 9,
            "mal_id": 174835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=174835"
        },
        {
            "content": "The story started really well I'd say the very first episodes gave me promises what is it gonna be about. It's seems that our characters intentions comes from their past were the two main character deeply related. It promises to find out why is Kohina pretends to be a doll, and why Kokkuri-san wants to help her(only have a suggestion, that Kohina is reincarnation or descendant of someone who Kokkuri-san knew once). However the as the episodes goes on we won't go any further on their relation significantly. Instead of it, we'll know other 5-6 characters whose past are barely told in 1-1episode, there isn'treally more time anyway for them, since the anime have 12episodes.\\n\\n\r\nThe art is fair, the colors are lively and some pattern on clothes are interesting but nothing more impressive regarding how new the anime is.\\n\\n\r\nAbout sound they fit well the situations, they don't push too much but keep it tense enough when it's needed.\\n\\n\r\nAbout characters, we've got a not perfect-gentle and pretty stubborn \"Sebastian Michaelis\" renamed as Inugami, the typical pervert and little tricky (elder) Shigaraki, the doll who seems to search for way how not to be lonely Kohina, and the most \"balanced\" character who's trying to keep everything tidy and organized Kokkuri-san (who could be the deepest character with Kohina).\\n\\n\r\nAbout enjoyment... the anime have some cliche from bleeding nose during \"interesting moments\", to kick someone high and make a shiny star of it. The anime is (trying) to joke a lot about being pedophile... or about being pervert... sometimes the ghost \"dies\" and you can see something come out of it... a ghost in the ghost? Sometimes it doesn't makes much sense, yet there are some really interesting situations where fun is granted to even cold-hearted people, the question is if it fits your sense of humor, if you wanna know the end (for now it could be continued) and if you have a need for deep storyline and character development (where the anime is somewhat poor if it won't be continued). \\n\\n\r\nYet it's an interesting anime, if you have a hunger for a fair comedy you don't need to look any further.",
            "date": "2015-01-07T18:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 176737,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3909533.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kaname94",
                "username": "Kaname94"
            },
            "url": "https://myanimelist.net/reviews.php?id=176737"
        },
        {
            "content": "\"Humans are ephemeral.\r\n... die in an instant.\r\nIt would be painful to lose someone again. Our lives are moving very slowly to share with humans but are very long to live them alone ...\r\nI wish ... that things stay like this forever. \" - Kokkuri-san\r\nI was gonna put an 8 but the last episode made me change my mind it's a nine or a ten. The last 5 minutes were so simple but oh my god the feels , i cried like a little bitch okay let's begin. \r\nStory : 8\r\nOkay it's not an outstanding story , it's so simple with an original comedy ,satire and parodies without ecchi or shitty comedies nowadays , it's even criticising the japanese old thinking..\\n\\n\r\nArt 9 : nothing to say very good\\n\\n\r\nSound 10 : Perfect and fit so much with the scenes.\\n\\n\r\nCharacter 10 : here comes the good point , you will love every character in this fucking series , yes you won't believe me if you haven't finished the anime ,  at first you won't like some characters like inugami but then I remember at episode 9 I became a fucking fan of this ghost dog\\n\\n\r\nEnjoyment 10 : this series made my mondays better , I used to hate mondays like everybody but this anime changed the fact ( it's finished now fuck :( ) \\n\\n\r\nOverall 9 : I recommand this series very much but I don't guarantee that you will like it like I did but watch it it's worth your time :D",
            "date": "2014-12-29T15:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 175079,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4077725.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animelover110499",
                "username": "animelover110499"
            },
            "url": "https://myanimelist.net/reviews.php?id=175079"
        },
        {
            "content": "This is my first review ever so I apologize if it isn't very good.\r\nWhen I started watching Gugure! Kokkuri-san, I wasn't very sure what to expect but it was a very pleasant surprise!\r\nPlot-wise I was rather disappointed, I believe they should have showed more about Kokkuri-san and Kohina's since Kokkuri-san apparently knew her and I wanted to see Kohina act a little bit more human.\r\nThe characters are lovable specially Kokkuri-san. I think Inugami's obsession with Kohina was a bit too exaggerated, they're a real stalker but if you have patience you can understand why they act the way they do. Shigaraki was a surprise, Ididn't like him very much but deep down he's very caring, he just needs to tone down on the drinks and being pervy.\\n\\n\r\nThe opening song is super catchy! Enough said!\\n\\n\r\nOverall it was a good anime, I enjoyed it a lot. It was heartwarming yet funny. I hope a new season comes out to explain and reveal more plot, since it feels very incomplete.",
            "date": "2016-08-26T17:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 227674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5651180.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Another_Nobody",
                "username": "Another_Nobody"
            },
            "url": "https://myanimelist.net/reviews.php?id=227674"
        },
        {
            "content": "Gugure! Kokkuri-san revolves around Kohina, a little girl who believes that she is a doll. Along with Inugami (a dog spirit that can transform into both a woman and a male), Kokkuri-san (a fox spirit that looks A LOT like Tomoe from Kamisama Hajimemashita), and Shigaraki (a perverted weirdo), the four of them go on numerous, hilarious adventures. \r\nThe story (5/10):\r\nThe anime doesn't seem to have a plot at all, and it barely shows any progress. However! It does not deserve anything lower than a 5 because it's comical. This anime, unlike many others that also don't have a storyline, made sure that the charactersand events were humorous enough to keep the audience watching. I kid you not, I was laughing like an idiot the entire time. This anime truly was a breath of fresh air.\\n\\n\r\nThe art (8/10):\\n\\n\r\nWas the art drop-dead gorgeous? No, not really. But it was nice...nice enough for one to not feel turned off. So why does this anime get such a high score when it comes to art? Well, I must admit, I'm being a bit biased. I came to see this anime with the hopes that it would be a bit similar to Kamisama Hajimemashita. Tomoe's doppelgänger lured me in. \\n\\n\r\nThe sound (8/10):\\n\\n\r\nI think that the voice actors did a wonderful job! Their voices further developed the characters.\\n\\n\r\nThe character (9/10):\\n\\n\r\nI think I fell in love with the characters. I don't know how or why this happened, considering that the main character's a weird child who's obsessed with Cup Ramen, Inugami is both a woman and man, making me sexually confused, and Shigaraki is a man who'd sleep with anything that has a vijay-jay, but somehow I've fallen for these characters. Dammit.\\n\\n\r\nOverall (8/10):\\n\\n\r\nOnce again, I enjoyed this anime because it was different from what I usually see. It wasn't excellent or outstandingly amazing, and I definitely wouldn't KILL to recommend it to anyone, but that doesn't mean that I didn't enjoy it. I would recommend it to those who want a laugh or something that isn't as deep.",
            "date": "2015-06-23T16:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 191060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Grapesandraisin",
                "username": "Grapesandraisin"
            },
            "url": "https://myanimelist.net/reviews.php?id=191060"
        },
        {
            "content": "Gugure! Kokkuri-san is an anime that blends good innocent humor with a very serious and morale tone. At first the characters seem very flat and cliché, but most characters experience an event that shows their good sides. For example take the Tanooki, he acts like your average drunk pervert, but there is a couple points in which you see his caring side and doing what he feels best for those around him. This series has a very fresh style of humor in which they use gender-bending occasionally and innocent humor which we have seen before with twists. In general the anime is a light-hearted comedymixed with serious tones and the paranormal.",
            "date": "2014-12-21T13:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 173477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3672067.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wolfkyle",
                "username": "wolfkyle"
            },
            "url": "https://myanimelist.net/reviews.php?id=173477"
        },
        {
            "content": "Gugure! Kokkuri-san! is one of those episodic slice-of-life anime that will hook you up in the beginning of the series but tends to become boring when the same  slapstick comedy is repeated. Overall, the show has some good points and touching episodes and some fail to amuse you.\r\nStory- 5\r\nThe story is fairly simple. Kohina, the young neglected main character living alone without adult supervision, calls upon a fox ghost, Kukkuri-san. The fox ghost decides to haunt Kohina after seeing her bad living habits of eating of eating cup ramen daily. However, instead of haunting Kokkuri takes after her which he figuratively becomes a housemother-guardian of Kohina. Other spirits and ghosts decided to haunt the girl. The anime is just about the daily life of Kohina, Kukkuri-san and the other spirits haunting the girl. \\n\\n\r\nDespite the simple setting and plot, there are instances where a themes of family and friendship is highlighted. While spirits and ghost are deemed frightening in nature, they in turn are viewed in a humorous perspective. Especially the older spirits, despite being called 'perverts' or 'stalker', become attached to Kohina and become a role model and protective of her.  Instances like this makes a simple anime good, as one can appreciate small gestures yet still remains big and symbolic. \\n\\n\r\nArt-7\\n\r\nJust like the plot, the art is also simple. There might have been instances where the art was remarkable but I personally didn't recognized it. However, the characters did appear cute and the OP and ED were visually eye-catching. This would've been marked 6 but since the animal forms of the spirits looked cute I moved it up.\\n\\n\r\nSound-8\\n\r\nThe soundtrack was nice. The catchy OP makes me want to \"kemo kemo kemo!\", normally I would skip over the OP but the upbeat and disco feel of the song makes it surprisingly bearable.\\n\\n\r\nCharacter-7\\n\r\nThere were characters that I found absolutely annoying *coughs* the dog. But there are some characters that appear to have a surprisingly good nature despite being unreliable and lazy. The spirits that come to haunt Kohina tend to acquire likeable characteristics.\\n\\n\r\nEnjoyment-7\\n\r\nThe initial episodes were very enjoyable while in the middle of the series the anime was pretty bland but the ending left me with mixed feelings. I would say that atleast watch the 5 first episodes and watch the last episode to fully appreciate this simple anime. Although the final episode may leave some irritated, like me, but this is overthrown by looking at the anime in a wider perspective and just simply accepting it. Although the plot remains relatively fair, the themes of friendship and family is definitely present. \\n\\n\r\nOverall- 7.2\\n",
            "date": "2015-04-19T15:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 185976,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4233679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/liqkue",
                "username": "liqkue"
            },
            "url": "https://myanimelist.net/reviews.php?id=185976"
        },
        {
            "content": "It is a great way to waste your time waiting for new anime episode. Though the story has a lot of holes in it, it is still enjoyable. It is a refreshing way to start off your day and will make you wanting more and more information about each characters. I would given it more than a 7 if it had given us more explanation to certain things, but it what it is. I have never seen a heroine's personality like that so it is very surprising. At first you might be unsure of this anime but I would recommend you watching it if youare bored, and having nothing else to do but wait for airing anime's new episode.",
            "date": "2015-01-01T15:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 175611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1870444.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/wolfpackkn",
                "username": "wolfpackkn"
            },
            "url": "https://myanimelist.net/reviews.php?id=175611"
        }
    ],
    [
        {
            "content": "After finishing \"Gugure! Kokkuri-san\" I had to think to myself: What makes an anime good?  Is it the person's expectations going in?  Because I came for the comedy and at no point throughout the entirety of the show was I ever disappointed.  In fact, comedy is the only thing that this show even makes an attempt at, and boy does it do it well (although there is a recurring message in the show if you can pick it out).  I'll try my best to tell you my thoughts on the show, and if you hate the very core of my beingafter this review than I'm sure we can talk it out like civilized people.\\n\\n\r\nCharacters- The show has a diverse and hilarious cast to ensure that you will laughing at, at least 1 of the 5 gags/jokes this show throws at you per minute. 8/10\\n\\n\r\nI'm starting with characters because to be honest... If you don't like the characters you will not enjoy the show.  Kokkuri himself is portrayed as an attractive spirit struggling with a mid-life crisis due to him fearing for his relevance in the the modern world.  Although he's a man he has many intricacies that one would normally associate with women.  This takes form (literally) later on in the show.  Now Kohina can be a really hit or miss character with some people.  Her design is extremely deformed in comparison to all of the other characters (which turns a lot of people off), but anyone who is familiar with \"Oyasumi Punpun\" should have at least some idea of whats really going on there.  She is the center of all insanity that happens in each episode.   Shigaraki was probably my favorite character although he started out as my least favorite.  Another spirit who often brings misfortune to others, but despite this he is a true romantic.  Inugami is yandere dog who died from neglect but was reincarnated into the world as a spirit.  He/she gender swaps often due forgetting his/her gender in the previous life.  Characters interactions were entertaining throughout.\\n\\n\r\nSound/art- My roommate walked in on me dancing to the opening and said \"wtf are you doing bro.\" 10/10 \\n\\n\r\nThe opening is cleverly done, full of personality, and of course catchy as hell.  The ending is good as well, and the shows OST is funny sounding... in the best way possible.  As for the art I'd say its completely average.  I mean sure it has a certain style to it, but in comparison to many other shows released this year there really is nothing notable about it.\\n\\n\r\nStory- Its serves its purpose as being the catalyst for the numerous gags, jokes, and satirical content this show offers. 6/10\\n\\n\r\nFrom the first 2 episodes you will know whether this show is for you or not.  The series seems to enjoy taunting its viewers with scenarios that in many other shows would be clear indicators of: DRAMA INCOMING! only to slap you along with your expectations across the face.  This happens a lot.  But its FUNNY EVERY TIME.  Although I'd be lying if I said I didn't want to see some drama play out.  Either way the synopsis pretty much says it all, and the way the story presents itself is favorable.\\n\\n\r\nConclusion- If you want some laughs look no further! This is your show!  If you want anything else... Its a questionable endeavor.  I gave it a great 8 because not many shows can make me laugh as much as this one did.\\n\\n\r\nShould Watch:\\n\r\n-If Satire/parody is your thing, because this show has every western/Japanese pop culture gag you can think of.\\n\r\n-Had a rough day? Just sit back and laugh it off!\\n\r\n-Fun Characters that will grow on you.\\n\\n\r\nShould avoid:\\n\r\n-If you want some sort of meaningful romance/drama.\\n\r\n-Some gags get repetitive\\n\\n\\n\\n\\n",
            "date": "2014-12-21T06:46:00+00:00",
            "helpful_count": 117,
            "mal_id": 173441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3194647.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GoS1234",
                "username": "GoS1234"
            },
            "url": "https://myanimelist.net/reviews.php?id=173441"
        },
        {
            "content": "Gugure Kokkuri-San has come to an end. Another ending which make me feel ugh, what to watch again. Honestly this is the funniest anime to watch in 2014. This reminds me of barakemon and Gekkan Shoujo Nozaki Kun, those two anime shows were really great. I really like the voice actors typically Daisuke Ono, who voice of course Kokkuri and Sensei from Barakemon.\r\nSo here are my results:\r\nStory: 8/10, I thought it might follow the plot story like Inugami running away from home and thought he will be search by the members on EP 10, but well he is completely ignored. Funny, it may contain mixup plots since it' published in Manga, so yeah.but still it's good to watch\\n\\n\r\nArt: 8/10, I have no comments on this, but good job on Kokkuri-San especially when she's a girl. \\n\\n\r\nSound:9/10, The OP song was really catchy, I couldn't bear to skip it. The ED song to was really touching, that feel, you know.\\n\\n\r\nCharacter: 8/10, They are okay, I can say but what I wish is to see Kohina real emotions but nahh, she rather be a doll and eating cup noodles, I respect that, cause i eat cup noodles too\\n\\n\r\nLastly enjoyment : 10/10, I say this is really a good anime to watch though it has mix plots and weird stuffs, but it's a good time to watch after doing some stressing works, yeah.\\n\\n\r\nOverall: 9/10\\n\\n\\n\r\nThis was a good anime to watch and I rank 2nd after Amagi brilliant park for this. \\n\r\nI totally RECOMMEND all of you to watch this anime, not Amagi of course.\\n\\n\\n\r\nI hear there's a special 5mins episode for this, hope it will be funnier!\\n\\n\r\nAnd hopefully there will be 2nd season, IF.\\n\\n\r\nThanks! Peace",
            "date": "2014-12-25T10:57:00+00:00",
            "helpful_count": 43,
            "mal_id": 174255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=174255"
        },
        {
            "content": "Amusing, funny, and full of heartwarming moments, Gugure! Kokkuri-San managed to captivate me with it's unique charm and cast of characters.\r\nThere were too many things I liked about this show so I'll try and keep it short and sweet, just like Kohina.\r\nPerhaps the best thing I loved most was the characters. Ordinarily, I like unique Anime shows, that offer a large to Medium variety of characters. However, Gugure! Kokkuri-San has such a small amount of characters and I just loved them. The characters of the show are obviously from Japanese mythology and games. These spirits that are supposed to be terrifying all have such thepersonalities and characteristic traits given to them that were just so hilarious. Their jokes, slapstick, relationships (how they got along)  and gags were something that I really enjoyed seeing.\\n\\n\r\nThe story is there, however it is more like you're just watching the daily lives of a little girl who thinks she's a doll interact and live with 3 spirits. One thing that bothered me just a little was that there was no real backstory. Kokkuri mentions a few times during the show about how he's been aware and has seen Kohina in the past before being summoned to her, however nothing else is explained. Which really makes me question what was the point of adding that into the show if there wasn't going to be any explanation.\\n\\n\r\nThe artwork and character designs done for the show were varied in my opinion. Some were good some were bad, other moments I just didn't care too much. \\n\\n\r\nThe soundtrack isn't that bad either, the opening song can be a bit of an ear-worm at times, and the ending song was pretty decent, I liked how the characters would change every few episodes.\\n\\n\r\nMy final thoughts are that I would highly recommend this show to anyone, especially if you just want to laugh and be entertained without having to think too much.\\n\\n\r\nOverall rating is 8/10 for being a very good and refreshing comedy while representing the unique side of anime. Lastly, Gugure! Kokkuri-San did a pretty damn good job at adding a unique spin and take on Japanese Mythology.",
            "date": "2016-02-12T17:17:00+00:00",
            "helpful_count": 37,
            "mal_id": 210762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2919861.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LeaderTGW",
                "username": "LeaderTGW"
            },
            "url": "https://myanimelist.net/reviews.php?id=210762"
        },
        {
            "content": "Gugure! Kokkuri-san is a 'good' anime where the term 'good' surely requires a lot of explanation. For while I enjoyed it to some extent, I won't be extremely eager to recommend it to someone else. Let me explain. Unlike some animes that might not mess up in various ways but their positives are not so appealing either to get them a 9 or 10, Kokkuri san has both positives and negatives.\r\nPlot wise, there isn't much except the appearance of the different ghostly characters in the anime and how interact with Kohina - the protagonist of sorts around which the entire story revolves. Thus it isan episodic anime, other than the characters popping at intervals, there is no bigger plot. And honestly the plot here doesn't matter as much as the characters and the entertainment they give. However there are certain themes tackled in separate episodes that are well developed and rather appealing to watch. They can be given credit.\\n\\n\r\nThe art is good - the scenery's are nice, colorful, the anime gives off a happy vibe to it and most of the characters are also drawn well. And the music was good - it was complimenting, setting the mood and over all I was fond of it.\\n\\n\r\nThe real critique starts here: As with episodic animes, the entire anime boils down to the enjoyment. Did you enjoy it? Did the previous episode make you want to watch the next? And the entertainment in such episodes depends greatly on the characters. How did THEY tackle the episode. It isn't a matter of plot - they could be going to a theme park or beach, or cleaning the house, but how they manage to execute it - and since this is a comedy anime, how many laughs did we get out of it.\\n\\n\r\nKeeping in mind those criteria, the two characters that are introduced since the start of the anime (and I consider those two as the 'main' characters since one is Kohina - the girl around which the anime revolves and the other is the one after whom the anime is named), Kokkuri-san and Kohina are first to be discussed. And these two strike off very well together.\\n\\n\r\nKohina - a girl self believing she is a doll who goes off with philosophical monologues that even depress the aged spirit and the aged spirit (that doesn't look aged) that despite craving to be feared finds the unstable state of Kohina too pitiful to leave her alone. She depresses him, he gets over it, she eats cup noodles, he disposes off them. She and he... they just develop a chemistry that compliment each other very well. Her retorts and his retorts work well with giving the viewer good, light, family comedy.\\n\\n\r\nHowever when the rest of the spirits start pouring in, the anime turned from very good to mediocre. The characters are also in one way or the other attached to Kohina (except Shigaraki who is just there for fun - but he too is perverted) but their attachment is forced. Now that in itself doesn't seem like a bad trait, the show is comedy, there is no reason to stick to extremely believable progression as long as we get comedy right? But that is where the show loses appeal. The punch lines/events associated with the other characters all seem forced in contract to Kokkuri-san and they just don't hit the nail. And you see them trying to be funny but they just can't get it right mot of the time. At times, yea - they manage to get a comical flurry - but rarely. Furthermore, they made the rest of the characters way too 1-Dimensional to like. Yes, Kokkuri-san is no Kurono from Gantz either - he isn't the best example of a 3-D char but his traits shown are not excessively questionable - or you don't find the reason to question them. For the rest of the characters, they just seemed like medicore fillers in a decent anime.\\n\\n\r\nAnd when the fillers are there for more than half of the anime - it gets boring. True, there are certain comical moments combining all the chars but the expectations given by the duo in the start did leave me a little disappointed till the end.\\n\\n\r\nSo, if you are looking for a decent, light comedy anime that you can watch with someone who doesn't have a very specific taste, then it is a good choice. However, if you are looking for a really good attempt at comedy that definitely delivers epic fun, then sorry - it has its moments, but I won't recommend it to you on those basis. \\n\\n\r\nThank you reading and whether you agree or not, I am glad to discuss so any constructive feedback or discussion is welcome!",
            "date": "2015-03-31T08:16:00+00:00",
            "helpful_count": 35,
            "mal_id": 184238,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3229339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NotenSMSK",
                "username": "NotenSMSK"
            },
            "url": "https://myanimelist.net/reviews.php?id=184238"
        },
        {
            "content": "I wasn't sure what to expect starting this show. But am I ever glad I did start this show. \r\nSTORY:\r\nFirst thing's first: if you're looking for a deep story that will make you rethink your life, you've come to the wrong place. However, the story is very cute, and hilarious. I rarely laugh at shows, and with this one I found myself laughing at almost every episode, I thoughly enjoyed this show. And while it may not be the deepest story out there, or even very moving, it does have it's sweet moments that are lovely in their own respect. \r\nNot great plot-wise, but stillamazing.\\n\\n\r\nART:\\n\r\nFor the most part the art is great. It's cute and really helps with the humor of the show. There are some scenes where some of the characters have more realistic features, and those moments threw me off, but it's definitely nothing to not watch the show over. Overal the animation is amazingly cute and helps with the humor of the show in amazing ways.\\n\\n\r\nSOUND:\\n\r\nThe soundtrack, as one might expect for such a humourus show is very playful and super fun to listen to. While it may not be a soundtrack that you'd listen to outside of the show, it definitely is one that helps with story telling and mood-making and is definitely a big plus for this show. (The theme song has been stuck in my head since I started watching it too, haha)\\n\\n\r\nCHARATER:\\n\r\nThis is where the show really shines. While all of the characters may be very very VERY stereotypical, they are also all very loveable, and it's the character interactions that is what makes this show so great. Even characters like Inugami, who I absolutely hated at first, by the end I loved so much simply because, while they may be very flat characters, they are very enjoyable, and will make you laugh.\\n\\n\r\nOVERALL:\\n\r\nThis show is a form of pure comedy, and if you're not into comedy, you're probably better off elsewhere. However, that being said, it does what it does VERY well, and if you're ever looking for a good laugh I would HIGHLY recommend this show. It's not a show that does it all, but it does what it does very very well. If you're ever in need of cheering up, or just want a good laugh, Gugure! Kokkuri-san is a show that is very worth your time.",
            "date": "2015-02-18T17:20:00+00:00",
            "helpful_count": 20,
            "mal_id": 180756,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4299141.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/swirrlix",
                "username": "swirrlix"
            },
            "url": "https://myanimelist.net/reviews.php?id=180756"
        },
        {
            "content": "Gugure! Kokkuri-san follows the episodic adventures of various Japanese supernatural creatures and Kohina, a self-proclaimed 'doll'. As the events are disjointed scenarios from episode to episode, the show relies wholly on it's comedy to gain viewship--however, this comedy is not at all top notch for being the one savior of the program.\r\nNone of the different endeavors of the characters from episode to episode are new, or presented in a refreshing way. A girl summons a ghost because she is lonely, and said ghost becomes her substitute mom, as, for some reason, those in charge of Gugure! felt the need to throw in angst in anotherwise comedic plot. While there are moments where the emotion and relationships between the characters shine through, it's all a bit disjointed. \\n\r\nAdditionally, for a comedy, many of the jokes fall quite flat. There were times earlier one when I genuinely got a good laugh out of an episode, but that was back in the character introduction stages very early on. As Gugure! pushed to provide more of an emotional message of family or togetherness or what have you, getting laughs became second priority though that was the anime's strength.\\n\r\nIn the end, Gugure! goes out not with a bang, but with a fizzle, retelling the age old 'friends are forever' cliche to close out episode twelve. Nothing new, memorable or humorous here.\\n\\n\r\nA lot of the anime's best humor may lie in it's visual gags; when Gugure! is trying to be funny, the art is very on point. Images of Kohina's eyes coming off like stickers and the tanuki morphing into a grown man in Kohina's clothes come to mind.\\n\r\nOtherwise, for an anime at the end of 2014, I was not exactly impressed--not to say there were crossed eyes and miniature misshapen limbs all over the place, but the animation was nothing progressive.\\n\\n\r\nSound was what is expected from a sort of parody/comedy anime like this one, and there is nothing really worth mentioning here as well. \\n\\n\r\nCharacters, even the main ones, were very one note, which is something common but still depressing to see. Once introduced, most of the material coming from each personality was very predictable, and thus short lived. At times, it was almost as if the characters themselves were forcing out the laughter, and I could almost here the Kokkuri-san himself losing his voice over all the yelling that defined his nagging personality type. It all seemed a bit forced at times, and relaxed in others, creating an uncomfortable uneveness.\\n\r\nAs is the case with tropes, the possibility of finding a favorite character is there. Unfortunately, throughout the course of the show I did find my favorite, and pitied them, a side character, more than Kohina, whose loneliness kept getting shoved in my face for plot reasons. Sorry Kohina, your  monotone loner act makes you too flat and static for my liking.\\n\\n\r\nEnjoyment decreased over time, sloping downward during the process of the jokes getting stale. This particular series may be better to viewers who are not already well immersed in anime, but know that there are also many references to Japanese culture that go unexplained and may deter a newer fan. \\n\r\nWikipedia if you will, laugh stiffly if you will--I will mostly like smoothly move on from a supernatural comedy that is, in the end, a bit bland.",
            "date": "2014-12-21T16:22:00+00:00",
            "helpful_count": 14,
            "mal_id": 173505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3863993.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MangakaNotlora",
                "username": "MangakaNotlora"
            },
            "url": "https://myanimelist.net/reviews.php?id=173505"
        },
        {
            "content": "Gugure Kokkuri-San is a very cute anime and I enjoyed it. This is a great show to watch on the weekend when you have not much else to do. The idea is interesting and the show is high up there on my favourites.\r\nStory: 6 It's not too special because there's nothing to be achieved or done. The first half of the show was very entertaining, but later on I became bored. The comedy aspect helps the show deliver a story and keep you content.\r\nArt: 10 The art style is great, not much else to say. \r\nCharacter: 10 Each character has their own powerful personality uniqueto him or her. The character designs suits each character well.\\n\\n\r\nEnjoyment: 7 The element this show plays on most is comedy and it excells at that. I didn't enjoy it as much on the second half, but I was content. Character communication is very entertaining. I wish some characters showed up more often however.\\n\\n\r\nOverall: 7 A show I am glad that I watched.",
            "date": "2015-03-04T15:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 181701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3636011.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ninjakato-San",
                "username": "Ninjakato-San"
            },
            "url": "https://myanimelist.net/reviews.php?id=181701"
        },
        {
            "content": "(may contain minor spoilers)\r\nI don’t usually write reviews and I’m not, by any means, an “expert” in anime but about this one I really felt the need to write one so here we are.\r\n“Gugure! Kokkuri-san” is a sort of slice-of-life comedy with supernatural involved. Now, after knowing this and reading the synopsis above we may somewhat expect what the anime is going to be about.\r\nEven though I said I’m no expert in anime (and I’m definitely not), as an avid fan of comedies I’ve watched quite a lot of them and I end up having the need to talk about them. Now, in my opinionthere are many great comedy animes out there that are not as high rated as this one currently is. Could it be because it actually was not all that well executed? They had a special kind of humour directed to a specific audience? Whatever may be the reason, comparing some of them to this one I found myself askig 'Does Gugure! Kokkuri-san' deserve all the praise it is getting?” In my honest opinion, it doesn’t really. Let’s separate the review by parts then.\\n\\n\r\nStory:\\n\r\nKohina is a girl who says she’s a doll and that one day ended up summoning Kokkuri-san After that a bunch of characters are introduced and they started living together in Kohina’s house. There isn’t exactly a “serious” plot but I that’s normal from a slice-of-life. All in all it had small subplots here and there that worked alright. Not much to say here. Hopefully I'm not forgetting anything important.\\n\r\nStory gets an 6/10. With the variety of characters it could have done much better.\\n\\n\r\nArt/Animation:\\n\r\nThe art is fine, nothing too special nor new. Kokkuri-san looks like a copy of Tomoe from “Kamisama Hajimemashita” but I’m not going to complain about that. The animation was ok for most of the anime as well, I dind’t notice a moment where it got worse.\\n\r\nArt gets an 7/10 for it could be much better and fresh.\\n\\n\r\nSound:\\n\r\nOh, the opening song is quite catchy and the ending is good as well, very relaxing to listen to. The voice actors did a good job on their roles as well and made this anime much better. Nothing much to say about the BGM, it was ok for most of the times.\\n\r\nSound gets an 9/10\\n\\n\r\nCharacter:\\n\r\nWell, if this anime isn’t following a specific plot then the characters have to be the ones to carry the anime. We have quite a few here altough the only ones who stand out more are definitely Kohina and Kokkuri-san with Inugami coming 3rd place here. There’s no explanation about the backstory of most of them and the most developed character is probably Kokkuri-san as he adapts to his life with Kohina and company.\\n\r\nCharacters get a 7/10\\n\\n\r\nEnjoyement:\\n\r\nNow here comes one that is really important for my ratings. I have to say I had great expectations for this anime after the 1st and 2nd episodes. They felt new and refreshing and the jokes were well played during those first episodes but after these I felt my enjoyement dropping. Maybe it was because I wasn’t feeling like watching it at the time? I don’t know but I ended up disappointed with the way the anime went as it didn’t seem to want to go anywhere precisely. New characters appeared just for 1 or 2 episodes and then were forgotten and I didn’t find the jokes as funny as before, they felt repetitive and forced and that’s something I can’t stand in a comedy anime, it has to work fluently. I really wanted to give it a 7 or na 8 but for these reasons\\n\r\nEnjoyement gets an 6/10 \\n\\n\r\nOverall\\n\r\nGugure! Kokkuri-san is not, by any means, a bad anime, it is quite enjoyable and heartwarming but I feel that it could have been much better. Still, if you enjoy comedies and would like to watch a bunch of supernatural beings and a little girl getting into troublesome and ridiculous situations then give this anime a shot. You may find it much better than I did, it is all up to oneself :)\\n\r\nOverall I ended up droping the score from na 8 to a 7/10 but it still was worth the time.\\n\\n\r\nThank you and I hope this was helpfull",
            "date": "2015-01-11T19:18:00+00:00",
            "helpful_count": 12,
            "mal_id": 177479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1430267.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Panda_Hero-",
                "username": "-Panda_Hero-"
            },
            "url": "https://myanimelist.net/reviews.php?id=177479"
        },
        {
            "content": "Gugure! Kokkuri-san is probably the underdog anime of the Fall season along with Bahamut: Genesis. This anime will give you certain vibes that will make you reminisce about either Barakamon or Gekkan Shoujo Nozaki-kun or even both. The entire anime consists of comedies and gags wherein some might enjoy while others might find it ordinary or poor and hence, this anime is not for all of those comedy lovers who have varied opinions when it comes to the genre 'comedy'.\r\nStory (5/10):\r\nThere is no general plot or storyline where this show follows. The synopsis, which skims through the first episode in its entirety is the onlyentity that can be called as a plot. Other than that, this anime follows an episodic pattern with no continuity from the first episode. Since this anime is episodic in nature, some might find it boring or might feel like dropping it if they are to watch it in one sitting owing to some repetitive jokes and gags. Sometimes, the gags were kind of predictable and you will get the feeling that what you were expecting and thinking in your mind was going to happen next.\\n\\n\r\nArt (6/10): \\n\r\nPretty normal with nothing in particular standing out and then there is the obligatory distortion in the characters' eyes that you normally expect to see in every anime that you come across. The backgrounds, especially the buildings and the surroundings including the environment were well animated and rendered. \\n\\n\r\nSound (7/10): \\n\r\nThe OP was performed by the three ghosts viz., Kokkuri, Inugami and Shigaraki and it was catchy with Kokkuri being the lead singer while the other two passing and hurling unnecessary comments in between. The ED by Atsushi Suemitsu, who performed the OP for Nodame Cantabile, was pretty melodious and was pleasant to listen to. Since ancient ghosts were involved in the story, the OSTs at times incorporated some traditional Japanese music using the shamisen and also some spooky tunes. All the OSTs involving shamisen were nice to listen to and the timing of the music were good too.\\n\\n\r\nCharacter (9/10):\\n\r\nThis is where the anime excels the most. Characterization was way too brilliant and perfectly suited the theme of the anime. Kohina's character is very intriguing and the things that she says with such nonchalance and straight face are always amusing to watch. Each of the three ghosts have their own quirks while the other side characters' antics and the trouble they got themselves into were also a joy to watch. The interactions between Kohina and the three ghosts were so natural and felt it was realistic to a certain degree. Do take note of what they are saying and you'll laugh out loud in many instances.\\n\r\nThe voice-crew had great extravagance and experience and each of the characters' voices perfectly suited. I felt that Daisuke Ono (Kokkuri-san) was performing too flashily at times and was exaggerating with the reactions. Yukari Tamura's blissful voice was in charge of the narration part while the veteran Jouji Nakata voiced Shibaraki. Takahiro Sakurai and Chiwa Saito voiced Inugami.\\n\\n\r\nEnjoyment (8/10): \\n\r\nCannot really say that I did not enjoy the anime while watching it. The purpose of many comedy anime is to make us enjoy with their gags and witty jokes and Gugure! did just that. Felt that sometimes the jokes were repetitive and were way too predictable but other than that, this provides us genuine laughter. \\n\\n\r\nOverall (7/10):\\n\r\nNice jokes, great characterization, decent animation and virtually no storyline; all these combined to give Gugure! Kokkuri-san. This is the anime for you if you want to just pass away the time while enjoying it at the same time. The episodes where Shibaraki gets involved is are always a joy to watch and he gives us some good quotes regarding life. Wherever there is Shibaraki, there is drama involved in the anime. \\n\\n\r\nPS: Shibaraki is the best among the three ghosts. \\n",
            "date": "2014-12-27T03:51:00+00:00",
            "helpful_count": 12,
            "mal_id": 174519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2717523.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/bleachsai",
                "username": "bleachsai"
            },
            "url": "https://myanimelist.net/reviews.php?id=174519"
        },
        {
            "content": "Gugure! Kokkuri-san is a quirky anime. It has no plot and is a bit strange at times. This is an anime where, sometimes, you are so clueless that you have to laugh at it. That's why it's a comedy.\r\nAnd yes, I did enjoy the weirdness of this anime. Sometimes, when my older sister got bored, she'd went into my room to see what I was doing. I had to pause several times to explain what was happening, because she never seen it, but most of the time I didn't know how to explain it because it was so weird.\r\nYes, there are some almost inappropriate scenesin it, but it's for the laughs. And there are also some scenes where you are either blushing so hard because something is so cute or there is a romantic scene; you just don't know what to expect when you click the button to the next episode.\\n\\n\r\nI highly recommend Gugure! Kokkuri-san to people who love quirky anime with no plot.",
            "date": "2014-12-23T08:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 173803,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495079.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HeyHarp",
                "username": "HeyHarp"
            },
            "url": "https://myanimelist.net/reviews.php?id=173803"
        },
        {
            "content": "Gugure! Kokkuri-san is one of those shows that are a rare gem to find when mixed in season where big name shows like Psycho Pass 2 and Tokyo Ghoul, take all the attention.    This show, like stated in one of the other top reviews, proves that you do not need big boobed women, gore and blood, harems, etc. to have a good show.\r\nStory:   The story for this, is really straight forward.  A very odd girl named Kohina, lives alone in a house and does nothing but eat cheap bowl's of noodles.  She then performs a ritual of sortsto call out for Kokkuri-san.  She is able to summon him, and after a while, Kokkuri-san takes it in hear to constantly haunt her, and help her with things such as eating better.   Through out the show, other characters are introduced and some of these characters are demons who decide to also haunt Kohina, while others do not.\\n\\n\r\nFrom there, the story just flows  on episodes having random encounters and issues that they face in life and each episode is unique in its own way.   So if you are someone who is looking for a deep story, then this might be for you, but if you can handle the lacking of deep story, then you will be fine.\\n\\n\\n\r\nCharacters:   This is where the show shines.   There are various characters through out the show that are introduced, and some are even used more than once.   The characters are different from each other, and vary in personalities.   The types of characters range from caring and sincere, to perverted or obsessive.   It is hard to say which character was my favorite, because they each had their unique moment, and while some where short lived, others had more serious moments that had you think better of them.   However, I am always a sucker for the sad-story-turned-sweet, so I will say that episode 10, the introduction of Kureha, was my favorite.  I won't spoil it, but if you watch it, you will see why it is beautiful.\\n\\n\\n\r\nArt:   The visuals are nicely done, the backgrounds are beautiful, the characters are nicely done as well, so nothing much to say here aside from it being good quality.\\n\\n\\n\r\nSounds/Music:   The sounds were good, but the music, was amazing.  Just hearing the OP, made me realize that this show was going to be good, and man was it.   The OP is very catchy and energetic, but also progressive through out the show.   The very first intro, has the basics in it, but as the series progresses, there are more characters seen in it, and those who are in it already, do something different.   Its very clever of them to do this.   Also, the music used through out, was well done as was the ending song.   A very short but simple song that I personally liked, was the Kureha theme song used in the beginning of episode 10.   So beautiful.\\n\\n\\n\r\nOverall:  Gugure! Kokkuri-san is a great show that people of many ages can enjoy.  The humor is not too raunchy for kids, while not too childish for adults.  If you are a person who enjoys stories, then this might not be the one for you, but if you enjoy good overall comedy mixed with interesting characters, then I recommend picking this up and giving it a go.    If not, then at the very least, watch episode 10.  Beautiful episode.  \\n",
            "date": "2014-12-21T07:44:00+00:00",
            "helpful_count": 11,
            "mal_id": 173445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=173445"
        },
        {
            "content": "Barakamon has left an empty hole in my heart. After watching the first episode of Gugure! Kokkuri-san I felt like I might have found something similar, yet much better. How disappointed I was. There isn't really a central plotline there to speak of. The attempts at character development are pathetic. Humor is mediocre.\r\nOverall...meh...if you have nothing to do, give it a shot, otherwise, go watch barakamon. I liked it a lot more.",
            "date": "2014-12-23T12:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 173827,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4070723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Geanie",
                "username": "Geanie"
            },
            "url": "https://myanimelist.net/reviews.php?id=173827"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nPeople in society often believe in a wide range of \"things:\" religion, luck, and destiny are some of the first to come to mind. Some believe what they do to find comfort while others use it as a means to explain the impossible. Another common belief includes beings of the supernatural variety. In other words, ghosts. Spirits that are caught between the land of the living and the dead, forced to perform some duty before passing on completely. While such creatures are typically associated with horror, that isn't always the case. And Gugure! Kokkuri-san aims to make sucha statement a truthful one.\\n\\n\r\nSTORY\\n\\n\r\nThe tale begins one day when Kohina, a young girl, begins to play a game of \"Kokkuri-san.\" Surprisingly, the game works, summoning the fox-like spirit. When he sees the little girl's living habits, he decides to stay and help her on a daily basis.\\n\\n\r\nThe meat of the anime is strictly comedy. Its focus is on making the audience laugh at nearly all times. It relies mostly on visual gags, referential humor, and character quirks to achieve the intended effect. It's usually able to balance each of these aspects nicely enough, making the jokes feel varied despite them using the same tactics over and over. Kohina's doll persona has a shocking amount of uses, watching Inugami receive abuse never got old, and throwbacks to famous movies and shows were duly noted. At the same time, the show adopts an episodic format that actually contains a good amount of crossover. A scenario at the beginning of the episode may find relevance later on, or anywhere in between, rewarding the viewer who is paying a bit more attention to these more dialogue-dependent jokes.\\n\\n\r\nEarlier, the term \"nearly\" was used to describe Gugure's focus. \"Nearly\" because it also sets its sights on two separate themes that are not as executed as nicely as the comedy itself: the idea of simply enjoying what life as to offer and the difficulties of isolation. The former derives from not only the final episode, but much of what goes on leading up to it. Life isn't about what was or can be, but about enjoying what happens now. People come and go, and not everything is going to be jubilant at all times, but as long as you relish the moment for what it is, there really isn't anything more to wish. Now, due to the ridiculous nature of the comedy, the message isn't as defined. It's easy to enjoy life when fantastical things are happening within it: having an evil ghost buddy, having an alien for a classmate, and following a boy-turned-girl fox spirit around town. The luxury of having the enjoyment come to you as opposed to seeking it is prevalent within Gugure, but the latter is a stronger idea overall.\\n\\n\r\nThe second motif is centered around the idea of isolation, what it harbors, and how to fix it. Many of the characters, and more specifically Kohina, have an affinity for being lonely. Their backgrounds provide where such dependencies come from, and at times, it seems to take itself seriously. These moments, though, are quick to be forgotten with another gag or joke to take its place. The show has this weird attachment to wanting us to care more deeply for Kohina and the rest, but then uses them shortly after for another laugh rather than reflecting on the idea presented. This is fine, since the comedy is the focus, but then such \"emotional\" moments lose their impact.\\n\\n\r\nANIMATION\\n\\n\r\nThe art within Gugure is rather simple in nature. Much of what occurs takes place within Kohina's abode, but the group does visit other locations. Forests, the city, and the school are frequented, but they're more just there as okay scenery rather than something to be marveled at.\\n\\n\r\nThe character designs are better. All of the characters have their \"real\" persona and their \"character\" persona. For example, Inugami looks like a normal human but can transform into a small, purple puppy. Even Kohina maintains both sides, with the regular form barely making itself known over the course of the anime. Either way, all of the designs are either cute when they need to be, or distinct enough to make the characters known for what they are. Kokkuri's bell, Kohina's rectangular eyes, and Shigaraki's sake holder are all traits they maintain from beginning to end, and are nice details that the art is usually lacking.\\n\\n\r\nThe actual animation is typically average at best. Being a comedy, it uses the lesser amount of animation to its advantage to make movements seem more hysterical. Still, it can pull through during certain bits, such as Kohina attempting to take a scolding from Kokkuri. It doesn't happen a lot, but the anime does what it can with the animation it was given.\\n\\n\r\nCHARACTERS\\n\\n\r\nGugure relies on the characters to deliver the comedy. They mostly stick to their shticks to do so, with some performing better overall than others.\\n\\n\r\nShigaraki is an older gentleman who finds himself living with Kohina later than the rest. Usually scrapped for cash, he is often found drinking away without a care in the world. But deep down, he has more sympathy for others when compared to the entire cast. Willing to help his fellow spirits and Kohina, despite his relaxed nature, makes him the rock of the group. Sadly, he is perhaps the weakest character because of it. Being the silent watcher causes him to be the least memorable, and subsequently the least funny.\\n\\n\r\nWith his name in the title, Kokkuri plays a large part within the anime for every episode. A clean freak, emotional, and unable to handle stressful situations, many laughs are had at the expense of his well-being. To him, Kohina's health comes first before anything else. He isn't afraid to go above and beyond normal reactions to situations, often deferring to violence or stalker-like tendencies. While he may hate dealing with the troubles that his housemates bring, there is no denying that he cherishes the fact that these new people in his life have made the present more fun than ever before.\\n\\n\r\nInugami is easily the strangest of the bunch. His adoration for Kohina is almost unbelievable, but he maintains a rather calm demeanor when she is not present. Being able to switch genders at will, she doesn't have any qualms with becoming the type of person that Kohina wants. Like dogs in general, he is willing to trust others to a fault. Before being included in the group, she was unsure of the kindness of people in the world. Now, he is fully aware of the good that the world can bring.\\n\\n\r\nThe star, the funniest, and the best of the cast is, not surprisingly, Kohina. In love with cup noodles, she often acts like a doll as an ingrained defense mechanism. She has difficulty smiling, but not so much difficulty in getting others to do the same. Even though she behaves in an unorthodox manner, she's the only human within the group. Her ability to attract supernatural beings is evident, as is her adorable way of speaking. All of her time alone may have caused her to become quite distant, but in time, Shigaraki, Inugami, and Kokkuri should be able to get her back on the right track.\\n\\n\r\nWhat's interesting with the cast is that everyone involved, even the side characters, have an obsession of some kind. Some are more obvious than others: Shigaraki loves women, Kokkuri loves to protect Kohina. Some are more subtle simply because we don't see them much: Kureha loves her beloved, Jimeko loves having friends. For the most part, the fascinations the characters have provide the setting for the comedy to unfold. At the same time, however, it gives a look at what it means to love something to death so dearly. In this case, the portrayal is that having an obsession is okay, as long as it doesn't bring harm to oneself or anyone. Inugami's can be seen as detrimental, while Kohina's is fine as long as she is supplementing herself elsewhere.\\n\\n\r\nSOUND\\n\\n\r\nThe OP is really funky. The beginning part utilizes both singing and regular speaking parts to give a hilarious mix that perfectly fits with the anime itself. The half-way part is whimsical, with the last portion continuing that sweet disco feel.\\n\\n\r\nAs for the ED, it is oddly sad. The soft piano playing and simple singing give it a relaxing feel that helps to calm the viewer down from what happened during the episode itself. The bells and ending double-vocals end the piece on a happier note, giving the song more power than it really deserves to have.\\n\\n\r\nThe soundtrack contains quick and fun tracks, and more serene ones to fit the situation. One track in particular, the acoustic guitar playing with the vocalist \"singing\" with it is very catchy and fun to hear.\\n\\n\r\nThe voice-acting sees above-average performances all around, with Kohina taking the lead. Ryou Hirohashi does a wonderful job as the lovable, doll-like girl. A special shout-out to the narrator for also doing a good job of contributing to the comedy.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis one actually got me to laugh for every episode. I wasn't laughing at every single moment, only usually when Kohina and Inugami were on-screen acting like their typical selves. Kohina especially is able to be the right amount of cute, mean, hilarious, and real all at the same time in order to get the laughs out of the audience.\\n\\n\r\nBut there is someone I liked even more than Kohina. And that was Jimeko. She only truly has the fifth episode showcasing her, but I loved her by the end of it. It may just be my inner-\"moe\" coming through, but her tiny arc was adorable beyond measure. It therefore made me sad to witness that she was almost never included again within the show.\\n\\n\r\nAs it is, Gugure! Kokkuri-san is an above average comedy with great music and a funny cast of characters. It may seem wacky, but Kohina and the gang provide a fun little show worthy of your time.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, pure comedy, thematically lost\\n\\n\r\nAnimation: Fine, okay art, good character designs, average actual animation\\n\\n\r\nCharacters: Fine, Kohina, Kokkuri, Inugami, and Shigaraki are funny and obsessed\\n\\n\r\nSound: Great, good OP, good ED, good soundtrack, good VA work\\n\\n\r\nEnjoyment: Fine, needed more Jimeko\\n\\n\r\nFinal Score: 6/10",
            "date": "2014-12-28T12:26:00+00:00",
            "helpful_count": 9,
            "mal_id": 174835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=174835"
        },
        {
            "content": "The story started really well I'd say the very first episodes gave me promises what is it gonna be about. It's seems that our characters intentions comes from their past were the two main character deeply related. It promises to find out why is Kohina pretends to be a doll, and why Kokkuri-san wants to help her(only have a suggestion, that Kohina is reincarnation or descendant of someone who Kokkuri-san knew once). However the as the episodes goes on we won't go any further on their relation significantly. Instead of it, we'll know other 5-6 characters whose past are barely told in 1-1episode, there isn'treally more time anyway for them, since the anime have 12episodes.\\n\\n\r\nThe art is fair, the colors are lively and some pattern on clothes are interesting but nothing more impressive regarding how new the anime is.\\n\\n\r\nAbout sound they fit well the situations, they don't push too much but keep it tense enough when it's needed.\\n\\n\r\nAbout characters, we've got a not perfect-gentle and pretty stubborn \"Sebastian Michaelis\" renamed as Inugami, the typical pervert and little tricky (elder) Shigaraki, the doll who seems to search for way how not to be lonely Kohina, and the most \"balanced\" character who's trying to keep everything tidy and organized Kokkuri-san (who could be the deepest character with Kohina).\\n\\n\r\nAbout enjoyment... the anime have some cliche from bleeding nose during \"interesting moments\", to kick someone high and make a shiny star of it. The anime is (trying) to joke a lot about being pedophile... or about being pervert... sometimes the ghost \"dies\" and you can see something come out of it... a ghost in the ghost? Sometimes it doesn't makes much sense, yet there are some really interesting situations where fun is granted to even cold-hearted people, the question is if it fits your sense of humor, if you wanna know the end (for now it could be continued) and if you have a need for deep storyline and character development (where the anime is somewhat poor if it won't be continued). \\n\\n\r\nYet it's an interesting anime, if you have a hunger for a fair comedy you don't need to look any further.",
            "date": "2015-01-07T18:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 176737,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3909533.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kaname94",
                "username": "Kaname94"
            },
            "url": "https://myanimelist.net/reviews.php?id=176737"
        },
        {
            "content": "\"Humans are ephemeral.\r\n... die in an instant.\r\nIt would be painful to lose someone again. Our lives are moving very slowly to share with humans but are very long to live them alone ...\r\nI wish ... that things stay like this forever. \" - Kokkuri-san\r\nI was gonna put an 8 but the last episode made me change my mind it's a nine or a ten. The last 5 minutes were so simple but oh my god the feels , i cried like a little bitch okay let's begin. \r\nStory : 8\r\nOkay it's not an outstanding story , it's so simple with an original comedy ,satire and parodies without ecchi or shitty comedies nowadays , it's even criticising the japanese old thinking..\\n\\n\r\nArt 9 : nothing to say very good\\n\\n\r\nSound 10 : Perfect and fit so much with the scenes.\\n\\n\r\nCharacter 10 : here comes the good point , you will love every character in this fucking series , yes you won't believe me if you haven't finished the anime ,  at first you won't like some characters like inugami but then I remember at episode 9 I became a fucking fan of this ghost dog\\n\\n\r\nEnjoyment 10 : this series made my mondays better , I used to hate mondays like everybody but this anime changed the fact ( it's finished now fuck :( ) \\n\\n\r\nOverall 9 : I recommand this series very much but I don't guarantee that you will like it like I did but watch it it's worth your time :D",
            "date": "2014-12-29T15:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 175079,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4077725.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animelover110499",
                "username": "animelover110499"
            },
            "url": "https://myanimelist.net/reviews.php?id=175079"
        },
        {
            "content": "This is my first review ever so I apologize if it isn't very good.\r\nWhen I started watching Gugure! Kokkuri-san, I wasn't very sure what to expect but it was a very pleasant surprise!\r\nPlot-wise I was rather disappointed, I believe they should have showed more about Kokkuri-san and Kohina's since Kokkuri-san apparently knew her and I wanted to see Kohina act a little bit more human.\r\nThe characters are lovable specially Kokkuri-san. I think Inugami's obsession with Kohina was a bit too exaggerated, they're a real stalker but if you have patience you can understand why they act the way they do. Shigaraki was a surprise, Ididn't like him very much but deep down he's very caring, he just needs to tone down on the drinks and being pervy.\\n\\n\r\nThe opening song is super catchy! Enough said!\\n\\n\r\nOverall it was a good anime, I enjoyed it a lot. It was heartwarming yet funny. I hope a new season comes out to explain and reveal more plot, since it feels very incomplete.",
            "date": "2016-08-26T17:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 227674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5651180.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Another_Nobody",
                "username": "Another_Nobody"
            },
            "url": "https://myanimelist.net/reviews.php?id=227674"
        },
        {
            "content": "Gugure! Kokkuri-san revolves around Kohina, a little girl who believes that she is a doll. Along with Inugami (a dog spirit that can transform into both a woman and a male), Kokkuri-san (a fox spirit that looks A LOT like Tomoe from Kamisama Hajimemashita), and Shigaraki (a perverted weirdo), the four of them go on numerous, hilarious adventures. \r\nThe story (5/10):\r\nThe anime doesn't seem to have a plot at all, and it barely shows any progress. However! It does not deserve anything lower than a 5 because it's comical. This anime, unlike many others that also don't have a storyline, made sure that the charactersand events were humorous enough to keep the audience watching. I kid you not, I was laughing like an idiot the entire time. This anime truly was a breath of fresh air.\\n\\n\r\nThe art (8/10):\\n\\n\r\nWas the art drop-dead gorgeous? No, not really. But it was nice...nice enough for one to not feel turned off. So why does this anime get such a high score when it comes to art? Well, I must admit, I'm being a bit biased. I came to see this anime with the hopes that it would be a bit similar to Kamisama Hajimemashita. Tomoe's doppelgänger lured me in. \\n\\n\r\nThe sound (8/10):\\n\\n\r\nI think that the voice actors did a wonderful job! Their voices further developed the characters.\\n\\n\r\nThe character (9/10):\\n\\n\r\nI think I fell in love with the characters. I don't know how or why this happened, considering that the main character's a weird child who's obsessed with Cup Ramen, Inugami is both a woman and man, making me sexually confused, and Shigaraki is a man who'd sleep with anything that has a vijay-jay, but somehow I've fallen for these characters. Dammit.\\n\\n\r\nOverall (8/10):\\n\\n\r\nOnce again, I enjoyed this anime because it was different from what I usually see. It wasn't excellent or outstandingly amazing, and I definitely wouldn't KILL to recommend it to anyone, but that doesn't mean that I didn't enjoy it. I would recommend it to those who want a laugh or something that isn't as deep.",
            "date": "2015-06-23T16:18:00+00:00",
            "helpful_count": 7,
            "mal_id": 191060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Grapesandraisin",
                "username": "Grapesandraisin"
            },
            "url": "https://myanimelist.net/reviews.php?id=191060"
        },
        {
            "content": "Gugure! Kokkuri-san is an anime that blends good innocent humor with a very serious and morale tone. At first the characters seem very flat and cliché, but most characters experience an event that shows their good sides. For example take the Tanooki, he acts like your average drunk pervert, but there is a couple points in which you see his caring side and doing what he feels best for those around him. This series has a very fresh style of humor in which they use gender-bending occasionally and innocent humor which we have seen before with twists. In general the anime is a light-hearted comedymixed with serious tones and the paranormal.",
            "date": "2014-12-21T13:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 173477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3672067.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wolfkyle",
                "username": "wolfkyle"
            },
            "url": "https://myanimelist.net/reviews.php?id=173477"
        },
        {
            "content": "Gugure! Kokkuri-san! is one of those episodic slice-of-life anime that will hook you up in the beginning of the series but tends to become boring when the same  slapstick comedy is repeated. Overall, the show has some good points and touching episodes and some fail to amuse you.\r\nStory- 5\r\nThe story is fairly simple. Kohina, the young neglected main character living alone without adult supervision, calls upon a fox ghost, Kukkuri-san. The fox ghost decides to haunt Kohina after seeing her bad living habits of eating of eating cup ramen daily. However, instead of haunting Kokkuri takes after her which he figuratively becomes a housemother-guardian of Kohina. Other spirits and ghosts decided to haunt the girl. The anime is just about the daily life of Kohina, Kukkuri-san and the other spirits haunting the girl. \\n\\n\r\nDespite the simple setting and plot, there are instances where a themes of family and friendship is highlighted. While spirits and ghost are deemed frightening in nature, they in turn are viewed in a humorous perspective. Especially the older spirits, despite being called 'perverts' or 'stalker', become attached to Kohina and become a role model and protective of her.  Instances like this makes a simple anime good, as one can appreciate small gestures yet still remains big and symbolic. \\n\\n\r\nArt-7\\n\r\nJust like the plot, the art is also simple. There might have been instances where the art was remarkable but I personally didn't recognized it. However, the characters did appear cute and the OP and ED were visually eye-catching. This would've been marked 6 but since the animal forms of the spirits looked cute I moved it up.\\n\\n\r\nSound-8\\n\r\nThe soundtrack was nice. The catchy OP makes me want to \"kemo kemo kemo!\", normally I would skip over the OP but the upbeat and disco feel of the song makes it surprisingly bearable.\\n\\n\r\nCharacter-7\\n\r\nThere were characters that I found absolutely annoying *coughs* the dog. But there are some characters that appear to have a surprisingly good nature despite being unreliable and lazy. The spirits that come to haunt Kohina tend to acquire likeable characteristics.\\n\\n\r\nEnjoyment-7\\n\r\nThe initial episodes were very enjoyable while in the middle of the series the anime was pretty bland but the ending left me with mixed feelings. I would say that atleast watch the 5 first episodes and watch the last episode to fully appreciate this simple anime. Although the final episode may leave some irritated, like me, but this is overthrown by looking at the anime in a wider perspective and just simply accepting it. Although the plot remains relatively fair, the themes of friendship and family is definitely present. \\n\\n\r\nOverall- 7.2\\n",
            "date": "2015-04-19T15:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 185976,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4233679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/liqkue",
                "username": "liqkue"
            },
            "url": "https://myanimelist.net/reviews.php?id=185976"
        },
        {
            "content": "It is a great way to waste your time waiting for new anime episode. Though the story has a lot of holes in it, it is still enjoyable. It is a refreshing way to start off your day and will make you wanting more and more information about each characters. I would given it more than a 7 if it had given us more explanation to certain things, but it what it is. I have never seen a heroine's personality like that so it is very surprising. At first you might be unsure of this anime but I would recommend you watching it if youare bored, and having nothing else to do but wait for airing anime's new episode.",
            "date": "2015-01-01T15:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 175611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1870444.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/wolfpackkn",
                "username": "wolfpackkn"
            },
            "url": "https://myanimelist.net/reviews.php?id=175611"
        }
    ],
    [
        {
            "content": "So, I’m writing this after literally just finishing the final episode about 10 minutes ago and I currently have many emotions running through me after ending the season, what better time to write a review right?! \r\nI picked this up after having been on a moody, macabre, drama anime binge. I was in need of something to...”pick me up” shall we say? I’m just so glad I stumbled across Gugure! Kokkuri-San. I’ll be honest, it isn’t my normal genre to watch e.g. comedy/slice of life etc but it has been a massive eye-opener for me to try more comedic animes, I’ve come away feeling satisfied,content and keep finding myself giggling whilst remembering it. Plus, I won’t lie that the Tomoe (Kamisama Hajimemashita) look alike drew me in too!\\n\r\nI started watching this without reading much about it and without knowing fully that it was a comedy, so initially I was like “WHAT IS GOING ON?!” in the first episode but DAMN the characters grow on you SO quickly and are SO loveable that it’s hard not to laugh to yourself and just go with the flow. There isn’t MUCH in the way of character development; I’d recommend looking elsewhere if you’re after something with a detailed, structured plot and CD. This is really just the daily workings and circumstances of a bunch of quirky, weirdos thrown together under one roof to form a VERY disjointed ‘family’. What I loved was that, although the main bishies have all the makings to be standard characters types, they each have enough unique, quirky traits to make them all very individual and refreshing to watch. I just love watching their interactions with one another and Kohina. This makes this anime very interesting even though there is no strict plot. I personally, never got bored and found myself always wondering what would happen next. Kohina herself is just hilarious. I found myself blurting out coffee whenever she said anything because it’s so blunt and painfully realistic. Maybe a bad thing but I found some of the things she said WAY too relatable aha. \\n\\n\r\nThe ONLY reason I have rated this as a 9 instead of a 10 is because I found myself just craving the TINIEST bit of character development, I finished the season worrying about fictional characters and if they’d all be okay ha, what?! I ended up feeling so bad for Inugami by the end that I wanted to just dive into my screen and cuddle him and make him coffee...\\n\\n\r\nAh I’m a bit of a sucker for inspiring background music. There was some really beautiful music hidden within Kokkuri-San. The ED too is just lovely. I think we can all agree that you’ll either want to shake your butt round the house to the OP or plug your ears and scream until it’s over. I guess it’s like marmite; you’ll love it or hate it.\\n\\n\r\nTo put it bluntly, I just really enjoyed this anime. I really can truthfully say that I laughed, I cried and I really gave a damn about it. I enjoyed watching every episode and it was a pick me up that I needed. I would recommend it to folks who just want something light, that they don’t have to think about and that’ll make them laugh and feel good.\\n\\n\r\nI really hope there will be a second season!\\n",
            "date": "2016-10-06T05:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 231197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5663082.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CharliLou",
                "username": "CharliLou"
            },
            "url": "https://myanimelist.net/reviews.php?id=231197"
        },
        {
            "content": "this anime is truly unique and genuine , the main reason why i love this anime is  based from this anime point of view there's must be someone really need your existence even we are not really sociable person.The way kokkuri took care of Kohina prohibiting Kohina from eating junk food everyday.  overall this anime is not only funny but its relaxing and pleasuring in good way :)",
            "date": "2015-09-14T06:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 198577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4872790.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PablOtaku",
                "username": "PablOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=198577"
        },
        {
            "content": "I didn't know exactly what I was getting into when I first starting watching this anime, honestly a friend just sent me the link and said, \"Here, watch this, it's great!\" and he wasn't lying, it really was great! I thoroughly enjoyed it till the very end. It had ups, it had downs, it had \"what in the world, did that really just happen?\" moments.\r\nStory: 7\r\nThe story of this show was decent. It didn't have a plot, the characters didn't really have anything they were working towards and it could have honestly lead in many different directions. Though the story took a more casual approachto it, introduced loveable characters and gave them all a nice little personality that conflicted or complimented.\\n\\n\r\nArt: 7\\n\r\nThe artstyle of the show varied, depending on situation. Personally, I didn't like the design for one of the characters. I felt like they made his limbs a bit long and stick like and his head was a bit on the large side. He just didn't have the same volume or physique as the other characters did. He was a giant stick man and I don't entirely enjoy that in my characters.\\n\\n\r\nSound:  6\\n\r\nI didn't entirely enjoy the opening song of this, I won't say it wasn't good because in its own way, it was good; It fit the series, set a nice tone for it, and didn't really give away all that much about the show by showing clips that could potentially be in it. Though I will give it to the ending song. It was a very beautiful song, very calm but a bit upbeat.\\n\\n\r\nCharacter: 9\\n\r\nI love the characters of this show. They ll have so much personality, and they're just so quirky. Individual needs and wants are all laid out flat before us, some have a little less personality while some have a bunch of flare to them, you almost always know how they'll react to the situation  at hand. It makes me happy to see how well thought out the characters were.\\n\\n\r\nOverall: 8\\n\r\nit was a really fun little anime. Love the characters, even picked myself out a certain character to love the most from it! I'm pretty sure you'll enjoy it if you want some light hearted comedy and aren't expecting to completely die of laughter.",
            "date": "2016-01-15T09:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 208577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5086265.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cat-In-Spanish",
                "username": "Cat-In-Spanish"
            },
            "url": "https://myanimelist.net/reviews.php?id=208577"
        },
        {
            "content": "[English and Spanish review]\r\n[English]\r\nWhy should you watch Kokkuri-san?\r\nBecause you will laugh until your stomach hurts. This is a pretty particular show, with absurd humor and the most weird characters. No main story at all, just a sucession of ridiculous events that go between mithological japanese characters, aliens (literally) and inevitable japanese kinky jokes.\r\nBut don't get the wrong idea, I think the characters are awesome! unforgettable! It is totally worth to see it, specially if you want to enjoy your free time.\r\nThough the art is not specially striking, the character design, specially Kohina's, which changes according to the moment, is very intriguing! This is not ashallow show at all! \\n\\n\r\nWhy do I love it?\\n\r\nBecause it makes me laugh so much! I like most of the characters and I enjoy the not-story. I think ridiculousness can be confused some times with a big imagination and an open mind. I prefer to think this is a high imaginative with a wide open vision anime. Plus, Kokkuri-san's fox shape is adorable! And I love Kohina's attitude. She is a real girl. \\n\\n\r\n[Spanish]\\n\\n\r\nPor qué hay que ver Kokkuri-san?\\n\r\nPorque te vas a reír hasta que te duela el estómago. Esta es una serie bastante particular, con un humor absurdo y los personajes más raros. Sin una historia principal, solo hay una sucesión de eventos ridículos que va entre los personajes mitológicos japoneses, aliens (literalmente) y las inevitables bromas sexuales japonesas. \\n\r\nPero no me malentiendan, creo que los personajes son geniales! inolvidables! Vale la pena verlo, totalmente, especialmente si quieres disfrutar tu tiempo libre. Si bien el arte no es especialmente llamativo, el diseño de los personajes, especialmente el de Kohina, que cambia de acuerdo a la situación, es muy intrigante! Esta no es una serie superficial, de ninguna manera!\\n\\n\r\nPor qué me encanta?\\n\r\nPorque me hace reír tanto! Me gustan la mayoría de los personajes y disfruto la no-historia. Creo que la ridiculez puede ser a veces confundida con una gran imaginación y una mente abierta. Prefiero pensar que este es un animé altamente imaginativo y con una mentalidad amplia y abierta. Además, la forma de zorro de Kokkuri-san es adorable! Y me encanta la actitud de Kohina. Ella es una chica de verdad.\\n",
            "date": "2015-08-28T06:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 197287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4802092.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Pilar_S",
                "username": "Pilar_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=197287"
        },
        {
            "content": "This series was, to be completely honest, my favorite anime ever. True, it doesn't develop most of the key points fundamental to a serious anime, but, as you may have noted, this is not a serious anime. This is one filled with the everyday random antics of wacky characters. I was laughing so hard that my family may have thought I was having trouble breathing. I kind of was.\r\nThere's not really much of a story, so I made my rating based on the concept rather than that, as story could translate to the same meaning as the synopsis of the fox spirit getting worried aboutthe little girl and taking care of her. The general summary of it is something part \"awww\" and part \"who even has the kind of creative mind to come up with something as randomly genius but still logical in a crazy way as this?\" So I think it's pretty imaginative.\\n\\n\r\nThe art and sound are average, nothing exceptional, but it was just fine and it fit. Often Kohina is drawn in a robot/doll-like fashion, but that matches her personality very well and the realistic version of her is used appropriately at the few emotional moments that call for it. The opening theme is very cute and catchy but the background music isn't something I would like to listen to in any case except for in the show. It fits there and adds to the mood but on it's own is mediocre.\\n\\n\r\nThe characters are a little flat, with the exception of Kokkuri-san himself, their backgrounds either sounded a bit interesting but hardly went into any detail at all (as in the case of Inugami and the Tanuki) or were hardly asked about and never answered or explained (such as why Kohina lives alone or what her parents did) and only Kohina and Kokkuri-san experienced any character developement, but all the characters had their own goal or set of desires and contributed to the humor trying to achieve them.\\n\\n\r\nNow, the main reason I loved this show was, undoubtedly, the comedy, as it IS the main feature. Every scene had me laughing like a maniac, as stated previously, and all of the crazy situations the characters got into were funny by themselves, adding on the taken opportunities to pack on additional humor, every time I was almost over Laughing, a new joke comes hurtling towards me again and hits me in the funny bone before I have a chance to recover.\\n\\n\r\nOverall, great fun to watch, hardly any seriousness at all, but enough emotional moments to get you worried about the characters and keep going to the end.",
            "date": "2015-09-13T22:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 198547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4797875.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Zyrak_the_Fated",
                "username": "Zyrak_the_Fated"
            },
            "url": "https://myanimelist.net/reviews.php?id=198547"
        },
        {
            "content": "Gugure Kokkuri-san is a great comedy anime from the autaum season of 2014, with it being the show I had the most fun watching throughout the season.\r\nStory and Characters\r\nFor the most part Gugure Kokkuri-san is episodic, and often has multiple stories told in one episode rather than having one story take up a whole 20 minutes of screentime. This is most likley becuase it is based on a 4 panel manga. The stories told are very well done and are great fun to watch, having many refrences to different things throughout, and in general having stories that are quite original, and even when they arenot, it's more likley that it is poking fun of what it is copying, instead of just outright ripping it off.\\n\\n\r\nThe show's cast is what gives life to this show, if these characters were not nearly as fun to watch this show would be nowhere near as good as it is. kohina Ichimatsu is an adorable character, from her obsession with cup noodles to the way she acts like a doll, she is great fun to watch. Kokkuri-san is also hilarious, being very overprotective of Kohina and how she lives her life. Inugami is probably my least favourite out of the 4 main characters, but this does not mean that I enjoy watching him, but his obsesion with Kohina is somewhat creepy, and while it's kind of funny at first, it gets old quite fast. Thankfully they come up with some more original jokes centered around him later in the series though. Shigaraki is the shows pervert character and I actually really enjoy watching him, he is the one that has some of the more serious moments in the show, and I think those moments are done reasonably well. The side characters don't really appear all that much, theres the tsundere Jimeko, the alien, yamamoto, who appears every once and a while to make a E.T reference, Tengu the pedophile, and that's about it. They are enjoyable to watch during what little screentime they get. \\n\\n\r\nStory - 7\\n\r\nCharacters - 8\\n\\n\r\nThe shows animation is quite basic, characters don't move all that often and when they do they often it's a character sliding across the screen. The animation never really gets that complex or impressive, since this show does not really need mindblowing animation, overall what TMS Enterainment has given us with this series in terms of animation is nothing spectacular, but it is servicable, the art on the other hand is quite good, with interesting character designs, and very pretty looking backgrounds.\\n\\n\r\nThe shows soundtrack is servicable but nothing amazing, with the opening and ending of course being the exeption, the intro is up-beat, catchy, and great to listen to at the begining of each episode, the ending song is also nice, but no where as good a the opening. Voice acting is great, with Kohina's acting captuing how she acts like a emotionless doll perfectly, and the rest of the voice cast doing what the needed to do very well. \\n\\n\r\nAnimation and Art - 6\\n\r\nSound - 7\\n\\n\r\nOverall\\n\\n\r\nThis series is great fun begining to end, and is a very worthwhile watch, with a great sense of humour, a lovable cast that is intereting and give some hilarious jokes. The show is does have it's problems, with the story being simple,  somewhat lackluster animation,  and sometimes the series does not really know if it wants to be a bit more serious or not, but I still think that it is worth watching, and you can watch it for free on Crunchyroll too, so it is easily available too.\\n\\n\r\nEnjoyment - 8\\n\r\nOverall - 7\\n",
            "date": "2014-12-22T07:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 173621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrSonicFan34",
                "username": "MrSonicFan34"
            },
            "url": "https://myanimelist.net/reviews.php?id=173621"
        },
        {
            "content": "I have never laughed so hard watching an anime in my life. Oh my gosh the creators did an amazing job with the humor in this anime. There wasn't a single dull moment in this show, or a moment where I didn't find myself holding my stomach from laughing so hard. It was definitely time well spent and this was one of the few anime that makes me want to come back to it one day.\r\nThere isn't a set plot in the anime, as something different happens in each episode that doesn't correlate with what happened in the last - except the addition of newcharacters. Each episode is special in its own way which really makes this short series different from what I'm used to. The extreme randomness of whatever was going on really made the show a lot funnier than you'd expect. \\n\\n\r\nThe art was adorable and really well done. I enjoyed all the colors that were displayed. They really gave off a feel-good and silly environment which is exactly what the show is about.\\n\\n\r\nWhile on the topic of the environment of the show, the music also did an amazing job with fitting in. That theme song! Oh my gosh, it was so cute! This was one of the few theme songs I didn't dare to skip because I enjoyed it so freaking much! \\n\\n\r\nCharacter interaction was what really made the show as good as it is. Between Kohina's poker-face humor and Kokkuri-san's bubbly personality along with his small rivalries with the other characters, I couldn't get enough of it! There aren't that many characters in the show, so character development was a great quality this show contained.\\n\\n\r\nIf you're having a bad day (or even a good day) I strongly suggest this anime. The adorable characters and hilarious jokes will bring a smile to anyone's face.",
            "date": "2017-03-05T19:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 241965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545700.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NalarueAni",
                "username": "NalarueAni"
            },
            "url": "https://myanimelist.net/reviews.php?id=241965"
        },
        {
            "content": "Have you ever wanted to watch an entertaining anime which is neither too provoking nor a complete waste of time? Do you want characters that doesn't require you to invest emotion and effort while not being cringeworthy mindless stereotypes?\r\nGugure Kokkuri -san provides mildly interesting characters with oversimplified backgrounds that are barely mentioned. Each episode is a little slice of life in a household with supernatural oddballs. Yet it manages to be a series of fun filler episodes with short storylines which somehow works in keeping my interest. I finished all the episodes in one sitting without getting tired in between.\r\nStory\r\nThis anime tries its hand atmany genres from genderbending romance to tragedy and even a dab of horror with a cat god who collects grotesque dolls. It breaks the fourth wall periodically and acknowledges the stereotypes and anime settings. This ricochet in differing storytelling might be a little jarring initially but it fits well in the offbeat comedic tone of the show.\\n\\n\r\nSound\\n\r\nThe disco opening theme is unexpectedly catchy, though the ending theme while easy on the ears, was forgettable. The voice acting of the protagonist in particular was decent, for a little girl's voice to sound robotically monotonous without being boring. \\n\\n\r\nArt\\n\r\nThe art style may seem generic for the normally drawn characters, but the chibi doll-wannabe was distinctively cute.\\n\\n\r\nCharacter\\n\r\nThe show gives you little hints and glimpses into the psyche of each main character instead of delving deep into any particular one. Despite little depth in character development, the motley crew of supernatural creatures and one robotic doll wannabe end up forming a family where their bonds can be felt in heart-warming moments peppering the slapstick humour and gags.\\n\\n\r\nOverall\\n\r\nI enjoyed watching this like I enjoy an afternoon lazing around at home. It's not too intense and not too slow. Watch this if you like having mild fun without the emotional commitment.\\n",
            "date": "2016-11-26T11:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 234425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/287345.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eneeli",
                "username": "Eneeli"
            },
            "url": "https://myanimelist.net/reviews.php?id=234425"
        },
        {
            "content": "I am conflicted to describe my experience with Gugure! Kokkuri-san, to be very honest. So I'll start consider aspects of the series with both good and bad discussed together.\r\nPersonally, I liked the characters. I liked the way Kokkuri-san, Kohina, Inugami, and Shigaraki interact with each other. I don't know about everyone else, but for me, I actually found it bearable to watch - they didn't grate my eyes and ears, and even though they tended to not humour me excessively, I think that they were able to leave a bit of presence in their acting. However, I gave it a 6 because only Kokkuri-san andKohina were able to carry their roles properly. Kokkuri-san mixed his wit and sarcasm without any forceful moments and Kohina was just so much fun with her banal and pedestrian voice and her routine of \"being a doll\" (which, by the way, never got old), combined with her wit, her scathing criticism of Kokkuri-san, and her \"charming compliments\" (read as blunt insults) of Shigaraki are well thought out. However, Inugami felt forced with its routine, and Shigaraki - with the sole exception of when he thinks of the greater good of Kohina in one episode - is a pervert. They both come out so one dimensional in my opinion, that it's sad to see the constructs (that is, the non-main characters) deliver a better performance than these two. Personally, I found the best episode in the series to be 1, 9 and 12 - and mind you, its because of Kokkuri-san, Kohina and the episode specific support cast.\\n\\n\r\nThe artwork was nice, to be honest. I felt involved with the chibi moments, and how they had went too and fro in terms of the supernatural elements, and the responses of the characters in this anime. I honestly can't get over the opening sequence of this anime (what kind of dance moves are being played by Kokkuri-san and Kohina before everyone else comes in? And what's up with that arm wheel by the three animal chibis of Kokkuri-san, Inugami and Shigaraki?!), because it was very smooth in the way it flowed. That works in favour of this anime. My opinion of art is the same as my opinion of music - it was well thought out. It truly was well thought out in how they balanced the two to create the experience. Because of the dodgy characters, however, it couldn't be really felt the way it should be. The best examples of when the anime's art and sound matched perfectly with its themes, emotions, and comedic elements, are best seen in episodes 1, 9, and 12. Especially 9 which was hilarious and sad at the same time.\\n\\n\r\nStory wise... It was \"meh\". There are spoilers in this portion so I won't describe the story as is. But I'll say that because of - rather than due to the lack herein - of character stability, I personally found that the story always felt like a juggle and a struggle occurring side by side. When that happens, it is a tragedy rather than a comedy. Here though, it hit a \"meh\" cord because the comedy was there, but it felt moderated rather than natural or forced, and some of the jokes felt too obvious and well known but not executed well (best seen from 4 till 8). Where they are executed well, such as 1,2,9,11, and 12, you do give it credit, but it again feels uneasy and sad at times to go through.\\n\\n\r\nIf you can sit through the whole series and watch it, then it was a good job and you've done well for doing so. But I believe that it was more of an experimental work rather than one of those definitive classics of this modern age of anime. I'll only rewatch it because of episodes 1, 9 and 12; because of the interaction between Kokkuri-san and Kohina (who really were two very well developed characters); and because I liked the supporting characters who were frenzied, but still awesome in their own way. All in all, a \"meh\" anime, honestly: has capacity to be better, but wasn't executed properly.",
            "date": "2015-09-17T13:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 198765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4587700.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/shehrozeameen",
                "username": "shehrozeameen"
            },
            "url": "https://myanimelist.net/reviews.php?id=198765"
        },
        {
            "content": "This is my first review in this site so i will try my best for tell you what i think. First of all i would like to watch the second season of gugure kokkure-san. Why? First we don't know anything about any of those character past. Why inugami can fall in love with kohina? well i know it from the short flashback in anime but i don't know exactly how that dog become inugami. And most of all we don't know about kokkuri-san past except he is neighbors with shigaraki. Second i think the creator of this anime can make the story more interesting. Ifyou already watch gintama you will know about what is just wrote, no plot, no storyline but that anime become masterpiece today. In kokkuri san story, the creator not just add a lot of gags but a short emotional story too, that's what make this anime interesting like gintama in my opinnion. Third i corious about what kokkuri-san said in the end of episode. You know when kokkuri-san pray in the temple then he said \"it would be painfull to say goodbye again\" and suddenly a girl picture appear. When you look at it, that girl look's like kohina but with long hair, do you think it's interesting to know more about this girl? Overall i enjoy the anime and would like the second season appear",
            "date": "2015-01-07T21:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 176769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gu4rd10",
                "username": "gu4rd10"
            },
            "url": "https://myanimelist.net/reviews.php?id=176769"
        },
        {
            "content": "And people were saying Danna Nani was Prime Minister Abe's propaganda effort to have NEETs and otaku go out in the world and reproduce. Kokkuri-san looks like Abe's effort to have the same set of NEETs and otaku take care of children.\r\nThe question needs to be asked: Where is Kohina's parents and why is she all alone in this world. If traditional Japanese folklore are trying to raise her, then something is DEFINITELY wrong with this culture if this is true.\r\nThe show's pretty good; some of the characters turning into mascot dolls threw me off guard, though. It's nice to see Daisuke Ono come along way from being \"part of Kyon's harem.\"",
            "date": "2015-01-06T10:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 176513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=176513"
        },
        {
            "content": "Looking for a good laugh and a chill anime? Then look no further, Gugure! Kokkuri-san is just the show you're looking for.\r\nStory - 6\r\nFrom the synopsis, I'm assuming you have a vague idea of what this show is about, yes? Little girl summons Kokkuri-san, Kokkuri-san decides to stay with said little girl out of pity, another spirit enters the girl's household due to his infatuation for her, and another spirit gets in on the fun too because why not?\r\nThis series takes the concept of \"Kokkuri-san\" and mixes it up with good old comedy. So, what exactly is \"Kokkuri-san\"? It's actually a game in Japan, mostlyplayed by school children, that is similar to the concept of an ouija board, wherein you summon a spirit and you ask them questions, but of course, in \"Kokkuri-san\", you summon, well, Kokkuri-san. \\n\\n\r\nThere isn't really a \"story\" in this show, since it basically just shows how the little girl's life has changed ever since Kokkuri-san decided to stay with her to not let her live off of cup noodles, and giving her a proper diet. What I find cool, however, is how they incorporated the concept of Japanese folktales and mythology into the show.\\n\\n\r\nArt - 7\\n\\n\r\nThe character designs and animation were okay, there wasn't anything spectacular, but it only added to the overall comedy of the show, so it was still a nice touch nonetheless. It also complimented with the vibe of the whole show.\\n\\n\r\nSound - 6\\n\\n\r\nThe OP was catchy, and the OP animation sequence was really happy and set the mood for the anime. I found myself skipping it for the rest of the show, though. The ED was relatively calm in contrast to the OP, and it sounded really heartwarming. I think it fit the show as well, seeing as there are heartwarming moments between Kohina and the 3 spirits. Also, in the ED animation sequence, the characters being shown change regularly. I think that was neat.\\n\\n\r\nCharacter - 8\\n\\n\r\nThe characters were okay. There wasn't much character development since the show mostly focused on the characters' interactions with one another. I really enjoyed watching the characters interact with each other, though! You come to love all the characters as the show goes on too, even if they're as annoying as Inugami.\\n\\n\r\nEnjoyment/Overall - 7\\n\\n\r\nThe show really was funny, mainly because the characters are great. This is a good show to watch when you just want to sit back, relax, and have a good laugh.\\n\\n",
            "date": "2017-04-03T23:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 244561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6151242.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-aochii-",
                "username": "-aochii-"
            },
            "url": "https://myanimelist.net/reviews.php?id=244561"
        },
        {
            "content": "A story centered on a girl named Kohina who inadvertently summon spirits / Creatures Fine named Kokkuri-san (Ghosts lower classes in Japan) who turns out this ghost is a man who is handsome, young and white-haired, Kokkuri-san originally wanted to frighten haunt Kohina scare but after seeing Life Kohina less \"Healthy\", Kokkuri finally decided to Protect and Keep it in a way Haunting\r\nAnime Anime Comedy is like others, do not have a straight story line, just tell the full daily cuteness of the characters and their peculiarities, but .... anime comedy this one takes the theme is quite unique compared to the other examples usuallyoffer theme Anime Comedy School or clubs that filled their activities namu this time we will be something different, namely the Human Daily half a doll (Kohina) and Supernatural spirits who were in Japan (Kokkuri, Tengu, Inugami, et al) who live with a roof ..... , and the supporting characters one Alien and some additional man will appear in episode-specific episodes: v ... it is what makes this anime one is different than the others.\\n\r\nArt is not so bad-bad, decent but not bad, either what you want to say again ane this section, maybe that was it lol: 'D.\\n\r\nPicture\\n\r\n: 'O\\n\r\nCharacter filled by VA is top-notch (well not top-notch as well anyway but they are VA fairly well known) as Daisuke Ono (Sang Voiced Handa in barakamon, Smith Erwin in Shingeki no Kyojin), Takahiro Sakurai who fills Suzaku in Series code Geass, Jouji Nakata voice Kotomine Kirei in Series Fate / Zero, etc.\\n\r\nOpening titled Welcome !! \"DISCO Kemokemoke\" sung by the performers of his own voice, Pretty funny to listen to, well suits the anime i guess, while ending Titled \"This Merry-Go-Round Song\" sung by Atsushi Suemitsu pretty catchy than openingnya.\\n\r\nPicture\\n\r\n: ^)\\n\r\nI must admit, Anime Comedy this one is one of the Anime to make ane laugh these days compared to anime comedy more airing in the previous season although it seemed a little odd and a bit random but that are offered in the \"Gugure! Kokkuri-san\", can be watched if you're looking for Anime Comedy Unique or odd.\\n\r\nHonestly Gugure! Kokkuri-san is an anime that can make ane laugh than other anime anime comedies in recent years, though Gugure! Kokkuri-san seem a little strange and random but anime is still able to make someone laugh.\\n\r\nEven so Gugure! Kokkuri-san is not the best comedy anime that is, there are better out there.",
            "date": "2017-03-08T20:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 242139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=242139"
        },
        {
            "content": "Gugure Kokkuri-san is one of those anime where I love the concept of the show, but certain unnecessary elements kind of make it hard to enjoy. I'll be listing what I enjoy about the show and then what sort of ruins it for me and makes it a 6 instead of the 8 I wanted it to be. \r\nConcept:\r\nWhat I really love about Gugure Kokkuri-san is the fact that it takes this scary concept of Kokkuri-san, wherein Kohina is playing it alone and most certainly shouldn't be, and then introduces you to the humor of the show by having Kokkuri-san appear at the door andhaving Kohina immediately shut it on him and ask the board who the man outside her house is. Everything from there sets up the atmosphere of the show, how it'll go from seeming serious and intense for maybe a minute and then pulling a gag that dispells it and reminds you, quite pleasantly, that it is a comedy that doesn't take itself too seriously.\\n\\n\r\nCharacters:\\n\\n\r\nWhat also really drew me to the show and kept me there were the characters. They're all fun and unique and taking the idea of Kokkuri-san and making them all a quriky odd family was pretty hilarious. I also liked the little peeks of depth into the characters, such as the real reason for Kohina's 'I'm a doll' coping mechanism and why Kokkuri-san actually appeared before Kohina. There's these little bits of real depth to the characters that keeps them from being boring, one-dimensional caricatures. The laughs come from exaggerating and playing with that depth, like poking at Kokkkuri's insecurities or Kohina's childish unawareness of how things are supposed to be or Shigaraki's many flaws. I really appreciate that the anime succeeds on that front. Nothing is more important to me most of the time than characters, because that's really what I hang around for. \\n\\n\r\nStory:\\n\\n\r\nThe anecdotal story telling was also very fun and enjoyable, though if you're not here for the characters, than you probably won't enjoy it, because it's mostly to provide humor by looking into their lives and pulling out different problems they come to deal with.\\n\\n\r\nArt:\\n\\n\r\nThe art is also very nice to look at (that's pretty important to me too, because I can't spend that long staring at something that I don't enjoy looking at), and honestly, that opening theme is something I listened to and watched every episode.\\n\\n\r\nCons:\\n\\n\r\nNow with that all out of the way, here's how I'd make Kokkuri-san an 8 instead of a 6, and why I feel it is that way.\\n\\n\r\nFirst, toss the pedophilia jokes. They're gross and lazy and are the main source of my issues with it. Hard to enjoy what you thought would be a fun twist on a family comedy when you've got pedophilia jokes at every turn.\\n\\n\r\nSecond, maybe make Inugami an actual child, maybe around Kohina's age.\\n\\n\r\nThird, make Gugure Kokkuri-san an actual family comedy with Kokkuri of course as the stressed out housewife/mom, Shigaraki as the deadbeat dad, and Inugami as a second child/the family dog.\\n\\n\r\nWhy? I think Gugure Kokkuri-san would have been a much more enjoyable comedy that way. What's more hilarious than taking the ~scary~ Kokkuri-san concept and turning it into a family comedy? It takes a mundane slice of life genre and makes it fantastical by introducing these strange spirits and the little girl who honestly doesn't seem to notice how bizarre and out there it is. There's so much latent humor just sitting there and waiting to be used that it just feels like a lazy cop-out to resort to pedophilia jokes, like look at the potential:\\n\\n\r\nKokkuri-san and Shigaraki having an exaggerated husband/wife relationship, Inugami going to school with Kohina as a student and displaying doglike characteristics while at the same time being a protective older brother (sibling?), shenanigans occurring with parent-teacher meetings, family vacations, quirky friends--typical slice of life stuff intermixed with the supernatural.\\n\\n\r\nConclusion:\\n\\n\r\nI really think this could have been a much better show, and I am disappointed with the lazy jokes it decided to play with (ex: pedophilia, suicide, homophobia, etc.). However, if you can ignore all that and stick around for the characters, then I'd say it's a pretty fun show to watch otherwise.",
            "date": "2017-03-02T04:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 241719,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jelliheart",
                "username": "jelliheart"
            },
            "url": "https://myanimelist.net/reviews.php?id=241719"
        },
        {
            "content": "Ok, so before i say anything, this anime is almost to comedic to even begin to criticize, so any negative aspects that i could possibly say about this anime probably have no effect on my enjoyment of it. \r\nThis anime is about a young girl named kochina, who believes she is a lifeless doll and as such is fueled off of ramen noodles (wait until you see her collection). She plays the kokkuri\r\ngame and summons an old spirit named kokkuri san, who sticks around because he is worried about her bad eating habits.\r\nThe story is absolutely average-in fact, there almost really isn't one, as itjumps around between events in the life of kochina, which are mostly screw around bullshit (in a positvely humorous way, i will add). I give it a 6 out of 1O because its pretty much what you expect.\\n\\n\r\nThe artwork is pretty simple too, but i do love it because it adds to the bullshit humor in the anime (e.g, kochina's face falling off when she tries to smile. Oh god the lolz, they hurt.) 7 out of 1O.\\n\\n\r\nSound-The theme song is the jazziest most disco ass awesome shit ever and i love it. the outro was fun too but not nearly as infectiously catchy. for that alone, i give it an 8 out of 1O.\\n\\n\r\nFor the most part the characters are just extremely quirky laughable bullshit. Anime, as always, has their extreme fucked up perv which would be inugami, who i eventually just decided i would have to like. Kochina is literally the most awkward yet kawaii motherfucker you will have met outside of clannad afterstory and i think there 15 times where i was in tears from laughter (such as the part where she uppercuts the bitch the flung an eraser at her. ). kokkuri himself is pretty much a maid who cleans up after shigarami's bullshit of whom you meet like 6 or 7 episodes in. who is by the way the greatest drunk ever made.8 out of 1O.\\n\\n\r\nDespite any \"technical flaws\" in the anime it took itself far too seriously for me to even care and in all honesty if you want an anime just for bs humor then this is literally the perfect animqe for you. enjoyment is definetly a 1O but on technical overall i will give it an 8. definetly an awesome comedy for anyone whos into it.\\n\\n\\n\\n",
            "date": "2015-02-09T15:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 180040,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4427807.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thunderbutt123",
                "username": "thunderbutt123"
            },
            "url": "https://myanimelist.net/reviews.php?id=180040"
        },
        {
            "content": "Quick review: Gugure! Kokkuri-san\r\nStarting strong with potential of becoming a Monty Python of anime in terms of hilarity but later devolves into whacky animal slice of life with an occasional cutsie semi-serious episode.\r\nMy thoughts:\r\nIt kept me entertained throughout the whole thing and still remain one of the few shows capable of making me genuinely laugh. The character interactions are absolutely phenomenal. I am ,however, disappointed by all the unused potential of the story and the out-of-place serious(-ish) episodes. Both the sound and art were pretty average but i have to admit that they were cleverly used to enhance comedic effect. \r\nOh and one more thing;this show gave me some intense appetite for instant noodles, so fatties beware! This show WILL appeal to your munchies...\\n\\n\r\nVerdict:\\n\r\na strong recomendation for anyone who is bored and wants to kill some brain-cells for 20mins or so with random crap.",
            "date": "2016-02-27T08:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 211786,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269225.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrFess",
                "username": "MrFess"
            },
            "url": "https://myanimelist.net/reviews.php?id=211786"
        },
        {
            "content": "Kokkuri-san has better jokes than most other comedy anime, because the main heroine is slightly screwed up in the head, and so she sounds like a Zetsubou-sensei character-lite. Recurring gags have interesting variations. Doesn't really end, but just sort of closes without any resolution, which isn't a big issue for a comedy show except that they hint at some greater stuff going on in the background.\r\nDon't think I ever laughed out loud during this, but I think I giggled.\r\nSomething that stuck with me as good was the background art, which was, if I remember, very well painted impressionistic style. Due to the subject matter, ithad a lot of nature shots & temple shots. There was very atmospheric scene in episode 8.\\n\\n\r\nPretty damn fun. Damn good show!",
            "date": "2017-11-27T04:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 264038,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/439808.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/czxcjx",
                "username": "czxcjx"
            },
            "url": "https://myanimelist.net/reviews.php?id=264038"
        },
        {
            "content": "Gugure! Kokkuri-san is an amazing comedy show that mixes comedy in perfect amounts with profound messages about society, friendship and much more. \r\nIt is great for comedy lovers because it achieves the funny atmosphere easily and with originality, without falling in the cheesy jappanese comedy standards that usually involve sexual references and loud characters. In fact, the characters are the true jewel of this show; in spite of focusing on comedy the show takes the effort of developing each of the characters correctly and giving them background and even awesome character development, especially Kokkuri-san who is my personal favourite. Also it is to be praisedhow a funny episode can end with an unexpected serious conclusión that leaves behind a powerful message, and for a comedy oriented show specifically to achieve this is magnificente. \\n\\n\r\nthis show didn´t get a higher rate not because i think it doesn`t deserve it but just because i personally don´t tend to enjoy this genre of anime much, but for anybody who is just intending to have some good enjoyment with amazing characters that make sense and meaning behind the seeming bare entertainment, then this is a great show to get into.",
            "date": "2015-12-27T06:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 206948,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5075054.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kuuderex100",
                "username": "Kuuderex100"
            },
            "url": "https://myanimelist.net/reviews.php?id=206948"
        }
    ]
]