[
    [
        {
            "content": "One of the most annoying things about the anime industry is the seemingly ingrained belief that bandwagons, when jumped upon, have the mystical ability to carry studios into money. It's a sad fact that every season will undoubtedly see the release of one or more shows that clearly attempt to piggyback on the success of something that has gone before. Thankfully following trends isn't necessarily a bad thing, and every so often a series comes along that can be considered a superior example of its genre.\r\nUnfortunately that also means that the majority of titles that do jump on the bandwagon are mediocre at best.\r\nOriginally alight novel series by Sugii Hikaru, Kamisama no Memochou (God's Memo Pad), tells the story of a socially awkward high school student, Fujishima Narumi, and his exploits with the NEET Investigation Firm (apparently \"It's The Only NEET Thing To Do\"). The story begins with a series of text messages that lead to a seemingly unrelated scene in a love hotel involving a school girl, a businessman, a delinquent of some sort, and an attempt at blackmail that ends with an ashtray to the head. Narumi, having recently moved to Tokyo, finds himself geographically challenged to the point where he's in a perfect position to see that same girl jump out of a window.\\n\\n\r\nAfter that things get a bit random.\\n\\n\r\nOne of the major problems with Kamisama no Memochou is that the plot doesn't really have any particular goal or objective. The story is told in a series of short arcs that often have very little direct relation to each other, and while this does tie in to the idea of individual cases at an investigation firm, the lack of any real focus causes the narrative to meander before any conclusion can be reached. In addition to this there's a surprising degree of contrivance apparent in the development of the plot, and while it's true that certain events are necessary to implement the growth of particular characters, it's much more preferable to have such things implied, inferred or even insinuated.\\n\\n\r\nThat said, there are some interesting threads woven into the plot that lay a good foundation upon which the story can be told, and if one is able to ignore the obvious prefabrication in the narrative then there is a degree of entertainment to be found.\\n\\n\r\nWhich brings up the issue of the company that Alice runs.\\n\\n\r\nNEET simply means \"Not in Employment, Education or Training\", which is a roundabout way of saying that a person is not just unemployed, but also has no real intention of finding a job. Given this fact, how can a NEET Investigation Firm exist when the simple act of working means that a person is no longer a NEET? To many folks it may seem like nothing more than splitting hairs, but in actuality it's the most prominent example of the mentality behind the series (more on this in a bit).\\n\\n\r\nBecause Kamisama no Memochou is set in the \"real\" world, there's a degree of mundanity to the artwork that is surprisingly well suited to the series. There's also little in the way of flamboyance where the characters are concerned, but while the design principle seems focused on normality, the series suffers from a certain tired old saw involving beauty and people who aren't very nice. On the plus side, the animation is pretty decent for the majority of the show, and is only really let down by some poorly incorporated CG or the odd repetition of particular sequences (there's one in the first episode - see if you can spot it).\\n\\n\r\nThe series opens with a rather straightforward introduction to the main members of the cast, all to the tune of \"Kawaru Mirai\" by Choucho. On the other hand the main ending theme, \"Asunaro\" by Suzumura Kenichi, is set to a montage that focuses on Alice and Narumi, and features lots of tumbling negative words and rapid fire photos. In addition to this the first episode concludes with a a rather dizzying series of photographs and images against the backdrop of \"Colorado Bulldog\" by Mr. Big (and if you want to know who they are, google it or ask your older siblings or parents). As for the background music, while the tracks on offer are varied and atmospheric that doesn't mean that they're always necessary, and in truth several scenes would be better without any sort of accompaniment.\\n\\n\r\nWhen it comes to storytelling it's often the case that a relatively weak plot will be masked by philosophical or psychological discussions, and that's pretty much what happens here. The script has a tendency to get bogged down in semantics and there seems to be an almost desperate need to expound upon the reasons for every action taken. Thankfully the voice actors are a pretty decent bunch, and while there are occasions where the performances are a little too excitable or overbearing, for the most part each role is handled fairly well.\\n\\n\r\nOne of the more interesting aspects of Kamisama no Memochou is the manner in which the characters interact with each other, especially the contrast between the established relationships and the manner in which Narumi's connections to everyone evolve over the course of the series. Now while this suggests some very good character development, sadly that's not the case as the story follows the old idea that drama leads to growth.\\n\\n\r\nAs the main lead much of the focus tends to fall on Narumi, but aside from certain events that force him to take charge he doesn't actually change very much until the last few episodes. One could argue that his introspective monologues are symptomatic of his evolution, but in truth the conclusions he reaches aren't reflected by any substantial changes in his personality. Right up to the end of the series he remains a figure who seems ill at ease with his role, and this seems like a wasted opportunity to explore what could have been a very interesting character.\\n\\n\r\nThe downside to this is the lack of attention given the rest of the cast, and there are a number of points that remain unanswered come the end of the show. Who is Alice? Why did she start a detective agency? How did the rest of the team gather? Not once does Kamisama no Memochou attempt to address these questions, and worse still, Narumi doesn't even ask them. Apparently his character is content to remain ignorant of things that anyone in his situation would naturally want to know.\\n\\n\r\nWhich neatly brings us back to the mentality behind the series.\\n\\n\r\nIntelligence is a difficult thing to gauge when it comes to stories, and one of the common assumptions is that the reader or audience will be unable to understand the choices, motivations and actions of this or that person. Writers make an effort to counter this, and the usual response is to load the dialogue with lots of big words, philosophy, psychology, psuedo-science, and other highbrow musings. The problem is that they often become so enamoured with their own intelligence that they begin to lose sight of what's important, and elements begin to creep that really don't belong or should have been thought out properly.\\n\\n\r\nIn the case of Kamisama no Memochou this manifests itself not just in the name of the company. One has to question the basic premise of a girl of indeterminate age (but probably around 12 or13 years old), with a mild Dokupe addiction living alone surrounded by high tech equipment. In addition to that one has to wonder why a show about detectives and mysteries would need an episode dedicated to fanservice or baseball.\\n\\n\r\nThis series has the potential to good, if not great, but there are far too many occasions where it takes its cues from titles like Gosick, not the least of which is the inclusion of an eccentric loli detective and her well meaning, yet slightly bumbling \"assistant\". As with many other tales of mystery, there's an element of entertainment that stems mainly from the viewer trying to figure out who, what, why and how, but that's where the magic stops. Although there are occasions where the show is interesting, and sometimes a little charming, these are always overshadowed by one question - who is Alice?. The lack of any explanations about her places a burden on the narrative that remains throughout the series, and while the show tries to mysticise her character from time to time, this is nothing more than an attempt to stop the viewer asking unwanted questions (\"it's magic so it doesn't need an explanation\").\\n\\n\r\nKamisama no Memochou is, at best, an interesting mystery anime, but like so many other shows that are the product of jumping on the bandwagon, it relies too much on the success of titles like Gosick, and too little on what it could have been.",
            "date": "2011-10-28T05:39:00+00:00",
            "helpful_count": 344,
            "mal_id": 46349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=46349"
        },
        {
            "content": "Mod Edit: Review may contain spoilers.\r\n-------------\r\nKamisama no Memochou is more than just a detective anime featuring not-really-NEETs and a loli mastermind. It's an anime that really takes the time and effort to create a realistic yet fantastic world and populate it with some of the most endearing characters in all of anime. The plots of each mystery is engrossing and exciting; the characters are not at all static, growing and changing as the anime moves forward.\r\nWhen it comes to good detective animes, this is about as close to perfection as you'll get.\r\nStory (9/10)\r\nArt (8/10)\r\nSound (9/10)\r\nCharacter (8/10)\r\nEnjoyment (9/10)\r\nThe story of KamiMemo is both cliche as wellas original. The first episode starts off pretty predictably: ordinary high school boy accidentally encounters strange people/event, gets curious and ends up being involved in some way shape or form. Don't let this banal opening discourage you! The rest of the anime picks up the slack and really shows off the depth of this series. The Angel Fix case is truly a climax and arguably one of the most well-done story arcs in anime history.\\n\\n\r\nEven the filler episode is done with a planned beginning, middle, and end, as well as a key plot element that both initiates and resolves the conflict. If that's not good writing, then I don't know what is.\\n\\n\r\nThe anime demonstrates an exceptional grasp of the concept \"detective anime\". \"Detective\" implies that the plot must contain a great deal of mystery, of assumption and deduction that should engage the audience, while \"anime\" means that this is, above all else, a show meant to entertain and impart something valuable to us viewers. KamiMemo balances between these two aspects by focusing more on the \"how\" of the mystery rather than the who, what, when, or where. While the actual truth may not be all that surprising, the process and methods that Alice and her gang employ to uncover the truth gives the anime the atmosphere of being \"on the case\", which makes the anime that much more enjoyable.\\n\\n\r\nKamiMemo doesn't have the best art I've seen, but then again I'm probably being spoiled by Oreimo. The art is very similar in style to TMoSH, which further deepens the similarity between the two anime (explanation in Characters section). Good artwork all around, no derpy, awkward angles, and characters are portrayed both distinctly and realistically. Emotions are very easy to read, and mood is well-portrayed through the colors.\\n\\n\r\nI originally found this anime because Kakenukeru Anison Medley I ended with an extremely long excerpt of Kawaru Mirai. Which happens to be an amazing OP; Choucho sings some of the best OPs out there, along with Kawada and Lia. The rest of the OST is filled with solid music overall. Notable mentions include Teddy, the haunting song played whenever Alice explains the harsh truth.\\n\\n\r\nI don't understand what the emphasis on NEETs where - Alice makes tons of cash from taking her cases. NEET detective is quite the awkward irony. Besides that point, the characters in KamiMemo are very well done - they immediately and easily reach beyond their given roles in the story. For example, Ayaka is supposed to be just a schoolfriend, but ultimately becomes such an integral part of the NEET squad that her tragic fall in the final arc really makes an impact on both the viewers and the characters.\\n\\n\r\nOne of the unique points of the anime is that the protagonist, Narumi, is given the Kyon effect. The Kyon effect is given to a high school boy, either in their first or second year, who is perfectly normal yet manages to attract around him an array of weird and bizarre characters, many of whom are quite gifted or have surreal abilities. Through these people around him, the Kyon-effected boy is given a chance to break out of his normalcy and become something more than what he was before by the merits of his character and the power of his will.\\n\\n\r\nWhile it may sound overused (and it only does because Haruhi is ridiculously overreaching), the Kyon effect is in fact not commonly used because of its delicate nature and the mixed reactions that the community usually gives in return. Narumi plays the role perfectly, becoming a hero in his own right through the course of the anime. Instead of a pathetic character who only knows how to voice snark comments and play the tsukkomi, Narumi pushes himself to his own limits and does everything in his power to protect those he truly cares for.\\n\\n\r\ntl;dr KamiMemo does some seriously incredible things with its characters. I won't even begin to mention just how perfectly amazing Alice is as a beautiful balance between a tsundere 12 year old and a calculated professional detective.\\n\\n\r\nKamiMemo was one of those \"love at first episode\" animes for me. It immediately gained a spot on my Top-10 anime list, and Alice became my 5th favorite character in all of anime. I was honestly impressed by the dynamic nature of basically every character. Even Alice grows and matures through the course of the anime, though remaining true to her detective creed and ideals. Watching the anime was simply a blast.\\n\\n\r\nOverall (9/10)\\n\r\nThe first season of KamiMemo covers volumes 1-4 of the light novel series. With 4 more volumes still untouched, I sincerely hope that somewhere on Heaven's Memo Pad is an entry for a season 2.",
            "date": "2013-06-27T11:04:00+00:00",
            "helpful_count": 138,
            "mal_id": 102643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2258035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/blaZofgold",
                "username": "blaZofgold"
            },
            "url": "https://myanimelist.net/reviews.php?id=102643"
        },
        {
            "content": "When I heard that this anime would involve a detective-loli, I instantly had my suspicions. With Gosick being released the season before, however, I had already learned to swallow my pride and initial thoughts and bite the bullet. I enjoyed Gosick. The characters were likeable - except for Kujo - and the cases were coherent, but admittedly involved some ass-pullery from Victorique. Despite that, I still felt satisfied with how the cases went.\r\nNot with this one.\r\nIn this one, the cases are sometimes so incoherent and rushed, that I actually have to make sure I didn't miss an episode. The cases seem to follow the sameformat: 1-2 episodes used to introduce the case and key players within the case and 1 more on the end for Alice, by some ridiculous stretch, to solve the case by some obvious case point that the audience should have known as well. Well, I enjoy the detective genre of anime as much as the next guy, but in the ones that I truly like, the answer is never obvious, but it's there at any rate. Anything else that happened during the case? Left unexplained. This anime's \"obvious\" is just some data on Alice's screen.\\n\\n\r\nAh...Alice. She's merely one of a bunch of unlikeable characters in the mix we have here. You've heard of them all before, so let's introduce them all! We have...-drumroll-...the spineless male lead! The highschool friend who likes the invertebrate! The loli-detective! The tough guy with hidden soft spot! The tough bitch! The foreigner! And many more! Put them all together, and you get a swirling ball of WTF, like the Prisoner Horde in Demon's Souls; it makes no sense, they just flail around and it's ugly. This anime seems to pride itself on having a NEET based cast, probably no doubt \"Don't worry, watchers of this anime! You can be like this too!\". Only we can't. Nor do we want to be. Moreover, it's almost a \"joy\" to guess to what Alice will spout her nonsense of \"I'm not a normal detective. I'm a NEET detective. I'm a speaker of the dead blah blah blah\". If I were a client of hers, it wouldn't strike me much confidence if she said that she was a speaker of the dead...I'd rather have my detectives prevent crimes from causing me much personal harm, than be like a fire-inspection officer after the fire has started \"Oh yes...the fire started around this corner of the room. It seems that accelerants were use-\" \"That corner of the room is where I spoke to you, and the accelerants were when your guys decided to piss off the perps!\".\\n\\n\r\nThe art style and animation can't salvage this wreck from the bottom of the sea. All it can do is preserve the wreckage after it's being pulled out, just so we can all see why, quite clearly, why this anime's story, plot and characters are unlikeable. Sure, it can look quite marvelous, but the ship still won't be able to set sail; no matter how much I wish it would set sail and sink somewhere deeper in anime history.\\n\\n\r\nAs with all things, some things will be liked by some people and others not. If you happen to like the major stereotypes that have plagued the anime industry for several years, then this anime is straight up your alley. However, with many other detective anime already showing the brilliance of the genre, this one's flaws and pitfalls are made even more evident. This one will just be another J.C. Staff Light Novel adaptation that is, surprisingly, par of the course for an extremely disappointing Summer 2011 season.",
            "date": "2011-09-13T05:39:00+00:00",
            "helpful_count": 88,
            "mal_id": 43259,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419459.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SamRavster",
                "username": "SamRavster"
            },
            "url": "https://myanimelist.net/reviews.php?id=43259"
        },
        {
            "content": "The word \"NEET\" is used almost interchangeably with \"bum\" and \"hikikomori\" in Japan. KamiMemo is about NEET detective Alice and her so-called assistant Narumi solving various cases in Tokyo with the help of three other NEETs and a Yakuza group. While the premise and the main characters are strikingly similar to that of Gosick, they are very different shows in that KamiMemo is more about the drama than mystery.\r\nThe story is arc-based with at most two characters for every case. This ensured great character development for the featured characters, which is the driving force behind this series. Unlike your typical detective show, the cases areoften simple. They're often very much solvable thanks to the abundance of hints planted throughout each arc. KamiMemo was far more engaging than Gosick to me as I found myself thinking about each incident with the characters rather than just watching a detective story presented to me. The downside of simple cases is that the story seems dull at times, though it makes up for it by adding drama and inspiration to the story.\\n\\n\r\nDespite being a detective anime, KamiMemo is filled with themes typically found in shounen (especially battle or sports) anime such as friendship, determination, justice/morality, belonging, search for a purpose in life, and love. There's also quite a bit of action, and like in the real life, many things are settled by brute force in the end rather than intelligence alone.\\n\\n\r\nThe characters are rather stereotypical, but the anime spends a significant amount of time developing each person involved with each crime. Though Alice, Major, Hiro, and Tetsu were underdeveloped and functions almost exclusively as case solvers to advance the plot. The focus is on Narumi's growth as a person and clients of the NEET Investigation Firm. Their past, hopes, and desires are carefully presented to build up for the climaxes. While it can difficult to accept the corniness of Alice's speech and the convenience of the buildups at times, you are always rewarded with touching drama and inspiration by the end of each episode.\\n\\n\r\nThe art and animation quality is absurdly high for a series of this type. Characters designs are very generic, but everything is detailed and maintains extraordinary consistency (even in a baseball filler episode). There are some sloppiness when characters are shown from distance, but this is only noticeable because of the amount of detail and fluidity in regular scenes. Overall, the visuals are far above par.\\n\r\nOP/ED are very addictive songs that fit the show perfectly (I didn't even skip them!). Voicing is a perfect match for every character, and BGMs were decent.\\n\\n\r\nEpisode 1 (double-length) was an original story specifically written for anime by the author of the novel, and in my opinion it was by far the best, most well thought out arc. I think this shows J.C. Staff's inability to properly pace and adapt novels. Everything was summarized pretty well in the final episode despite it being volume 1 out of 7 in the novels though. There were many instances where I felt the anime was saved by the inherent strength of its source material, but I found it to be very enjoyable overall.",
            "date": "2011-09-24T08:54:00+00:00",
            "helpful_count": 53,
            "mal_id": 44041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=44041"
        },
        {
            "content": "Kamisama no Memochou (God's Notebook) is one of the slightly darker \"high school mystery\" anime I have watched. It may not seem like it at first, but this anime is not as lighthearted as something like Hyouka. Hyouka doesn't have anything like suicide attempts, money stolen from the yakuza, or mind-altering drugs.\r\nStory - 7/10\r\nThe only real problem with the story of Kamisama no Memochou is it's slow and cliche start. The first four episodes are really nothing special, but after that, the latter two slightly longer arcs that make up the remaining 8 episodes are almost as good of mystery arcs as some of theDeath Note arcs.\\n\\n\r\nThe story follows Fujishima Narumi. At the beginning, Narumi's nothing more than your usual male protagonist who is somewhat forced into an uncomfortable situation (he seems and looks a lot like Ryugamine Mikado from Durarara at first). Narumi's father works abroad for all but around 5 days out of the year, so he lives with his older sister who works to support both of them. Because of this, he is forced to move around often, has changed schools many times over the years, and has become used to moving and avoids making many friends. One day, he is up on the roof of his current school in Tokyo when a girl named Ayaka sees him. She is the single member of the Gardening Club and is growing plants on the roof.\\n\\n\r\nAfter forcing Narumi to join the Gardening Club, she takes him to a ramen shop which is where she works occasionally and where a group of NEETs (people who are not employed, in education, or training) meet. Narumi is welcomed into the group despite stating that he is not a NEET and has no intention of becoming one. The three NEETs are all there because they are working for the NEET detective, Alice, who lives in a room above the ramen shop (which is her main supply of food as well).\\n\\n\r\nAlice is an introverted detective with incredible hacking and computer skills who loves stuffed animals and a soda called Dokupe (which is clearly not advertising for Dr. Pepper).\\n\\n\r\nFrom there, the group is involved in several cases (as I mentioned, the first few are a little boring). Eventually Narumi gets more involved with the group and becomes more of a leader who has the respect of the other NEETs and a gang who is closely tied to the group of NEETs.\\n\\n\r\nTrust me, if you don't completely hate the beginning of the show, don't give up on it before Episode 5. The story really picks up then and Narumi starts becoming a much more interesting character.\\n\\n\r\nArt - 7/10\\n\\n\r\nAlice's room looks really great with the computer lighting and stuffed animals and the very final scene of the show looks spectacular, but other than that, the art is mostly average. It's set in a city, which is drawn well, but I think Durarara and Death Note (which have similar settings) have much better art.\\n\\n\r\nThe character designs are also similar to other characters (I mentioned before Narumi looks like a copy of Mikado with brown hair instead of black). Alice is your typical \"loli with long hair\" female lead as far as looks go. About the only design that stands out is Hirasaka Renji's due to his odd, dyed blond bangs which make him look more like a Yugioh character than someone fitting in with the rest of these more normal looking characters. I actually really liked his design since it was so unique and interesting.\\n\\n\r\nSound - 5/10\\n\\n\r\nThere's no problems with the Japanese voice acting, but the soundtrack is a little strange. It's usually not even noticeable (with the OP and ED [I don't include them in the score] overshadowing almost everything). There are a few good tracks, but there is also one weird \"song\" which sounds like a woman saying some words in English with long pauses in between each word. There's not much other than that that I remember.\\n\\n\r\nCharacter - 8/10\\n\\n\r\nI thought the characters at first were just a bunch of bland copy characters from other shows, but they really had some good development that changed my mind completely around 7 or 8 episodes in. I didn't think Alice ever really developed much, but she was interesting from the beginning so that's not really a problem.\\n\\n\r\nNarumi is definitely the most developed character in this show. Despite his whole reason for getting involved in this story being pretty cliche, he really does a good job and actually turns into a good leader. Several characters mention that he should become a con man, which I could see happening in his future if he wasn't so nice (though he has a nice breakdown later on).\\n\\n\r\nHinamura Souichirou (Hina) is also an interesting character. He doesn't necessarily develop, but he has a really good role in the first \"good\" arc. Hina is a gang leader with an extremely loyal group of followers. He can be very intimidating and strong when he wants to, but he is also kindhearted and has a very interesting backstory. He works with Alice and the other NEETs a lot and forms a strange bond with Narumi.\\n\\n\r\nThe other NEETs who help Alice are Tetsuo, who is skilled at boxing, Hitoshi, a skilled hacker who looks like an elementary school kid, and Hiroaki, a gigolo who uses his female connections as a wide source of information around the city. Along with them is Ayaka, who is only occasionally involved in the cases (the last one has a lot to do with her) and mostly just helps by working at the ramen shop and making sure Alice bathes.\\n\\n\r\nEnjoyment - 7/10\\n\\n\r\nWhile this anime gets off to a very slow start, it really picks up around Episode 5 and becomes a good, fairly dark mystery anime. The characters become much better after that point and just the overall arcs and story becomes much more unique. While there isn't really any overarching plot aside from Narumi's development, it's just interesting to watch as the story progresses. Kamisama no Memochou does a good job of pulling you into the NEET detective world it sets up in Tokyo and connects you to the characters slowly throughout the 12 episodes. Some similar shows would be the more lighthearted Hyouka while Durarara and Death Note have similar settings and some similar characters (Alice and L are kind of similar detectives who spend most of their time inside). Shindere Shoujo to Kodoku na Shinigami is a manga with a similar balance of comedy, drama, and somewhat dark mystery.\\n\\n\r\nI would recommend this manga if you like mystery anime at all. It may start out slow, but it's rewarding to stick it out until it starts becoming more unique around halfway through.",
            "date": "2013-07-22T14:50:00+00:00",
            "helpful_count": 34,
            "mal_id": 106387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=106387"
        },
        {
            "content": "To be honest, this anime is another one that present only moe and nothing else, and its worse than K-On as how its supposed to be a detective anime. The 'detective-ness' it gives is dull, so it fail to fulfill its goal as a detective anime and not like how K-On have achieved its purpose of being mass of simple moe and nothing else.\r\nThe girl named Alice, while many would find her cute and attractive, I find her terribly annoying and illogical. She said she had observed the world from her screen, which with that meaning that she have witnessed countless crimes and tragedies, yetshe will make a crying face when she unintentionally broke her chopsticks. Her intelligence did not meet up with her arrogance and demands at all as she couldn't figure out some obvious facts and have Narumi, a dumb average Mr.Mundane solve it for her, and she's supposed to be a genius detective right? And at the conclusion of ep1 she chose Narumi to be her personal assistance despite having other acquaintances she had worked cases with before(so maybe the ep1 case was their first case and Alice and team have never solved any crime before? oh they might be too busy setting up cameras around the city and work jobs to pay for all the cameras and screens, along with the massive electricity bill Alice devour each day maybe? That may be a logical answer to why she need Narumi, she couldn't solve stuffs herself like she's already supposed to be able to prior to the story), and lastly, the name 'Alice' is simply the most overused name of all Japanese fiction media, the reference to Alice in Wonderland now became non-existent and so the name can apply to all girls that lives in their dreamy room or have any relation with either literal, emotional or figurative fantasy, and it is not only getting old, but already had.\\n\\n\r\nLastly at the conclusion of ep1 they still didn't tell why the victim girl committed suicide. Yeah you might say its given that the girl was too pressured with life so she decided to die, that's really retarded, she was regarded as the 'perfect female of the school', if she can't handle it and yet have enough free time to get money from prostitution, keep a healthy relationship with a male and female friend separately, and along with keeping her 'perfectness' up, why not just yell at all those people pressuring her and loosen the valve to the point she can handle it? With that much given free time it should've been so easy, and if she was smart enough to do well in school she should've figured that out.",
            "date": "2011-09-04T03:02:00+00:00",
            "helpful_count": 30,
            "mal_id": 42679,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564349.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Shemyaza",
                "username": "Shemyaza"
            },
            "url": "https://myanimelist.net/reviews.php?id=42679"
        },
        {
            "content": "Kamisama no Memochou is an action/coming of age story about a young man in high school who is swept up into working for a detective agency headed up by a young girl (Alice) with extraordinary computer skills. She's more Victorique (GOSICK) than Sherlock Holmes, but she has a crew of NEET helpers who do the grunt work and she puts those pieces together with what she can find by either hacking databases or accessing surveillance cameras.\r\nThis is not a moe series, nor does it try to be. Yes, Alice is demi-kawaii and demi-tsundere, but as the series continues, she doesn't have that much screen-time. Thestories focus on the protagonist, Narumi, and how he manages to help those around him and become stronger in the process.\\n\\n\r\nThe series is solid in terms of production values, with good sound, art, and writing. The OP & ED are a bit lack-luster, though that's offset by the fact that the incidental music is really effective at times.\\n\\n\r\nThe comedic timing is good and the side-characters are interesting enough that you find yourself wishing that they had more screen time. Not all the cases/resolutions are serious and that gives the show a bit of an uneven feel, but it's not enough to take away from the enjoyment of the more serious arcs.\\n\\n\r\nOne of the biggest bonuses for me in this series (so far) has been watching minor characters emerge into significant and important roles. I haven't read the manga and the series hasn't concluded yet, and that will be the real test, whether they can pull all the threads together into an emotionally torturous and yet satisfying ending. If they manage that, I may upgrade my rating. For now, I'm going to wait, watch and see.",
            "date": "2011-09-05T08:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 42763,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/49064.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zirinbaku",
                "username": "zirinbaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=42763"
        },
        {
            "content": "Story: 5\r\nThe story shoots between complete predictability and utter nonsense. I still don't understand how the protagonist ended up as \"assistant\" to the detective other than \"Oh since you don't have anything else better to do with your time, be my assistant.\"\r\nArt: 8\r\nThe art is about the only thing going for it. It's well made. Then again, what isn't these days?\r\nSound: 6\r\nThe voices are ok. The op and ed are boring.\r\nCharacter: 3\r\nI have no idea what is going through the characters minds. The detective calls herself a NEET, but since she works as a detective, she is technically employed. Why did the protagonist join theyakuza? Are they yakuza?\\n\r\nThe behavior of the characters is confusing and nonsensical. Easily the low point of this show.\\n\\n\r\nEnjoyment: 5\\n\\n\r\nI was so confused I could not follow almost anything that was happening. I mean, following one episode was one thing, but I for a show with arcs, they did not play off each other very well.\\n\\n\r\nOverall: 5\\n\\n\r\nThe show gets a 5 (Mediocre) for its overall score. Descent art is brought down with a lackluster story and poor character development. Not really worth the time.",
            "date": "2011-09-09T22:43:00+00:00",
            "helpful_count": 17,
            "mal_id": 43045,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/varganator39",
                "username": "varganator39"
            },
            "url": "https://myanimelist.net/reviews.php?id=43045"
        },
        {
            "content": "First of all, I don't write reviews. I just watch the anime, take note of it, put a score on it, and remember it if was good. The fact that I'm writing this is quite important. \r\nNow I gave this a 10. \r\nStory: 10\r\nI had just finished watching \"The Mentalist\", a television show about crime and mystery, with comedy in between. So landing on Kamisama no Memochou was great for me. I was able to enjoy the story because, like \"The Mentalist\" the story was well thought out. The story starts and follows the general mystery solving format that makes it good. First, recognition ofthe crime, planning, first scouting, planning, first action, and then the reveal. Or something like that. I really appreciate that the series takes ~40 minutes to start and end a mystery. This shows that Alice and the detective squad are really well at what they do. Now of course there were stories that took longer than 2 episodes. These stories...omg they were awesome. Each scene exists for a purpose in the development of the detective skills. Each scene progresses the MC and the viewer ahead and also allows us to find the personalities of the characters involved. For a story that is deep, proper, and meticulous in the way the mysteries are solved I really liked it. \\n\\n\r\nArt: 9\\n\r\nI'm too picky about the art style since I understand each studio follows their own way of drawing. So every now and then I pause the episode to notice the detail in a frame. The art was well, nothing lazy. Sure, a few frames had simple drawing but nothing that would remove from the show a lot. Everything that needed focus had detail and that's all that mattered.\\n\\n\r\nSound: 8 \\n\r\nAgain, sound is great if it matters and if it doesn't then it's just another thing for the acoustic value in a scene. I like anime such as Kill La Kill and Katanagatari in the way they use a special song or tune for a certain type of situation or character (s/o to Blumenkranz for Ragyo). I noticed that in this anime there are a few empty scenes with no BGM. Otherwise there is something to fill the airwaves. And then there are a few reoccuring songs to match a situation, and I really liked that. I.e. when Alice explains something, a really cool female vocalization song starts in the background and adds a special intensity. \\n\\n\r\nCharacter: 8\\n\r\nNever get your characters wrong. I really liked how the characters in each crime were explained in a nice and detailed way. Sure, some of them were regular characters that already existed in our knowledge before they make their \"request\" but still...characters that stay for a short time or have importance for a short time still get enough presentation to show themselves to the viewers. Characters with longer importance are slowly revealed to the viewers. And I liked that. The pacing of revealing the backstories of characters was great. There were a few episodes just to reveal the backstories of two characters, and another single episode to reveal the story of another. Each was very well presented. The NEETs are highlighted for their abilities, and they're \"powers\" are constant, no deus ex machina here. I really like the MC because he isn't the dense type and he is smart in his own way. His pairing with Alice is great too and in that way the viewers get the inside scoop on what she is thinking because, as they point out in the anime a lot, the MC is talker and not a thinker. The reason why I think the characters aren't super awesome is because, well the author uses concepts so out of the norm that it becomes unique...and that hurts it a little. Near the end I saw the MC become a little different and succumb to the generic MC style where \"he is weak and confused but now he is strong, but isn't always strong...just when he wants to be\" and that was annoying to me because I really hoped the anime wouldn't end like that.\\n\\n\r\nEnjoyment: 10\\n\r\nLike I said, I just finished watching 7 season of \"The Mentalist\" in which I thoroughly enjoyed. Coming to this only helped extend the enjoyment I had in that show and so seeing the pacing of this anime and how there was a smart character who didn't do much, and a not as smart character who ran around a lot helped me relate back to \"The Mentalist\". For anyone who hasn't seen the show I'm talking about...well if you like to think a little in an anime and like a bit of problem solving and connecting the dots...I think you'll like this too.",
            "date": "2015-07-20T00:10:00+00:00",
            "helpful_count": 16,
            "mal_id": 193881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3683613.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlphXcalibyr",
                "username": "AlphXcalibyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=193881"
        },
        {
            "content": "Kamisama no Memochou is an amazing anime that shows how a little girl can solve different cases. Age does no really matter in being a detective. You just need good observation skills and the wits. ;) The main character really has a high pride about herself.. She is not just a detective... She is a NEET detective. ^^ I really liked this anime and the characters.. :D",
            "date": "2012-08-09T22:15:00+00:00",
            "helpful_count": 16,
            "mal_id": 69299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1448679.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/4unox3",
                "username": "4unox3"
            },
            "url": "https://myanimelist.net/reviews.php?id=69299"
        },
        {
            "content": "Kami-sama no Memochou (God's notebook) is a must-see series.  Bottom line.\r\nLike any series, it is hard to be hooked in right from the start, but there are dozens, literally, HUNDREDS of animes that start off that way but are now beloved by millions.  This short 12-episode series is among them.\r\nAs the story progresses, it keeps throwing you cliffhangers that make you want to see another episode and another and another and then BOOM!  PLOT TWIST!!!!!  TRAGEDIES!!! CONSPIRACIES!!!  DRUGS!!! GANG WARS!!!  EVERYTHING IS MOVING SO FAST!!!  The writing for this show got really intense midway through.  \r\nAnd eventhough it's done...\\n\\n\r\n...I still want more",
            "date": "2011-10-16T18:06:00+00:00",
            "helpful_count": 15,
            "mal_id": 45673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/541071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_TEKnician",
                "username": "The_TEKnician"
            },
            "url": "https://myanimelist.net/reviews.php?id=45673"
        },
        {
            "content": "Kamisama no Memouchou (God's Memo Pad) is a story about a boy who meets a girl, and in turn meets a group of NEETs led by Alice, the ultimate NEET detective who solves multiple crimes and mysteries in the city with little more than just her set of computers in front of her. It is short, so the maximum score that I can give this anime is 8 points, 8 points being the perfect 13-episode anime (such as Angel Beats!). 2 points are automatically deducted from both/either story and/or character respectively, since it is virtually impossible to produce a complete story and comprehensive character developmentin such a short number of episodes.\\n\\n\r\nBut on to review proper.\\n\\n\r\nTL;DR\\n\\n\r\nStory: 5/10\\n\r\nArt: 8/10\\n\r\nSound: 10/10\\n\r\nCharacter: 7/10\\n\r\nEnjoyment: 6/10\\n\r\nOverall: 6/10\\n\\n\r\nGood points:\\n\r\n-Very interesting characters\\n\r\n-Strong male and female protagonist(s)\\n\r\n-Exciting start, and touching finish\\n\r\n-Some funny interactions between characters\\n\r\n-Good art and sound, pretty solid OP and ED themes\\n\\n\r\nBad points:\\n\r\n-No central conflict, just main, separate arcs\\n\r\n-Gets boring towards the middle, and less insightful or amazing\\n\r\n-Lack of character development/back story for many supporting cast\\n\r\n-Insignificant conflict exaggerated by the whole detective idea leading to mediocre middle arc\\n\r\n-There includes 1 filler episode\\n\\n\r\nConcluding remarks:\\n\\n\r\nThis will be a disappointment if you are looking for:\\n\r\n-Good romance\\n\r\n-Good and suspenseful mysteries\\n\r\n-Action-packed sequences\\n\\n\r\nThis will be enjoyable if you like:\\n\r\n-Good humour\\n\r\n-Cute things such as loli detectives\\n\r\n-Unconventional things, creativity\\n\\n\r\nPlot: 5/10\\n\\n\r\nThe anime starts off like the usual - introduction of a kid in school called Narumi, who is quickly thrust into this NEET worlds, which becomes very interesting in the subsequent few episodes when they managed to solve the case of a murder. That's all fine and good. They also manage to solve a crime regarding misappropriation of funds, okay, that's the end of the first part, aka introduction to the life of Alice and her group of NEETs.\\n\\n\r\nThe second main arc describes the ongoing conflict between Sou and his long-lost friend, Renji, who fell out a long time ago due to a misunderstanding over a fatal incident. This particular arc I had alot of problems with. First of all, the relationship between Narumi and Renji was kind of boring. All they did was talk a bit here and there, meet up here and there, and poof they are sworn brothers. But not really, they still don't really know each other very well.\\n\\n\r\nThe other problem was that the entire conflict seemed too insignificant to invest a good 4 episodes into it. Two rivals who were once friends, fight in the midst a Feketerigo concert that is backed by the shadowy underground Hirasaka group, just because of a misunderstanding that they probably could have cleared up if they just talked. Nice twist at the end about the true fate of Hison after the stabbing, though. Still, it makes hardly any sense for two rivals to nearly try to kill each other over something that Souchirou obviously knows is a misunderstanding. They honestly are not taking this friendship thing too seriously.\\n\\n\r\nJump to the third main arc about the Angel Fix, and I must say, it was a pretty gripping plotline, albeit with tons of plotholes. Wait, so the police couldn't find out exactly where this drug was coming from and had to leave it to the NEET detectives to solve it? What the heck are the police doing anyway, they didnt even show up in the anime - oh wait, I believe Hirasaka group was standing in for the police. Ah that explains it.... Anyway, the other main problem was when they dramatically HAD NO CHOICE but to make Narumi take the Angel Fix drug, potentially risking death, in order to find the bad guy's hideout (and by the way, he even issued a challenge, so confident that it would not be found).\\n\\n\r\nHang on a second, it's all really touching but couldn't they have just trailed ANOTHER angel fix user? I mean, it's widespread right, there's absolutely got to be a chance to get hold of AT LEAST ONE OTHER angel fix user around the ENTIRE town! Oh well, even Alice didn't think of that. And the next thing, So Angel Fix users follow their \"illusions\" and this illusion somehow leads them to black alleys. I know hallucinations and drugs come hand in hand, but it's not technically possible to use a hallucination as a GPS/navigation system, especially since it's not possible to control exactly WHEN or WHERE the user takes it, and hallucinations often differ from person to person.\\n\\n\r\nIt started off well, was shaky in the middle, but ultimately managed to get off some flawed but at least touching story at the end. On the whole, the story was mediocre. There was also no main overarching story throughout, it was more like many separate events, with only two main big ones. I gave 2 points for the last arc and 1 point for the second arc, 2 points for the first introductory arc.\\n\\n\r\nArt: 8/10\\n\\n\r\nArt was definitely top-notch. I loved the OP and ED scenes, they were all so beautifully designed. Character designs were pretty neat too, they were all unique and there weren't two characters that were visually alike in every way.\\n\\n\r\nSound: 10/10\\n\\n\r\nOne of the best music tracks I've heard in a while. The OP and ED track were both absolutely amazing, and completely drew me to love the anime. Also, background music a suitable and was tense at the right moments.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nHere we go again. Another random kid who wants to do his best. It's the typical shounen character who meets the typical tsundere. Oh wait, no, actually they are not THAT typical.\\n\\n\r\nNarumi may look like the same old clueless dude that seems to be what all main characters sound like in all school-related animes, but he really isn't. He doesn't whine or be useless as often, and most of the time his determination and strength allows him to find out things that other characters miss. Hence, he is more than just a guy who receives growth from the other characters, he contributes to the team as well, and even early on.\\n\\n\r\nThen we come to Alice, who yes, is kind of stereotypical, but actually she's kind of cute. I love it when she blushes and I love how she calls all of her soft toys names (lol what kind of name is Moggadeet?). And as an avid lover of computers, it's a wonder she doesn't need to wear spectacles when she sits 30 cm away from 6 computer screens and just stares at them the entire day. She's abit useless though - I cant' really imagine someone not being able to open a drink can, yet being able to swing a bat (yep that's inconsistency right there).\\n\\n\r\nThe other characters, besides maybe Ayaka (main character in arc 3) and Sou/Renji/Yoshiki (main characters in arc 2), unfortunately, are sadly sidelined despite their awesomeness. You have Major, who is the genius inventor from college whom you unfortunately, after watching till the end of the show, have no idea where he comes from or whether he actually has a family. Next, you have Tetsu, whom you pretty much also don't know anything about. Then you have Hiro, the playboy whose promiscuity makes you wonder why he doesn't have aids yet.\\n\\n\r\nActually, if you think harder about it, you don't really know where Alice comes from either - how did she get so smart? How old is she even? Let's look at Ayaka - sure her dark past is intertwined with her brothers' but what about her interactions with other friends? Couldn't she at least have confided with some of her classmates, she must have some OTHER relationship other than that with Narumi. Her past? Umm... I don't really know. Other family members maybe? Only Sou/Yoshiki, I felt had any real substantial back story to them, but Yoshiki herself, had some lack in her story, since she wasn't a main character.\\n\\n\r\nSo in the end, while there is character growth, this is shown ONLY in Narumi, everyone else seems the same start to end, with a little growth in Sou/Alice regarding how useful Narumi is. Character background and development is greatly lacking in most characters, as most of them have linear/monofaceted personalities.\\n\\n\r\nMinus 1 point in growth, 2 points for lack of characterization. But the interactions between the characters are generally good, enjoyable, funny, touching, emotional and genuine. So at least, I applaud for that. The ending part was quite touching, Ayaka x Narumi is quite the destined pair.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\nI didn't rate this very high on the enjoyment scale, because I had to bring myself to watch through the middle segment of the show, rather than be so hooked that I HAD to watch it. I would have been fine with dropping the series halfway because it started to get slightly uninteresting. But, pretty distinct, strong personalities with interesting quirks and interactions, made the series quite enjoyable overall.\\n\\n\r\nOverall: 6/10\\n\\n\r\nThis is actually not too bad. It's two points off full marks. While it didn't fail to deliver a complete and satisfying resolution, it failed to properly fit into any real genre I could think of. I have a feeling it was going for this \"Mystery\" thing, but honestly, it llacked a lot of suspense.",
            "date": "2014-08-31T01:45:00+00:00",
            "helpful_count": 13,
            "mal_id": 158599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=158599"
        },
        {
            "content": "Kami-sama no Memo-chou  is not a typical mystery anime when the \"detective character\" seems to be a little like Sherlock. This anime is about \"NEETS\" or school drop outs that take requests from clients who need help in finding someone or figuring out why someone did something. Each of the characters in this anime have distinct personalities, some with the typical norms in other characters such as Alice; typical Gothic loli who is a bit of a tsundere - She is quite similar to the girl in Gosick.  \r\nConsidering how short the anime is it has a great story line and  youcan really get into it, I love this anime, the art is lovely, the characters are great and the story is good too. I love how the characters developed over the 12 episodes and how the anime hits home in reality and things that can happen in real life.  \\n\\n\r\nThis review is not very detailed due to spoilers and to be honest I am not good at typing reviews at all but I hope it at least helped a bit.",
            "date": "2014-12-04T09:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 171007,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1585859.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/EmmyBomb",
                "username": "EmmyBomb"
            },
            "url": "https://myanimelist.net/reviews.php?id=171007"
        },
        {
            "content": "When I saw the list of Summer animes, I was interested in this! So when I found out the episode was out already I was overjoyed! Though I was shocked to see it longer than usual (40 something minutes) .. I'll keep this short and simple because I've only watched one episode  but I agree with roriconfan's recommendation.\r\nThe potential is there but the actual anime is not. The motivation for me to watch this cute loli was because of the twist of being a \"NEET\" (my first time experience in having a main character like that). Though as it progressed, I was losing myinterest but the thing that kept me strong was the interest I had for this and the case being solved! \\n\\n\r\nAt the end, I was disappointed. The crime was very simple but it seemed like no one knew why the girl disappeared or her motives. Even if it was said it to her best friend (in the flash back) and when they find it, it's like OMG WHAT HAPPENED? Probably the most interesting concept of this entire thing was how they found her and the quote POSSIBLE SPOILER:  \"I wish time could stay frozen like this forever\"  The anime doesn't let you know much while trying to solve the mystery but Alice (our loli) knows all. This anime ... (I hate comparing but...) was like Gosick but worse. The pairing, the mystery of it all, but the twist of technology and NEET-ness. Was the very end a bit of fanservice? That I was disappointed it. \\n\\n\r\nI'll watch out for the next episode because I still like the concept  but I'm possibly dropping this one from my anime list. ;c",
            "date": "2011-07-11T22:35:00+00:00",
            "helpful_count": 12,
            "mal_id": 39006,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/504061.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Luminsity",
                "username": "Luminsity"
            },
            "url": "https://myanimelist.net/reviews.php?id=39006"
        },
        {
            "content": "Overall [9/10]\r\nThis was.... amazing. Throw away the typical geniuses (although the characters are in their own way) and place people who decide to find something better in the world in a different ways.\r\nPlot [8/10]\r\nThe plot may seem a bit of a lackluster at first but before you know it, you're stuck in their loop, unable to tear your eyes away from the screen. Watch the protagonist go from someone who barely interacted with anyone and threw around fake smiles to one of immeasurable power and find his own worth, neither exaggerated nor underestimated. Narumi was heartbreakingly human.\r\nCharacter [9/10]\r\nAlice; the speaker of the dead. While uncovering,she shoulders the burden that she could have done something had she been earlier, but she always reaches one scene too late.\\n\r\nRenji, Hiro and Master; seeing the world with different eyes through connections and technology, usually indirect than direct.\\n\r\nSou... the anti-hero in the story. Doing things that people in full view of the public cannot, bring justice his own way even if its outlawed.\\n\r\nNarumi... the high school student that wanted to find the bigger picture, something bigger than life and found it in words he spoke and wrote.\\n\r\nThe main cast were beautiful and flawed in their own ways, so I loved them all, even the supposed villains who were also trying to find their own place.\\n\\n\r\nIn general, I love this anime ;)",
            "date": "2015-06-10T19:55:00+00:00",
            "helpful_count": 11,
            "mal_id": 190048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4452693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/br0kenphantasy",
                "username": "br0kenphantasy"
            },
            "url": "https://myanimelist.net/reviews.php?id=190048"
        },
        {
            "content": "I am a fan of detective-like stories. And being a NEET myself, I can somehow relate here to Alice. And just as she said\r\n\"I have been gazing through windows across the internet to see the world. A grossly limited and twisted world, isn't it?\"\r\nAnyway, I just finished seeing this anime. Knowing it's been completed quite a while back, I've only got the time to watch it recently. And I'm glad to have watched this series. It got me really satisfied with all the turn of events.\r\nThis was another series that got me really hooked up from the very first episode up to the last. ifonly I could watch it continuously without stopping, I might have.\\n\\n\r\nStory: Great stories. There are some episodes that kinda throw me off a bit. Like I would have thought to myself \"seriously, this is just a stupid kind of case. you just wasted an episode!\" But after sometime, things began to get interesting once more. Yeah, the story was just your typical detective story there is. But it has something that not all detective stories have. It has a great plot. Something that's continuously progressing until you reach the very conclusion of it. every episode has deeper meanings than just seeing it. It's like you don't have to watch it with your own eyes and just enjoy the episode or get bored by it. You have to watch it very seriously, carefully, chewing every words, digesting every information and let the conclusion not just stir your brains but your very emotions as well.\\n\\n\r\nArt is Good. typical art. Not very catchy but at least it doesn't hurt the eyes.\\n\\n\r\nCharacters are quite great. they have really different characters being portrayed. Not everyone is similar. Really unique individuals that found each other and formed a bond. Well, that's how things are but then there was not an annoying character ever in the whole series.\\n\\n\r\nEnjoyment, well yeahh I actually enjoyed the whole series. Like I said, I am a fan of detective type stories.\\n\\n\r\nOver all: This is just a great anime. Totally love everything about it. And the ending is beautifully written and portrayed. A bit sad, yeahh but the kind of sadness that doesn't really hurt. Two thumbs up.\\n\\n\r\nThis might be below the belt/crossing the line but those who rated this anime low might have watched this only with their eyes. They didn't savor every moment and maybe didn't really get the true meaning behind the story.\\n\r\n But then, every people has their own opinions, so I'm not one to talk.\\n\\n\r\nEnjoy!",
            "date": "2012-03-04T05:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 55297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/726633.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Rei-chii",
                "username": "Rei-chii"
            },
            "url": "https://myanimelist.net/reviews.php?id=55297"
        },
        {
            "content": "\" I'm not a detective. I'm a NEET detective. Speaker of the dead. \" - Alice\r\nThe story is not that great, the art is fine as well but the characters are the things that stole my heart. Different from other detective-style anime where the side characters are not the main attraction, this anime defined the side characters quite well, from a mafia boss that looks tough but has a soft side, an agile ex-boxer who represents the strength, a university student known as 'major' specializing in surveillance system, a playboy with extensive roots with the girls, to our lead characters.\r\nAlice is the center of theteam, being the expert loli hacker and the master of deduction, collecting info from all sort of Internet-related technology to deploying strategies to solve the cases requested, while taking care of her stuffed bears and drinking soda which her refrigerator is stocked with. Narumi, unlike other lead male character is not that smart at all, but rather, an average guy with no special skills or anything. However, he does has his perspectives on things and his own principles when dealing with certain things. After joining NEETs, he learnt more about himself and the extent of what he will do given the circumstances involving his friends in danger, which will change his way of life forever.\\n\\n\r\nThe focus of this anime is not on the cases, but rather about the complexity of emotions, the portrayal and the true meaning of different kind of relationship as well as the hidden truth to be discovered. Overall, if you're looking for an anime that is emotionally-satisfying with a bit of drama and mystery included with a loli hacker and an ordinary assistant with well-defined side characters, you're in luck.\\n\\n",
            "date": "2018-12-18T09:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 296060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7568325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ethan_07",
                "username": "Ethan_07"
            },
            "url": "https://myanimelist.net/reviews.php?id=296060"
        },
        {
            "content": "Imagine a riding a rollercoaster. It starts off by building up your excitement as you are slowly ascending the tracks while, at the same time, speeding up. The rest of the ride then consists of ups and downs, loops and turns, and random spins, before ending with a final surge of exhilarating speed. That is how I felt when watching Kami-sama no Memo-chou. The first episode made the series seem promising but it eventually failed to deliver, despite having a decent ending. Let's see how it fared in the usual four categories of art, character, sound and story. \r\nArt (7/10)\r\nAnimation quality usually takes a backseatto the characters and the story when I watch anime. However, when those two categories end up being bland and uninteresting, I am forced to focus on other aspects of the episode just to prevent myself from being bored out of my mind. The artwork in Kami-sama no Memo-chou isn't outstanding, but it isn't horrible either - just your typical run-of-the-mill quality. Nothing more to say here so let's move on. \\n\\n\r\nCharacters (6/10)\\n\r\nMaybe a 6 is a bit generous for this category because, at the end of it all, I couldn't really say that there was a character that I \"liked\", unlike in most anime that I watched. Yes, there was some character development, but there wasn't enough for my liking. My image of the main protagonist, Fujishima Narumi, didn't change at all throughout the whole show; he was still a plain and boring character to me, for the most part. On top of this, I slightly disliked Alice and her personality. The previous sentences are, however, just my opinion so you may not necessarily agree. However, I do believe that I'm not the only one who feels this way. Non-memorable side characters make this category suffer even more. To sum it all up, the characters in Kami-sama no Memo-chou are nothing to be happy about, so don't expect a lot if you are someone who pays a lot of attention to character development. \\n\\n\r\nSound (7/10)\\n\r\nOnce again another generous mark is given, this time to the sound category (it may seem like I'm starting to pity the anime and that's probably the case). Aside from the OP, everything was just \"decent.\" The ED, BGM and voice acting were, at best, average. With that being said, I admit all my expectations were lowered drastically midway through so this category should technically receive a lower score than what it currently has. Anyhow, I found the OP to be the lone bright spot in terms of sound. Kawaru Mirai only took a few episodes to get me like it. It is upbeat and catchy with surprisingly good vocals to go along with it. You can say that half of my motivation to download and watch each episode was because of the OP. \\n\\n\r\nStory (7/10)\\n\r\nOne may choose to say that, if the story is able to overshadow everything, bad art, characters and sounds can be excused. However, this is unfortunately not the case for Kami-sama no Memo-chou as the story is just as bad as the other categories. Maybe it won't seem that way after the first episode, but as the series went on, the story definitely didn't live up to the expectations of many viewers. There were some parts which were surprisingly interesting while others were absolutely horrid. Looking at the big picture, I personally didn't feel that the plot advanced far enough. For a 12-episode season, the story moved way too slowly with barely anything important happening. It is only during the last few episodes that the plot was developed the most. Overall, a disappointing story. \\n\\n\r\nOverall (7/10)\\n\r\nKami-sama no Memo-chou is a good example of a light novel adaption gone wrong. Average artwork, boring characters, unimpressive sounds and a disappointing story just screams \"don't waste your time!\" While I don't want to scare people away from watching it, I would just like to give a word of warning to those who are not sure if they should watch it for not. By all means, go try it if you have nothing better to do or like \"mystery\" anime. Whether you agree or disagree with me at the end of it all is totally up to you. All I will say is this: while it is supposedly a \"mystery\" anime, Kami-sama no Memo-chou is undoubtedly unable to reach the level of success that big titles such as Detective Conan have. Don't expect too much.",
            "date": "2011-11-16T07:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 47567,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=47567"
        },
        {
            "content": "Kamisama no Memochou is not an anime for you if you're looking for real detective-mystery. It deals with relationships between the characters and the problems they face, which the loli detective solves for them. If you don't like lolis, rest assured, there is more emphasis on the reckless main character, the people around him and the yakuza.\r\nStory: 7\r\nDecent story, good concept. I like how the story turns from loli to yakuza and brotherhood. There are different arcs which are all interesting. The last two arcs were especially interesting.\r\nArt: 8\r\nGood animation, thankfully, the characters didn't look like kids. The animation is smooth enough.\r\nSound: 7\r\nVoice acting wasgood, opening was a big disappointment (I listened to it every episode and I still forgot how it went). The ending was okay. The background music was really good.\\n\\n\r\nCharacter: 8\\n\r\nOther than the irritating tsundere loli, all characters were really good. Thankfully, the main character is reckless but not an idiot. There are many cool male characters and also a lot of character development between each character. There are less female characters but they, too, were good.\\n\\n\r\nEnjoyment: 8\\n\r\nI thought it was boring until episode 5. But later, it was all about yakuza and promises. Then it went into drugs and a lot of other things. \\n\\n\r\nOverall: I'd say 6.5 something but I'll give it a 7\\n\r\nIt was rated less, even though I praised it this much because it didn't turn out to be a good mystery anime. I can say, Kamisama no Memochou has more drama than mystery. Nothing is so mysterious about it. Being a huge mystery fan, this was a let down. It's worth watching but I wouldn't watch it again.\\n\r\nGive it a try.\\n\\n",
            "date": "2015-06-13T22:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 190267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2019857.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/guddi",
                "username": "guddi"
            },
            "url": "https://myanimelist.net/reviews.php?id=190267"
        },
        {
            "content": "Kamisama no Memochou (Heaven's Memo Pad) has really good art and character design. The animations by J.C. Staff once again are on par with shows like Railgun and Index the environment design especially are great however the story is dreadful and doesn't even make sense half the time. I was truely disappointed by this such a good art style and character design yet such a shit and terrible story. If your looking for a 12 ep filler because your bored or have nothing else to do its worth watching however if you are wanting some good story and enjoyment don't go anywhere near this shitshow.",
            "date": "2014-01-18T19:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 129283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1699879.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/cra0",
                "username": "cra0"
            },
            "url": "https://myanimelist.net/reviews.php?id=129283"
        }
    ],
    [
        {
            "content": "One of the most annoying things about the anime industry is the seemingly ingrained belief that bandwagons, when jumped upon, have the mystical ability to carry studios into money. It's a sad fact that every season will undoubtedly see the release of one or more shows that clearly attempt to piggyback on the success of something that has gone before. Thankfully following trends isn't necessarily a bad thing, and every so often a series comes along that can be considered a superior example of its genre.\r\nUnfortunately that also means that the majority of titles that do jump on the bandwagon are mediocre at best.\r\nOriginally alight novel series by Sugii Hikaru, Kamisama no Memochou (God's Memo Pad), tells the story of a socially awkward high school student, Fujishima Narumi, and his exploits with the NEET Investigation Firm (apparently \"It's The Only NEET Thing To Do\"). The story begins with a series of text messages that lead to a seemingly unrelated scene in a love hotel involving a school girl, a businessman, a delinquent of some sort, and an attempt at blackmail that ends with an ashtray to the head. Narumi, having recently moved to Tokyo, finds himself geographically challenged to the point where he's in a perfect position to see that same girl jump out of a window.\\n\\n\r\nAfter that things get a bit random.\\n\\n\r\nOne of the major problems with Kamisama no Memochou is that the plot doesn't really have any particular goal or objective. The story is told in a series of short arcs that often have very little direct relation to each other, and while this does tie in to the idea of individual cases at an investigation firm, the lack of any real focus causes the narrative to meander before any conclusion can be reached. In addition to this there's a surprising degree of contrivance apparent in the development of the plot, and while it's true that certain events are necessary to implement the growth of particular characters, it's much more preferable to have such things implied, inferred or even insinuated.\\n\\n\r\nThat said, there are some interesting threads woven into the plot that lay a good foundation upon which the story can be told, and if one is able to ignore the obvious prefabrication in the narrative then there is a degree of entertainment to be found.\\n\\n\r\nWhich brings up the issue of the company that Alice runs.\\n\\n\r\nNEET simply means \"Not in Employment, Education or Training\", which is a roundabout way of saying that a person is not just unemployed, but also has no real intention of finding a job. Given this fact, how can a NEET Investigation Firm exist when the simple act of working means that a person is no longer a NEET? To many folks it may seem like nothing more than splitting hairs, but in actuality it's the most prominent example of the mentality behind the series (more on this in a bit).\\n\\n\r\nBecause Kamisama no Memochou is set in the \"real\" world, there's a degree of mundanity to the artwork that is surprisingly well suited to the series. There's also little in the way of flamboyance where the characters are concerned, but while the design principle seems focused on normality, the series suffers from a certain tired old saw involving beauty and people who aren't very nice. On the plus side, the animation is pretty decent for the majority of the show, and is only really let down by some poorly incorporated CG or the odd repetition of particular sequences (there's one in the first episode - see if you can spot it).\\n\\n\r\nThe series opens with a rather straightforward introduction to the main members of the cast, all to the tune of \"Kawaru Mirai\" by Choucho. On the other hand the main ending theme, \"Asunaro\" by Suzumura Kenichi, is set to a montage that focuses on Alice and Narumi, and features lots of tumbling negative words and rapid fire photos. In addition to this the first episode concludes with a a rather dizzying series of photographs and images against the backdrop of \"Colorado Bulldog\" by Mr. Big (and if you want to know who they are, google it or ask your older siblings or parents). As for the background music, while the tracks on offer are varied and atmospheric that doesn't mean that they're always necessary, and in truth several scenes would be better without any sort of accompaniment.\\n\\n\r\nWhen it comes to storytelling it's often the case that a relatively weak plot will be masked by philosophical or psychological discussions, and that's pretty much what happens here. The script has a tendency to get bogged down in semantics and there seems to be an almost desperate need to expound upon the reasons for every action taken. Thankfully the voice actors are a pretty decent bunch, and while there are occasions where the performances are a little too excitable or overbearing, for the most part each role is handled fairly well.\\n\\n\r\nOne of the more interesting aspects of Kamisama no Memochou is the manner in which the characters interact with each other, especially the contrast between the established relationships and the manner in which Narumi's connections to everyone evolve over the course of the series. Now while this suggests some very good character development, sadly that's not the case as the story follows the old idea that drama leads to growth.\\n\\n\r\nAs the main lead much of the focus tends to fall on Narumi, but aside from certain events that force him to take charge he doesn't actually change very much until the last few episodes. One could argue that his introspective monologues are symptomatic of his evolution, but in truth the conclusions he reaches aren't reflected by any substantial changes in his personality. Right up to the end of the series he remains a figure who seems ill at ease with his role, and this seems like a wasted opportunity to explore what could have been a very interesting character.\\n\\n\r\nThe downside to this is the lack of attention given the rest of the cast, and there are a number of points that remain unanswered come the end of the show. Who is Alice? Why did she start a detective agency? How did the rest of the team gather? Not once does Kamisama no Memochou attempt to address these questions, and worse still, Narumi doesn't even ask them. Apparently his character is content to remain ignorant of things that anyone in his situation would naturally want to know.\\n\\n\r\nWhich neatly brings us back to the mentality behind the series.\\n\\n\r\nIntelligence is a difficult thing to gauge when it comes to stories, and one of the common assumptions is that the reader or audience will be unable to understand the choices, motivations and actions of this or that person. Writers make an effort to counter this, and the usual response is to load the dialogue with lots of big words, philosophy, psychology, psuedo-science, and other highbrow musings. The problem is that they often become so enamoured with their own intelligence that they begin to lose sight of what's important, and elements begin to creep that really don't belong or should have been thought out properly.\\n\\n\r\nIn the case of Kamisama no Memochou this manifests itself not just in the name of the company. One has to question the basic premise of a girl of indeterminate age (but probably around 12 or13 years old), with a mild Dokupe addiction living alone surrounded by high tech equipment. In addition to that one has to wonder why a show about detectives and mysteries would need an episode dedicated to fanservice or baseball.\\n\\n\r\nThis series has the potential to good, if not great, but there are far too many occasions where it takes its cues from titles like Gosick, not the least of which is the inclusion of an eccentric loli detective and her well meaning, yet slightly bumbling \"assistant\". As with many other tales of mystery, there's an element of entertainment that stems mainly from the viewer trying to figure out who, what, why and how, but that's where the magic stops. Although there are occasions where the show is interesting, and sometimes a little charming, these are always overshadowed by one question - who is Alice?. The lack of any explanations about her places a burden on the narrative that remains throughout the series, and while the show tries to mysticise her character from time to time, this is nothing more than an attempt to stop the viewer asking unwanted questions (\"it's magic so it doesn't need an explanation\").\\n\\n\r\nKamisama no Memochou is, at best, an interesting mystery anime, but like so many other shows that are the product of jumping on the bandwagon, it relies too much on the success of titles like Gosick, and too little on what it could have been.",
            "date": "2011-10-28T05:39:00+00:00",
            "helpful_count": 344,
            "mal_id": 46349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=46349"
        },
        {
            "content": "Mod Edit: Review may contain spoilers.\r\n-------------\r\nKamisama no Memochou is more than just a detective anime featuring not-really-NEETs and a loli mastermind. It's an anime that really takes the time and effort to create a realistic yet fantastic world and populate it with some of the most endearing characters in all of anime. The plots of each mystery is engrossing and exciting; the characters are not at all static, growing and changing as the anime moves forward.\r\nWhen it comes to good detective animes, this is about as close to perfection as you'll get.\r\nStory (9/10)\r\nArt (8/10)\r\nSound (9/10)\r\nCharacter (8/10)\r\nEnjoyment (9/10)\r\nThe story of KamiMemo is both cliche as wellas original. The first episode starts off pretty predictably: ordinary high school boy accidentally encounters strange people/event, gets curious and ends up being involved in some way shape or form. Don't let this banal opening discourage you! The rest of the anime picks up the slack and really shows off the depth of this series. The Angel Fix case is truly a climax and arguably one of the most well-done story arcs in anime history.\\n\\n\r\nEven the filler episode is done with a planned beginning, middle, and end, as well as a key plot element that both initiates and resolves the conflict. If that's not good writing, then I don't know what is.\\n\\n\r\nThe anime demonstrates an exceptional grasp of the concept \"detective anime\". \"Detective\" implies that the plot must contain a great deal of mystery, of assumption and deduction that should engage the audience, while \"anime\" means that this is, above all else, a show meant to entertain and impart something valuable to us viewers. KamiMemo balances between these two aspects by focusing more on the \"how\" of the mystery rather than the who, what, when, or where. While the actual truth may not be all that surprising, the process and methods that Alice and her gang employ to uncover the truth gives the anime the atmosphere of being \"on the case\", which makes the anime that much more enjoyable.\\n\\n\r\nKamiMemo doesn't have the best art I've seen, but then again I'm probably being spoiled by Oreimo. The art is very similar in style to TMoSH, which further deepens the similarity between the two anime (explanation in Characters section). Good artwork all around, no derpy, awkward angles, and characters are portrayed both distinctly and realistically. Emotions are very easy to read, and mood is well-portrayed through the colors.\\n\\n\r\nI originally found this anime because Kakenukeru Anison Medley I ended with an extremely long excerpt of Kawaru Mirai. Which happens to be an amazing OP; Choucho sings some of the best OPs out there, along with Kawada and Lia. The rest of the OST is filled with solid music overall. Notable mentions include Teddy, the haunting song played whenever Alice explains the harsh truth.\\n\\n\r\nI don't understand what the emphasis on NEETs where - Alice makes tons of cash from taking her cases. NEET detective is quite the awkward irony. Besides that point, the characters in KamiMemo are very well done - they immediately and easily reach beyond their given roles in the story. For example, Ayaka is supposed to be just a schoolfriend, but ultimately becomes such an integral part of the NEET squad that her tragic fall in the final arc really makes an impact on both the viewers and the characters.\\n\\n\r\nOne of the unique points of the anime is that the protagonist, Narumi, is given the Kyon effect. The Kyon effect is given to a high school boy, either in their first or second year, who is perfectly normal yet manages to attract around him an array of weird and bizarre characters, many of whom are quite gifted or have surreal abilities. Through these people around him, the Kyon-effected boy is given a chance to break out of his normalcy and become something more than what he was before by the merits of his character and the power of his will.\\n\\n\r\nWhile it may sound overused (and it only does because Haruhi is ridiculously overreaching), the Kyon effect is in fact not commonly used because of its delicate nature and the mixed reactions that the community usually gives in return. Narumi plays the role perfectly, becoming a hero in his own right through the course of the anime. Instead of a pathetic character who only knows how to voice snark comments and play the tsukkomi, Narumi pushes himself to his own limits and does everything in his power to protect those he truly cares for.\\n\\n\r\ntl;dr KamiMemo does some seriously incredible things with its characters. I won't even begin to mention just how perfectly amazing Alice is as a beautiful balance between a tsundere 12 year old and a calculated professional detective.\\n\\n\r\nKamiMemo was one of those \"love at first episode\" animes for me. It immediately gained a spot on my Top-10 anime list, and Alice became my 5th favorite character in all of anime. I was honestly impressed by the dynamic nature of basically every character. Even Alice grows and matures through the course of the anime, though remaining true to her detective creed and ideals. Watching the anime was simply a blast.\\n\\n\r\nOverall (9/10)\\n\r\nThe first season of KamiMemo covers volumes 1-4 of the light novel series. With 4 more volumes still untouched, I sincerely hope that somewhere on Heaven's Memo Pad is an entry for a season 2.",
            "date": "2013-06-27T11:04:00+00:00",
            "helpful_count": 138,
            "mal_id": 102643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2258035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/blaZofgold",
                "username": "blaZofgold"
            },
            "url": "https://myanimelist.net/reviews.php?id=102643"
        },
        {
            "content": "When I heard that this anime would involve a detective-loli, I instantly had my suspicions. With Gosick being released the season before, however, I had already learned to swallow my pride and initial thoughts and bite the bullet. I enjoyed Gosick. The characters were likeable - except for Kujo - and the cases were coherent, but admittedly involved some ass-pullery from Victorique. Despite that, I still felt satisfied with how the cases went.\r\nNot with this one.\r\nIn this one, the cases are sometimes so incoherent and rushed, that I actually have to make sure I didn't miss an episode. The cases seem to follow the sameformat: 1-2 episodes used to introduce the case and key players within the case and 1 more on the end for Alice, by some ridiculous stretch, to solve the case by some obvious case point that the audience should have known as well. Well, I enjoy the detective genre of anime as much as the next guy, but in the ones that I truly like, the answer is never obvious, but it's there at any rate. Anything else that happened during the case? Left unexplained. This anime's \"obvious\" is just some data on Alice's screen.\\n\\n\r\nAh...Alice. She's merely one of a bunch of unlikeable characters in the mix we have here. You've heard of them all before, so let's introduce them all! We have...-drumroll-...the spineless male lead! The highschool friend who likes the invertebrate! The loli-detective! The tough guy with hidden soft spot! The tough bitch! The foreigner! And many more! Put them all together, and you get a swirling ball of WTF, like the Prisoner Horde in Demon's Souls; it makes no sense, they just flail around and it's ugly. This anime seems to pride itself on having a NEET based cast, probably no doubt \"Don't worry, watchers of this anime! You can be like this too!\". Only we can't. Nor do we want to be. Moreover, it's almost a \"joy\" to guess to what Alice will spout her nonsense of \"I'm not a normal detective. I'm a NEET detective. I'm a speaker of the dead blah blah blah\". If I were a client of hers, it wouldn't strike me much confidence if she said that she was a speaker of the dead...I'd rather have my detectives prevent crimes from causing me much personal harm, than be like a fire-inspection officer after the fire has started \"Oh yes...the fire started around this corner of the room. It seems that accelerants were use-\" \"That corner of the room is where I spoke to you, and the accelerants were when your guys decided to piss off the perps!\".\\n\\n\r\nThe art style and animation can't salvage this wreck from the bottom of the sea. All it can do is preserve the wreckage after it's being pulled out, just so we can all see why, quite clearly, why this anime's story, plot and characters are unlikeable. Sure, it can look quite marvelous, but the ship still won't be able to set sail; no matter how much I wish it would set sail and sink somewhere deeper in anime history.\\n\\n\r\nAs with all things, some things will be liked by some people and others not. If you happen to like the major stereotypes that have plagued the anime industry for several years, then this anime is straight up your alley. However, with many other detective anime already showing the brilliance of the genre, this one's flaws and pitfalls are made even more evident. This one will just be another J.C. Staff Light Novel adaptation that is, surprisingly, par of the course for an extremely disappointing Summer 2011 season.",
            "date": "2011-09-13T05:39:00+00:00",
            "helpful_count": 88,
            "mal_id": 43259,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419459.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SamRavster",
                "username": "SamRavster"
            },
            "url": "https://myanimelist.net/reviews.php?id=43259"
        },
        {
            "content": "The word \"NEET\" is used almost interchangeably with \"bum\" and \"hikikomori\" in Japan. KamiMemo is about NEET detective Alice and her so-called assistant Narumi solving various cases in Tokyo with the help of three other NEETs and a Yakuza group. While the premise and the main characters are strikingly similar to that of Gosick, they are very different shows in that KamiMemo is more about the drama than mystery.\r\nThe story is arc-based with at most two characters for every case. This ensured great character development for the featured characters, which is the driving force behind this series. Unlike your typical detective show, the cases areoften simple. They're often very much solvable thanks to the abundance of hints planted throughout each arc. KamiMemo was far more engaging than Gosick to me as I found myself thinking about each incident with the characters rather than just watching a detective story presented to me. The downside of simple cases is that the story seems dull at times, though it makes up for it by adding drama and inspiration to the story.\\n\\n\r\nDespite being a detective anime, KamiMemo is filled with themes typically found in shounen (especially battle or sports) anime such as friendship, determination, justice/morality, belonging, search for a purpose in life, and love. There's also quite a bit of action, and like in the real life, many things are settled by brute force in the end rather than intelligence alone.\\n\\n\r\nThe characters are rather stereotypical, but the anime spends a significant amount of time developing each person involved with each crime. Though Alice, Major, Hiro, and Tetsu were underdeveloped and functions almost exclusively as case solvers to advance the plot. The focus is on Narumi's growth as a person and clients of the NEET Investigation Firm. Their past, hopes, and desires are carefully presented to build up for the climaxes. While it can difficult to accept the corniness of Alice's speech and the convenience of the buildups at times, you are always rewarded with touching drama and inspiration by the end of each episode.\\n\\n\r\nThe art and animation quality is absurdly high for a series of this type. Characters designs are very generic, but everything is detailed and maintains extraordinary consistency (even in a baseball filler episode). There are some sloppiness when characters are shown from distance, but this is only noticeable because of the amount of detail and fluidity in regular scenes. Overall, the visuals are far above par.\\n\r\nOP/ED are very addictive songs that fit the show perfectly (I didn't even skip them!). Voicing is a perfect match for every character, and BGMs were decent.\\n\\n\r\nEpisode 1 (double-length) was an original story specifically written for anime by the author of the novel, and in my opinion it was by far the best, most well thought out arc. I think this shows J.C. Staff's inability to properly pace and adapt novels. Everything was summarized pretty well in the final episode despite it being volume 1 out of 7 in the novels though. There were many instances where I felt the anime was saved by the inherent strength of its source material, but I found it to be very enjoyable overall.",
            "date": "2011-09-24T08:54:00+00:00",
            "helpful_count": 53,
            "mal_id": 44041,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=44041"
        },
        {
            "content": "Kamisama no Memochou (God's Notebook) is one of the slightly darker \"high school mystery\" anime I have watched. It may not seem like it at first, but this anime is not as lighthearted as something like Hyouka. Hyouka doesn't have anything like suicide attempts, money stolen from the yakuza, or mind-altering drugs.\r\nStory - 7/10\r\nThe only real problem with the story of Kamisama no Memochou is it's slow and cliche start. The first four episodes are really nothing special, but after that, the latter two slightly longer arcs that make up the remaining 8 episodes are almost as good of mystery arcs as some of theDeath Note arcs.\\n\\n\r\nThe story follows Fujishima Narumi. At the beginning, Narumi's nothing more than your usual male protagonist who is somewhat forced into an uncomfortable situation (he seems and looks a lot like Ryugamine Mikado from Durarara at first). Narumi's father works abroad for all but around 5 days out of the year, so he lives with his older sister who works to support both of them. Because of this, he is forced to move around often, has changed schools many times over the years, and has become used to moving and avoids making many friends. One day, he is up on the roof of his current school in Tokyo when a girl named Ayaka sees him. She is the single member of the Gardening Club and is growing plants on the roof.\\n\\n\r\nAfter forcing Narumi to join the Gardening Club, she takes him to a ramen shop which is where she works occasionally and where a group of NEETs (people who are not employed, in education, or training) meet. Narumi is welcomed into the group despite stating that he is not a NEET and has no intention of becoming one. The three NEETs are all there because they are working for the NEET detective, Alice, who lives in a room above the ramen shop (which is her main supply of food as well).\\n\\n\r\nAlice is an introverted detective with incredible hacking and computer skills who loves stuffed animals and a soda called Dokupe (which is clearly not advertising for Dr. Pepper).\\n\\n\r\nFrom there, the group is involved in several cases (as I mentioned, the first few are a little boring). Eventually Narumi gets more involved with the group and becomes more of a leader who has the respect of the other NEETs and a gang who is closely tied to the group of NEETs.\\n\\n\r\nTrust me, if you don't completely hate the beginning of the show, don't give up on it before Episode 5. The story really picks up then and Narumi starts becoming a much more interesting character.\\n\\n\r\nArt - 7/10\\n\\n\r\nAlice's room looks really great with the computer lighting and stuffed animals and the very final scene of the show looks spectacular, but other than that, the art is mostly average. It's set in a city, which is drawn well, but I think Durarara and Death Note (which have similar settings) have much better art.\\n\\n\r\nThe character designs are also similar to other characters (I mentioned before Narumi looks like a copy of Mikado with brown hair instead of black). Alice is your typical \"loli with long hair\" female lead as far as looks go. About the only design that stands out is Hirasaka Renji's due to his odd, dyed blond bangs which make him look more like a Yugioh character than someone fitting in with the rest of these more normal looking characters. I actually really liked his design since it was so unique and interesting.\\n\\n\r\nSound - 5/10\\n\\n\r\nThere's no problems with the Japanese voice acting, but the soundtrack is a little strange. It's usually not even noticeable (with the OP and ED [I don't include them in the score] overshadowing almost everything). There are a few good tracks, but there is also one weird \"song\" which sounds like a woman saying some words in English with long pauses in between each word. There's not much other than that that I remember.\\n\\n\r\nCharacter - 8/10\\n\\n\r\nI thought the characters at first were just a bunch of bland copy characters from other shows, but they really had some good development that changed my mind completely around 7 or 8 episodes in. I didn't think Alice ever really developed much, but she was interesting from the beginning so that's not really a problem.\\n\\n\r\nNarumi is definitely the most developed character in this show. Despite his whole reason for getting involved in this story being pretty cliche, he really does a good job and actually turns into a good leader. Several characters mention that he should become a con man, which I could see happening in his future if he wasn't so nice (though he has a nice breakdown later on).\\n\\n\r\nHinamura Souichirou (Hina) is also an interesting character. He doesn't necessarily develop, but he has a really good role in the first \"good\" arc. Hina is a gang leader with an extremely loyal group of followers. He can be very intimidating and strong when he wants to, but he is also kindhearted and has a very interesting backstory. He works with Alice and the other NEETs a lot and forms a strange bond with Narumi.\\n\\n\r\nThe other NEETs who help Alice are Tetsuo, who is skilled at boxing, Hitoshi, a skilled hacker who looks like an elementary school kid, and Hiroaki, a gigolo who uses his female connections as a wide source of information around the city. Along with them is Ayaka, who is only occasionally involved in the cases (the last one has a lot to do with her) and mostly just helps by working at the ramen shop and making sure Alice bathes.\\n\\n\r\nEnjoyment - 7/10\\n\\n\r\nWhile this anime gets off to a very slow start, it really picks up around Episode 5 and becomes a good, fairly dark mystery anime. The characters become much better after that point and just the overall arcs and story becomes much more unique. While there isn't really any overarching plot aside from Narumi's development, it's just interesting to watch as the story progresses. Kamisama no Memochou does a good job of pulling you into the NEET detective world it sets up in Tokyo and connects you to the characters slowly throughout the 12 episodes. Some similar shows would be the more lighthearted Hyouka while Durarara and Death Note have similar settings and some similar characters (Alice and L are kind of similar detectives who spend most of their time inside). Shindere Shoujo to Kodoku na Shinigami is a manga with a similar balance of comedy, drama, and somewhat dark mystery.\\n\\n\r\nI would recommend this manga if you like mystery anime at all. It may start out slow, but it's rewarding to stick it out until it starts becoming more unique around halfway through.",
            "date": "2013-07-22T14:50:00+00:00",
            "helpful_count": 34,
            "mal_id": 106387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=106387"
        },
        {
            "content": "To be honest, this anime is another one that present only moe and nothing else, and its worse than K-On as how its supposed to be a detective anime. The 'detective-ness' it gives is dull, so it fail to fulfill its goal as a detective anime and not like how K-On have achieved its purpose of being mass of simple moe and nothing else.\r\nThe girl named Alice, while many would find her cute and attractive, I find her terribly annoying and illogical. She said she had observed the world from her screen, which with that meaning that she have witnessed countless crimes and tragedies, yetshe will make a crying face when she unintentionally broke her chopsticks. Her intelligence did not meet up with her arrogance and demands at all as she couldn't figure out some obvious facts and have Narumi, a dumb average Mr.Mundane solve it for her, and she's supposed to be a genius detective right? And at the conclusion of ep1 she chose Narumi to be her personal assistance despite having other acquaintances she had worked cases with before(so maybe the ep1 case was their first case and Alice and team have never solved any crime before? oh they might be too busy setting up cameras around the city and work jobs to pay for all the cameras and screens, along with the massive electricity bill Alice devour each day maybe? That may be a logical answer to why she need Narumi, she couldn't solve stuffs herself like she's already supposed to be able to prior to the story), and lastly, the name 'Alice' is simply the most overused name of all Japanese fiction media, the reference to Alice in Wonderland now became non-existent and so the name can apply to all girls that lives in their dreamy room or have any relation with either literal, emotional or figurative fantasy, and it is not only getting old, but already had.\\n\\n\r\nLastly at the conclusion of ep1 they still didn't tell why the victim girl committed suicide. Yeah you might say its given that the girl was too pressured with life so she decided to die, that's really retarded, she was regarded as the 'perfect female of the school', if she can't handle it and yet have enough free time to get money from prostitution, keep a healthy relationship with a male and female friend separately, and along with keeping her 'perfectness' up, why not just yell at all those people pressuring her and loosen the valve to the point she can handle it? With that much given free time it should've been so easy, and if she was smart enough to do well in school she should've figured that out.",
            "date": "2011-09-04T03:02:00+00:00",
            "helpful_count": 30,
            "mal_id": 42679,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564349.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Shemyaza",
                "username": "Shemyaza"
            },
            "url": "https://myanimelist.net/reviews.php?id=42679"
        },
        {
            "content": "Kamisama no Memochou is an action/coming of age story about a young man in high school who is swept up into working for a detective agency headed up by a young girl (Alice) with extraordinary computer skills. She's more Victorique (GOSICK) than Sherlock Holmes, but she has a crew of NEET helpers who do the grunt work and she puts those pieces together with what she can find by either hacking databases or accessing surveillance cameras.\r\nThis is not a moe series, nor does it try to be. Yes, Alice is demi-kawaii and demi-tsundere, but as the series continues, she doesn't have that much screen-time. Thestories focus on the protagonist, Narumi, and how he manages to help those around him and become stronger in the process.\\n\\n\r\nThe series is solid in terms of production values, with good sound, art, and writing. The OP & ED are a bit lack-luster, though that's offset by the fact that the incidental music is really effective at times.\\n\\n\r\nThe comedic timing is good and the side-characters are interesting enough that you find yourself wishing that they had more screen time. Not all the cases/resolutions are serious and that gives the show a bit of an uneven feel, but it's not enough to take away from the enjoyment of the more serious arcs.\\n\\n\r\nOne of the biggest bonuses for me in this series (so far) has been watching minor characters emerge into significant and important roles. I haven't read the manga and the series hasn't concluded yet, and that will be the real test, whether they can pull all the threads together into an emotionally torturous and yet satisfying ending. If they manage that, I may upgrade my rating. For now, I'm going to wait, watch and see.",
            "date": "2011-09-05T08:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 42763,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/49064.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zirinbaku",
                "username": "zirinbaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=42763"
        },
        {
            "content": "Story: 5\r\nThe story shoots between complete predictability and utter nonsense. I still don't understand how the protagonist ended up as \"assistant\" to the detective other than \"Oh since you don't have anything else better to do with your time, be my assistant.\"\r\nArt: 8\r\nThe art is about the only thing going for it. It's well made. Then again, what isn't these days?\r\nSound: 6\r\nThe voices are ok. The op and ed are boring.\r\nCharacter: 3\r\nI have no idea what is going through the characters minds. The detective calls herself a NEET, but since she works as a detective, she is technically employed. Why did the protagonist join theyakuza? Are they yakuza?\\n\r\nThe behavior of the characters is confusing and nonsensical. Easily the low point of this show.\\n\\n\r\nEnjoyment: 5\\n\\n\r\nI was so confused I could not follow almost anything that was happening. I mean, following one episode was one thing, but I for a show with arcs, they did not play off each other very well.\\n\\n\r\nOverall: 5\\n\\n\r\nThe show gets a 5 (Mediocre) for its overall score. Descent art is brought down with a lackluster story and poor character development. Not really worth the time.",
            "date": "2011-09-09T22:43:00+00:00",
            "helpful_count": 17,
            "mal_id": 43045,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/166977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/varganator39",
                "username": "varganator39"
            },
            "url": "https://myanimelist.net/reviews.php?id=43045"
        },
        {
            "content": "First of all, I don't write reviews. I just watch the anime, take note of it, put a score on it, and remember it if was good. The fact that I'm writing this is quite important. \r\nNow I gave this a 10. \r\nStory: 10\r\nI had just finished watching \"The Mentalist\", a television show about crime and mystery, with comedy in between. So landing on Kamisama no Memochou was great for me. I was able to enjoy the story because, like \"The Mentalist\" the story was well thought out. The story starts and follows the general mystery solving format that makes it good. First, recognition ofthe crime, planning, first scouting, planning, first action, and then the reveal. Or something like that. I really appreciate that the series takes ~40 minutes to start and end a mystery. This shows that Alice and the detective squad are really well at what they do. Now of course there were stories that took longer than 2 episodes. These stories...omg they were awesome. Each scene exists for a purpose in the development of the detective skills. Each scene progresses the MC and the viewer ahead and also allows us to find the personalities of the characters involved. For a story that is deep, proper, and meticulous in the way the mysteries are solved I really liked it. \\n\\n\r\nArt: 9\\n\r\nI'm too picky about the art style since I understand each studio follows their own way of drawing. So every now and then I pause the episode to notice the detail in a frame. The art was well, nothing lazy. Sure, a few frames had simple drawing but nothing that would remove from the show a lot. Everything that needed focus had detail and that's all that mattered.\\n\\n\r\nSound: 8 \\n\r\nAgain, sound is great if it matters and if it doesn't then it's just another thing for the acoustic value in a scene. I like anime such as Kill La Kill and Katanagatari in the way they use a special song or tune for a certain type of situation or character (s/o to Blumenkranz for Ragyo). I noticed that in this anime there are a few empty scenes with no BGM. Otherwise there is something to fill the airwaves. And then there are a few reoccuring songs to match a situation, and I really liked that. I.e. when Alice explains something, a really cool female vocalization song starts in the background and adds a special intensity. \\n\\n\r\nCharacter: 8\\n\r\nNever get your characters wrong. I really liked how the characters in each crime were explained in a nice and detailed way. Sure, some of them were regular characters that already existed in our knowledge before they make their \"request\" but still...characters that stay for a short time or have importance for a short time still get enough presentation to show themselves to the viewers. Characters with longer importance are slowly revealed to the viewers. And I liked that. The pacing of revealing the backstories of characters was great. There were a few episodes just to reveal the backstories of two characters, and another single episode to reveal the story of another. Each was very well presented. The NEETs are highlighted for their abilities, and they're \"powers\" are constant, no deus ex machina here. I really like the MC because he isn't the dense type and he is smart in his own way. His pairing with Alice is great too and in that way the viewers get the inside scoop on what she is thinking because, as they point out in the anime a lot, the MC is talker and not a thinker. The reason why I think the characters aren't super awesome is because, well the author uses concepts so out of the norm that it becomes unique...and that hurts it a little. Near the end I saw the MC become a little different and succumb to the generic MC style where \"he is weak and confused but now he is strong, but isn't always strong...just when he wants to be\" and that was annoying to me because I really hoped the anime wouldn't end like that.\\n\\n\r\nEnjoyment: 10\\n\r\nLike I said, I just finished watching 7 season of \"The Mentalist\" in which I thoroughly enjoyed. Coming to this only helped extend the enjoyment I had in that show and so seeing the pacing of this anime and how there was a smart character who didn't do much, and a not as smart character who ran around a lot helped me relate back to \"The Mentalist\". For anyone who hasn't seen the show I'm talking about...well if you like to think a little in an anime and like a bit of problem solving and connecting the dots...I think you'll like this too.",
            "date": "2015-07-20T00:10:00+00:00",
            "helpful_count": 16,
            "mal_id": 193881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3683613.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlphXcalibyr",
                "username": "AlphXcalibyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=193881"
        },
        {
            "content": "Kamisama no Memochou is an amazing anime that shows how a little girl can solve different cases. Age does no really matter in being a detective. You just need good observation skills and the wits. ;) The main character really has a high pride about herself.. She is not just a detective... She is a NEET detective. ^^ I really liked this anime and the characters.. :D",
            "date": "2012-08-09T22:15:00+00:00",
            "helpful_count": 16,
            "mal_id": 69299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1448679.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/4unox3",
                "username": "4unox3"
            },
            "url": "https://myanimelist.net/reviews.php?id=69299"
        },
        {
            "content": "Kami-sama no Memochou (God's notebook) is a must-see series.  Bottom line.\r\nLike any series, it is hard to be hooked in right from the start, but there are dozens, literally, HUNDREDS of animes that start off that way but are now beloved by millions.  This short 12-episode series is among them.\r\nAs the story progresses, it keeps throwing you cliffhangers that make you want to see another episode and another and another and then BOOM!  PLOT TWIST!!!!!  TRAGEDIES!!! CONSPIRACIES!!!  DRUGS!!! GANG WARS!!!  EVERYTHING IS MOVING SO FAST!!!  The writing for this show got really intense midway through.  \r\nAnd eventhough it's done...\\n\\n\r\n...I still want more",
            "date": "2011-10-16T18:06:00+00:00",
            "helpful_count": 15,
            "mal_id": 45673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/541071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_TEKnician",
                "username": "The_TEKnician"
            },
            "url": "https://myanimelist.net/reviews.php?id=45673"
        },
        {
            "content": "Kamisama no Memouchou (God's Memo Pad) is a story about a boy who meets a girl, and in turn meets a group of NEETs led by Alice, the ultimate NEET detective who solves multiple crimes and mysteries in the city with little more than just her set of computers in front of her. It is short, so the maximum score that I can give this anime is 8 points, 8 points being the perfect 13-episode anime (such as Angel Beats!). 2 points are automatically deducted from both/either story and/or character respectively, since it is virtually impossible to produce a complete story and comprehensive character developmentin such a short number of episodes.\\n\\n\r\nBut on to review proper.\\n\\n\r\nTL;DR\\n\\n\r\nStory: 5/10\\n\r\nArt: 8/10\\n\r\nSound: 10/10\\n\r\nCharacter: 7/10\\n\r\nEnjoyment: 6/10\\n\r\nOverall: 6/10\\n\\n\r\nGood points:\\n\r\n-Very interesting characters\\n\r\n-Strong male and female protagonist(s)\\n\r\n-Exciting start, and touching finish\\n\r\n-Some funny interactions between characters\\n\r\n-Good art and sound, pretty solid OP and ED themes\\n\\n\r\nBad points:\\n\r\n-No central conflict, just main, separate arcs\\n\r\n-Gets boring towards the middle, and less insightful or amazing\\n\r\n-Lack of character development/back story for many supporting cast\\n\r\n-Insignificant conflict exaggerated by the whole detective idea leading to mediocre middle arc\\n\r\n-There includes 1 filler episode\\n\\n\r\nConcluding remarks:\\n\\n\r\nThis will be a disappointment if you are looking for:\\n\r\n-Good romance\\n\r\n-Good and suspenseful mysteries\\n\r\n-Action-packed sequences\\n\\n\r\nThis will be enjoyable if you like:\\n\r\n-Good humour\\n\r\n-Cute things such as loli detectives\\n\r\n-Unconventional things, creativity\\n\\n\r\nPlot: 5/10\\n\\n\r\nThe anime starts off like the usual - introduction of a kid in school called Narumi, who is quickly thrust into this NEET worlds, which becomes very interesting in the subsequent few episodes when they managed to solve the case of a murder. That's all fine and good. They also manage to solve a crime regarding misappropriation of funds, okay, that's the end of the first part, aka introduction to the life of Alice and her group of NEETs.\\n\\n\r\nThe second main arc describes the ongoing conflict between Sou and his long-lost friend, Renji, who fell out a long time ago due to a misunderstanding over a fatal incident. This particular arc I had alot of problems with. First of all, the relationship between Narumi and Renji was kind of boring. All they did was talk a bit here and there, meet up here and there, and poof they are sworn brothers. But not really, they still don't really know each other very well.\\n\\n\r\nThe other problem was that the entire conflict seemed too insignificant to invest a good 4 episodes into it. Two rivals who were once friends, fight in the midst a Feketerigo concert that is backed by the shadowy underground Hirasaka group, just because of a misunderstanding that they probably could have cleared up if they just talked. Nice twist at the end about the true fate of Hison after the stabbing, though. Still, it makes hardly any sense for two rivals to nearly try to kill each other over something that Souchirou obviously knows is a misunderstanding. They honestly are not taking this friendship thing too seriously.\\n\\n\r\nJump to the third main arc about the Angel Fix, and I must say, it was a pretty gripping plotline, albeit with tons of plotholes. Wait, so the police couldn't find out exactly where this drug was coming from and had to leave it to the NEET detectives to solve it? What the heck are the police doing anyway, they didnt even show up in the anime - oh wait, I believe Hirasaka group was standing in for the police. Ah that explains it.... Anyway, the other main problem was when they dramatically HAD NO CHOICE but to make Narumi take the Angel Fix drug, potentially risking death, in order to find the bad guy's hideout (and by the way, he even issued a challenge, so confident that it would not be found).\\n\\n\r\nHang on a second, it's all really touching but couldn't they have just trailed ANOTHER angel fix user? I mean, it's widespread right, there's absolutely got to be a chance to get hold of AT LEAST ONE OTHER angel fix user around the ENTIRE town! Oh well, even Alice didn't think of that. And the next thing, So Angel Fix users follow their \"illusions\" and this illusion somehow leads them to black alleys. I know hallucinations and drugs come hand in hand, but it's not technically possible to use a hallucination as a GPS/navigation system, especially since it's not possible to control exactly WHEN or WHERE the user takes it, and hallucinations often differ from person to person.\\n\\n\r\nIt started off well, was shaky in the middle, but ultimately managed to get off some flawed but at least touching story at the end. On the whole, the story was mediocre. There was also no main overarching story throughout, it was more like many separate events, with only two main big ones. I gave 2 points for the last arc and 1 point for the second arc, 2 points for the first introductory arc.\\n\\n\r\nArt: 8/10\\n\\n\r\nArt was definitely top-notch. I loved the OP and ED scenes, they were all so beautifully designed. Character designs were pretty neat too, they were all unique and there weren't two characters that were visually alike in every way.\\n\\n\r\nSound: 10/10\\n\\n\r\nOne of the best music tracks I've heard in a while. The OP and ED track were both absolutely amazing, and completely drew me to love the anime. Also, background music a suitable and was tense at the right moments.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nHere we go again. Another random kid who wants to do his best. It's the typical shounen character who meets the typical tsundere. Oh wait, no, actually they are not THAT typical.\\n\\n\r\nNarumi may look like the same old clueless dude that seems to be what all main characters sound like in all school-related animes, but he really isn't. He doesn't whine or be useless as often, and most of the time his determination and strength allows him to find out things that other characters miss. Hence, he is more than just a guy who receives growth from the other characters, he contributes to the team as well, and even early on.\\n\\n\r\nThen we come to Alice, who yes, is kind of stereotypical, but actually she's kind of cute. I love it when she blushes and I love how she calls all of her soft toys names (lol what kind of name is Moggadeet?). And as an avid lover of computers, it's a wonder she doesn't need to wear spectacles when she sits 30 cm away from 6 computer screens and just stares at them the entire day. She's abit useless though - I cant' really imagine someone not being able to open a drink can, yet being able to swing a bat (yep that's inconsistency right there).\\n\\n\r\nThe other characters, besides maybe Ayaka (main character in arc 3) and Sou/Renji/Yoshiki (main characters in arc 2), unfortunately, are sadly sidelined despite their awesomeness. You have Major, who is the genius inventor from college whom you unfortunately, after watching till the end of the show, have no idea where he comes from or whether he actually has a family. Next, you have Tetsu, whom you pretty much also don't know anything about. Then you have Hiro, the playboy whose promiscuity makes you wonder why he doesn't have aids yet.\\n\\n\r\nActually, if you think harder about it, you don't really know where Alice comes from either - how did she get so smart? How old is she even? Let's look at Ayaka - sure her dark past is intertwined with her brothers' but what about her interactions with other friends? Couldn't she at least have confided with some of her classmates, she must have some OTHER relationship other than that with Narumi. Her past? Umm... I don't really know. Other family members maybe? Only Sou/Yoshiki, I felt had any real substantial back story to them, but Yoshiki herself, had some lack in her story, since she wasn't a main character.\\n\\n\r\nSo in the end, while there is character growth, this is shown ONLY in Narumi, everyone else seems the same start to end, with a little growth in Sou/Alice regarding how useful Narumi is. Character background and development is greatly lacking in most characters, as most of them have linear/monofaceted personalities.\\n\\n\r\nMinus 1 point in growth, 2 points for lack of characterization. But the interactions between the characters are generally good, enjoyable, funny, touching, emotional and genuine. So at least, I applaud for that. The ending part was quite touching, Ayaka x Narumi is quite the destined pair.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\nI didn't rate this very high on the enjoyment scale, because I had to bring myself to watch through the middle segment of the show, rather than be so hooked that I HAD to watch it. I would have been fine with dropping the series halfway because it started to get slightly uninteresting. But, pretty distinct, strong personalities with interesting quirks and interactions, made the series quite enjoyable overall.\\n\\n\r\nOverall: 6/10\\n\\n\r\nThis is actually not too bad. It's two points off full marks. While it didn't fail to deliver a complete and satisfying resolution, it failed to properly fit into any real genre I could think of. I have a feeling it was going for this \"Mystery\" thing, but honestly, it llacked a lot of suspense.",
            "date": "2014-08-31T01:45:00+00:00",
            "helpful_count": 13,
            "mal_id": 158599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3899837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kaizersaber",
                "username": "kaizersaber"
            },
            "url": "https://myanimelist.net/reviews.php?id=158599"
        },
        {
            "content": "Kami-sama no Memo-chou  is not a typical mystery anime when the \"detective character\" seems to be a little like Sherlock. This anime is about \"NEETS\" or school drop outs that take requests from clients who need help in finding someone or figuring out why someone did something. Each of the characters in this anime have distinct personalities, some with the typical norms in other characters such as Alice; typical Gothic loli who is a bit of a tsundere - She is quite similar to the girl in Gosick.  \r\nConsidering how short the anime is it has a great story line and  youcan really get into it, I love this anime, the art is lovely, the characters are great and the story is good too. I love how the characters developed over the 12 episodes and how the anime hits home in reality and things that can happen in real life.  \\n\\n\r\nThis review is not very detailed due to spoilers and to be honest I am not good at typing reviews at all but I hope it at least helped a bit.",
            "date": "2014-12-04T09:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 171007,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1585859.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/EmmyBomb",
                "username": "EmmyBomb"
            },
            "url": "https://myanimelist.net/reviews.php?id=171007"
        },
        {
            "content": "When I saw the list of Summer animes, I was interested in this! So when I found out the episode was out already I was overjoyed! Though I was shocked to see it longer than usual (40 something minutes) .. I'll keep this short and simple because I've only watched one episode  but I agree with roriconfan's recommendation.\r\nThe potential is there but the actual anime is not. The motivation for me to watch this cute loli was because of the twist of being a \"NEET\" (my first time experience in having a main character like that). Though as it progressed, I was losing myinterest but the thing that kept me strong was the interest I had for this and the case being solved! \\n\\n\r\nAt the end, I was disappointed. The crime was very simple but it seemed like no one knew why the girl disappeared or her motives. Even if it was said it to her best friend (in the flash back) and when they find it, it's like OMG WHAT HAPPENED? Probably the most interesting concept of this entire thing was how they found her and the quote POSSIBLE SPOILER:  \"I wish time could stay frozen like this forever\"  The anime doesn't let you know much while trying to solve the mystery but Alice (our loli) knows all. This anime ... (I hate comparing but...) was like Gosick but worse. The pairing, the mystery of it all, but the twist of technology and NEET-ness. Was the very end a bit of fanservice? That I was disappointed it. \\n\\n\r\nI'll watch out for the next episode because I still like the concept  but I'm possibly dropping this one from my anime list. ;c",
            "date": "2011-07-11T22:35:00+00:00",
            "helpful_count": 12,
            "mal_id": 39006,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/504061.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Luminsity",
                "username": "Luminsity"
            },
            "url": "https://myanimelist.net/reviews.php?id=39006"
        },
        {
            "content": "Overall [9/10]\r\nThis was.... amazing. Throw away the typical geniuses (although the characters are in their own way) and place people who decide to find something better in the world in a different ways.\r\nPlot [8/10]\r\nThe plot may seem a bit of a lackluster at first but before you know it, you're stuck in their loop, unable to tear your eyes away from the screen. Watch the protagonist go from someone who barely interacted with anyone and threw around fake smiles to one of immeasurable power and find his own worth, neither exaggerated nor underestimated. Narumi was heartbreakingly human.\r\nCharacter [9/10]\r\nAlice; the speaker of the dead. While uncovering,she shoulders the burden that she could have done something had she been earlier, but she always reaches one scene too late.\\n\r\nRenji, Hiro and Master; seeing the world with different eyes through connections and technology, usually indirect than direct.\\n\r\nSou... the anti-hero in the story. Doing things that people in full view of the public cannot, bring justice his own way even if its outlawed.\\n\r\nNarumi... the high school student that wanted to find the bigger picture, something bigger than life and found it in words he spoke and wrote.\\n\r\nThe main cast were beautiful and flawed in their own ways, so I loved them all, even the supposed villains who were also trying to find their own place.\\n\\n\r\nIn general, I love this anime ;)",
            "date": "2015-06-10T19:55:00+00:00",
            "helpful_count": 11,
            "mal_id": 190048,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4452693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/br0kenphantasy",
                "username": "br0kenphantasy"
            },
            "url": "https://myanimelist.net/reviews.php?id=190048"
        },
        {
            "content": "I am a fan of detective-like stories. And being a NEET myself, I can somehow relate here to Alice. And just as she said\r\n\"I have been gazing through windows across the internet to see the world. A grossly limited and twisted world, isn't it?\"\r\nAnyway, I just finished seeing this anime. Knowing it's been completed quite a while back, I've only got the time to watch it recently. And I'm glad to have watched this series. It got me really satisfied with all the turn of events.\r\nThis was another series that got me really hooked up from the very first episode up to the last. ifonly I could watch it continuously without stopping, I might have.\\n\\n\r\nStory: Great stories. There are some episodes that kinda throw me off a bit. Like I would have thought to myself \"seriously, this is just a stupid kind of case. you just wasted an episode!\" But after sometime, things began to get interesting once more. Yeah, the story was just your typical detective story there is. But it has something that not all detective stories have. It has a great plot. Something that's continuously progressing until you reach the very conclusion of it. every episode has deeper meanings than just seeing it. It's like you don't have to watch it with your own eyes and just enjoy the episode or get bored by it. You have to watch it very seriously, carefully, chewing every words, digesting every information and let the conclusion not just stir your brains but your very emotions as well.\\n\\n\r\nArt is Good. typical art. Not very catchy but at least it doesn't hurt the eyes.\\n\\n\r\nCharacters are quite great. they have really different characters being portrayed. Not everyone is similar. Really unique individuals that found each other and formed a bond. Well, that's how things are but then there was not an annoying character ever in the whole series.\\n\\n\r\nEnjoyment, well yeahh I actually enjoyed the whole series. Like I said, I am a fan of detective type stories.\\n\\n\r\nOver all: This is just a great anime. Totally love everything about it. And the ending is beautifully written and portrayed. A bit sad, yeahh but the kind of sadness that doesn't really hurt. Two thumbs up.\\n\\n\r\nThis might be below the belt/crossing the line but those who rated this anime low might have watched this only with their eyes. They didn't savor every moment and maybe didn't really get the true meaning behind the story.\\n\r\n But then, every people has their own opinions, so I'm not one to talk.\\n\\n\r\nEnjoy!",
            "date": "2012-03-04T05:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 55297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/726633.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Rei-chii",
                "username": "Rei-chii"
            },
            "url": "https://myanimelist.net/reviews.php?id=55297"
        },
        {
            "content": "\" I'm not a detective. I'm a NEET detective. Speaker of the dead. \" - Alice\r\nThe story is not that great, the art is fine as well but the characters are the things that stole my heart. Different from other detective-style anime where the side characters are not the main attraction, this anime defined the side characters quite well, from a mafia boss that looks tough but has a soft side, an agile ex-boxer who represents the strength, a university student known as 'major' specializing in surveillance system, a playboy with extensive roots with the girls, to our lead characters.\r\nAlice is the center of theteam, being the expert loli hacker and the master of deduction, collecting info from all sort of Internet-related technology to deploying strategies to solve the cases requested, while taking care of her stuffed bears and drinking soda which her refrigerator is stocked with. Narumi, unlike other lead male character is not that smart at all, but rather, an average guy with no special skills or anything. However, he does has his perspectives on things and his own principles when dealing with certain things. After joining NEETs, he learnt more about himself and the extent of what he will do given the circumstances involving his friends in danger, which will change his way of life forever.\\n\\n\r\nThe focus of this anime is not on the cases, but rather about the complexity of emotions, the portrayal and the true meaning of different kind of relationship as well as the hidden truth to be discovered. Overall, if you're looking for an anime that is emotionally-satisfying with a bit of drama and mystery included with a loli hacker and an ordinary assistant with well-defined side characters, you're in luck.\\n\\n",
            "date": "2018-12-18T09:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 296060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7568325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ethan_07",
                "username": "Ethan_07"
            },
            "url": "https://myanimelist.net/reviews.php?id=296060"
        },
        {
            "content": "Imagine a riding a rollercoaster. It starts off by building up your excitement as you are slowly ascending the tracks while, at the same time, speeding up. The rest of the ride then consists of ups and downs, loops and turns, and random spins, before ending with a final surge of exhilarating speed. That is how I felt when watching Kami-sama no Memo-chou. The first episode made the series seem promising but it eventually failed to deliver, despite having a decent ending. Let's see how it fared in the usual four categories of art, character, sound and story. \r\nArt (7/10)\r\nAnimation quality usually takes a backseatto the characters and the story when I watch anime. However, when those two categories end up being bland and uninteresting, I am forced to focus on other aspects of the episode just to prevent myself from being bored out of my mind. The artwork in Kami-sama no Memo-chou isn't outstanding, but it isn't horrible either - just your typical run-of-the-mill quality. Nothing more to say here so let's move on. \\n\\n\r\nCharacters (6/10)\\n\r\nMaybe a 6 is a bit generous for this category because, at the end of it all, I couldn't really say that there was a character that I \"liked\", unlike in most anime that I watched. Yes, there was some character development, but there wasn't enough for my liking. My image of the main protagonist, Fujishima Narumi, didn't change at all throughout the whole show; he was still a plain and boring character to me, for the most part. On top of this, I slightly disliked Alice and her personality. The previous sentences are, however, just my opinion so you may not necessarily agree. However, I do believe that I'm not the only one who feels this way. Non-memorable side characters make this category suffer even more. To sum it all up, the characters in Kami-sama no Memo-chou are nothing to be happy about, so don't expect a lot if you are someone who pays a lot of attention to character development. \\n\\n\r\nSound (7/10)\\n\r\nOnce again another generous mark is given, this time to the sound category (it may seem like I'm starting to pity the anime and that's probably the case). Aside from the OP, everything was just \"decent.\" The ED, BGM and voice acting were, at best, average. With that being said, I admit all my expectations were lowered drastically midway through so this category should technically receive a lower score than what it currently has. Anyhow, I found the OP to be the lone bright spot in terms of sound. Kawaru Mirai only took a few episodes to get me like it. It is upbeat and catchy with surprisingly good vocals to go along with it. You can say that half of my motivation to download and watch each episode was because of the OP. \\n\\n\r\nStory (7/10)\\n\r\nOne may choose to say that, if the story is able to overshadow everything, bad art, characters and sounds can be excused. However, this is unfortunately not the case for Kami-sama no Memo-chou as the story is just as bad as the other categories. Maybe it won't seem that way after the first episode, but as the series went on, the story definitely didn't live up to the expectations of many viewers. There were some parts which were surprisingly interesting while others were absolutely horrid. Looking at the big picture, I personally didn't feel that the plot advanced far enough. For a 12-episode season, the story moved way too slowly with barely anything important happening. It is only during the last few episodes that the plot was developed the most. Overall, a disappointing story. \\n\\n\r\nOverall (7/10)\\n\r\nKami-sama no Memo-chou is a good example of a light novel adaption gone wrong. Average artwork, boring characters, unimpressive sounds and a disappointing story just screams \"don't waste your time!\" While I don't want to scare people away from watching it, I would just like to give a word of warning to those who are not sure if they should watch it for not. By all means, go try it if you have nothing better to do or like \"mystery\" anime. Whether you agree or disagree with me at the end of it all is totally up to you. All I will say is this: while it is supposedly a \"mystery\" anime, Kami-sama no Memo-chou is undoubtedly unable to reach the level of success that big titles such as Detective Conan have. Don't expect too much.",
            "date": "2011-11-16T07:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 47567,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=47567"
        },
        {
            "content": "Kamisama no Memochou is not an anime for you if you're looking for real detective-mystery. It deals with relationships between the characters and the problems they face, which the loli detective solves for them. If you don't like lolis, rest assured, there is more emphasis on the reckless main character, the people around him and the yakuza.\r\nStory: 7\r\nDecent story, good concept. I like how the story turns from loli to yakuza and brotherhood. There are different arcs which are all interesting. The last two arcs were especially interesting.\r\nArt: 8\r\nGood animation, thankfully, the characters didn't look like kids. The animation is smooth enough.\r\nSound: 7\r\nVoice acting wasgood, opening was a big disappointment (I listened to it every episode and I still forgot how it went). The ending was okay. The background music was really good.\\n\\n\r\nCharacter: 8\\n\r\nOther than the irritating tsundere loli, all characters were really good. Thankfully, the main character is reckless but not an idiot. There are many cool male characters and also a lot of character development between each character. There are less female characters but they, too, were good.\\n\\n\r\nEnjoyment: 8\\n\r\nI thought it was boring until episode 5. But later, it was all about yakuza and promises. Then it went into drugs and a lot of other things. \\n\\n\r\nOverall: I'd say 6.5 something but I'll give it a 7\\n\r\nIt was rated less, even though I praised it this much because it didn't turn out to be a good mystery anime. I can say, Kamisama no Memochou has more drama than mystery. Nothing is so mysterious about it. Being a huge mystery fan, this was a let down. It's worth watching but I wouldn't watch it again.\\n\r\nGive it a try.\\n\\n",
            "date": "2015-06-13T22:47:00+00:00",
            "helpful_count": 7,
            "mal_id": 190267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2019857.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/guddi",
                "username": "guddi"
            },
            "url": "https://myanimelist.net/reviews.php?id=190267"
        },
        {
            "content": "Kamisama no Memochou (Heaven's Memo Pad) has really good art and character design. The animations by J.C. Staff once again are on par with shows like Railgun and Index the environment design especially are great however the story is dreadful and doesn't even make sense half the time. I was truely disappointed by this such a good art style and character design yet such a shit and terrible story. If your looking for a 12 ep filler because your bored or have nothing else to do its worth watching however if you are wanting some good story and enjoyment don't go anywhere near this shitshow.",
            "date": "2014-01-18T19:07:00+00:00",
            "helpful_count": 6,
            "mal_id": 129283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1699879.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/cra0",
                "username": "cra0"
            },
            "url": "https://myanimelist.net/reviews.php?id=129283"
        }
    ],
    [
        {
            "content": "Considering I personally own this within my collection, I chose to resume watch of this since I had dropped it nearly two years earlier. While I find the premise on a detective agency of NEETs to be somewhat absurd, I do admit that Heaven's Memo Pad has its high points. The series features the mentioned NEET detective agency tackling different cases involving some touchy areas of Japanese society like compensated dating, the yakuza and a drug trafficking ring. For the most part, the storylines for the cases are handled quite seriously with Alice, her assistants and other contacts investigating them and the show exploring theramifications concerning those caught up in the questionable activity. Some of the cases, in particular, involve some of the major characters on a personal level as they explore the backgrounds of said characters, like Yondaime and Ayaka. Male lead Narumi serves as \"straight man\" to the eccentricities of the NEET detectives and quite often finds himself assisting in their cases, being quite capable of helping them land leads for cases in surprising and believable ways.\\n\\n\r\nThe series does have its issues though. Alice and her assistants are quite limited in depth and development for their characters, the former especially an issue as much of the progression with cases in this series stem from Alice's expertise and knowledge with computers and human behavior. Heaven's Memo Pad also seems to make big efforts in trying to glorify being a NEET through Alice and her cohorts and dabbling into moe pandering with Alice's character, both being detractors because of their clear gearing towards the otaku crowd. A couple cases also slip in their quality as they're mostly used as reprieve from a case arc by incorporating more comedy than usual, though these efforts came across as quite flat for me.\\n\\n\r\nVisually, Heaven's Memo Pad is solid in the designs of characters and scenery sporting vivid colors and a good amount of detail with the various city landscapes, insides of buildings and even the inside of Alice's apartment with its various computers and stuffed animals. Animation is implemented where needed in dramatic and tense moments during cases which can look decent in motion, though the series usually resorts to still shots in mundane scenes.\\n\\n\r\nOverall, Heaven's Memo Pad is solid in telling engaging and tense stories with many of the cases that Alice and her detective agency tackle, exploring some of the show's prominent characters and delving into some touchy social issues. The show has its shortcomings in a couple episodes, the lack of depth on Alice and her assistants and trying to appeal too hard to the otaku fanbase with its glorification of being a NEET and exploiting Alice as moe bait at points. Still if you can look past the issues, this is still a solid series worth looking into.",
            "date": "2013-05-07T22:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 96383,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=96383"
        },
        {
            "content": "While I might b biased in this one, I still would like to state my reasons on why I like this show, basically what caught my eye on this was the fact that it's so plain that it makes me curious, I mean a new guy in a new city trying to adapt to his new world meeting an extraordinary girl and friends, but before I knew it I found that the plot (at least for me) was unique in it's own way.\r\nStory\r\nLike I said It's cliche, but one thing I found out here is the concept of soul searching, as Narumi tries to adapthe slowly tries to fit himself and get along with others, something that I would appreciate and would find realistic, also I find the neet detective stuff unique.\\n\r\nyes it's not real or cool, but the fact is they are just a bunch of ordinary guys (except for Alice) who can do extraordinary things.\\n\\n\r\nEach arc we're unique in it's own ways, they don't overreact too much like so many \"badass\"  or cool fanservice, just dudes doing their job and that's it, and they pulled it off.\\n\\n\r\nCharacters\\n\r\nLike I said they are unique in their own way, this would probably what Bandura would say as Collective efficacy, the characters aren't really just that similar to each other but they get along and manage to solve difficult cases, on the other hand though Alice was kinda meh, I guess because I find her character too cliche, I mean (Loliness, check, Brains, Check, Fanservice Check, Romantic feelings, Check). \\n\\n\r\nNarumi is a type of character what I consider as underdog, he starts off as nothing but slowly evolves and ends up getting along well, able to adapt and make decisions etc..\\n\r\nwhat I learned though is that these characters taught us that even ordinary man can do extraordinary things and you don't need to be so good at those things to start with.\\n\r\nanother thing I wanna pinpoint i the lack of development with Hiro Tetsu and Major true they main character's but i feel like we need to know them more.\\n\\n\r\nSame with Ayaka, she's not annoying but I think her role on the story is just to Introduce Narumi to Alice, i would love to see them together though \\n\\n\\n\r\nArt and Sound.\\n\r\nthe art is pretty generic for me, but then again that what caught my attention (probably because a lot of anime's have too much fan service), I like Narumi and the Fourth's design, they seem simple but just once glance it's like you're feeling that they have potential.\\n\\n\r\nThe Sound is great, for me, I didn't skip the opening and ending and some OST's we're great but some are meh.\\n\\n\r\nOverall I did enjoy it there are major questions but what I can tell is that even the most plainest anime can be so interesting",
            "date": "2018-08-11T08:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 286187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=286187"
        },
        {
            "content": "I can't say that i was looking forward for the \"next episode\". The way the plot starts and the way the story goes it makes you feel a bit bored. Only in a few occasions you find yourself interested but only when something is about to be revealed. From the characters only few have their own back-story, but not that many details. It's not an anime you are going to watch again but just another title on your list.",
            "date": "2014-08-29T21:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 158475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4036209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JOeXX5",
                "username": "JOeXX5"
            },
            "url": "https://myanimelist.net/reviews.php?id=158475"
        },
        {
            "content": "Kamisama No Memochou (Heaven’s Memo Pad)\r\n= Minimal Spoilers: There will be some references to traits of the story/plot and characteristics of characters in the anime, but no details that would spoil the enjoyment of the anime will be included. =\r\n//There are only two professions in the whole world that give meaning to those who have died and what have been lost... They're writers and detectives. Writers are the only ones able to revive what was lost through their visions. Detectives are the only ones able to dig up the grave and bring back lost information. But the information us detectives dig up is nothingmore than the truth as recorded in Heaven's Memo Pad.// - Alice\\n\\n\r\nIf I were to pick a word to describe my feelings towards Kamisama No Memochou, it would probably be ‘ambivalence’- I love it and hate it at the same time.\\n\\n\r\nSo what exactly is Kamisama No Memochou:It’s the Only NEET Thing to Do or Heaven’s Memo Pad (HMP) all about? To summarise, it is a mystery anime that follows a male protagonist and a group of self-proclaimed NEETS and their loli leader, Alice, as they solve a series of interlinked mysteries that happen in their city-each mystery, varying in implication and scale. Despite all the sarcasm that this plot has generated, I found myself intrigued with what an anime which amalgamates NEETs and Mystery would be like and how the producers would intertwine and portray these elements.\\n\\n\r\nHMP’s mysteries can be described as focusing on revealing the background stories of individuals-who are unable or unwilling to share their perspective. Instead of relying on plot twists, complicated foreshadowing and epic cliff hangers, HMP decides to throw all those away and present less convoluted stories that feel more ‘realistic and plausible’. Oddly enough, I found myself enjoying the refreshingly (relatively) relaxed pace of the mysteries. For once, I could actually focus on the stories, rather than divide my attention between watching and theorising at the same time. While the mysteries can be a bit inconsistent at times, with the second last arc feeling like a filler, they are mostly enjoyable, especially the last mystery which timely speeds up the pace for a climax to emerge. While these mysteries aren’t masterpieces, they were great and really interesting to follow.\\n\\n\r\nUnfortunately though, there were several downfalls in the anime that made these mysteries less enjoyable. The first would be that the anime relies on coincidences, which seem out of place, far too often. Moreover, while the mysteries themselves were great, the linkages between them were weak. More often than not, HMP relies on one of the mentioned coincidences to transition from one mystery to the next. The transition is about as smooth as a transition from a discussion about a serious mystery to one about cookies based on the coincidence that someone found a cookie. More infuriatingly, the anime seems to have a habit of forgetting mysteries after the transition has been made. Hardly will it ever reference past events in the anime, and even when it does, the reference is in the form of the superficial return of a few side characters. It truly would have been nice for something gleaned from one of the earlier mysteries to have had an impact on one of the later ones.\\n\\n\r\nTransition aside, one of the biggest issues with the anime in my opinion is that the role of the theme of NEETs in this anime is superficial and feels as though it was lacquered on in a desperate bid to make the anime stand out from other mystery anime such as Gosick. (which also coincidentally has a loli detective and aired the season before) Had it not been for the characters’ consistent self-proclamation that they were ‘NEETs’ and Alice’s contentious declaration that she was not just any ordinary detective, but a ‘NEET detective’ almost every episode, the aspect of NEETs would be completely unidentifiable in this anime. This is especially so since the detectives who call themselves NEETs seem to be defying the very definition of the term, “Not in Education, Employment, or Training,” by actively engaging in detective work and in Major’s case, attending university. Whether this actually counts as misnomering or not is up to you to decide, but that the anime failed to provide a meaningful perspective on the life of NEETs in spite of it promoting itself as having NEET themes is truly disappointing and annoying. At the end of anime, little or nothing  has been revealed about what motivated the characters to become NEETs in the first place or their plans for the future-some aspects that I expected to be addressed from an anime with ‘NEET’ in its subtitle.\\n\\n\r\nA similar disappointment was felt towards Alice, the poster girl of the anime. While having a character with unique traits is often welcomed as creativity, having the traits added in a slipshod manner only leaves a sour taste that should never have existed in the first place. In the case of Alice, her quirk is that she is an extremely precocious, bratty, easily embarrassed, loli, NEET detective cum hacker who loves soft toys and Dr Pepper. (that’s a mouthful) Unfortunately for her and us though, she doesn’t have much going for her apart from these superficial features. Moreover to the viewers misfortune, the way that these traits are portrayed is jarring and blatant. Imagine our loli detective talking about a mystery one second and then asking for a Dr Pepper the next, before proceeding to do some hacking and then arrogantly correcting the main character for calling her a detective instead of a NEET detective- this is how the producers decided to remind us of Alice’s ‘unique’ character over and over again. Charming isn’t it? You can’t really get less subtle than that. These forced characteristics genuinely made Alice really unnatural, shallow and unlikable as a character to me. Even without them though, Alice’s character like her stature suffers from a lack of development throughout the anime. \\n\\n\r\nApart from Alice, the other NEETs in the anime don’t really have any development or depth either. Almost nothing about about these characters-why they chose to become NEETs and how they met each other-was shared. While I wasn’t as bothered by their shallowness as I was with Alice’s since they are side characters after all, I feel that some of the time spent on the dr pepper dialogues could have at least been reallocated to character development for these guys. Moving onto the other side of the spectrum of uniqueness, we have Narumi, our generic male lead who in spite of getting some development was rather forgettable. Some more time could have also been spent on his background to make it as good as those of the characters which the mysteries focused on. \\n\r\nApart from these character weaknesses, the characters in HMP also generally suffer from poor dialogues, which feel forced and unnatural at times. \\n\\n\r\nHowever, while Alice and the majority of her gang were really disappointing, there were some unexpected gems in the character aspect of this anime. The first would be Ayaka, who in spite of her short screen time did manage to bring some emotion to the otherwise phlegmatic anime with her interesting story and role in the anime. The second gem, or group of gems rather, would be the gang members, who added a touch of humour to the anime. The last in my opinion would be Souichirou, Hinamura, the avuncular yet brute leader of the yakuza who really stole the spotlight. Not only does he admittedly get a better background story than our main characters, but also unlike them, has a unique and likeable personality which is not blatant. In all honesty, I think he deserves that spot on the poster picture more than Alice. Then again though, sales for the anime would have dropped if it had a middle aged yakuza on the cover rather than a loli detective. \\n\\n\r\nProduction-wise. The animation is for the most part attractive, albeit but generic. However, there are moments when I felt the animation does seem clumsy or overly dramatic though (particularly the last scene of the op when the camera zooms towards Alice’s eyes and the very last scene of the anime). The music of the anime, however, is only decent. The OST gets it’s job done, but isn’t really anything worth noting. By the end, I probably skipped the OP and ED at least 50% of the time.\\n\\n\r\nOverall, while HMP does have some great story elements and background stories, it also has a number of glaring flaws, which detracted from my enjoyment of the anime. Had the anime been less superficial in its a slipshod attempt to present itself as different, I believe I would have enjoyed it a lot more. I would still give this anime a recommendation, but only to those who are new to mysteries or those who want to try a slightly less intense and less confusing mystery anime. Those who like this anime may also like Hyouka, which is even more casual paced and even more beautiful than HMP, and Gosick, which also has a loli detective, but follows a different plot structure of having several small arcs which piece together in a grand scheme.  \\n\\n\r\n- Forgotten_Memo",
            "date": "2015-08-31T08:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 197557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4570032.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Forgotten_Memo",
                "username": "Forgotten_Memo"
            },
            "url": "https://myanimelist.net/reviews.php?id=197557"
        },
        {
            "content": "This is a very good mystery anime. Whit lovable characters great animation and music. There are multiple story arcs concentrating on different characters. While the mysteries them selfs are not very complicated they are very well done. As for the characters they are mostly well done but some don't get much attention, like Alice's 3 helpers. As one of the main characters Alice also didn't get much back story to how she became a detective. Narumi also felt generic as an Main character, but that's just how i felt about it. Over all if you like mysteries with a darker tone this will be greatfor you as well as fun.\\n\r\np.s The Fourth is a badass",
            "date": "2015-02-17T12:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 180655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4226997.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xFoXz",
                "username": "xFoXz"
            },
            "url": "https://myanimelist.net/reviews.php?id=180655"
        },
        {
            "content": "Kamisama No Memo Chou is a very well written series, which exceeded my expectations in plot, art, and its characters.  Though I was wowed by my original expectations based on plot summaries on MAL and Countdown.Mandragon, there were still a few draw backs to the series in the aspect of emotional attachment to the characters themselves.\r\nThe plot seemed pretty straight forward, however like any detective type series it was quite easy to get drawn into the story as you attempt to figure out the mysteries and root for the protagonists as they attempt to undo what they discover.  It was well written asthe series crescendo nicely as the characters grew, the action increased, and the stakes raised to a dramatic conclusion.\\n\\n\r\nThe art was good, and well drawn though it lacked orginality and flair.  As you watched the series you will see the solid skills of the artists in their characters and their backgrounds, however it is missing that special something that could of made it a masterpiece.  It is easy to get lost in the mix of the other animes out there as far as the art aspect goes.\\n\\n\r\nThe characters have a realistic relationship as their bonds grown stronger and stronger throughout the anime.  This applies to all but Alice, as her hikikimori like condition was able to start a NEET detective agency, but as typical I digress.\\n\\n\r\nDespite a few knit picky issues I had with this series I have to reitterate that it was surprisingly entertaining as well as a solid series, which I looked forward to weekly.\\n\\n\r\nRating 7/10\\n\\n\r\nPOSTED BY @GameJok3r\\n\\n",
            "date": "2011-09-28T21:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 44375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=44375"
        },
        {
            "content": "Heaven's Memo Pad may seem like a noteworthy anime at first glance. I mean, the concept is a fairly interesting one. A bunch of NEET's spending their days solving mysteries? I for one, found this to be an intriguing premise, and as several fans of the show compared it to the excellent Durarara!! and the somewhat disappointing but still decent Eden of the East, I pre-ordered this show and couldn't wait to watch it. Imagine then my disappointment when I finished the last episode, only to feel cheated, angry, and somewhat sad as just how much of a missed opportunity this show turned out tobe.\\n\\n\r\nI could go into depth about each and every single character, but I really don't see any point to it, as not a single one of them has anything noteworthy about their personalities or designs that make them stand out in the slightest from your stereotypical slice-of-life anime, not at all helped by how overly sexualized every single female character is in this show. The main protagonist Narumi Fujishima may be the most whiny, self-righteous hypocrite I have ever seen in an anime. This is made ten times worse by the fact that every single character in the show seems to worship the ground he walks on. Not that the rest of the cast is any better. Yes, even the much revered Alice, the heroine of the show, fails to be memorable in the slightest. This isn't entirely because the character herself is bad per say, as I'll admit she is at least somewhat better than the rest of the awful cast this show has. It's rather because the show prefers to show her being a stereotypical tsundere crying because her teddybear got dirty than ever actually showing her intellect, which we are told about at least thrice every episode, but never get to witness first-hand. She's supposed to be an ace-detective and master hacker, yet we never ONCE see her actually conduct any research or get to see her thought-process when solving a crime. Rather, she just tells us how the crime was done, and then it's back to showing her getting scared because the lights went out.\\n\\n\r\nNow, this wouldn't be such a big problem if it wasn't for how seriously the show takes itself. More than once I found myself surprised at just how deeply the show wanted me to care for a character I had just been introduced to. Or other times, it would show just how \"close\" Narumi was with a person he had met twice, and hardly even gotten along with at first, before suddenly having no qualms about sacrificing his own life for that person. This is only made worse by how poorly told most of the \"mysteries\" are, which range from being mediocre to flat-out offensive, but I'll get to that in a second.\\n\\n\r\nThe \"mysteries\" themselves are often not even mysteries at all, and instead of actually giving the viewer the necessary clues to solving the crime on their own, the show rather purposefully HIDES information from the viewer until the last second where they will quickly explain the mystery in a way that makes it seem like even the writers of the show have lost interest and just want to explain it quickly and be done with it. Each episode often ends with an incredibly cliched and boring \"philosophical\" (and I'm using this term loosely) monologue which only serves to hammer in the point the episode very obviously is trying to get across. Most of these points are either incredibly obvious, or just downright stupid, but it wouldn't be such a problem if the show didn't constantly shove this point down your throat just to make absolutely sure that you get it.\\n\\n\r\nThere are plenty of other problems with the show as well, like the mediocre voice-acting, the forgettable soundtrack or the cliche script. But by far the biggest problem the show has, is just how UNINSPIRED it feels. This show claims to be about NEET's, showing the society that scorns them just how much they are capable of, yet it's hardly ever brought up, much less focused on. Alice is the only NEET in the entire show with any importance whatsoever, and even then it's not as if the show actually discusses this matter at all. Not a single character ever looks down upon or even seems to care that she is a NEET, nor does it add anything to the story. The writers or the show could have easily cut out the fact that she and some of her friends are NEET's, and the story would not be altered in the slightest.\\n\\n\r\nThe other topics the show focuses on, like prostitution, drug-addiction and gang wars are all horribly presented, and obviously written by people who have no knowledge or understanding of any of these topics. The gang war is portrayed in such a black and white manner it borders on being comical, and the shows portrayal of drug-addicts is so biased and ignorant it is bordering on being offensive. The show portrays drug-addicts as literal scum, people with no sympathetic traits whatsoever, only looking to hurt others and get high, because as we all know, drug-addicts are all evil and hate everything good in the world. Having known several people whom have struggled with drug-abuse, I can't say how distasteful this show portrays drug-addiction and it's victims. The entire moral of the \"drug-arc\" seems to be that all people who do drugs are evil, and they should be scorned rather than helped. Honestly, as if the show didn't do enough wrong already, it will now try to force a very ignorant message on it's viewers when it's crystal clear the writers of this show have no knowledge on the subject.\\n\\n\r\nDespite how much I've ranted, not every little thing about this show is terrible. The show does have some decent animation, and while it fails to deliver any of what it promises, it does, if nothing else, at least have the potential to be good. Had the show been given more time to establish it's characters and storylines, as well as being written by more talented writers, I have no doubt this could have been a good, if not even great show. As it currently stands however, it is not a show I would really recommend to anyone, no matter their preferences, as there are much better shows that go into a lot of the same subjects as Heaven's Memo Pad, like Durarara!! or Paranoia Agent, and unlike Heaven's Memo Pad, they are written by people whom seem to actually know what they are talking about. If none of my arguments have shaken your resolve to watch this anime, at least be wise enough to watch it online first to be absolutely sure you actually want to PAY someone for this drivel. Your hard earned-cash is better spent elsewhere.",
            "date": "2014-02-21T18:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 133395,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1244833.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Dr_Peace",
                "username": "Dr_Peace"
            },
            "url": "https://myanimelist.net/reviews.php?id=133395"
        },
        {
            "content": "Firstly, I'd like to give thanks to NEO magazine, a UK magazine giving features such as Asian music, recipes and, of course, anime and manga, features and reviews. And so praise is given to NEO for piquing my interest in this series, of which I didn't know even existed until NEO highlighted it. Anyway, formalities over, let's jam:-\r\nStory:- I'm just giving a \"brief\" overview. Narumi Fujishima, an average highschool student (Wow. What originality. What praise. Ohmehgodz), gets a part-time job at a ramen shop. Little does he know, the ramen shop also houses the NEET (Not in Employment, Education or Training) agency, headed by a12 year old lolicon detective. Damn you, Japan and your presentation of women! Anyway, Alice, the detective, hires Narumi, along with his only other club member at school, Ayaka Shinozaki (who actually made said club, the Gardening Club), along with Major (a uni drop-out who is fascinated in military), Tetsu (the muscles of the group, probably my second favourite character, Alice being my favourite) and Hiro (a smooth talker and white-suit-wearer, who has a network of girls through the area). There is also Soichiro Hinamura, a gang-leader and associate of Alice, also known as the Fourth. The only last major character (who I will go into a little more detail later on) is Min, the ramen-shop owner. \\n\r\nSo it's basically a detective story, but through-out the (admittedly short) series, only around 4 cases are given and solved! I don't understand how this is the case. Still, it's enjoyable enough (in a shojun-style of Naruto-filler enjoyment) with a little romance here, a pinch of comedy there and a massive shake of lolicon. Damn you Japan... 6/10.\\n\r\nArt:- The art, personally, is the highlight of the show. It is admittedly CGI, but it's still wonderfully presented and, as you would expect, luuuurvley. My only gripe is the lip-syncing. It's blatantly obvious as well, not something you'd actually look for as a reviewer. You can see that the mouths don't open wide enough with some words, and sometimes the mouth just acts like Pacman in some dialogue. A bit of a bummer... 8/10.\\n\r\nSound:- Not much to comment on here, mainly through it being personally forgettable. Not many tunes, but the cicadas sounded, um, nice I guess? The intro was quite nice, being calm and then crescendo-ing into a nice drum line and some piano, similar to Angel Beats actually. 6/10.\\n\r\nCharacter:- Aaahh, the main point of the anime. I've given a brief overview, but there is a little more to say. As stated, Narumi is your usual, blank faced, un-emotional (until THAT THING happens, I can't say, sorry) \"shojun\" protagonist. Not much to say. And his club member (who has an OBVIOUS crush on him), Ayaka, is basically the female version of Narumi.\\n\r\nMajor, Hiro and the Fourth are OK. Major can be quite annoying, always calling Narumi \"Vice-Admiral Fujishima\", but he's useful, being a military otaku. He is the comedian of the group. Hiro is basically a jock. He's a bit of a c*ck. Oh well. Finally, the Fourth is what you'd expect of a mafia/gang leader sort of stereotype. Mean, but genuine. \\n\r\nMin is quite the strong woman, very serious but works very hard to work up to her fathers standard of making ramen, who dissapeared a long time ago. Can't say much more without spoiling the story.\\n\r\nFinally, my two fave characters, Tetsu and Alice. Tetsu is just a really, really nice guy. I like genuine people like him, and he has a bit of comedy to him. In fact, the only reason he probably doesn't have a partner is because he's not got a job. Poor guy.\\n\r\nAlice. Oh my god, she's so cute! And smart. I love Alice, she's basically to guys who like, err, cute things (nice save, not) what L (Death Note) was to the fan girls. Also speaking of L, she litreally is a lolicon L. Honestley, just get up a picture of Alice, then imagine L, and you've got her. Down to a T. Except she prefers ramen to sweets. Whatevs. 7/10.\\n\r\nEnjoyment/Overall:- For everything this show is, it's enjoyable. The thing is... It's missed potential. SO much more could have been put into this. Had a few more episodes been made, a few more cases may have been put in. The \"shojun\" aspect could have been dropped in favour of a more serious show, a la Death Note (though then how super-cute Alice would have fitted in I don't know). That's my real gripe, and why I've awarded the show as such. Oh, and one last thing to end on? I really recommend sub over dub. English-speaking people cannot do cute, lolicon voices. It's impossible. Alices voice sounds just so... Off. The rest of the crew (while infinetly better in the sub) are OK, but not great. Could I recommend this anime? Hmmmm. The ending is really something, but I don't know whether that's worth entry in itself. Read my summary, MAL's summary and other peoples summary of the story, and go from there I think. Personally, I think the show deserves a 7/10. Nice.",
            "date": "2013-11-16T09:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 120465,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2501829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Waldy565",
                "username": "Waldy565"
            },
            "url": "https://myanimelist.net/reviews.php?id=120465"
        },
        {
            "content": "God's notepad. NEET Detectives. Yakuza. Ramen Shops. This show has all of them and more. Alice is a 12 year old detective. Not just any detective, a NEET detective, and speaker for the dead. She can solve almost any crime right from her bedroom. One day she sends out her three lackeys that do her legwork to gather information about a missing prostitute. At the scene of the crime they meet Fujishima Narumi, an innocent high school bystander, with no real friends who constantly moves from town to town. Later on, one of his \"friends\" drags him to a Ramen shop where he again meetsthese three lackeys. Narumi is shoehorned into carrying a meal of Ramen up to Alice who lives in the apartment complex above the Ramen shop. Somehow or another, Narumi ends up being Alice's personal assistant which means he does everything for her, from laundry to opening he cans of soda because she is physically unable to do so. From there, he solves multiple crimes involving drug rings, Yakuza, money laundering, all under the supervision of Alice.\\n\\n\r\nIt sounds weird, I know, but this anime really is good. Nothing supernatural or crazy ever happens, its just a different view of life. The mysteries are like those out of detective novels, and Alice's sharp brain, yet childish behavior and superior attitude are adorable. I recommend this to anyone who enjoys detective anime.",
            "date": "2013-09-08T15:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 112357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3121995.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mythical_Truth",
                "username": "Mythical_Truth"
            },
            "url": "https://myanimelist.net/reviews.php?id=112357"
        },
        {
            "content": "\"Great potential marred by a shoddy pieced together story with no real purpose\". I wish that wasn't my final thought – but it is. Kamisama no Memochou has an interesting concept and various characters that make for great potential; but alas, this potential is never reached. Various plots are thrown in one after another, but there is never a real purpose behind the story or the characters. The characters are real, each with their own issues, but a true understanding and resolve is never met. The anime is too short to achieve a proper climax and resolution; it tries too much in too little time.\\n\\n\r\nKamisama no Memochou lacks the crimson thread that weaves an anime together. There are plots and subplots. To me, this anime feels like a big subplot with mentions of a plot that never appears or fully matures. \"I am a NEET detective, a speaker for the dead.\" Those are the words of the female protagonist, Alice. But nowhere does the story's action ring true to the statement. \\n\\n\r\nIf you like defective anime....I mean detective anime, you might want to watch it, but I wouldn't watch it again. So much bloody potential and such a waste of it. The characters really could have achieved so much more. *Sigh*",
            "date": "2017-01-15T07:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 238354,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99461.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Cyberfire777",
                "username": "Cyberfire777"
            },
            "url": "https://myanimelist.net/reviews.php?id=238354"
        },
        {
            "content": "PLEASE NOTE: THE FOLLOWING REVIEW MAY CONTAIN SPOILERS. \r\nKamisama no Memochou is the story of Narumi Fujishima, a member of the school's Gardening club with Ayaka. The twelve episode series covers several mysteries that NEET (an acronym for 'Not in Education, Employment, or Training') detective Alice solves together with her 'lackeys' and her assistant Narumi. \r\nThe story was so-so, as it didn't actually have a plot. Each episode went in a sort of monster-of-the-week format. However, that didn't take much away from being enjoyable. My favorite thing about this aspect of the series that they connected a lot of ideas from previous episodes in laterepisodes. But, though this was a clever way to remind fans of things that happened before that they may have forgotten, there were several plotholes. For example, when Alice and Narumi find Meo's mother's cellphone, they never actually mention why the find is crucial to the mystery. That really annoyed me to no end while I was watching.\\n\\n\r\nA lot of supporting characters didn't really develop as much I'd wished, but some key characters, on the other hand, did get this opportunity. Narumi, for example, develops into someone who will fight--maybe even kill-- for those he cares for. He starts at the beginning of the series as an apathetic person who is alright with drifting from city to city, but at the same time, he is also angry that he has to move so much because of his dad's job when said father is only seen (maybe) three times a year. As the series goes on, he comes to be content with daily life with Ayaka, Alice, and everyone else at the Hanamaru.\\n\\n\r\nThe sound was quite appropriate at most times. When the mystery of the episode was getting solved, or (as in the very last case) when things were reaching the high point in the episode, the same song was played. It was a sort of creepy lilting tune that didn't sound like anything I've ever heard before. The OP was so-so and I didn't really like it. However, I fell in love with the EN. It was amazing! It made everything so much more exciting and made me impatient for the next episode. A lovely way to end an episode. The overall sound was also good, and the sound effects didn't really distract me like it does with animes that have really obnoxious sound effects. The sounds sort of blend in with the background and become non-obtrusive. This was great.\\n\\n\r\nThe art was the best part of the anime. (I think) It was animated by J.C. Staff, and was probably one of their best. The art was inconsistent sometimes, but not in such a way that you would notice it. The city lights were beautiful and the way the buildings were animated was amazing. Alice (like all lolis) was animated with long hair, outfits with a lot of lace in various colors, and a short stature. Everyone else also had great character designs. What I really liked that was no one had abnormal hair colors. The strangest hair color (which really, was not that strange) was probably Ayaka's hair color, which was a vibrant red. I really loved the way Alice was drawn, which probably why I keep mentioning it...\\n\\n\r\nAs you can see, I enjoyed this anime quite a bit. The characters melded together with a thrilling mystery each episode was a quite euphoric experience. Each mystery was as compelling as the next and had my eyes glued to the computer screen. I really enjoyed this anime.\\n\\n\r\nOverall, this was one of my favorite summer animes. It had all my favorites; there was mystery, there was action, and to those who didn't quite notice it, there was a squick of romance. I'd recommend this only to those who have quite a bit of patience for all the things that happen in this anime",
            "date": "2011-09-24T14:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 44059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/360209.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NightsofDawn",
                "username": "NightsofDawn"
            },
            "url": "https://myanimelist.net/reviews.php?id=44059"
        },
        {
            "content": "Don't be fooled!This is a very unsuspecting anime series. Seems simple enough at first(first few minutes at least),but the drama really starts right in the first episode!It draws you in and before you know it, 2 hours have passed and you're on episode 5 (well at least that's what happened to me). two days later it's all over! Some of you may think i'm over-hyping but allow me my happy rant!\r\nThe storyline of between the Fourth and Renji was especially amazing to me.The execution was flawless and my shock and suprise,a welcome boost to my hopes of originality in story writing for anime series.I'm sodelighted with this series I can't sufficiently express it! The build ups and follow throughs are well worth the stress and anxiety i went through,agonizing over the evidence. I fancy myself to be a novice detective,always trying to pick up clues in character dialogue,relationships and writing in all manner of shows/movies i watch,not only anime.And to be fair my detective skills helped me stay on the same page as the characters in the series but I didn't get them all,there were still substantial suprises for me to enjoy. I felt like i had a dialogue with the characters,in that i felt a level of involvement i don't think i've experienced yet with anime mystery series. It was like i was part of the crew solving the mysteries with them in real-time! \\n\\n\r\nThe character development of Narumi and Alice are great, especially Narumi. His development is wonderful to watch,he litterally blossoms like a butterfly,no punn intended.His transformation throughout the series is obvious and portrayed beautifully. Alice is also great.At first glance you may be fooled into believing she's the typical doe-eyed,fragile female lead,so commonly found in anime,but alas she is not!Feisty, self assured in her skill, yet burdened with unlimiting empathy for those that suffer in the world,she is strong and refreshing break from the typical.\\n\\n\r\nI highly recommend this anime,if you want mystery,with more of a twist than usual.  \\n\\n\r\nAgain I'd say DO NOT underestimate this anime!It delves into serious social issues,that may not affect all of us directly,but we all know exist today.",
            "date": "2013-07-20T01:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 106063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2309959.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vella9",
                "username": "Vella9"
            },
            "url": "https://myanimelist.net/reviews.php?id=106063"
        },
        {
            "content": "I can't reiterate this enough: WATCH THIS ANIME. No matter who you are or what kind of anime you like, you should like this anime.\r\nSummary: This is my new second favorite anime (nothing it going to top Mia-Hime I think). After finishing an anime I like to read the top reviews to see if there was anything I missed based on the reviews and to confirm how I felt was in line with the general consensus. ON this one I couldn't find a single highly rated review that did it justice. This isn't just some anime about a NEET detective who is a loli, thisis deep on so many levels and has characters that are unforgettable and a perfect ending. That being said, this is the first anime I have ever seen that has a perfect ending but made me want more because it was just so good that I could have watched another season at a minimum. I want more from this universe!\\n\\n\r\nStory: 10/10\\n\\n\r\nOne of the best stories I've ever seen. The story builds up from the MC being a new student in the school to him joining and participating in the NEET detective agency. What's interesting is that the detective stuff isn't really what this anime is about. Several of the lead characters have emotional journeys and are helped by Alice to solve a case pertinent to their own lives. Each one drives major changes in the lead characters lives and pushes the story forward. Several of the cases are heartfelt or funny but the last case is an emotional roller coaster that cemented my love for each of the characters. This is also the first anime where it was ambiguous if the source material continued on for what could have been more seasons or if the anime shared an ending with the LN. Said another way, the ending was so perfect it felt like a proper series finale even though I could have imagined another season.\\n\\n\r\nArt: 9/10\\n\r\nThe art is gorgeous. It looks VERY good and I like each of the character models. It is bright when it needs to be and dark when it needs to be.\\n\\n\r\nSound: 8/10\\n\r\nWhen I heard what I consider Alice's teme song \"teddy\"\" I was reminded of Peacock Blue Eyes from Katanagatari. Turns out, the same person did the soundtracks for both. I will add this is another classic from him. I rarely do this but I got the OST.\\n\\n\r\nCharacter: 10/10\\n\r\nI loved every lead character in this anime. A lot of excellent voice actors from anime I've seen in the past came together to make this masterpiece. Each character that is of importance is given a fair amount of development and you feel like you get to know them. I think there could have been the pitfall of going into the NEET background of the 3 people who work with Alice or Alice herself. I think focusing on the MC and the other leads who were the main focus of the cases made more sense and leaving their backgrounds a mystery was the right approach for a single season anime.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI loved it. I haven't binged an anime in ages but this one I wrapped up in a single weekend.\\n\\n\r\nOverall: 10/10\\n\r\nWith amazing art and a solid sound track all of the aesthetics are there. Add in a character driven narrative with tons of emotional highs (and a few lows) and you have a great story that will end perfectly but leave you wanting more.",
            "date": "2016-04-03T22:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 215421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=215421"
        },
        {
            "content": "I absolutely loved this anime.  I dont know why i put it off for so long.  Basically its a story about a NEET and Recluse named Alice(I dont believe thats her real name).  She's a NEET Detective. She has people who do the outside work for her, and she will occasionally come outside to do stuff only she can do.  Its a great anime.  The beginning was a little confusing, but after a little bit its clearly obvious that its going to get better.  Its like a mystery story.  Its always got you on the edge of yourseat wondering whats going to happen next.   The moment you first see Alice, you want to walk up and hug her.  She's so adorable, yet scary sometimes.  I want her computers.  I want her life.  The Main Character is great too.  He sees the world as as a depressing place.  But the first day at his new High School, he meets a girl who invites him to the Garden Club.  Then she invites him to her work where Alice and everyone elce is.  I cant explain too much more of it, because it will give it all away. \\n\\n\r\n Its a great anime, and i Highly Recommend it.",
            "date": "2013-06-05T08:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 99879,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1122179.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/DustPotato",
                "username": "DustPotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=99879"
        },
        {
            "content": "Fantastic show, got me hooked from episode 1 , marathoned it straight away and I have no regrets, aside from the void now left in it's space.\r\nThe story starts rather innocuously, seemingly like yet another one of those shows that populate the anime landscape. It all changes when Alice is introduced, and a new dimension transforms the anime drastically.\r\nThe show did have its issues though,some introductions were done rather awkwardly but that aside, the show really does shine in setting up the challenges and gracefully leading the viewer through a series of carefully crafted experiences to help the viewer put the pieces together, whilst leavingenough for the grand reveal and twists. \\n\\n\r\nIt is certainly a memorable anime and I highly recommend it , especially if you like investigative shows, besides the cast is a diverse and well defined, their actions seem logical and true to their character at all times which helps to build a very believable world to buy into. I can only hope for an extension, perhaps a second season, but in the absence of that i shall head off to read any peripheral content related to this anime to fill the void that the impact has created within me",
            "date": "2016-09-04T09:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 228271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/zhenwei2972",
                "username": "zhenwei2972"
            },
            "url": "https://myanimelist.net/reviews.php?id=228271"
        },
        {
            "content": "Nostalgia is weird.\r\nWhy did I rate this show a ten? Does it even deserve a ten? No no it doesn't its way closer to a seven or even lower than that, yet I still give it the score of 10/10. It's difficult to see why. The characters with the exception of Alice are cardboard thin, nothing more than a bunch of cliche's perpetuated. It makes it difficult to get attached. The story can be boring at times and yet I can't help but still give this a 10 out of 10.\r\nSo why would I think that. Well to figure out we have to go backto when I first started seeing anime. I had it in my head to always find a legal way of purchasing and watching anime. So I watched my first few shows through Netflix and Crunchyroll and even bought the first five episodes of Dangarompa before finding it on Funimation. Heaven's Memo Pad was probably the sixth show I ever watched, right in between Another and Stein's Gate. I realized at that point that I loved the mystery genre and wanted to see everything from it. Maybe loved wasn't quite the right word, it was a inconsolable need to see everything mystery, so I watch top ten's anything to find more shows like what I had already seen, and. found this one. \\n\\n\r\nWhen I had first finished it, it shot straight to the top of the best anime of all time list. Blazed past everything that I had seen before, and I found myself deeply in love with it, so much so that I bought it in its entirety, making it the first anime I even did that with. It was just the start of so many first's. My first favorite show, my first defining genre, etc. I was transfixed with it. With the way the story finished it's final arc, with the characters, with everything. \\n\\n\r\nFast forward a few years, my knowledge of the medium was much larger and I had seen probably a few hundred shows, and finished a hundred of those. I consumed anime like food. So wanting to see how I thought of it I rewatched, and strangely enough walked away with the pretty much same opinion, that it was my favorite show of all time. Yet the wording had changed, it was my favorite show not the best show. That spot was now held by Stein's Gate, which never really let go of it. \\n\\n\r\nI realized on a third watch a few weekends ago that the show was crippled by flaws. Some have bene listed above, cut and paste characters, two pointless filler episodes that only padded out runtime and that I didn't care about, a meandering story the rest of the time with only two real exceptions (ill get to the later), and nothing else that was anything beyond serviceable. The entire thing began to look good enough, yet I couldn't change the 10 out of 10 score, even though I was breaking a rule that personal enjoyment should only count for 2 up or down. But I kept watching and still got the same joy out of it as I did before.\\n\\n\r\nTo chalk it all up to nostalgia wasn't quite right becuase even with all of it's flaws I still loved it, I loved the dorky characters and the plot that wasn't anything more than a series of vinyettes that had no real purpose. It's not just the fabulous character of Alice or even the last arc which is still one of the best arcs I have ever seen in anime, but it was a representation of where I had been with this medium that gave life some meaning and the joy that I felt from discovering show after show hung tight in my chest and I realized that even if it is symbolic I must keep this a ten with an go watch it recomendation \\n",
            "date": "2017-12-18T21:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 265552,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MKW43776",
                "username": "MKW43776"
            },
            "url": "https://myanimelist.net/reviews.php?id=265552"
        },
        {
            "content": "What i really looked for was a deep complicated anime while watching this, but instead it gave me a quite nice time and  left a lot of feelings(you will know of what kind when you have seen it.). There was a wide variation amongst the characters, even though the main character and his \"crew\" were kinda stereotypical, it was still not as usual. When it comes to sound and art, I have nothing to say.\r\nWhilee watching Kamisama no memochou ii thought it could really become somthing more of it.  And so it did but i somehow felt that it sorta ended to quickly.I liked it pretty well cause of its mysterious/dark,  but also warm and comfortable feeling. Also I have to admit, I shed a tear at the end.\\n\\n\r\nI feel a bit retarded but i though that a NEET was like a mutant or something until i checked it up, so i waited the whole anime for some superpower or something. ^_^\\n\r\nthis is a short, easy watched but still mysterious, funny, feely and violent now and then, anime.",
            "date": "2014-04-20T16:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 140659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1047779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Reaperschoice",
                "username": "Reaperschoice"
            },
            "url": "https://myanimelist.net/reviews.php?id=140659"
        },
        {
            "content": "This is one of those series that has a great start, falls down in the middle and then recovers for a pretty good ending.  Unfortunately, the slow middle leaves me a bit sour about this series, which should have gotten an 8 or 9 overall.\r\nSo lets start with the story.  There's no major plotline running through this series, which isn't unusual in a detective anime, but it makes me feel like its lacking something.  With nothing to expect, its easy to lose pace, and drop this series.  However, the individual stories are your standard detective stories, and the final arc isone of the better elements to this anime.\\n\\n\r\nIn terms of the animation and the voicework, I'm not one that usually notices anything.  However, the artwork was pleasing on the eyes, and none of the voices stood out as annoying or out of place, so I'm happy with this part.  However, nothing stood out as amazing at the same time.\\n\\n\r\nThe characters were nice, and relatively well developed, though there are a few I would have liked to know a bit more about.  Considering the length of this series, I can't really complain.\\n\\n\r\nIn terms of enjoyment, its a series I found I enjoyed in parts, but overall not so much.  It falls into a rut, and though it does recover, it left me wondering what it could have been.\\n\\n\r\nOverall, I gave it a 7.  It's a nice effort, but its not quite good enough for a higher rating.  Still one of the better anime this year though.",
            "date": "2011-10-05T12:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 44901,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/VincentCrescent",
                "username": "VincentCrescent"
            },
            "url": "https://myanimelist.net/reviews.php?id=44901"
        },
        {
            "content": "Kamisama no Memo-chou or in simpler words, Heaven's Memo pad is basically about the NEET Detective agency led by Alice and revolves around the protagonist/narrator Narumi Fujushima, who is a high school boy.\r\nThe investigation of the cases taken by Alice involve the other NEET Detective agency members and the leader of the Hirasaka gang along with the protagonist. As the series proceeds, more characters are introduced in the plot.\r\nThe series starts with Narumi being dragged into the Gardening club of his school by a classmate(Ayaka) and eventually into the NEET Detective agency as Alice's assistant.\r\nSince the anime had something to do with a 'detective' agency,there was bound to be mystery involved in it. In the first few episodes, the viewers aren't provided with much information about the case, hence one cannot try to 'be the detective' in these episodes. However, with the plot involving a former member of the Hirasaka gang, the viewer is provided with enough information and I did spend a day trying to figure out what exactly must have happened(It turned out to be right after all :D). As the series enters into the last few episodes, it becomes a little boring and depressing. At least, I did not like the way it ended. \\n\\n\r\nRegarding the characters, the protagonist seems to be the biggest 'weakling' among all and the person h matches closest to would be Ikari Shinji(from Shin Seiki Evangelion). However, later on, he does get a sense of leadership thanks to a small sacrifice.\\n\r\nAs for Alice, she is a (super)hacker who is obsessed with Teddy bears and hates to go out. But one thing that I never understood was, how old is she anyway? That remains a mystery I guess.\\n\r\nThe members of the NEET detective agency only seem to be useful for getting more information for Alice from what is not available in the database and rescuing Narumi when he gets into hot waters.\\n\r\nThe leader of the Hirasaka gang, the Fourth and the former gang member Hirasaka Renji  were probably the best characters in the series from my point of view because they were the ones who were independent for the greater part of the anime.\\n\\n\r\nOverall, this anime got interesting after a few episodes but the excitement failed to keep rising and it got boring towards the end. That said, it was awesome for the greater part and did keep me excited about what would happen next. Once again, not as good as the other mystery genre animes I have seen, but definitely good enough to watch at least once.",
            "date": "2013-01-17T19:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 83993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2029361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SAM10795",
                "username": "SAM10795"
            },
            "url": "https://myanimelist.net/reviews.php?id=83993"
        },
        {
            "content": "Just finished watching another series, this time Heaven's Memo Pad. It's another loli-detective story like Gosick or Milky Holmes but this one takes place in modern japan and the little girl, Alice, is a computer expert that runs a detective agency called \"It's the NEET thing to do\". She hires other NEETS (No Employment, Education or Training) to do her investigations and get things done for her at the behest of others.\r\nIt's ok at best. I haven't seen the other loli-detective shows so I have nothing to compare it to. The first episode was very good and the last 3 episodes were the best ofthe series, but it really gets bogged down in the middle. It's a 12 episode series and it spends 4 of those episodes on a really lame story arc. The main character, Narumi, is also very weak. He's the typical \"I don't want to go out of my way\" stumbling and mumbling, too japanese for his own good main character that is seen in so many other shows. He shines in the end but all the way through he just feels like a spineless wimp and his moments of bravery feel forced and uncharacteristic.\\n\\n\r\nThe other characters were likeable enough and I wish there was more character focus on the other NEETs. Alice rarely gets moments of character development and we learn nothing of her either, where her parents are, how she came into those awesome computers of hers, where she'd get her knowledge or the drive to become a detective! I get that Narumi is the main character but like I said, I was really upset with that 4 episode arc, especially knowing that it was just 12 episodes long. I feel like it was baiting for a second series, but I doubt it's going to get one.\\n\\n\r\nOn more positive notes, the opening song and animation was the best I've seen in a long time and I like the ending songs a lot too.",
            "date": "2012-06-01T08:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 62405,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28482.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/outlawwolf",
                "username": "outlawwolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=62405"
        }
    ],
    [
        {
            "content": "violence: significant and bloody\r\nlanguage: moderate\r\nnudity: minor (some characters in undergarments or covered by sheets)\r\nsexuality: significant (but only implied, never actually depicted)\r\nDue to his father's work, Narumi Fujishima has moved around a lot since he was a kid, and over time he slowly gave up on trying to connect with other people.  At his new school, he joins the computer club because there are no other members and he doesn't have to deal with people.  One day as Narumi is napping on the roof, he is interrupted by the only member of the gardening club, Shinozaki Ayaka, who pressures Narumi into helping out withthe gardening club's duties.  Narumi's growing friendship with Ayaka leads him to the ramen shop where she works part time, which is also a hangout for a group of NEETs (Not in Education, Employment, or Training: essentially unemployed individuals) who call themselves the NEET Detective Agency.  Headed by Alice, a hikikimori (recluse or shut-in) and child genius, the NEET Detective Agency essentially \"dishonors the dead to comfort the living, and harms the living to honor the dead\" by digging up the city's dirty secrets.\\n\\n\r\nThere are several different plot arcs within this short anime.  Some deal with very heavy themes like teen prostitution, drug dealing, money laundering, and suicide.  Another less serious plot arc pits the NEET Detective Agency against a local yakuza (gangster) group in order to determine the future of a local video game arcade.  Because of the serious nature of many of the cases involved, I would rate this anime a PG-13.  There is significant violence throughout, especially gang related violence and street fights.  Individuals are beaten severely during interrogations.  Blood and disfigurement are depicted, and I get the impression that at least one character was killed after an interrogation, though it is never actually depicted on-screen.  Individuals die from overdosing and there are two suicides depicted in this series, one of them bloody and disturbing even though the body is never really depicted.  Concerning nudity and sexuality, during the teen prostitution arc, a girl is show several times in lingerie.  Sexuality is implied throughout the series, especially during the teen prostitution arc but also several times after, since one of the NEETs is a playboy and uses his sex appeal to elicit information from women.\\n\\n\r\nThere is no single overarching plotline to this anime; instead there are 5-6 short arcs which last usually 2-3 episodes each.  The last arc is the most depressing of them all due to the involvement of one of the main characters, however, the anime has an implied happy ending.  The anime is also a bit vague about certain things that one might think would be important.  Who is Alice?  Where is her family?  How did she come to be living above a ramen shop?  Just how does she solve these crimes?  None of these questions are really answered by the end of the series, but the story arcs glide smoothly from start to finish while conveniently glossing over these details.  Some of the plots seem a bit contrived, for example during one investigation of a string of burglaries it is revealed that there are two culprits who have been tresspassing, but neither is aware of the other.  Pretty unbelievable.  This anime is also very naive about the nature and operations of the yakuza; there are at times incidents of shocking violence that belie the polished personas of some of the characters, but the anime goes out of its way to suggest that the yakuza it depicts are all really good, honorable people deep down inside.  It is a somewhat bipolar depiction that hints at the brutality of the criminal underworld while simultaneously portraying it as romantic and cool.  Some of the endings to plot arcs have an almost fairy-tale like unreality to them.\\n\\n\r\nThe characters in this anime are interesting enough, but nothing special.  Narumi is a pretty naive character who sometimes has flashes of inspiration which contribute to the successful conclusion of a case.  Narumi is the caring protagonist who brings those around him together, but his naive about his associations with some of the underworld groups he comes across also have some dangerous results throughout the series.  Ayaka is the cheerful classmate/best friend with an obvious crush on Narumi, and Alice is the socially awkward and withdrawn brains of the NEET squad.  You will quickly recognize their stereotypes once you see them.  The other members of the NEET Detective Agency are largely forgettable and exist only to give Alice some \"gophers\" to do legwork, errands, and observation.  The most interesting of the bunch is Major, a military-obsessed college student who looks like a kid, but whose technical skills contribute to much of Alice's information gathering operations.  The yakuza are self-absorbed, arrogant, violent, and stubborn, though generally portrayed as \"honorable\" and decent at heart.  While some characters are portrayed as very intelligent or tough, there are no superpowers here, and toughness doesn't keep some characters from taking a beating, and intelligence doesn't keep some characters from overseeing the obvious.  In this sense, there is some realism to this anime.\\n\\n\r\nWhile I personally enjoyed this anime overall, I would not recommend it for children or for individuals who want a happy, lighthearted anime.  Although the plot arc endings are overall satisfactory, you will be dragged through some considerable filth during the duration of this anime, and some of it will leave a bad taste in your mouth.  If you want a detective/mystery anime, you can find better.  If you want an action anime, you can find better.  If you want a feel-good anime, you can find better.  If you just want to be entertained, however, and don't have unreasonable expectations, this anime isn't too bad.",
            "date": "2014-01-23T15:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 129967,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3506891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jackrabb1t",
                "username": "Jackrabb1t"
            },
            "url": "https://myanimelist.net/reviews.php?id=129967"
        },
        {
            "content": "This isn’t the tastiest anime dish available.  I honestly can’t think of anything remarkable to say about the show or its characters beyond the following.  \r\nThe main character is about as interesting as a kleenex, but hey, at least he's useful.  The show seems like it was produced exactly following a recipe.  It also reminds me of something I heard someone say about Murder She Wrote:  they do a bunch of stuff for an episode or so, then produce some conclusion that has nothing to do with what’s been on the screen for all that time.  Okay, so that’sexaggerating a tad.  You get the idea though.",
            "date": "2013-05-16T18:41:00+00:00",
            "helpful_count": 0,
            "mal_id": 97391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=97391"
        },
        {
            "content": "First of all, when I started watching the first series, I somehow blew the spirit Durar. Well, sort of sort of a detective story with a normal, perhaps, if the writers keep the plot on the same level as that of the anime came out sort of a middling decent, but it spoils the whole picture of this little girl! No, well, of course, fans will be happy to lolikona, but I did not like it terribly, especially its short-term and bzyki stesnyashki chapters before the hero, and all these lolikonskie, hentai insertion (I mean the ending of a series) is also not encouraging. Ingeneral, I think the anime will not gain a high rating, and it soon will merge.\\n\r\n---------------------------------------------------------------------------------------------------------------------\\n\r\nПервым делом, когда начал смотреть первую серию, мне почему-то повеял дух Дурары. Ну вроде такой себе детектив, с нормальным сюжетом, возможно, если бы сценаристы держали сюжет на том же уровне, то из аниме вышел такой себе достойный середнячок, но всю картину портит эта маленькая девочка! Не, ну конечно, любители лоликона будут рады, но мне она жутко не понравилась, особенно ее кратковременные бзыки и стесняшки перед глав героем, и все эти лоликонские, хентайные вставки (я про концовку в 1-й серии) тоже не радуют. В общем я думаю, что аниме не наберет высокий рейтинг, и его вскорее сольют.",
            "date": "2012-02-19T13:18:00+00:00",
            "helpful_count": 0,
            "mal_id": 54193,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/248624.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jo-izo",
                "username": "Jo-izo"
            },
            "url": "https://myanimelist.net/reviews.php?id=54193"
        }
    ]
]