[
    [
        {
            "content": "\" Judge....What are you doing!?  Do your job!  Bring an end to this miserable charade!\"  -  Manfred Von Karma  ( 2001 or 2005 if you live in America) \r\n  Very well.  I'll bring this whole case to close my dear readers, because my magnificent vengeance...........eh well it still won't be satisfied after reviewing this.  A lot of people may defend this anime,  but they would be out of their mind, no sane man would.  That's why I'll do my best to make sure this anime, gets the verdict it deserves.  GUILTY!\r\n   Youknow this season has been one disappoint after another, we got Berserk (2016) and now this,  it's like all my favorite things are being ruined consecutively.  So what's wrong with this show?  What's right with this show?  I could easily just sit here and tell you that it isn't like the video games, as easily as YOU the reader could easily either having played or not played the video games could say that it is an adaption give it some slack, but rather than argue with little reasoning, let's throw out some facts.  \\n\\n\r\n  Why a company like A1 Pictures was ever a pick to adapt a franchise like Ace Attorney of all things is beyond me.  A company that never seems to do the source material they are given justice and more often  then not turns what should be an entertaining romp into a boring slog,  isn't what my first choice would be for an Ace Attorney anime.  The  Ace Attorney anime isn't just a bad adaption, it just isn't a very good show.\\n\r\n  It is actually quite hard to put into words as not only a fan of the games, but as someone who expected a fresh perspective on the series, my disappointment.  Let me be blunt right of the bat,  the pacing is just God-awful in every regard.  The anime pretends to be doing the fans a service by adding in the time and date stamps for the video game, but its just a way to cheaply make scene transitions and even then they aren't good.  What is worse is not only have things been edited to fit a 24 episode series, heavily butchering some of the important plot lines and moments that made Ace Attorney good, but entire cases have been cut including: Rise from the Ashes and the starting case from Justice for All.  They aren't that integral to the story, but when you have a pointless filler episode for decade old content,  makes their failure to appear all the more jarring.\\n\\n\r\n   While there are a lot of bad aspects about the series,  I must hammer it in that pacing is by far the worst offender.  Ace Attorney is a witty, quirky series with clever humor,  but it seems A-1 will never understand WHY people love the series they so poorly adapt.  The series is fast paced,  but the failure to understand what makes the characters' personalities shine is why the humor falls so flat.  Phoenix is so damn bland,  instead of being a sarcastic yet vulnerable personality he always feels as though he's just some generic protagonist who pulls the right answer out of his ass.  Maya is nowhere near as charming or as expressive as she once was.  Miles Edgeworth is flanderized into being a complete tsundere and big sis Franziska...?  Well she may actually be the only one improved, being less of a cold hearted always angry perfectionist to.....well a slightly more energetic cold hearted always confident perfectionist.  Still annoying though.\\n\\n\r\n   The animation is a completely different story.  If you have a hard time concentrating on both subtitles and what's happening at the same time, you may not catch it, but there are constant cheap cuts, animation errors, missing facial features,  characters drawn at wrong heights, and so on.  It absolutely boggles my mind to no end how the games being represented here,  both of which being over a decade old have better animation in it's limited sprite work than a fully animated series in 2016.\\n\\n\r\n  From the bland intros that show how vague of an understanding A1 actually had of this series to the sad amount of little to no impact that each case should hold,  clearly something went wrong here.  The one positive I can give you that the soundtrack has fairly decent remixes and the opening song is actually good on its own.  I guess another positive could be that they only touched the first two games in the series  and hopefully will not get the chance to touch the remaining titles.  Other than all that though?  Just stay the hell away.  Bad pacing,  a cast that is constantly out of character,  bad animation, typical of A1 pictures and a huge misrepresentation of the source material on every level makes for an unsatisfying experience that truly does justice for no one.\\n\\n\r\nCASE CLOSED.\\n\\n\r\nVERDICT.\\n\\n\r\nGUILTY AS SIN.",
            "date": "2016-09-24T19:25:00+00:00",
            "helpful_count": 72,
            "mal_id": 230094,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955439.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GhostStorm",
                "username": "GhostStorm"
            },
            "url": "https://myanimelist.net/reviews.php?id=230094"
        },
        {
            "content": "Ace Attorney, alongside Pokemon and JJBA, is one of my absolute favourite media franchises. I have spent countless hours playing the games over and over, producing fanworks, and discussing them at essay-length. So, as much as I appreciate the need to be objective and focused in my review, I feel that it needs to be said:\r\nI hate this anime. I hate it so fucking much.\r\nSono \"Shinjitsu\" Igi Ari is an adaptation of the first two games in the series, and right off the bat we've hit a huge stumbling block. Each of these two games would be more fit to a full 24 episode animein their own right than being crammed into one cour each. Unsurprisingly, a lot of content was trimmed in the process of fitting both games, and what content survived the cull is rushed through at breakneck pace.\\n\\n\r\nThe dialogue is cut down the most, and being that the source material uses mostly text-based storytelling this is a huge blow. Losing so much dialogue not only robs the series of much of its charm, but also does serious damage to its characterisation. Phoenix in particular is characterised mostly through his constant snarky, quipping inner monologue, which is almost entirely absent here.\\n\\n\r\nWe barely get to know most of the characters, making it difficult to be invested in their character arcs - and that's just the ones whose arcs were actually shown in the anime instead of being skimmed over. Many characters are stripped down to the barest of plot relevance, and others are reduced to nothing more than a cameo appearance.\\n\\n\r\nThe bread and butter of Ace Attorney is its contradictions, the solving of which drives the murder mystery plots the series revolves around. Even these are changed, however, in the name of this streamlined approach. Twists are replaced with simplified, obvious alternatives that not only remove the satisfaction of seeing the more obtuse mysteries cracked, but also make you question the logic of everyone responsible for presenting these flawed arguments in the first place, making it much harder to take the prosecutors seriously as competent opponents.\\n\\n\r\nThe trimmed-down dialogue also cuts key context on evidence used throughout the series. One of the most important principles of good detective fiction is that all clues used to solve the mystery should be clearly shown - that the audience should have all the necessary tools to solve the mystery themselves. While the games did this by sheer necessity of the medium, the anime makes no such effort, making the resolutions often feel cheap and unearned.\\n\\n\r\nThis pacing severely damages the presentation of the anime, sacrificing any attempt to preserve the dramatic tension of the games - most contradictions are resolved almost as soon as they come up. And even outside of issues caused by the pacing, the presentation suffers. The quality of the art and animation here is appalling. The errors are constant and glaring. The animation is often comically sloppy. The character designs also stray from the original designs to their detriment, going with an oddly wide-faced look that gives the characters strange facial proportions. Also, they can never quite seem to get Phoenix's hair-spikes right, with them changing shape every time we see them. There is also an excessive overuse of CG animation to cut corners, most obviously in the CG court gallery that has, for whatever reason, been made so much more visible than it was in the source material, as if deliberately trying to highlight how poor the animation is.\\n\\n\r\nThe effects used for dramatic emphasis are cheesy, and adapt the tone of the games poorly - the more abstract effects of the source are replaced with literal auras and dramatic gusts of wind.\\n\\n\r\nThe voice cast is similarly poor, featuring many miscast or noticably inexperienced actors. The entire cast seems to either underact or overact with little middle ground. The only notable exception is Yuuki Aoi as Maya Fey, who seems intent on stealing every scene she is in.\\n\\n\r\nThe anime handles Maya well in general, especially in comparison to its treatment of many other characters. Not only is her character arc left more or less intact, but the animators emphasise her goofy and hyperactive nature far better than a set of 14 sprites ever could.\\n\\n\r\nOn the subject of things the anime did well, most of the anime-original content is quite good. Ignoring whatever logic lead A-1 to add anime-original content whilst also cutting game-canon content, the additional focus on Phoenix, Edgeworth, and Larry's shared backstory, and adding the Signal Samurai motif that represents their friendship (as well as giving some background to Edgeworth's secret love of Super Sentai series) enriches the dynamic these characters have.\\n\\n\r\nThe cuts made do sometimes work to the series' benefit, too. Turnabout Big Top, which is considered by many to be the worst case in the franchise (which it isn't, by the way - fight me nerds) benefits from reduced screentime on some of its more irritating supporting characters, such as Trilo Quist, or that fucking clown. There does seem to be a rule of inverse quality in this adaptation, though - the worst cases are the ones handled the best, whereas the cases that were the series highlight in the source suffer the most from these alterations.\\n\\n\r\nIt's hard to say what the point of this anime is. It was made by A-1's b-team (now CloverWorks, a seperate studio) with little care or attention put into it. At worst, this was a shoddy adaptation by a studio looking to make a quick buck. At best, this was a misguided attempt to adapt a great series by people who have a fundamental lack of understanding of what made these games so good in the first place.\\n\\n\r\nOne way or another, this is an awful adaptation that should only be watched by people who are already fans of the series, and are more interested in seeing another interpretation of the story than in seeing a competent adaptation - and even then, they should go in with low expectations.\\n\\n\r\nPlease don't let this be your introduction to the franchise.\\n\\n\r\nStory/Plot: 3/10\\n\r\nCharacters: 3/10\\n\r\nAnimation/Art: 1/10\\n\r\nSound: 3/10\\n\\n\r\nOverall: 2/10\\n\\n\r\nFor Fans Of: Detective Conan, Umineko no Naku Koro Ni\\n\\n\r\n(Side note: Yes, I'm using the English names. Get fucked, weebs.)",
            "date": "2019-02-06T13:07:00+00:00",
            "helpful_count": 10,
            "mal_id": 301031,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=301031"
        },
        {
            "content": "The courtroom is a wonderful place full of controversy and despair.  Both the prosecution and defense have their own reasonings for choosing their sides, and the verdict in the end is never the most desired outcome.  But we're not here to talk about everyone's right to a fair trial, we're here to talk about everyone's right to a fun trial with A-1's adaptation of the first two games of Ace Attorney.  Put on your attorney's badge and get on your tiny bike.  It's time for objections and nonsensical court cases!\r\nStory: Naruhodo Ryuuichi is a new defense attorney who just got hislicense.  Upon entering the courtroom to deal with his first case, he finds himself defending his friend, Yahari in a court case against him on the accusation of MURDER!!!  Against prosecutor Mitsurugi Eiji, the two fight for Yahari's verdict and in spark a court rivalry over the two over the rest of the series.\\n\\n\r\nTaking the two first two games of the Phoenix Wright series, this adaptation...basically does what you would think it does, which is fully adapt all of the cases from the first two games of the series.  (Big shocker, I know.)  Because of this...there's not really much to say for the actual story of the series.  The main plotline is basically: Get involved with a case usually involving murder, have Naruhodo defend the accused while Mitsurugi does his best to prove someone guilty and ultimately figure out through a long hair-brained stream of hairbrained and highly improbable events, what happened with each case and who truly is the person who is guilty.  \\n\\n\r\nAdmittedly, the story for this series isn't really all that good.  The show's pretty stagnant as to what'll happen and since it's basically an animated walkthrough of the games, you can guess what the end result for all of these cases are.  Doesn't mean that they're not fun to watch, but don't expect things are pretty predictable.  Apart from that, there's really not much to actually talk about.  The problem is because the series is so focused on the gameplay aspect of the series that there's not really much left for anything else aside from the cases, even if they're all really fun to watch.\\n\\n\r\nOverview:\\n\r\n+ Stays true to the Capcom game series\\n\r\n-  Doesn't really show anything besides the court cases\\n\\n\r\nCharacters: The characters for this series features a large and colorful cast of nutjobs and basket cases that come in only during the case in which they're important or needed in, as well as the more ordinary but still somewhat crazy main recurring characters that you'll probably never actually bore seeing.  Probably.  \\n\\n\r\nFirst we have Naruhodo Ryuuichi, or in the localization, Phoenix Wright.  Believing to stand up for the innocence as a defense attorney, Naruhodo doesn't really have much of a character beyond feeling a bit sick and tired of all of the crazy people he has to deal with from his hard to deal with clients and witnesses who bring their own brand of insanity into this joke of a courtroom, which is to be expected of a player character since it's easier to project onto them when they don't really have many character traits to them.\\n\\n\r\nThen you have Mitsurugi Eiji, the prosecutor and rival of our main protagonist.  Devoted to proving the accused as guilty, Mitsurugi plays as the 'villain' of the series and continuously spends his screentime to win against Naruhodo.  His motives are pretty basic and the development that he gets later in the series is pretty paper thin, so similar to Naruhodo, there's not really much to say.  The dynamic between the characters is pretty cool, but on their own, they don't work out all too well.\\n\\n\r\nAside from them, we have recurring characters like Mayoi (or Maya), Itonokogiri (or Gumshoe), and the nameless judge who apparently doesn't know a single thing that goes on in his courtroom despite being the person who puts down the final ruling.  All of whom are on the same level as the rivaling characters in terms of development and actual character traits and really don't differ much from when they're introduced to when the series ends.  Side characters on the other hand, aka the characters that pertain to one or two cases out of the entire series are amongst the reasons why this series is so entertaining.  Every side character is so wacky, out there, and downright strange that it's extremely awkward to watch them, yet you can't look away.  Sure they're one time characters, but making a really good and memorable impression of them far exceeds any other kind of impact that they would've had otherwise.\\n\\n\r\nOverview:\\n\r\n+ Strange yet memorable side characters\\n\r\n-  Main and recurring characters are pretty paper thin\\n\\n\r\nArt: Produced by A-1 pictures, the style and quality of the series is...standard fare at best.  It doesn't really good nor does it look average or mediocre, so the only explanation for the way this series looks is...average.  They do keep the funny looping idle animation and the character freakouts when you finally find the real culprit, so...good on you, A-1.  \\n\\n\r\nOne problem that did arise upon watching this show was that the background characters, especially those who're in the seats in the courtroom were completely made in unnatural and lazy CGI, completely clashing with the rest of the series and the overall look when the entire court was panned out and shown.  They don't do this too often, but shame on you, A-1 for that.  Shame on you!\\n\\n\r\nOverview:\\n\r\n+ Standard art for this day and age\\n\r\n-  Blatant and lazy usage of CGI\\n\\n\r\nSound:  The sound both in the voice acting and the soundtrack of the series are average at best.  There's not really much of anything to note when it comes to either of those, so...moving on.\\n\\n\r\nPersonal Enjoyment:  Ace Attorney...really isn't all that good.  It's not bad, it's not amazing, it just has something about it that doesn't really do well quality-wise.  That being said, this show is a TON of fun to watch.  Without thinking too hard and just following along with the completely out there cases, this adaptation is by far one of the most enjoyable watches that I've had in a while.  Sure it's not the best thing, but quality and enjoyment are two completely separate ratings here.  And if you have any objections, I'll be sure to give you a good cross-examination.\\n\\n\r\nDid I like this series?\\n\\n\r\nOh, far too much.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nSome characters were a bit irritating, but aside from that, there's not really much to complain here.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nWant a bit of fun?  Want a couple of funny memes?  Want to get through the first 2 Ace Attorney games without a real walkthrough on Youtube?  Than this is the show for you.",
            "date": "2016-09-25T00:18:00+00:00",
            "helpful_count": 17,
            "mal_id": 230113,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=230113"
        },
        {
            "content": "Let's tackle this tightrope walk, called \"Gyakuten Saiban: Sono \"Shinjitsu\", Igi Ari!\"\r\nI don't want to make any excuses for a bad adaptation because, for me, it didn't feel like one. Was it on the top of anime adaptations from other source material that I've seen so far? - No\r\nWas it horrible enough to bring me to the edge of dropping the series? - Hell no\r\nYou see, the games themselves are complex in a way you wouldn't expect them to be when you look at a summary of what you basically do. To transfer this from a platform that allows you to do investigation yourself, findingclues, and uncovering the truth, onto the screen were you're a passive watcher... that's no easy task.\\n\\n\r\nTo fairly judge the Ace Attorney anime you need to understand that it's not about copy and pasting the events on TV but that the producers had to neccessarily scrap some of the points they deemed too much for casual watchers who didn't play the game; but at the same time keeping the ones who knew the franchise beforehand at bay.\\n\\n\r\nThe pacing for the first two cases started off quite nice, I really enjoyed the introduction though they should have made it more clear that \"casual watchers\" couldn't expect a serious anime about the law. Because the games just aren't, let's be honest. \\n\r\n(They'd probably arrest you if you'd bring a whip to the prosecution stand.)\\n\\n\r\nMidway through, from episode 4-10, the pacing got rushed and therefore the anime failed to really convince both sides, unfortunately. I know, it's hard when you've been given a limited number of episodes to fit into a season but if that's the case, maybe they should have just covered one of the games and not two of them.\\n\r\nEpisode 13 was a very sweet addition though and I applaud them for giving us kid Naruhodo, Yahari und Mitsurugi. \\n\\n\r\nThe art and animation was overall fine, sometimes... \"interesting\" (if you want to call it that). Still, those blemishes every now and then didn't take the enjoyment away. \\n\r\nFor me they were charmingly silly and made me laugh, rather than hating the series for not having a good style.\\n\\n\r\nBut that voice acting. Especially the last episode brought back the intense feeling I had when reaching the critical point of this particular case just because the seiyuu put their heart into it and really delivered some awesome performances.\\n\r\nThe choices, in general, felt right; Kaji Yūki knows how to pull off great stuff and he made me love dorky Naruhodo even more. You can't like a series if you don't feel the main character, and he gave Naruhodo that rookie attorney gone wild vibe.\\n\\n\\n\r\nOverall, this isn't a masterpiece but it's surely not an anime made for the trash bin. If you want to have the full crazy experience, you better play the games because they offer detaisl you'll never find in a season anime that is made with 24 episodes in mind.\\n\r\nNonetheless, I enjoyed my time with this series even though some of my favourite features were missing. \\n\\n",
            "date": "2016-09-24T10:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 230032,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5330659.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bellipon",
                "username": "Bellipon"
            },
            "url": "https://myanimelist.net/reviews.php?id=230032"
        },
        {
            "content": "To quote Franziska Von Karma, this anime is \"A foolishly foolish idea born from the foolish mind of a foolhardy foolish fool\". Being a large fan of the games, I was highly enthused to hear of an anime adaptation coming, however upon its release I was only met with a painful and bland imitation of the original games, and even separately so, this anime is still rather one-note and drab. \r\nTo the Anime's credit, I was rather pleased to see a good chunk of the anime's script was directly adapted from the games, this atleast lead to a coherent and unique narrative; and the sounddesign was even better, being quite possibly being the best thing in the series, and feels like a very pleasing overhaul of the original game soundtrack. \\n\\n\r\nHowever this is where my compliments to the series end. Moving onto the art design, everything seems somewhat... wrong... A friend of mine says that A-1 has \"SAO-ified\" all of the character designs, which I'm unsure of how true that is, but everything looks stilted and off regardless. It would probably also be prudent to mention Phoenix's stilted running animation in the intro for a majority of the episodes before it was fixed in the latter half. \\n\\n\r\nOn top of this, the delivery and general scene direction is probably the worst thing this anime has to offer, and moved this anime from \"Boring\" to \"Awful\" in my eyes, as everything is done without heart or feeling. This is a hard point to describe without spoilers but I''ll try my upmost; in the original games where there were scenes of high-tension and desperate action, with races against time and scurrying to find the right answer, there were instead.. not... Characters that were supposed to look and sound devastated at something, instead sounded just slightly annoyed, moreso like the local takeout got their order wrong, and not the levels of upset that were supposed to be shown. One scene in particular where a character was supposed to rush in just in time, with the loud and epic soundtrack making the viewer pumped, was instead replaced by a fairly quiet scene, and the character just walking in, without so-much a hint of tension. \\n\\n\r\nFurthermore, I dislike how character relationships are handled. Characters whose relationships were supposed to feel slightly off and people were maybe untrustworthy, were over-clarified so there was no longer the tension of \"Should we trust them?\" or \"Is this person trying to deceive us?\"\\n\\n\r\nThis anime disappointed me. In my original list of things that upset me, I was also displeased that they had only adapted 2 of the original trilogy of games, however with the announcement of the second season of the anime just a few days before the writing of this review, I am hopeful that A-1 will infact have fixed the blatant errors in the anime and not ruin mine, and many others, favourite game in the franchise.",
            "date": "2018-03-17T00:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 274051,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5742162.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LovinglyGaslight",
                "username": "LovinglyGaslight"
            },
            "url": "https://myanimelist.net/reviews.php?id=274051"
        },
        {
            "content": "Game design and animated series are two very completely different things. It may seem like a really absurd statement, but since Ace Attorney is an adaptation of a game, you need a good understanding of its game design, as to understand what would work on screen, since video games are executed in ways fitting to their gameplay. Sometimes, to make a game more engaging, you have to remove some realistic elements. Knowing this, I have decided to play the game myself, to understand why Ace Attorney is presented the way it is, some time during the time I was watching the anime. So I'd liketo explain how the hook, the trials, work in the game, and why on screen the trials are really ridiculous.\\n\\n\r\nYou see, in the game, you are handling the trials. What you say, what arguments you refute and how you refute them. The more you refute the arguments of the opposing party, the more flustered they become and eventually, they burst out and that is used as a sign that you are winning. Their reactions are over the top but that is done with the purpose of showing you that you are clearly on the right track. In the games, you are also tasked with gathering evidence, in order for you learn more about the case and piece everything together as to have an idea of what to do in court and have an idea of what the case will be, but also to have more involvement in the investigation process, rather than await evidence and use what the cops find to your advantage, like a normal lawyer would. You will also discuss with the witnesses about the case and learn more about the story that way. The game will make you handle cases that you personally figure out with the evidence you have gathered, by paying attention to the information that mismatches your evidence. In this game, you figure it out. As a result of such the game needs a balancing scale, where it teaches you the basics.\\n\\n\r\nYou see, both Ace Attorney's start with a fairly ridiculous trial, where you know for certain who the culprit is, because the game states it from the very start. Your defendant is also a childhood friend which is explained as getting fairly often into trouble that usualy isn't caused by him. Now as an introduction to the game, it isn't a particularly stellar introduction, considering you're gonna defend someone to whom you have social ties with,  (that has a high frequency by the way for I assume dramatic effect) but it's a better than an UI prompt that says \"This is your goal in the game. Go from x to y. That is the defendant. Your friend. That is the actual culprit. The culprit.\" The game actually gives you context and lets you learn by going along the way, in a manner that I'd say is competent.\\n\\n\r\nIn a series, however, you don't want to start off easy, but rather to impress the viewer since first glance. So since the same trial is presented here in the same manner, you will leave with a pisspoor first impression. You already know the culprit, the defendant has constant outbursts since his dialogue outside the court was mixed in, and the first episode is a gibberish mess. You have a culprit you already know, a defendant that makes no sense as to why he's acting in a manner that is incriminating, or as to why he wasn't instructed at least slightly to not have any sort of outbursts such as: flailing your arms wildly, screaming and hitting your head against a solid surface repeatedly. As I watched this, I immediately thought this is very stupid and since I've seen the game, I am sure that whoever adapted this series doesn't understand the purpose of that trial. In the game, the trial is the starting point that familiarizes you with the game and its mechanics. You won't have too many complaints about how the trial emerges because YOU'RE AN ACTIVE PART OF IT, and these things help you. In the game you have the choice to tell the defendant during the trial to asbtain from saying things and making them say the truth, and so on and so forth. You have control over him. His stupidity isn't an important factor. And the fact you already know the truth helps you plan out the case. But here, it makes everything seem really dull and ridiculous\\n\\n\r\nBut perhaps this means that they're just trying to stay faithful to the adaptation and they're not exactly incompetent in this adaptation. In that case, let me move over to the next trial. In this trial there is an autopsy report. The situation is as follows. You present a discrepancy in a testimony  that says that a victim that has died immediately after a sudden blow to the head, had enough time to write the name of their killer after the attack, at a time they were most certainly dead. However, turns out that another autopsy report was released the next day, that says that the victim didn't die immediately after the blow. This is the line delivery in the game \"A second autopsy was performed yesterday, at my request, that says: Death was almost immediate due to a blow from a blunt object. The victim might've lived for several minutes afterwards.\" Eloquent, to the point and most important, not ridiculous. This is the line delivery in the anime. \"Yesterday, another autopsy was performed, that changed the report from died instantly... to died PRETTY MUCH instantly.\"  That's the wording. Pretty much instantly. So I reacted by walking around in the room a bunch with my hand behind my head, thinking \"This is so bad. It's terrible. I love this. This is incredible.\" \\n\\n\r\nI expected at least some minimal level of professionalism and well defined thinking and reasoning, even if with any sort of logic gaps, but that, caught me completely offguard. I never expected quite what I got in Ace Attorney. I mean, you have cases where attorneys don't even talk to their defendants, like the first one. You have cases where the judge is bossed around by a guy and told to finish the trial, in front of everyone else, by the prosecutor. You have cases where the defendant, judge, defense attorney, and the witnesses, get repeatedly whipped. There's no professionalism in the trials.\\n\\n\r\nOkay then, perhaps it is because the series is quite lighthearted. Maybe it is not because the crimes themselves and the mystery aren't orchestrated well. Well, how does this sound? How about we frame the defense attorney that was defending the victim, as the murderer? Because that's the most logical way to go about things. Oh, okay, that sounds believable, right? How about keeping a bullet inside your shoulder after being shot for 15 years inside your body, a bullet that links you to an infamous incident, while also, somehow, avoiding lead poisoning and being able to function as healthy as a spring for said 15 years? Doesn't sound that good, does it? I think should be convincing enough, but lets ruin all credibility. How about shapeshifting your body in a trial, from a 8 year old little girl to a 27 year old woman with huge tits sticking out of her dress? Why do they shapeshift you ask? Oh, because of spirit summoning. They summon a spirit inside their body. Yes, this is an anime about handling trials in the courtroom. Yes, this is a recurring thing. Yes, it also is a recurring gag that nobody really questions this.\\n\\n\r\nThese things are factors from the games too, but I have not crossreferenced everything I said to see if everything is the same in the game and the anime. And yes, these criticisms are fair for the game as well, if they are indeed there. But one thing that is clearly there is the spirit summoning, and in both cases, they take away from the trial, as Phoenix Wright couldn't have had solved the case, without outside intervention from an element that realistically wouldn't be able to be a factor. In the game itself, the literal second case, you can't solve this, without the intervention of the spirit. In other words, you, the player, can't solve your first case after the tutorial, on your own. But that is a flaw of the game, that I've decided to state to say that the source material is far from perfect itself.\\n\\n\r\nWell, the next thing that you might think that, this was intended strictly for the fans of the game. Even then, I'd say this is a pisspoor attempt that deserved no recognition, if you are to compare the animation quality, not to other anime, but rather to the game itself. The spritework animation in the game of Ace Attorney is absolutely gorgeous. It is incredible to see how much detail they have managed to add in spriteart, which is done by drawing everything pixel by pixel. Am I supposed to believe this is meant to be an omage to the fans of the game, when they couldn't even do proper shading on the characters in the anime's animation? Am I supposed to believe that when there's just the bare minimum of details in the animation, while the simple spritework of the game did so much work to convey as much detail as possible, am I supposed to think this is meant to be made for the fans? No, this is just someone exploiting the intelectual property for money. If this was meant for the fans, they would've gotten far better animation, as I can't see how this anime could enrich the experience of the games, when they just have rushed in trials with pisspoor animations\\n\\n\r\nWhat is left to say about Ace Attorney? It is a mess. It is terrible. But it was really fun to watch. It is flawed in so many ways and on so many levels, that I've enjoyed it a lot. Seeing the constant flow of flaws that it threw my way truly entertained me, because I really enjoy when a series is so flawed, that I have to praise them for it. This series did nothing right, except for a single episode, where they've shown the childhood of Edgeworth, Phoenix Wright and Larry Butz, strictly because it is unexpected and has nothing to do with the cases. I found it endearing because there wasn't really any of the elements that made me rant what I've ranted in the review. But the trials, have so many obstacles to be properly consumed, so many discrepancies, be it logic gaps, be it unprofessional behavior that leads nowhere, be it blownout overreactions, be it supernatural elements that shouldn't be a factor in court, be it etc, that I couldn't just manage not to enjoy the obstacles themselves. The reason I have not stated as many of the flaws I've seen in this series because the flaws of the series were quite honestly the sole enjoyment factor I've got out of it. I think anyone that watches stuff and can enjoy a series for how bad they can be, would have a great time watching Ace Attorney. It is truly bad. Hence it is truly great. It is a great mess that should be watched solely for that reason. Because quite frankly, that is the only way not to be dissapointed with what you get.",
            "date": "2017-01-27T10:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 239242,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047626.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ItIsIDio",
                "username": "ItIsIDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=239242"
        },
        {
            "content": "OBJECTION! I received new evidence regarding this anime. The prosecution has been approached with the following review.\r\nStory:\r\nThese court cases are taken from the Ace Attorney games, but as I never played them, I have no idea how much they left out or added. Whatever, the laws of the court in this anime are pretty weird. Apparently every suspect is guilty untill proven innocent, and even when proven innocent, as long as you can't present the actual culprit, the verdict is still guilty. This is of course absolutely ridiculous and makes it nearly impossible to take this anime seriously. The rest is standard \"main character showedme the true meaning of (subject of anime)\" stuff.\\n\r\n3/10\\n\\n\r\nArt:\\n\r\nPhoenix Wrigth doesn't look good. The characters often look very disfigured and there isn't much love to details either. They tried to mimic the movements from the game for the anime, which just looks awkward. The backgrounds are also rather static, which isn't much of a problem, but more visible in a subpar animated show like this.\\n\r\n2/10\\n\\n\r\nSound:\\n\r\nAll the openings and endings are okay, though far from being great. I have no idea how one of them made it into the top 10 of the charts. Voice acting is okay too, there isn't much one can do with a one-dimensional character, so I can't critizise them for their work.\\n\r\n5/10\\n\\n\r\nCharacters:\\n\r\nYou know why Detective Conan is so successful? Because not only does it have interesting cases, but also interesting characters, with motives, emotions and personalities. In Phoenix Wright there are only good and bad people. The motives often seem very disproportionate, which would not be all that bad if we had something to back up their actions. Even the main characters are rather lame. Naruhodo is a goody little two-shoes, Maya only cares about food and samurai and the prosecutors just want to win by all means.\\n\r\n2/10\\n\\n\r\nEnjoyment:\\n\r\nMost cases were pretty boring and rather obvious to figure out who did it. Maybe this thing works as a game (and that seems to be the case, as many people love them), but as an anime, that is just not enough. The only case which I would consider good was the final one. Phoenix Wright is not insultingly bad (like Mayoiga for example), but there is nothing this show has to offer either.\\n\r\n3/10\\n\\n\r\nOverall:\\n\r\n3.0/10",
            "date": "2016-09-25T08:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 230150,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=230150"
        },
        {
            "content": "\"It's only natural for living creatures to fight to protect their own lives. But what makes us human is that we fight for others.But who do you fight for? How hard must you fight...? That's the true measure of what human life is worth.\"- Phoenix Wright 2004\r\n  I am a big fan of Capcom's Ace Attorney series. With 6 mainline games, multiple spinoffs ,one crossover, an appearance in Ultimate Marvel vs Capcom 3 and Project X Zone, it is safe to say this series is popular. The Ace Attorney franchise also has various manga, 2 Capcom licensed doujin collections, and now an anime. Butthen the anime got trashed on and condemned as a bad adaptation. Now I Corey Censoredlastname will defend this animated adaptation of one of my favorite games.\\n\\n\r\nSTORY:\\n\r\n   The story of the Ace Attorney franchise is really simple at face value, but the cases  go into great detail and have lots of amazing plot twists. Due to spoiler reasons, I will refrain from describing cases. The main premise is that Phoenix Wright is a new attorney at law, just having passed his bar exam. He is taken under the wing of defense attorney Mia Fey and she taught Phoenix to think outside the box, not take things at face value, and always believe in your client. The series goes into cross examination of witnesses to point out contradictory statements in their testimonies, Crime scene investigation, hilarious characters, spirit channelling, and defending the innocent. The Ace Attorney series is overall lighthearted, but at times it can get really dark. This anime adapted games 1 and 2.(Oh boy just wait for Farewell My Turnabout the final case in Justice for All and where the anime leaves off, it is my favorite case) 9/10 where the hell are the psyche locks in the anime.\\n\\n\r\nArt:\\n\r\n The art is what really made this anime adaptation not as good as it should be. Characters go off model frequently, some characters dont look right (Larry is a prime suspect), and the CGI is absolute TRESH. The backgrounds do look nice, and the text from the games are translated well, and some of the dramatic effects are amazing. I just wish the art was as good as the sprites, or the cutscenes in Dual Destinies and Spirit of Justice which are animated by the same studio how did they screw up this badly wtf.\\n\r\n6/10 its passable, and some things are great.\\n\\n\r\nSound:\\n\r\nThe anime has some amazing sound design. The voice actors are amazing. Kaji Yuki as Phoenix was amazing. Better than those bit crushed GBA samples by a longshot. I am a big fan of his work so hearing him as Phoenix made me overjoyed. Edgeworth has a really good actor also, and Franziska has such a smug actress. The music is amazing too. As you know, the Ace Attorney franchise is well known for it's amazing music. The anime takes the approach to music similar to Dual Destinies and Spirit of Justice, as all the music is orchestrated instead of using the GBA or DS ost and calling it a day. Holy shit the 2001 Objection theme never sounded more epic. And the Pursuit Cornered 2001 theme is amazing. Still can't beat the DS version of that song. However it seems that Justice For All's OST is mostly missing. That kinda sucks as I liked that game's OST a bit, and I've heard the orchestral cd arrangements and it sounds amazing, and would sound amazing on TV. So the 2001 themes carry over to the Justice for All adaptation. So no Moderato 2002, or Pursuit Caught. I'll give it an 8 due to the missing music.\\n\\n\r\nCharacters:\\n\r\nThe Characters are amazing listed below are main characters that do not spoil anything.\\n\\n\r\nPhoenix Wright: Newbie defense attorney who believes in his clients, and is highly intelligent, if a bit silly at times. He gets nervous, and is a friendly man. OBJECTION!!!!!\\n\\n\r\nMia Fey: Phoenix's mentor. That's really all I can say without spoilers\\n\\n\r\nLarry Butz: Phoenix's best friend from gradeschool. Larry is a goofy and friendly character known to overreact, and has a bad track record of getting dumped. He is unlucky and always ends up in bad situations. If something smells, it's usually the Butz.\\n\\n\r\nMaya Fey: Phoenix's assistant who is a spirit medium in training. She is a comic relief character and is a very lovable person. She also has a bad track record being involved in many murder cases over the years. She loves hamburgers, ramen, and the Steel Samurai. She also seems to have a bit of a crush on \"Nick\".\\n\\n\r\nMiles Edgeworth: Prosecutor who does almost anything to get a guilty verdict as he hates criminals. However he doesn't resort to any illegal tactics. He is also a really nice guy he just acts like an emo kid on their period. That autopsy report is outdated your honor.\\n\\n\r\nFranziska Von Karma: Tsundere prosecutor who is a really cool character. \\n\\n\r\nDick Gumshoe, lovable detective who is a bit of a dope. He doesn't make much due to always getting paycuts. He looks up to Edgeworth a lot.\\n\\n\\n\r\nI overall enjoy the anime adaptation. It was a well adapted version of the first two Ace Attorney games for the given episode count. I also like the fanservice of there even being a Phoenix Wright anime. Also here is a note, The bonus 5th case for the DS version of the first game, Case 5:Rise from the Ashes is missing. However I didn't like that case very much as it was really long and boring, but I did like Damon Gant so I am indifferent to it's exclusion. However the first case from Justice for All, \"The Lost Turnabout\" is missing, and this might pose a problem for the upcoming second season. I might not have liked that case much, but it introduced Maggey Byrd, a character who later reappears in the 3rd game as a waitress in Jean Armstrong's café. Also Richard Wellington had a hilarious breakdown. My enjoyment is an 8/10 but the critical score is a 7/10. It is not as bad as everyone says.\\n\\n\r\nThe games are amazing though and way better so you should definitely play those. They are 10/10 material no joke.",
            "date": "2018-03-30T19:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 275815,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6698691.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LSSJ_Gaming",
                "username": "LSSJ_Gaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=275815"
        },
        {
            "content": "A lot of these low reviews come from people who haven't played the games, but I've played them—all of them—and this is the definition of butchering a series. I'm surprised the fandom was as forgiving of this adaptation.\r\nNearly all of the problems from this stem from the difficulties of turning games that take more than 30 hours of pure gameplay to finish into a single season of a TV show. What made Ace Attorney memorable were the characters and the interactivity. Converting it to anime automatically loses the interactivity, so you lose the suspense or the feeling of being connected to the action. Then becauseit's rushed, plot holes are created and you lose a ton of characterization. What results is a rather boring show with 1-dimensional characters. Not to mention the animation is just bad. All around this was not a well-done adaptation.",
            "date": "2018-02-07T23:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 271011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/socialworkkid96",
                "username": "socialworkkid96"
            },
            "url": "https://myanimelist.net/reviews.php?id=271011"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nFirst of all, this anime is an insult to courts of law and judges. I know it doesn't reflect reality but using murder cases in this anime where they just seem to compete in who can make better statements is bad taste. Noone seems to care who is innocent (Naruhodo does but he just believes they are innocent and doesn't ask for any explanations).\r\nOST in this anime is good. Nothing extraordinary but didn't make me skip the OP or ED. Animation is poor. Too much still shots and visual effect is court are flashy but not very well done.\r\nUsually anime characters inpower positions have a glaring fault and due to that it falls to MC to do things but in this case the judge is just dumb. He has no good qualities, how can someone who is timid and dumb become a judge, he could be one of them but not both. A procecutor who had 100% win rate and was suspected off tampering for evidence was not checked. All I want is some common sense and logic in this anime but I found none.\\n\\n\r\nThe court system is so that people are convicted on circumstantial evidence unless the defence can show otherwise. And they aren't given much chance to do so. The jails must be full of innocent people because the detectives are quite bad too.\\n\\n\r\nOverall, I can never like a court drame where you can't take anything seriously.",
            "date": "2016-06-27T05:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 222148,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Bozzzz",
                "username": "Bozzzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=222148"
        },
        {
            "content": "Let me start off by saying that I have not played Ace Attorney. I know some things about it from friends that have played the game, but characterization, plot, story elements and the like are foreign to me.\r\nStory - Strong 6 - Weak 7\r\nObviously there are only a few cases a season, and this show would have benefited from the long running format of TV anime. But it was decided to make this a seasonal show and so be it. It think the show does its best to speed through the elements it has and while they aren't always done well, I'd say they're entertaining.Although I can see why people who had played the game might be frustrated at the cut down abridged versions of their favorite characters.\\n\\n\r\nThe first episode is... It's bad. It's rushed, obviously to set the formula for the series and establish characters and set pieces before launching into it's first big case. If you already knew the Ace Attorney games, I'd say you could even skip the first episode entirely which isn't a good thing.\\n\\n\r\nThe rest of the cases are pretty decent though. While I don't think it's possible to figure it out the solution most of the time, I also don't think the show is working under the illusion that it wants you to? It would have made the show better, but i don't think it detracts too much.\\n\\n\r\nArt - strong 6\\n\r\nLook. There's like maybe three locations in an episode and the background for the courtroom are used repeatedly. But the art looks fine. There isn't any problems with perspective and key frames are all good. There are even some nice dramatic rotating shots used far more appropriately than in other shows (it should be noted these are all done in the courtroom, where everything at least has a 3D model to reference off)\\n\\n\r\nNothing particularly of note.\\n\\n\r\nsound - 4\\n\r\nIt's not bad sound. The sound effects are just all ripped directly from the game. There's very little inspiration here. \\n\\n\r\ncharacter - 6\\n\r\nThe characters here are not the characters from the games. They are far simpler and straight forward because the show doesn't have enough time to elaborate as much as it would like. They aren't exactly begging your investment. But they serve to get the story across.\\n\\n\r\nEnjoyment - 9\\n\r\nI love it. It's fun, it's stupid. It has immense trouble trying to summarize the excuses for it's plot inconsistencies. I often have fun with not quite average anime. I do not think someone who loves the games will find the enjoyment that is probably tainting my review in their watch, because of the sacrifices made.\\n\\n\r\nOverall - 6\\n\r\nSo in summary\\n\r\n - Story is cut down from source material and this weakens the plot slightly\\n\r\n - Art is of average quality for this studio and did not impact the viewing experience negatively\\n\r\n   - It should be noted the rotating shots are of good quality and appropriately used.\\n\r\n - Sound is fine, OPs are of decent quality. I didn't watch the EDs...\\n\r\n - Characters are a little flat, thiss does somewhat detract from the experience\\n\r\n - I enjoy this far too much\\n\\n\r\nIt could have been better,  could have been worse. Just a little better then average due to it's animation and presentation.",
            "date": "2019-04-10T04:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 305953,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6644421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Apple_Twinkle",
                "username": "Apple_Twinkle"
            },
            "url": "https://myanimelist.net/reviews.php?id=305953"
        },
        {
            "content": "I didn't expect much out of this anime to begin with. Everyone wanted it, but from the very begginig I knew, that adapting the Pheonix Wright games was not the smartest idea. For the most part the story was pretty predictable, but I had hoped, that at least it would be a decent adaptation. I was wrong.\r\nNOTE: I boosted scores by about a half or so, because of the second to last arc, that actually was really good in every aspect. Most of the stuff I'll write below does not apply to that arc.\r\nYou might like this anime if:\r\n-You are a fan of the PheonixWright games\\n\\n\r\nYou might dislike this anime if:\\n\r\n-You never heard about Pheonix Wright. This anime does not have much to offer to you.\\n\\n\r\nStory: 5\\n\r\nThis is a mystery anime right? So why, for more than half of the cases, culprits are revealed at the beggining or in the middle of the investigation? It makes no sense. But hey, even if that wasn't the case, you can only guess who is the culprit, because most of the time, the evidence is provided way too late into the trial and at that point it's already obvious who did it. Though the cases can be interesting, the decisions that have been made concerning the story take away most of the fun of mystery anime, and leave you with a semi-decent drama. Also, let me mention the humour, that is at times decent and even better at a few select moments, but at others it feels incredibly misplaced. For example, a few seconds after an information about a murder occured, someone throws a joke. How can you laugh after someone told you that? I understand that it never is too serious to begin with, but when some events happen that are supposed to make you nervous, they don't, because you feel like it wasn't meant to do that. The games were never good in the story aspect, not counting a few cases, but this is a disaster. Overall, a first part of the long list of disappointments. The failed battle of silliness and seriousness does not help either.\\n\\n\r\nArt and Animation: 2\\n\r\nThis is an absolute disgrace when it comes to today's standards. Except for maybe Maya, everyone looks so wrong, and their animations are so weird. Even the main hero changes his face almost every scene. Honestly at some points it looks like some old animation from Newgrounds or something. It even made me burst out laughing because of how bad it was. It perfectly represents how little care was put into this. In the very last episode, the judge moves his mouth, but no voice can be heard, and the only sound is his hammer beating againts the palm of his hand. I usually leave the next part for the OST, so I though I'll mention it here. Overall, it's abysmal by today's standards. One or two scenes can't change that.\\n\\n\r\nSound: 8\\n\r\nIt is.... good actually. The soundtrack from the game has been implemented here and the openings are catchy (the first opening ends in a weird, abrupt way though). There are some mistakes, the music at times doesn't fit the scenes and at some others it is dead quiet. In the last episode (again) there was clearly supposed to be a conversation, but instead we get a silent nod from a character. That lasts about 10-15 seconds. In complete silence. Some music would help at least, you know? Overall, pretty good, fails to fit sometimes.\\n\\n\r\nCharacters: 4\\n\r\nThe characters were probably the strongest point of the games. Here they are bland and boring, maybe except Maya, but even she can often fall under that category. I did not care about anyone, they can all go disappear for all I care. No development, no interesting moments, nothing. They feel like butchered versions of themselves. I don't have anything else to add.\\n\\n\r\nEnjoyment: 3\\n\r\nThe only redeeming factor was the circus arc that I mentioned at the beggining. If not for that, this would easily be a one. It's boring, painful to look at and overall just a huge disappointment. I did play the games and I was a little bit excited, but after the second arc, I ended up mindlessly grinding it to the finish line (except for the circus arc, it was a huge surprise to me really).\\n\\n\r\nOverall: 4\\n\r\nIt has nothing that I would consider worth recommending. I will never look back at it again. This is only watchable, if you played through the games and you want to see them turned into an anime. Everyone else might as well watch a field of flowers or something, I don't know. I could probably watch another season, it would cover my favourite game after all, but this one was a pain to watch. Glad it's over.\\n\\n\r\nOf course, this is purely my opinion, but I can't recommend you to develop your own. Watch at your own risk.",
            "date": "2016-09-26T13:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 230297,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=230297"
        },
        {
            "content": "Ah, Ace Attorney. The wonderfully wacky yet also emotionally gripping visual novel/puzzle game series from Capcom. Full of great character designs, iconic music, over the top situations and dramatic stakes, it should make for a great anime adaptation, right?\r\nWell, no, not \"great\", at least not when the god-kings of shovelware anime, A-1 Studios, is the guys behind production.\r\nI won't beat around the bush: this anime is not -terrible-, but its got some serious flaws both in adaptation and as a stand alone product.\r\nLet's get to the biggest blemish to see: the art and animation. It is f u c k i n g terrible mostof the time. Characters are routinely off model, animation is very limited and choppy as all hell, props are messy and also off model, backgrounds are garrishly obvious digital compositions, which are ALSO off model sometimes, SOMEHOW, despite mostly being geometric shapes (when they aren't directly copied from the games backgrounds). Its bad, people. Its really bad.\\n\\n\r\nThe next biggest flaw is the pacing and adaptation of the cases, though this is a mixed bag at points. The anime streamlines the ridiculous back and forth shenanigans of constantly presenting evidence, being objected, being overruled, and having to present more evidence for the sake of a smoother narrative, and that's honestly fine for the most part. It also cuts out a lot of the backtracking for investigating for more evidence in favor of more character driven scenes, which is an honest strength of the series it can boast.\\n\\n\r\nHowever, in exchange for this the trial segments seem to move at an almost breakneck pace, throwing off the timing that a lot of moments the game had for dramatic or comedic effect. Events are rearranged sloppily, and the overall presentation is a bit of a hot mess to watch.\\n\\n\r\nIn spite of all this, the anime does retain a lot of the strengths of Ace Attorney's video game origins: almost every character is likeable and enjoyable to watch, especially frontman Phoenix Wright, his rivals Miles Edgeworth and Franzsika von Karma, his assistant Maya Fey and others. The music is directly taken from the games as well and generally sounds very nice, loaning a strong air of authenticity to the final product.\\n\\n\r\nI suppose my bottom line is that is you LIKE Ace Attorney the games, then you will probably enjoy watching the anime, provided the minor narrative changes don't bother you so much. If you didn't like the games, this anime will not do you any favors, and if you've never played the games but are curious about their stories.... I would suggest just playing the games instead, but you probably would enjoy watching this if your standards aren't too lofty. All in all, the Ace Attorney anime is a serviceable if hideously ugly and uneven watch that will probably get a few laughs out of you at least, but won't be moving any mountains.\\n\\n\r\nAlso, watch the dub, because Funimation is fully aware of the games' weirdness to localize obviously Japanese set places in the games into American counter parts and it really plays up that goofy angle.",
            "date": "2018-10-07T13:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 291180,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384577.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CappnRob",
                "username": "CappnRob"
            },
            "url": "https://myanimelist.net/reviews.php?id=291180"
        },
        {
            "content": "This is my first review and I'm gonna try to make it the best I can. Of course, this is spoiler free.\r\nStory 3/10:\r\nSince I've ever heard about this anime I thought I'd be awesome, I don't consider myself as a diehard fan of Ace Attorney, but man, I was very dissapointed when this anime got to the case 3. It was very awful, especially when it reached case 4. I've watched 12 episodes of this anime. Enough episodes to say that the story is a total mess, it doesn't make sense sometimes and they skip very important parts of the story. Sometimes you couldn't realize(If you haven't played the games) why something was the way it was, like, when they don't even explain anything about the facts, the things that happened but Phoenix does realizes it and suddenly he objects and like I said before, if you wouldn't have played the game then you wouldn't even realize why something it's the way it is. The story goes super fast and that makes it difficult to understand, the explanation of the facts and things that occur during a trial is very poor and you can't realize what's happening. \\n\\n\r\nArt 7/10:\\n\\n\r\nIt's good, though it has its flaws. There were episodes wherein it wasn't that obvious that the face of some character was pretty lame, and not well illustrated. However, I think that (and this isn't spoiler) in the episode 11, the art was pretty bad and it was the most obvious episode to have dreadful faces and a bad illustration.\\n\\n\r\nSound 6/10:\\n\\n\r\nIt lacks of epicness. In the game, almost every track was epic and made you feel like you really were an attorney investigating, or having a trial and suddenly having to use logic to think of a solution to a dilemma, or being in a trial and cornering a witness or cross-examinating a testimony. The anime version of Cornered was the track I liked the most out of all the other ones. \\n\\n\r\nCharacter 3/10:\\n\\n\r\nNot enough development. I know it is an adaptation of the game but come on the creators could've done this one right.\\n\\n\r\nEnjoyment 4/10:\\n\\n\r\nIt'll sound weird but, I enjoyed one or two episodes of this anime but only due to the fanservice and the references to the game, it was well made. If you are a fan of the franchise, then you could watch until the end of case 3. I don't recommend watching beyond that, because seriously, one of the best cases in the game got ruined because of this bad adaptation.\\n\\n\r\nOverall 5/10: \\n\\n\r\nI gave it a 2 before this review. But now I'll be more just and I will give it a 5 because although it disappointed me a lot, it did good some things and that deserves at least a 5.\\n\\n\\n\r\nThis was my first review. Sorry if I had grammar mistakes in the review, this isn't my native language. Also, if you find this helpful, mark it helpful as well.\\n\\n",
            "date": "2016-07-01T22:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 222697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493107.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LordAgustin08",
                "username": "LordAgustin08"
            },
            "url": "https://myanimelist.net/reviews.php?id=222697"
        },
        {
            "content": "I would've given this a 4, but a 3 because I am an avid Ace Attorney fan for six to seven years, especially with the fact that this anime did not really do the main games any justice. Even, the walkthroughs on YouTube are better to watch. The anime is only decent if you really want to kill time, but it does not cut it for me.\r\nThe games do have several puns and memes, so this anime was a letdown for me because the execution was poor. If anything, I only like the opening because of my Feenie x Edgeypoo fangirl heart.",
            "date": "2016-11-27T17:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 234508,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5546135.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/fujitsukishima",
                "username": "fujitsukishima"
            },
            "url": "https://myanimelist.net/reviews.php?id=234508"
        },
        {
            "content": "I decided to do a quick review of an anime I dropped, please note I haven't seen all of the episodes or played the games, but I'm sure I have a basic understanding. \r\nStory (4) - An attorney getting clues and defending someone? Sounds, great honestly. I would give it an 8 but, the execution is god awful. It's nothing more then a being mess with no attempts for jokes or character development, it's more of a thing that happened then the characters just move on. They forget about that the next episode.\r\nArt (2) - I love is art style of a video game, butthat's the only good thing about it. The art can be awkward and still at times that I wish I could look away but I can't then I'm stuck with a headache. Sometimes the animation looks odd as well, like in the opening.\\n\\n\r\nSound (8) - Easily the best part about this show, the voice actors and actresses do an amazing job on there parts. Listening to the opening and closing of each episode is the best part of each episode. They don't sound grading to the ears! It sounds like effort has been put into them!\\n\\n\r\nCharacter (1) - Uh... who are these people? The characters in this show are so, boring. It makes each episode go for longer and longer. Mr. Attorney Can't Remember His Real Name Man is the blandest and the most forgettable of them all, at least the other characters seem cool and heck maybe even OKAY but since THIS guy is our main character we have to follow him around and hope he does something another then some random stuff that's ends up working in the end.\\n\\n\r\nEnjoyment (3)\\n\\n\r\nOverall (2) - If you're drink and bored, THEN watch this anime but if you aren't both of those things kindly run away from this monsterpiece of a show.",
            "date": "2016-11-23T15:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 234259,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5733774.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShelbyWAO",
                "username": "ShelbyWAO"
            },
            "url": "https://myanimelist.net/reviews.php?id=234259"
        },
        {
            "content": "STORY (7): This anime has good storylines. It takes 3-4 episodes to cover each case. In some cases, it feels like it can drag on but they touch on the details. It can also be pretty intense in court (between the Prosecutor and Defense) -- especially when both sides have to yell object and prove their case. During the examination of each witness, each of them brings something different. In some cases, they would leave us second guessing ourselves, but it can also be predictable. \r\nCHARACTERS (7): They are numerous characters that are introduced in this series & they have so much personalities.\r\n- Phoenix Wright(Ryuichi): New Defense Attorney who works for Chihiro. He is very kind, helpful and understanding. P.W. is passionate for what he does & has great deductive skills.\\n\r\n- Mia Fey (Chihiro): Defense Attorney, beautiful & intelligent. \\n\r\n- Miles Edgeworth (Reiji): Crown Prosecutor and an old friend of Ryuichi. \\n\\n\r\nOVERALL (7): One of my favourite animes to watch. I can see that they use some of the video game's content onto the series. I pray that they will make another season! (& possibly have a crossover with Professor Layton in the anime).",
            "date": "2016-09-24T15:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 230072,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=230072"
        },
        {
            "content": "I cannot believe that now this is over. Before I start this review I will say that I have personally not played the Ace Attorney series but I have seen playthroughs of the games. \r\nStory: If you have played the Ace Attorney games than this an adaptation of the first two games.  I feel that this was a good adaptation of the game but their was some stuff that I totally feel I agree with the community with. The Changes that were made to Ace Attorney that came throughout the series made this interesting because it changed the anime up a lot. The changeswere small but it made me like this a lot.  The story I give a 9. \\n\\n\r\nArt: The animation of Ace Attorney was really great since you have the Objections that Wrights said and it was handled perfectly. The Art I give an 8. \\n\\n\r\nSound: I could picture a dub for this anime being made since we got a picture of it in Dual Destinies. The Sub was not bad it just when you are used to hearing English voices from the games it an adjustment. Sound I give a 7. \\n\\n\r\nCharacters: Every witness that is interrogated in the court room is what makes Ace Attorney. Everyone has a unique personality that makes it interesting. The characters I give a 10. \\n\\n\r\nEnjoyment and Overall: Overall I give this an 8, I cannot give this a perfect score because of flaws that are given in this adaptation. My enjoyment I give a 9 because I love this series and I feel I got the most out of this.",
            "date": "2016-09-24T09:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 230017,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4828029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuna67876",
                "username": "Yuna67876"
            },
            "url": "https://myanimelist.net/reviews.php?id=230017"
        },
        {
            "content": "Really good anime that does the games justice. (Did I really just make that joke?) The music was great, the characters were very entertaining, and the story was extremely engaging. Episode 13 in particular was really heartfelt and shed some light on the Phoenix/Ryuichi's backstory. Highly recommend to fans to the series, as well as newcomers who want to get into Ace Attorney. \r\nIt starts out like the first game, where we see a young woman get killed in her own apartment, and the murderer stating he'll pin it on Larry Butz, Phoenix/Ryuichi's best friend. As you may guess, Phoenix must prove Larry's innocence toavoid him from being sentenced to prison.\\n\\n\r\nThe anime is charming and comical, much like the games, and it really makes being a lawyer look cool as heck (keeping it kid-friendly, I like it).\\n\\n\r\nOverall, great anime with fun mysteries that will keep anyone entertained. 10/10.",
            "date": "2019-04-24T20:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 307089,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8009407.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ObjectionCeption",
                "username": "ObjectionCeption"
            },
            "url": "https://myanimelist.net/reviews.php?id=307089"
        },
        {
            "content": "(Note: Just for the heck of it, I’m gonna use the Japanese names for this review. Because why not?)\r\nAce Attorney (Known as Gyakuten Saiban in Japan) is probably one of the better known Visual Novel franchises in the west. Honestly, I’m not surprised. The cast is full of quirky and likable characters, the writing (For the most part) is witty yet clever, and the translation job is fantastic, sudden change of location of Japan to America aside. Yet, despite the fact that the original game came out back in 2001 for the Game Boy Advance, it has taken them until 2016 (Literally 15 years) toactually do an adaptation of it. And of course, they got… A-1 Pictures?\\n\\n\r\nErr… why? Wouldn’t it make more sense to get TMS Entertainment? Because if anyone knows how to do a good mystery Anime, it’s them. And it’s not as if A-1 has a good record with their Adaptations of videogames, or need I mention Persona 4 The Golden Animation? Still though, let’s see if this Anime is guilty of being a bad Adaptation, or Innocent:\\n\\n\r\nStory:\\n\\n\r\nThe show adapts the first two games (I presume they adapted both since it’d be a pretty short show if they only adapted one or the other). To be fair, for the most part it’s a fairly accurate adaptation. Not many divergences from the game are made, it does mostly stick with some of the details, and overall, it’s not bad in that regard.\\n\\n\r\nUnfortunately, its first issue becomes that the few changes that are made are really bad. They often screw up the pacing, are generally needless, ruin a joke, downplay the original impact of the scene, and are just not good. It’s kinda like the movie “Watchmen”, which was a very close adaptation of the original Graphic Novel… to the point that when a change was made, it stuck out like a sore thumb. They also remove stuff, most of which you can’t simply remove (Like, say, not mentioning Mitsurugi’s fear of Earthquakes). Also, for whatever reason they kept around Turnabout Big Top. You know; the worst case in the whole franchise? Yeah, I don’t know why they did it either.\\n\\n\r\nAlso, the pacing is not good. To be fair, cutting down some scenes here and there to lessen the repetition is a good thing, but the way it’s done makes the anime go at a breakneck pace, and it is quite annoying.\\n\\n\r\nAlso, I don’t think this show makes enough use of the fact that it’s an anime. The game is shown almost entirely from Naruhodou’s perspective, so this would’ve been the perfect chance to add stuff relating to the other characters and their perspectives. Maybe showing characters like Itonokogiri doing their own job, or maybe add some extra scenes to develop the side characters. Sadly, the best you’d get is a couple of flashbacks involving Mitsurugi and Mei, but that’s about it really. So overall, while I don’t think this is bad, I do think there’s too much lost potential.\\n\\n\r\nCharacters:\\n\\n\r\nThankfully they’re mostly unscratched. Really, this cast is nothing but a bunch of lovable dorks. There’s the sarcastic yet humble Naruhodou Ryuichi, the peppy and upbeat Ayasato Mayoi, the absurdly adorable yet innocent Ayasato Harumi, the absurdly incompetent yet lovable Itonokogiri Keisuke, the whip happy and uptight Karuma Mei and more than a few more.\\n\\n\r\nBut rather predictably, my favorite is and has always been Mitsurugi Reiji. Not only does he have one of the best character arcs in the whole franchise (And thankfully, more than a bit of it happened in these first two games), but the guy’s stoic behavior just lends itself perfectly to comedic situations, and he does avoid being a generic rival (Though admittedly, he is a bit of a male Tsundere).\\n\\n\r\nAnimation:\\n\\n\r\nThe show looks BAAAAAAAD. Jesus Christ, how the hell can you look worse than sprites from an early GBA game!? The animation in general is just stiff and lifeless, and there are multiple moments of off-model animation. What’s worse is that this show is not exactly adapting something that requires a lot of movement, yet they still somehow screwed it all up.\\n\\n\r\nOn a completely unrelated side-note, I have to thank Crunchyroll for actually giving fans the option of either having the Japanese or English names. I went for the Japanese ones as the disconnect between what the characters were saying and what’s shown on-screen, but I’m glad we were given the choice. Wish they’d done the same for Dragon Ball Super, but oh well.\\n\\n\r\nSound:\\n\\n\r\nBy contrast, the Soundtrack was surprisingly good, I noticed quite a few Remixes for songs from the game, and they’re all quite nice. As far as Openings and endings are concerned, the only one I cared about was the second Opening “Jinsei Wa Subarashi”, the rest were somewhat bland.\\n\\n\r\nVoice Acting:\\n\\n\r\nIt’s all over the place. For whatever reason, none of the actors from the game came back, which confuses me to say the least. But as I always say, so long as the replacements are good, I shouldn’t care.\\n\\n\r\nSadly, most of the replacements are just doing impersonations of their game voices, but worse. Kaji Yuuki is a great actor, but he was just awfully miscast here. He just sounds not only too young for Naruhodou, but also way too wimpy and whiny. Tamaki Masashi (Whom I have no experience with whatsoever) is okay, but he really just feels like a worse Takemoto Eiji. In fact, with the exception of Yuuki Aoi as Mayoi (Whom I’ll admit to preferring over Hanamura Satomi) and Nakamura Chie as Chihiro, everyone with a pre-established voice is just a worse (Though not necessarily bad) version of their previous Seiyuus: Yumiba Saori is a worse Sawashiro Miyuki, Iwasaki Masami is a worse Ishii Kouji, Otsuka Akio (Surprisingly) is a worse Yanada Kioyuki and so on. The ones without a voice beforehand are better, but still nothing special.\\n\\n\r\nOverall:\\n\\n\r\nLike with that Super Robot Wars anime I reviewed a long time ago, this anime is extremely middle of the road. I don’t hate it or anything, but I can’t bring myself to truly like it either. Still though, I am gonna give the second season a bit of a chance as I have heard it does make some improvements. But as it is, it’s a middle of the road anime adapting two very good games. And as for the Verdict everyone wants me to give… well, I guess it’s guilty… but it’ll only be sent to prison for a couple of months.\\n\\n\r\nFinal Score: 5/10",
            "date": "2019-01-13T13:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 298957,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 2,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=298957"
        }
    ],
    [
        {
            "content": "\" Judge....What are you doing!?  Do your job!  Bring an end to this miserable charade!\"  -  Manfred Von Karma  ( 2001 or 2005 if you live in America) \r\n  Very well.  I'll bring this whole case to close my dear readers, because my magnificent vengeance...........eh well it still won't be satisfied after reviewing this.  A lot of people may defend this anime,  but they would be out of their mind, no sane man would.  That's why I'll do my best to make sure this anime, gets the verdict it deserves.  GUILTY!\r\n   Youknow this season has been one disappoint after another, we got Berserk (2016) and now this,  it's like all my favorite things are being ruined consecutively.  So what's wrong with this show?  What's right with this show?  I could easily just sit here and tell you that it isn't like the video games, as easily as YOU the reader could easily either having played or not played the video games could say that it is an adaption give it some slack, but rather than argue with little reasoning, let's throw out some facts.  \\n\\n\r\n  Why a company like A1 Pictures was ever a pick to adapt a franchise like Ace Attorney of all things is beyond me.  A company that never seems to do the source material they are given justice and more often  then not turns what should be an entertaining romp into a boring slog,  isn't what my first choice would be for an Ace Attorney anime.  The  Ace Attorney anime isn't just a bad adaption, it just isn't a very good show.\\n\r\n  It is actually quite hard to put into words as not only a fan of the games, but as someone who expected a fresh perspective on the series, my disappointment.  Let me be blunt right of the bat,  the pacing is just God-awful in every regard.  The anime pretends to be doing the fans a service by adding in the time and date stamps for the video game, but its just a way to cheaply make scene transitions and even then they aren't good.  What is worse is not only have things been edited to fit a 24 episode series, heavily butchering some of the important plot lines and moments that made Ace Attorney good, but entire cases have been cut including: Rise from the Ashes and the starting case from Justice for All.  They aren't that integral to the story, but when you have a pointless filler episode for decade old content,  makes their failure to appear all the more jarring.\\n\\n\r\n   While there are a lot of bad aspects about the series,  I must hammer it in that pacing is by far the worst offender.  Ace Attorney is a witty, quirky series with clever humor,  but it seems A-1 will never understand WHY people love the series they so poorly adapt.  The series is fast paced,  but the failure to understand what makes the characters' personalities shine is why the humor falls so flat.  Phoenix is so damn bland,  instead of being a sarcastic yet vulnerable personality he always feels as though he's just some generic protagonist who pulls the right answer out of his ass.  Maya is nowhere near as charming or as expressive as she once was.  Miles Edgeworth is flanderized into being a complete tsundere and big sis Franziska...?  Well she may actually be the only one improved, being less of a cold hearted always angry perfectionist to.....well a slightly more energetic cold hearted always confident perfectionist.  Still annoying though.\\n\\n\r\n   The animation is a completely different story.  If you have a hard time concentrating on both subtitles and what's happening at the same time, you may not catch it, but there are constant cheap cuts, animation errors, missing facial features,  characters drawn at wrong heights, and so on.  It absolutely boggles my mind to no end how the games being represented here,  both of which being over a decade old have better animation in it's limited sprite work than a fully animated series in 2016.\\n\\n\r\n  From the bland intros that show how vague of an understanding A1 actually had of this series to the sad amount of little to no impact that each case should hold,  clearly something went wrong here.  The one positive I can give you that the soundtrack has fairly decent remixes and the opening song is actually good on its own.  I guess another positive could be that they only touched the first two games in the series  and hopefully will not get the chance to touch the remaining titles.  Other than all that though?  Just stay the hell away.  Bad pacing,  a cast that is constantly out of character,  bad animation, typical of A1 pictures and a huge misrepresentation of the source material on every level makes for an unsatisfying experience that truly does justice for no one.\\n\\n\r\nCASE CLOSED.\\n\\n\r\nVERDICT.\\n\\n\r\nGUILTY AS SIN.",
            "date": "2016-09-24T19:25:00+00:00",
            "helpful_count": 72,
            "mal_id": 230094,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955439.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GhostStorm",
                "username": "GhostStorm"
            },
            "url": "https://myanimelist.net/reviews.php?id=230094"
        },
        {
            "content": "Ace Attorney, alongside Pokemon and JJBA, is one of my absolute favourite media franchises. I have spent countless hours playing the games over and over, producing fanworks, and discussing them at essay-length. So, as much as I appreciate the need to be objective and focused in my review, I feel that it needs to be said:\r\nI hate this anime. I hate it so fucking much.\r\nSono \"Shinjitsu\" Igi Ari is an adaptation of the first two games in the series, and right off the bat we've hit a huge stumbling block. Each of these two games would be more fit to a full 24 episode animein their own right than being crammed into one cour each. Unsurprisingly, a lot of content was trimmed in the process of fitting both games, and what content survived the cull is rushed through at breakneck pace.\\n\\n\r\nThe dialogue is cut down the most, and being that the source material uses mostly text-based storytelling this is a huge blow. Losing so much dialogue not only robs the series of much of its charm, but also does serious damage to its characterisation. Phoenix in particular is characterised mostly through his constant snarky, quipping inner monologue, which is almost entirely absent here.\\n\\n\r\nWe barely get to know most of the characters, making it difficult to be invested in their character arcs - and that's just the ones whose arcs were actually shown in the anime instead of being skimmed over. Many characters are stripped down to the barest of plot relevance, and others are reduced to nothing more than a cameo appearance.\\n\\n\r\nThe bread and butter of Ace Attorney is its contradictions, the solving of which drives the murder mystery plots the series revolves around. Even these are changed, however, in the name of this streamlined approach. Twists are replaced with simplified, obvious alternatives that not only remove the satisfaction of seeing the more obtuse mysteries cracked, but also make you question the logic of everyone responsible for presenting these flawed arguments in the first place, making it much harder to take the prosecutors seriously as competent opponents.\\n\\n\r\nThe trimmed-down dialogue also cuts key context on evidence used throughout the series. One of the most important principles of good detective fiction is that all clues used to solve the mystery should be clearly shown - that the audience should have all the necessary tools to solve the mystery themselves. While the games did this by sheer necessity of the medium, the anime makes no such effort, making the resolutions often feel cheap and unearned.\\n\\n\r\nThis pacing severely damages the presentation of the anime, sacrificing any attempt to preserve the dramatic tension of the games - most contradictions are resolved almost as soon as they come up. And even outside of issues caused by the pacing, the presentation suffers. The quality of the art and animation here is appalling. The errors are constant and glaring. The animation is often comically sloppy. The character designs also stray from the original designs to their detriment, going with an oddly wide-faced look that gives the characters strange facial proportions. Also, they can never quite seem to get Phoenix's hair-spikes right, with them changing shape every time we see them. There is also an excessive overuse of CG animation to cut corners, most obviously in the CG court gallery that has, for whatever reason, been made so much more visible than it was in the source material, as if deliberately trying to highlight how poor the animation is.\\n\\n\r\nThe effects used for dramatic emphasis are cheesy, and adapt the tone of the games poorly - the more abstract effects of the source are replaced with literal auras and dramatic gusts of wind.\\n\\n\r\nThe voice cast is similarly poor, featuring many miscast or noticably inexperienced actors. The entire cast seems to either underact or overact with little middle ground. The only notable exception is Yuuki Aoi as Maya Fey, who seems intent on stealing every scene she is in.\\n\\n\r\nThe anime handles Maya well in general, especially in comparison to its treatment of many other characters. Not only is her character arc left more or less intact, but the animators emphasise her goofy and hyperactive nature far better than a set of 14 sprites ever could.\\n\\n\r\nOn the subject of things the anime did well, most of the anime-original content is quite good. Ignoring whatever logic lead A-1 to add anime-original content whilst also cutting game-canon content, the additional focus on Phoenix, Edgeworth, and Larry's shared backstory, and adding the Signal Samurai motif that represents their friendship (as well as giving some background to Edgeworth's secret love of Super Sentai series) enriches the dynamic these characters have.\\n\\n\r\nThe cuts made do sometimes work to the series' benefit, too. Turnabout Big Top, which is considered by many to be the worst case in the franchise (which it isn't, by the way - fight me nerds) benefits from reduced screentime on some of its more irritating supporting characters, such as Trilo Quist, or that fucking clown. There does seem to be a rule of inverse quality in this adaptation, though - the worst cases are the ones handled the best, whereas the cases that were the series highlight in the source suffer the most from these alterations.\\n\\n\r\nIt's hard to say what the point of this anime is. It was made by A-1's b-team (now CloverWorks, a seperate studio) with little care or attention put into it. At worst, this was a shoddy adaptation by a studio looking to make a quick buck. At best, this was a misguided attempt to adapt a great series by people who have a fundamental lack of understanding of what made these games so good in the first place.\\n\\n\r\nOne way or another, this is an awful adaptation that should only be watched by people who are already fans of the series, and are more interested in seeing another interpretation of the story than in seeing a competent adaptation - and even then, they should go in with low expectations.\\n\\n\r\nPlease don't let this be your introduction to the franchise.\\n\\n\r\nStory/Plot: 3/10\\n\r\nCharacters: 3/10\\n\r\nAnimation/Art: 1/10\\n\r\nSound: 3/10\\n\\n\r\nOverall: 2/10\\n\\n\r\nFor Fans Of: Detective Conan, Umineko no Naku Koro Ni\\n\\n\r\n(Side note: Yes, I'm using the English names. Get fucked, weebs.)",
            "date": "2019-02-06T13:07:00+00:00",
            "helpful_count": 10,
            "mal_id": 301031,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=301031"
        },
        {
            "content": "The courtroom is a wonderful place full of controversy and despair.  Both the prosecution and defense have their own reasonings for choosing their sides, and the verdict in the end is never the most desired outcome.  But we're not here to talk about everyone's right to a fair trial, we're here to talk about everyone's right to a fun trial with A-1's adaptation of the first two games of Ace Attorney.  Put on your attorney's badge and get on your tiny bike.  It's time for objections and nonsensical court cases!\r\nStory: Naruhodo Ryuuichi is a new defense attorney who just got hislicense.  Upon entering the courtroom to deal with his first case, he finds himself defending his friend, Yahari in a court case against him on the accusation of MURDER!!!  Against prosecutor Mitsurugi Eiji, the two fight for Yahari's verdict and in spark a court rivalry over the two over the rest of the series.\\n\\n\r\nTaking the two first two games of the Phoenix Wright series, this adaptation...basically does what you would think it does, which is fully adapt all of the cases from the first two games of the series.  (Big shocker, I know.)  Because of this...there's not really much to say for the actual story of the series.  The main plotline is basically: Get involved with a case usually involving murder, have Naruhodo defend the accused while Mitsurugi does his best to prove someone guilty and ultimately figure out through a long hair-brained stream of hairbrained and highly improbable events, what happened with each case and who truly is the person who is guilty.  \\n\\n\r\nAdmittedly, the story for this series isn't really all that good.  The show's pretty stagnant as to what'll happen and since it's basically an animated walkthrough of the games, you can guess what the end result for all of these cases are.  Doesn't mean that they're not fun to watch, but don't expect things are pretty predictable.  Apart from that, there's really not much to actually talk about.  The problem is because the series is so focused on the gameplay aspect of the series that there's not really much left for anything else aside from the cases, even if they're all really fun to watch.\\n\\n\r\nOverview:\\n\r\n+ Stays true to the Capcom game series\\n\r\n-  Doesn't really show anything besides the court cases\\n\\n\r\nCharacters: The characters for this series features a large and colorful cast of nutjobs and basket cases that come in only during the case in which they're important or needed in, as well as the more ordinary but still somewhat crazy main recurring characters that you'll probably never actually bore seeing.  Probably.  \\n\\n\r\nFirst we have Naruhodo Ryuuichi, or in the localization, Phoenix Wright.  Believing to stand up for the innocence as a defense attorney, Naruhodo doesn't really have much of a character beyond feeling a bit sick and tired of all of the crazy people he has to deal with from his hard to deal with clients and witnesses who bring their own brand of insanity into this joke of a courtroom, which is to be expected of a player character since it's easier to project onto them when they don't really have many character traits to them.\\n\\n\r\nThen you have Mitsurugi Eiji, the prosecutor and rival of our main protagonist.  Devoted to proving the accused as guilty, Mitsurugi plays as the 'villain' of the series and continuously spends his screentime to win against Naruhodo.  His motives are pretty basic and the development that he gets later in the series is pretty paper thin, so similar to Naruhodo, there's not really much to say.  The dynamic between the characters is pretty cool, but on their own, they don't work out all too well.\\n\\n\r\nAside from them, we have recurring characters like Mayoi (or Maya), Itonokogiri (or Gumshoe), and the nameless judge who apparently doesn't know a single thing that goes on in his courtroom despite being the person who puts down the final ruling.  All of whom are on the same level as the rivaling characters in terms of development and actual character traits and really don't differ much from when they're introduced to when the series ends.  Side characters on the other hand, aka the characters that pertain to one or two cases out of the entire series are amongst the reasons why this series is so entertaining.  Every side character is so wacky, out there, and downright strange that it's extremely awkward to watch them, yet you can't look away.  Sure they're one time characters, but making a really good and memorable impression of them far exceeds any other kind of impact that they would've had otherwise.\\n\\n\r\nOverview:\\n\r\n+ Strange yet memorable side characters\\n\r\n-  Main and recurring characters are pretty paper thin\\n\\n\r\nArt: Produced by A-1 pictures, the style and quality of the series is...standard fare at best.  It doesn't really good nor does it look average or mediocre, so the only explanation for the way this series looks is...average.  They do keep the funny looping idle animation and the character freakouts when you finally find the real culprit, so...good on you, A-1.  \\n\\n\r\nOne problem that did arise upon watching this show was that the background characters, especially those who're in the seats in the courtroom were completely made in unnatural and lazy CGI, completely clashing with the rest of the series and the overall look when the entire court was panned out and shown.  They don't do this too often, but shame on you, A-1 for that.  Shame on you!\\n\\n\r\nOverview:\\n\r\n+ Standard art for this day and age\\n\r\n-  Blatant and lazy usage of CGI\\n\\n\r\nSound:  The sound both in the voice acting and the soundtrack of the series are average at best.  There's not really much of anything to note when it comes to either of those, so...moving on.\\n\\n\r\nPersonal Enjoyment:  Ace Attorney...really isn't all that good.  It's not bad, it's not amazing, it just has something about it that doesn't really do well quality-wise.  That being said, this show is a TON of fun to watch.  Without thinking too hard and just following along with the completely out there cases, this adaptation is by far one of the most enjoyable watches that I've had in a while.  Sure it's not the best thing, but quality and enjoyment are two completely separate ratings here.  And if you have any objections, I'll be sure to give you a good cross-examination.\\n\\n\r\nDid I like this series?\\n\\n\r\nOh, far too much.\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nSome characters were a bit irritating, but aside from that, there's not really much to complain here.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nWant a bit of fun?  Want a couple of funny memes?  Want to get through the first 2 Ace Attorney games without a real walkthrough on Youtube?  Than this is the show for you.",
            "date": "2016-09-25T00:18:00+00:00",
            "helpful_count": 17,
            "mal_id": 230113,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=230113"
        },
        {
            "content": "Let's tackle this tightrope walk, called \"Gyakuten Saiban: Sono \"Shinjitsu\", Igi Ari!\"\r\nI don't want to make any excuses for a bad adaptation because, for me, it didn't feel like one. Was it on the top of anime adaptations from other source material that I've seen so far? - No\r\nWas it horrible enough to bring me to the edge of dropping the series? - Hell no\r\nYou see, the games themselves are complex in a way you wouldn't expect them to be when you look at a summary of what you basically do. To transfer this from a platform that allows you to do investigation yourself, findingclues, and uncovering the truth, onto the screen were you're a passive watcher... that's no easy task.\\n\\n\r\nTo fairly judge the Ace Attorney anime you need to understand that it's not about copy and pasting the events on TV but that the producers had to neccessarily scrap some of the points they deemed too much for casual watchers who didn't play the game; but at the same time keeping the ones who knew the franchise beforehand at bay.\\n\\n\r\nThe pacing for the first two cases started off quite nice, I really enjoyed the introduction though they should have made it more clear that \"casual watchers\" couldn't expect a serious anime about the law. Because the games just aren't, let's be honest. \\n\r\n(They'd probably arrest you if you'd bring a whip to the prosecution stand.)\\n\\n\r\nMidway through, from episode 4-10, the pacing got rushed and therefore the anime failed to really convince both sides, unfortunately. I know, it's hard when you've been given a limited number of episodes to fit into a season but if that's the case, maybe they should have just covered one of the games and not two of them.\\n\r\nEpisode 13 was a very sweet addition though and I applaud them for giving us kid Naruhodo, Yahari und Mitsurugi. \\n\\n\r\nThe art and animation was overall fine, sometimes... \"interesting\" (if you want to call it that). Still, those blemishes every now and then didn't take the enjoyment away. \\n\r\nFor me they were charmingly silly and made me laugh, rather than hating the series for not having a good style.\\n\\n\r\nBut that voice acting. Especially the last episode brought back the intense feeling I had when reaching the critical point of this particular case just because the seiyuu put their heart into it and really delivered some awesome performances.\\n\r\nThe choices, in general, felt right; Kaji Yūki knows how to pull off great stuff and he made me love dorky Naruhodo even more. You can't like a series if you don't feel the main character, and he gave Naruhodo that rookie attorney gone wild vibe.\\n\\n\\n\r\nOverall, this isn't a masterpiece but it's surely not an anime made for the trash bin. If you want to have the full crazy experience, you better play the games because they offer detaisl you'll never find in a season anime that is made with 24 episodes in mind.\\n\r\nNonetheless, I enjoyed my time with this series even though some of my favourite features were missing. \\n\\n",
            "date": "2016-09-24T10:58:00+00:00",
            "helpful_count": 15,
            "mal_id": 230032,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5330659.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bellipon",
                "username": "Bellipon"
            },
            "url": "https://myanimelist.net/reviews.php?id=230032"
        },
        {
            "content": "To quote Franziska Von Karma, this anime is \"A foolishly foolish idea born from the foolish mind of a foolhardy foolish fool\". Being a large fan of the games, I was highly enthused to hear of an anime adaptation coming, however upon its release I was only met with a painful and bland imitation of the original games, and even separately so, this anime is still rather one-note and drab. \r\nTo the Anime's credit, I was rather pleased to see a good chunk of the anime's script was directly adapted from the games, this atleast lead to a coherent and unique narrative; and the sounddesign was even better, being quite possibly being the best thing in the series, and feels like a very pleasing overhaul of the original game soundtrack. \\n\\n\r\nHowever this is where my compliments to the series end. Moving onto the art design, everything seems somewhat... wrong... A friend of mine says that A-1 has \"SAO-ified\" all of the character designs, which I'm unsure of how true that is, but everything looks stilted and off regardless. It would probably also be prudent to mention Phoenix's stilted running animation in the intro for a majority of the episodes before it was fixed in the latter half. \\n\\n\r\nOn top of this, the delivery and general scene direction is probably the worst thing this anime has to offer, and moved this anime from \"Boring\" to \"Awful\" in my eyes, as everything is done without heart or feeling. This is a hard point to describe without spoilers but I''ll try my upmost; in the original games where there were scenes of high-tension and desperate action, with races against time and scurrying to find the right answer, there were instead.. not... Characters that were supposed to look and sound devastated at something, instead sounded just slightly annoyed, moreso like the local takeout got their order wrong, and not the levels of upset that were supposed to be shown. One scene in particular where a character was supposed to rush in just in time, with the loud and epic soundtrack making the viewer pumped, was instead replaced by a fairly quiet scene, and the character just walking in, without so-much a hint of tension. \\n\\n\r\nFurthermore, I dislike how character relationships are handled. Characters whose relationships were supposed to feel slightly off and people were maybe untrustworthy, were over-clarified so there was no longer the tension of \"Should we trust them?\" or \"Is this person trying to deceive us?\"\\n\\n\r\nThis anime disappointed me. In my original list of things that upset me, I was also displeased that they had only adapted 2 of the original trilogy of games, however with the announcement of the second season of the anime just a few days before the writing of this review, I am hopeful that A-1 will infact have fixed the blatant errors in the anime and not ruin mine, and many others, favourite game in the franchise.",
            "date": "2018-03-17T00:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 274051,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5742162.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LovinglyGaslight",
                "username": "LovinglyGaslight"
            },
            "url": "https://myanimelist.net/reviews.php?id=274051"
        },
        {
            "content": "Game design and animated series are two very completely different things. It may seem like a really absurd statement, but since Ace Attorney is an adaptation of a game, you need a good understanding of its game design, as to understand what would work on screen, since video games are executed in ways fitting to their gameplay. Sometimes, to make a game more engaging, you have to remove some realistic elements. Knowing this, I have decided to play the game myself, to understand why Ace Attorney is presented the way it is, some time during the time I was watching the anime. So I'd liketo explain how the hook, the trials, work in the game, and why on screen the trials are really ridiculous.\\n\\n\r\nYou see, in the game, you are handling the trials. What you say, what arguments you refute and how you refute them. The more you refute the arguments of the opposing party, the more flustered they become and eventually, they burst out and that is used as a sign that you are winning. Their reactions are over the top but that is done with the purpose of showing you that you are clearly on the right track. In the games, you are also tasked with gathering evidence, in order for you learn more about the case and piece everything together as to have an idea of what to do in court and have an idea of what the case will be, but also to have more involvement in the investigation process, rather than await evidence and use what the cops find to your advantage, like a normal lawyer would. You will also discuss with the witnesses about the case and learn more about the story that way. The game will make you handle cases that you personally figure out with the evidence you have gathered, by paying attention to the information that mismatches your evidence. In this game, you figure it out. As a result of such the game needs a balancing scale, where it teaches you the basics.\\n\\n\r\nYou see, both Ace Attorney's start with a fairly ridiculous trial, where you know for certain who the culprit is, because the game states it from the very start. Your defendant is also a childhood friend which is explained as getting fairly often into trouble that usualy isn't caused by him. Now as an introduction to the game, it isn't a particularly stellar introduction, considering you're gonna defend someone to whom you have social ties with,  (that has a high frequency by the way for I assume dramatic effect) but it's a better than an UI prompt that says \"This is your goal in the game. Go from x to y. That is the defendant. Your friend. That is the actual culprit. The culprit.\" The game actually gives you context and lets you learn by going along the way, in a manner that I'd say is competent.\\n\\n\r\nIn a series, however, you don't want to start off easy, but rather to impress the viewer since first glance. So since the same trial is presented here in the same manner, you will leave with a pisspoor first impression. You already know the culprit, the defendant has constant outbursts since his dialogue outside the court was mixed in, and the first episode is a gibberish mess. You have a culprit you already know, a defendant that makes no sense as to why he's acting in a manner that is incriminating, or as to why he wasn't instructed at least slightly to not have any sort of outbursts such as: flailing your arms wildly, screaming and hitting your head against a solid surface repeatedly. As I watched this, I immediately thought this is very stupid and since I've seen the game, I am sure that whoever adapted this series doesn't understand the purpose of that trial. In the game, the trial is the starting point that familiarizes you with the game and its mechanics. You won't have too many complaints about how the trial emerges because YOU'RE AN ACTIVE PART OF IT, and these things help you. In the game you have the choice to tell the defendant during the trial to asbtain from saying things and making them say the truth, and so on and so forth. You have control over him. His stupidity isn't an important factor. And the fact you already know the truth helps you plan out the case. But here, it makes everything seem really dull and ridiculous\\n\\n\r\nBut perhaps this means that they're just trying to stay faithful to the adaptation and they're not exactly incompetent in this adaptation. In that case, let me move over to the next trial. In this trial there is an autopsy report. The situation is as follows. You present a discrepancy in a testimony  that says that a victim that has died immediately after a sudden blow to the head, had enough time to write the name of their killer after the attack, at a time they were most certainly dead. However, turns out that another autopsy report was released the next day, that says that the victim didn't die immediately after the blow. This is the line delivery in the game \"A second autopsy was performed yesterday, at my request, that says: Death was almost immediate due to a blow from a blunt object. The victim might've lived for several minutes afterwards.\" Eloquent, to the point and most important, not ridiculous. This is the line delivery in the anime. \"Yesterday, another autopsy was performed, that changed the report from died instantly... to died PRETTY MUCH instantly.\"  That's the wording. Pretty much instantly. So I reacted by walking around in the room a bunch with my hand behind my head, thinking \"This is so bad. It's terrible. I love this. This is incredible.\" \\n\\n\r\nI expected at least some minimal level of professionalism and well defined thinking and reasoning, even if with any sort of logic gaps, but that, caught me completely offguard. I never expected quite what I got in Ace Attorney. I mean, you have cases where attorneys don't even talk to their defendants, like the first one. You have cases where the judge is bossed around by a guy and told to finish the trial, in front of everyone else, by the prosecutor. You have cases where the defendant, judge, defense attorney, and the witnesses, get repeatedly whipped. There's no professionalism in the trials.\\n\\n\r\nOkay then, perhaps it is because the series is quite lighthearted. Maybe it is not because the crimes themselves and the mystery aren't orchestrated well. Well, how does this sound? How about we frame the defense attorney that was defending the victim, as the murderer? Because that's the most logical way to go about things. Oh, okay, that sounds believable, right? How about keeping a bullet inside your shoulder after being shot for 15 years inside your body, a bullet that links you to an infamous incident, while also, somehow, avoiding lead poisoning and being able to function as healthy as a spring for said 15 years? Doesn't sound that good, does it? I think should be convincing enough, but lets ruin all credibility. How about shapeshifting your body in a trial, from a 8 year old little girl to a 27 year old woman with huge tits sticking out of her dress? Why do they shapeshift you ask? Oh, because of spirit summoning. They summon a spirit inside their body. Yes, this is an anime about handling trials in the courtroom. Yes, this is a recurring thing. Yes, it also is a recurring gag that nobody really questions this.\\n\\n\r\nThese things are factors from the games too, but I have not crossreferenced everything I said to see if everything is the same in the game and the anime. And yes, these criticisms are fair for the game as well, if they are indeed there. But one thing that is clearly there is the spirit summoning, and in both cases, they take away from the trial, as Phoenix Wright couldn't have had solved the case, without outside intervention from an element that realistically wouldn't be able to be a factor. In the game itself, the literal second case, you can't solve this, without the intervention of the spirit. In other words, you, the player, can't solve your first case after the tutorial, on your own. But that is a flaw of the game, that I've decided to state to say that the source material is far from perfect itself.\\n\\n\r\nWell, the next thing that you might think that, this was intended strictly for the fans of the game. Even then, I'd say this is a pisspoor attempt that deserved no recognition, if you are to compare the animation quality, not to other anime, but rather to the game itself. The spritework animation in the game of Ace Attorney is absolutely gorgeous. It is incredible to see how much detail they have managed to add in spriteart, which is done by drawing everything pixel by pixel. Am I supposed to believe this is meant to be an omage to the fans of the game, when they couldn't even do proper shading on the characters in the anime's animation? Am I supposed to believe that when there's just the bare minimum of details in the animation, while the simple spritework of the game did so much work to convey as much detail as possible, am I supposed to think this is meant to be made for the fans? No, this is just someone exploiting the intelectual property for money. If this was meant for the fans, they would've gotten far better animation, as I can't see how this anime could enrich the experience of the games, when they just have rushed in trials with pisspoor animations\\n\\n\r\nWhat is left to say about Ace Attorney? It is a mess. It is terrible. But it was really fun to watch. It is flawed in so many ways and on so many levels, that I've enjoyed it a lot. Seeing the constant flow of flaws that it threw my way truly entertained me, because I really enjoy when a series is so flawed, that I have to praise them for it. This series did nothing right, except for a single episode, where they've shown the childhood of Edgeworth, Phoenix Wright and Larry Butz, strictly because it is unexpected and has nothing to do with the cases. I found it endearing because there wasn't really any of the elements that made me rant what I've ranted in the review. But the trials, have so many obstacles to be properly consumed, so many discrepancies, be it logic gaps, be it unprofessional behavior that leads nowhere, be it blownout overreactions, be it supernatural elements that shouldn't be a factor in court, be it etc, that I couldn't just manage not to enjoy the obstacles themselves. The reason I have not stated as many of the flaws I've seen in this series because the flaws of the series were quite honestly the sole enjoyment factor I've got out of it. I think anyone that watches stuff and can enjoy a series for how bad they can be, would have a great time watching Ace Attorney. It is truly bad. Hence it is truly great. It is a great mess that should be watched solely for that reason. Because quite frankly, that is the only way not to be dissapointed with what you get.",
            "date": "2017-01-27T10:57:00+00:00",
            "helpful_count": 5,
            "mal_id": 239242,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047626.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ItIsIDio",
                "username": "ItIsIDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=239242"
        },
        {
            "content": "OBJECTION! I received new evidence regarding this anime. The prosecution has been approached with the following review.\r\nStory:\r\nThese court cases are taken from the Ace Attorney games, but as I never played them, I have no idea how much they left out or added. Whatever, the laws of the court in this anime are pretty weird. Apparently every suspect is guilty untill proven innocent, and even when proven innocent, as long as you can't present the actual culprit, the verdict is still guilty. This is of course absolutely ridiculous and makes it nearly impossible to take this anime seriously. The rest is standard \"main character showedme the true meaning of (subject of anime)\" stuff.\\n\r\n3/10\\n\\n\r\nArt:\\n\r\nPhoenix Wrigth doesn't look good. The characters often look very disfigured and there isn't much love to details either. They tried to mimic the movements from the game for the anime, which just looks awkward. The backgrounds are also rather static, which isn't much of a problem, but more visible in a subpar animated show like this.\\n\r\n2/10\\n\\n\r\nSound:\\n\r\nAll the openings and endings are okay, though far from being great. I have no idea how one of them made it into the top 10 of the charts. Voice acting is okay too, there isn't much one can do with a one-dimensional character, so I can't critizise them for their work.\\n\r\n5/10\\n\\n\r\nCharacters:\\n\r\nYou know why Detective Conan is so successful? Because not only does it have interesting cases, but also interesting characters, with motives, emotions and personalities. In Phoenix Wright there are only good and bad people. The motives often seem very disproportionate, which would not be all that bad if we had something to back up their actions. Even the main characters are rather lame. Naruhodo is a goody little two-shoes, Maya only cares about food and samurai and the prosecutors just want to win by all means.\\n\r\n2/10\\n\\n\r\nEnjoyment:\\n\r\nMost cases were pretty boring and rather obvious to figure out who did it. Maybe this thing works as a game (and that seems to be the case, as many people love them), but as an anime, that is just not enough. The only case which I would consider good was the final one. Phoenix Wright is not insultingly bad (like Mayoiga for example), but there is nothing this show has to offer either.\\n\r\n3/10\\n\\n\r\nOverall:\\n\r\n3.0/10",
            "date": "2016-09-25T08:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 230150,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=230150"
        },
        {
            "content": "\"It's only natural for living creatures to fight to protect their own lives. But what makes us human is that we fight for others.But who do you fight for? How hard must you fight...? That's the true measure of what human life is worth.\"- Phoenix Wright 2004\r\n  I am a big fan of Capcom's Ace Attorney series. With 6 mainline games, multiple spinoffs ,one crossover, an appearance in Ultimate Marvel vs Capcom 3 and Project X Zone, it is safe to say this series is popular. The Ace Attorney franchise also has various manga, 2 Capcom licensed doujin collections, and now an anime. Butthen the anime got trashed on and condemned as a bad adaptation. Now I Corey Censoredlastname will defend this animated adaptation of one of my favorite games.\\n\\n\r\nSTORY:\\n\r\n   The story of the Ace Attorney franchise is really simple at face value, but the cases  go into great detail and have lots of amazing plot twists. Due to spoiler reasons, I will refrain from describing cases. The main premise is that Phoenix Wright is a new attorney at law, just having passed his bar exam. He is taken under the wing of defense attorney Mia Fey and she taught Phoenix to think outside the box, not take things at face value, and always believe in your client. The series goes into cross examination of witnesses to point out contradictory statements in their testimonies, Crime scene investigation, hilarious characters, spirit channelling, and defending the innocent. The Ace Attorney series is overall lighthearted, but at times it can get really dark. This anime adapted games 1 and 2.(Oh boy just wait for Farewell My Turnabout the final case in Justice for All and where the anime leaves off, it is my favorite case) 9/10 where the hell are the psyche locks in the anime.\\n\\n\r\nArt:\\n\r\n The art is what really made this anime adaptation not as good as it should be. Characters go off model frequently, some characters dont look right (Larry is a prime suspect), and the CGI is absolute TRESH. The backgrounds do look nice, and the text from the games are translated well, and some of the dramatic effects are amazing. I just wish the art was as good as the sprites, or the cutscenes in Dual Destinies and Spirit of Justice which are animated by the same studio how did they screw up this badly wtf.\\n\r\n6/10 its passable, and some things are great.\\n\\n\r\nSound:\\n\r\nThe anime has some amazing sound design. The voice actors are amazing. Kaji Yuki as Phoenix was amazing. Better than those bit crushed GBA samples by a longshot. I am a big fan of his work so hearing him as Phoenix made me overjoyed. Edgeworth has a really good actor also, and Franziska has such a smug actress. The music is amazing too. As you know, the Ace Attorney franchise is well known for it's amazing music. The anime takes the approach to music similar to Dual Destinies and Spirit of Justice, as all the music is orchestrated instead of using the GBA or DS ost and calling it a day. Holy shit the 2001 Objection theme never sounded more epic. And the Pursuit Cornered 2001 theme is amazing. Still can't beat the DS version of that song. However it seems that Justice For All's OST is mostly missing. That kinda sucks as I liked that game's OST a bit, and I've heard the orchestral cd arrangements and it sounds amazing, and would sound amazing on TV. So the 2001 themes carry over to the Justice for All adaptation. So no Moderato 2002, or Pursuit Caught. I'll give it an 8 due to the missing music.\\n\\n\r\nCharacters:\\n\r\nThe Characters are amazing listed below are main characters that do not spoil anything.\\n\\n\r\nPhoenix Wright: Newbie defense attorney who believes in his clients, and is highly intelligent, if a bit silly at times. He gets nervous, and is a friendly man. OBJECTION!!!!!\\n\\n\r\nMia Fey: Phoenix's mentor. That's really all I can say without spoilers\\n\\n\r\nLarry Butz: Phoenix's best friend from gradeschool. Larry is a goofy and friendly character known to overreact, and has a bad track record of getting dumped. He is unlucky and always ends up in bad situations. If something smells, it's usually the Butz.\\n\\n\r\nMaya Fey: Phoenix's assistant who is a spirit medium in training. She is a comic relief character and is a very lovable person. She also has a bad track record being involved in many murder cases over the years. She loves hamburgers, ramen, and the Steel Samurai. She also seems to have a bit of a crush on \"Nick\".\\n\\n\r\nMiles Edgeworth: Prosecutor who does almost anything to get a guilty verdict as he hates criminals. However he doesn't resort to any illegal tactics. He is also a really nice guy he just acts like an emo kid on their period. That autopsy report is outdated your honor.\\n\\n\r\nFranziska Von Karma: Tsundere prosecutor who is a really cool character. \\n\\n\r\nDick Gumshoe, lovable detective who is a bit of a dope. He doesn't make much due to always getting paycuts. He looks up to Edgeworth a lot.\\n\\n\\n\r\nI overall enjoy the anime adaptation. It was a well adapted version of the first two Ace Attorney games for the given episode count. I also like the fanservice of there even being a Phoenix Wright anime. Also here is a note, The bonus 5th case for the DS version of the first game, Case 5:Rise from the Ashes is missing. However I didn't like that case very much as it was really long and boring, but I did like Damon Gant so I am indifferent to it's exclusion. However the first case from Justice for All, \"The Lost Turnabout\" is missing, and this might pose a problem for the upcoming second season. I might not have liked that case much, but it introduced Maggey Byrd, a character who later reappears in the 3rd game as a waitress in Jean Armstrong's café. Also Richard Wellington had a hilarious breakdown. My enjoyment is an 8/10 but the critical score is a 7/10. It is not as bad as everyone says.\\n\\n\r\nThe games are amazing though and way better so you should definitely play those. They are 10/10 material no joke.",
            "date": "2018-03-30T19:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 275815,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6698691.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LSSJ_Gaming",
                "username": "LSSJ_Gaming"
            },
            "url": "https://myanimelist.net/reviews.php?id=275815"
        },
        {
            "content": "A lot of these low reviews come from people who haven't played the games, but I've played them—all of them—and this is the definition of butchering a series. I'm surprised the fandom was as forgiving of this adaptation.\r\nNearly all of the problems from this stem from the difficulties of turning games that take more than 30 hours of pure gameplay to finish into a single season of a TV show. What made Ace Attorney memorable were the characters and the interactivity. Converting it to anime automatically loses the interactivity, so you lose the suspense or the feeling of being connected to the action. Then becauseit's rushed, plot holes are created and you lose a ton of characterization. What results is a rather boring show with 1-dimensional characters. Not to mention the animation is just bad. All around this was not a well-done adaptation.",
            "date": "2018-02-07T23:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 271011,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/socialworkkid96",
                "username": "socialworkkid96"
            },
            "url": "https://myanimelist.net/reviews.php?id=271011"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nFirst of all, this anime is an insult to courts of law and judges. I know it doesn't reflect reality but using murder cases in this anime where they just seem to compete in who can make better statements is bad taste. Noone seems to care who is innocent (Naruhodo does but he just believes they are innocent and doesn't ask for any explanations).\r\nOST in this anime is good. Nothing extraordinary but didn't make me skip the OP or ED. Animation is poor. Too much still shots and visual effect is court are flashy but not very well done.\r\nUsually anime characters inpower positions have a glaring fault and due to that it falls to MC to do things but in this case the judge is just dumb. He has no good qualities, how can someone who is timid and dumb become a judge, he could be one of them but not both. A procecutor who had 100% win rate and was suspected off tampering for evidence was not checked. All I want is some common sense and logic in this anime but I found none.\\n\\n\r\nThe court system is so that people are convicted on circumstantial evidence unless the defence can show otherwise. And they aren't given much chance to do so. The jails must be full of innocent people because the detectives are quite bad too.\\n\\n\r\nOverall, I can never like a court drame where you can't take anything seriously.",
            "date": "2016-06-27T05:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 222148,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Bozzzz",
                "username": "Bozzzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=222148"
        },
        {
            "content": "Let me start off by saying that I have not played Ace Attorney. I know some things about it from friends that have played the game, but characterization, plot, story elements and the like are foreign to me.\r\nStory - Strong 6 - Weak 7\r\nObviously there are only a few cases a season, and this show would have benefited from the long running format of TV anime. But it was decided to make this a seasonal show and so be it. It think the show does its best to speed through the elements it has and while they aren't always done well, I'd say they're entertaining.Although I can see why people who had played the game might be frustrated at the cut down abridged versions of their favorite characters.\\n\\n\r\nThe first episode is... It's bad. It's rushed, obviously to set the formula for the series and establish characters and set pieces before launching into it's first big case. If you already knew the Ace Attorney games, I'd say you could even skip the first episode entirely which isn't a good thing.\\n\\n\r\nThe rest of the cases are pretty decent though. While I don't think it's possible to figure it out the solution most of the time, I also don't think the show is working under the illusion that it wants you to? It would have made the show better, but i don't think it detracts too much.\\n\\n\r\nArt - strong 6\\n\r\nLook. There's like maybe three locations in an episode and the background for the courtroom are used repeatedly. But the art looks fine. There isn't any problems with perspective and key frames are all good. There are even some nice dramatic rotating shots used far more appropriately than in other shows (it should be noted these are all done in the courtroom, where everything at least has a 3D model to reference off)\\n\\n\r\nNothing particularly of note.\\n\\n\r\nsound - 4\\n\r\nIt's not bad sound. The sound effects are just all ripped directly from the game. There's very little inspiration here. \\n\\n\r\ncharacter - 6\\n\r\nThe characters here are not the characters from the games. They are far simpler and straight forward because the show doesn't have enough time to elaborate as much as it would like. They aren't exactly begging your investment. But they serve to get the story across.\\n\\n\r\nEnjoyment - 9\\n\r\nI love it. It's fun, it's stupid. It has immense trouble trying to summarize the excuses for it's plot inconsistencies. I often have fun with not quite average anime. I do not think someone who loves the games will find the enjoyment that is probably tainting my review in their watch, because of the sacrifices made.\\n\\n\r\nOverall - 6\\n\r\nSo in summary\\n\r\n - Story is cut down from source material and this weakens the plot slightly\\n\r\n - Art is of average quality for this studio and did not impact the viewing experience negatively\\n\r\n   - It should be noted the rotating shots are of good quality and appropriately used.\\n\r\n - Sound is fine, OPs are of decent quality. I didn't watch the EDs...\\n\r\n - Characters are a little flat, thiss does somewhat detract from the experience\\n\r\n - I enjoy this far too much\\n\\n\r\nIt could have been better,  could have been worse. Just a little better then average due to it's animation and presentation.",
            "date": "2019-04-10T04:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 305953,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6644421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Apple_Twinkle",
                "username": "Apple_Twinkle"
            },
            "url": "https://myanimelist.net/reviews.php?id=305953"
        },
        {
            "content": "I didn't expect much out of this anime to begin with. Everyone wanted it, but from the very begginig I knew, that adapting the Pheonix Wright games was not the smartest idea. For the most part the story was pretty predictable, but I had hoped, that at least it would be a decent adaptation. I was wrong.\r\nNOTE: I boosted scores by about a half or so, because of the second to last arc, that actually was really good in every aspect. Most of the stuff I'll write below does not apply to that arc.\r\nYou might like this anime if:\r\n-You are a fan of the PheonixWright games\\n\\n\r\nYou might dislike this anime if:\\n\r\n-You never heard about Pheonix Wright. This anime does not have much to offer to you.\\n\\n\r\nStory: 5\\n\r\nThis is a mystery anime right? So why, for more than half of the cases, culprits are revealed at the beggining or in the middle of the investigation? It makes no sense. But hey, even if that wasn't the case, you can only guess who is the culprit, because most of the time, the evidence is provided way too late into the trial and at that point it's already obvious who did it. Though the cases can be interesting, the decisions that have been made concerning the story take away most of the fun of mystery anime, and leave you with a semi-decent drama. Also, let me mention the humour, that is at times decent and even better at a few select moments, but at others it feels incredibly misplaced. For example, a few seconds after an information about a murder occured, someone throws a joke. How can you laugh after someone told you that? I understand that it never is too serious to begin with, but when some events happen that are supposed to make you nervous, they don't, because you feel like it wasn't meant to do that. The games were never good in the story aspect, not counting a few cases, but this is a disaster. Overall, a first part of the long list of disappointments. The failed battle of silliness and seriousness does not help either.\\n\\n\r\nArt and Animation: 2\\n\r\nThis is an absolute disgrace when it comes to today's standards. Except for maybe Maya, everyone looks so wrong, and their animations are so weird. Even the main hero changes his face almost every scene. Honestly at some points it looks like some old animation from Newgrounds or something. It even made me burst out laughing because of how bad it was. It perfectly represents how little care was put into this. In the very last episode, the judge moves his mouth, but no voice can be heard, and the only sound is his hammer beating againts the palm of his hand. I usually leave the next part for the OST, so I though I'll mention it here. Overall, it's abysmal by today's standards. One or two scenes can't change that.\\n\\n\r\nSound: 8\\n\r\nIt is.... good actually. The soundtrack from the game has been implemented here and the openings are catchy (the first opening ends in a weird, abrupt way though). There are some mistakes, the music at times doesn't fit the scenes and at some others it is dead quiet. In the last episode (again) there was clearly supposed to be a conversation, but instead we get a silent nod from a character. That lasts about 10-15 seconds. In complete silence. Some music would help at least, you know? Overall, pretty good, fails to fit sometimes.\\n\\n\r\nCharacters: 4\\n\r\nThe characters were probably the strongest point of the games. Here they are bland and boring, maybe except Maya, but even she can often fall under that category. I did not care about anyone, they can all go disappear for all I care. No development, no interesting moments, nothing. They feel like butchered versions of themselves. I don't have anything else to add.\\n\\n\r\nEnjoyment: 3\\n\r\nThe only redeeming factor was the circus arc that I mentioned at the beggining. If not for that, this would easily be a one. It's boring, painful to look at and overall just a huge disappointment. I did play the games and I was a little bit excited, but after the second arc, I ended up mindlessly grinding it to the finish line (except for the circus arc, it was a huge surprise to me really).\\n\\n\r\nOverall: 4\\n\r\nIt has nothing that I would consider worth recommending. I will never look back at it again. This is only watchable, if you played through the games and you want to see them turned into an anime. Everyone else might as well watch a field of flowers or something, I don't know. I could probably watch another season, it would cover my favourite game after all, but this one was a pain to watch. Glad it's over.\\n\\n\r\nOf course, this is purely my opinion, but I can't recommend you to develop your own. Watch at your own risk.",
            "date": "2016-09-26T13:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 230297,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=230297"
        },
        {
            "content": "Ah, Ace Attorney. The wonderfully wacky yet also emotionally gripping visual novel/puzzle game series from Capcom. Full of great character designs, iconic music, over the top situations and dramatic stakes, it should make for a great anime adaptation, right?\r\nWell, no, not \"great\", at least not when the god-kings of shovelware anime, A-1 Studios, is the guys behind production.\r\nI won't beat around the bush: this anime is not -terrible-, but its got some serious flaws both in adaptation and as a stand alone product.\r\nLet's get to the biggest blemish to see: the art and animation. It is f u c k i n g terrible mostof the time. Characters are routinely off model, animation is very limited and choppy as all hell, props are messy and also off model, backgrounds are garrishly obvious digital compositions, which are ALSO off model sometimes, SOMEHOW, despite mostly being geometric shapes (when they aren't directly copied from the games backgrounds). Its bad, people. Its really bad.\\n\\n\r\nThe next biggest flaw is the pacing and adaptation of the cases, though this is a mixed bag at points. The anime streamlines the ridiculous back and forth shenanigans of constantly presenting evidence, being objected, being overruled, and having to present more evidence for the sake of a smoother narrative, and that's honestly fine for the most part. It also cuts out a lot of the backtracking for investigating for more evidence in favor of more character driven scenes, which is an honest strength of the series it can boast.\\n\\n\r\nHowever, in exchange for this the trial segments seem to move at an almost breakneck pace, throwing off the timing that a lot of moments the game had for dramatic or comedic effect. Events are rearranged sloppily, and the overall presentation is a bit of a hot mess to watch.\\n\\n\r\nIn spite of all this, the anime does retain a lot of the strengths of Ace Attorney's video game origins: almost every character is likeable and enjoyable to watch, especially frontman Phoenix Wright, his rivals Miles Edgeworth and Franzsika von Karma, his assistant Maya Fey and others. The music is directly taken from the games as well and generally sounds very nice, loaning a strong air of authenticity to the final product.\\n\\n\r\nI suppose my bottom line is that is you LIKE Ace Attorney the games, then you will probably enjoy watching the anime, provided the minor narrative changes don't bother you so much. If you didn't like the games, this anime will not do you any favors, and if you've never played the games but are curious about their stories.... I would suggest just playing the games instead, but you probably would enjoy watching this if your standards aren't too lofty. All in all, the Ace Attorney anime is a serviceable if hideously ugly and uneven watch that will probably get a few laughs out of you at least, but won't be moving any mountains.\\n\\n\r\nAlso, watch the dub, because Funimation is fully aware of the games' weirdness to localize obviously Japanese set places in the games into American counter parts and it really plays up that goofy angle.",
            "date": "2018-10-07T13:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 291180,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384577.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CappnRob",
                "username": "CappnRob"
            },
            "url": "https://myanimelist.net/reviews.php?id=291180"
        },
        {
            "content": "This is my first review and I'm gonna try to make it the best I can. Of course, this is spoiler free.\r\nStory 3/10:\r\nSince I've ever heard about this anime I thought I'd be awesome, I don't consider myself as a diehard fan of Ace Attorney, but man, I was very dissapointed when this anime got to the case 3. It was very awful, especially when it reached case 4. I've watched 12 episodes of this anime. Enough episodes to say that the story is a total mess, it doesn't make sense sometimes and they skip very important parts of the story. Sometimes you couldn't realize(If you haven't played the games) why something was the way it was, like, when they don't even explain anything about the facts, the things that happened but Phoenix does realizes it and suddenly he objects and like I said before, if you wouldn't have played the game then you wouldn't even realize why something it's the way it is. The story goes super fast and that makes it difficult to understand, the explanation of the facts and things that occur during a trial is very poor and you can't realize what's happening. \\n\\n\r\nArt 7/10:\\n\\n\r\nIt's good, though it has its flaws. There were episodes wherein it wasn't that obvious that the face of some character was pretty lame, and not well illustrated. However, I think that (and this isn't spoiler) in the episode 11, the art was pretty bad and it was the most obvious episode to have dreadful faces and a bad illustration.\\n\\n\r\nSound 6/10:\\n\\n\r\nIt lacks of epicness. In the game, almost every track was epic and made you feel like you really were an attorney investigating, or having a trial and suddenly having to use logic to think of a solution to a dilemma, or being in a trial and cornering a witness or cross-examinating a testimony. The anime version of Cornered was the track I liked the most out of all the other ones. \\n\\n\r\nCharacter 3/10:\\n\\n\r\nNot enough development. I know it is an adaptation of the game but come on the creators could've done this one right.\\n\\n\r\nEnjoyment 4/10:\\n\\n\r\nIt'll sound weird but, I enjoyed one or two episodes of this anime but only due to the fanservice and the references to the game, it was well made. If you are a fan of the franchise, then you could watch until the end of case 3. I don't recommend watching beyond that, because seriously, one of the best cases in the game got ruined because of this bad adaptation.\\n\\n\r\nOverall 5/10: \\n\\n\r\nI gave it a 2 before this review. But now I'll be more just and I will give it a 5 because although it disappointed me a lot, it did good some things and that deserves at least a 5.\\n\\n\\n\r\nThis was my first review. Sorry if I had grammar mistakes in the review, this isn't my native language. Also, if you find this helpful, mark it helpful as well.\\n\\n",
            "date": "2016-07-01T22:13:00+00:00",
            "helpful_count": 5,
            "mal_id": 222697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493107.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LordAgustin08",
                "username": "LordAgustin08"
            },
            "url": "https://myanimelist.net/reviews.php?id=222697"
        },
        {
            "content": "I would've given this a 4, but a 3 because I am an avid Ace Attorney fan for six to seven years, especially with the fact that this anime did not really do the main games any justice. Even, the walkthroughs on YouTube are better to watch. The anime is only decent if you really want to kill time, but it does not cut it for me.\r\nThe games do have several puns and memes, so this anime was a letdown for me because the execution was poor. If anything, I only like the opening because of my Feenie x Edgeypoo fangirl heart.",
            "date": "2016-11-27T17:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 234508,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5546135.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/fujitsukishima",
                "username": "fujitsukishima"
            },
            "url": "https://myanimelist.net/reviews.php?id=234508"
        },
        {
            "content": "I decided to do a quick review of an anime I dropped, please note I haven't seen all of the episodes or played the games, but I'm sure I have a basic understanding. \r\nStory (4) - An attorney getting clues and defending someone? Sounds, great honestly. I would give it an 8 but, the execution is god awful. It's nothing more then a being mess with no attempts for jokes or character development, it's more of a thing that happened then the characters just move on. They forget about that the next episode.\r\nArt (2) - I love is art style of a video game, butthat's the only good thing about it. The art can be awkward and still at times that I wish I could look away but I can't then I'm stuck with a headache. Sometimes the animation looks odd as well, like in the opening.\\n\\n\r\nSound (8) - Easily the best part about this show, the voice actors and actresses do an amazing job on there parts. Listening to the opening and closing of each episode is the best part of each episode. They don't sound grading to the ears! It sounds like effort has been put into them!\\n\\n\r\nCharacter (1) - Uh... who are these people? The characters in this show are so, boring. It makes each episode go for longer and longer. Mr. Attorney Can't Remember His Real Name Man is the blandest and the most forgettable of them all, at least the other characters seem cool and heck maybe even OKAY but since THIS guy is our main character we have to follow him around and hope he does something another then some random stuff that's ends up working in the end.\\n\\n\r\nEnjoyment (3)\\n\\n\r\nOverall (2) - If you're drink and bored, THEN watch this anime but if you aren't both of those things kindly run away from this monsterpiece of a show.",
            "date": "2016-11-23T15:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 234259,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5733774.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ShelbyWAO",
                "username": "ShelbyWAO"
            },
            "url": "https://myanimelist.net/reviews.php?id=234259"
        },
        {
            "content": "STORY (7): This anime has good storylines. It takes 3-4 episodes to cover each case. In some cases, it feels like it can drag on but they touch on the details. It can also be pretty intense in court (between the Prosecutor and Defense) -- especially when both sides have to yell object and prove their case. During the examination of each witness, each of them brings something different. In some cases, they would leave us second guessing ourselves, but it can also be predictable. \r\nCHARACTERS (7): They are numerous characters that are introduced in this series & they have so much personalities.\r\n- Phoenix Wright(Ryuichi): New Defense Attorney who works for Chihiro. He is very kind, helpful and understanding. P.W. is passionate for what he does & has great deductive skills.\\n\r\n- Mia Fey (Chihiro): Defense Attorney, beautiful & intelligent. \\n\r\n- Miles Edgeworth (Reiji): Crown Prosecutor and an old friend of Ryuichi. \\n\\n\r\nOVERALL (7): One of my favourite animes to watch. I can see that they use some of the video game's content onto the series. I pray that they will make another season! (& possibly have a crossover with Professor Layton in the anime).",
            "date": "2016-09-24T15:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 230072,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=230072"
        },
        {
            "content": "I cannot believe that now this is over. Before I start this review I will say that I have personally not played the Ace Attorney series but I have seen playthroughs of the games. \r\nStory: If you have played the Ace Attorney games than this an adaptation of the first two games.  I feel that this was a good adaptation of the game but their was some stuff that I totally feel I agree with the community with. The Changes that were made to Ace Attorney that came throughout the series made this interesting because it changed the anime up a lot. The changeswere small but it made me like this a lot.  The story I give a 9. \\n\\n\r\nArt: The animation of Ace Attorney was really great since you have the Objections that Wrights said and it was handled perfectly. The Art I give an 8. \\n\\n\r\nSound: I could picture a dub for this anime being made since we got a picture of it in Dual Destinies. The Sub was not bad it just when you are used to hearing English voices from the games it an adjustment. Sound I give a 7. \\n\\n\r\nCharacters: Every witness that is interrogated in the court room is what makes Ace Attorney. Everyone has a unique personality that makes it interesting. The characters I give a 10. \\n\\n\r\nEnjoyment and Overall: Overall I give this an 8, I cannot give this a perfect score because of flaws that are given in this adaptation. My enjoyment I give a 9 because I love this series and I feel I got the most out of this.",
            "date": "2016-09-24T09:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 230017,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4828029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuna67876",
                "username": "Yuna67876"
            },
            "url": "https://myanimelist.net/reviews.php?id=230017"
        },
        {
            "content": "Really good anime that does the games justice. (Did I really just make that joke?) The music was great, the characters were very entertaining, and the story was extremely engaging. Episode 13 in particular was really heartfelt and shed some light on the Phoenix/Ryuichi's backstory. Highly recommend to fans to the series, as well as newcomers who want to get into Ace Attorney. \r\nIt starts out like the first game, where we see a young woman get killed in her own apartment, and the murderer stating he'll pin it on Larry Butz, Phoenix/Ryuichi's best friend. As you may guess, Phoenix must prove Larry's innocence toavoid him from being sentenced to prison.\\n\\n\r\nThe anime is charming and comical, much like the games, and it really makes being a lawyer look cool as heck (keeping it kid-friendly, I like it).\\n\\n\r\nOverall, great anime with fun mysteries that will keep anyone entertained. 10/10.",
            "date": "2019-04-24T20:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 307089,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8009407.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ObjectionCeption",
                "username": "ObjectionCeption"
            },
            "url": "https://myanimelist.net/reviews.php?id=307089"
        },
        {
            "content": "(Note: Just for the heck of it, I’m gonna use the Japanese names for this review. Because why not?)\r\nAce Attorney (Known as Gyakuten Saiban in Japan) is probably one of the better known Visual Novel franchises in the west. Honestly, I’m not surprised. The cast is full of quirky and likable characters, the writing (For the most part) is witty yet clever, and the translation job is fantastic, sudden change of location of Japan to America aside. Yet, despite the fact that the original game came out back in 2001 for the Game Boy Advance, it has taken them until 2016 (Literally 15 years) toactually do an adaptation of it. And of course, they got… A-1 Pictures?\\n\\n\r\nErr… why? Wouldn’t it make more sense to get TMS Entertainment? Because if anyone knows how to do a good mystery Anime, it’s them. And it’s not as if A-1 has a good record with their Adaptations of videogames, or need I mention Persona 4 The Golden Animation? Still though, let’s see if this Anime is guilty of being a bad Adaptation, or Innocent:\\n\\n\r\nStory:\\n\\n\r\nThe show adapts the first two games (I presume they adapted both since it’d be a pretty short show if they only adapted one or the other). To be fair, for the most part it’s a fairly accurate adaptation. Not many divergences from the game are made, it does mostly stick with some of the details, and overall, it’s not bad in that regard.\\n\\n\r\nUnfortunately, its first issue becomes that the few changes that are made are really bad. They often screw up the pacing, are generally needless, ruin a joke, downplay the original impact of the scene, and are just not good. It’s kinda like the movie “Watchmen”, which was a very close adaptation of the original Graphic Novel… to the point that when a change was made, it stuck out like a sore thumb. They also remove stuff, most of which you can’t simply remove (Like, say, not mentioning Mitsurugi’s fear of Earthquakes). Also, for whatever reason they kept around Turnabout Big Top. You know; the worst case in the whole franchise? Yeah, I don’t know why they did it either.\\n\\n\r\nAlso, the pacing is not good. To be fair, cutting down some scenes here and there to lessen the repetition is a good thing, but the way it’s done makes the anime go at a breakneck pace, and it is quite annoying.\\n\\n\r\nAlso, I don’t think this show makes enough use of the fact that it’s an anime. The game is shown almost entirely from Naruhodou’s perspective, so this would’ve been the perfect chance to add stuff relating to the other characters and their perspectives. Maybe showing characters like Itonokogiri doing their own job, or maybe add some extra scenes to develop the side characters. Sadly, the best you’d get is a couple of flashbacks involving Mitsurugi and Mei, but that’s about it really. So overall, while I don’t think this is bad, I do think there’s too much lost potential.\\n\\n\r\nCharacters:\\n\\n\r\nThankfully they’re mostly unscratched. Really, this cast is nothing but a bunch of lovable dorks. There’s the sarcastic yet humble Naruhodou Ryuichi, the peppy and upbeat Ayasato Mayoi, the absurdly adorable yet innocent Ayasato Harumi, the absurdly incompetent yet lovable Itonokogiri Keisuke, the whip happy and uptight Karuma Mei and more than a few more.\\n\\n\r\nBut rather predictably, my favorite is and has always been Mitsurugi Reiji. Not only does he have one of the best character arcs in the whole franchise (And thankfully, more than a bit of it happened in these first two games), but the guy’s stoic behavior just lends itself perfectly to comedic situations, and he does avoid being a generic rival (Though admittedly, he is a bit of a male Tsundere).\\n\\n\r\nAnimation:\\n\\n\r\nThe show looks BAAAAAAAD. Jesus Christ, how the hell can you look worse than sprites from an early GBA game!? The animation in general is just stiff and lifeless, and there are multiple moments of off-model animation. What’s worse is that this show is not exactly adapting something that requires a lot of movement, yet they still somehow screwed it all up.\\n\\n\r\nOn a completely unrelated side-note, I have to thank Crunchyroll for actually giving fans the option of either having the Japanese or English names. I went for the Japanese ones as the disconnect between what the characters were saying and what’s shown on-screen, but I’m glad we were given the choice. Wish they’d done the same for Dragon Ball Super, but oh well.\\n\\n\r\nSound:\\n\\n\r\nBy contrast, the Soundtrack was surprisingly good, I noticed quite a few Remixes for songs from the game, and they’re all quite nice. As far as Openings and endings are concerned, the only one I cared about was the second Opening “Jinsei Wa Subarashi”, the rest were somewhat bland.\\n\\n\r\nVoice Acting:\\n\\n\r\nIt’s all over the place. For whatever reason, none of the actors from the game came back, which confuses me to say the least. But as I always say, so long as the replacements are good, I shouldn’t care.\\n\\n\r\nSadly, most of the replacements are just doing impersonations of their game voices, but worse. Kaji Yuuki is a great actor, but he was just awfully miscast here. He just sounds not only too young for Naruhodou, but also way too wimpy and whiny. Tamaki Masashi (Whom I have no experience with whatsoever) is okay, but he really just feels like a worse Takemoto Eiji. In fact, with the exception of Yuuki Aoi as Mayoi (Whom I’ll admit to preferring over Hanamura Satomi) and Nakamura Chie as Chihiro, everyone with a pre-established voice is just a worse (Though not necessarily bad) version of their previous Seiyuus: Yumiba Saori is a worse Sawashiro Miyuki, Iwasaki Masami is a worse Ishii Kouji, Otsuka Akio (Surprisingly) is a worse Yanada Kioyuki and so on. The ones without a voice beforehand are better, but still nothing special.\\n\\n\r\nOverall:\\n\\n\r\nLike with that Super Robot Wars anime I reviewed a long time ago, this anime is extremely middle of the road. I don’t hate it or anything, but I can’t bring myself to truly like it either. Still though, I am gonna give the second season a bit of a chance as I have heard it does make some improvements. But as it is, it’s a middle of the road anime adapting two very good games. And as for the Verdict everyone wants me to give… well, I guess it’s guilty… but it’ll only be sent to prison for a couple of months.\\n\\n\r\nFinal Score: 5/10",
            "date": "2019-01-13T13:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 298957,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 2,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=298957"
        }
    ],
    [
        {
            "content": "I could wrap up this review in one sentence: 'what did you do to poor Phoenix?!' Okay one more: 'this anime was terribad'!\r\nI guess it's not easy to do decent anime based on two games. Games that takes about 65 hours to beat them. But on the other side I loved Persona 4 anime, and to beat game you need over 100 hours.\r\nI will start with acceptable things (don't confuse them with good!). Animation was goo... decent. Sometimes I wanted to pluck my eyes off but well Maya looked nice. If we would change Franziska's lips I believe it would fix her weird looks too.And hmmm characters looked kinda like the ones in game. But all the time I had feeling that they are weird and creepy! Bodies looked awkward. Dunno maybe it is me.\\n\\n\r\nSo let's look at Voice Actors. They did decent job but I just didn't like Phoenix's voice. Same goes for more characters. But that is just my opinion as you know in game we could hear only few words 'objection' and 'hold it'. But that was the thing that made Phoenix Wright the game awesome. It fit in this game style and I really always was feeling like shouting with him while pointing my finger like idiot at my console.\\n\\n\r\nWhat else made the games so good? Soundtrack. Making you feel the mood. And we can hear poor versions of them in anime. And it is not even used properly! Yes they messed it up! While in game you felt fired up with 'cross-examination theme' in anime... eh I guess they used it somewhere? Music was building suspense but anime didn't provide it at all. Etcetera etcetera.\\n\\n\r\nAnd you know what? That was the 'not worst part of anime'. Really!\\n\r\nStory. They showed sketch of intriguing and sucking in stories. And in anime we couldn't feel it at all. Shortened into absolute minimum, skipping factors that made the twists work so well left us with pile of s... ah no swearing. Sorry but I really was pissed off when I watched this and saw what they did to plot. Where was the investigation that made us think 'what the hell really happened here'. Where were some barely visible clues? Skipped!\\n\r\nInstead of dialogue that built the plot we got exposition! To be honest it reminded me of reading the checklist. 1. Phoenix talks to cop, 2. Phoenix finds out something (skip it, we will show it in point 4 or 5). You get the idea.\\n\\n\r\nYou still don't believe it was terrible experience watching this anime? Okay so let's look at characters. We don't get any development! For example my least favorite one: Larry Butz. It is hard to say if he has any personality. At the beginning we see Phoenix save him in the court, we get a little, tiny piece of explanation that he is quite immature guy. While in game we got his goofy character clearly showed to us here even that didn't work.\\n\r\nAlso how usually we develop characters? Through story. And while story was bad you know what that mean. Next example: Miles Edgeworth. The DL-6 Case was his nightmare and we saved him, we 'killed' that nightmare. In anime it is barely mentioned! And we don't get how he hurt Phoenix when he ran away. Ah wait we got information about this in one of the last episodes! No build up for his come back, no nothing. And I could talk about this for hours writing way more but it's waste of time.\\n\\n\r\nAnd watching it was waste of time! Do not watch this until you are really bored or want to see something very very very bad!\\n\\n\r\nStory: 2/10 (not 1/10 because at least they showed all cases)\\n\r\nArt: 4/10\\n\r\nSound: 4/10\\n\r\nCharacter: 1/10\\n\r\nEnjoyment: 2/10\\n\r\nOverall: 2/10",
            "date": "2016-10-30T13:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 232913,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307192.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Ryuuguu_Azaka",
                "username": "Ryuuguu_Azaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=232913"
        },
        {
            "content": "The anime is faithful to the game, as far as I've been told, but there's a limit sometime to copy a game into anime. All scenes that were not involving court were nice and would have loved more of it. When they get into the courtroom, nearly everyone should get accused of contempt to court, even the judge. I wasn't expecting Law & Order level of details, but having each prosecutors openly manipulate the judge blew it. Same with the aura-boom blowing people in court kind of get boring after the 2nd episode, not funny anymore. Yet, I've managed to get to the bottom ofthis because the cases were nice.",
            "date": "2016-10-22T20:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 232395,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3192191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kalahee",
                "username": "Kalahee"
            },
            "url": "https://myanimelist.net/reviews.php?id=232395"
        },
        {
            "content": "First off, let me make it clear that I'm a huge Ace Attorney fan. The games are all very dear to me, and the first three are, in my opinion, especially spectacular. This anime covers the events of the first two games.\r\nSo, first, let's talk presentation. I quite like the background music, it's pretty fitting and the main theme is super catchy. Some of the court themes are a little underwhelming, but overall I'd say the music does its job pretty well. Both the OPs and one of the EDs are very idoly - if you like idol music, you'll probably like them. If youdon't, then you probably won't. The other ED is a (in my opinion) very nice pop ballad. Cool.\\n\\n\r\nSo, the character design. I actually think the characters generally look pretty visually appealing. They all look pretty similar if not identical to how they look in the games. Well, when they're not moving. Unfortunately, the animation is not so good. The characters are nearly always horribly off model. Not in a good KonoSuba way, in a \"this anime was far too rushed and lacking a decent budget\" kind of way. The animations aren't nice looking or interesting, they're just dull and bad. Also, side note, the background characters' faces in this show look hideous. I get that they're going to look as good as the foreground characters - that would be pointless - but they just look appalling in this, sometimes even to the point of being distracting. When the faces in your show look distractingly bad, that's when there's a problem.\\n\\n\r\nThere are also some strange changes to the story. I should note first though that there were always going to have to be some changes when adapting this series to anime. I understand this. Some changes were actually really good. Having screens in court to replace the game's UI works really well. That was a good change. On the other hand, sometimes certain characters were replaced with other ones for no reason whatsoever. It doesn't improve the show in any way, and just serves to confuse fans of the games. It's not like it ruined the show or anything, it just seemed super weird and unnecessary. Oh well.\\n\\n\r\nBut now I want to talk about what I believe to be the real problem with this anime is. The reason fans of the games and newcomers alike found it to be pretty \"meh\". These games just don't work very well in a non-interactive medium. The whole joy of the Ace Attorney series comes from that \"aha!\" moment when you finally find a lie in a witness's testimony, when you discover a damning piece of evidence, and when you nail a killer. The whole satisfaction of these moments is YOU working it out, and that just doesn't really work as an anime. Sure, it can still be interesting to find out who did it and how in the anime, but the real satisfaction, the thing that made the series as successful as it is, comes from the interactivity of the game medium.\\n\\n\r\nSo I think this anime wasn't awful. It had many enjoyable moments, and there are aspects that I really do like about it. But in somes ways, it never could have lived up the the heights of the games for me, and I think for many others too. It can be an interesting companion to the games, and I enjoyed seeing the stories I loved animated on screen, but as a stand alone series, I'm afraid that this anime was, in my opinion, a failure.\\n\\n\r\nNevertheless, I look forward to the next season. Maybe the animation will be better. I hope so.",
            "date": "2018-06-30T07:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 282594,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6489804.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/thomasfish",
                "username": "thomasfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=282594"
        },
        {
            "content": "(Updated 24/9/16 with all episodes seen)\r\nThis is a spoiler-free review of Gyakuten Saiban, where the first two games (Phoenix Wright: Ace Attorney and Phoenix Wright: Ace Attorney: Justice For All), also known as Gyakuten Saiban 1 and 2 in Japan) has been adapted.\r\nThe Ace Attorney series is a big series of games, with the first game released during 2001, and went on to boast a catalog of six main games and four side games. The games, as many fans claimed to be, are a parody of the justice system. \r\nAs such, many elements regarding the law in this show could be depicted as inaccurate ascompared to its real-life counterpart. This show also bears strong supernatural elements, where the spirit channeling technique pretty much becomes the central theme of the story. Keep this in mind that you should not be expecting a fully realistic justice system. \\n\\n\r\nEven so, you will see trials being held in a courtroom, you will have witnesses providing testimonies, with the defense attorney cross-examining them, and you will see evidences and objections being thrown all over the place, with the two opposing sides, prosecutor and defense attorney getting into each others' throats. So it could well be an entertaining ride if you are into this sort of thing.\\n\\n\r\nIn the original games, you play as Phoenix Wright (Ryuuichi Naruhodou), a defense attorney whose job is to get his client (the defendant) acquitted, while his opposition, a prosecutor, would aim to get the defendant a guilty verdict instead. The game is mostly split into two parts: 1) An investigation part where you have to gather evidences, as well as clues from relevant people of the case; 2) The trial where you cross-examine the witness and search for contradictions, present evidence to prove why your defendant isn't guilty, as well as finding out the truth and the real culprit. \\n\\n\r\nThe anime also works the same way.\\n\\n\r\nFor most of the first half of the show, the scriptwriters followed the original script rather closely, but our producers did make more and more changes to make the story flow better. These changes are a hit and miss. Most of these changes are done just to speed up the case, cutting down lots of the mundane stuff, such as making witnesses blurt out highly relevant information at a much quicker rate (you often need to dig hard for them in the games), and investigations are becoming rather short and hastily went through in favor for the trial scenes, which are also sped up to a degree where it could become difficult for anime-only viewers to solve the puzzle themselves, instead everything was revealed before the viewers could actually fully grasp the full extend of the case. \\n\\n\r\nIndeed, pacing is the greatest issue of this show. I believe that anime-only viewers will struggle with the super-quick pacing and might have to pause/rewind various scenes so that they can catch up with the story. In the games, you could slowly browse through the profiles of all the relevant people and all the evidences of the case, slowly piecing them out together to discover the real truth. But here, you will have to think faster as time is always ticking for every episode have a limited airing time. This may prove to be a huge factor in determining the enjoyment value of this show. (Then again, you could pause and rewind the episode, if that is your thing.)\\n\\n\r\nMoving on to the art department, which is the weakest point of this show. The character models aren't really drawn well if you compare them to their original game counterparts. Phoenix (Naruhodou) has overly emphasized lightning eyebrows, Maya (Mayoi) is obviously moe-fied, Detective Gumshoe (Itonokogiri) always appear in varying sizes, sometimes plump sometimes malnourished, etc etc. Animation at most times, stiff and minimal. 3D-CG was also utilized poorly, most evident from the grotesque audience of the court. The art may scare viewers away at the first few episodes, for they are, sad to say, really poor. The art gets better during the latter half, but still pretty below-par according to modern standards. \\n\\n\r\nSound-wise, I'd say Kaji Yuki portrayed Phoenix pretty well, the oomph when he yelled out \"Objection\"! (\"Igi Ari!\") was there, and his performance was pretty consistent throughout the show. The other characters have voices fitting to their roles, which is really nice to hear, as most of them do not have a voice in the games. For the soundtrack, various themes from the games are remixed and inserted in various scenes, however, I feel that the soundtrack list is too short, for there aren't many songs in the show, as well as some scenes did not have the right music at the right time. \\n\\n\r\nThe good thing about anime adaptations, is that you get to flesh out the characters a lot more as compared to the game. The games are known to have a penchant of quirky characters, and A-1 Pictures did well in preserving these quirks, at the same time amplifying them sufficiently to give these characters more depth. \\n\\n\r\nSo, is Gyakuten Saiban worth watching? This is a tough one, for I am left a little disappointed at the latter half of the show, seeing how they changed so many things, mostly for the worse. Admittedly, as a fan of the series, I have been waiting for an adaptation, and the show is great advertisement for viewers to check out the games, which, I guarantee, will be very worth your time, for they have really good storylines, great characters and it is quite satisfying seeing how the case unravels itself. Therefore, if you like, you could come over and watch this, even better if you decided to skip the show and go for the games instead.",
            "date": "2016-10-03T21:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 231054,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431015.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lord_Odous",
                "username": "Lord_Odous"
            },
            "url": "https://myanimelist.net/reviews.php?id=231054"
        },
        {
            "content": "If you watch this before playing the games, ur killing ur chances to experiment the amazing masterpiece Ace Attorney (AA) is, so pls, start with the games!!\r\nYou only have to play the first one to be able to watch this anime!\r\n\"Why is the anime so bad?\": It's NOT bad, is just that.... not even counting the immersion u get by playing the games and finding the truth by yourself.... the anime is just too short to be as good as the games. The character development, the scenarios, everything just in just 12 episodes of 20~ minutes is not even close to be enough! On animethere's just seconds to watch some places, almost no time to watch closely each evidence, each person, each scenario, each crime scene.... no time to think either. That totally ruins Ace Attorney.\\n\\n\r\nIf it helps you to trust this random u know nothing about (or not whatever), let me tell you I played....\\n\\n\r\n- AA1,2,4: More than 7 times each start to finish not skiping any case or text.\\n\r\n- AA3: 12 times already, and thinking about replaying it soon (best one!).\\n\r\n- AA5,6: Twice each not skiping anything (Unpopular opinion maybe but almost as good as AA3).\\n\r\n- AA Investigations 1,2: First twice, 2nd once. These are spin offs btw.\\n\r\n- Layton/AA crossover: Just once.\\n\\n\r\nI also played every Android version of the games once.\\n\\n\\n\r\nPD: I know, I'm insane playing a game (specially a  visual novel wich has no gameplay-reason to replay it) that many times hahah But that also shows how good AA is and how much I love it, so I really don't want anyone to kill their AA experience by watching first the anime!",
            "date": "2018-03-16T22:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 274035,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4992544.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/oOSiFeROo",
                "username": "oOSiFeROo"
            },
            "url": "https://myanimelist.net/reviews.php?id=274035"
        }
    ]
]