[
    [
        {
            "content": "Now, I thoroughly enjoyed Gundam 00 Season 1. Great characters, great action, and best of all, a wonderful complex plot. Throw in a good dosage of how it relates the present day world and great voice acting, and you’ve got a recipe for one of the most popular series now.\r\nNow, Season 2 started out with a lot of potential. The main characters were reintroduced very well, preserving the characteristics they were known for and refining them, along with offering a slightly different side of their personality. Some characters did change for the worse, but this is necessary to create the strife needed for the storyto build. And it did build. A new faction came into play here, and some of the old characters on the antagonistic side in Season 1 are not happy with the new world order. New characters are introduced very well and immediately create a third side to the previous two-sided strife in Season 1. There are many characters that are struggling to find themselves in the new world order, so the series has a bit of a depressive feeling to it. Not even Lockon’s lighthearted comments helped much here.\\n\\n\r\nHowever, as well as the introductions to the new characters were, the development of many of these characters had something to be desired. It falls into the same trap that swallowed Code Geass R2, which is to let new characters languish in development. However, while R2 introduces too many characters and has to shift back and forth awkwardly between the factions, Gundam 00 introduces fewer new characters and makes the shifts amongst them much more fluidly, going for \"Let’s integrate all the factions into the episode\" rather than Geass R2’s \"focus here for one episode, focus there for another.\" 00 also focuses on the protagonists much better. The antagonists (that fat blonde guy), along with Bushido, along with the Innovators, could have used more development, but at least I got a better idea of their true personalities better than the Knights from Geass R2. If there was one glaring complaint about 00 S2’s characterization, it would come in the form of antagonistic development in the form of the true mastermind, Ribbons Almark. An antagonist is supposed to create a feeling of hatred in your heart, or you fall for the antagonist’s plot and cheer on the protagonists’ failure. But the main feeling I get from Ribbons is ambivalence. \"Your comrade just got killed.\" *no emotion* \"You just got betrayed.\" *no emotion* \"Your test subject just wrecked your newest Mobile Suit.\" *no emotion* \"Your plan to take over the world has caught a HUGE snare.\" *Whatever* All he does is sit on a MAGENTA couch and twiddle on his thumbs, no matter if his plans succeed or fail. For someone who’s the mastermind, he doesn’t like to get involved much, like he’s a puppetmaster with really long strings on his puppets. Problem is, he feels disconnected from the plot and action, and well, let’s just say that 00 S2’s biggest fault after this is plot management.\\n\\n\r\nNow, the first… 2/3 of the series was developed very well. We get to see the main characters discover a different side to themselves and we are able to supplement the change with what we know about the characters in season 1. But after that, the series starts to stumble. The audience is waiting for a return of aspects that distinguished the characters from season 1. In creating a different dimension for the characters, they gave up the platform built up for the characters in season 1. Like Hallelujah, whose reintroduction was too sudden.  Welcome, but not well done.  Thus, after about the 2/3 mark, the series starts to wander and lose its footing. The focus is on little plot elements that need time to develop, but the producers only had so many episodes of plot to work with. Thus, the big plot elements were placed on the back burner and left to overcook. The series has to rush to resolve these big issues, but didn’t get to do so until the last 3 episodes or so, so it was a miracle that episodes 23 and 24 didn’t feel too rushed. What would have been nice is if they started focusing on these big plot elements around… episode 20 or so? But it’s no big surprise that episode 25 felt like you were landing an airplane but hadn’t slowed down enough. You do stop, but all your passengers are thrown 2 rows forward in your attempt. The series was haphazardly wrapped up as a result.\\n\\n\r\nBut don’t get me wrong: Gundam 00 S2 is still worth your time to watch if you enjoyed S1. There’s still a lot to like, such as the more complex story, matured characters, and many characters just finding their true selves during their personal struggles. I’m not sure if I just expected too much, though. It’s still a likable series, but it just tossed away its potential for becoming a masterpiece about 2/3 of the way in.",
            "date": "2009-04-09T13:46:00+00:00",
            "helpful_count": 97,
            "mal_id": 13995,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58587.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Goldeneyeuro",
                "username": "Goldeneyeuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=13995"
        },
        {
            "content": "The conclusion of the first season left a bad taste in my mouth. That taste stayed throughout the entire second season, but by the end of it, I'd gotten so used to it that I didn't care anymore.\r\n(This review assumes familiarity with the first season of Gundam 00 and references several season one spoilers. Season two spoilers are hinted at but not explicitly stated.)\r\nSTORY - Gundam 00 had a precarious premise from the very beginning. The \"war to end all wars\" story is one that seems to be visited often, but because it's such an idealistic goal, series pursuing it always stand on a shakyfoundation of logic and realism. As a result, it's a very difficult premise to execute well. One of biggest logical gaps for me is still the idea that Celestial Being's two hundred-year old technology can be superior to that of current-day armies, especially since Celestial Being itself seems to have a very poor understanding of the machines they're making use of. Instead, they are reliant on a supercomputer and the notes and secret power-ups passed down to them by a dead man. All of the questions I had from the first season surrounding the organization's conception and survival over the last two centuries remain unanswered for the most part, but the most frustrating thing was not knowing the ultimate purpose of CB until the series' finale.\\n\\n\r\nIt blows my mind that most of the characters didn't even seem to know exactly what the \"real\" purpose of their organization was. It's one thing to keep the audience in the dark, but seriously, even the characters didn't know? Yes, everyone fights for their own reasons, but if you're part of an organization, you should maybe know what they're up to. Just sayin'. The antagonistic Innovators are introduced this season as the new puppeteers of the world, along with their half-puppets, the A-Laws. Presumably, they know what's going on, but since the point of view of the story follows the members of Celestial Being more than the Innovators, the story becomes very reactionary. CB is trying to do this to stop the Innovators from doing this. CB does this because the Innovators are going to do this. But why should the audience care if they ultimately have no idea what anyone's fighting for? The goals from the first season seem to have gone to the wayside somewhere along the way.\\n\\n\r\nThe flimsy storyline also contributed to an entire season of awful pacing marred by way too many romantic subplots. Seriously, could there possibly have been more of them? It didn't take long for 00 to feel like one gigantic soap opera that just happens to take place in space with some kind of war going on in the background. In fact, I'd venture to say that the romantic storylines and drama were the main focus and the war, morals, and fate of the universe thing was the secondary subplot. Who will get Setsuna in the end? Marina or Gundam? Can Lyle save Anew from her overused mind-control plot device? Will Tieria ever be able to win Veda back from Ribbons? Will Allelujah ever actually do anything important in this series or say a word other than \"Marie\"? Will Saji ever stop being spineless, and will Louise eventually accept him again or just go to Andrei instead? Can Billy forgive Sumeragi for using him? Can Shirin and Klaus both survive to the end of the series for their happily ever after? Will Mr. Bushido ever give up on Setsuna? Will Patrick ever win Kati's heart?? \\n\\n\r\nIt. Is. Ridiculous. To be honest, most of the relationship drama (romantic or otherwise) in 00 had the potential to be interesting, but the fact that there was so much of it limited the relevance of each individual subplot and put a huge strain on the viewer's ability to care, especially with an unclear central plotline to tie everything together. The conclusion of the second season and the series as a whole is just as bad as, if not worse than, the first season's ending. It felt similarly rushed, extremely anticlimatic and unrealistic, and didn't resolve nearly as much as I would have wanted. Many of the characters feel stranded at the end of the series, though you do get a resolution for most of the relationship nonsense, further supporting the idea that the relationships were the core of the series and that everything else was secondary. As far as the politics go, it was definitely more of a forced ending than a conclusion. A conclusion implies that things are actually concluded. \\n\\n\r\nCHARACTER - With a few exceptions, most of the first season's gigantic ensemble cast returned for the second season's \"four years later.\" A new season really wasn't necessary just for a timeskip, but it was still really nice being able to see Setsuna age. He's the most interesting character in the entire series just because he matures so much as events unfold, and even as he doubts himself, his motivation, and purpose in the world, he never falls into the trap of the Jesus-kun Syndrome -- when a character becomes a preachy moralfag and refuses to kill people, often accomplishing this by disabling mobile suits in battle instead of destroying them. That isn't to say that having morals and a conscience makes for bad characters, but I find it refreshing when the morals and conscience can coincide with the resolve to fight and the knowledge that killing is sometimes necessary. Rather than instilling the pacifist streak in Setsuna, Sunrise made a good decision in having Marina around to balance things out. As irritating and useless as she was most of the time, I think she was necessary to round out the points of views in the series; that is to say, she was a good idea, just poorly executed.\\n\\n\r\nLyle, the new Lockon, felt like a huge cop-out from the beginning. Sunrise actually succeeded in killing a character! ...But here's his identical twin to replace him. Great. It didn't help that they never utilized the \"twin\" or \"brothers\" aspect to the best of its potential, and Lyle's logic failed on so many levels. He did not want to be compared to his brother, but essentially agreed to take over his brother's previous identity when he joined Celestial Being by taking on his old codename, his Gundam, and his Haro. Lyle's romantic subplot with Anew was one of the ones that had the most potential, and there was a lot of good acting as far as Lyle's inner conflict and reactions went, but in the end, I don't think his character evolved as much as it could have, and static characters remain uninteresting.\\n\\n\r\nAllelujah was amazingly disappointing throughout the second season and pretty much drops off the map after episode seven. You wonder whether his role as a Gundam Meister actually makes him a \"main character\" or not since he dwindles to the point where he doesn't even have any speaking roles for several episodes at a time. Since Hallelujah supposedly \"died\" for one reason or another, there wasn't anything in the way of personal conflict. Instead, he spends the whole time chasing after Marie/Soma Peries. Unfortunately, Allelujah/Marie interactions are idealistic and boring while Allelujah/Soma interactions are repetitive and boring. Marie's struggle with Soma and Soma's struggle with belonging and revenge are interesting for many of the reasons the Allelujah/Hallelujah struggle was last season, but the character(s) could have stood well enough on their own without the obligatory romance/attention of Allelujah. Really, Allelujah probably brought them down by turning it into a cheesy would-be romance rather than the revenge/moral conflict it should have been.\\n\\n\r\nRounding out the Meisters, Tieria changed a lot between the first and second season. It would have been nice to be able to actually see that progress rather than just accepting that development had happened, but it's still refreshing to see characters that actually grow and change, and Tieria does continue to mature. Throughout the second season Tieria struggles with the fact that he's an Innovator and his role in both Celestial Being's and the other Innovators' goals. On the most basic level, it's probably the most interesting of the Meisters' conflicts, usurping even Setsuna, but poor execution, lack of attention, and being constantly thrown back by a dozen other subplots kept it from really succeeding, especially at the end. \\n\\n\r\nAs previously mentioned, there are probably two dozen other characters all with subplots of varying degrees of depth and relevance. Saji and Louise's is especially prominent, but the themes of their relationship cover very little that one of the others doesn't already, especially now that they're both directly involved in the fighting and are no longer bystanders. Neither of them are particularly strong or interesting characters, and I still think that 00 would have been better off without them. It would have probably saved us about ten episodes of drama. There are also still an assload of characters aside from those listed above that make appearances at random, but aren't actually relevant to anything anymore. Ali Al-Saachez will pop up again every seven or eight episodes. As will Nena Trinity, who really should have just died in the first season with her brothers. And as will Liu Mei Wang and Hong Long, who really do anything at all the entire season. All of the Innovators aside from Ribbons are pretty much interchangeable, and even Regene didn't seem to mean much in the end. \\n\\n\r\nARTSTYLE & ANIMATION - The animation in the second season remains slick, and the battles are all relatively fun to watch. I really missed the Gundam Exia's design, though the 0, 00, 0-Riser, and 00-Riser are all pretty interesting as well. I didn't think the Arios was much of an improvement over the Kyrios, though honestly, you don't see Allelujah in action enough this season for his suit to really leave an impression on you. The GN Archer, which actually had a neat design, could have also been featured a lot more. Seravee and Seraphim also had a nice concept, but like the others, was ever over-shadowed by the 00 and 00-Riser. And the Cherudim? As with the Dynames, the prominence of the gigantic rifle made the rest of the suit less important, but even visually, the Cherudim was less to look at than the Dynames.\\n\\n\r\nThe updated character and costume designs did a lot of good, I think, and I'm fond of Setsuna's older appearance. The only new characters that are introduced in the second season are the score of Innovators. They come in pairs with hilariously punny names like \"Revive Revival,\" \"Anew Returner,\" and \"Bring Stabity.\" They also come in a variety of colorful flavors! Way to make it easy to spot the plot devices hiding out in the army and in Celestial Being, guys. There had to have been a better way to illustrate the concept of a race superior to humans without making it ridiculously obvious, right? The ease at which it is to spot these characters also makes the montage at the end of the series open to a lot of debate, but I really just think Sunrise is trolling us at that point.\\n\\n\r\nMUSIC - The music is probably what I ended up enjoying the most in this entire series. I didn't much care for the second season's first opening and ending themes, but chalk that up to my general indifference to UVERworld and Chiaki Ishikawa. Neither are terrible songs or particularly annoying -- just not my thing, I suppose. The second opening and ending, on the other hand, are probably why I even bothered to sit through some of the later episodes since neither of the singles had released at the time. \"Namida no Mukou\" by stereophony actually took a while to warm up to me because I found the timing awkward in many parts, but I loved the vocalist's voice and the energy in the song is just fantastic. \\n\\n\r\nMeanwhile, I loved \"trust you\" by Yuna Ito pretty much immediately. I'd only listened to a few of Ito's songs prior to that, but \"trust you\" just blew me away. The melody is beautiful and the steady tempo really carries it through. Furthermore, the accompanying animation was gorgeous and well-timed to fit with the music, and it left a wonderful contemplative feeling at the end of each episode -- more than most of the episodes deserved. It was also a great follow-up the animation for the second ending of the first season, \"Friends\" by Stephanie. There are a few episodes that end with a brief a capella version of \"trust you\" that I found really unnecessary and awkward, but the song itself is great.Oddly enough though, I like the TV Cut much better than the full single.\\n\\n\r\nTommy heavenly6's \"Unlimited Sky\" is used as an insert song for some of the later episodes, which was also pretty awesome. I adore Tomoko Kawase's voice in general, but I always find her anime songs much more energetic and upbeat than her other work, and \"Unlimited Sky\" is no exception. It always made the battle scenes that much more exciting -- a very needed extra when you're having a hard time caring about the characters involved or the storyline at the time.\\n\\n\r\nLastly, the instrumental soundtrack for 00 seemed markedly improved in the second season. The leitmotifs are a bit more prominent and the music in general seemed to compliment the mood and feeling of each scene a lot better. It was really refreshing to see/hear something actually improve between the seasons.\\n\\n\r\nVOICE ACTING - Average for the most part, though I suppose Shinichiro Miki gets special mention for some excellent acting involving a very emotional Lyle, and Noboru Sougetsu (Ribbons), for managing to not remind everyone of Amuro Ray, at least most of the time.\\n\\n\r\nThe dub is still pretty awful. The best of the dub cast is Brad Swaile as Setsuna and maybe Alex Zahara as Lyle; both are pretty average. The rest of the cast either sound painfully uninspired or just... the same. Half of the female characters in this series sound the same in the dub. It's must be pretty bad when I'm offended at how poorly done the voices are for even characters I don't care about (which, in 00, is most of them).\\n\\n\r\nOVERALL - When I reviewed the first season of Gundam 00, my main complaints included the fact that they had more details than structure, that they didn't bother to explain a lot of what I would consider to be important backstory, and that there were far, far too many characters, all of whom were trying too hard to be the focus. The lackluster ending to the first season didn't lead me to have a lot of expectations for the second season, but I'm still rather disappointed that they managed to let all of their problems get worse rather than better. In the end, I only saw 00 through to the end for the sake of having seen it to the end, which is never a really good reason at all. Then again, maybe I only saw it through so I could eventually bitch about it here... which really isn't that great of a reason either.\\n",
            "date": "2009-06-17T18:32:00+00:00",
            "helpful_count": 85,
            "mal_id": 15842,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kiriska",
                "username": "kiriska"
            },
            "url": "https://myanimelist.net/reviews.php?id=15842"
        },
        {
            "content": "Gundam 00 season 1 was for me an instant classic. It combined a great story with excellent action scenes. Also all the characters were realistic. They had a past, motives, weaknesses etc. Needless to say I was looking forward to the second season. After watching 23 episodes I decided to write this review, because I think season 2 is a letdown.\r\nThe re-introduction of the 4 meisters is wonderfully done. After that the story just won’t startup. Half of the season is dedicated to explain in depth why some characters are fighting. Because of this, the main story progresses really slow. The action scenes are notas good as the previous season. In season 1 it was 50% teamwork and 50% strategic planning. I was always wondering if the mission would be a success.  Now it’s 70% gundam 00 and 30% rest. So when 00 arrives you know they’ll win. They have put too much emphasis on gundam. The other gundams and characters don’t get the time to fully expand them self. \\n\\n\r\nThe story itself takes a new path. The new theme is “innovation”. I think it’s a bit confusing, because it is combined in the plan of Aolia. At this moment I am still not sure what the plan of Aolia is, or if it is still his plan. Also the reason why they are fighting in this season is different. I feel that they are not fighting for world peace through armed intervention anymore. Let that be a reason why I liked the show. They were willing to sacrifices themselves for a better world. Now it feels that they are fighting the new main antagonist and not for a better world. \\n\\n\r\nThis season focuses more on Setsuna and gundam 00 than any of the other characters. Too bad that he is boring. The only thing on his mind is gundam. In one episode he says:  “Ore wa gundam”. That sums up Setsuna a soulless machine. I think he is the wrong character to put so much emphasis on. It wouldn’t hurt to give Setsuna some romance, to give him some emotions. Tieria is one of the characters that remains interesting. The new lockon feels like a cheap replacement, because he walks, talks and acts the same as the original lockon. If they had the balls for it they would have introduced a new meister. The good thing about the new lockon is that he feels different than the old one. Allelujah was one of my favorite characters of the first season. It was refreshing to see a mentally ill main character. In the first season he was a psycho unpredictable crazy fighter, now he is a boring you-wont-even-miss-him whiner. Without the aggressive hallelujah he is boring and I have lost all interest in this character. \\n\\n\r\nWith the introduction of a new antagonist he also brings with him around 8-10 high level enemy opponents. With “high level” I mean that they have a better gundam and don’t die within 1 blast/fight. All these opponents are arrogant, dull and boring. Not once did they reach the level of season 1 opponents, for example Graham Acker, Ali El-Saachez, Andrei Smirnov. These characters were interesting and they all had their own reason to fight. The new opponents are boring and uninteresting.\\n\\n\r\nSome important characters from the first show return, but I think they should’ve stayed dead. They play some role (most an annoying part) in the first half of the show, only to disappear for 8 episodes. And then reappear again at the end. During their disappearance you have not missed them once.  These roles could have easily been filled by the new enemies of this season. I am wondering why they even made these characters return.\\n\\n\r\nConclusion\\n\r\nI liked the first show because of the realism. The gundams were not that overpowered, the action scenes were exciting, the story was an original and interesting set of protagonist and antagonists. In general, every episode made you want more. After a couple of episode my excitement about season 2 was over, it no longer made me want more after every episode. Mostly because the characters are not interesting anymore. The new enemies are boring. The story progresses slow and I still have no idea where the show is heading. I am not saying this is a bad show, just that it is not a worthy successor of gundam 00 season 1.\\n\\n\r\nI give it a 75 out of 100.\\n\\n",
            "date": "2009-03-18T17:36:00+00:00",
            "helpful_count": 61,
            "mal_id": 13294,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64518.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BaggyGorilla",
                "username": "BaggyGorilla"
            },
            "url": "https://myanimelist.net/reviews.php?id=13294"
        },
        {
            "content": "(Phase one)\r\nI am not into Mecha anime, truth be told this is the 1st time that I've tried to watch a series on the Gundam franchise that is produced by Sunrise-Bandai&trade;...\r\nI expected it to be the same as the other Gundam series but I was proven wrong...\r\nAfter seeing the 1st season, I was so surprised at how this series turned out. I expected myself to drop this after watching a couple of episodes but instead I was drawn in to watch it up to the end, it has all the elements needed to create a precise and successful series...\r\n(Phase two)\r\nInteresting plot, complex storyline, excellent characterdevelopment, and outstanding visualization... The animation itself is clear and very detailed...\\n\r\nI tried to watch some Gundam series before but after 2-5 episodes I find my interest draining away, one thing that I've observed is that compared to other Gundam titles this series so far is the easiest to understand...\\n\\n\r\n(Phase three)\\n\r\nI mean when I watched other Gundam titles in the 1st or 2nd episode, they introduce many Gundams with their corresponding models like Gundam Zeta, Gundam ZZ, Gundam Type Z-0, etc. etc.. \\n\r\nSomehow it seems like instead of becoming interesting, it became a show-off for Gundam models and sometimes it will become confusing while you watch it, I mean it's like, &quot;What's this Gundam, why does it look the same as that Gundam?&quot;\\n\r\nSo in the end it is not interesting at all...\\n\\n\r\n(Final Phase)\\n\r\nBut Gundam 00 is really great, I must admit that they did a good job on this series. For someone like me who is not into mecha anime I was definitely surprised, at the ending of the 1st season it left me an impression that the good part is yet to come. After seeing the 1st 3 episodes of the second season I could say that this is definitely going to be much more interesting, much more complex, and much more developed than the 1st... \\n\r\nSo brace yourself on the second season, from the look of things this is going to be another epic...\\n\r\nThis season is a promising one... And I guess it's worth the wait! Tee hee~ :3\\n\\n\r\n(Operation Review - Mission Complete)\\n\r\n:p",
            "date": "2008-10-23T04:31:00+00:00",
            "helpful_count": 44,
            "mal_id": 8878,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74807.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Rhaineleen",
                "username": "Rhaineleen"
            },
            "url": "https://myanimelist.net/reviews.php?id=8878"
        },
        {
            "content": "If you saw Gundam 00 season 1 and you liked it, you probably wanna see season 2 as well.\r\nBut Gundam 00 S2 is crappy as hell (aside from the good looks.. the production value was top notch).\r\nI have to admit that I liked Gundam 00 S1 (except for the ending).\r\nGundam 00 S1 focused a lot on the plot/action and because of that, the character development got neglected.\r\nBut that didn't matter, because even with the 1-dimensional characters, it was still an interesting and exciting mecha anime.\r\nHowever in Gundam 00 S2, 'they' tried to 'spice up' the character development a bit.\r\nThey totally froze the storytelling and decidedto focus (a lot more) on the characters.\\n\r\nBut they failed miserably!!! The characters didn't come 'alive' one bit!!!! \\n\r\nThe result = crap.\\n\\n\r\nHell.. what annoyed me the most were the things that just didn't make sense.\\n\r\nFor example the 'couple': Louise and Saji.\\n\r\nSaji discovers something (very) important about Louise's tragedy (spoiler?) and 'every' viewer knows Louise should know about this.\\n\r\nBut for some reason whenever Saji meets Louise, he NEVER discloses this important information to Louise.\\n\\n\r\nWhat we get instead is a lot of shit dialogue like: \"Saji..\" \"Louise!\" \"Saji!!\" \"Louise!!\"\\n\r\nThe same with Setsuna.. awww .. I'm not even going to start with his \"Orewah Gundammmuhhh\" dialogues/monologues...\\n\\n\r\nIn short.. Gundam 00 S2.. was bad.. very bad.. compared to season 1..\\n\r\nThe story became predictable, the (romantic) character development was crap, some unimportant characters died, \\n\r\nbad guys didn't actually die in season 1, you get spammed with loads of new characters, \\n\r\nRibbons 'bitch-slaps' female characters and they 'endure' it *cough*.. and so on...\\n\\n\r\nBut anyways .. loads of you brainwashed *Gundam-lovers* will probably love this show anyways.. \\n\r\nSo... enjoy the sequel you guys.. :|\\n",
            "date": "2009-03-29T17:02:00+00:00",
            "helpful_count": 44,
            "mal_id": 13581,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64671.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kozooo",
                "username": "Kozooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=13581"
        },
        {
            "content": "This review will focus on both seasons of Gundam 00.\r\nMobile Suit Gundam 00 is the latest installment in the incredibly massive Gundam franchise produced by Sunrise. This is also the first Gundam series I watched so I will not go into differences to other Gundam series that I see so many of the older fans do.\r\nStory: Most of the story on Gundam 00 is based heavily on war, the countries who suffer from oppresion, the people who want the war to stop, and the corrupt goverments who control the people. To be quite honest I wasnt crazy with the story but I also didn't dislikeit, i thought it showed a pretty realistic view on how a corrupted goverment and military organizations can cause the murder of millions for their own benefits and yet still keep their citizens unaware and/or on their side while they do so. I wouldnt lie if I said I saw a little bit of parallels with what is happening in the world today, but thats for another time.\\n\\n\r\nAnimation: The animation stayed constantly solid the entire series and it had some really cool and flashy effects during battles which made the show a real graphical beauty. Also watching this on HD 720p really makes you appreciate the effort put on the animation. I have nothing bad to say this. Although I will admit some gundam designs on the second season were getting a bit weird....\\n\\n\r\nSound: One of the great aspects of the series was its very varied and good soundtrack. It made a lot of the battle scenes very exciting to watch. The voice acting was also very well done, and i really enjoyed it. A lot of \"pew pew\" also made me XD\\n\\n\r\nCharacters: Gundam 00 has an incredibly huge cast of characters which some I never even managed to remember their names, there is a large variety of characters that you learn to love or hate in this show. I personally was able to enjoy the characters and being able to see them mature while adapting to the changes in the world was very enjoyable. Even though the show gave the short end of the stick to some of what I thought were very interesting side character with a lot of potential, and gave us some character that I just absolutely detest and hate, Gundam 00 did a good job on giving us interesting characters.\\n\\n\r\nEnjoyment: I loved this series mainly because of the battles, the battles are definitely the best part of the anime and there is plenty of them so I always went into every episode looking for some great action and Gundam was able to deliver that every time.\\n\\n\r\nOverall: There really isnt a reason to not like this show, it is a solid mecha action anime with some solid plot and characters and features some great animation to boot. If you have never watched a Gundam anime before i think this one is a good one to start watching, I had never watched a Gundam anime before but I for one am now a fan of the series and will definitely be watching the upcoming gundams from now on.\\n",
            "date": "2009-03-30T10:49:00+00:00",
            "helpful_count": 29,
            "mal_id": 13613,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23773.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/game8910",
                "username": "game8910"
            },
            "url": "https://myanimelist.net/reviews.php?id=13613"
        },
        {
            "content": "The anime pretty much re-establishes its cast and its more central on the characters this time as opposed to the politics. I thought the politics of the first season were a nice twist and offered something different in comparison to the other Gundam series where they don't directly state modern day politics. But due to the events in this series, that factor has been conveniently written out. But does it make it up by being more character centric? In some ways, it can. But I still personally feel that the 25 episode format is still a major weakness for this series, especially if its aGundam one. Since most of the major characters are back, the story is also allowed to be more fast paced. But the problems that it gave season 1 are still presented here. I felt they could have used Mr. Bushido more, as well as Ali Al-Saachez. This series does have a handful of characters and the 25 episode format just doesn't give any external characters such as those two the presence I felt they needed and deserved. And like season 1, I just felt it really rushed things and I felt with more episodes, we could have seen things much longer and I think it would have been given proper presentation. Not only that, I felt with more episodes, i think we could have seem more of Seraphim as well in addition to Nadleeh in season 1. With 15 to 25 more episodes, I think 00, especially season 2, could have reached its full potential. \\n\\n\r\nI have nothing much to add about the art and animation that I've already said in my review of season 1, but I'll acknowledge a few things. I do like how the series makes Setsuna properly older by not just making him taller, but they made his face properly thinner, and they spreaded out his hair a bit, and made his eyes somewhat smaller. So I thought that was a descent touch to make him look 20 or 21, or however old he's supposed to be. But I'm very surprised at what they did with Saji, and how they aged him. I thought that was done very well. \\n\\n\r\nAs for the designs of the Gundams, well, they're pretty much more or less the same froms eason 1, except they now have the grilled mouth plates while in season 1, they didn't have the grilled mouth plates. But other mobile suits that come in later on, especially at the end, are pretty nifty and fresh. \\n\\n\r\nAs for the quality in HD, I saw this one Blu-Ray at a friends house, and its pretty sweet. As for the action, it does get a bit DBZ-ish. Especially when the Trans-Am system now being introduced. I'll admit in its own way, it is distinctive in comparison to other Gundam series, but i just felt that feature just made it too Shounen-esque. I'll admit the first time, at the end of season 1, it was awesome. Yes, it does make it more intense, but I just felt it was really abused.  I think using it like once or twice as opposed to using Seraphim once or twice could have been better. \\n\\n\r\nWell, what I've already said about the quality of the voice acting in season 1 can be applied here as well. I watched this series on bluray with a buddy of mine, and sadly, there was no dub included, but I do have intensions of seeing this dubbed when I can. The background music from season 1 is still utilized, but the soundtrack is of course slightly different. \\n\\n\r\nThe opening themes are not really dark from season 1, but are still striking in a different way that represents the tone in their own way. Uverworld sings the first theme, Hakanaku mo Towa no Kanashi and one of my favorite singers, Ito Yuna, sings Trust You, one of the ending themes. I'm sure Japanese music buffs will enjoy the soundtrack whether or not you're a Gundam fan. Hell, I hated the Cosmic Era Gundams, but I still dig their soundtracks. \\n\\n\r\nIn the end, if you liked season 1 for its politics, then unfortunately, you won't find it here, but those features I felt were taken out for the right reasons, but the overall atmosphere doesn't significantly change which is what still kept me hooked. Still, I think it's the true Gundam of the 21st century as opposed to SEED. I do hope to see more of Gundam based on this series. I think it has a lot of potential. I still think there are unanswered questions and the universe of this Gundam has me curios. So I hope more material comes out soon. \\n\\n",
            "date": "2010-03-04T13:31:00+00:00",
            "helpful_count": 23,
            "mal_id": 23715,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ParaParaJMo",
                "username": "ParaParaJMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=23715"
        },
        {
            "content": "Let the inspection begin.\r\nAt this point, it’s fair to say that if nothing else, the second season of Gundam 00 doesn't surpass the first. It is a mangled piece of machinery from beginning to end. The only salvageable aspect would be the fairly decent audiovisuals that got carried over from the first season. The animation is fairly nice, particularly with the flashy fight scenes. The new designs aren't quite as good as in season one, but are still serviceable as well. There's little to no noticeable CGI, and there is a notable improvement in the mecha designs. Additionally, the few new tracks they added infor the OST are pretty decent, notably, the episode preview theme, though it isn’t up to Kenji Kawai’s standard when compared to say, Ghost in The Shell or Musekinin Kanchou Tylor.\\n\\n\r\nUnfortunately, this is where the positive reports end.\\n\\n\r\nThis virus-infected scrap heap wages a war against nearly every surviving character from season 1. Thankfully, there are a few that come out relatively unscathed. We have Col. Smirnov, who managed to stay likable across both seasons. There's Ribbons Almark, who remains static and boring despite his role as the main antagonist. Wait, shit, we're running out of positive examples. Lastly, there's Setsuna, the main protagonist who is as static as ever. That is quite literally it. 3 characters...out of around 20. Christ. Everyone else gets their personalities and/or relevance hampered with to varying degrees. Let's take it from the top.\\n\\n\r\nNow that he's relevant, Saji becomes an intolerable Kira Yamato knockoff for half the season ( as if that invincible beam spam machine wasn't dreadful enough). Thankfully we only have to put up with this for half the show, as he's later reduced to a standard Gundam protagonist when he and his arc take a backseat. His girlfriend, Louise, undergoes a drastic personality change from what was once a sulking mess to now a person that borders on complete lunacy. While there's a plausible connection between \"I lost my family to a Gundam\" and \"I'm insane and I want revenge\", neither of the two seasons tried to connect these two states of mind. I get that people change over time, but this season doesn't show us any of that change when even a small flashback montage could have sufficed. On top of that, the personality change is so extreme it's impossible to take seriously. As it stands, Louise is an annoying lunatic that doesn't even suffer any repercussions for her actions. Somehow, she isn't even the worst case of personality switching, as Soma Pierez, goes all over the place at the drop of a hat. \\n\\n\r\nAs mentioned earlier, important characters often saw their relevance dwindle. No character represents this more than Allelujah, one of the main protagonists of both seasons. He gets sidelined so hard he barely even exists after his arc ends in the 6th episode out of the 25 that exist. Keep in mind, he and the characters mentioned previously were some of the most notable characters across both seasons. Even Gundam SEED Destiny, the same show that downright ruined one of the best characters in SEED, solidified Kira Yamato’s Gary Stu status, and made his friend and rival Athrun repeat his arc from season 1, didn't go this far. This speaks volumes, especially when I still haven't discussed everyone this season fucked up. Would anyone actually refer to this as a good sequel?\\n\\n\r\nThe new cast is catastrophic as well. The only remotely decent new character was a disposable snake name Regene, who accomplishes absolutely nothing and means little outside of a small alliance arc that goes nowhere. Given that this is one of the best characters in the show, it really speaks volumes of how awful and often disposable these characters are. On the subject of more relevant characters, we have Andrei Smirnov, who is probably the worst new character introduced in the show. He is insufferable from beginning to end, and he gets no real punishment for his actions. His quest for revenge against his father is as ill-conceived as his character afterwards is irrelevant, as it's only there for a cheap backstory and another character having her personality arbitrarily shift once again. Yes, one of the more noteworthy characters exists for one idiotic arc before being reduced to yet another nobody halfway into the season. The only important character left is the new Lockon Stratos, who comes with his own host of issues. For example, despite him wanting to be as far removed from his brother as possible (not even touching on how much of an asspull this character is), he pilots a borderline identical mech, and assumes the exact same role as him! It is almost laughable how stupid he is! If only this was an intentional showcase of how war can bring about the worst in people. Instead, it's a preachy, empty spectacle of intolerable husks in human shells, obliterating each other while shouting cheesy platitudes. The worst part is that I'm not even covering everyone here, not by a long shot.\\n\\n\r\nThe main purpose behind almost every Gundam installment is to use epic war machines piloted by unstable people to illustrate the terrors of war on a physical, societal, and psychological level. 00 goes about this as bluntly and pathetically as possible. Everyone constantly shouts about how “violence is bad”, “killing is wrong”, and that “people just need to understand each other better”. Somehow the worst way the series integrates this is by ripping off Zeta Gundam, one of the most iconic entries in the franchise, twice. The most mind-numbing instance is towards the end when the show takes from Zeta Gundam's final episodes, which show newtype abilities become as absurd as being able to interact with the dead for the sake of \"understanding people better\". At least SEED Destiny has the courtesy of only ripping off an iconic storyline of Zeta Gundam with the Four Murasame plot. This series apes from that particular set of blueprints with Anew --the lifeless Four clone of this series-- on top of the aforementioned \"understanding dead people\" voodoo. This is unforgivable!\\n\\n\r\nWhat a scrap pile this heap of a season turned out to be. Even with the major errors present within the first season, there was room for this second season to a newer model that worked off of what came before for a well-built conclusion. It may look clean and shiny, but this pile of junk was plagued with critical malfunctions throughout. To think they kept this line of defective machinery going with a sequel. It isn’t the worst product the Studio Sunrise factory assembly line cobbled together, not with defective equipment such as Gundam ZZ having being broadcast years prior. Regardless, a product that short-circuits out of the box is of no use here.",
            "date": "2016-05-26T19:25:00+00:00",
            "helpful_count": 18,
            "mal_id": 219388,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=219388"
        },
        {
            "content": "This series is sure to have received a very high expectation from the viewers, and that includes me. The first season left a huge mass of mysteries and many possibilities for the conclusion of the story. With just some little improvements from the first season, this sequel will be close to perfection; but it becomes utterly disappointing in almost every aspect.\r\nStory (6/10)\r\nThe conflict the new direction of the story is intriguing and interesting in the start. Now we see the outcome of the protagonists', the Celestial Beings or the Gundam Meisters, idealistic military interventions. Even with all their efforts, the world is at a bad,or even worse state as before.\\n\\n\r\nWith this backdrop, secrets are finally revealed one by one. But though the revelations are in tandem with excellent gundam battles, the character involvement makes it very bland. The tactics, teamwork and science involve are as excellent (but later on, replaced with godlike gundams) as before but character \"developments\" are too rushed, unrealistic and insignificant in general. Gone are the deep connection to the root of mankind's actions, the radical characters that show it, and the tackling of current societal issue such as religion, energy crisis, ethnic differences, terrorism and others.\\n\\n\r\nThey were replaced by the repetitive portrayal \"the antagonists have a logical and probably good intention for the world but in reality they're evil.\" What happens is that each episode or arc we see the same themes over and over again.\\n\\n\r\nArt (10/10)\\n\\n\r\nThe best in the series: high definition animation. And the gundams are in the peak of our current mecha designs. Each part of the frame are detailed: hair, eyes, clothing and especially, the mechanical parts. the colors are beautiful and bright and the light of the GN Drive is very memorable.\\n\\n\r\nThe endings of the anime must be praised for their symbolism and artistry.\\n\\n\r\nSound (8/10)\\n\\n\r\nI must say that the music in this series features the same genre as the first season: modern pop ballads and alternative rock. Because the setting is Anno Domini, I think the moods they give is appropriate.\\n\\n\r\nThe background music has improved and they are not repetitive. However, though they are appropriate, they don't give a lasting impression.\\n\\n\r\nCharacter (5/10)\\n\\n\r\nI say the character of the series and the characters themselves have become mediocre.\\n\\n\r\nThe main characters were developed greatly in the first season but the second season is supposed to be the room for their interaction: And we get a very big mess.\\n\\n\r\nSetsuna and Marina's bond is unique and in a way beautiful but their interaction in the second season are insignificant and offers no substance. The potential result of their differences of beliefs are sublimated. Setsuna is still a almost emotionless badass, but his interaction with the many mediocre characters dimmed his remaining good quality\\n\\n\r\nAllelujah/Hallelujah is one of the most interesting characters because of his psychology but in the second season he screams \"Marie!\" 50% or more of the time and the other dialogues he's involve in does not add to the overall drama. Soma screams \"Colonel!\" And it's the same as Saji, who also screams \"Louise!\" most of the time, and Louise, who psychotically screams \"Celestial Being!\" Marina says \"Setsuna...\" all the time. In short, these characters, and others too, long for another in different ways yet their internal conflicts are cliche or lacks screen time.\\n\\n\r\nWe expect something different from the new Lockon Stratos with his connections but we get little. His role, aside from being a Meister,is to add drama which slapped on and poorly developed. Tieria involvement and development is the only notable thing in this section, are crucial, but somehow he offers blatant fanservice .\\n\\n\r\nThe new characters with spotlights in the series does not leave impacts at all, and I find them insignificant in general. Beside from adding angst, evil or action, their purpose is to pilot the new gundam models that is of course, advertisement. The main antagonist is well...bland. He lacks badassery.\\n\\n\r\nThe character is the greatest weakness of the show. Also an interesting note, this show has abused binary pairs the most- too many characters has pairs, look-alikes, clones, alter egos that are explored little.\\n\\n\r\nEnjoyment:\\n\\n\r\nI enjoyed it because of the action and suspense. But the story makes me cry in disappointment. The characters have great potential in them but 25 episodes as too short for them. If they were only explored more and interacted in a slower, more cinematic manner with lots of meaningful dialogues this series will have definitely improved.\\n\\n\r\nOVERALL: 6",
            "date": "2009-04-26T20:40:00+00:00",
            "helpful_count": 16,
            "mal_id": 14540,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44336.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/danceljoy",
                "username": "danceljoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=14540"
        },
        {
            "content": "*This is a review of both seasons of Mobile Suit Gundam 00.\r\nWhile some people were still recovering from the endings of two of the most popular shows of the early 2000s, Madhouse’s Death Note and Sunrise’s Code Geass: Lelouch of the Rebellion, they may have missed another entry into Sunrise’s impressive catalog, Mobile Suit Gundam 00. It’s interesting that Mobile Suit Gundam 00 (Gundam 00), which is a part of a series that has been airing since the late 1970s, isn’t more popular than it is. While I’ve known about the Gundam series for several years, I had never even heard of this particular entryuntil recently. Is there a good reason why this series has been overlooked by so many, or is it a hidden gem that many people haven’t yet had the pleasure of discovering. \\n\\n\r\nStory:\\n\\n\r\nIn the year 2307, the people of Earth have exhausted its most precious resource, oil. In order to combat their reliance on fossil fuels, several countries have banded together to form three super powers: The Union of Solar Energy and Free Nations (Often shorted to “The Union”)—the Americas, Australasia, and Japan, The A.E.U. (Advanced European Union), Europe, and the Human Reform League—Russia, China, India, as well as parts of Southeast Asia and the Middle East. These three powers were formed with one major purpose in mind, to harness the power of the sun. They all are in control of one Orbital Elevator, an extremely tall structure extending from the Earth’s surface all the way into space. These orbital elevators are used to harness solar power and transport it to countries that are a part of each of the super powers—thereby excluding those who refused to join—as well as serve as a transport into space, military base, and a colony of sorts. But, unfortunately, each one of the superpowers still only looks out for their own individual interests. The result of these nationalistic tendencies is a world of perpetual war. But, during the unveiling of a new A.E.U. Mobile Suit, a large robot controlled by humans usually for military purposes, a brand new entity joined the fray, an entity known only as Celestial Being. Their purpose, to eliminate war by forcibly stopping any armed conflict and eliminating those who proposed a threat to world peace. In order to accomplish this goal, they will use the most advanced mobile suits that the world has ever seen, Gundams. \\n\\n\r\nGundam 00’s story gets off to a pretty clunky start. The first episode throws you right into the action, which would have been perfectly fine if that’s all there was to this series. But, as you’ve probably gathered from the plot synopsis, there’s a lot going on. The story is stretched across the globe and features several main and supporting characters, different factions, and a totally different world than the one we currently live in. The scale of the story is fairly massive, and you’re hit with all of these characters, factions, and new world landscape right at the beginning with little explanation. Thankfully, all of these issues are resolved later on in the series, but that doesn’t change the fact that you’ll be “hung out to dry” for the first couple of episodes. \\n\\n\r\nGundam 00 does recover from its shaky start, and starts to fill you in on what exactly is going on in this world you’re observing. But, there are still plenty of surprises to come. There are several mysteries in Gundam 00’s story that will slowly be unveiled as the series progresses, and I think that they’re all executed well and help to make the story more dynamic. \\n\\n\r\nThe main theme of Gundam 00’s story is war, and how exactly is the best way to go about ending it. How to obtain world peace has been something that has been discussed for many years, and most people have probably already dismissed the notion as an impossibility. But what if there was an organization that, essentially, declared war on war. Even if they were to bring about peace, would that peace be real peace? Would that peace, which was created by violence, even last? These are some of the questions that were proposed during course of the story, and, honestly, it made me think. While watching this series I actually questioned some of my own personal beliefs about war and violence. Watching dozens of characters on different sides of battle, all having different ideologies reasons for doing things was really interesting to watch. Seeing several people who have the same goals, but disagree about the means of attaining them, or vise-versa, provides you with an opportunity to see multiple perspectives on the same issue and I really enjoyed that about the story. \\n\\n\r\nGundam 00’s story was interesting, thought provoking, and well thought out, but it does have issues other than it’s clunky start. One of those issues is a lack of a proper explanation of certain topics. For the most part, Gundam 00 did a really good job of explaining everything that was going on, and the reasoning behind it, but other times the series’ explanations for how and why things happened the way they did weren’t exactly the greatest. Another problem I had was the series very open ended ending which didn’t really wrap anything up, and I’m talking about the ending to the second season of Mobile Suit Gundam 00 not the series concluding movie Mobile Suit Gundam 00 The Movie -A Wakening of the Trailblazer which is…a review for another day. I was also mildly annoyed when things would just pop up out of no where using the excuse that it was all apart of Aeolia Schenberg’s, the founder of Celestial Being, plan, but that just piggybacks onto my earlier complaint about some of the series’ lackluster explanations. \\n\\n\r\nCharacters:\\n\\n\r\nWhen it comes to characters, Gundam 00 is a prime example of too much of a good thing. I can’t think of one character in the entire series that I really disliked. I was really interested in getting to know the characters as the series progressed, but there was one big problem. There are just way too many of them. Gundam 00’s story just covers too much ground. When you are showing several characters from each of major factions in the series, there is no way that you’ll have enough time give us all of their background stories, and properly develop each and every one of them. \\n\\n\r\nThere are 37 supporting characters just in the first season. And it’s not like they’re just throw away characters either, each one of them does play some role in the progression of the story or in the development of the main characters, and most of them are given a fairly good amount screen time. As stated earlier, with so many characters there’s no way you can go into great detail on all of them, but, thankfully, all of the main characters are taken care of. Each one of the Gundam Meisters (German for master): Setsuna F. Seiei, Lockon Stratus, Tieria Erde, and Allelujah Haptism, all are given a good amount of development, and background information. Of course, some are given more than others, but all of the main characters were solid in terms of background information and development. It’s just a shame that there wasn’t enough time to properly develop all of the interesting side characters. \\n\\n\r\nAnother problem with having so many characters is that it’s harder properly develop the relationships between them. I think that it was handled really well for the most part, the only real issue that comes to mind is when two particular characters meet, have one conversation—which was very short and didn’t really show any signs of being romantic—and the next time we see them together they’re a couple. While it was fairly obvious that that was the direction that their relationship was going to go in, it would’ve been nice to actually see that relationship progress. But, other than that, Gundam 00 did a great job of developing the relationships that involved main and main-supporting characters. Of course some of the less important supporting character’s relationships weren’t given nearly as much development, but overall it they were handled well.\\n\\n\r\nAnimation:\\n\\n\r\nI found Gundam 00’s animation to be a bit of a mixed bag. That’s not to say that the animation isn’t generally really good, because it is. It’s just that there are some interesting things to note about it. Without a doubt, the best part of the animation is the fights between mobile suits. The action scenes are really engaging, and genuinely exciting to watch. I was really impressed by how all of the mobile suits looked, everything looked really detailed and it really helped to elevate the series’ fight scenes. But where the mobile suits, and I do mean all of the mobile suits and not just the Gundams, all looked really distinct and detailed the character models were lacking a little. It not so much that they weren’t distinct, that was actually just more praise for the mobile suit models, but they just seem to lack detail.  Especially when the camera would zoom out and show a particular character’s full character model. The series’ background scenery was also good, but certainly nothing spectacular. But, with all of that said, the animation in Gundam 00 is still really good. \\n\\n\r\nSound:\\n\\n\r\nGundam 00 has a massive, and varied soundtrack (OST), with an abundance of songs that can fit the tone and setting of each scene that they are used in. As I mentioned earlier, Gundam 00 has some really cool fight scenes, and the music that the series uses only makes the scenes that much more fun to watch. It uses grand, orchestral songs to bring a little more intensity into the already engaging fight scenes. While the OST does have a lot of songs that make you feel like you’re about to jump out of your seat, it does know how, and when, to slow things down. The OST also has plenty of slower songs to fit all of the more somber scenes as well. Gundam 00’s OST really nails the overall feeling of the songs that they are using in each scene. Each song that was used feels like it was made specifically for that scene, and in some, cases they probably were. \\n\\n\r\nComplimenting its massive OST, Gundam 00 also features a pretty large number of good openings and endings. Between its two seasons, Gundam 00 has four openings and five endings. They are all really well done, but the first and last openings, and the first, third, and last endings are the ones that really stood out to me. \\n\\n\r\nEnjoyment: \\n\\n\r\nI had a really good time watching Mobile Suit Gundam 00. Like a said earlier in the review, it was able to make me think about some issues that I might not have thought about otherwise. Add that to the great action sequences, intriguing story, and interesting characters, and you’ve got one really entertaining series. There wasn’t a dull moment in any one of Gundam 00’s fifty episodes, and, while I wouldn’t say that it has a really high re-watch value, it’s definitely something I could see myself watching again at some point down the road.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 4.3/5\\n\r\nCharacters: 4.2/5\\n\r\nAnimation: 3.9/5\\n\r\nSound: 4.4/5\\n\r\nEnjoyment: 4.3/5\\n\r\nFinal Verdict: 4.2/5\\n\\n\r\nMobile Suit Gundam 00 is a great series that you should definitely check out, whether you’re a huge Gundam fan or are just hearing about the franchise for the very first time. \\n",
            "date": "2015-07-19T04:24:00+00:00",
            "helpful_count": 13,
            "mal_id": 193807,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=193807"
        },
        {
            "content": "Keep in mind that this review covers both the first and second seasons. \r\nThe Gundam franchise needs no introduction. It's probably the single best known mecha anime. The eleventh installment, Gundam 00, was written by Kuroda Yosuke. Who was involved with such well done works as Excel Saga and Gokujou Seitokai and such bad works as Onegai Teacher. Really, the series could go either way in terms of quality based on his previous work. So let's take a look and see whether the best or worst aspects won out.\r\nIf you're even passingly familiar with the Gundam franchise you'll recognise the story structure of Gundam 00instantly. The militaries of great powers are attacked by brand new mecha weapons called Gundams who are striking against them in order to put an end to conflicts. The group announces that they are Celestial Being and they are going to end armed conflicts by intervening in them with their Gundams. The Earth governments quickly begin planning counter-measures. One thing that is positive about Gundam 00 is that they do acknowledge the contradiction between Celestial Being's purpose and their methods. But, overall, the writing is pretty sketchy. It isn't terrible but it is incredibly lazy. There are several moments where the writing puts the characters into a corner and they get saved by something that comes completely out of nowhere and comes across as being made up just for the sake of getting the characters out of the situation. The ending is another aspect that really isn't done well. Everything gets wrapped up far too easily in the last fifteen minutes or so of the final episode. All the unresolved conflicts, loose threads, etc... It's almost like they needed another episode to wrap things up well but didn't have one, or they could have had less pointless flashbacks and used that time. Yeah, there are pointless flashbacks. They show that events, that you've already been told everything you needed to know about, happened. Don't you just love filler? Another issue with the writing is that several serious moments get undermined by something really stupid. Like Setsuna mindlessly repeating the word \"gundam\" or talking about how he will become a gundam. \\n\\n\r\nThe cast of characters is unruly. There are far too many major characters and none of them are well developed. The most complex characters come off as two dimensional and the majority of the cast comes across as completely shallow. This is especially obvious when one of the characters dies and is replaced by someone who's almost exactly like him. There are several moments where the antagonists come across as being evil for the sake of being evil, rather like Captain Planet villains. This all makes it very difficult to get invested in the series or care about what happens to the characters.\\n\\n\r\nThe art is actually pretty good. The fight scenes are nicely done, although there are a few occasions of laziness here. (Two different coloured balls of light slamming into each other.) But overall the art is well done and nicely detailed. The gundams look spectacular and the backgrounds, though fairly bare, do work with the setting. \\n\\n\r\nThe voice acting is fine. It isn't anything spectacular or that stands out, but it does do its job. The music is the same way. \\n\\n\r\nThe yuri factor is a 1.5/10. There are some mildly homoerotic moments between Feldt and Chris in the beginning, but nothing substantial. \\n\\n\r\nMy final rating for Gundam 00 is a 4/10. It's a sub-par series. If you're a huge Gundam fan you'll probably like it fine, otherwise it's a lazy and shallow effort where the few good moments and well done action scenes can't make up for the weak story or uninspired characters.",
            "date": "2012-03-28T02:24:00+00:00",
            "helpful_count": 10,
            "mal_id": 57211,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=57211"
        },
        {
            "content": "This was quite disappointing and a big blow in quality compared to 00's first season. This second season takes place four years after the events of the first season where the three power blocs have united into a single nation and have dispatched a military force called A-Laws to wipe out terrorist cells and nations not involved with the new Federation. Their ruthless tactics, combined with the manipulations of a major baddie from the prior season, lead Celestial Being to reemerge to deal with both threats. Pretty much, this season is sort of a re-hash of plot elements from Zeta Gundam where you had aresistance group (AEUG) dealing with a corrupt branch of the military having considerable influence over the country's affairs (Titans). Only, this series is a bit of a mess with cohesively laying out its major elements for plot and characters.\\n\\n\r\nGundam 00 gets in the bad habit of trying to introduce and resolve as many elements to its plot and character elements as possible, including some that were left unresolved from the first season. Whereas the first season took its time on exploring these elements, Gundam 00's second season goes by at a much faster pace with its developments thus it lacks the time to properly explore many aspects to its storyline or character developments. This is especially notable in that this season attempts to incorporate some romantic developments with two of the Gundam Meisters. Because of the season's sloppy handling of developments and fast pacing though, these relationships felt unnatural and lacked credibility as they seemed tacked together just to advance the plot or create pointless drama.\\n\\n\r\nSpeaking of characters, having too many introduced was another problem for 00's second season. Having only 25 episodes for its run, character development and focus was quite limited here, especially when the show was mixing focus on re-introducing characters from the first season and new allies and baddies in season two to pose as a boon or hindrance for Celestial Being despite its length. The nice amount of depth and development for characters among multiple factions from the first season is quite limited, enough so where only a few supporting characters got reasonable developments yet had nothing to do with the major plot of the series on the threat of A-Laws and the Innovators. And just like the last season, the main baddie, in the form of Ribbons Almark, is quite shallow being another megalomaniac who thinks he's better than everyone and wishes to rule the world for self-absorbed reasons.\\n\\n\r\nWhile this second season of Gundam 00 retains the polished animated details and fluid animation from the first season, the action scenes also suffered quite a bit in terms of their execution here. In the first season, the Gundam Meisters would find themselves having to work together as a cohesive team in handling missions and dealing with enemy threats as all four had their specialty areas they fulfilled thanks to the differing capabilities of their Gundams, while also having the occasional foe capable of being an equal threat to them in combat. In this season though, the prominent use of the Trans-Am system and the addition of 00-Raiser to Celestial Being made for completely one-sided and uninteresting fights as the Gundams quite often found themselves relying on Trans-Am's abilities when in a pinch to plow through enemies. Plus when 00-Raiser makes its presence felt, it quite often comes in to save the day as Celestial Being is getting creamed against enemy threats, even against the much hyped Innovators who were supposedly the big major threats within this season.\\n\\n\r\nOverall, this second season to Gundam 00 was quite the disappointment compared to its solid first season. A combination of sloppy execution, fast pacing and deciding to go \"safe\" with handling its elements make this second season to 00 quite inferior to its first season run.\\n",
            "date": "2012-12-30T18:15:00+00:00",
            "helpful_count": 9,
            "mal_id": 82032,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=82032"
        },
        {
            "content": "This is a review not just of the second season but both 1st and 2nd seasons together. The reason I do this is because I consider many Gundam series like these to have 50 episodes like many of them do. So if you read my first review of Gundam 00, this is a modified/continuation. It's been a long run since Gundam SEED but this series was far better. Though I wouldn't say it was great, it didn't really disappoint me. The story of this series follows the same formula as Gundam Wing, bunch of girly looking guys piloting overly powerful mechs for a rebellious cause.So lets break it down shall we?\\n\\n\r\nThe Story of this series was decent. Political intrigue was great since that's what most Gundam series should have. Many of the Characters had okay back stories, but I'll explain them later, and the story didn't go off course. The problem I noticed is that though it had these redeeming features it still felt like I was watching Gundam SEED. It was excessively flashy. The Gundam concepts with Trans-AM and super beam sabers that can take down a fleet of ships just didn't make sense. They are never explained and seem so surreal. Any Gundam fan would agree that many of these elements were really unneeded, and the series would continue to flow even without those...\"things\". When the series began, the GN drives (the energy source of the Gundams) were rarely explained and just lead to more questions. The same goes for the whole purpose of the Celestial Being cause. We know they were a secret military force made by a man, Aeolia Schenberg, that was to fight off and prevent Wars. Whoopty doo... but it was nothing but plot holes that make you think what the hells going on, but if you have ADD you become distracted with the Flashy battle scenes instead of noticing it.\\n\\n\r\nThe Characters of the series is another topic I want to explain as well. Many of their personalities switch back and forth making your wonder what the hell is going on. Character development in this series isn't one of it's strongest points. Some characters never have any development at all, i.e. Allelujah Haptism. As the series progresses to it's final battle, their importance to the series becomes less apparent and all the focus changes to Setsuna. Yes, I understand that he is the main character but if I do recall this series is about 4 Gundam pilots, not one. And how is it that only Setsuna reaches the next step in human evolution but not the others, dam I just gave a spoiler. As I continued to watch this series, there was barely any serious interactions between characters. Oh, there was that one time that Anew...blah blah blah, that doesn't count. It's a formulated Gundam storyline, that's what it is. Yes I say this because I've seen it happen over and over again. \\n\\n\r\nArt and Sound, pretty well done. I like the designs of many of the mobile suits, and I can't wait to see the MSVs (Mobile Suit Variations) of them. I am totally digging the intros and end themes as well. I like UVERworld, and L'arc~en~Ceil. I always find myself putting them on my MP3 every time I turn it on. I would be a better music critic if I could but I'm just not that kind of person. Anyways, back to Art. Character concepts for all the characters were decent. Of course, after Gundam Wing, all of our Gundam pilots have to look like girls, just because to create a larger female interest in the series. I can totally see many of them end up in some Hentai or Yaoi magazine (pretty sure they already are), like those from Gundam SEED Destiny. Like I said of the Mechs, they are pretty cool, but like Gundam SEED they are really flash and seem to have so many unneeded attributes attached to their bodies. \\n\\n\r\nIn the end of all this epic sword swingin', trash talkin', and totally confused adolescence screaming, I was able to sigh in relief that the series was over. I knew if it continued any further, It'd probably change into it's own kind of monster. I did enjoy it, don't get me wrong. I would prefer this series over Gundam SEED any day. I wouldn't count on it as the best or greatest of the Gundam anthology. As far as New Gundam series it should bring in a lot of new comers for the franchise and probably have more people to talk about it, and I like that. I'm looking forward to the new Gundam 00 installment that's coming out next year if you hadn't herd, that's another spoiler I guess. What I am really wishing for is that they would reanimate the original series and air it on TV, calling it Mobile Suit Gundam HD Remix (Like Street Fighter II HD Remix Turbo, lol), like that will ever happen. My ending conclusion is, it's worth watching, but you'll know it's not something to die over, figuratively speaking.\\n\\n\r\nYours Truly\\n\r\nOtakufreak\\n\\n\r\nP.S. Don't be messin' with Zakus...",
            "date": "2009-03-29T19:14:00+00:00",
            "helpful_count": 8,
            "mal_id": 13584,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1722.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OtakuFreak",
                "username": "OtakuFreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=13584"
        },
        {
            "content": "By far the worst Gundam series i´ve seen and i´ve seen most of em.\r\nOf course now you´ll ask, why is that?\r\nI´ll answer that in a second, but i´d like to start with the Pros of Gundam 00.\r\nThe overall style of the pictures where quite impressive.\r\nThe look of the Series massivly improved compared to SEED.\r\nSomtimes even to beautyful. I´ll explain it later.\r\nIn addition the Soundtrak is really good.\r\nNow to the bitter part.\r\nFirst the Gundams themselves.\r\nThe most Gundams are totally ugly.\r\nIn fact, the only Gundam witch is even uglier than the ones in this series might \r\nbe the mustache Gundam (some poeple might know which one i´mtalking about).\\n\r\nFor example the two Matrjoschka-Gundams... no further comments.\\n\r\nOr the GN-Archer... why can this thing combine which Arios?\\n\r\nIt´s only used as a standalone-MS. It seems, that the only reasons why this thing can combine\\n\r\nwitch a Gundam is, because it can´t fly on it´s own, so somebody has to carry it to the battlefield\\n\r\nand the second, the studio just wanted something to gattai! (...)\\n\r\nOr this one´s good, too. Gundam Dynames of the first Season: \\n\r\nWhy does it have to move it´s Gundam-typical forhead decoration, when entering the sniping mode?\\n\r\nWhy not remove the thing, or splitt it, so the camera can look through the two halves?\\n\\n\r\nThe grunt-Mobile suits are ugly as well.\\n\r\nOf course, since i´m a Zaku-Lover most MS are ugly, but OO S2 tops everything in this matter.\\n\r\nEven if the most ugly MS i´ve ever seen was from S1, the FLAG.\\n\\n\r\nThe fights are just as boring as the suits are ugly.\\n\r\nIn S1 it all started with the Trans-Am-super-saiyajin-limitbreaker-gigadrill-whatever-thing.\\n\\n\r\nCome on! Can you imagine how much a Gundam has to weigh?\\n\r\nThere´s totally no way a Gundam like Exia can use Instant-Movement.\\n\r\nThats not cool, thats just a poor excuse to draw some beautyful glowing mechs.\\n\\n\r\nOr the anti-space-station-beam-saber of the 00...\\n\\n\r\nThe next thing is the whole Innvoator thing.\\n\r\nThey talked about it the whole time, but was actually relevant for the story?\\n\r\nNot really. It whould be the same if i whould declare, that i´m an innovater.\\n\r\nThe people whould look at me, with a strange expression, but the world whould spin on.\\n\r\nI think this whole story element was just brought in to have something, \\n\r\nlike Coordinators or Newtypes, some indicater wich let´s the audience know:\\n\r\n\"Hey, this person is special!\"\\n\r\nBut in the end, even if Setuna whould not be one, it had changed nothing,\\n\r\ncompared to Amuro, whose complete live change because he´s a Newtype.\\n\\n\r\nWhile we are at the persons:\\n\r\nAn other thing that bothers me, are the characters.\\n\\n\r\n-An heavy drinking strategist... yet no comment again...\\n\\n\r\n-A pair of schizophrenic lovers... \\n\\n\r\n (by the way, whould this be double-dating? or polygamy? or just stupid?)\\n\\n\r\n-The sterotype ladykiller-sniper, even in a doublepack.\\n\\n\r\n-And the classic masked villian... this one is my favourite!\\n\r\n Mister Bushido! What a name...\\n\r\n an american whose totally living up to a cliché samurai.\\n\\n\r\n-And of course there´s the pink haired songstress-princess, like in Gundam SEED.\\n\r\n Well, she´s brunette this time and actually she´s quite unimportant, \\n\r\n since everybody lives much happier,\\n\r\n when there´s lot´s of war instead of peace negotiations...\\n\r\n This whole peace through war or terrorism... just like in 00\\n\r\n it´s a reason why i dislike Wing, but thats an other topic.\\n\\n\r\nSummary\\n\r\nStory: 2/10\\n\r\nArt: 8/10\\n\r\nSound: 8/10\\n\r\nCharacter: 1/10\\n\r\nEnjoyment: 2/10\\n\r\nOverall: 2/10\\n\r\nWell, accually Overall whould be a 3 or 4 if i had a good day.\\n\r\nBut Sunrise showed often enough, that they can write very intense stories\\n\r\nand great character development.\\n\r\nBut since they were just to lazy to come up with something really great\\n\r\nor even decend, 00 lost two additional point.\\n\\n\r\nWell, i think that´s it.\\n\r\nThese are most of the reasons why i think that Gundam 00 is not just\\n\r\na hit in the face of everyone who loved the original Gundam series.",
            "date": "2010-07-20T04:24:00+00:00",
            "helpful_count": 8,
            "mal_id": 28669,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/290053.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Walkampf",
                "username": "Walkampf"
            },
            "url": "https://myanimelist.net/reviews.php?id=28669"
        },
        {
            "content": "Gundam 00 is a solid anime series with a lot to like. The pacing was fine, fights were exciting and you couldn't wait to see more. Since most of it is good for this review I will try something different, and state what was really good and could have been done better to elevate this series to Masterpiece status.\r\nStory and Characters\r\nGundam 00 Season 2 takes place after Gundam 00 S1. Celestial Being comes together again to fight against the A-Laws although the process of \"reforming\" was not an easy one. \r\nHere's what was great:-\r\n* There are 4 Gundam Meisters, 3 from Gundam 00 S1 anda new one Lyle Dylandy taking over from his brother as Lockon Stratus. All 4 gundam meisters are likeable and interesting. Thumbs up.\\n\r\n* Noreiga the strategist had to be rescued from her \"lover\" and her tendency to drown her sorrows in a bottle to resume her strategic battle for supremacy against Kati Manneqin\\n\r\n* Sergei Smirnov and Soma Peries ... aaah :)\\n\r\n* Cataron, Federation, Celestial Being, A-Laws, Innovators, Awesome!\\n\r\n* Lots of fights, characters evolve and the powers that be were not afraid to show death in the battlefield. Kudos!\\n\\n\r\nWhat was not so good:-\\n\r\n* Saji takes on a bigger role. Louise joins A-Laws, love is hard. I liked the whole how does this happen to a normal couple angle, but at parts I'm sure I'm not the only one who found Saji intensely annoying.\\n\r\n* Adding in many innovators but failing to develop the character, motivation or personalities of any of them. FAIL! Other than Ribbons I couldn't really distinguish between all the innovators and there were quite a few of them. Might as well have painted a \"cannon fodder\" sign on them and left it at that. Now, personally I believe if they cut out every scene with Marina Ismail and used the time to develop ALL the villians (including Mr. Bushido) this anime would have been a 10.\\n\\n\r\nArt and Sound\\n\\n\r\nArt was fantastic except when suits go into Trans Am they turn red and it becomes very difficult to distinguish who is fighting who and who is winning. Why can't they do Red Trans Am and Pink Trans Am so we can tell who is who? Sound Effects in general were fantastic too. Marina's song is kind of so so, the ED was good but the entire soundtrack lacked a cohesiveness that was evident in SEED.\\n\\n\r\nPlot Pet Peeve (not unique to Gundam 00)\\n\\n\r\nWhy is it when they have any type of combining units (like 00 and Raiser, or Zeta and Zeta 2 to make double zeta) why can't they launch it already combined instead of separately launching then wasting 38 seconds on the mega-exciting-combine \"Gattai\" sequence not to mention giving the enemy a chance to shoot down both units which are in the process of combining? Also when they return to the ship do they have to separate to go in, or can the combined unit go in then dock and then separate? They never show this. In any of the gundam series! It makes no sense whatsoever! Stuff like this drives me nuts, really and kind of kills my enjoyment of the show. Somebody please explain this to me, there must be a logical reason.\\n\\n\r\nEnjoyment\\n\\n\r\nOverall I thought this was very good. I couldn't wait to watch it and see what happened next. Parts felt rushed and bits were a waste of time. But it was pretty and the plot and characters kept me interested. I never felt like I \"HAD\" to finish this, instead I looked forward to it. I'd recommend every gundam fan watch this series as it is solid entertainment.",
            "date": "2009-08-11T22:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 17687,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stormy_77",
                "username": "Stormy_77"
            },
            "url": "https://myanimelist.net/reviews.php?id=17687"
        },
        {
            "content": "\" Eradiction of War through force.\" ~ the return of chaos\r\nI really like season 1. It has a good dosage of action, realistic characters, mech vs mech fights, and of course, a nice complex plot. Season 1 left us with many mysteries as well as many possibilities on the conclusion of the story, and that's why I'm looking forward to the second season with high expectations, but I think my expectations were a bit crushed since it was a letdown.\r\nWith a sequel comes new characters and new mobile suits balancing mecha actions with the plot development. The STORY starts out with a lot of potential.It's still jam-packed with actions and climactic scenes that will glue you onto your seats. It still manages to present multiple view points not just the protagonists’ – Celestial Beings and the antagonists’ – Federation, A-laws and Innovators but also the civilians’ through Saji and Marina as well as the children.\\n\\n\r\nAs the series progresses, it slowly starts to crumble. 2/3 of the series will still let you ask for more, but the succeeding episodes will slowly tire you out. \\n\r\nFirst, there’s too many flashbacks. They even presented the pasts of minor/ supporting characters resulting to redundancy of some scenes. Thus the story progresses slowly. \\n\r\nSecond, the series somewhat takes a new turn. Their reason for armed intervention is now different from the first season. Their mission now deviates from fighting for eradication of war to just fighting the real main antagonist.\\n\r\nThird, some of the battle scenes are a bit unrealistic. Like a gundam that has lost an arm and both legs can still defeat a gundam with just light scratches( something to that effect) . Also the first season will always let you doubt if they can finish the mission but now, the moment 00 arrives, it’s a sure win.\\n\r\nIt’s true that the content of the story is not the most original ( Gundam Wing and Zeta Gundam, anyone?) Even way back in the 90s, stories of gundam end rather predictably. But this second season manages to surprise us by ending up somewhere that we did not expect. I think that’s a plus ( or maybe not).It's more of an aburupt ending rather than a wonderful closure.\\n\\n\r\nThe ARTWORK remains cool. The mobile suits still gives a futuristic feel and can be commended for those intricate parts and structures. One minor quirk is that Gundam 00 is a bit similar to Gundam Wing’s Wing Zero when coupled with 0 Raiser which makes it not innovative in design. Kyrios and Ariois didn't seem different at all but Arios was a bit neat compared to its predesesor. Cherudim was just like Dyanames(period).The only notable factor was the big gun that's all. Seravee and Seraphim has a nice vibe although over shadowed by 00 and 0 Raiser.\\n\\n\r\nCHARACTER DESIGNS improved. I really liked Setsuna's matured appearance. The costumes are cool. The appearance of the other characters gives a feeling of maturity. Animation again is smooth and top notch! From the movement of the gundams down to the dispersion of the GN particles, it’s very detailed.\\n\\n\r\nThe MUSIC for the second season is good but nothing special. The 1st OP theme “ Hakanaku mo Towa no Kanashi” by UVERworld gives a pop rock feel – proper for a gundam series. The 2nd OP theme “ Namida no Mukou” by stereopony on the other hand is more proper to be placed on a shoujo anime instead of this one, but it still gives an upbeat tone. The 2 ED themes range from moderate JPOP to mellow which sets the mood for the closing sequence. The BGM suits the scenes and the sound effects are very detailed (such as movements of the grass…).\\n\\n\r\nThe CHARACTERS somewhat made a wrong turn. They gave too much emphasis on Setsuna thus there’s little room for character development on the other 3 Meisters as well as other characters. Setsuna still is gundam here gundam there in his head. but he was somewhat interesting for being able to mature so much as things unfold. His perception and his purpose starts to change. Good thing there's Marina to made him realize those things and to balance out, but I think Sunrise could have improved more on Setsuna's character if Marina's character wasn't poorly executed and made a twist on Marina's existence. I think it also wouldn't hurt to place a touch of romance on Setsuna.\\n\\n\r\nNext there’s Lockon Stratos. He still has the same personality as that of the first season, and it’s like nothing has changed. He sopmewhat has a contradiction. He doesn't want to be compared to his older brother but assumes his brothers position and code name. It would be better if they made it similar to Seed’s Mu La Flaga and Rau Le Creuset or Seed Destiny’s Lacus Clyne and Meer Campbell – same face but different point of views and personality. That would have a much better twist. His relation with Anew has a great potential but summing everything up about him made him an uninteresting character.\\n\\n\r\nAlleluja became a boring character simply because Halleluja, his alter ego , is not there to argue with Alleluja’s view. He became your ordinary kind-hearted protagonist without a twist or whatsoever in his personality. It will make you wonder whether he really should be placed under the \"main characters\" list. He spends most of the episodes chasing after Marie and his interactions with the other Meisters became redundant and dull. \\n\\n\r\nTieria Erde stays true to his character. Most of the mysteries around him are answered in the 2nd season. His character development is way better than that of Setsuna's. It would have been nice to see the developments rather than just accepting them. It's refreshing to see him mature but he was being overshadowed by other factors thus it kept him from improving further.\\n\\n\r\nThere's probably another dozen of characters with varying relevance. Like Saji and Louise's develpment didn't cover much of the main plot and would be better off without them. There are still actually loads of characters that pop up once in a while that holds little relevance. There's way too many extras that should have saved us a dozen or so episodes without them. \\n\\n\r\nThe antagonists could have used more character development. They should have created a feeling of dislike or hatred in your heart but some antagonist didn’t have this kind of feel. Well, Bushido, the fat Blonde and Ali-Al Sachees did kinda show their antagonistic vibe, but the main mastermind Ribbons Almark didn’t. He doesn’t care at all what happens, just domination in his head. Like a puppeteer with very very long strings not wanting to get involved.  \\n\\n\r\nHmm... I think they are trying to make a complex and exciting series by creating more characters, more antagonists for it to have more twists and turns but because it was poorly executed, it lead to the wrong turn of events.\\n\\n\r\nI still prefer the first season because it’s fast paced and more realistic compared to the 2nd season, but Gundam 00 2nd Season is still worth the watch. I think that I just have too high expectations on this anime, though. All in all Gundam 00 Second season is a fine addition to the ever growing and popular gundam saga. Despite the predictable plot , it still has its own charm and originality at some point. It shows us a different façade of an idealistic human truth, contrasting views about war and personal reasons for fighting. It’s already a few steps close to perfection too bad it’s potential just slipped away.\\n",
            "date": "2009-06-21T07:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 15948,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105486.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/srsng",
                "username": "srsng"
            },
            "url": "https://myanimelist.net/reviews.php?id=15948"
        },
        {
            "content": "The fact that I'm writing this review might seem a bit odd. Normally, whenever I have two seasons that have the same or very similar scores, I will just review them both at once. But here's the thing, people seem to have something against Gundam 00's Second Season, which confuses me as, to me, it's just as good as the first one. So this review will be just as much a review as it is a defense against what many of its haters have said.\r\nStory:\r\nOverall the Season reminds me a lot of Zeta Gundam. The parallels are pretty obvious: Celestial Being is the AEUG, theA-Laws are the Titans and so on. Many people complain that the show doesn't have the same moral ambiguity as the first Season, which is true. At the same time, I feel that had they done the same moral ambiguity, the show would feel like a retread of Season One, so I'm happy they instad decided to give the Season its on identity.\\n\\n\r\nWhile some of the themes of the last Season are dropped, many of the themes are still around, namely on whether or not conflict truly is the solution that will grant peace. There's also a bit of a focus on embracing things that aren't really true, best shown with Setsuna's over-idealized idea of what a \"Gundam\" is... and how it was born due to him admiring a man who secretly didn't give a damn about anyone and also was a massive dick with a God Complex.\\n\\n\r\nI also feel the Season is overall better paced than the first Season, it's silk a bit too fast, but overall it's an improvement nonetheless. Overall, while the lessens moral ambiguity is a problem, and the lack of an overall big twist of any kind is also a problem, I feel the good parts of the Season more than make up for it.\\n\\n\r\nCharacters:\\n\\n\r\nHere's the big one. For starters, Marina Ismail has been given a bigger role, unfortunately this just serves as a reminder of how annoying she is. I legitimately think she's worse than Relena. I will also admit that they did screw over Graham Acker, turning him into a generic Char Clone.\\n\\n\r\nThat said, I must disagree with the treatment of two characters: Lockon and Allelujah. While I can see why people would complain about the way Lockon is used this Season, I don't think it's as bad as people make it out to be. To explain, since the original Lockon died at the end of Season One, he's been replaced by his twin brother Lyle. While I can see why people would be angry about this, I don't mind this as much as 1) Lyle's existence had already been established, 2) He's not a complete cardboard copy of his brother and 3) I do feel he brings enough to the table for him to be likable, Hell, I'd say his relationship with Anew is one of this Season's highlights. As for Allelujah however, I don't see what people's problem with him is. Yes, he doesn't get much to do after the first ten episodes, but when you think about it, that's far more than what he ever got in Season One, in which he was a glorified background character. At least here he got stuff to do.\\n\\n\r\nI also think Tieria is better in this Season. He gets a lot of development due to his direct connection to the villains, refusing to accept that he's part of them and that he's human, before finally accepting himself for whom he is. I also think Louise and Saji are better handled this Season. They finally get involved with the main cast (They Really didn't have any more reason to sit in the sidelines) and their relationship I feel was also better handled this Seaon.b\\n\\n\r\nBut Season Two's greatest achievement is the main Villain: Robbins Almark, the single best big bad in the franchise bar I none. This man has a God Complex the size of Russia, and that's his entire motivation. He wants the world to bow to him as their God, and even if this isn't very relatable, he sure as hell is hatable for all the right reasons.\\n\\n\r\nAnimation:\\n\\n\r\nIt's more of the same. There's slightly more stock footage here, but not that much. The fights are still great as always, and this Season probably has my favorite final fight in all of Gundam. It's just amazing.\\n\\n\r\nThe Mecha:\\n\\n\r\nA much deserved upgrade over the last Season. While I didn't care much for the 00 Gundam or the 00 Raiser, I did quite move the Seravee and the Arios over their predecessors, and The Gundam Cheridium is just fantastic. Oh, and the 0 Gundam was cool too. And I particularly liked how it's literally the RX-78 with a GN Drive sticking out of its back.\\n\\n\r\nSound: \\n\\n\r\nThe soundtrack is as great as always. As for the Openings and Endings, similar to the first Season, I loved the first Opening \"Hakanaku Mo Towa No Kanashii\", but didn't care much for the rest.\\n\\n\r\nVoice Acting:\\n\\n\r\nAll of the cast comes back and does a great job as always. The highlight is obviously Furuya Tooru as Ribbons (He tried to use an alias to hide that it was him, but he ain't fooling anyone), pulling off his best performance yet. Even then, the rest of the cast does not leave much to be desired. We have Takayama Minami, Irino Miyu, Park Romi, Shiratori Tetsu and even the Late Great Ishizuka Unsho.\\n\\n\r\nOverall:\\n\\n\r\nSo yes, i disagree with the hate this Season gets. It's still the same great story with the same great characters. Some things are done better, some things are done worse, so it evens out for me. I still highly recommend watching this Season, if you can't tell.\\n\\n\r\nFinal Score: 9/10",
            "date": "2019-01-20T10:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 299575,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=299575"
        },
        {
            "content": "After binge watching the entire Gundam 00 series (including the 2 hour movie) I thought I would celebrate by writing my very first review. And what better place to begin in the Gundam 00 series than the very installment that began its downhill descent. \r\nI apologize in advance, as this will be less of an actual review and more of me nit-picking at each aspect that made season 2 slightly less enjoyable in comparison to season 1. While season 1 more or less established Celestial Being's role, season 2 delves even deeper and attempts to explain its origins. The ideas are fresh and promising butthe style of execution was not. \\n\\n\r\nThe story was not bad. A lot of the elements that made the previous season enjoyable (complex characters, well animated fight scenes) were still reminiscent. You have Setsuna and his crew dealing with new and highly advanced mobile suits while balancing the antagonists from the previous season as well as a new threat, the Innovators. Not to mention characters still tackling down the reoccurring theme of \"war is bad, we have to use force and we're hypocrites because we don't know how else to solve it.\" So yeah, you have some exciting new elements but at the same time you can't help but feel that most of it is a bit overdone. I'm referring to your generic 'have a problem, find enemy, battle enemy, level up' on a continuous cycle. While this issue was only minor in the first season, it becomes more problematic in this season because you have too much to discover, most of the episode time  allotted to fight scenes, and a huge cast that is rotating on screen time yet barely anything is learned about them. Which leads into what I'm going to discuss next.\\n\\n\r\nMy other biggest concern was with how they handled the characters. They used lots of screen time to introduce new characters but not so much towards developing them. What little development time they had was often rushed so it could transition into another battle scene. Not saying that character development can't also take place in that type of setting but having a one on one conversation is much different than shouting angrily from a mobile suit with bad communication lines. \\n\\n\r\nAlso without going into too much spoilers, I have to say that the most insulting thing you can do to a well developed character is to have them replaced with a carbon copy that looks and sounds the same but all under a different name and personality. Seriously? I thought Sunrise had more respect for their characters but I guess it's been proven otherwise. Don't even get me started on the romance subplots because some of them were just downright awful.\\n\\n\r\nI realize that what I'm saying in this review doesn't exactly match with my rating but I still thoroughly believe that Gundam 00 season 2 is enjoyable and worth your time if you liked season 1. While it's not as successful as its predecessor, the all around feeling of seeing the original cast return and 'grown up' is worth it.",
            "date": "2015-08-02T19:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 195024,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1526893.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sabaisms",
                "username": "Sabaisms"
            },
            "url": "https://myanimelist.net/reviews.php?id=195024"
        },
        {
            "content": "I am personally liked this anime. To tell the the truth, this is my first gundam anime that I watched seriously and this is also one of the best mecha anime that I had ever seen. \r\nThe story is unpredictable and the art of mechas were great. it can make you like it even you are never watch any gundam series before (of course except the 1st season, doesn't it?)",
            "date": "2008-12-27T16:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 10699,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111805.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yukiN",
                "username": "yukiN"
            },
            "url": "https://myanimelist.net/reviews.php?id=10699"
        },
        {
            "content": "The second series differs substantially from the first, and in my opinion, is the much stronger of the two on nearly all counts.\r\nPerhaps the most similar aspect of season 2 is the storyline's main arc, which is a straight-up continuation from season 1.  However, nearly all the characters are more developed now, and the smaller arcs within the main storyline are more substantive and more interesting.  Without going into too much detail, the overwhelming superiority of the Gundams in season 1 has come to an end, making the battles more nuanced, and the playing field more evenly matched. \r\nAlong with the better writing,the pace of 00 Season 2 is quite a bit faster, allowing for the individual characters' development to be seen more easily from ep to ep.  I found season 1 to drag on at times, and to be a bit slow and monotonous- and in season 2, I am happy to say that the constant barrage of action has finally been interrupted by intriguing drama and circumstance.  It brings to mind the sister anime, Code Geass, in a number of ways- which can only be a good thing.\\n\\n\r\nSpeaking of, if you like CG, you will probably like this series.  Sunrise was at their peak during both of these shows, and the audio and visuals are very similar between the two- and excellent in both.  Perhaps not quite the very best, but depending on your taste, they are right up there at the top.  The vastness of space and the richness of color on the ground are equally well-represented, with tons of symbolism to be found in various color choices and placements among the characters and Gundams.\\n\\n\r\nOverall, and without even finishing the series, this has become a top-tier favorite of mine in the mecha genre, surpassed by few others, and deserving of an overall score of 9.  With just a bit more depth, it would truly have been among the greatest.\\n\\n",
            "date": "2018-10-30T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 293021,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/j4mmin42",
                "username": "j4mmin42"
            },
            "url": "https://myanimelist.net/reviews.php?id=293021"
        }
    ],
    [
        {
            "content": "Now, I thoroughly enjoyed Gundam 00 Season 1. Great characters, great action, and best of all, a wonderful complex plot. Throw in a good dosage of how it relates the present day world and great voice acting, and you’ve got a recipe for one of the most popular series now.\r\nNow, Season 2 started out with a lot of potential. The main characters were reintroduced very well, preserving the characteristics they were known for and refining them, along with offering a slightly different side of their personality. Some characters did change for the worse, but this is necessary to create the strife needed for the storyto build. And it did build. A new faction came into play here, and some of the old characters on the antagonistic side in Season 1 are not happy with the new world order. New characters are introduced very well and immediately create a third side to the previous two-sided strife in Season 1. There are many characters that are struggling to find themselves in the new world order, so the series has a bit of a depressive feeling to it. Not even Lockon’s lighthearted comments helped much here.\\n\\n\r\nHowever, as well as the introductions to the new characters were, the development of many of these characters had something to be desired. It falls into the same trap that swallowed Code Geass R2, which is to let new characters languish in development. However, while R2 introduces too many characters and has to shift back and forth awkwardly between the factions, Gundam 00 introduces fewer new characters and makes the shifts amongst them much more fluidly, going for \"Let’s integrate all the factions into the episode\" rather than Geass R2’s \"focus here for one episode, focus there for another.\" 00 also focuses on the protagonists much better. The antagonists (that fat blonde guy), along with Bushido, along with the Innovators, could have used more development, but at least I got a better idea of their true personalities better than the Knights from Geass R2. If there was one glaring complaint about 00 S2’s characterization, it would come in the form of antagonistic development in the form of the true mastermind, Ribbons Almark. An antagonist is supposed to create a feeling of hatred in your heart, or you fall for the antagonist’s plot and cheer on the protagonists’ failure. But the main feeling I get from Ribbons is ambivalence. \"Your comrade just got killed.\" *no emotion* \"You just got betrayed.\" *no emotion* \"Your test subject just wrecked your newest Mobile Suit.\" *no emotion* \"Your plan to take over the world has caught a HUGE snare.\" *Whatever* All he does is sit on a MAGENTA couch and twiddle on his thumbs, no matter if his plans succeed or fail. For someone who’s the mastermind, he doesn’t like to get involved much, like he’s a puppetmaster with really long strings on his puppets. Problem is, he feels disconnected from the plot and action, and well, let’s just say that 00 S2’s biggest fault after this is plot management.\\n\\n\r\nNow, the first… 2/3 of the series was developed very well. We get to see the main characters discover a different side to themselves and we are able to supplement the change with what we know about the characters in season 1. But after that, the series starts to stumble. The audience is waiting for a return of aspects that distinguished the characters from season 1. In creating a different dimension for the characters, they gave up the platform built up for the characters in season 1. Like Hallelujah, whose reintroduction was too sudden.  Welcome, but not well done.  Thus, after about the 2/3 mark, the series starts to wander and lose its footing. The focus is on little plot elements that need time to develop, but the producers only had so many episodes of plot to work with. Thus, the big plot elements were placed on the back burner and left to overcook. The series has to rush to resolve these big issues, but didn’t get to do so until the last 3 episodes or so, so it was a miracle that episodes 23 and 24 didn’t feel too rushed. What would have been nice is if they started focusing on these big plot elements around… episode 20 or so? But it’s no big surprise that episode 25 felt like you were landing an airplane but hadn’t slowed down enough. You do stop, but all your passengers are thrown 2 rows forward in your attempt. The series was haphazardly wrapped up as a result.\\n\\n\r\nBut don’t get me wrong: Gundam 00 S2 is still worth your time to watch if you enjoyed S1. There’s still a lot to like, such as the more complex story, matured characters, and many characters just finding their true selves during their personal struggles. I’m not sure if I just expected too much, though. It’s still a likable series, but it just tossed away its potential for becoming a masterpiece about 2/3 of the way in.",
            "date": "2009-04-09T13:46:00+00:00",
            "helpful_count": 97,
            "mal_id": 13995,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58587.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Goldeneyeuro",
                "username": "Goldeneyeuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=13995"
        },
        {
            "content": "The conclusion of the first season left a bad taste in my mouth. That taste stayed throughout the entire second season, but by the end of it, I'd gotten so used to it that I didn't care anymore.\r\n(This review assumes familiarity with the first season of Gundam 00 and references several season one spoilers. Season two spoilers are hinted at but not explicitly stated.)\r\nSTORY - Gundam 00 had a precarious premise from the very beginning. The \"war to end all wars\" story is one that seems to be visited often, but because it's such an idealistic goal, series pursuing it always stand on a shakyfoundation of logic and realism. As a result, it's a very difficult premise to execute well. One of biggest logical gaps for me is still the idea that Celestial Being's two hundred-year old technology can be superior to that of current-day armies, especially since Celestial Being itself seems to have a very poor understanding of the machines they're making use of. Instead, they are reliant on a supercomputer and the notes and secret power-ups passed down to them by a dead man. All of the questions I had from the first season surrounding the organization's conception and survival over the last two centuries remain unanswered for the most part, but the most frustrating thing was not knowing the ultimate purpose of CB until the series' finale.\\n\\n\r\nIt blows my mind that most of the characters didn't even seem to know exactly what the \"real\" purpose of their organization was. It's one thing to keep the audience in the dark, but seriously, even the characters didn't know? Yes, everyone fights for their own reasons, but if you're part of an organization, you should maybe know what they're up to. Just sayin'. The antagonistic Innovators are introduced this season as the new puppeteers of the world, along with their half-puppets, the A-Laws. Presumably, they know what's going on, but since the point of view of the story follows the members of Celestial Being more than the Innovators, the story becomes very reactionary. CB is trying to do this to stop the Innovators from doing this. CB does this because the Innovators are going to do this. But why should the audience care if they ultimately have no idea what anyone's fighting for? The goals from the first season seem to have gone to the wayside somewhere along the way.\\n\\n\r\nThe flimsy storyline also contributed to an entire season of awful pacing marred by way too many romantic subplots. Seriously, could there possibly have been more of them? It didn't take long for 00 to feel like one gigantic soap opera that just happens to take place in space with some kind of war going on in the background. In fact, I'd venture to say that the romantic storylines and drama were the main focus and the war, morals, and fate of the universe thing was the secondary subplot. Who will get Setsuna in the end? Marina or Gundam? Can Lyle save Anew from her overused mind-control plot device? Will Tieria ever be able to win Veda back from Ribbons? Will Allelujah ever actually do anything important in this series or say a word other than \"Marie\"? Will Saji ever stop being spineless, and will Louise eventually accept him again or just go to Andrei instead? Can Billy forgive Sumeragi for using him? Can Shirin and Klaus both survive to the end of the series for their happily ever after? Will Mr. Bushido ever give up on Setsuna? Will Patrick ever win Kati's heart?? \\n\\n\r\nIt. Is. Ridiculous. To be honest, most of the relationship drama (romantic or otherwise) in 00 had the potential to be interesting, but the fact that there was so much of it limited the relevance of each individual subplot and put a huge strain on the viewer's ability to care, especially with an unclear central plotline to tie everything together. The conclusion of the second season and the series as a whole is just as bad as, if not worse than, the first season's ending. It felt similarly rushed, extremely anticlimatic and unrealistic, and didn't resolve nearly as much as I would have wanted. Many of the characters feel stranded at the end of the series, though you do get a resolution for most of the relationship nonsense, further supporting the idea that the relationships were the core of the series and that everything else was secondary. As far as the politics go, it was definitely more of a forced ending than a conclusion. A conclusion implies that things are actually concluded. \\n\\n\r\nCHARACTER - With a few exceptions, most of the first season's gigantic ensemble cast returned for the second season's \"four years later.\" A new season really wasn't necessary just for a timeskip, but it was still really nice being able to see Setsuna age. He's the most interesting character in the entire series just because he matures so much as events unfold, and even as he doubts himself, his motivation, and purpose in the world, he never falls into the trap of the Jesus-kun Syndrome -- when a character becomes a preachy moralfag and refuses to kill people, often accomplishing this by disabling mobile suits in battle instead of destroying them. That isn't to say that having morals and a conscience makes for bad characters, but I find it refreshing when the morals and conscience can coincide with the resolve to fight and the knowledge that killing is sometimes necessary. Rather than instilling the pacifist streak in Setsuna, Sunrise made a good decision in having Marina around to balance things out. As irritating and useless as she was most of the time, I think she was necessary to round out the points of views in the series; that is to say, she was a good idea, just poorly executed.\\n\\n\r\nLyle, the new Lockon, felt like a huge cop-out from the beginning. Sunrise actually succeeded in killing a character! ...But here's his identical twin to replace him. Great. It didn't help that they never utilized the \"twin\" or \"brothers\" aspect to the best of its potential, and Lyle's logic failed on so many levels. He did not want to be compared to his brother, but essentially agreed to take over his brother's previous identity when he joined Celestial Being by taking on his old codename, his Gundam, and his Haro. Lyle's romantic subplot with Anew was one of the ones that had the most potential, and there was a lot of good acting as far as Lyle's inner conflict and reactions went, but in the end, I don't think his character evolved as much as it could have, and static characters remain uninteresting.\\n\\n\r\nAllelujah was amazingly disappointing throughout the second season and pretty much drops off the map after episode seven. You wonder whether his role as a Gundam Meister actually makes him a \"main character\" or not since he dwindles to the point where he doesn't even have any speaking roles for several episodes at a time. Since Hallelujah supposedly \"died\" for one reason or another, there wasn't anything in the way of personal conflict. Instead, he spends the whole time chasing after Marie/Soma Peries. Unfortunately, Allelujah/Marie interactions are idealistic and boring while Allelujah/Soma interactions are repetitive and boring. Marie's struggle with Soma and Soma's struggle with belonging and revenge are interesting for many of the reasons the Allelujah/Hallelujah struggle was last season, but the character(s) could have stood well enough on their own without the obligatory romance/attention of Allelujah. Really, Allelujah probably brought them down by turning it into a cheesy would-be romance rather than the revenge/moral conflict it should have been.\\n\\n\r\nRounding out the Meisters, Tieria changed a lot between the first and second season. It would have been nice to be able to actually see that progress rather than just accepting that development had happened, but it's still refreshing to see characters that actually grow and change, and Tieria does continue to mature. Throughout the second season Tieria struggles with the fact that he's an Innovator and his role in both Celestial Being's and the other Innovators' goals. On the most basic level, it's probably the most interesting of the Meisters' conflicts, usurping even Setsuna, but poor execution, lack of attention, and being constantly thrown back by a dozen other subplots kept it from really succeeding, especially at the end. \\n\\n\r\nAs previously mentioned, there are probably two dozen other characters all with subplots of varying degrees of depth and relevance. Saji and Louise's is especially prominent, but the themes of their relationship cover very little that one of the others doesn't already, especially now that they're both directly involved in the fighting and are no longer bystanders. Neither of them are particularly strong or interesting characters, and I still think that 00 would have been better off without them. It would have probably saved us about ten episodes of drama. There are also still an assload of characters aside from those listed above that make appearances at random, but aren't actually relevant to anything anymore. Ali Al-Saachez will pop up again every seven or eight episodes. As will Nena Trinity, who really should have just died in the first season with her brothers. And as will Liu Mei Wang and Hong Long, who really do anything at all the entire season. All of the Innovators aside from Ribbons are pretty much interchangeable, and even Regene didn't seem to mean much in the end. \\n\\n\r\nARTSTYLE & ANIMATION - The animation in the second season remains slick, and the battles are all relatively fun to watch. I really missed the Gundam Exia's design, though the 0, 00, 0-Riser, and 00-Riser are all pretty interesting as well. I didn't think the Arios was much of an improvement over the Kyrios, though honestly, you don't see Allelujah in action enough this season for his suit to really leave an impression on you. The GN Archer, which actually had a neat design, could have also been featured a lot more. Seravee and Seraphim also had a nice concept, but like the others, was ever over-shadowed by the 00 and 00-Riser. And the Cherudim? As with the Dynames, the prominence of the gigantic rifle made the rest of the suit less important, but even visually, the Cherudim was less to look at than the Dynames.\\n\\n\r\nThe updated character and costume designs did a lot of good, I think, and I'm fond of Setsuna's older appearance. The only new characters that are introduced in the second season are the score of Innovators. They come in pairs with hilariously punny names like \"Revive Revival,\" \"Anew Returner,\" and \"Bring Stabity.\" They also come in a variety of colorful flavors! Way to make it easy to spot the plot devices hiding out in the army and in Celestial Being, guys. There had to have been a better way to illustrate the concept of a race superior to humans without making it ridiculously obvious, right? The ease at which it is to spot these characters also makes the montage at the end of the series open to a lot of debate, but I really just think Sunrise is trolling us at that point.\\n\\n\r\nMUSIC - The music is probably what I ended up enjoying the most in this entire series. I didn't much care for the second season's first opening and ending themes, but chalk that up to my general indifference to UVERworld and Chiaki Ishikawa. Neither are terrible songs or particularly annoying -- just not my thing, I suppose. The second opening and ending, on the other hand, are probably why I even bothered to sit through some of the later episodes since neither of the singles had released at the time. \"Namida no Mukou\" by stereophony actually took a while to warm up to me because I found the timing awkward in many parts, but I loved the vocalist's voice and the energy in the song is just fantastic. \\n\\n\r\nMeanwhile, I loved \"trust you\" by Yuna Ito pretty much immediately. I'd only listened to a few of Ito's songs prior to that, but \"trust you\" just blew me away. The melody is beautiful and the steady tempo really carries it through. Furthermore, the accompanying animation was gorgeous and well-timed to fit with the music, and it left a wonderful contemplative feeling at the end of each episode -- more than most of the episodes deserved. It was also a great follow-up the animation for the second ending of the first season, \"Friends\" by Stephanie. There are a few episodes that end with a brief a capella version of \"trust you\" that I found really unnecessary and awkward, but the song itself is great.Oddly enough though, I like the TV Cut much better than the full single.\\n\\n\r\nTommy heavenly6's \"Unlimited Sky\" is used as an insert song for some of the later episodes, which was also pretty awesome. I adore Tomoko Kawase's voice in general, but I always find her anime songs much more energetic and upbeat than her other work, and \"Unlimited Sky\" is no exception. It always made the battle scenes that much more exciting -- a very needed extra when you're having a hard time caring about the characters involved or the storyline at the time.\\n\\n\r\nLastly, the instrumental soundtrack for 00 seemed markedly improved in the second season. The leitmotifs are a bit more prominent and the music in general seemed to compliment the mood and feeling of each scene a lot better. It was really refreshing to see/hear something actually improve between the seasons.\\n\\n\r\nVOICE ACTING - Average for the most part, though I suppose Shinichiro Miki gets special mention for some excellent acting involving a very emotional Lyle, and Noboru Sougetsu (Ribbons), for managing to not remind everyone of Amuro Ray, at least most of the time.\\n\\n\r\nThe dub is still pretty awful. The best of the dub cast is Brad Swaile as Setsuna and maybe Alex Zahara as Lyle; both are pretty average. The rest of the cast either sound painfully uninspired or just... the same. Half of the female characters in this series sound the same in the dub. It's must be pretty bad when I'm offended at how poorly done the voices are for even characters I don't care about (which, in 00, is most of them).\\n\\n\r\nOVERALL - When I reviewed the first season of Gundam 00, my main complaints included the fact that they had more details than structure, that they didn't bother to explain a lot of what I would consider to be important backstory, and that there were far, far too many characters, all of whom were trying too hard to be the focus. The lackluster ending to the first season didn't lead me to have a lot of expectations for the second season, but I'm still rather disappointed that they managed to let all of their problems get worse rather than better. In the end, I only saw 00 through to the end for the sake of having seen it to the end, which is never a really good reason at all. Then again, maybe I only saw it through so I could eventually bitch about it here... which really isn't that great of a reason either.\\n",
            "date": "2009-06-17T18:32:00+00:00",
            "helpful_count": 85,
            "mal_id": 15842,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kiriska",
                "username": "kiriska"
            },
            "url": "https://myanimelist.net/reviews.php?id=15842"
        },
        {
            "content": "Gundam 00 season 1 was for me an instant classic. It combined a great story with excellent action scenes. Also all the characters were realistic. They had a past, motives, weaknesses etc. Needless to say I was looking forward to the second season. After watching 23 episodes I decided to write this review, because I think season 2 is a letdown.\r\nThe re-introduction of the 4 meisters is wonderfully done. After that the story just won’t startup. Half of the season is dedicated to explain in depth why some characters are fighting. Because of this, the main story progresses really slow. The action scenes are notas good as the previous season. In season 1 it was 50% teamwork and 50% strategic planning. I was always wondering if the mission would be a success.  Now it’s 70% gundam 00 and 30% rest. So when 00 arrives you know they’ll win. They have put too much emphasis on gundam. The other gundams and characters don’t get the time to fully expand them self. \\n\\n\r\nThe story itself takes a new path. The new theme is “innovation”. I think it’s a bit confusing, because it is combined in the plan of Aolia. At this moment I am still not sure what the plan of Aolia is, or if it is still his plan. Also the reason why they are fighting in this season is different. I feel that they are not fighting for world peace through armed intervention anymore. Let that be a reason why I liked the show. They were willing to sacrifices themselves for a better world. Now it feels that they are fighting the new main antagonist and not for a better world. \\n\\n\r\nThis season focuses more on Setsuna and gundam 00 than any of the other characters. Too bad that he is boring. The only thing on his mind is gundam. In one episode he says:  “Ore wa gundam”. That sums up Setsuna a soulless machine. I think he is the wrong character to put so much emphasis on. It wouldn’t hurt to give Setsuna some romance, to give him some emotions. Tieria is one of the characters that remains interesting. The new lockon feels like a cheap replacement, because he walks, talks and acts the same as the original lockon. If they had the balls for it they would have introduced a new meister. The good thing about the new lockon is that he feels different than the old one. Allelujah was one of my favorite characters of the first season. It was refreshing to see a mentally ill main character. In the first season he was a psycho unpredictable crazy fighter, now he is a boring you-wont-even-miss-him whiner. Without the aggressive hallelujah he is boring and I have lost all interest in this character. \\n\\n\r\nWith the introduction of a new antagonist he also brings with him around 8-10 high level enemy opponents. With “high level” I mean that they have a better gundam and don’t die within 1 blast/fight. All these opponents are arrogant, dull and boring. Not once did they reach the level of season 1 opponents, for example Graham Acker, Ali El-Saachez, Andrei Smirnov. These characters were interesting and they all had their own reason to fight. The new opponents are boring and uninteresting.\\n\\n\r\nSome important characters from the first show return, but I think they should’ve stayed dead. They play some role (most an annoying part) in the first half of the show, only to disappear for 8 episodes. And then reappear again at the end. During their disappearance you have not missed them once.  These roles could have easily been filled by the new enemies of this season. I am wondering why they even made these characters return.\\n\\n\r\nConclusion\\n\r\nI liked the first show because of the realism. The gundams were not that overpowered, the action scenes were exciting, the story was an original and interesting set of protagonist and antagonists. In general, every episode made you want more. After a couple of episode my excitement about season 2 was over, it no longer made me want more after every episode. Mostly because the characters are not interesting anymore. The new enemies are boring. The story progresses slow and I still have no idea where the show is heading. I am not saying this is a bad show, just that it is not a worthy successor of gundam 00 season 1.\\n\\n\r\nI give it a 75 out of 100.\\n\\n",
            "date": "2009-03-18T17:36:00+00:00",
            "helpful_count": 61,
            "mal_id": 13294,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64518.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BaggyGorilla",
                "username": "BaggyGorilla"
            },
            "url": "https://myanimelist.net/reviews.php?id=13294"
        },
        {
            "content": "(Phase one)\r\nI am not into Mecha anime, truth be told this is the 1st time that I've tried to watch a series on the Gundam franchise that is produced by Sunrise-Bandai&trade;...\r\nI expected it to be the same as the other Gundam series but I was proven wrong...\r\nAfter seeing the 1st season, I was so surprised at how this series turned out. I expected myself to drop this after watching a couple of episodes but instead I was drawn in to watch it up to the end, it has all the elements needed to create a precise and successful series...\r\n(Phase two)\r\nInteresting plot, complex storyline, excellent characterdevelopment, and outstanding visualization... The animation itself is clear and very detailed...\\n\r\nI tried to watch some Gundam series before but after 2-5 episodes I find my interest draining away, one thing that I've observed is that compared to other Gundam titles this series so far is the easiest to understand...\\n\\n\r\n(Phase three)\\n\r\nI mean when I watched other Gundam titles in the 1st or 2nd episode, they introduce many Gundams with their corresponding models like Gundam Zeta, Gundam ZZ, Gundam Type Z-0, etc. etc.. \\n\r\nSomehow it seems like instead of becoming interesting, it became a show-off for Gundam models and sometimes it will become confusing while you watch it, I mean it's like, &quot;What's this Gundam, why does it look the same as that Gundam?&quot;\\n\r\nSo in the end it is not interesting at all...\\n\\n\r\n(Final Phase)\\n\r\nBut Gundam 00 is really great, I must admit that they did a good job on this series. For someone like me who is not into mecha anime I was definitely surprised, at the ending of the 1st season it left me an impression that the good part is yet to come. After seeing the 1st 3 episodes of the second season I could say that this is definitely going to be much more interesting, much more complex, and much more developed than the 1st... \\n\r\nSo brace yourself on the second season, from the look of things this is going to be another epic...\\n\r\nThis season is a promising one... And I guess it's worth the wait! Tee hee~ :3\\n\\n\r\n(Operation Review - Mission Complete)\\n\r\n:p",
            "date": "2008-10-23T04:31:00+00:00",
            "helpful_count": 44,
            "mal_id": 8878,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74807.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Rhaineleen",
                "username": "Rhaineleen"
            },
            "url": "https://myanimelist.net/reviews.php?id=8878"
        },
        {
            "content": "If you saw Gundam 00 season 1 and you liked it, you probably wanna see season 2 as well.\r\nBut Gundam 00 S2 is crappy as hell (aside from the good looks.. the production value was top notch).\r\nI have to admit that I liked Gundam 00 S1 (except for the ending).\r\nGundam 00 S1 focused a lot on the plot/action and because of that, the character development got neglected.\r\nBut that didn't matter, because even with the 1-dimensional characters, it was still an interesting and exciting mecha anime.\r\nHowever in Gundam 00 S2, 'they' tried to 'spice up' the character development a bit.\r\nThey totally froze the storytelling and decidedto focus (a lot more) on the characters.\\n\r\nBut they failed miserably!!! The characters didn't come 'alive' one bit!!!! \\n\r\nThe result = crap.\\n\\n\r\nHell.. what annoyed me the most were the things that just didn't make sense.\\n\r\nFor example the 'couple': Louise and Saji.\\n\r\nSaji discovers something (very) important about Louise's tragedy (spoiler?) and 'every' viewer knows Louise should know about this.\\n\r\nBut for some reason whenever Saji meets Louise, he NEVER discloses this important information to Louise.\\n\\n\r\nWhat we get instead is a lot of shit dialogue like: \"Saji..\" \"Louise!\" \"Saji!!\" \"Louise!!\"\\n\r\nThe same with Setsuna.. awww .. I'm not even going to start with his \"Orewah Gundammmuhhh\" dialogues/monologues...\\n\\n\r\nIn short.. Gundam 00 S2.. was bad.. very bad.. compared to season 1..\\n\r\nThe story became predictable, the (romantic) character development was crap, some unimportant characters died, \\n\r\nbad guys didn't actually die in season 1, you get spammed with loads of new characters, \\n\r\nRibbons 'bitch-slaps' female characters and they 'endure' it *cough*.. and so on...\\n\\n\r\nBut anyways .. loads of you brainwashed *Gundam-lovers* will probably love this show anyways.. \\n\r\nSo... enjoy the sequel you guys.. :|\\n",
            "date": "2009-03-29T17:02:00+00:00",
            "helpful_count": 44,
            "mal_id": 13581,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64671.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kozooo",
                "username": "Kozooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=13581"
        },
        {
            "content": "This review will focus on both seasons of Gundam 00.\r\nMobile Suit Gundam 00 is the latest installment in the incredibly massive Gundam franchise produced by Sunrise. This is also the first Gundam series I watched so I will not go into differences to other Gundam series that I see so many of the older fans do.\r\nStory: Most of the story on Gundam 00 is based heavily on war, the countries who suffer from oppresion, the people who want the war to stop, and the corrupt goverments who control the people. To be quite honest I wasnt crazy with the story but I also didn't dislikeit, i thought it showed a pretty realistic view on how a corrupted goverment and military organizations can cause the murder of millions for their own benefits and yet still keep their citizens unaware and/or on their side while they do so. I wouldnt lie if I said I saw a little bit of parallels with what is happening in the world today, but thats for another time.\\n\\n\r\nAnimation: The animation stayed constantly solid the entire series and it had some really cool and flashy effects during battles which made the show a real graphical beauty. Also watching this on HD 720p really makes you appreciate the effort put on the animation. I have nothing bad to say this. Although I will admit some gundam designs on the second season were getting a bit weird....\\n\\n\r\nSound: One of the great aspects of the series was its very varied and good soundtrack. It made a lot of the battle scenes very exciting to watch. The voice acting was also very well done, and i really enjoyed it. A lot of \"pew pew\" also made me XD\\n\\n\r\nCharacters: Gundam 00 has an incredibly huge cast of characters which some I never even managed to remember their names, there is a large variety of characters that you learn to love or hate in this show. I personally was able to enjoy the characters and being able to see them mature while adapting to the changes in the world was very enjoyable. Even though the show gave the short end of the stick to some of what I thought were very interesting side character with a lot of potential, and gave us some character that I just absolutely detest and hate, Gundam 00 did a good job on giving us interesting characters.\\n\\n\r\nEnjoyment: I loved this series mainly because of the battles, the battles are definitely the best part of the anime and there is plenty of them so I always went into every episode looking for some great action and Gundam was able to deliver that every time.\\n\\n\r\nOverall: There really isnt a reason to not like this show, it is a solid mecha action anime with some solid plot and characters and features some great animation to boot. If you have never watched a Gundam anime before i think this one is a good one to start watching, I had never watched a Gundam anime before but I for one am now a fan of the series and will definitely be watching the upcoming gundams from now on.\\n",
            "date": "2009-03-30T10:49:00+00:00",
            "helpful_count": 29,
            "mal_id": 13613,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/23773.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/game8910",
                "username": "game8910"
            },
            "url": "https://myanimelist.net/reviews.php?id=13613"
        },
        {
            "content": "The anime pretty much re-establishes its cast and its more central on the characters this time as opposed to the politics. I thought the politics of the first season were a nice twist and offered something different in comparison to the other Gundam series where they don't directly state modern day politics. But due to the events in this series, that factor has been conveniently written out. But does it make it up by being more character centric? In some ways, it can. But I still personally feel that the 25 episode format is still a major weakness for this series, especially if its aGundam one. Since most of the major characters are back, the story is also allowed to be more fast paced. But the problems that it gave season 1 are still presented here. I felt they could have used Mr. Bushido more, as well as Ali Al-Saachez. This series does have a handful of characters and the 25 episode format just doesn't give any external characters such as those two the presence I felt they needed and deserved. And like season 1, I just felt it really rushed things and I felt with more episodes, we could have seen things much longer and I think it would have been given proper presentation. Not only that, I felt with more episodes, i think we could have seem more of Seraphim as well in addition to Nadleeh in season 1. With 15 to 25 more episodes, I think 00, especially season 2, could have reached its full potential. \\n\\n\r\nI have nothing much to add about the art and animation that I've already said in my review of season 1, but I'll acknowledge a few things. I do like how the series makes Setsuna properly older by not just making him taller, but they made his face properly thinner, and they spreaded out his hair a bit, and made his eyes somewhat smaller. So I thought that was a descent touch to make him look 20 or 21, or however old he's supposed to be. But I'm very surprised at what they did with Saji, and how they aged him. I thought that was done very well. \\n\\n\r\nAs for the designs of the Gundams, well, they're pretty much more or less the same froms eason 1, except they now have the grilled mouth plates while in season 1, they didn't have the grilled mouth plates. But other mobile suits that come in later on, especially at the end, are pretty nifty and fresh. \\n\\n\r\nAs for the quality in HD, I saw this one Blu-Ray at a friends house, and its pretty sweet. As for the action, it does get a bit DBZ-ish. Especially when the Trans-Am system now being introduced. I'll admit in its own way, it is distinctive in comparison to other Gundam series, but i just felt that feature just made it too Shounen-esque. I'll admit the first time, at the end of season 1, it was awesome. Yes, it does make it more intense, but I just felt it was really abused.  I think using it like once or twice as opposed to using Seraphim once or twice could have been better. \\n\\n\r\nWell, what I've already said about the quality of the voice acting in season 1 can be applied here as well. I watched this series on bluray with a buddy of mine, and sadly, there was no dub included, but I do have intensions of seeing this dubbed when I can. The background music from season 1 is still utilized, but the soundtrack is of course slightly different. \\n\\n\r\nThe opening themes are not really dark from season 1, but are still striking in a different way that represents the tone in their own way. Uverworld sings the first theme, Hakanaku mo Towa no Kanashi and one of my favorite singers, Ito Yuna, sings Trust You, one of the ending themes. I'm sure Japanese music buffs will enjoy the soundtrack whether or not you're a Gundam fan. Hell, I hated the Cosmic Era Gundams, but I still dig their soundtracks. \\n\\n\r\nIn the end, if you liked season 1 for its politics, then unfortunately, you won't find it here, but those features I felt were taken out for the right reasons, but the overall atmosphere doesn't significantly change which is what still kept me hooked. Still, I think it's the true Gundam of the 21st century as opposed to SEED. I do hope to see more of Gundam based on this series. I think it has a lot of potential. I still think there are unanswered questions and the universe of this Gundam has me curios. So I hope more material comes out soon. \\n\\n",
            "date": "2010-03-04T13:31:00+00:00",
            "helpful_count": 23,
            "mal_id": 23715,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ParaParaJMo",
                "username": "ParaParaJMo"
            },
            "url": "https://myanimelist.net/reviews.php?id=23715"
        },
        {
            "content": "Let the inspection begin.\r\nAt this point, it’s fair to say that if nothing else, the second season of Gundam 00 doesn't surpass the first. It is a mangled piece of machinery from beginning to end. The only salvageable aspect would be the fairly decent audiovisuals that got carried over from the first season. The animation is fairly nice, particularly with the flashy fight scenes. The new designs aren't quite as good as in season one, but are still serviceable as well. There's little to no noticeable CGI, and there is a notable improvement in the mecha designs. Additionally, the few new tracks they added infor the OST are pretty decent, notably, the episode preview theme, though it isn’t up to Kenji Kawai’s standard when compared to say, Ghost in The Shell or Musekinin Kanchou Tylor.\\n\\n\r\nUnfortunately, this is where the positive reports end.\\n\\n\r\nThis virus-infected scrap heap wages a war against nearly every surviving character from season 1. Thankfully, there are a few that come out relatively unscathed. We have Col. Smirnov, who managed to stay likable across both seasons. There's Ribbons Almark, who remains static and boring despite his role as the main antagonist. Wait, shit, we're running out of positive examples. Lastly, there's Setsuna, the main protagonist who is as static as ever. That is quite literally it. 3 characters...out of around 20. Christ. Everyone else gets their personalities and/or relevance hampered with to varying degrees. Let's take it from the top.\\n\\n\r\nNow that he's relevant, Saji becomes an intolerable Kira Yamato knockoff for half the season ( as if that invincible beam spam machine wasn't dreadful enough). Thankfully we only have to put up with this for half the show, as he's later reduced to a standard Gundam protagonist when he and his arc take a backseat. His girlfriend, Louise, undergoes a drastic personality change from what was once a sulking mess to now a person that borders on complete lunacy. While there's a plausible connection between \"I lost my family to a Gundam\" and \"I'm insane and I want revenge\", neither of the two seasons tried to connect these two states of mind. I get that people change over time, but this season doesn't show us any of that change when even a small flashback montage could have sufficed. On top of that, the personality change is so extreme it's impossible to take seriously. As it stands, Louise is an annoying lunatic that doesn't even suffer any repercussions for her actions. Somehow, she isn't even the worst case of personality switching, as Soma Pierez, goes all over the place at the drop of a hat. \\n\\n\r\nAs mentioned earlier, important characters often saw their relevance dwindle. No character represents this more than Allelujah, one of the main protagonists of both seasons. He gets sidelined so hard he barely even exists after his arc ends in the 6th episode out of the 25 that exist. Keep in mind, he and the characters mentioned previously were some of the most notable characters across both seasons. Even Gundam SEED Destiny, the same show that downright ruined one of the best characters in SEED, solidified Kira Yamato’s Gary Stu status, and made his friend and rival Athrun repeat his arc from season 1, didn't go this far. This speaks volumes, especially when I still haven't discussed everyone this season fucked up. Would anyone actually refer to this as a good sequel?\\n\\n\r\nThe new cast is catastrophic as well. The only remotely decent new character was a disposable snake name Regene, who accomplishes absolutely nothing and means little outside of a small alliance arc that goes nowhere. Given that this is one of the best characters in the show, it really speaks volumes of how awful and often disposable these characters are. On the subject of more relevant characters, we have Andrei Smirnov, who is probably the worst new character introduced in the show. He is insufferable from beginning to end, and he gets no real punishment for his actions. His quest for revenge against his father is as ill-conceived as his character afterwards is irrelevant, as it's only there for a cheap backstory and another character having her personality arbitrarily shift once again. Yes, one of the more noteworthy characters exists for one idiotic arc before being reduced to yet another nobody halfway into the season. The only important character left is the new Lockon Stratos, who comes with his own host of issues. For example, despite him wanting to be as far removed from his brother as possible (not even touching on how much of an asspull this character is), he pilots a borderline identical mech, and assumes the exact same role as him! It is almost laughable how stupid he is! If only this was an intentional showcase of how war can bring about the worst in people. Instead, it's a preachy, empty spectacle of intolerable husks in human shells, obliterating each other while shouting cheesy platitudes. The worst part is that I'm not even covering everyone here, not by a long shot.\\n\\n\r\nThe main purpose behind almost every Gundam installment is to use epic war machines piloted by unstable people to illustrate the terrors of war on a physical, societal, and psychological level. 00 goes about this as bluntly and pathetically as possible. Everyone constantly shouts about how “violence is bad”, “killing is wrong”, and that “people just need to understand each other better”. Somehow the worst way the series integrates this is by ripping off Zeta Gundam, one of the most iconic entries in the franchise, twice. The most mind-numbing instance is towards the end when the show takes from Zeta Gundam's final episodes, which show newtype abilities become as absurd as being able to interact with the dead for the sake of \"understanding people better\". At least SEED Destiny has the courtesy of only ripping off an iconic storyline of Zeta Gundam with the Four Murasame plot. This series apes from that particular set of blueprints with Anew --the lifeless Four clone of this series-- on top of the aforementioned \"understanding dead people\" voodoo. This is unforgivable!\\n\\n\r\nWhat a scrap pile this heap of a season turned out to be. Even with the major errors present within the first season, there was room for this second season to a newer model that worked off of what came before for a well-built conclusion. It may look clean and shiny, but this pile of junk was plagued with critical malfunctions throughout. To think they kept this line of defective machinery going with a sequel. It isn’t the worst product the Studio Sunrise factory assembly line cobbled together, not with defective equipment such as Gundam ZZ having being broadcast years prior. Regardless, a product that short-circuits out of the box is of no use here.",
            "date": "2016-05-26T19:25:00+00:00",
            "helpful_count": 18,
            "mal_id": 219388,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=219388"
        },
        {
            "content": "This series is sure to have received a very high expectation from the viewers, and that includes me. The first season left a huge mass of mysteries and many possibilities for the conclusion of the story. With just some little improvements from the first season, this sequel will be close to perfection; but it becomes utterly disappointing in almost every aspect.\r\nStory (6/10)\r\nThe conflict the new direction of the story is intriguing and interesting in the start. Now we see the outcome of the protagonists', the Celestial Beings or the Gundam Meisters, idealistic military interventions. Even with all their efforts, the world is at a bad,or even worse state as before.\\n\\n\r\nWith this backdrop, secrets are finally revealed one by one. But though the revelations are in tandem with excellent gundam battles, the character involvement makes it very bland. The tactics, teamwork and science involve are as excellent (but later on, replaced with godlike gundams) as before but character \"developments\" are too rushed, unrealistic and insignificant in general. Gone are the deep connection to the root of mankind's actions, the radical characters that show it, and the tackling of current societal issue such as religion, energy crisis, ethnic differences, terrorism and others.\\n\\n\r\nThey were replaced by the repetitive portrayal \"the antagonists have a logical and probably good intention for the world but in reality they're evil.\" What happens is that each episode or arc we see the same themes over and over again.\\n\\n\r\nArt (10/10)\\n\\n\r\nThe best in the series: high definition animation. And the gundams are in the peak of our current mecha designs. Each part of the frame are detailed: hair, eyes, clothing and especially, the mechanical parts. the colors are beautiful and bright and the light of the GN Drive is very memorable.\\n\\n\r\nThe endings of the anime must be praised for their symbolism and artistry.\\n\\n\r\nSound (8/10)\\n\\n\r\nI must say that the music in this series features the same genre as the first season: modern pop ballads and alternative rock. Because the setting is Anno Domini, I think the moods they give is appropriate.\\n\\n\r\nThe background music has improved and they are not repetitive. However, though they are appropriate, they don't give a lasting impression.\\n\\n\r\nCharacter (5/10)\\n\\n\r\nI say the character of the series and the characters themselves have become mediocre.\\n\\n\r\nThe main characters were developed greatly in the first season but the second season is supposed to be the room for their interaction: And we get a very big mess.\\n\\n\r\nSetsuna and Marina's bond is unique and in a way beautiful but their interaction in the second season are insignificant and offers no substance. The potential result of their differences of beliefs are sublimated. Setsuna is still a almost emotionless badass, but his interaction with the many mediocre characters dimmed his remaining good quality\\n\\n\r\nAllelujah/Hallelujah is one of the most interesting characters because of his psychology but in the second season he screams \"Marie!\" 50% or more of the time and the other dialogues he's involve in does not add to the overall drama. Soma screams \"Colonel!\" And it's the same as Saji, who also screams \"Louise!\" most of the time, and Louise, who psychotically screams \"Celestial Being!\" Marina says \"Setsuna...\" all the time. In short, these characters, and others too, long for another in different ways yet their internal conflicts are cliche or lacks screen time.\\n\\n\r\nWe expect something different from the new Lockon Stratos with his connections but we get little. His role, aside from being a Meister,is to add drama which slapped on and poorly developed. Tieria involvement and development is the only notable thing in this section, are crucial, but somehow he offers blatant fanservice .\\n\\n\r\nThe new characters with spotlights in the series does not leave impacts at all, and I find them insignificant in general. Beside from adding angst, evil or action, their purpose is to pilot the new gundam models that is of course, advertisement. The main antagonist is well...bland. He lacks badassery.\\n\\n\r\nThe character is the greatest weakness of the show. Also an interesting note, this show has abused binary pairs the most- too many characters has pairs, look-alikes, clones, alter egos that are explored little.\\n\\n\r\nEnjoyment:\\n\\n\r\nI enjoyed it because of the action and suspense. But the story makes me cry in disappointment. The characters have great potential in them but 25 episodes as too short for them. If they were only explored more and interacted in a slower, more cinematic manner with lots of meaningful dialogues this series will have definitely improved.\\n\\n\r\nOVERALL: 6",
            "date": "2009-04-26T20:40:00+00:00",
            "helpful_count": 16,
            "mal_id": 14540,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44336.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/danceljoy",
                "username": "danceljoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=14540"
        },
        {
            "content": "*This is a review of both seasons of Mobile Suit Gundam 00.\r\nWhile some people were still recovering from the endings of two of the most popular shows of the early 2000s, Madhouse’s Death Note and Sunrise’s Code Geass: Lelouch of the Rebellion, they may have missed another entry into Sunrise’s impressive catalog, Mobile Suit Gundam 00. It’s interesting that Mobile Suit Gundam 00 (Gundam 00), which is a part of a series that has been airing since the late 1970s, isn’t more popular than it is. While I’ve known about the Gundam series for several years, I had never even heard of this particular entryuntil recently. Is there a good reason why this series has been overlooked by so many, or is it a hidden gem that many people haven’t yet had the pleasure of discovering. \\n\\n\r\nStory:\\n\\n\r\nIn the year 2307, the people of Earth have exhausted its most precious resource, oil. In order to combat their reliance on fossil fuels, several countries have banded together to form three super powers: The Union of Solar Energy and Free Nations (Often shorted to “The Union”)—the Americas, Australasia, and Japan, The A.E.U. (Advanced European Union), Europe, and the Human Reform League—Russia, China, India, as well as parts of Southeast Asia and the Middle East. These three powers were formed with one major purpose in mind, to harness the power of the sun. They all are in control of one Orbital Elevator, an extremely tall structure extending from the Earth’s surface all the way into space. These orbital elevators are used to harness solar power and transport it to countries that are a part of each of the super powers—thereby excluding those who refused to join—as well as serve as a transport into space, military base, and a colony of sorts. But, unfortunately, each one of the superpowers still only looks out for their own individual interests. The result of these nationalistic tendencies is a world of perpetual war. But, during the unveiling of a new A.E.U. Mobile Suit, a large robot controlled by humans usually for military purposes, a brand new entity joined the fray, an entity known only as Celestial Being. Their purpose, to eliminate war by forcibly stopping any armed conflict and eliminating those who proposed a threat to world peace. In order to accomplish this goal, they will use the most advanced mobile suits that the world has ever seen, Gundams. \\n\\n\r\nGundam 00’s story gets off to a pretty clunky start. The first episode throws you right into the action, which would have been perfectly fine if that’s all there was to this series. But, as you’ve probably gathered from the plot synopsis, there’s a lot going on. The story is stretched across the globe and features several main and supporting characters, different factions, and a totally different world than the one we currently live in. The scale of the story is fairly massive, and you’re hit with all of these characters, factions, and new world landscape right at the beginning with little explanation. Thankfully, all of these issues are resolved later on in the series, but that doesn’t change the fact that you’ll be “hung out to dry” for the first couple of episodes. \\n\\n\r\nGundam 00 does recover from its shaky start, and starts to fill you in on what exactly is going on in this world you’re observing. But, there are still plenty of surprises to come. There are several mysteries in Gundam 00’s story that will slowly be unveiled as the series progresses, and I think that they’re all executed well and help to make the story more dynamic. \\n\\n\r\nThe main theme of Gundam 00’s story is war, and how exactly is the best way to go about ending it. How to obtain world peace has been something that has been discussed for many years, and most people have probably already dismissed the notion as an impossibility. But what if there was an organization that, essentially, declared war on war. Even if they were to bring about peace, would that peace be real peace? Would that peace, which was created by violence, even last? These are some of the questions that were proposed during course of the story, and, honestly, it made me think. While watching this series I actually questioned some of my own personal beliefs about war and violence. Watching dozens of characters on different sides of battle, all having different ideologies reasons for doing things was really interesting to watch. Seeing several people who have the same goals, but disagree about the means of attaining them, or vise-versa, provides you with an opportunity to see multiple perspectives on the same issue and I really enjoyed that about the story. \\n\\n\r\nGundam 00’s story was interesting, thought provoking, and well thought out, but it does have issues other than it’s clunky start. One of those issues is a lack of a proper explanation of certain topics. For the most part, Gundam 00 did a really good job of explaining everything that was going on, and the reasoning behind it, but other times the series’ explanations for how and why things happened the way they did weren’t exactly the greatest. Another problem I had was the series very open ended ending which didn’t really wrap anything up, and I’m talking about the ending to the second season of Mobile Suit Gundam 00 not the series concluding movie Mobile Suit Gundam 00 The Movie -A Wakening of the Trailblazer which is…a review for another day. I was also mildly annoyed when things would just pop up out of no where using the excuse that it was all apart of Aeolia Schenberg’s, the founder of Celestial Being, plan, but that just piggybacks onto my earlier complaint about some of the series’ lackluster explanations. \\n\\n\r\nCharacters:\\n\\n\r\nWhen it comes to characters, Gundam 00 is a prime example of too much of a good thing. I can’t think of one character in the entire series that I really disliked. I was really interested in getting to know the characters as the series progressed, but there was one big problem. There are just way too many of them. Gundam 00’s story just covers too much ground. When you are showing several characters from each of major factions in the series, there is no way that you’ll have enough time give us all of their background stories, and properly develop each and every one of them. \\n\\n\r\nThere are 37 supporting characters just in the first season. And it’s not like they’re just throw away characters either, each one of them does play some role in the progression of the story or in the development of the main characters, and most of them are given a fairly good amount screen time. As stated earlier, with so many characters there’s no way you can go into great detail on all of them, but, thankfully, all of the main characters are taken care of. Each one of the Gundam Meisters (German for master): Setsuna F. Seiei, Lockon Stratus, Tieria Erde, and Allelujah Haptism, all are given a good amount of development, and background information. Of course, some are given more than others, but all of the main characters were solid in terms of background information and development. It’s just a shame that there wasn’t enough time to properly develop all of the interesting side characters. \\n\\n\r\nAnother problem with having so many characters is that it’s harder properly develop the relationships between them. I think that it was handled really well for the most part, the only real issue that comes to mind is when two particular characters meet, have one conversation—which was very short and didn’t really show any signs of being romantic—and the next time we see them together they’re a couple. While it was fairly obvious that that was the direction that their relationship was going to go in, it would’ve been nice to actually see that relationship progress. But, other than that, Gundam 00 did a great job of developing the relationships that involved main and main-supporting characters. Of course some of the less important supporting character’s relationships weren’t given nearly as much development, but overall it they were handled well.\\n\\n\r\nAnimation:\\n\\n\r\nI found Gundam 00’s animation to be a bit of a mixed bag. That’s not to say that the animation isn’t generally really good, because it is. It’s just that there are some interesting things to note about it. Without a doubt, the best part of the animation is the fights between mobile suits. The action scenes are really engaging, and genuinely exciting to watch. I was really impressed by how all of the mobile suits looked, everything looked really detailed and it really helped to elevate the series’ fight scenes. But where the mobile suits, and I do mean all of the mobile suits and not just the Gundams, all looked really distinct and detailed the character models were lacking a little. It not so much that they weren’t distinct, that was actually just more praise for the mobile suit models, but they just seem to lack detail.  Especially when the camera would zoom out and show a particular character’s full character model. The series’ background scenery was also good, but certainly nothing spectacular. But, with all of that said, the animation in Gundam 00 is still really good. \\n\\n\r\nSound:\\n\\n\r\nGundam 00 has a massive, and varied soundtrack (OST), with an abundance of songs that can fit the tone and setting of each scene that they are used in. As I mentioned earlier, Gundam 00 has some really cool fight scenes, and the music that the series uses only makes the scenes that much more fun to watch. It uses grand, orchestral songs to bring a little more intensity into the already engaging fight scenes. While the OST does have a lot of songs that make you feel like you’re about to jump out of your seat, it does know how, and when, to slow things down. The OST also has plenty of slower songs to fit all of the more somber scenes as well. Gundam 00’s OST really nails the overall feeling of the songs that they are using in each scene. Each song that was used feels like it was made specifically for that scene, and in some, cases they probably were. \\n\\n\r\nComplimenting its massive OST, Gundam 00 also features a pretty large number of good openings and endings. Between its two seasons, Gundam 00 has four openings and five endings. They are all really well done, but the first and last openings, and the first, third, and last endings are the ones that really stood out to me. \\n\\n\r\nEnjoyment: \\n\\n\r\nI had a really good time watching Mobile Suit Gundam 00. Like a said earlier in the review, it was able to make me think about some issues that I might not have thought about otherwise. Add that to the great action sequences, intriguing story, and interesting characters, and you’ve got one really entertaining series. There wasn’t a dull moment in any one of Gundam 00’s fifty episodes, and, while I wouldn’t say that it has a really high re-watch value, it’s definitely something I could see myself watching again at some point down the road.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 4.3/5\\n\r\nCharacters: 4.2/5\\n\r\nAnimation: 3.9/5\\n\r\nSound: 4.4/5\\n\r\nEnjoyment: 4.3/5\\n\r\nFinal Verdict: 4.2/5\\n\\n\r\nMobile Suit Gundam 00 is a great series that you should definitely check out, whether you’re a huge Gundam fan or are just hearing about the franchise for the very first time. \\n",
            "date": "2015-07-19T04:24:00+00:00",
            "helpful_count": 13,
            "mal_id": 193807,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=193807"
        },
        {
            "content": "Keep in mind that this review covers both the first and second seasons. \r\nThe Gundam franchise needs no introduction. It's probably the single best known mecha anime. The eleventh installment, Gundam 00, was written by Kuroda Yosuke. Who was involved with such well done works as Excel Saga and Gokujou Seitokai and such bad works as Onegai Teacher. Really, the series could go either way in terms of quality based on his previous work. So let's take a look and see whether the best or worst aspects won out.\r\nIf you're even passingly familiar with the Gundam franchise you'll recognise the story structure of Gundam 00instantly. The militaries of great powers are attacked by brand new mecha weapons called Gundams who are striking against them in order to put an end to conflicts. The group announces that they are Celestial Being and they are going to end armed conflicts by intervening in them with their Gundams. The Earth governments quickly begin planning counter-measures. One thing that is positive about Gundam 00 is that they do acknowledge the contradiction between Celestial Being's purpose and their methods. But, overall, the writing is pretty sketchy. It isn't terrible but it is incredibly lazy. There are several moments where the writing puts the characters into a corner and they get saved by something that comes completely out of nowhere and comes across as being made up just for the sake of getting the characters out of the situation. The ending is another aspect that really isn't done well. Everything gets wrapped up far too easily in the last fifteen minutes or so of the final episode. All the unresolved conflicts, loose threads, etc... It's almost like they needed another episode to wrap things up well but didn't have one, or they could have had less pointless flashbacks and used that time. Yeah, there are pointless flashbacks. They show that events, that you've already been told everything you needed to know about, happened. Don't you just love filler? Another issue with the writing is that several serious moments get undermined by something really stupid. Like Setsuna mindlessly repeating the word \"gundam\" or talking about how he will become a gundam. \\n\\n\r\nThe cast of characters is unruly. There are far too many major characters and none of them are well developed. The most complex characters come off as two dimensional and the majority of the cast comes across as completely shallow. This is especially obvious when one of the characters dies and is replaced by someone who's almost exactly like him. There are several moments where the antagonists come across as being evil for the sake of being evil, rather like Captain Planet villains. This all makes it very difficult to get invested in the series or care about what happens to the characters.\\n\\n\r\nThe art is actually pretty good. The fight scenes are nicely done, although there are a few occasions of laziness here. (Two different coloured balls of light slamming into each other.) But overall the art is well done and nicely detailed. The gundams look spectacular and the backgrounds, though fairly bare, do work with the setting. \\n\\n\r\nThe voice acting is fine. It isn't anything spectacular or that stands out, but it does do its job. The music is the same way. \\n\\n\r\nThe yuri factor is a 1.5/10. There are some mildly homoerotic moments between Feldt and Chris in the beginning, but nothing substantial. \\n\\n\r\nMy final rating for Gundam 00 is a 4/10. It's a sub-par series. If you're a huge Gundam fan you'll probably like it fine, otherwise it's a lazy and shallow effort where the few good moments and well done action scenes can't make up for the weak story or uninspired characters.",
            "date": "2012-03-28T02:24:00+00:00",
            "helpful_count": 10,
            "mal_id": 57211,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=57211"
        },
        {
            "content": "This was quite disappointing and a big blow in quality compared to 00's first season. This second season takes place four years after the events of the first season where the three power blocs have united into a single nation and have dispatched a military force called A-Laws to wipe out terrorist cells and nations not involved with the new Federation. Their ruthless tactics, combined with the manipulations of a major baddie from the prior season, lead Celestial Being to reemerge to deal with both threats. Pretty much, this season is sort of a re-hash of plot elements from Zeta Gundam where you had aresistance group (AEUG) dealing with a corrupt branch of the military having considerable influence over the country's affairs (Titans). Only, this series is a bit of a mess with cohesively laying out its major elements for plot and characters.\\n\\n\r\nGundam 00 gets in the bad habit of trying to introduce and resolve as many elements to its plot and character elements as possible, including some that were left unresolved from the first season. Whereas the first season took its time on exploring these elements, Gundam 00's second season goes by at a much faster pace with its developments thus it lacks the time to properly explore many aspects to its storyline or character developments. This is especially notable in that this season attempts to incorporate some romantic developments with two of the Gundam Meisters. Because of the season's sloppy handling of developments and fast pacing though, these relationships felt unnatural and lacked credibility as they seemed tacked together just to advance the plot or create pointless drama.\\n\\n\r\nSpeaking of characters, having too many introduced was another problem for 00's second season. Having only 25 episodes for its run, character development and focus was quite limited here, especially when the show was mixing focus on re-introducing characters from the first season and new allies and baddies in season two to pose as a boon or hindrance for Celestial Being despite its length. The nice amount of depth and development for characters among multiple factions from the first season is quite limited, enough so where only a few supporting characters got reasonable developments yet had nothing to do with the major plot of the series on the threat of A-Laws and the Innovators. And just like the last season, the main baddie, in the form of Ribbons Almark, is quite shallow being another megalomaniac who thinks he's better than everyone and wishes to rule the world for self-absorbed reasons.\\n\\n\r\nWhile this second season of Gundam 00 retains the polished animated details and fluid animation from the first season, the action scenes also suffered quite a bit in terms of their execution here. In the first season, the Gundam Meisters would find themselves having to work together as a cohesive team in handling missions and dealing with enemy threats as all four had their specialty areas they fulfilled thanks to the differing capabilities of their Gundams, while also having the occasional foe capable of being an equal threat to them in combat. In this season though, the prominent use of the Trans-Am system and the addition of 00-Raiser to Celestial Being made for completely one-sided and uninteresting fights as the Gundams quite often found themselves relying on Trans-Am's abilities when in a pinch to plow through enemies. Plus when 00-Raiser makes its presence felt, it quite often comes in to save the day as Celestial Being is getting creamed against enemy threats, even against the much hyped Innovators who were supposedly the big major threats within this season.\\n\\n\r\nOverall, this second season to Gundam 00 was quite the disappointment compared to its solid first season. A combination of sloppy execution, fast pacing and deciding to go \"safe\" with handling its elements make this second season to 00 quite inferior to its first season run.\\n",
            "date": "2012-12-30T18:15:00+00:00",
            "helpful_count": 9,
            "mal_id": 82032,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=82032"
        },
        {
            "content": "This is a review not just of the second season but both 1st and 2nd seasons together. The reason I do this is because I consider many Gundam series like these to have 50 episodes like many of them do. So if you read my first review of Gundam 00, this is a modified/continuation. It's been a long run since Gundam SEED but this series was far better. Though I wouldn't say it was great, it didn't really disappoint me. The story of this series follows the same formula as Gundam Wing, bunch of girly looking guys piloting overly powerful mechs for a rebellious cause.So lets break it down shall we?\\n\\n\r\nThe Story of this series was decent. Political intrigue was great since that's what most Gundam series should have. Many of the Characters had okay back stories, but I'll explain them later, and the story didn't go off course. The problem I noticed is that though it had these redeeming features it still felt like I was watching Gundam SEED. It was excessively flashy. The Gundam concepts with Trans-AM and super beam sabers that can take down a fleet of ships just didn't make sense. They are never explained and seem so surreal. Any Gundam fan would agree that many of these elements were really unneeded, and the series would continue to flow even without those...\"things\". When the series began, the GN drives (the energy source of the Gundams) were rarely explained and just lead to more questions. The same goes for the whole purpose of the Celestial Being cause. We know they were a secret military force made by a man, Aeolia Schenberg, that was to fight off and prevent Wars. Whoopty doo... but it was nothing but plot holes that make you think what the hells going on, but if you have ADD you become distracted with the Flashy battle scenes instead of noticing it.\\n\\n\r\nThe Characters of the series is another topic I want to explain as well. Many of their personalities switch back and forth making your wonder what the hell is going on. Character development in this series isn't one of it's strongest points. Some characters never have any development at all, i.e. Allelujah Haptism. As the series progresses to it's final battle, their importance to the series becomes less apparent and all the focus changes to Setsuna. Yes, I understand that he is the main character but if I do recall this series is about 4 Gundam pilots, not one. And how is it that only Setsuna reaches the next step in human evolution but not the others, dam I just gave a spoiler. As I continued to watch this series, there was barely any serious interactions between characters. Oh, there was that one time that Anew...blah blah blah, that doesn't count. It's a formulated Gundam storyline, that's what it is. Yes I say this because I've seen it happen over and over again. \\n\\n\r\nArt and Sound, pretty well done. I like the designs of many of the mobile suits, and I can't wait to see the MSVs (Mobile Suit Variations) of them. I am totally digging the intros and end themes as well. I like UVERworld, and L'arc~en~Ceil. I always find myself putting them on my MP3 every time I turn it on. I would be a better music critic if I could but I'm just not that kind of person. Anyways, back to Art. Character concepts for all the characters were decent. Of course, after Gundam Wing, all of our Gundam pilots have to look like girls, just because to create a larger female interest in the series. I can totally see many of them end up in some Hentai or Yaoi magazine (pretty sure they already are), like those from Gundam SEED Destiny. Like I said of the Mechs, they are pretty cool, but like Gundam SEED they are really flash and seem to have so many unneeded attributes attached to their bodies. \\n\\n\r\nIn the end of all this epic sword swingin', trash talkin', and totally confused adolescence screaming, I was able to sigh in relief that the series was over. I knew if it continued any further, It'd probably change into it's own kind of monster. I did enjoy it, don't get me wrong. I would prefer this series over Gundam SEED any day. I wouldn't count on it as the best or greatest of the Gundam anthology. As far as New Gundam series it should bring in a lot of new comers for the franchise and probably have more people to talk about it, and I like that. I'm looking forward to the new Gundam 00 installment that's coming out next year if you hadn't herd, that's another spoiler I guess. What I am really wishing for is that they would reanimate the original series and air it on TV, calling it Mobile Suit Gundam HD Remix (Like Street Fighter II HD Remix Turbo, lol), like that will ever happen. My ending conclusion is, it's worth watching, but you'll know it's not something to die over, figuratively speaking.\\n\\n\r\nYours Truly\\n\r\nOtakufreak\\n\\n\r\nP.S. Don't be messin' with Zakus...",
            "date": "2009-03-29T19:14:00+00:00",
            "helpful_count": 8,
            "mal_id": 13584,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1722.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OtakuFreak",
                "username": "OtakuFreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=13584"
        },
        {
            "content": "By far the worst Gundam series i´ve seen and i´ve seen most of em.\r\nOf course now you´ll ask, why is that?\r\nI´ll answer that in a second, but i´d like to start with the Pros of Gundam 00.\r\nThe overall style of the pictures where quite impressive.\r\nThe look of the Series massivly improved compared to SEED.\r\nSomtimes even to beautyful. I´ll explain it later.\r\nIn addition the Soundtrak is really good.\r\nNow to the bitter part.\r\nFirst the Gundams themselves.\r\nThe most Gundams are totally ugly.\r\nIn fact, the only Gundam witch is even uglier than the ones in this series might \r\nbe the mustache Gundam (some poeple might know which one i´mtalking about).\\n\r\nFor example the two Matrjoschka-Gundams... no further comments.\\n\r\nOr the GN-Archer... why can this thing combine which Arios?\\n\r\nIt´s only used as a standalone-MS. It seems, that the only reasons why this thing can combine\\n\r\nwitch a Gundam is, because it can´t fly on it´s own, so somebody has to carry it to the battlefield\\n\r\nand the second, the studio just wanted something to gattai! (...)\\n\r\nOr this one´s good, too. Gundam Dynames of the first Season: \\n\r\nWhy does it have to move it´s Gundam-typical forhead decoration, when entering the sniping mode?\\n\r\nWhy not remove the thing, or splitt it, so the camera can look through the two halves?\\n\\n\r\nThe grunt-Mobile suits are ugly as well.\\n\r\nOf course, since i´m a Zaku-Lover most MS are ugly, but OO S2 tops everything in this matter.\\n\r\nEven if the most ugly MS i´ve ever seen was from S1, the FLAG.\\n\\n\r\nThe fights are just as boring as the suits are ugly.\\n\r\nIn S1 it all started with the Trans-Am-super-saiyajin-limitbreaker-gigadrill-whatever-thing.\\n\\n\r\nCome on! Can you imagine how much a Gundam has to weigh?\\n\r\nThere´s totally no way a Gundam like Exia can use Instant-Movement.\\n\r\nThats not cool, thats just a poor excuse to draw some beautyful glowing mechs.\\n\\n\r\nOr the anti-space-station-beam-saber of the 00...\\n\\n\r\nThe next thing is the whole Innvoator thing.\\n\r\nThey talked about it the whole time, but was actually relevant for the story?\\n\r\nNot really. It whould be the same if i whould declare, that i´m an innovater.\\n\r\nThe people whould look at me, with a strange expression, but the world whould spin on.\\n\r\nI think this whole story element was just brought in to have something, \\n\r\nlike Coordinators or Newtypes, some indicater wich let´s the audience know:\\n\r\n\"Hey, this person is special!\"\\n\r\nBut in the end, even if Setuna whould not be one, it had changed nothing,\\n\r\ncompared to Amuro, whose complete live change because he´s a Newtype.\\n\\n\r\nWhile we are at the persons:\\n\r\nAn other thing that bothers me, are the characters.\\n\\n\r\n-An heavy drinking strategist... yet no comment again...\\n\\n\r\n-A pair of schizophrenic lovers... \\n\\n\r\n (by the way, whould this be double-dating? or polygamy? or just stupid?)\\n\\n\r\n-The sterotype ladykiller-sniper, even in a doublepack.\\n\\n\r\n-And the classic masked villian... this one is my favourite!\\n\r\n Mister Bushido! What a name...\\n\r\n an american whose totally living up to a cliché samurai.\\n\\n\r\n-And of course there´s the pink haired songstress-princess, like in Gundam SEED.\\n\r\n Well, she´s brunette this time and actually she´s quite unimportant, \\n\r\n since everybody lives much happier,\\n\r\n when there´s lot´s of war instead of peace negotiations...\\n\r\n This whole peace through war or terrorism... just like in 00\\n\r\n it´s a reason why i dislike Wing, but thats an other topic.\\n\\n\r\nSummary\\n\r\nStory: 2/10\\n\r\nArt: 8/10\\n\r\nSound: 8/10\\n\r\nCharacter: 1/10\\n\r\nEnjoyment: 2/10\\n\r\nOverall: 2/10\\n\r\nWell, accually Overall whould be a 3 or 4 if i had a good day.\\n\r\nBut Sunrise showed often enough, that they can write very intense stories\\n\r\nand great character development.\\n\r\nBut since they were just to lazy to come up with something really great\\n\r\nor even decend, 00 lost two additional point.\\n\\n\r\nWell, i think that´s it.\\n\r\nThese are most of the reasons why i think that Gundam 00 is not just\\n\r\na hit in the face of everyone who loved the original Gundam series.",
            "date": "2010-07-20T04:24:00+00:00",
            "helpful_count": 8,
            "mal_id": 28669,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/290053.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Walkampf",
                "username": "Walkampf"
            },
            "url": "https://myanimelist.net/reviews.php?id=28669"
        },
        {
            "content": "Gundam 00 is a solid anime series with a lot to like. The pacing was fine, fights were exciting and you couldn't wait to see more. Since most of it is good for this review I will try something different, and state what was really good and could have been done better to elevate this series to Masterpiece status.\r\nStory and Characters\r\nGundam 00 Season 2 takes place after Gundam 00 S1. Celestial Being comes together again to fight against the A-Laws although the process of \"reforming\" was not an easy one. \r\nHere's what was great:-\r\n* There are 4 Gundam Meisters, 3 from Gundam 00 S1 anda new one Lyle Dylandy taking over from his brother as Lockon Stratus. All 4 gundam meisters are likeable and interesting. Thumbs up.\\n\r\n* Noreiga the strategist had to be rescued from her \"lover\" and her tendency to drown her sorrows in a bottle to resume her strategic battle for supremacy against Kati Manneqin\\n\r\n* Sergei Smirnov and Soma Peries ... aaah :)\\n\r\n* Cataron, Federation, Celestial Being, A-Laws, Innovators, Awesome!\\n\r\n* Lots of fights, characters evolve and the powers that be were not afraid to show death in the battlefield. Kudos!\\n\\n\r\nWhat was not so good:-\\n\r\n* Saji takes on a bigger role. Louise joins A-Laws, love is hard. I liked the whole how does this happen to a normal couple angle, but at parts I'm sure I'm not the only one who found Saji intensely annoying.\\n\r\n* Adding in many innovators but failing to develop the character, motivation or personalities of any of them. FAIL! Other than Ribbons I couldn't really distinguish between all the innovators and there were quite a few of them. Might as well have painted a \"cannon fodder\" sign on them and left it at that. Now, personally I believe if they cut out every scene with Marina Ismail and used the time to develop ALL the villians (including Mr. Bushido) this anime would have been a 10.\\n\\n\r\nArt and Sound\\n\\n\r\nArt was fantastic except when suits go into Trans Am they turn red and it becomes very difficult to distinguish who is fighting who and who is winning. Why can't they do Red Trans Am and Pink Trans Am so we can tell who is who? Sound Effects in general were fantastic too. Marina's song is kind of so so, the ED was good but the entire soundtrack lacked a cohesiveness that was evident in SEED.\\n\\n\r\nPlot Pet Peeve (not unique to Gundam 00)\\n\\n\r\nWhy is it when they have any type of combining units (like 00 and Raiser, or Zeta and Zeta 2 to make double zeta) why can't they launch it already combined instead of separately launching then wasting 38 seconds on the mega-exciting-combine \"Gattai\" sequence not to mention giving the enemy a chance to shoot down both units which are in the process of combining? Also when they return to the ship do they have to separate to go in, or can the combined unit go in then dock and then separate? They never show this. In any of the gundam series! It makes no sense whatsoever! Stuff like this drives me nuts, really and kind of kills my enjoyment of the show. Somebody please explain this to me, there must be a logical reason.\\n\\n\r\nEnjoyment\\n\\n\r\nOverall I thought this was very good. I couldn't wait to watch it and see what happened next. Parts felt rushed and bits were a waste of time. But it was pretty and the plot and characters kept me interested. I never felt like I \"HAD\" to finish this, instead I looked forward to it. I'd recommend every gundam fan watch this series as it is solid entertainment.",
            "date": "2009-08-11T22:18:00+00:00",
            "helpful_count": 8,
            "mal_id": 17687,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stormy_77",
                "username": "Stormy_77"
            },
            "url": "https://myanimelist.net/reviews.php?id=17687"
        },
        {
            "content": "\" Eradiction of War through force.\" ~ the return of chaos\r\nI really like season 1. It has a good dosage of action, realistic characters, mech vs mech fights, and of course, a nice complex plot. Season 1 left us with many mysteries as well as many possibilities on the conclusion of the story, and that's why I'm looking forward to the second season with high expectations, but I think my expectations were a bit crushed since it was a letdown.\r\nWith a sequel comes new characters and new mobile suits balancing mecha actions with the plot development. The STORY starts out with a lot of potential.It's still jam-packed with actions and climactic scenes that will glue you onto your seats. It still manages to present multiple view points not just the protagonists’ – Celestial Beings and the antagonists’ – Federation, A-laws and Innovators but also the civilians’ through Saji and Marina as well as the children.\\n\\n\r\nAs the series progresses, it slowly starts to crumble. 2/3 of the series will still let you ask for more, but the succeeding episodes will slowly tire you out. \\n\r\nFirst, there’s too many flashbacks. They even presented the pasts of minor/ supporting characters resulting to redundancy of some scenes. Thus the story progresses slowly. \\n\r\nSecond, the series somewhat takes a new turn. Their reason for armed intervention is now different from the first season. Their mission now deviates from fighting for eradication of war to just fighting the real main antagonist.\\n\r\nThird, some of the battle scenes are a bit unrealistic. Like a gundam that has lost an arm and both legs can still defeat a gundam with just light scratches( something to that effect) . Also the first season will always let you doubt if they can finish the mission but now, the moment 00 arrives, it’s a sure win.\\n\r\nIt’s true that the content of the story is not the most original ( Gundam Wing and Zeta Gundam, anyone?) Even way back in the 90s, stories of gundam end rather predictably. But this second season manages to surprise us by ending up somewhere that we did not expect. I think that’s a plus ( or maybe not).It's more of an aburupt ending rather than a wonderful closure.\\n\\n\r\nThe ARTWORK remains cool. The mobile suits still gives a futuristic feel and can be commended for those intricate parts and structures. One minor quirk is that Gundam 00 is a bit similar to Gundam Wing’s Wing Zero when coupled with 0 Raiser which makes it not innovative in design. Kyrios and Ariois didn't seem different at all but Arios was a bit neat compared to its predesesor. Cherudim was just like Dyanames(period).The only notable factor was the big gun that's all. Seravee and Seraphim has a nice vibe although over shadowed by 00 and 0 Raiser.\\n\\n\r\nCHARACTER DESIGNS improved. I really liked Setsuna's matured appearance. The costumes are cool. The appearance of the other characters gives a feeling of maturity. Animation again is smooth and top notch! From the movement of the gundams down to the dispersion of the GN particles, it’s very detailed.\\n\\n\r\nThe MUSIC for the second season is good but nothing special. The 1st OP theme “ Hakanaku mo Towa no Kanashi” by UVERworld gives a pop rock feel – proper for a gundam series. The 2nd OP theme “ Namida no Mukou” by stereopony on the other hand is more proper to be placed on a shoujo anime instead of this one, but it still gives an upbeat tone. The 2 ED themes range from moderate JPOP to mellow which sets the mood for the closing sequence. The BGM suits the scenes and the sound effects are very detailed (such as movements of the grass…).\\n\\n\r\nThe CHARACTERS somewhat made a wrong turn. They gave too much emphasis on Setsuna thus there’s little room for character development on the other 3 Meisters as well as other characters. Setsuna still is gundam here gundam there in his head. but he was somewhat interesting for being able to mature so much as things unfold. His perception and his purpose starts to change. Good thing there's Marina to made him realize those things and to balance out, but I think Sunrise could have improved more on Setsuna's character if Marina's character wasn't poorly executed and made a twist on Marina's existence. I think it also wouldn't hurt to place a touch of romance on Setsuna.\\n\\n\r\nNext there’s Lockon Stratos. He still has the same personality as that of the first season, and it’s like nothing has changed. He sopmewhat has a contradiction. He doesn't want to be compared to his older brother but assumes his brothers position and code name. It would be better if they made it similar to Seed’s Mu La Flaga and Rau Le Creuset or Seed Destiny’s Lacus Clyne and Meer Campbell – same face but different point of views and personality. That would have a much better twist. His relation with Anew has a great potential but summing everything up about him made him an uninteresting character.\\n\\n\r\nAlleluja became a boring character simply because Halleluja, his alter ego , is not there to argue with Alleluja’s view. He became your ordinary kind-hearted protagonist without a twist or whatsoever in his personality. It will make you wonder whether he really should be placed under the \"main characters\" list. He spends most of the episodes chasing after Marie and his interactions with the other Meisters became redundant and dull. \\n\\n\r\nTieria Erde stays true to his character. Most of the mysteries around him are answered in the 2nd season. His character development is way better than that of Setsuna's. It would have been nice to see the developments rather than just accepting them. It's refreshing to see him mature but he was being overshadowed by other factors thus it kept him from improving further.\\n\\n\r\nThere's probably another dozen of characters with varying relevance. Like Saji and Louise's develpment didn't cover much of the main plot and would be better off without them. There are still actually loads of characters that pop up once in a while that holds little relevance. There's way too many extras that should have saved us a dozen or so episodes without them. \\n\\n\r\nThe antagonists could have used more character development. They should have created a feeling of dislike or hatred in your heart but some antagonist didn’t have this kind of feel. Well, Bushido, the fat Blonde and Ali-Al Sachees did kinda show their antagonistic vibe, but the main mastermind Ribbons Almark didn’t. He doesn’t care at all what happens, just domination in his head. Like a puppeteer with very very long strings not wanting to get involved.  \\n\\n\r\nHmm... I think they are trying to make a complex and exciting series by creating more characters, more antagonists for it to have more twists and turns but because it was poorly executed, it lead to the wrong turn of events.\\n\\n\r\nI still prefer the first season because it’s fast paced and more realistic compared to the 2nd season, but Gundam 00 2nd Season is still worth the watch. I think that I just have too high expectations on this anime, though. All in all Gundam 00 Second season is a fine addition to the ever growing and popular gundam saga. Despite the predictable plot , it still has its own charm and originality at some point. It shows us a different façade of an idealistic human truth, contrasting views about war and personal reasons for fighting. It’s already a few steps close to perfection too bad it’s potential just slipped away.\\n",
            "date": "2009-06-21T07:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 15948,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105486.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/srsng",
                "username": "srsng"
            },
            "url": "https://myanimelist.net/reviews.php?id=15948"
        },
        {
            "content": "The fact that I'm writing this review might seem a bit odd. Normally, whenever I have two seasons that have the same or very similar scores, I will just review them both at once. But here's the thing, people seem to have something against Gundam 00's Second Season, which confuses me as, to me, it's just as good as the first one. So this review will be just as much a review as it is a defense against what many of its haters have said.\r\nStory:\r\nOverall the Season reminds me a lot of Zeta Gundam. The parallels are pretty obvious: Celestial Being is the AEUG, theA-Laws are the Titans and so on. Many people complain that the show doesn't have the same moral ambiguity as the first Season, which is true. At the same time, I feel that had they done the same moral ambiguity, the show would feel like a retread of Season One, so I'm happy they instad decided to give the Season its on identity.\\n\\n\r\nWhile some of the themes of the last Season are dropped, many of the themes are still around, namely on whether or not conflict truly is the solution that will grant peace. There's also a bit of a focus on embracing things that aren't really true, best shown with Setsuna's over-idealized idea of what a \"Gundam\" is... and how it was born due to him admiring a man who secretly didn't give a damn about anyone and also was a massive dick with a God Complex.\\n\\n\r\nI also feel the Season is overall better paced than the first Season, it's silk a bit too fast, but overall it's an improvement nonetheless. Overall, while the lessens moral ambiguity is a problem, and the lack of an overall big twist of any kind is also a problem, I feel the good parts of the Season more than make up for it.\\n\\n\r\nCharacters:\\n\\n\r\nHere's the big one. For starters, Marina Ismail has been given a bigger role, unfortunately this just serves as a reminder of how annoying she is. I legitimately think she's worse than Relena. I will also admit that they did screw over Graham Acker, turning him into a generic Char Clone.\\n\\n\r\nThat said, I must disagree with the treatment of two characters: Lockon and Allelujah. While I can see why people would complain about the way Lockon is used this Season, I don't think it's as bad as people make it out to be. To explain, since the original Lockon died at the end of Season One, he's been replaced by his twin brother Lyle. While I can see why people would be angry about this, I don't mind this as much as 1) Lyle's existence had already been established, 2) He's not a complete cardboard copy of his brother and 3) I do feel he brings enough to the table for him to be likable, Hell, I'd say his relationship with Anew is one of this Season's highlights. As for Allelujah however, I don't see what people's problem with him is. Yes, he doesn't get much to do after the first ten episodes, but when you think about it, that's far more than what he ever got in Season One, in which he was a glorified background character. At least here he got stuff to do.\\n\\n\r\nI also think Tieria is better in this Season. He gets a lot of development due to his direct connection to the villains, refusing to accept that he's part of them and that he's human, before finally accepting himself for whom he is. I also think Louise and Saji are better handled this Season. They finally get involved with the main cast (They Really didn't have any more reason to sit in the sidelines) and their relationship I feel was also better handled this Seaon.b\\n\\n\r\nBut Season Two's greatest achievement is the main Villain: Robbins Almark, the single best big bad in the franchise bar I none. This man has a God Complex the size of Russia, and that's his entire motivation. He wants the world to bow to him as their God, and even if this isn't very relatable, he sure as hell is hatable for all the right reasons.\\n\\n\r\nAnimation:\\n\\n\r\nIt's more of the same. There's slightly more stock footage here, but not that much. The fights are still great as always, and this Season probably has my favorite final fight in all of Gundam. It's just amazing.\\n\\n\r\nThe Mecha:\\n\\n\r\nA much deserved upgrade over the last Season. While I didn't care much for the 00 Gundam or the 00 Raiser, I did quite move the Seravee and the Arios over their predecessors, and The Gundam Cheridium is just fantastic. Oh, and the 0 Gundam was cool too. And I particularly liked how it's literally the RX-78 with a GN Drive sticking out of its back.\\n\\n\r\nSound: \\n\\n\r\nThe soundtrack is as great as always. As for the Openings and Endings, similar to the first Season, I loved the first Opening \"Hakanaku Mo Towa No Kanashii\", but didn't care much for the rest.\\n\\n\r\nVoice Acting:\\n\\n\r\nAll of the cast comes back and does a great job as always. The highlight is obviously Furuya Tooru as Ribbons (He tried to use an alias to hide that it was him, but he ain't fooling anyone), pulling off his best performance yet. Even then, the rest of the cast does not leave much to be desired. We have Takayama Minami, Irino Miyu, Park Romi, Shiratori Tetsu and even the Late Great Ishizuka Unsho.\\n\\n\r\nOverall:\\n\\n\r\nSo yes, i disagree with the hate this Season gets. It's still the same great story with the same great characters. Some things are done better, some things are done worse, so it evens out for me. I still highly recommend watching this Season, if you can't tell.\\n\\n\r\nFinal Score: 9/10",
            "date": "2019-01-20T10:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 299575,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=299575"
        },
        {
            "content": "After binge watching the entire Gundam 00 series (including the 2 hour movie) I thought I would celebrate by writing my very first review. And what better place to begin in the Gundam 00 series than the very installment that began its downhill descent. \r\nI apologize in advance, as this will be less of an actual review and more of me nit-picking at each aspect that made season 2 slightly less enjoyable in comparison to season 1. While season 1 more or less established Celestial Being's role, season 2 delves even deeper and attempts to explain its origins. The ideas are fresh and promising butthe style of execution was not. \\n\\n\r\nThe story was not bad. A lot of the elements that made the previous season enjoyable (complex characters, well animated fight scenes) were still reminiscent. You have Setsuna and his crew dealing with new and highly advanced mobile suits while balancing the antagonists from the previous season as well as a new threat, the Innovators. Not to mention characters still tackling down the reoccurring theme of \"war is bad, we have to use force and we're hypocrites because we don't know how else to solve it.\" So yeah, you have some exciting new elements but at the same time you can't help but feel that most of it is a bit overdone. I'm referring to your generic 'have a problem, find enemy, battle enemy, level up' on a continuous cycle. While this issue was only minor in the first season, it becomes more problematic in this season because you have too much to discover, most of the episode time  allotted to fight scenes, and a huge cast that is rotating on screen time yet barely anything is learned about them. Which leads into what I'm going to discuss next.\\n\\n\r\nMy other biggest concern was with how they handled the characters. They used lots of screen time to introduce new characters but not so much towards developing them. What little development time they had was often rushed so it could transition into another battle scene. Not saying that character development can't also take place in that type of setting but having a one on one conversation is much different than shouting angrily from a mobile suit with bad communication lines. \\n\\n\r\nAlso without going into too much spoilers, I have to say that the most insulting thing you can do to a well developed character is to have them replaced with a carbon copy that looks and sounds the same but all under a different name and personality. Seriously? I thought Sunrise had more respect for their characters but I guess it's been proven otherwise. Don't even get me started on the romance subplots because some of them were just downright awful.\\n\\n\r\nI realize that what I'm saying in this review doesn't exactly match with my rating but I still thoroughly believe that Gundam 00 season 2 is enjoyable and worth your time if you liked season 1. While it's not as successful as its predecessor, the all around feeling of seeing the original cast return and 'grown up' is worth it.",
            "date": "2015-08-02T19:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 195024,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1526893.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sabaisms",
                "username": "Sabaisms"
            },
            "url": "https://myanimelist.net/reviews.php?id=195024"
        },
        {
            "content": "I am personally liked this anime. To tell the the truth, this is my first gundam anime that I watched seriously and this is also one of the best mecha anime that I had ever seen. \r\nThe story is unpredictable and the art of mechas were great. it can make you like it even you are never watch any gundam series before (of course except the 1st season, doesn't it?)",
            "date": "2008-12-27T16:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 10699,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111805.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/yukiN",
                "username": "yukiN"
            },
            "url": "https://myanimelist.net/reviews.php?id=10699"
        },
        {
            "content": "The second series differs substantially from the first, and in my opinion, is the much stronger of the two on nearly all counts.\r\nPerhaps the most similar aspect of season 2 is the storyline's main arc, which is a straight-up continuation from season 1.  However, nearly all the characters are more developed now, and the smaller arcs within the main storyline are more substantive and more interesting.  Without going into too much detail, the overwhelming superiority of the Gundams in season 1 has come to an end, making the battles more nuanced, and the playing field more evenly matched. \r\nAlong with the better writing,the pace of 00 Season 2 is quite a bit faster, allowing for the individual characters' development to be seen more easily from ep to ep.  I found season 1 to drag on at times, and to be a bit slow and monotonous- and in season 2, I am happy to say that the constant barrage of action has finally been interrupted by intriguing drama and circumstance.  It brings to mind the sister anime, Code Geass, in a number of ways- which can only be a good thing.\\n\\n\r\nSpeaking of, if you like CG, you will probably like this series.  Sunrise was at their peak during both of these shows, and the audio and visuals are very similar between the two- and excellent in both.  Perhaps not quite the very best, but depending on your taste, they are right up there at the top.  The vastness of space and the richness of color on the ground are equally well-represented, with tons of symbolism to be found in various color choices and placements among the characters and Gundams.\\n\\n\r\nOverall, and without even finishing the series, this has become a top-tier favorite of mine in the mecha genre, surpassed by few others, and deserving of an overall score of 9.  With just a bit more depth, it would truly have been among the greatest.\\n\\n",
            "date": "2018-10-30T18:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 293021,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/j4mmin42",
                "username": "j4mmin42"
            },
            "url": "https://myanimelist.net/reviews.php?id=293021"
        }
    ],
    [
        {
            "content": "The first season of 00 left me lacking in something a little bit. I must say that I expected the second season to be bad, according to my friends, but it was surprisingly good.\r\nDespite me seeing the whole story, I think I can safely assume some events remind me of Zeta Gundam. I won't say which, but the events are definitely better than the events of SEED Destiny. I'm too embarrased to add that series to my list.\r\nNow, back on track, I'll start with the things I really liked. First off, the character development.\r\nEvery character that is in the series has their own personal dillema,be it with the government, his/her family, past relationships and so on. Some are just hell-bent on revenge. Sometimes due to their own mistakes.\\n\r\nThe main set of characters, the Gundam Meisters, especially have problems, but most of them are resolved near the ending of the series.\\n\r\nThe music was spot on for the whole time, and some of the scenes without music left me focusing on the ambience of the scenes. I must say that it didn't work every time, but still.\\n\r\nThe art is also very good. The new units that appear are almost always very well drawn and conceived. Some even have their different modes, which is always welcome. Sure, the eyes of some characters are just...eh? But that hardly affects the episodes at all. You should be focusing on the anime in general, no?\\n\r\nMost of all, I enjoyed the series overall. But as it always is, there are still a few problems.\\n\r\nMainly, some of the characters just sound really clueless. I can't spoil them but I can at least say it's a few of the main characters. By clueless, I also mean naive.\\n\r\nThe second one is a quirk of sorts, but the second opening is just not really appealing to me. The eyes especially.\\n\r\nAnd finally, the third one, is that some of the mobile suits are just plot materials. Especially the main one, but it's also really rad so I can't say much against it.\\n\r\nAnyways, I recommend people to have a look at this series. A lot of the things are very well made and most of all, enjoyable.",
            "date": "2018-04-12T09:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 277857,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7071776.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hablmet",
                "username": "Hablmet"
            },
            "url": "https://myanimelist.net/reviews.php?id=277857"
        },
        {
            "content": "To tell you the truth, I really don't like the gundam series that much. Though somehow I had an interest in watching Mobile Suit Gundam 00. However, I didn't see much of the first season (maybe just the episodes at the end). But If I'm correct the story is about 3 different alliances fighting one another. That's where our characters come in. They are trying to stop the Inavaders (people who I think are part of Celestal Being). I don't like the main characters because they are always serious, especailly Satsuna. It feels like he has no emotions what so ever. Here's the bottom line.There's a lot of war, gundams blowing up, people dying, end of story. To me I think It's just someone's vision of what might happen if we continue to have needless war. So just watch it and if you don't like it that's fine too.",
            "date": "2010-06-09T20:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 26978,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326384.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/trishoverman47",
                "username": "trishoverman47"
            },
            "url": "https://myanimelist.net/reviews.php?id=26978"
        },
        {
            "content": "This is my very first Gundam series and I can say I'm completely hooked to the entire franchise now. 00 was simply fantastic in every possible way. The story, characters, music, events and art are of the best I've ever seen in any anime in my life.\r\nThe story starts four years after the battle with Alejandro Corner and once again follows the military group Celestial Being in their fight against a corrupt Earth government and its A-Laws to stop all wars and help humanity reach peace and understanding. \r\nAll the characters are interesting, do important things and evolve quite nicely. The fights are intense, cooland very flashy and I'm sure anyone will be satisfied with the ending. (Which continues in the movie).\\n\\n\r\nWhile I don't truly consider myself a complete expert in anime, I've been watching them for about two decades now and I'm sure of myself when I give Gundam 00 a 10/10.",
            "date": "2013-08-11T03:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 109163,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2259413.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TRI_Mike",
                "username": "TRI_Mike"
            },
            "url": "https://myanimelist.net/reviews.php?id=109163"
        },
        {
            "content": "Hi there!\r\nIf you have watched the first season of Mobile Suit Gundam 00, then it is highly unlikely that you, dear reader will consider reading a review for help but if thats the case then please take some time and read this review. The first thing I noticed was that the episode length increased slightly to 20-21 minutes from 18-20 minutes in the first season.\r\nSTORY\r\nIn the 4 years between Gundam 00 and Gundam 00 S2 the world has been united but there are still uprisings happening around the world and the newly built Earth Sphere Federation (ESF) uses the Autonomous Peacekeeping Force (A-Laws) to shutdown any threats to the government. The ESF still maintains a normal army, which is not part of the A-Laws. The situation is similar to David VS Goliath, where the big giant smashes the small people, who still have concerns over the new government. The A-Laws act with such a ferocity and savagery that Setsuna feels guilty for the situation and he decides to revive Celestial Being (CB) and gather the old crew once more to finally end all the injustice that is still happening around the world. The first story arc of the show deals with the rebuilding of CB. You will get to know what happened to all the team members and see CB being rebuilt to full fighting strength. The plot this time is much more simplistic, which is not necessarily a bad thing. As a viewer you will know right away what you are in for and if you look at it as a continuation of the first season, it holds up quite well.\\n\\n\r\nThere are two more parties involved consisting of Ribbon's personal gang of replicants or \"Innovators\" as you call them in the Gundam 00 universe. Ribbons and friends have their own agendy and ideals which will be unveiled later on in the series. Like the A-Laws they act indepent from the ESF but are considered allies.\\n\\n\r\nThe fifth and last party is Katharon, they represent the civilists who rebel against the ESF because they are unhappy with the way how peace is accomplished in this newborn world.\\n\\n\r\nIn the end you can split those 5 into two major parties. The ESF, A-Laws and Innovaters against CB and Katharon.\\n\\n\r\nThere are some inconsistencies in the story and I think if you have watched season 01, the inconsistencies will be quite obvious. It mostly concerns the characters and their development. Keep in mind that 1 year passed in between the production of season 01 and season 02, so the public opinion on the popularity of some of the characters might have influenced Studio Sunrise in some way or another.\\n\\n\r\nThe overall pacing is very good, I felt very engaged and there was only one time about 9-10 episodes into the show where the momentum slowed down and I didn't feel like I had to watch the next episode right away. Apart from that I always had to stop on purpose or else I would've bingewatched the whole thing, I believe.\\n\\n\\n\r\nCHARACTERS\\n\\n\r\nFear not, everyone makes a return and a bunch of new characters are introduced too. I did have some problems with the cast of season 01 because it were just too many for my taste and history repeats itself here. But this time most of the new characters are on the antagonist side and not even noteworthy because they are all just simple marionettes and rather bland, especially Ribbons gang of bad boys and girls. (Whose names, most of the time, I didn't remember until late into the show) The good thing is, all the protagonists make a return and their backgrounds and stories are fleshed out. Some are left behind (Feldt is still... well I don't know. She is nice and all but she doesn't play a substantial role at all, there is even a scene towards the end of the show which feels kind of forced but you should go and watch that for yourself)\\n\\n\r\nAll the other main characters have their backgrounds explained really well and deepened in the second season.  Tieria for example who didn't get much exposure in the first season, receives way more screentime in the second season. The same goes for Sumeragi whose background and relationship with Billy is finally uncovered and their relationship takes a new direction. There is also a new Lockon Stratos but he is where the inconsistencies begin. Don't worry its no major spoiler, the new Lockon will be introduced within the first 10 minutes of the first episode. I call him new Lockon because he is a different person but yet very much the same. If you paid attention to Lockons backstory in season 01, you will realize why this character feels a little out of place but I think he must've been very popular among the Gundam fans, so they wrote a new Lockon Stratos character into the story. Another thing is Hallelujah who apparently did not die but is still very much alive within Allelujah, even though it is said in the anime that Hallelujah was gone.\\n\\n\r\nBut I don't want to keep nitpicking on small details because I was still carried away by the show and its characters. The most interesting pair of people (imho)  were Louise and Saji  who somehow ended up on different sides of the conflict. I suffered a lot when I witnessed their break-up in season 01 because I really liked those two. Louise who heartbreakingly sent Saji away to find his happiness (That's like the worst thing a woman can do, send the man she loves away and saying, it's her wish to make him happy. But Saji without Louise is very unhappy so that's that.) Louise apparently became crazy after the incident involing Nena Trinity and it is only very late into the show that her side is explained completely or rather, the viewer will be able to realize why she became this way. I felt that a lot of people did not like the new Louise because it wasn't properly explained what happened to her mind in the beginning  of the show but for me it was part of the fun to wait it out and suffer with the characters and the choices they made. Saji was a little harder to bear with but he eventually shows some determination and sticks with his decisions.\\n\\n\r\nThere is a new triangular relationship between Sergei Smirnov who plans to adopt Soma Peris and who has to deal with his son Alexei Smirnov. Soma's personality undergoes some hefty changes during the story, which I did not like but she does reach some kind of middleground towards the end of the show. which was acceptable for me, personally. Your opinion on that might differ depending on what kind of characters you like.\\n\\n\r\nI pretty much enjoyed the whole cast and their relationships. Kati Mannequin and Patrick Colasour will also make a comeback to the show and there is going to be a new masked man going by the name of Bushido. The so called Char clone was absent from the first season although his role in 00 is not as critical to the whole show as it used to be in the past. You can consider Bushido's appearance more of a nod towards the fans and he does spice things up indeed. He behaves a little like Milliardo Peacecraft/Zechs Marquise who wants to fight an honorable battle and behaves very knightly. (Not familiar with Char, but I do know of his heritage and Zechs Marquise is the first incarnation of him that I have seen)\\n\\n\\n\r\nANIMATION\\n\\n\r\nThe animation is top notch, just like the first season. Its even better and there is more action going on.\\n\\n\\n\r\nSOUND:\\n\\n\r\nThe sound is also above average. The voice acting is spot on and the sound effects are well done. There are even some more memorable songs scattered through the OP & ED themes. I liked it more than the first seasons score and songs.\\n\\n\\n\r\nENJOYMENT & OVERALL\\n\\n\r\nI really enjoyed the first season and I didn't think the second season would get much better. But boy, I was wrong. I am digging all the characters and the story of Louise and Saji struck a chord with me. (Even if it was just a subplot) I didn't mind the inconsistencies even though I noticed some of them right away. At first I thought the new Lockon was a dick but later on, he taught me otherwise.  I probably focused a little too much on the romance part of the show because I am sucker for this kind of stuff. If this show was a stand-alone effort, I would probably rate it 9 but together with season 01 I will give this show a 10. I laughed, wept, felt sorry or was happy while watching the show so it pretty much triggered all the emotions. I was even thinking about rewatching Macross Frontier, which is my favourite show, to see if Grundam 00 might be better but I decided not to because I would look for flaws on purpose which would kill the enjoyment.  The ending of the Gundam 00 was very fulfilling and a happy ending on all fronts for me. Sometimes when I watch anime, for example Makoto Shinkai's work, I feel a little uneasy because his anime-ending usually leave a lot of space for interpretation. That's not a bad thing, I like to think about the possibilities but I also like happy endings very much and this one was perfect for me.\\n\\n\r\nI have a hard time picking a favourite character for the 2nd season. I liked the old Lockon because he was cool and held the guys together. I also liked Allelujah because he was a little crazy but both of them were toned down. Lockon is busy with self-loathing and Allelujah behaves like a sissi when his love-interest is involved. In the second season I liked Tieria the most, which is funny because when I saw him for the first time in season 01, I thought he was a flat chested girl until he opened his mouth and sounded very manly. I am usually not into these feminine characters but in the second season he proved to be a selfless-giver.\\n\\n\\n\r\nI hope you will like the show too!\\n",
            "date": "2016-11-03T19:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 233183,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5782720.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EFG357",
                "username": "EFG357"
            },
            "url": "https://myanimelist.net/reviews.php?id=233183"
        },
        {
            "content": "Assuming you've seen the first season, you know it ends on a very tragic note. This in itself isn't bad, but the second season undoes it all with very little explanation. Really, it's a bunch of deus ex machina bullshit. If you can get over most of the cast being zombie characters though, the rest of the season is good overall. Many other reviews give detailed pros/cons so I'll just skip to the TL;DR:\r\nIf you enjoyed the first season, and can overlook a couple glaring flaws, this is a solid and satisfying follow up to the first season, and i would recommend you give ita try.",
            "date": "2017-06-27T21:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 251277,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rade66",
                "username": "Rade66"
            },
            "url": "https://myanimelist.net/reviews.php?id=251277"
        },
        {
            "content": "Before continuing, to understand what I am about to say, I recommend you to read my review of the first season first. Now let's begin.\r\nStory: It is a good story, but they made a lot of mistakes when comparing with season one. The mystery deepens, the fights are still outstanding, and you have NUMEROUS plot twists. Nevertheless, I must warn for two mistakes that are hard to swallow: the first is the lack of explanation for some aspects that, although they explain later, you have to wait too much until they finally let you know what was that about. The second is a minor spoiler:don't expect much from the conclusion. That is a trend from all stories (anime, books, manga, HQ, anything) that create a way too big of a mystery to be able to make you really be satisfied with the conclusion. I left a \"good\" score because the overall is still pretty enjoyable.\\n\\n\r\nArt and Sound: Still awesome, as the first season was.\\n\\n\r\nCharacter: Again, they continue to sin. You will have some major developments for Tieria and Sumeragi, and some for Setsuna and other secondary characters. But, the rest of them... They TRY to make Saji and Louise better but their development doesn`t hold up of how annoying they overall are. Hallelujah becomes as interesting as toilet paper and Lockon`s substitute is a major downgrade. Marina Ismail is even less interesting and 80% of the other characters are just pain in the asses. Think Saji is annoying? Wait until you see the profane script for Mr. Bushido.\\n\\n\r\nMechas: As a Gunpla builder I have to talk about that. I preferred the mechanical aspects of the Gundams of the first season, but they created some badass Mobile Suits for the rest of the army. The updated versions have some nice gimmicks that make them awesome. My favorite Gundam in 00 is Dynames, but 00 Quan is also a beautiful Gundam. the GN-X models of Earth are pretty cool looking too, and I think that in terms of mechas, Gundam 00 will ALWAYS stand out.\\n\\n\r\nOverall: It is a still enjoyable season, full of highlights and plot twists. But you will some major bumps on the road.",
            "date": "2018-12-30T19:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 297538,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7676083.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Manthors",
                "username": "Manthors"
            },
            "url": "https://myanimelist.net/reviews.php?id=297538"
        },
        {
            "content": "Let me start by saying that Gundam 00 season 1, was the very first Gundam anime I watched. and I liked it. Didn't fall in love with it, but it was good and fun to watch. And the ending, although bitter since it killed off my favorite character (Lockon, Neil), was an acceptable ending for a war.\r\nThen I went on to watch the second season. It started well and promising, but the more it went on, the more disappointed I became.\r\nStory: 5\r\nThe story lost its consistency very fast. Up until 2 episodes before the end, Innovators were the enemy. then suddenly they were in factInnovades and the real innovators were supposed to be the future of the earth! I mean. COME ON!! \\n\r\nand the ending was such a crappy one! nothing happened and nothing changed , all the characters kept living their own lives, and no one died!!!!!! now isn't that nice!\\n\r\nand don't get me even started on that princess's song which was changing the world!!!! and Saji and Louise's parts in the story!\\n\\n\r\nArt and Sound: 7\\n\r\nThe art is better compared to the first season and the music is still so good. I liked the opening and ending themes too.\\n\\n\r\nCharacter: 4\\n\r\nIn the first season, there were so many characters that I enjoyed watching. Lockon, Allelujah(and of course Hallelujah), Sumergai, Graham, but in the second season, for some weird reason they insisted on making romantic relationships for characters. And almost all the coolness in them vanished! there was no development whatsoever, but in many cases there was even regression!   \\n\\n\r\nEnjoyment: 6\\n\r\nIt was still fun to watch the fights and all the new suits coming out of nowhere. \\n\\n\r\nOverall: 5\\n\r\nI honestly have no idea how some people say Gundam is better than Code Geass! In my point of view, they are as far as earth and sun! While Geass gets a full 10 from me, Gundam is barely a 5! \\n\r\nSorry Gundam fans. this just didn't do it for me!",
            "date": "2013-02-02T03:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 85593,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Azar",
                "username": "Azar"
            },
            "url": "https://myanimelist.net/reviews.php?id=85593"
        },
        {
            "content": "My first impression of Gundam 00 was a boring mecha anime, and it took me quite a while to get into the whole Gundam 00 since it was my first Gundam series. \r\nI found the series pretty enjoyable and at time pretty damn epic. But lemmi just say one thing before hand. If you are looking for a mecha anime that is full of the bizzar with lots of comedy and random crap, then this is not it. Gundam 00 follows a seriouse tone and you get that feeling right from the very first time setsuna speaks. His voice... almost monotone. \r\nIf you are lookingfor a random, epic, awesome, bizzare and funny mecha anime go watch Gurran Lagann. Its just as good. \\n\\n\r\nOh and also i would reccomend watching the first 3 - 6 episodes before you give up. It took me up to episode 6 to get into the anime and then it was amazing from then on. This is for the first season and second season. So when i say 3 - 6 i mean episode 3 - 6 of the first season. \\n\\n\r\nAnyways....\\n\\n\r\nStory 9/10\\n\r\nThe story was ok, but i found it was contradicting itself with eliminating war with war. By getting world peace by using violence which is kinda strange. But later on the series you understand. It still got a good story anyhow. \\n\\n\r\nArt 10/10\\n\r\nThe art is pretty damn good. The first few episodes of the first series isnt as good as the second series but both are pretty amazing. \\n\\n\r\nSound 10/10\\n\r\nThe sound all around is just amazing. I loved all of the OP's except for the last one. And i liked all the Ending themes except the first and last one which wasnt amazing but wasnt horrible. \\n\\n\r\nCharacters 8/10\\n\r\nThe characters were good. There was no main protagonist untill you go up to episode 5 - 8 or so then you see that setsuna is the main protagnoist. But thats not what the series is about, celestial beings is the protagnoist and thats all you need to know. In the second series it becomes very obviouse that setsuna is the one since he gets all the cool crap. \\n\\n\r\nEnjoyment: 10/10\\n\r\nI enjoyed it thoughryly, just damn epic at some times, and it had a good ratio of action, talking etc...\\n\\n\r\nOverall: 9/10\\n\\n\r\nsgood!",
            "date": "2010-09-27T08:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 30854,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OtherGuyX",
                "username": "OtherGuyX"
            },
            "url": "https://myanimelist.net/reviews.php?id=30854"
        },
        {
            "content": "This is my very 1st review, mostly because I really like to talk about anime instead of writing about them. There are many outstanding anime out there to watch and MS Gundam00 series is, without a doubt, one of them...\r\nThe main story is simply revolving around a Secret Organization that calls itself \"Celestial Being\" and their goal??? It's also simple enough, that is to bring Absolute Peace among the humanity Worldwide  and encourage them to really Understand each other instead of Fighting on religious, ethical and various other reasons.\r\nBut it's easier said than done....\r\nNow,coming directly to the matter in hand that:\r\nWhy you should spendyour time to watch this series? (if you haven't, of course)\\n\r\nThe Answer is intelligible, MS Gundam00 is just Phenomenal Series with its exceptional Story and Character Development; beyond awesome Music and Anime Art...\\n\r\nFor me, it's really been a very long time since I felt this excited during and after watching an anime that was so much thrilling.\\n\r\nIf you call yourself an Anime Fan, I think it's High Time for you to fill the Gap by watching Mobile Suit Gundam 00 and say:-   \"I AM A GUNDAM\".\\n\\n\r\nPS: I didn't want to ruin the fun for those who haven't watched it yet, so my review is not based on detailed story telling and stuff...\\n\r\nHope it helps, Thanks...!",
            "date": "2015-01-12T05:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 177525,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2526293.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MystiC_MOON",
                "username": "MystiC_MOON"
            },
            "url": "https://myanimelist.net/reviews.php?id=177525"
        },
        {
            "content": "Really, because both seasons are out and available, I'm going to just repost my review from the first season below.  I will say I felt they kicked the action up a notch in this season, and you get more interesting missions for Celestial Being.  Read below and enjoy the series, this is the best Gundam has to offer IMO.\r\nI really love the story with this one, I think it draws you in and makes you really like the characters.  I really like it when they blur the lines between which side is doing good, and which side is doing the most harm.The mobile suit fights are amazing, I think this series does some very interesting things with their Gundams that you don't expect.  The animation, really top notch.  I really have a hard time finding something negative about this series, so I wont struggle to do so.",
            "date": "2018-09-25T21:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 290014,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lchestnut81",
                "username": "lchestnut81"
            },
            "url": "https://myanimelist.net/reviews.php?id=290014"
        },
        {
            "content": "-This review does not include the first season of Gundam 00, but does mention some thoughts on it-\r\nGundam 00 is the first and last Gundam series I will ever watch. I don't mean that in a negative way, this was just the first series of Gundam that caught my interest. It was mostly the characters that drew me to the series and it did pay off to some degree. Overall my enjoyment of the series was hampered by a redundant story and a lack of any real danger for any of the characters as well as one-dimensional villains.  \r\nThe first season of Gundam waspretty well-done overall with the art/character/story etc. And I did like the ending of the season but did not see where the show could go. Unfortunately, it only went downhill. I did, however, enjoy the first 9 or so episodes, but as it progressed the story became more and more unhinged. \\n\\n\r\nAs I said, the characters drew me in, and they kept me there hoping it would get better. The focus on characters is skewed and we spend time with characters that should not have much screen time. \\n\\n\r\nOne of them was Princess Marina. I could not help but be irritated by Princess Marina, she is consistently terrible as she spends most of her time singing while people are dying and acting all righteous. I understand her passive stance on the war but the way in which it was executed was laughable. Not to mention she spends a lot of time with the most ANNOYING little kids ever to be animated. As well the other passive character, Saji, is irritating to the worst degree and gets a ton of focus. I was honestly rooting for his death.\\n\\n\r\nThe bright spots of this season were Marie and Allelujah, but after their big ark, they are mostly sidelined. Tieria is great as always, but his treatment within the story is awful, the writers did not seem to care about the best character, leaving him unexplored. The one character that got the most growth was Louise who was the worst part of the first season, but this season she is redeemed and given depth. I don't even want to talk about how useless Lyle was, but I will.\\n\\n\r\nBesides Saji and Princess Marina, Lyle is the most useless character and he only becomes of use at the very end and he almost screws that up. He did have moments where he could have been grown into a good character, but he is wasted on an out-of-nowhere romance plot. Not to mention Lyle's entire existence is a slap in the face to one of the characters from season one and is the number one example of why the writers were too scared to ever kill any of the major characters off. \\n\\n\r\nAfter a time the story begins to run in circles, with the writers unwilling to develop anything at all, we end up spending what feels like years in space as Celestial Being is attacked for the thousandth time. By the time anything does happen the stakes are at their lowest and you won't care at all. \\n\\n\r\nAnd so, in the end, the writers do decide to convey an anti-war story, which is great, had the execution not been so terrible. As well there is no real resolution with the main character, Setsuna. He doesn't become overly annoying or anything, but he doesn't really get any development even though the writers want you to think he did. \\n\\n\r\nThis season is just frustrating, but it is wonderful to look at. The production was top-notch and everything seemed polished and great. I just wished the story had stayed on track. It is very unfortunate that this series fell so hard where the first season set up for greatness. \\n\\n\r\nYou are better off just watching the first season because the second season is a poor imitation that cannot even attempt to reach the heights of the first season.",
            "date": "2017-08-21T21:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 255997,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4767931.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/RiverMako",
                "username": "RiverMako"
            },
            "url": "https://myanimelist.net/reviews.php?id=255997"
        },
        {
            "content": "Story: 10/10\r\nI can't remember what first made me decide to watch this anime, but I was a pretty big Gundam SEED fan and was hungry for more and I heard that this was the next best thing, maybe even better. Boy - did I hear correctly! One of the things I love most about Gundam is that it isn't set in an alternate universe or anything, it's always set in an imagined future. The thing about Gundam 00 is that it's imagined future was really thought out well and it's like an actual possible future for our current world! At first, as always, the storyis very political and you get introduced to all the factions and organizations and their goals, etc. It really reminded me of Code;Geass/Death Note, what with Celestial Being playing the \"peace-keeping/justice\" role for Earth. Every single episode was very interesting and manages to progress through the story one way or another. One of the main points is the mystery Celestial Being in every episode. It just leaves you more curious at the end of each ep to want to continue on to the next one. I don't know how to explain much more without spoiling, but.. The story was amazing.\\n\r\nThere was nothing to complain about with the ending and it did a marvelous job of leading into Season 2.\\n\\n\r\nCharacters: 10/10\\n\r\nEach and every one of the Gundam meisters had amazing backstories that created their individuality/current personas and yes, you actually find out each of their pasts. I can't really say what they are without spoiling though. One of the unique things about this anime is that there really isn't simply 1 main character. All the meisters are as equally important as the other! The relationships between them and their backgrounds are but simply one of the many reasons why this anime was so good. All of the Gundam meisters are soo cool too! XD (As well as their Gundam's of course~)\\n\r\nHeck, I'd confidently say that every single character in this anime was perfectly created. I was even fans of the Antagonists, one of which is voiced by my fave: Kugimiya Rie!!\\n\\n\r\nMusic: 10/10\\n\r\nOne of the things Gundam is best known for are their amazing soundtracks which most of you probably know I never stop raving about XD The openings and endings as well as the OST for this anime were GOD-LIKE.\\n\r\nFor example, these are some of the greatest anime openings ever created IMO:\\n\\n\\n\r\n[video=youtube;akH8OQY0OxI]http://www.youtube.com/watch?v=akH8OQY0OxI[/video]\\n\\n\r\n[video=youtube;xChqT5_o50o]http://www.youtube.com/watch?v=xChqT5_o50o[/video]\\n\\n\\n\\n\r\nDownload OST Here!\\n\\n\\n\\n\r\nArt: 10/10\\n\r\nThe thing that drew me to this anime the most was the HD art! Don't believe me? Just look at those OP's above!\\n\r\nThose stunning visuals are B-E-A-UTIFUL. The art is so.. so... sleek. All of the characters have defining features and the Gundams are all amazing So much detail!! I can't even imagine how much work they put into this anime. Both the males and females were very pleasing to watch. I heard that almost the entire staff of Sunrise was used in this anime's development. And the end result is just amazing. This is exactly what happens when a bunch of talented people team up to create a masterpiece.\\n\\n\r\nOverall Enjoyment: 10/10\\n\r\nEvery single episode was so addicting and left a great impression on me, all the way up to the end. Just to let you guys know, I started this anime and then watched non-stop until the end of Season 2. That's how addicting.\\n\r\n(Season 2, HUGE plot twists) Every single damn thing in this anime was amazing. There's literally nothing one could complain about. Every person I know who's seen this has loved it as much as I do. It's always a great experience to witness a true anime masterpiece.\\n\\n\r\nFINAL RATE: 50/50 (10/10 on MAL)\\n\r\nYes, a perfect score. As you might know already (or perhaps not) all I only rate an anime 10/10 on MAL if I consider it a must-see, or if it blew my mid the whole way through. If you can sit through some politics, enjoy having your morals questioned and are willing to keep an open mind, it's a fantastic series and I recommend it. If the amazing artwork doesn't draw you in, the story and characters will. Even if you want to pay no heed to the story, the stunning visuals during battles are worth watching on their own. Very rarely is there a wasted moment in the show, spare one recap episode told from a different character's perspective. I can't possibly recommend this series more highly.\\n\\n\\n\\n\r\nReccomendations:\\n\\n\r\n- Gundam 00 S2 -\\n\r\nObviously watch the sequal after S1!! It's a rare occurence when the second season is just as good, if not better, than the first! O.O\\n\\n\r\n- Code;Geass -\\n\r\nThe way Celestial Being acted as peacekeepers and believing in absolute justice and the way they excecuted thier missions really reminded me of Code;Geass, also the heirachy of power.... is a thing to watch for ;D\\n\\n\r\n- Mobile Suit Gundam SEED -\\n\r\nThe anime which led me to this one. It's a very hard decision for me to choose which Gundam series I enjoyed more so... why not both? I reccomend Gundam SEED if you liked 00, because they're quite similar in the fact that the art, characters, music, and story were both on the \"god-like\" level. Ingenious.... masterpiece... Finding words to praise both these anime is really quite difficult XD",
            "date": "2014-09-01T18:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 158831,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/398813.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BigBoss0327",
                "username": "BigBoss0327"
            },
            "url": "https://myanimelist.net/reviews.php?id=158831"
        },
        {
            "content": "Mobile Suit Gundam Double Zero Review Season 2 \r\nThere are no spoilers in this review. \r\nI have now finished both season of Mobile Suit Gundam Double Zero. I have to say season 2 way suppresses season 1 in my opinion. The major flaws of season 1 were removed. \r\nStory. \r\nI enjoyed most of the way through, this is assisted by the build up to this from season 1. It's a true continuation and is well written. It's not a story I'm going to forget soon. Although the main things that bugged me in season 1 are still here. Overall though I liked it much better.Looking back I would change a thing about Double Zero. It's important to enjoy it for what it is. \\n\\n\r\nTech \\n\r\nThe same quality from season 1 carried over into season 2. Good art, effects, audio and design quality are all high points. No flaws here in my opinion. \\n\\n\r\nCharacters \\n\r\nThis here was the greatest improvement of season 2 over one. The characterization. The links missing between the viewer and the characters was established and I was finally able to feel a connection to them. Basically I actually started to like them and by the end I most certainly did like them. \\n\\n\r\nConclusion \\n\r\nDefinitely an anime to add to your to-watch lists for all you Mecha fans. I won't say it would appeal to anyone else though except maybe fans of military type anime or shows. Generally speaking a great improvement and continuation off the first season. \\n",
            "date": "2013-02-14T19:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 86813,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1859934.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/romansiii",
                "username": "romansiii"
            },
            "url": "https://myanimelist.net/reviews.php?id=86813"
        },
        {
            "content": "This is my final thoughts for the first and second season of the show.\r\nA fairly decent mecha show with fascinating and realistic approach to its setting. If you enjoy sci-fi shows with a solid quality, coupled with attractive characters and beautiful mechas, this one is for you.\r\nPersonally, I might like this one better if some parts are executed properly. My major gripe is the relatively huge number of  casts, but in the end they are fleshed out fairly well.\r\nPros:\r\n-A fascinating, well thought-out sci-fi setting\r\n-Fairly realistic approach on the conflict\r\n-Beautiful, attractive character designs (bless Yun Kouga)\r\n-Interesting, likable characters\r\n-A fine story revolving around 'understanding' as itscore theme\\n\r\n-Good mecha fight scenes\\n\r\n-Great music for OPs and EDs\\n\\n\r\nCons:\\n\r\n-The relatively huge amount of casts can be a bit of problem in giving characters proper screen time and characterization.\\n\r\n-Some characters fell victim on becoming wasted potential (as a result mentioned above)\\n\r\n-Some plot holes here and there\\n\r\n-The plot relating the core theme could have been executed and conveyed better, rather than having numerous pointless misunderstandings that only annoyed the audience.\\n\r\n-An attachment to reason mentioned above; the whole 'understanding' theme seems to only apply around characters' interpersonal relationships. It would be much better if they could incorporate the theme in the world setting too, rather than switching the whole thing into 'the hero vs tyrannical army who rules the world' kind of plot.",
            "date": "2017-07-28T00:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 254031,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6360492.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/amber-meido",
                "username": "amber-meido"
            },
            "url": "https://myanimelist.net/reviews.php?id=254031"
        },
        {
            "content": "This is one the best anime i've watched this season! It's full of action and the plot is really intruging. I've been waiting for almost half a year after watching the first season and this sequel did not let me down.\r\nThe story picks up 4 years later after the end of the first season and the gundam meisters were having different lives. A new military faction \"A-LAWS\" has been formed by the government to oppose anti-government factions. Their way of doing things are harsh and cruel, hence, celestial being is brought back to carry out 'justice' for the world. \r\nThis season develops more on theromance and their past stories of the 4 main charactors, creating deeper plots. It is a MUST watch! Don't miss out this show!!",
            "date": "2009-02-13T11:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 12399,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/149467.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lunarraider",
                "username": "lunarraider"
            },
            "url": "https://myanimelist.net/reviews.php?id=12399"
        }
    ]
]