[
    [
        {
            "content": "*Hekiou Academy Student Council Meeting Log*\r\n“… I am Kaicho (president), I am KaichoO! By the way, does the president do anything?” – excerpt from episode 11’s ending theme. \r\nWhat happens when four pretty girls and one handsome guy spend most of their school time everyday in a confined room? Naughty thoughts aside, if you were thinking “oh my god, not another harem” then you were right! Seitokai no Ichizon is NOT a harem, strictly speaking (though our male protagonist tries very hard to make it so). In reality the poor dude gets bully by his female mates more than he ever deserves. So who mightthis anime be good for? If you are looking for a parody that pokes fun at itself and the entire anime industry in general, then Seitokai no Ichizon will surely meet and most likely exceed your expectation! In fact not only does it do a good job with the too-frequent parodies, but with high quality animation, and impressive new ending themes every episode, Seitokai no Ichizon is a great anime for all ages.\\n\\n\r\nThe story of Seitokai no Ichizon centers around the everyday “adventure” of the student council in Hekiyou Gakuen high school. Its setting primarily consists of one place, the student council room, although exceptions do occur in the show from time to time. Now you must be wondering, what can a show that limits itself to one cramped room has to offer? Surprisingly the answer is, plenty. With plenty of jokes and plenty of parodies targeted at other recent well known anime, there is never one boring moment in the show for viewers to complain about. Even if the story itself does not attract the viewers enough due to its random episodic events, but by combining the story with the character interactions, nice consistent animation, superb voice acting, and addictive soundtracks and theme songs, Seitokai no Ichizon has some of the deadliest combination to make it stand on its own ground.\\n\\n\r\nIt was interesting for the characters to repeatedly admit that “nothing ever happens” in their show. And yet they never fail to entertain the viewers with what they can do to make the show appealing solely by chatting. In fact, it is hard to judge these characters in any normal anime standard because they are out of the ordinary. As the casts themselves have put it, “This is where we end after airing twelve episodes? … The main character is supposed to mature after a time (but) … nothing changed.”. They poke fun at their own lack of character growth, but in actuality most characters have had their fair share of developments through learning about each others’ past or family problems. The characters certainly made a positive impact to the overall success of Seitokai no Ichizon due to their unpredictability.\\n\\n\r\nThe animation is nothing but greatness. The characters are very nicely designed and even the one and only classroom is very detailed in design with a large variety of decorations and hidden rooms. Fluid scene to scene transition, consistent high quality animation, and a great choice of “scenery” also made Seitokai no Ichizon very attractive to the eyes. Additionally, comedic-like faces on the characters whenever a random chat start appearing also helps crack people up. The animation definitely is another strong point that makes up for the lack of story.\\n\\n\r\nAt first I was very skeptical with the seiyu in this show because all the main female leads are apparently voiced by rookies. Yes, they are ALL rookies. New to the anime industry, these female seiyu all tried exceptionally hard to make themselves stand out as a bright star. Unfortunately they were all excellent in voicing their roles so I could not say who seem to be the most talented (unlike in other shows where one can clearly tell some seiyu just don’t go well with the particular role at all). It is, however, quite clear that these voices bring life to the characters in the series and bring entertainment to the viewers.\\n\\n\r\nSpecial honorary mention goes to the ending themes. Whether they are good or not, one must admit it was creative of the producers to make a unique ending song (same rhythm different lyrics) for each episode thus resulting in a total of TWELEVE ending themes. Even without the lyrics (and I strongly urge you not to miss them), the songs in itself is tremendously addictive. In fact, I could dance around my room all day with the song set on repeat in my computer. The opening, while less catchy, is still very pleasant to hear and once again it showed us the talents these new seiyu possess.\\n\\n\r\nSeitokai no Ichizon is a wonderful addition to the anime industry and made itself stood out among the mist of millions of other similar anime largely due to its parody at poking fun at itself and everything anime-related. The jokes are never too old or too repetitive throughout the show and the references are relatively simple to grasp (provided you are semi-familiar with recent anime). Keep in mind the show is made in Japan and is intended for Japanese viewers who most likely have a more knowledgeable database of the anime series in Japan than we do. If you don’t seem to be able to spot a parody or two in an episode, chances are, you have already missed out on some of the jokes they are making fun of. In that case, you should reconsider whether to continue watching the series or not. Lastly I would recommend anyone who have trouble at school, whether it is your grade or having trouble making friends, to try playing love simulation games (ie. harem games)!",
            "date": "2009-12-24T19:29:00+00:00",
            "helpful_count": 305,
            "mal_id": 21688,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=21688"
        },
        {
            "content": "Parody and comedy are a staple genre in the anime world and sometimes can be hit or miss.  This is because to truly understand parody you have enough experience with the things that are being parodied.  As a foreigner to Japan and the majority of its culture, a great deal of this goes over my head as it would a foreigner trying to understand some of the humor from my own country.  All of that being said some things are universally funny in comedy and that brings us to Seitokai no Ichizon, an anime that forgets to deliver the most important elementa comedy must have... humor.\\n\\n\r\nThere isn’t any real story in Ichizon.  The episodes are loosely tied together for the most part and center on the exploits of a high school student council.  While shows revolving around clubs and student councils are quite common, initially Ichizon appeared to be unique.  However the freshness of the series quickly wanes as I found just getting through each new episode was somehow a test of my patience and sanity.  I really wanted to like this series as well but as it went on and on I found it more torturous to watch.\\n\\n\r\nIs Ichizon bad anime?  Not really.  It’s just incredibly boring anime.  And that is the main problem it has.  Let’s begin with the humor.  The parody and comedy is way too forced and thus doesn’t have any flow to it.  It’s almost as if the writers thought the more anime and culture references they could pile in the funnier people would think it was without any regard to whether or not the jokes were actually, well funny.  Just because I can recognize that something is being lampooned or a joke is being told doesn’t mean it’s funny.  Sure there were many things I did find amusing and a few that I actually did laugh out loud at, but for the most part Ichizon is humorless and clichéd. \\n\\n\r\nThe other main issue with the series as a whole is its claustrophobic setting.  90% of the series takes place in the student council room.  Even when they do leave the confines of that room then they soon seal themselves up in yet another small room.  Had the jokes and parody actually been funny, this might not have been such a problem but each episode is mostly just the five of them sitting around a table screaming, talking at the speed of light, or spouting whatever cliché or stereotype their personality type is based on.\\n\\n\r\nThe ending is also rather bizarre.  While Ichizon by its own admission doesn’t take itself very seriously, the rather somber and serious nature of some of the last few episodes felt very much out of place.  For something was all about randomness and silliness this was a strange course to take.  It's a bit ironic that these episodes were actually the best ones in the series, which makes you wonder how much better it could have been as a whole if it had worked on developing the plot to lead up to them.\\n\\n\r\nAmong Ichizon's characters, only Sugisaki Ken stands out in any way.  With most harem type shows the male lead is usually the dullest and most uninteresting character in the show.  Not so in Ken's case as he manages to carry the series by himself.  Pretty much the only times I really laughed was because of something he said or did.  The various girls of the council all have their own quirks but they all miss the same thing, actual personality.  Sure they were all adorable and cute to look at but each of them had two or three personality traits that were just used over and over making each of them less substantive than cotton candy.\\n\\n\r\nArtistically I found the characters to be very pretty and the styles and costumes were appealing.  However because the series is set in a rather dull and plain club room that means there is little in the way of backgrounds and that makes the show as a whole to seem more drab and uninteresting than it really should have been.  So while I found the art and animation to be very good, its setting brings it down much as it did with the story.\\n\\n\r\nWhat I did find refreshing was an almost totally fresh faced seiyuu cast.  In a time when the same dozen or so actors are reused ad nauseum it is really nice to hear some new blood.  That being said the performances really aren’t that strong and in the end sound just like what we are used to hearing already.  The music is fluffy and cute and not all that interesting.  Though some of the ending remixes were funny, particularly the one from episode 11. \\n\\n\r\nIchizon in the end is disposable anime.  Its worth a few laughs and then meant to be throw away.  I doubt that anyone in a couple of years will even remember this show even existed.  Its a real shame since as I said before, I really wanted to like it.  While I don’t think it’s really terrible and maybe overall not quite as bad as I rated it, it was so boring and unenjoyable that it was painful to complete.  If you are fairly new to anime or haven’t seen more than a couple hundred shows you might find this to be pretty good.  For the more experienced viewer though, Seitokai no Ichizon is likely to be a disappointment.\\n\\n\\n",
            "date": "2010-01-31T10:27:00+00:00",
            "helpful_count": 184,
            "mal_id": 22835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=22835"
        },
        {
            "content": "You know, Suzumiya Haruhi no Yuutsu has a lot to answer for. For a while there it felt like anime, as a medium, had decided to be a bit more inventive, a bit more creative. Hope is a great thing, no?\r\nTo be fair, what happened next wasn't really the fault of SHnY, but the damage was already done. Beginning with Lucky Star, which was a pretty good comedy for the most part, the slippery slope of formulaic school based parody shows with a supposedly eclectic set of characters who literally do nothing rapidly became a tiresome methodology, with numerous shows following this trend until theadvent of Seitokai no Ichizon (The Student Council's Discretion). \\n\\n\r\nThe story is based on a series of light novels, published from January 2008, by Aoi Sekina (with illustrations by Inugami Kira). Now one would think that an adaptation of a novel would have a bit more depth to it, but Seitokai no Ichizon seems to follow only one path - try to please as many people as possible.\\n\\n\r\nIt's no surprise then that the show really struggles with plot coherency and development, especially as, barring a particularly dull sub plot, there isn't really any point to the story. The whole series is set, for the most part, within the confines of the Student Council Office, and while this may at first appear to be an orginal approach, one should remember that SHnY, amongst others, had very similar settings. The big problem with confining the story to a specific area is that there is a only so much the writers can do to develop the plot. Thankfully (maybe), Seitokai no Ichizon doesn't really try to develop what little plot it has, and is content to follow the path set by Lucky Star - lots of parodies, sketches and jokes while the characters do nothing.\\n\\n\r\nNow, one could consider the comedy in this show to be funny, and some of it actually is, but the fact remains that much of the humour has actually been done better in other shows (or do I need to mention Gintama). In addition to this, the series makes a great show of trying to get the audience involved, a bit like a really bad Christmas pantomime, but this effort begins to cool after the first few episodes. Instead of going down the route of actually showing how a typical student council works, and adding humour to that premise, Seitokai no Ichizon travels at breakneck speed towards one of the most pointless and inconclusive outcomes I've ever seen. \\n\\n\r\nIn all honesty, the one saving grace the series has in terms of it's story and plot is that I found some of the jokes to be funny, but even that wore off pretty quickly.\\n\\n\r\nNow don't get me wrong here. There isn't anything specifically wrong with Seitokai no Ichizon per se, especially as there have been other shows that have little to no back story, and arecompletely relian on parody, humour and audience partcipation. However, this shouldn't come at the cost of the characters, ir even of the humour itself, and it's unfortuante that the series has fallen into that trap. While the show resoundingly denies that it's a harem anime, the tried and tested stereotypes are available throughout the story, and the series has the feeling of being written by someone who really does believe they know what the audience wants, even when it comes to looks.\\n\\n\r\nThat's right. Seitokai no Ichizon is very clearly on the moe bandwagon, especially when it comes to character designs. From the fiery tempered tsundere to the outspoken loli. From the silent but deadly hot chick, to the shy and withdrawn bundle of cuteness. This series makes no bones about who it's target audience is, and it targets that market with a certain degree of ruthlessness.  \\n\\n\r\nThat said, there hasn't really been a lot of thought as to how the characters should look. The presentation is that same, tiresome, fanservice tinged moe that that makes up up over half of the school based comedies around to date. While the presentation is pretty decent, one can't help but wonder why the cast doesn't feature anyone with any kind of physical blemish. The backgrounds and backdrops also follow a similarly over-simplistic style, espcially as most of the show is set in the student council office. \\n\\n\r\nAs for animation, well, it's actually pretty good, especially during the parodies. The choregrpahy and animation design isn't the greatest, however it does serve it's purpose in that the whole show is simply a joke delivery system, and as such, there isn't really any need for top quality animation and CG. The characters move reasonably well for the most part, however the series looks and feels very similar to a host of others, and that is one of it's biggest problems.\\n\\n\r\nIn terms of sound, Seitokai no Ichizon isn't too bad really. The OP, a boppy little J-Pop track called \"Treasure\", is sung by most of the cast and, aside from being fairly well chorepgraphed, is nothing to write home about. The ED, on the other hand, is where things get a little more interesting as the series features a variety of ending themes that are sung by at least two members of the cast. \\n\\n\r\nThat said, they're still forgettable J-Pop songs.\\n\\n\r\nActing-wise, the show is reaonably well represented, especially as the four main female leads are relative newcomers to anime. Given that fact, it wouldn't actually be unreasonable to assume that the entire show is nothing more than a platform to launch their respective careers (it's been done before after all). That said, there is some merit to their, and the rest of the cast's, performances as the characters, barring one or two annoying voices, are pretty well portrayed for this type of show.\\n\\n\r\nAs for the characters themselves, well, where do I begin? The fact that this is an epsiodic parody harem comedy should give you a hint as to what you should expect. While the series is extremely moe-centric, the characters are all nothing more than stereotypes of the first order and, while they are reasonably good in that respect, at the end of the day that's all they are. The show tries to add some deeper meaning to the characters, especially to Sugisaki Ken, but these efforts don't fit in to the plot in any substantial manner, and serve as nothing more than distractions from the comedy. The characters don't develop in any manner that is both plausible, and in keeping with the story, and this is the main reason why the series is so reliant on the comedy content.\\n\\n\r\nThere will be those who laud Seitokai no Ichizon for a number of perfectly valid reasons, and in certain respects it's a good series to watch. It's quirky, humourous, and somewhat engaging, and I will freely admit that it managed to make me chuckle, especially with Mafuyu's burning passion for BL. That said, the series could easily have taken things one step futher by throwing out all the stereotypes and going for something truly original as the parody would have had far more impact in that way. It's a shame then, that the show tries to take the more satirical path and tie it to parody as the two don't easily mesh, so what's left is a mish-mash of jokes and sketches that jump from one to another like a frog on a hot rock, and coherency is the first to fall victim to the lacklustre plot.\\n\\n\r\nAll in all, this isn't a bad show, but it's not really a shining example either. Fans of shows like Lucky Star, Hyakko, PaniPoni Dash, and even SHnY, may find the series enjoyable, but may also find that much of the humour is a bit flat, or has been done better elsewhere. It's sad to say, but those who haven't had the opportunity to watch this type of series before may find this far enjoyable. It all depends on one's perspective.\\n\\n\r\nOn the whole, this isn't the best example of a parody anime. Gintama, Lucky Star, even Jungle wa Itsumo Hale Nochi Guu, give parody it's due, and use the gags in unusual and original ways. Seitokai no Ichizon, on the other hand, tends to stick to formula, and it's efforts to try and please everyone is the main reason why the show is as mediocre as it isl.\\n\\n\\n\\n",
            "date": "2009-12-26T12:02:00+00:00",
            "helpful_count": 170,
            "mal_id": 21727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=21727"
        },
        {
            "content": "\"What happens when you have 4 beautiful girls,a good-looking guy,a student council,parodies & comedy?Yes,you are right,the answer is HAREM,oh,no I mean Seitokai no Ichizon.This anime is a parody so you better be prepared before you watch this anime.Watch other anime it parodies or else you won't understand the jokes in a better way\"\r\n(Story:-8/10)\r\nThere isn't a linear plot in this anime i.e. each episode begins & ends randomly.The student council consists of 5 members.The first 4 student council members are chosen by votes.The top four who get most votes gets to be in the student council while 5th spot is for the student who gets mostgrades.We have our 4 beautiful girls Aka-chan,Mafuyu,Chizuru & Minatsu who got their positions due to being well-liked by everyone while Ken who got in council simply by his hard work & good marks but his reason of joining it or more like the motivation of all of the study he did  is........only to form a harem.Sounds pretty generic,doesn't it?but it isn't.In fact it is better than most of harem anime I have seen.\\n\\n\r\nAlmost the whole show occurs in a simple room which is obviously student council where all the members have fun almost all the time & do work only if they really have to do it.Afterall,They are not a ordinary student council.The majority of the show is spent in doing parodies of other anime like Lucky star,Suzumiya haruhi,Death Note,etc with reference of some others like baka test.\\n\\n\r\nThere are also Mafuyu's crazy yaoi fantasies like she wants Ken to end up with her imaginative Nakameguro-kun or with his nii-san,who of course do not exist.These parts are really funny & you will be laughing really hard even if you are against yaoi.\\n\\n\r\nOften Ken mentions this student council to be a place of his dreams,a harem only to be beaten up or to be shut up by the girls.There is also a journalism club that likes to degrade council by spreading false news lead by Lilicia but that is only for comedic reasons.\\n\\n\r\n 8/10 since the plot is very random.\\n\\n\\n\r\nArt:-(9/10)\\n\\n\r\nThe art of this anime is very clean & beautiful.It is not rushed & each area is explained carefully.The characters designs are also drawn beautifully & they look awesome.\\n\\n\r\nThe backgrounds are also very impressive.Since most of this anime occurs in a single room so I am amazed how they end up not  making this room look boring.Most of time is spend in student council so it is described very well.There are also some scenes outside of the school & they still manage to do it impressively.\\n\\n\r\nThere isn't a moment in this anime where I found the characters' proportions weird plus I don't think so that I have seen this much of a single room before,lol.\\n\\n\r\nSo,9/10 for its awesomeness:)\\n\\n\\n\r\nSound:-(9/10)\\n\\n\r\nOpening & ending songs do not feel anything memorable when you hear them for the very very first time but they will gradually grew in you,especially the ending song.The opening song may sound boring at first but by the end of it you will be already trying to download it.The ending song is actually one of my favorite.It is very funny especially  \"I am Kaichou\" one is awesome & you will be laughing very hard.\\n\\n\r\nI didn't noticed the BGMS very much since I was too busy laughing but the ones I noticed were nice.They are suitable to the mood the scene is trying to give.\\n\\n\r\nVoice acting is done very well.All of the female voice actors have done a good job.I especially liked Ken's voice actor.He has put great effort on his flirty side.Even when he cries,it almost feels like he is really crying.You can see the effort being put into it.\\n\\n\\n\r\nCharacter:-(10/10)\\n\\n\r\nNow this is the department where this anime truly shines.At first you think that \"Oh no,this anime consists of usual archetypes.\" but as you see more of it you realize that are different & are explained rather well,a thing some other anime lacks.It feels like all of them can understand each other.Even the side - characters in this series are not boring.\\n\\n\r\nChizuru is a sadist who is very mature but there is an evil side to her.She loves teasing others as much as she loves our main heroine aka chan.\\n\\n\r\nAka chan...is well....aka chan,the usual bubbly,loli & childish kid,errr,I mean girl(sorry aka chan)who wants to make the student council the best one in the world.\\n\\n\r\nHave you ever seen a tomboy who is good in maths or any other subjects?If not then you will see here.Minatsu is a tomboy who is good at maths.She likes action manga & is the strongest one in the group.Also she has a bit of yuri taste(I didn't really wanted to say it,err....anyways).\\n\\n\r\nMafuyu may seem like the usual underclassman who is kind to other but can't make friends but here comes the difference.Even if she can't make friends she doesn't care about it,She is not like the usual,\"Oh,I can't make friends\" type of girls she is different because she doesn't care about it & is happy with her seitokai friends.Her BL love is absolutely entertaining.\\n\\n\r\nThe main character,Ken himself isn't boring either.In fact he is the most interesting main character in an harem or in this case HAREM-LIKE anime I have seen.Ken is a  KINDHEARTED  pervert who likes to play H-games & wants to make student council his harem simply because he loves happy endings due to an incident involving his girlfriend(I won't spoil it for you further)\\n\\n\r\nI like how the creator has took risks on her/his characters but they have come out really well.10/10 for this outstanding choice.\\n\\n\\n\r\nOverall/Enjoyment:-(10/10)\\n\\n\r\nYou will really enjoy it since enjoyment is one of the prime factors of this series.You will love the comedy & the jokes in this series.This is one of the best comedy series out there after all.If you can handle the little yaoi moments here & there then you will absolutely love it.Also remember to watch other anime before which it parodies to get a better idea of what is happening.\\n\\n\r\nHave fun & enjoy!!!^_^\\n\\n\\n",
            "date": "2011-12-29T03:53:00+00:00",
            "helpful_count": 68,
            "mal_id": 50377,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326466.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TragicRomance",
                "username": "TragicRomance"
            },
            "url": "https://myanimelist.net/reviews.php?id=50377"
        },
        {
            "content": "the characters in this story are very funny and have amusing personalities. Sugisaki never fails to amuse me because he is always over dramatizing things and he adds a lot of amusement to the series. Wishing for his harem end is a typical anime male trait, but the fact that he has it so planned out that it is beyond the expectations of a planned ending. I think Kondo-san had fun doing Sugisaki with the impressions and all...\r\nThis anime has TONS of anime refrences, such as Kuroshitsuji, Lucky Star, and Strike Witches, and others. The fact they don;t bleep it out(like they did itn hayateno gotoku and Lucky Star) is beyond me.\\n\\n\r\nThe story follows along that of most slice of life anime(i.e Lucky star-majorly) There is almost no story line, but yet one too. So its combines for ann interesting anime~. I reccommend it to anyone who like anime such as lucky star and also, if you havent seen alot of anime, i reccomend holding off on this because most of th e humor is in the refrences.",
            "date": "2009-10-28T16:51:00+00:00",
            "helpful_count": 62,
            "mal_id": 20081,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214727.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Denmark-Chan",
                "username": "Denmark-Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=20081"
        },
        {
            "content": "Editing after watching whole. Note: Read all before deciding if its helpful or not  you will find quick review under long one ......\r\nStory \"Long way\" : Oh \"Seitokai no Ichizon\" we go this anime which revolves around this student council of beautiful girls and 1 Guy ( Sugizaki Ken (Main Protagonis) So the story tells us about this Sugizaki Ken who has this painful past because of some events in middle school he was bullied and beaten up all the time after he graduated from his middle school he entered so called Hekiyou Gakuen the rumor in Hekiyou Gakuen was \" There is thisdesperate guy in 1st years who managed to get his grades to the top to enter our school and student council\" You would like to ask why ? its because of thoes 4 girls in this student council the story goes from the ending to the beginning ... and thats the best point. This is how it was: [ In Spring he meets our student council president called Sakurano Kurimu who tells him that he should try and play H-Games because in H-games every one is always happy!] -- [ In Summer he tells his classmate who he looks up the most her name is Shiina MInatsu that he wants to be like her strong and always active but she tells him that he shouldn't try to be like her but instead to find his own life] -- [ In autumn he encounters the strongest desperation of broken heart and at the same time he encounters Akaba Chizuru who helps him heal that wound] -- [In winter he is desperate and how he told himself \"She saved my life\" That was Shina Mafuiyu] So these girls and Sugizaki makes up student council because of thoes events he wanted to make them happy and entered the student council in which no mater what happens he will never let them feel lonely , sad or any other bad things ... Because of all the friendship going on this anime is one of the best.\\n\\n\\n\r\nQuick Main Story Aspects Review: If you want detailed information here it is: Sugizaki Ken is a 1st year i believe in Hekiyou Gakuen who had the worst grades but got them up just to get into student council  he had a harsh past because of some thing happening in middle school there are 4 girls Sakurano Kurimu , Shiina Minatus , Akaba Chizuru , Shiina Mafuiyu who helps him out in getting back on feet in exchange he wants to make them happy and never feel sad , lonely or depressed because he knows how it can be the first words when he entered student council were \"I love you all , lets all be happy together!\" and thats how it began other then that there are alot of parodys such as death note , haruhi suzumyia , Strike witches and etc. everything is done kind of perfectly main story with off story comedy.\\n\\n\r\nThe story is somewhat painful i would say but it is hidden by all the parody going on and its really interesting to watch such change of events. \\n\\n\r\nArt: Oh art is this lolita type almost because well duh we have this council president drawn almost as elementary school student... :D but that makes it even nicer to watch all the colors and interesting uniforms not the plain ones we always see.\\n\\n\r\nCharacters: Yeh the development is interesting it goes from one thing to another every episode with all the encounters and all the misunderstandings along side teasing that happens its perfect :D\\n\\n\r\nEnjoyment: Oh if you love comedy and you love school life if it doesn't bother you that its all about student council and few side characters then its fully enjoyable to watch.\\n\\n\r\nOverall: its an awesome comedy , romance , school life anime which will make every one to smile atleast thats  what i think :)",
            "date": "2009-12-21T10:51:00+00:00",
            "helpful_count": 40,
            "mal_id": 21587,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126837.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Poeticas",
                "username": "Poeticas"
            },
            "url": "https://myanimelist.net/reviews.php?id=21587"
        },
        {
            "content": "Bringing the otaku culture on it's  back, Seitokai no Ichizon is one of those series  that simply made to entertain us. The story tells us about the student council of the Hekiyou Gakuen, they are led by a Moe-type girl that often create a strange policy and do their strange job.  \r\nActually, there is no real plot in this anime, Seitokai no Ichizon is an episodic series that stands alone between episodes. The anime filled with parody spit out all over the place. Now, a parody series  can extremely fail if the audience didn't know what is being parodied. If youwatched some of the popular anime that exist in this anime, then you can feel the hilarious moments that created by this anime. BUT, If you don't have any idea about those anime that has been parodied, then you might feel the flat moments and think this anime is boring and not funny at all. \\n\\n\r\nThere is little fineness that we can see in the animation. Almost all of the scenes occurred  in one place with a typical style, the student council room. The character design was decent.\\n\\n\r\nAs for the sound settings, we have a well-produced sound but not really represents the symbol of this anime. It's not bad but still forgettable...\\n\\n\r\nI repeat, Seitokai no Ichizon is an episodic series while focusing on the enjoyment, the anime almost forgot the important element o a series. YES, it's the character development, a diminutive and forced development brings a cyclone to this anime. While failed in deep development, the anime successfully described the characters within, with their unique traits. These anime have a few back stories, although it's not related with the story.\\n\\n\r\nWith all hilarious moments they have, the Hekiyou Student Council did fairly well in their journey to be a well-received series. In the end, it's not a bad anime but not the greatest that ever exist. It's just a stand-alone parody theme anime that does their job, what job? Of course entertain us, the audience...",
            "date": "2015-02-14T03:50:00+00:00",
            "helpful_count": 38,
            "mal_id": 180302,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=180302"
        },
        {
            "content": "Seitokai no Ichizon: the title is enough to summarise the series in three words as the story of each epsiode unfolds. I am really fond of the intelligent jokes I encountered up the point where I rolled on the floor laughing about a hopeless protagonist that acts like an animal in heat going on about his harem and the beautiful girls that complete his entourage each with totally different personalities that only make his task harder.\r\nThe series itself is a story that holds a smaller story in every episode with little connection between them,The animation is very good especially on the student council president, theOSTs are very soothing making you think you have a somewhat duty to watch over them, but maybe that's just me.\\n\r\nFinally I want to talk about the main theme of the series,friendship, which is most important for a high schooler as they share moments of their life studying, goofing around, relying on each other for support. Such acts create bonds between people that are visibile in this series thats why I recommend it to everyone who enjoys this genre",
            "date": "2013-02-28T08:17:00+00:00",
            "helpful_count": 37,
            "mal_id": 88139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=88139"
        },
        {
            "content": "Most people complain of the first episode having not much of a plot, but the following episodes shows signs of having a plot to tie things together.\r\nGreat character designs, art is done by the same person who did the art for akane-iro ni somaru saka.\r\nCharacters have interesting personalities, especially the male lead, who unlike the usual indecisive male leads, openly aims and dreams for a harem ending.\r\nParodies and references to other animes are fast and furious in the anime, much enjoyable for those who've watched many animes. Full of comedy, similar to hayate no gotoku.",
            "date": "2009-10-22T10:08:00+00:00",
            "helpful_count": 36,
            "mal_id": 19917,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241372.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nerdzo",
                "username": "nerdzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=19917"
        },
        {
            "content": "No.\r\nThis anime embodies what I hate the most about anime, which is anime that do not know what to be, where it belongs, what it wants to portray or tell the viewer. This is a prime example of this and the fault lies entirely with the producers, because they need to deliver what fanboys want, they do not want to make good anime.\r\nThe result is something like this, and of course many others, but since this is a review, or perhaps a bit of a... mm... discussional block of text(?) I will confine myself to this production known as Seitokai no Ichizon. An anime abouta student council and their daily antics (like that's never been done before eh?).\\n\\n\r\nBut for the sake of argument; fine. It's about a student council. I was, like always, very sceptical about this anime, but I thought hey let's give it a chance, atleast for one episode. The first episode did not suck as much I thought it would, which is a good start for any anime when it encounters me as its viewer.\\n\\n\r\nSoon enough though, the problems start piling up. First of all, as my initial paragraph states, this anime does not know what it wants to portray. Parody? Sure, it had parody, it has spoofs and it tries to keep a lighthearted slice of life-ish approach to everything, but it can't stick with it. It floats around too much, it feels the need to introduce character development which in this anime should have been kept far, far, far, far away. Who the hell introduces character development in a slice of life, school parody in the 11th and 12th episode when the entire anime is 12 episodes long? It felt so misplaced I was about to drop this anime both on episode 11 and 12, but I don't like dropping anime so I kept on watching this all too predictable anime til the end and I saw a conclusion that anyone with a typewriter and normal IQ could have written.\\n\\n\r\nLike I said initially, I truly hate when anime don't know what it wants to say which basically means it; briefly passes over 10 different genres and never stays at any single one long enough to even give some small depth which in turn turns into entertainment value. This, of course, causes it to decline in quality very rapidly which is why I was going to give this anime a 3, but then I remembered a certain scene fairly early in the anime that had to do with a spoof on yaoi and I decided it was worthy of a 4.\\n\\n\r\nNo, please do not share with me your thoughts unless you agree with me, it will be too much effort for me to delete your comment from my profile.",
            "date": "2009-12-26T14:59:00+00:00",
            "helpful_count": 31,
            "mal_id": 21740,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=21740"
        },
        {
            "content": "Pending a proper review by someone else at the time of writing, let me donate my two cents after having completed Seitokai no Ichizon.  Involving a student council, as the name suggests, discussing various subjects in their room for the most part.  A student council made up of the four most popular students and the most studious student.  Unsurprisingly the four most popular are girls.  Funnily enough, or not, the most studious is a male.  So begins their story, or they say.\r\nThe real name of the series, or so I heard, is actually the Hekiou Academy Student Council Meeting Log.True to that namesake, the whole of the rather episodic plot takes place in the student council room.  Well, that's not the worst that could happen (they even warned the viewers about it in typical fourth wall demolishing fashion).  They only good thing I appreciated was the back story that runs parallel to the episodic gags of the day.  As the seasons pass, the motivation for our male lead is fleshed out.  It may seem jarringly out of place as there is no warning when there are flash backs tough.  The conclusion that is reached at the finale of sorts is the kind that brings about a warm and fuzzy feeling.\\n\\n\r\nThe art is quite characterful.  It shifts willingly between detailed shots and standard animation thoroughfare. Being a mostly cutesy little thing, I have no problem with it.  Those who have watched more anime than I will have quite a time identifying visual references, which is part of the anime.  However, since the majority of the action takes place in the student council room, it is a shame we can't see pristine backdrops for anything outside.\\n\\n\r\nOn the other hand, the sound not something to write, home or anywhere else, about.  Most of the time, you wouldn't even know its there.  But I guess that's what background music is about.  I have little to say of the voice acting either except that its adequate.  However, the Konami code in some of the endings is a nice touch in running with their style to reference everything as obviously as possible.\\n\\n\r\nSince the show lacks some what of a plot, it tries to make it up with characters.  A brave attempt as initially, we are presented with seemingly one dimensional stereotypes called main characters.  Its as the show progresses that we are shown another side.  Its brief and fleeting yet still manages to impart a small sense of triumph over the discovery.  Okay, so the president gets less comedy driven defining moments and is as happy go lucky as a lark, but that doesn't diminish her effect on the cast as a whole.  The secondary characters get their little moments too.  They support the main cast well with their infrequent interactions such as Nakameguro, our lead's bromance soul mate (or so Mafuyu likes to think).\\n\\n\r\nA good thing too.  Over reliance on over used or stale gags and references could not have possibly made this show tolerable for more than a few minutes.  That is probably why I was able to enjoy Seitokai no Ichizon. A personal favourite moment would be Elise who manages to corner her own sister, to name one of her victims, using words and trains of thought that probably shouldn't exist in someone her age yet.  Under no pretence is this show trying to do something new, but it can be enjoyable.  I don't know whether that'd make me broad of mind or simplistic but let's not go there.  As such, this review, finito!",
            "date": "2009-12-24T07:39:00+00:00",
            "helpful_count": 28,
            "mal_id": 21674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109544.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Thaiberium",
                "username": "Thaiberium"
            },
            "url": "https://myanimelist.net/reviews.php?id=21674"
        },
        {
            "content": "[Story: 5.5] The success of shows like Suzumiya Haruhi and Lucky Star has initiated many new trends – from having characters dancing in the theme songs to featuring genre-savvy meta characters as the central gimmick. Seitokai no Ichizon is yet another anime jumping onto the bandwagon, bringing with it a setting that parallels said shows. Clearly, the influences are undeniable. Again, this is understandable. Since references and parody anime has become the new fad, it is natural (expected, even) for the industry to produce more of such shows, because ultimately, the industry exist to sell itself. With that said however, it all goes back tosomething fundamental: doing something that is considered popular does not make you popular. And that’s where Seitokai no Ichizon flops.\\n\\n\r\nSeitokai got too ambitious for its own good, overestimating its own limits. Every episode, the show tries to cram in as much references as it could and here’s the problem: it merely made references, rather than crack a joke using the references it made. It is obvious that they’re merely deliberately using popular references to appeal to as much of the demographics as possible; It is often random, redundant and often lacking in any sort of punchlines. Ichizon does have a few funny moments. Then again, too few funny moments anyway.\\n\\n\r\nSeitokai is like guidebook that is supposed to teach you how to be funny so it’s crammed with lots of comedic technique, except that the author of said guidebook has no sense of humor. Theoretically, Seitokai is supposed to be funny. In reality, Seitokai is akin to the poor awkward kid who memorized the “list of top 10 jokes” and tried to make someone laugh but wasn’t good at delivering the punch line. Or just printed out the list from the internet and read it out to others, without an idea of what ‘articulation’ means. Similarly, that’s also why their attempt at things like self-deprecating humor, and sometimes hypocritical humor, is ironic for different (read: wrong) reasons.\\n\\n\r\n[Characters: 6.0] Strangely enough, a lot of the scenes that had me chuckling a little are the ones where they don’t try to randomly hurl references. It was thus quite a pity as all the unnecessary references interfered with the characters, giving them very little chance to go for a gag centered on their personalities. This also ruined some of the more sentimental scenes in the later part of the show – these scenes simply had too little time to be shown. The result is, the supposedly touching scenes felt rather shallow and forced. Not good for the characters’ development, particularly bad for Sugisaki.\\n\\n\r\nPlaying with the 4th wall is a popular meta-fictional technique that once challenged the concept of the boundary between a medium and its audience. However, this technique is now so prevalent in pop culture that it is no longer a guaranteed trump at being witty. Also, the characters used it way too often to the point of abuse. On another note, Seitokai lacked subtlety; the references are too obvious – and sometimes too blunt - to even be amusing.\\n\\n\r\n[Art: 7.0] The art quality is decent; not too shabby, but not fabulous either. Character designs are also more of above average. Well, then again, considering the show’s genre, fanciful animation isn’t exactly a prerequisite so that’s okay, I guess.\\n\\n\r\n[Music: 6.5] Nothing impressive with the music either. The theme songs are basically that of those generic harem/ rom-com sort of show but in this case I’ll assume that’s what they’re going for – though that still doesn’t change the fact that the music is rather bland.\\n\\n\r\n[Summary] Watch Hayate no Gotoku instead. Or Gintama (if you don’t mind the crude humor that goes with the parodies and references). Gosh, now I really can't wait for an anime adaptation of the manga, The World God Only Knows.",
            "date": "2010-05-08T03:36:00+00:00",
            "helpful_count": 17,
            "mal_id": 25850,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165681.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nilvius",
                "username": "Nilvius"
            },
            "url": "https://myanimelist.net/reviews.php?id=25850"
        },
        {
            "content": "\"A jack of all trades, master of none.\"\r\nthat's the impression I got after watching the first six episodes of Ichizon.\r\nWhile the promo pictures gives off the impression of some sort of Galgame, Seitokai actually focuses on humor and gags, using multiple otaku references per episode which are, undeniably, hilarious.\r\nSeitokai focuses on the student council of a particular school, consisting of four sterotypical 'moe' heroines displayed in an almost satirical way and a guy who wants to reach a 'harem end'. There is no visible plot (or yet) and it pretty much just injects a fair amount of lulz and references into some sort of situationwhich presents itself each episode, which a great amount of us wouldn't mind seeing if that was the case.\\n\\n\r\nThe problem began after the first half of the episode. In a somewhat awkard way, the show attempted to bring in some heart-warming/ somewhat depressing scenario which would propel the plot forward, creating inconsistent and confusing pacing. It feels kinda unsatisfying I guess; you want gag but they throw in the serious. you want serious they cheapen it with gags. In my case, who can't seem to comprimise in the middle, this show is around average.To reconfirm my stance, i actually went and read the manga a bit. And... it feels like an alternate retelling rather than an adaption...\\n\\n\r\nThe attiude when watching this to avoid dissapointment: \\n\r\nDon't get overhyped by the gags. getting too much excitement in your brain makes it difficult to swallow the next half. \\n\\n\r\nwell, since I'm lazy I ain't commenting on other parameters (technical-wise, it's pretty good). Despite all i've said, do have a look at Seitokai. After all, I'm known are being slightly paranoid\\n\\n\r\nPS. if you don't understand most of the technical wording in this review, you might not be for this show yet and you might miss some of the punchlines. Try something like Suzumiya Haruhi no Yuutsu or Lucky Start first. \\n\\n",
            "date": "2009-11-15T06:25:00+00:00",
            "helpful_count": 17,
            "mal_id": 20566,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/43499.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vin-nii",
                "username": "Vin-nii"
            },
            "url": "https://myanimelist.net/reviews.php?id=20566"
        },
        {
            "content": "Art (7/10)\r\nThis anime mostly took place in the Student Council room so background detail was limited to only the walls, furniture and other items in and around the room. On the rare occasion that the Seitokai was actually shown going outside for a prolonged period of time, the background details were decent; I couldn't notice any sloppy or rushed animations. As for the characters, they were well-drawn and easy to look at. \r\nCharacters (9/10)\r\nWhat I like in an anime is for the characters to be different. Variety makes for a good experience and this is exactly what Seitokai no Ichizon did. Despite using common archetypeslike the loli, the sadist, the tomboy, the shy girl and the perverted male, the combination of these characters made watching the show enjoyable. It is evident that, because of these archetypes, the gags and jokes shown in each episode work well. In a show like this, I'm not looking for character development but character compatibility instead. If characters don't fit well with each other, the comedic moments won't have as much impact. Fortunately, this is not the case with Seitokai no Ichizon. I found that all the characters' interactions were smooth and natural, with the included comedy helping to define each of the characters' personalities. \\n\\n\r\nSound (7/10)\\n\r\nMost OPs and EDs take time to grow on me but for Seitokai no Ichizon's OP, it was different. After hearing it for the first time, I immediately had to look it up and download it. It has a upbeat and catchy rhythm along with great vocals. To top it off, the seiyuus of the four Seitokai members sing it. The ED was decent but the variations didn't impress me. To be honest, the BGM was barely noticeable. I actually don't remember any of the tracks as I am writing this review. The voice acting was decent; though I don't think much \"skill\" was needed in this show when compared to those that are drama-heavy. Overall, I would say that the sounds in general met my expectations. \\n\\n\r\nStory (7/10)\\n\r\nWell, I didn't really expect much of a \"story\" given that it's a comedy and parody series. Nonetheless, the last couple of episodes did explain a bit about the main protagonist and his relationship with the other Seitokai members. There were also some bits and pieces about the lives of the other characters but nothing too significant. Since I didn't expect a story but got still got a broken but interesting one, I think I'll leave the score at a 7. \\n\\n\r\nOverall (7/10)\\n\r\nAside from the disturbing scenes with BL, I thoroughly enjoyed watching Seitokai no Ichizon. It's something that I think helps you unwind after a long day or after watching something depressing. The more anime you watch that aired before Seitokai no Ichizon, the better your experience will be when you watch it since they reference many other popular anime out there. I recommend this to almost anyone who enjoys some comedy or who is looking for some anime to kill their time with. No matter what kind of anime you may be seeking, give Seitokai no Ichizon a try. As for me, I'm going to wait for season two. Hopefully, it will provide the same feel as season one but with something new. Looking forward to it.",
            "date": "2011-07-24T19:27:00+00:00",
            "helpful_count": 15,
            "mal_id": 39877,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=39877"
        },
        {
            "content": "Allow me to share my opinion on Seitokai no Ichizon.\r\nStudent Council's Discretion (Seitokai no Ichizon) is a parody, comedy, harem anime based on the light novel by Aoi Sekina and Kira Inugami. The show was produced by Studio Deen and aired between October 2, 2009 and December 18, 2009. The anime has 12 episodes in total. \r\nStory-line (8/10)\r\nSeitokai no Ichizon doesn’t have a plot, as its episodes are standalone and the events of all episodes don’t add much to the next episodes. Every episode shows the council members chatting, instead of doing things a normal student council should do. Each episode is packed with plentyof jokes and parodies from other anime. The show doesn’t have enough characters’ development; yet, it does describe characters, which helps the viewer to form a better opinion on the anime’s cast.\\n\\n\r\nArt (8/10)\\n\\n\r\nSeitokai no Ichizon’s art style uses a mix of colors to make the show more appealing to the viewer. The show takes place mostly in the student council’s room, which is surprisingly doesn’t get boring at all. For the scenes that don’t take place in the student council room, they are beautiful to look at. The characters have all been well designed and are pleasing to look at. Overall, the show’s art style has a feel that nothing has been sloppily made, or rushed, which was, of course, a big plus of this show.\\n\\n\r\nSound (8/10)\\n\\n\r\nThe music of the opening gives the viewer a nice feeling with its cute and soft vocals, whereas the ending songs leave the viewer with a laugh, as the lyrics make fun of the otaku culture and are just funny to listen to. Each ending song is different to give the viewer something new at the end of each episode, which I liked much. The background music has been well-made, because each music piece fits the mood of what the characters are talking about. To my big surprise, all voice actors did one hell of a job voicing their characters. They were new to the industry; yet, they managed their work. \\n\\n\r\nCharacters (10/10)\\n\\n\r\nThe anime follows five members of the student council at Hekiyou Academy.\\n\\n\r\n--Kurimu Sakurano, voiced by Mariko Honda (Yuuko Aioi from Nichijou and Mazinger Z from Robot Girls Z) - is a child-like president of the student council, who acts somewhat childish and loves sweets. At the beginning of nearly every episode she writes briefings on a white board.\\n\r\n--Chizura Akaba, voiced by Yuka Saitou (Mira from High School DxD and Ritsu Kisaragi from Kiniro no Corda: Blue♪Sky) - is a sadistic secretary, who loves Kurimu and is always trying to cuddle and abuse her. \\n\r\n--Minatsu Shiina, voiced by Misuzu Togashi (Origami Tobiichi from Date A Live and Yukiteru Amano from Mirai Nikki) - is a tomboyish vice-president, who loves shounen to a point that most of her suggestions are based on them.\\n\r\n--Mafuyu Shiina, voiced by Yuki Horinaka - is Minatsu’s little sister and the club’s treasurer. She is addicted to video games and loves BL novels.\\n\r\n--Ken Sugisaki, voiced by Takashi Kondou  (Hibiki Laytis from Fairy Tail and Takumi Kaizu from _Summer) - is the valedictorian, or “blue chip” seat on the council because of being the highest scoring student. He loves to play eroge and bishoujo games. He dreams and plans to make the rest of the student council members his harem.\\n\\n\r\nEnjoyment (8/10)\\n\\n\r\nSeitokai no Ichizon is an anime that shows that a heavily detailed plot isn’t always needed to make an enjoyable anime. Its use of jokes and parodies really helps to carry the show. The anime’s cast made the show very amusing, and I found them quite likable. The message that is given to the viewer in Seitokai no Ichizon is friendship. It reminds the viewer what most high schoolers find important, being able to spend time on studying, talking, relying on others for support, and building bonds with people they like.\\n\\n\r\nOverall (8,4/10)\\n\\n\r\nSeitokai no Ichizon has a nice charm to it with its comedy. The only problem of this show is that some of the show’s jokes rely on the viewer and that the viewer should have a good experience in anime, which may be difficult for one. While there are many anime better than Seitokai no Ichizon, it may still be enjoyable for one. I recommend this show to people who like comedy and simple stories without the need for a deeper plot.",
            "date": "2015-07-02T01:49:00+00:00",
            "helpful_count": 14,
            "mal_id": 192009,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4557188.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seto_Masamune",
                "username": "Seto_Masamune"
            },
            "url": "https://myanimelist.net/reviews.php?id=192009"
        },
        {
            "content": "Seitokai no Ichizon is a parody anime, so, therefore, it would make a lot of sense for me to try to fit in as many references as I can because, why not? \r\nStory: The story of Seitokai no Ichizon revolves around 5 people who exist in a school that determine their student council via a popularity contest.  Because of that, they are usually good-looking girls.  The fifth member is always the person who scores highest on a midterm.  And so, with 4 girls and a guy, what's going to ensue?  HAREM!  or not.  With this in mind, the plotof this anime doesn't really go anywhere.  In fact, it goes nowhere.  But, for an anime that purely focuses on its characters and comedy, plot really has no need to exist, so yeah.  Think about it like \"Lucky Star\" or \"Love Hina\" if you will.\\n\\n\r\nCharacters: For the main characters, we have, as I have stated before, 4 girls and a guy.  Ken Sugisaki as literally the only guy in this anime is well, a pervert.  Constantly playing h-games and trying to set \"flags\" on the girls like Keima, his only goal in this anime is to not date one of said girls, but to create his own \"harem ending\", which basically means that he wants every girl to love him, without actually dating them.  This goal came along with the motivation to actually get into the student council and meet said girls.  Similar to animes like Love Hina, the world god only knows, and Nyarko-san.  (They all have a harem ending sort of deal).  However, this character has a more, softer side to him.  After they finish pissing about in an episode, he always accomplishes the work that they were supposed to do together, by himself.  Showing that he in fact wants the girls to be happy.  Next, Kurimu Sakurano.  As the lolita of the series, she is the oldest of the group, being a third year in high school.  As the student council president, she makes sure everyone is doing their job and no one is slacking of-hahahaha!  I can't go through with it.  Being the smallest and most child-like of the group, she basically acts like a 7-year old.  To summarize her briefly, she has a sweet tooth, she's child-like, she's horrible at school, and she's self conscious about her body.  Not really much else to say.  Next, Chizuru.  As the most \"sadistic\" one of the group, she bears resemblance to Mikako from Sora no Otoshimono, as they are both insane!  Thinking about world domination and possessing Kurimu as a servant, she truly is the most \"evil\" one out of the bunch.  It should also be noteworthy that she has a Death Note with her.  Next, Minatsu.  To put it short, Sports, fighting manga, aggressive attitude.  As the tomboy of the group, she has is basically who she is.  Not too many characteristics with her.  And finally, Minatsu's sister, Mafuyu.  As the youngest member of the student council, she possesses incredible game knowledge and doesn't really possess much of a personality other then being shy talking to guys.  As a master of games as she is, she constantly works on blogs for game strategies and love yaoi.  Yes, yaoi.  All these characters are very one-sided with very little character growth.  The side characters really have no purpose other then pose a problem or move the story along.  \\n\\n\r\nArt and sound: The character designs in this anime a incredibly well done due to how fine detailed they are.  Because the school outfits have ruffles in them, it's very plain to see how precise the creators are when it comes to designing them.  As for sound, well, it's definitely good to listen to, but not really anything to get stuck in your head.  The OP has a sort of somber feel to it which is very off putting because of how energetic this show actually is.  It doesn't really fit.  The ending however has a comedic chibi art style and is quite energetic, but not as much as it should.  In short, the soundtrack sounds good, but not as memorable as it can be.  \\n\\n\r\nPersonal Enjoyment: As a harem fan, I was pleasantly surprised on how this show would turn out.  In fact, it surpassed my initial expectations with the idea of a harem only being in one person's head, which is actually pretty funny.  The comedy in this is slapstick to a certain degree, with Japanese humor which sometimes, people don't get.  It's always funny to see the lead male get mistreated to the point of actually feeling sorry for him for suffering the abuse he gets from the girls, i.e. getting thrown into a cramped locker so the he wouldn't see the girls in swimsuits.  They sometimes break the fourth wall which is usually pretty entertaining.  i.e. the fact that they have an anime in the first place, and trying to change their characters via a sentence ending.  Ex. Squid girl's \"de geso.\"  While this show has many references that entitle it to being a parody anime, it sort of loses its touch with the amount of references it shows.  Sure, there're a bunch in the first few episodes, with its first \"opening\" in the first episode being lucky star, but to me, there should've been more references/episode.  Another turn off for me was the addition of plot.  As a comedy anime, there shouldn't be any plot whatsoever.  But the thing is, the anime tries to take itself seriously for 2-3 episodes and make it seem like an actual story.  To me, a comedy should just be pure mindless humor, and the addition of trying to make a plot just made it lose its touch.  But nonetheless, it is interesting to delve into the minds of these characters and see if there were any ties, which there are, but it doesn't really all come together as nicely as it could've.  In any case, Seitokai no Ichizon is a hilarious little short anime that almost lives up to the parody name, and I would suggest to watch it if you want to just kill time.",
            "date": "2013-09-22T19:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 113859,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=113859"
        },
        {
            "content": "Due to the fact that this anime focuses primarily on comedy I was a little hesitant in starting this series, however I was greatly surprised when this series kept its interest up for me all while sticking to its parady basis.\r\nThe art for this series was surprisingly good for a comedy, let alone any anime for that matter.  The artists did a great job on creating moving backgrounds which captures the eye of the viewer and draws you into the scene even more.  However, the backgrounds were barely used as a majority of this anime takes place in the student council room.Fear not for the characters of the student council were each beautifully drawn and their movements throughout were fluid and seamless.\\n\\n\r\nThe characters were each unique and filled all the particular slots needed for a true harem to Kens approval I am sure.  The relationship between the characters steadily grows throughout the anime despite the girls utter disrespect towards Kens goal of forming the student council into his own personal harem they still grow closer as a group as they realize each others passions and feelings.\\n\\n\r\nThe plot of this anime is souly focused around the student council and their activities with a side plot of Kens Harem.  This plot is very weak, yet through humorous chatter, a multitude of paradies (Melancholy of Haruhi Suzumiya, Death Note, Clannad, and many more), and the over all want of Kens dream to come true this series remains very entertaining.  I found myself quickly finishing this anime.\\n\\n\r\nThe comedy of Seitokai No Ichizon was hillarious.  The main reason I feel is not only because of the jokes themselves but also that each character is so well concieved that their personalities become part of each joke.  This is somehow seamlessly done within just a few episodes that it amazed me how I was able to feel connected to the characters in such a short time, without background stories and just by watching and listening to the endless banter.\\n\\n\r\nDue to the sheer volume of entertainment this anime provides I highly recommend this series and I look forward to season 2 which has been confirmed :D (http://www.ani.me/zine/anime/article/709/).  However despite the entertainment value it does lack substance in plot and character progression, but hey…its a comedy…deal with it :D. \\n\\n\r\nRating 7/10\\n\\n\r\n@GameJok3r \\n\\n\r\nhttp://animejok3r.tumblr.com",
            "date": "2011-09-16T12:29:00+00:00",
            "helpful_count": 10,
            "mal_id": 43529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=43529"
        },
        {
            "content": "There have been a lot of mixed feelings about Seitokai no Ichizon,  I for one think this anime was quite good and this is why.  (Ya I suck with introductions)\r\nAlthough Seitokai no Ichizon has no real plot to it I still found this anime very refreshing to watch.  The anime includes a ton of references and quite a bit of the material made me laugh.  However at some points I did feel that Seitokai no Ichizon overdid it with the comedy.  Even though it was fun to watch at some points I felt some of the material was really randomand it really had no point to it.\\n\\n\r\nOne of the things I really liked about Seitokai no Ichizon was the serious story at the end of the episodes.  Although at first I didn't know what it was there for in the end it all tied together in the end, which is one of the main reasons to why it got so much popularity during it's last episode.  I think that the back story behind Seitokai no Ichizon was what pulled me in because to me a comedy just for the sake of being a comedy is not good. However that is just me, other people might not like the serious story behind it.\\n\\n\r\nThe artwork for this anime was actually pretty good except it has one major flaw, about 90% of the anime took place in one room.  I don't know if this was because they had a limited animation budget or what. Other than that I really liked the artwork but since everything happened in one room I can't give it that high of a score for this category.\\n\\n\r\nThe characters were greatly done.  Each character has a distinct feature that makes them, them.  The main male lead was especially well done, I cannot put my finger on it but he just stands out from other male protagonists.  Although I liked the characters I still think they were a bit plain but not that much.\\n\\n\r\nOverall this anime is a really good time waster, it's very refreshing but it does overdo it.  If you want to watch something that would make you laugh I would recommend Seitokai no Ichizon. 7/10",
            "date": "2010-02-05T18:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 22968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=22968"
        },
        {
            "content": "Ok well this is my first review and it might be kind of weird so here we go!!... anyways Seitokai no Ichizon was an amazing anime!! It was funny, so very moe, and very entertaining. The anime is about a school council, that...well does nothing. The School council consists of 5 students, Kurimu Sakurano, the president, who has a small stature and has an insane sweet tooth, and has a lot of moe moments. Then there is Ken Sugisaki, who in my opinion is the greatest lead male character ever. He is addicted to H-games and wants to make the student council into his harem.Then the two siblings Minatsu Shiina and Mafuyu Shiina. Minatsu being the athletic one who is really into Action manga etc. and Mafuyu who talks in 3rd person throughout the whole anime, and is heavily addicted to RPG's and BL's (Boys Love). Then last but not least there is Chizuru Akaba who is probably the most intimidating person...ever. Thought she has one of the cutest moments ever :3. The art work for the anime is very well done! It was a delight to watch and everyones character was unique in a way. Everyone ('cept for Ken) has moe moments that are just soo adorable you just have to rewind the video. And with great character design comes great voice acting too. Each character has a voice that matched their appearance! And in my opinion Mafuyu and Ken had the best voices. The anime is extremely funny and makes refrences too almost everything out there. For example on the first episode within the first 5 min then make fun of Dragonball Evolution! (the crappy american made dragonball live action movie that we all wish never existed). But this anime does have one drawback. (in my opinion) This anime makes references to a lot of other anime out there and knowing what they are referring is what makes it funnier, and more enjoyable. So if you are just starting to watch anime i don't recommend this one just yet. Watch a bunch of other anime first then watch this one. This anime is very funny and cute, tho it doesn't have a super deep story line, it has one that is pretty decent and the anime ends in a nice fashion. Hope for season 2 X3",
            "date": "2010-05-29T20:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 26578,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/285564.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bakatsu",
                "username": "Bakatsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=26578"
        },
        {
            "content": "This is my very first review on MAL,and I 've decided that it's going to be about my favourite fall season show which just ended recently,Seitokai no Ichizon.This review might contain grammar mistakes and wrong uses of words,since I myself am not a native speaker to begin with.however,I'd be very glad if someone found this useful.\r\nPlease notice that the overall ratings doesn't show how much I like this show.It's just the average of all the aspects like animation or sound,etc...Therefore it should provide you a true and fair view about how enjoyable this show is in my opinion\r\nStory:left out\r\nAs mentioned,SnI is a show about theendless chatting of a group of teenagers in the student council room.There's not much thing going on,therefore I decided to leave out the rating for the story,since it might be unfair to do the rating for such a serie like this\\n\r\nSound:9/10\\n\r\nSnI features a bunch of rookie voice actors (4/5 of the main cast had their first debut in the show).However, I must say that they did a really great job there.The voices greatly suit the characters's personalities and successfully reflect them,from the shy,BL and games addict Mafuyu to the \"so-called\" tsundere Minatsu;the manipulative and dark but mature and kind hearted Chizuru and the childish Prez.And,of course we can't forget about Kondo Takashi,a rather experienced voice actor who did a really great job in dubbing Sugizaki Ken.Put all of them together in a show and you are sure to experience fast-paced,gatling gun conversation exchanges,which I found to be very exciting and unique on its own.The BGM is nothing special,as well as the OP song,althought the varieties of the ED songs might be a plus point(there is 1 ED for each episode!!!)\\n\r\nCharacter:9/10\\n\r\nAt a glance,the cast of SnI might seem to be nothing special,a harem consisting of a specific group of girls:a student council president,a tsundere,a shy girl and a mature one;and a main lead.However,each an every character has their own traits which make them very unique.The Prez is a loli inside-out,the tsundere doesn't have any \"dere\" at all as well as being good at maths and athletic(very contrary,I know) ,the mature girl is a bit of a sadist and a lesbian while also being manipulative herself,and the common shy girl also happens to be a game addict and a BL lovers(which gives wings to many of her fantasies between the main lead and a certain boy).And,unlike your common harem,the girls hardly show any feelings towards the boy,results in the show having no \"romance\" tag\\n\r\ndespite being a harem anime.And,last but not least is the main protagonist,Sugizaki Ken,who serves as a punch-line character,a harem lead without any usual wishy-washiness as he declared to conquer the student council and make them his own harem but actually is a good boy at heart.\\n\r\nThe rest of the cast is also interesting.I had to admit that Elise is one of the most(if not the most) interesting and manipulative loli I've ever seen,despite her cute appearance.\\n\r\nArt:7/10\\n\r\nThe art is above average.The character designs are cute,however as the show features mainly in a room,there is not much thing to say about it\\n\r\nEnjoyment:8/10\\n\r\nAs a parody show it requires a bit of experience in watching anime to fully appreciate all the jokes and parodies(personally I could only catch 70% of the references after having watched anime for 5 years),therefore it might be not that good for people who just start watching anime .The drama is a bit lame as it only gives us a vague idea about Sugizaki Ken's past.The fan service is suprisingly good an humourous since more than half of them coming from the main lead's fantasies.Overall,it is really an enjoyable show and my favourite for the fall season\\n\r\nThank you for reading.Hope this can be useful for you",
            "date": "2010-01-03T13:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 21998,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokoronoato",
                "username": "kokoronoato"
            },
            "url": "https://myanimelist.net/reviews.php?id=21998"
        }
    ],
    [
        {
            "content": "*Hekiou Academy Student Council Meeting Log*\r\n“… I am Kaicho (president), I am KaichoO! By the way, does the president do anything?” – excerpt from episode 11’s ending theme. \r\nWhat happens when four pretty girls and one handsome guy spend most of their school time everyday in a confined room? Naughty thoughts aside, if you were thinking “oh my god, not another harem” then you were right! Seitokai no Ichizon is NOT a harem, strictly speaking (though our male protagonist tries very hard to make it so). In reality the poor dude gets bully by his female mates more than he ever deserves. So who mightthis anime be good for? If you are looking for a parody that pokes fun at itself and the entire anime industry in general, then Seitokai no Ichizon will surely meet and most likely exceed your expectation! In fact not only does it do a good job with the too-frequent parodies, but with high quality animation, and impressive new ending themes every episode, Seitokai no Ichizon is a great anime for all ages.\\n\\n\r\nThe story of Seitokai no Ichizon centers around the everyday “adventure” of the student council in Hekiyou Gakuen high school. Its setting primarily consists of one place, the student council room, although exceptions do occur in the show from time to time. Now you must be wondering, what can a show that limits itself to one cramped room has to offer? Surprisingly the answer is, plenty. With plenty of jokes and plenty of parodies targeted at other recent well known anime, there is never one boring moment in the show for viewers to complain about. Even if the story itself does not attract the viewers enough due to its random episodic events, but by combining the story with the character interactions, nice consistent animation, superb voice acting, and addictive soundtracks and theme songs, Seitokai no Ichizon has some of the deadliest combination to make it stand on its own ground.\\n\\n\r\nIt was interesting for the characters to repeatedly admit that “nothing ever happens” in their show. And yet they never fail to entertain the viewers with what they can do to make the show appealing solely by chatting. In fact, it is hard to judge these characters in any normal anime standard because they are out of the ordinary. As the casts themselves have put it, “This is where we end after airing twelve episodes? … The main character is supposed to mature after a time (but) … nothing changed.”. They poke fun at their own lack of character growth, but in actuality most characters have had their fair share of developments through learning about each others’ past or family problems. The characters certainly made a positive impact to the overall success of Seitokai no Ichizon due to their unpredictability.\\n\\n\r\nThe animation is nothing but greatness. The characters are very nicely designed and even the one and only classroom is very detailed in design with a large variety of decorations and hidden rooms. Fluid scene to scene transition, consistent high quality animation, and a great choice of “scenery” also made Seitokai no Ichizon very attractive to the eyes. Additionally, comedic-like faces on the characters whenever a random chat start appearing also helps crack people up. The animation definitely is another strong point that makes up for the lack of story.\\n\\n\r\nAt first I was very skeptical with the seiyu in this show because all the main female leads are apparently voiced by rookies. Yes, they are ALL rookies. New to the anime industry, these female seiyu all tried exceptionally hard to make themselves stand out as a bright star. Unfortunately they were all excellent in voicing their roles so I could not say who seem to be the most talented (unlike in other shows where one can clearly tell some seiyu just don’t go well with the particular role at all). It is, however, quite clear that these voices bring life to the characters in the series and bring entertainment to the viewers.\\n\\n\r\nSpecial honorary mention goes to the ending themes. Whether they are good or not, one must admit it was creative of the producers to make a unique ending song (same rhythm different lyrics) for each episode thus resulting in a total of TWELEVE ending themes. Even without the lyrics (and I strongly urge you not to miss them), the songs in itself is tremendously addictive. In fact, I could dance around my room all day with the song set on repeat in my computer. The opening, while less catchy, is still very pleasant to hear and once again it showed us the talents these new seiyu possess.\\n\\n\r\nSeitokai no Ichizon is a wonderful addition to the anime industry and made itself stood out among the mist of millions of other similar anime largely due to its parody at poking fun at itself and everything anime-related. The jokes are never too old or too repetitive throughout the show and the references are relatively simple to grasp (provided you are semi-familiar with recent anime). Keep in mind the show is made in Japan and is intended for Japanese viewers who most likely have a more knowledgeable database of the anime series in Japan than we do. If you don’t seem to be able to spot a parody or two in an episode, chances are, you have already missed out on some of the jokes they are making fun of. In that case, you should reconsider whether to continue watching the series or not. Lastly I would recommend anyone who have trouble at school, whether it is your grade or having trouble making friends, to try playing love simulation games (ie. harem games)!",
            "date": "2009-12-24T19:29:00+00:00",
            "helpful_count": 305,
            "mal_id": 21688,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=21688"
        },
        {
            "content": "Parody and comedy are a staple genre in the anime world and sometimes can be hit or miss.  This is because to truly understand parody you have enough experience with the things that are being parodied.  As a foreigner to Japan and the majority of its culture, a great deal of this goes over my head as it would a foreigner trying to understand some of the humor from my own country.  All of that being said some things are universally funny in comedy and that brings us to Seitokai no Ichizon, an anime that forgets to deliver the most important elementa comedy must have... humor.\\n\\n\r\nThere isn’t any real story in Ichizon.  The episodes are loosely tied together for the most part and center on the exploits of a high school student council.  While shows revolving around clubs and student councils are quite common, initially Ichizon appeared to be unique.  However the freshness of the series quickly wanes as I found just getting through each new episode was somehow a test of my patience and sanity.  I really wanted to like this series as well but as it went on and on I found it more torturous to watch.\\n\\n\r\nIs Ichizon bad anime?  Not really.  It’s just incredibly boring anime.  And that is the main problem it has.  Let’s begin with the humor.  The parody and comedy is way too forced and thus doesn’t have any flow to it.  It’s almost as if the writers thought the more anime and culture references they could pile in the funnier people would think it was without any regard to whether or not the jokes were actually, well funny.  Just because I can recognize that something is being lampooned or a joke is being told doesn’t mean it’s funny.  Sure there were many things I did find amusing and a few that I actually did laugh out loud at, but for the most part Ichizon is humorless and clichéd. \\n\\n\r\nThe other main issue with the series as a whole is its claustrophobic setting.  90% of the series takes place in the student council room.  Even when they do leave the confines of that room then they soon seal themselves up in yet another small room.  Had the jokes and parody actually been funny, this might not have been such a problem but each episode is mostly just the five of them sitting around a table screaming, talking at the speed of light, or spouting whatever cliché or stereotype their personality type is based on.\\n\\n\r\nThe ending is also rather bizarre.  While Ichizon by its own admission doesn’t take itself very seriously, the rather somber and serious nature of some of the last few episodes felt very much out of place.  For something was all about randomness and silliness this was a strange course to take.  It's a bit ironic that these episodes were actually the best ones in the series, which makes you wonder how much better it could have been as a whole if it had worked on developing the plot to lead up to them.\\n\\n\r\nAmong Ichizon's characters, only Sugisaki Ken stands out in any way.  With most harem type shows the male lead is usually the dullest and most uninteresting character in the show.  Not so in Ken's case as he manages to carry the series by himself.  Pretty much the only times I really laughed was because of something he said or did.  The various girls of the council all have their own quirks but they all miss the same thing, actual personality.  Sure they were all adorable and cute to look at but each of them had two or three personality traits that were just used over and over making each of them less substantive than cotton candy.\\n\\n\r\nArtistically I found the characters to be very pretty and the styles and costumes were appealing.  However because the series is set in a rather dull and plain club room that means there is little in the way of backgrounds and that makes the show as a whole to seem more drab and uninteresting than it really should have been.  So while I found the art and animation to be very good, its setting brings it down much as it did with the story.\\n\\n\r\nWhat I did find refreshing was an almost totally fresh faced seiyuu cast.  In a time when the same dozen or so actors are reused ad nauseum it is really nice to hear some new blood.  That being said the performances really aren’t that strong and in the end sound just like what we are used to hearing already.  The music is fluffy and cute and not all that interesting.  Though some of the ending remixes were funny, particularly the one from episode 11. \\n\\n\r\nIchizon in the end is disposable anime.  Its worth a few laughs and then meant to be throw away.  I doubt that anyone in a couple of years will even remember this show even existed.  Its a real shame since as I said before, I really wanted to like it.  While I don’t think it’s really terrible and maybe overall not quite as bad as I rated it, it was so boring and unenjoyable that it was painful to complete.  If you are fairly new to anime or haven’t seen more than a couple hundred shows you might find this to be pretty good.  For the more experienced viewer though, Seitokai no Ichizon is likely to be a disappointment.\\n\\n\\n",
            "date": "2010-01-31T10:27:00+00:00",
            "helpful_count": 184,
            "mal_id": 22835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=22835"
        },
        {
            "content": "You know, Suzumiya Haruhi no Yuutsu has a lot to answer for. For a while there it felt like anime, as a medium, had decided to be a bit more inventive, a bit more creative. Hope is a great thing, no?\r\nTo be fair, what happened next wasn't really the fault of SHnY, but the damage was already done. Beginning with Lucky Star, which was a pretty good comedy for the most part, the slippery slope of formulaic school based parody shows with a supposedly eclectic set of characters who literally do nothing rapidly became a tiresome methodology, with numerous shows following this trend until theadvent of Seitokai no Ichizon (The Student Council's Discretion). \\n\\n\r\nThe story is based on a series of light novels, published from January 2008, by Aoi Sekina (with illustrations by Inugami Kira). Now one would think that an adaptation of a novel would have a bit more depth to it, but Seitokai no Ichizon seems to follow only one path - try to please as many people as possible.\\n\\n\r\nIt's no surprise then that the show really struggles with plot coherency and development, especially as, barring a particularly dull sub plot, there isn't really any point to the story. The whole series is set, for the most part, within the confines of the Student Council Office, and while this may at first appear to be an orginal approach, one should remember that SHnY, amongst others, had very similar settings. The big problem with confining the story to a specific area is that there is a only so much the writers can do to develop the plot. Thankfully (maybe), Seitokai no Ichizon doesn't really try to develop what little plot it has, and is content to follow the path set by Lucky Star - lots of parodies, sketches and jokes while the characters do nothing.\\n\\n\r\nNow, one could consider the comedy in this show to be funny, and some of it actually is, but the fact remains that much of the humour has actually been done better in other shows (or do I need to mention Gintama). In addition to this, the series makes a great show of trying to get the audience involved, a bit like a really bad Christmas pantomime, but this effort begins to cool after the first few episodes. Instead of going down the route of actually showing how a typical student council works, and adding humour to that premise, Seitokai no Ichizon travels at breakneck speed towards one of the most pointless and inconclusive outcomes I've ever seen. \\n\\n\r\nIn all honesty, the one saving grace the series has in terms of it's story and plot is that I found some of the jokes to be funny, but even that wore off pretty quickly.\\n\\n\r\nNow don't get me wrong here. There isn't anything specifically wrong with Seitokai no Ichizon per se, especially as there have been other shows that have little to no back story, and arecompletely relian on parody, humour and audience partcipation. However, this shouldn't come at the cost of the characters, ir even of the humour itself, and it's unfortuante that the series has fallen into that trap. While the show resoundingly denies that it's a harem anime, the tried and tested stereotypes are available throughout the story, and the series has the feeling of being written by someone who really does believe they know what the audience wants, even when it comes to looks.\\n\\n\r\nThat's right. Seitokai no Ichizon is very clearly on the moe bandwagon, especially when it comes to character designs. From the fiery tempered tsundere to the outspoken loli. From the silent but deadly hot chick, to the shy and withdrawn bundle of cuteness. This series makes no bones about who it's target audience is, and it targets that market with a certain degree of ruthlessness.  \\n\\n\r\nThat said, there hasn't really been a lot of thought as to how the characters should look. The presentation is that same, tiresome, fanservice tinged moe that that makes up up over half of the school based comedies around to date. While the presentation is pretty decent, one can't help but wonder why the cast doesn't feature anyone with any kind of physical blemish. The backgrounds and backdrops also follow a similarly over-simplistic style, espcially as most of the show is set in the student council office. \\n\\n\r\nAs for animation, well, it's actually pretty good, especially during the parodies. The choregrpahy and animation design isn't the greatest, however it does serve it's purpose in that the whole show is simply a joke delivery system, and as such, there isn't really any need for top quality animation and CG. The characters move reasonably well for the most part, however the series looks and feels very similar to a host of others, and that is one of it's biggest problems.\\n\\n\r\nIn terms of sound, Seitokai no Ichizon isn't too bad really. The OP, a boppy little J-Pop track called \"Treasure\", is sung by most of the cast and, aside from being fairly well chorepgraphed, is nothing to write home about. The ED, on the other hand, is where things get a little more interesting as the series features a variety of ending themes that are sung by at least two members of the cast. \\n\\n\r\nThat said, they're still forgettable J-Pop songs.\\n\\n\r\nActing-wise, the show is reaonably well represented, especially as the four main female leads are relative newcomers to anime. Given that fact, it wouldn't actually be unreasonable to assume that the entire show is nothing more than a platform to launch their respective careers (it's been done before after all). That said, there is some merit to their, and the rest of the cast's, performances as the characters, barring one or two annoying voices, are pretty well portrayed for this type of show.\\n\\n\r\nAs for the characters themselves, well, where do I begin? The fact that this is an epsiodic parody harem comedy should give you a hint as to what you should expect. While the series is extremely moe-centric, the characters are all nothing more than stereotypes of the first order and, while they are reasonably good in that respect, at the end of the day that's all they are. The show tries to add some deeper meaning to the characters, especially to Sugisaki Ken, but these efforts don't fit in to the plot in any substantial manner, and serve as nothing more than distractions from the comedy. The characters don't develop in any manner that is both plausible, and in keeping with the story, and this is the main reason why the series is so reliant on the comedy content.\\n\\n\r\nThere will be those who laud Seitokai no Ichizon for a number of perfectly valid reasons, and in certain respects it's a good series to watch. It's quirky, humourous, and somewhat engaging, and I will freely admit that it managed to make me chuckle, especially with Mafuyu's burning passion for BL. That said, the series could easily have taken things one step futher by throwing out all the stereotypes and going for something truly original as the parody would have had far more impact in that way. It's a shame then, that the show tries to take the more satirical path and tie it to parody as the two don't easily mesh, so what's left is a mish-mash of jokes and sketches that jump from one to another like a frog on a hot rock, and coherency is the first to fall victim to the lacklustre plot.\\n\\n\r\nAll in all, this isn't a bad show, but it's not really a shining example either. Fans of shows like Lucky Star, Hyakko, PaniPoni Dash, and even SHnY, may find the series enjoyable, but may also find that much of the humour is a bit flat, or has been done better elsewhere. It's sad to say, but those who haven't had the opportunity to watch this type of series before may find this far enjoyable. It all depends on one's perspective.\\n\\n\r\nOn the whole, this isn't the best example of a parody anime. Gintama, Lucky Star, even Jungle wa Itsumo Hale Nochi Guu, give parody it's due, and use the gags in unusual and original ways. Seitokai no Ichizon, on the other hand, tends to stick to formula, and it's efforts to try and please everyone is the main reason why the show is as mediocre as it isl.\\n\\n\\n\\n",
            "date": "2009-12-26T12:02:00+00:00",
            "helpful_count": 170,
            "mal_id": 21727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=21727"
        },
        {
            "content": "\"What happens when you have 4 beautiful girls,a good-looking guy,a student council,parodies & comedy?Yes,you are right,the answer is HAREM,oh,no I mean Seitokai no Ichizon.This anime is a parody so you better be prepared before you watch this anime.Watch other anime it parodies or else you won't understand the jokes in a better way\"\r\n(Story:-8/10)\r\nThere isn't a linear plot in this anime i.e. each episode begins & ends randomly.The student council consists of 5 members.The first 4 student council members are chosen by votes.The top four who get most votes gets to be in the student council while 5th spot is for the student who gets mostgrades.We have our 4 beautiful girls Aka-chan,Mafuyu,Chizuru & Minatsu who got their positions due to being well-liked by everyone while Ken who got in council simply by his hard work & good marks but his reason of joining it or more like the motivation of all of the study he did  is........only to form a harem.Sounds pretty generic,doesn't it?but it isn't.In fact it is better than most of harem anime I have seen.\\n\\n\r\nAlmost the whole show occurs in a simple room which is obviously student council where all the members have fun almost all the time & do work only if they really have to do it.Afterall,They are not a ordinary student council.The majority of the show is spent in doing parodies of other anime like Lucky star,Suzumiya haruhi,Death Note,etc with reference of some others like baka test.\\n\\n\r\nThere are also Mafuyu's crazy yaoi fantasies like she wants Ken to end up with her imaginative Nakameguro-kun or with his nii-san,who of course do not exist.These parts are really funny & you will be laughing really hard even if you are against yaoi.\\n\\n\r\nOften Ken mentions this student council to be a place of his dreams,a harem only to be beaten up or to be shut up by the girls.There is also a journalism club that likes to degrade council by spreading false news lead by Lilicia but that is only for comedic reasons.\\n\\n\r\n 8/10 since the plot is very random.\\n\\n\\n\r\nArt:-(9/10)\\n\\n\r\nThe art of this anime is very clean & beautiful.It is not rushed & each area is explained carefully.The characters designs are also drawn beautifully & they look awesome.\\n\\n\r\nThe backgrounds are also very impressive.Since most of this anime occurs in a single room so I am amazed how they end up not  making this room look boring.Most of time is spend in student council so it is described very well.There are also some scenes outside of the school & they still manage to do it impressively.\\n\\n\r\nThere isn't a moment in this anime where I found the characters' proportions weird plus I don't think so that I have seen this much of a single room before,lol.\\n\\n\r\nSo,9/10 for its awesomeness:)\\n\\n\\n\r\nSound:-(9/10)\\n\\n\r\nOpening & ending songs do not feel anything memorable when you hear them for the very very first time but they will gradually grew in you,especially the ending song.The opening song may sound boring at first but by the end of it you will be already trying to download it.The ending song is actually one of my favorite.It is very funny especially  \"I am Kaichou\" one is awesome & you will be laughing very hard.\\n\\n\r\nI didn't noticed the BGMS very much since I was too busy laughing but the ones I noticed were nice.They are suitable to the mood the scene is trying to give.\\n\\n\r\nVoice acting is done very well.All of the female voice actors have done a good job.I especially liked Ken's voice actor.He has put great effort on his flirty side.Even when he cries,it almost feels like he is really crying.You can see the effort being put into it.\\n\\n\\n\r\nCharacter:-(10/10)\\n\\n\r\nNow this is the department where this anime truly shines.At first you think that \"Oh no,this anime consists of usual archetypes.\" but as you see more of it you realize that are different & are explained rather well,a thing some other anime lacks.It feels like all of them can understand each other.Even the side - characters in this series are not boring.\\n\\n\r\nChizuru is a sadist who is very mature but there is an evil side to her.She loves teasing others as much as she loves our main heroine aka chan.\\n\\n\r\nAka chan...is well....aka chan,the usual bubbly,loli & childish kid,errr,I mean girl(sorry aka chan)who wants to make the student council the best one in the world.\\n\\n\r\nHave you ever seen a tomboy who is good in maths or any other subjects?If not then you will see here.Minatsu is a tomboy who is good at maths.She likes action manga & is the strongest one in the group.Also she has a bit of yuri taste(I didn't really wanted to say it,err....anyways).\\n\\n\r\nMafuyu may seem like the usual underclassman who is kind to other but can't make friends but here comes the difference.Even if she can't make friends she doesn't care about it,She is not like the usual,\"Oh,I can't make friends\" type of girls she is different because she doesn't care about it & is happy with her seitokai friends.Her BL love is absolutely entertaining.\\n\\n\r\nThe main character,Ken himself isn't boring either.In fact he is the most interesting main character in an harem or in this case HAREM-LIKE anime I have seen.Ken is a  KINDHEARTED  pervert who likes to play H-games & wants to make student council his harem simply because he loves happy endings due to an incident involving his girlfriend(I won't spoil it for you further)\\n\\n\r\nI like how the creator has took risks on her/his characters but they have come out really well.10/10 for this outstanding choice.\\n\\n\\n\r\nOverall/Enjoyment:-(10/10)\\n\\n\r\nYou will really enjoy it since enjoyment is one of the prime factors of this series.You will love the comedy & the jokes in this series.This is one of the best comedy series out there after all.If you can handle the little yaoi moments here & there then you will absolutely love it.Also remember to watch other anime before which it parodies to get a better idea of what is happening.\\n\\n\r\nHave fun & enjoy!!!^_^\\n\\n\\n",
            "date": "2011-12-29T03:53:00+00:00",
            "helpful_count": 68,
            "mal_id": 50377,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326466.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TragicRomance",
                "username": "TragicRomance"
            },
            "url": "https://myanimelist.net/reviews.php?id=50377"
        },
        {
            "content": "the characters in this story are very funny and have amusing personalities. Sugisaki never fails to amuse me because he is always over dramatizing things and he adds a lot of amusement to the series. Wishing for his harem end is a typical anime male trait, but the fact that he has it so planned out that it is beyond the expectations of a planned ending. I think Kondo-san had fun doing Sugisaki with the impressions and all...\r\nThis anime has TONS of anime refrences, such as Kuroshitsuji, Lucky Star, and Strike Witches, and others. The fact they don;t bleep it out(like they did itn hayateno gotoku and Lucky Star) is beyond me.\\n\\n\r\nThe story follows along that of most slice of life anime(i.e Lucky star-majorly) There is almost no story line, but yet one too. So its combines for ann interesting anime~. I reccommend it to anyone who like anime such as lucky star and also, if you havent seen alot of anime, i reccomend holding off on this because most of th e humor is in the refrences.",
            "date": "2009-10-28T16:51:00+00:00",
            "helpful_count": 62,
            "mal_id": 20081,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214727.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Denmark-Chan",
                "username": "Denmark-Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=20081"
        },
        {
            "content": "Editing after watching whole. Note: Read all before deciding if its helpful or not  you will find quick review under long one ......\r\nStory \"Long way\" : Oh \"Seitokai no Ichizon\" we go this anime which revolves around this student council of beautiful girls and 1 Guy ( Sugizaki Ken (Main Protagonis) So the story tells us about this Sugizaki Ken who has this painful past because of some events in middle school he was bullied and beaten up all the time after he graduated from his middle school he entered so called Hekiyou Gakuen the rumor in Hekiyou Gakuen was \" There is thisdesperate guy in 1st years who managed to get his grades to the top to enter our school and student council\" You would like to ask why ? its because of thoes 4 girls in this student council the story goes from the ending to the beginning ... and thats the best point. This is how it was: [ In Spring he meets our student council president called Sakurano Kurimu who tells him that he should try and play H-Games because in H-games every one is always happy!] -- [ In Summer he tells his classmate who he looks up the most her name is Shiina MInatsu that he wants to be like her strong and always active but she tells him that he shouldn't try to be like her but instead to find his own life] -- [ In autumn he encounters the strongest desperation of broken heart and at the same time he encounters Akaba Chizuru who helps him heal that wound] -- [In winter he is desperate and how he told himself \"She saved my life\" That was Shina Mafuiyu] So these girls and Sugizaki makes up student council because of thoes events he wanted to make them happy and entered the student council in which no mater what happens he will never let them feel lonely , sad or any other bad things ... Because of all the friendship going on this anime is one of the best.\\n\\n\\n\r\nQuick Main Story Aspects Review: If you want detailed information here it is: Sugizaki Ken is a 1st year i believe in Hekiyou Gakuen who had the worst grades but got them up just to get into student council  he had a harsh past because of some thing happening in middle school there are 4 girls Sakurano Kurimu , Shiina Minatus , Akaba Chizuru , Shiina Mafuiyu who helps him out in getting back on feet in exchange he wants to make them happy and never feel sad , lonely or depressed because he knows how it can be the first words when he entered student council were \"I love you all , lets all be happy together!\" and thats how it began other then that there are alot of parodys such as death note , haruhi suzumyia , Strike witches and etc. everything is done kind of perfectly main story with off story comedy.\\n\\n\r\nThe story is somewhat painful i would say but it is hidden by all the parody going on and its really interesting to watch such change of events. \\n\\n\r\nArt: Oh art is this lolita type almost because well duh we have this council president drawn almost as elementary school student... :D but that makes it even nicer to watch all the colors and interesting uniforms not the plain ones we always see.\\n\\n\r\nCharacters: Yeh the development is interesting it goes from one thing to another every episode with all the encounters and all the misunderstandings along side teasing that happens its perfect :D\\n\\n\r\nEnjoyment: Oh if you love comedy and you love school life if it doesn't bother you that its all about student council and few side characters then its fully enjoyable to watch.\\n\\n\r\nOverall: its an awesome comedy , romance , school life anime which will make every one to smile atleast thats  what i think :)",
            "date": "2009-12-21T10:51:00+00:00",
            "helpful_count": 40,
            "mal_id": 21587,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/126837.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Poeticas",
                "username": "Poeticas"
            },
            "url": "https://myanimelist.net/reviews.php?id=21587"
        },
        {
            "content": "Bringing the otaku culture on it's  back, Seitokai no Ichizon is one of those series  that simply made to entertain us. The story tells us about the student council of the Hekiyou Gakuen, they are led by a Moe-type girl that often create a strange policy and do their strange job.  \r\nActually, there is no real plot in this anime, Seitokai no Ichizon is an episodic series that stands alone between episodes. The anime filled with parody spit out all over the place. Now, a parody series  can extremely fail if the audience didn't know what is being parodied. If youwatched some of the popular anime that exist in this anime, then you can feel the hilarious moments that created by this anime. BUT, If you don't have any idea about those anime that has been parodied, then you might feel the flat moments and think this anime is boring and not funny at all. \\n\\n\r\nThere is little fineness that we can see in the animation. Almost all of the scenes occurred  in one place with a typical style, the student council room. The character design was decent.\\n\\n\r\nAs for the sound settings, we have a well-produced sound but not really represents the symbol of this anime. It's not bad but still forgettable...\\n\\n\r\nI repeat, Seitokai no Ichizon is an episodic series while focusing on the enjoyment, the anime almost forgot the important element o a series. YES, it's the character development, a diminutive and forced development brings a cyclone to this anime. While failed in deep development, the anime successfully described the characters within, with their unique traits. These anime have a few back stories, although it's not related with the story.\\n\\n\r\nWith all hilarious moments they have, the Hekiyou Student Council did fairly well in their journey to be a well-received series. In the end, it's not a bad anime but not the greatest that ever exist. It's just a stand-alone parody theme anime that does their job, what job? Of course entertain us, the audience...",
            "date": "2015-02-14T03:50:00+00:00",
            "helpful_count": 38,
            "mal_id": 180302,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=180302"
        },
        {
            "content": "Seitokai no Ichizon: the title is enough to summarise the series in three words as the story of each epsiode unfolds. I am really fond of the intelligent jokes I encountered up the point where I rolled on the floor laughing about a hopeless protagonist that acts like an animal in heat going on about his harem and the beautiful girls that complete his entourage each with totally different personalities that only make his task harder.\r\nThe series itself is a story that holds a smaller story in every episode with little connection between them,The animation is very good especially on the student council president, theOSTs are very soothing making you think you have a somewhat duty to watch over them, but maybe that's just me.\\n\r\nFinally I want to talk about the main theme of the series,friendship, which is most important for a high schooler as they share moments of their life studying, goofing around, relying on each other for support. Such acts create bonds between people that are visibile in this series thats why I recommend it to everyone who enjoys this genre",
            "date": "2013-02-28T08:17:00+00:00",
            "helpful_count": 37,
            "mal_id": 88139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=88139"
        },
        {
            "content": "Most people complain of the first episode having not much of a plot, but the following episodes shows signs of having a plot to tie things together.\r\nGreat character designs, art is done by the same person who did the art for akane-iro ni somaru saka.\r\nCharacters have interesting personalities, especially the male lead, who unlike the usual indecisive male leads, openly aims and dreams for a harem ending.\r\nParodies and references to other animes are fast and furious in the anime, much enjoyable for those who've watched many animes. Full of comedy, similar to hayate no gotoku.",
            "date": "2009-10-22T10:08:00+00:00",
            "helpful_count": 36,
            "mal_id": 19917,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241372.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nerdzo",
                "username": "nerdzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=19917"
        },
        {
            "content": "No.\r\nThis anime embodies what I hate the most about anime, which is anime that do not know what to be, where it belongs, what it wants to portray or tell the viewer. This is a prime example of this and the fault lies entirely with the producers, because they need to deliver what fanboys want, they do not want to make good anime.\r\nThe result is something like this, and of course many others, but since this is a review, or perhaps a bit of a... mm... discussional block of text(?) I will confine myself to this production known as Seitokai no Ichizon. An anime abouta student council and their daily antics (like that's never been done before eh?).\\n\\n\r\nBut for the sake of argument; fine. It's about a student council. I was, like always, very sceptical about this anime, but I thought hey let's give it a chance, atleast for one episode. The first episode did not suck as much I thought it would, which is a good start for any anime when it encounters me as its viewer.\\n\\n\r\nSoon enough though, the problems start piling up. First of all, as my initial paragraph states, this anime does not know what it wants to portray. Parody? Sure, it had parody, it has spoofs and it tries to keep a lighthearted slice of life-ish approach to everything, but it can't stick with it. It floats around too much, it feels the need to introduce character development which in this anime should have been kept far, far, far, far away. Who the hell introduces character development in a slice of life, school parody in the 11th and 12th episode when the entire anime is 12 episodes long? It felt so misplaced I was about to drop this anime both on episode 11 and 12, but I don't like dropping anime so I kept on watching this all too predictable anime til the end and I saw a conclusion that anyone with a typewriter and normal IQ could have written.\\n\\n\r\nLike I said initially, I truly hate when anime don't know what it wants to say which basically means it; briefly passes over 10 different genres and never stays at any single one long enough to even give some small depth which in turn turns into entertainment value. This, of course, causes it to decline in quality very rapidly which is why I was going to give this anime a 3, but then I remembered a certain scene fairly early in the anime that had to do with a spoof on yaoi and I decided it was worthy of a 4.\\n\\n\r\nNo, please do not share with me your thoughts unless you agree with me, it will be too much effort for me to delete your comment from my profile.",
            "date": "2009-12-26T14:59:00+00:00",
            "helpful_count": 31,
            "mal_id": 21740,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=21740"
        },
        {
            "content": "Pending a proper review by someone else at the time of writing, let me donate my two cents after having completed Seitokai no Ichizon.  Involving a student council, as the name suggests, discussing various subjects in their room for the most part.  A student council made up of the four most popular students and the most studious student.  Unsurprisingly the four most popular are girls.  Funnily enough, or not, the most studious is a male.  So begins their story, or they say.\r\nThe real name of the series, or so I heard, is actually the Hekiou Academy Student Council Meeting Log.True to that namesake, the whole of the rather episodic plot takes place in the student council room.  Well, that's not the worst that could happen (they even warned the viewers about it in typical fourth wall demolishing fashion).  They only good thing I appreciated was the back story that runs parallel to the episodic gags of the day.  As the seasons pass, the motivation for our male lead is fleshed out.  It may seem jarringly out of place as there is no warning when there are flash backs tough.  The conclusion that is reached at the finale of sorts is the kind that brings about a warm and fuzzy feeling.\\n\\n\r\nThe art is quite characterful.  It shifts willingly between detailed shots and standard animation thoroughfare. Being a mostly cutesy little thing, I have no problem with it.  Those who have watched more anime than I will have quite a time identifying visual references, which is part of the anime.  However, since the majority of the action takes place in the student council room, it is a shame we can't see pristine backdrops for anything outside.\\n\\n\r\nOn the other hand, the sound not something to write, home or anywhere else, about.  Most of the time, you wouldn't even know its there.  But I guess that's what background music is about.  I have little to say of the voice acting either except that its adequate.  However, the Konami code in some of the endings is a nice touch in running with their style to reference everything as obviously as possible.\\n\\n\r\nSince the show lacks some what of a plot, it tries to make it up with characters.  A brave attempt as initially, we are presented with seemingly one dimensional stereotypes called main characters.  Its as the show progresses that we are shown another side.  Its brief and fleeting yet still manages to impart a small sense of triumph over the discovery.  Okay, so the president gets less comedy driven defining moments and is as happy go lucky as a lark, but that doesn't diminish her effect on the cast as a whole.  The secondary characters get their little moments too.  They support the main cast well with their infrequent interactions such as Nakameguro, our lead's bromance soul mate (or so Mafuyu likes to think).\\n\\n\r\nA good thing too.  Over reliance on over used or stale gags and references could not have possibly made this show tolerable for more than a few minutes.  That is probably why I was able to enjoy Seitokai no Ichizon. A personal favourite moment would be Elise who manages to corner her own sister, to name one of her victims, using words and trains of thought that probably shouldn't exist in someone her age yet.  Under no pretence is this show trying to do something new, but it can be enjoyable.  I don't know whether that'd make me broad of mind or simplistic but let's not go there.  As such, this review, finito!",
            "date": "2009-12-24T07:39:00+00:00",
            "helpful_count": 28,
            "mal_id": 21674,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/109544.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Thaiberium",
                "username": "Thaiberium"
            },
            "url": "https://myanimelist.net/reviews.php?id=21674"
        },
        {
            "content": "[Story: 5.5] The success of shows like Suzumiya Haruhi and Lucky Star has initiated many new trends – from having characters dancing in the theme songs to featuring genre-savvy meta characters as the central gimmick. Seitokai no Ichizon is yet another anime jumping onto the bandwagon, bringing with it a setting that parallels said shows. Clearly, the influences are undeniable. Again, this is understandable. Since references and parody anime has become the new fad, it is natural (expected, even) for the industry to produce more of such shows, because ultimately, the industry exist to sell itself. With that said however, it all goes back tosomething fundamental: doing something that is considered popular does not make you popular. And that’s where Seitokai no Ichizon flops.\\n\\n\r\nSeitokai got too ambitious for its own good, overestimating its own limits. Every episode, the show tries to cram in as much references as it could and here’s the problem: it merely made references, rather than crack a joke using the references it made. It is obvious that they’re merely deliberately using popular references to appeal to as much of the demographics as possible; It is often random, redundant and often lacking in any sort of punchlines. Ichizon does have a few funny moments. Then again, too few funny moments anyway.\\n\\n\r\nSeitokai is like guidebook that is supposed to teach you how to be funny so it’s crammed with lots of comedic technique, except that the author of said guidebook has no sense of humor. Theoretically, Seitokai is supposed to be funny. In reality, Seitokai is akin to the poor awkward kid who memorized the “list of top 10 jokes” and tried to make someone laugh but wasn’t good at delivering the punch line. Or just printed out the list from the internet and read it out to others, without an idea of what ‘articulation’ means. Similarly, that’s also why their attempt at things like self-deprecating humor, and sometimes hypocritical humor, is ironic for different (read: wrong) reasons.\\n\\n\r\n[Characters: 6.0] Strangely enough, a lot of the scenes that had me chuckling a little are the ones where they don’t try to randomly hurl references. It was thus quite a pity as all the unnecessary references interfered with the characters, giving them very little chance to go for a gag centered on their personalities. This also ruined some of the more sentimental scenes in the later part of the show – these scenes simply had too little time to be shown. The result is, the supposedly touching scenes felt rather shallow and forced. Not good for the characters’ development, particularly bad for Sugisaki.\\n\\n\r\nPlaying with the 4th wall is a popular meta-fictional technique that once challenged the concept of the boundary between a medium and its audience. However, this technique is now so prevalent in pop culture that it is no longer a guaranteed trump at being witty. Also, the characters used it way too often to the point of abuse. On another note, Seitokai lacked subtlety; the references are too obvious – and sometimes too blunt - to even be amusing.\\n\\n\r\n[Art: 7.0] The art quality is decent; not too shabby, but not fabulous either. Character designs are also more of above average. Well, then again, considering the show’s genre, fanciful animation isn’t exactly a prerequisite so that’s okay, I guess.\\n\\n\r\n[Music: 6.5] Nothing impressive with the music either. The theme songs are basically that of those generic harem/ rom-com sort of show but in this case I’ll assume that’s what they’re going for – though that still doesn’t change the fact that the music is rather bland.\\n\\n\r\n[Summary] Watch Hayate no Gotoku instead. Or Gintama (if you don’t mind the crude humor that goes with the parodies and references). Gosh, now I really can't wait for an anime adaptation of the manga, The World God Only Knows.",
            "date": "2010-05-08T03:36:00+00:00",
            "helpful_count": 17,
            "mal_id": 25850,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165681.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nilvius",
                "username": "Nilvius"
            },
            "url": "https://myanimelist.net/reviews.php?id=25850"
        },
        {
            "content": "\"A jack of all trades, master of none.\"\r\nthat's the impression I got after watching the first six episodes of Ichizon.\r\nWhile the promo pictures gives off the impression of some sort of Galgame, Seitokai actually focuses on humor and gags, using multiple otaku references per episode which are, undeniably, hilarious.\r\nSeitokai focuses on the student council of a particular school, consisting of four sterotypical 'moe' heroines displayed in an almost satirical way and a guy who wants to reach a 'harem end'. There is no visible plot (or yet) and it pretty much just injects a fair amount of lulz and references into some sort of situationwhich presents itself each episode, which a great amount of us wouldn't mind seeing if that was the case.\\n\\n\r\nThe problem began after the first half of the episode. In a somewhat awkard way, the show attempted to bring in some heart-warming/ somewhat depressing scenario which would propel the plot forward, creating inconsistent and confusing pacing. It feels kinda unsatisfying I guess; you want gag but they throw in the serious. you want serious they cheapen it with gags. In my case, who can't seem to comprimise in the middle, this show is around average.To reconfirm my stance, i actually went and read the manga a bit. And... it feels like an alternate retelling rather than an adaption...\\n\\n\r\nThe attiude when watching this to avoid dissapointment: \\n\r\nDon't get overhyped by the gags. getting too much excitement in your brain makes it difficult to swallow the next half. \\n\\n\r\nwell, since I'm lazy I ain't commenting on other parameters (technical-wise, it's pretty good). Despite all i've said, do have a look at Seitokai. After all, I'm known are being slightly paranoid\\n\\n\r\nPS. if you don't understand most of the technical wording in this review, you might not be for this show yet and you might miss some of the punchlines. Try something like Suzumiya Haruhi no Yuutsu or Lucky Start first. \\n\\n",
            "date": "2009-11-15T06:25:00+00:00",
            "helpful_count": 17,
            "mal_id": 20566,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/43499.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vin-nii",
                "username": "Vin-nii"
            },
            "url": "https://myanimelist.net/reviews.php?id=20566"
        },
        {
            "content": "Art (7/10)\r\nThis anime mostly took place in the Student Council room so background detail was limited to only the walls, furniture and other items in and around the room. On the rare occasion that the Seitokai was actually shown going outside for a prolonged period of time, the background details were decent; I couldn't notice any sloppy or rushed animations. As for the characters, they were well-drawn and easy to look at. \r\nCharacters (9/10)\r\nWhat I like in an anime is for the characters to be different. Variety makes for a good experience and this is exactly what Seitokai no Ichizon did. Despite using common archetypeslike the loli, the sadist, the tomboy, the shy girl and the perverted male, the combination of these characters made watching the show enjoyable. It is evident that, because of these archetypes, the gags and jokes shown in each episode work well. In a show like this, I'm not looking for character development but character compatibility instead. If characters don't fit well with each other, the comedic moments won't have as much impact. Fortunately, this is not the case with Seitokai no Ichizon. I found that all the characters' interactions were smooth and natural, with the included comedy helping to define each of the characters' personalities. \\n\\n\r\nSound (7/10)\\n\r\nMost OPs and EDs take time to grow on me but for Seitokai no Ichizon's OP, it was different. After hearing it for the first time, I immediately had to look it up and download it. It has a upbeat and catchy rhythm along with great vocals. To top it off, the seiyuus of the four Seitokai members sing it. The ED was decent but the variations didn't impress me. To be honest, the BGM was barely noticeable. I actually don't remember any of the tracks as I am writing this review. The voice acting was decent; though I don't think much \"skill\" was needed in this show when compared to those that are drama-heavy. Overall, I would say that the sounds in general met my expectations. \\n\\n\r\nStory (7/10)\\n\r\nWell, I didn't really expect much of a \"story\" given that it's a comedy and parody series. Nonetheless, the last couple of episodes did explain a bit about the main protagonist and his relationship with the other Seitokai members. There were also some bits and pieces about the lives of the other characters but nothing too significant. Since I didn't expect a story but got still got a broken but interesting one, I think I'll leave the score at a 7. \\n\\n\r\nOverall (7/10)\\n\r\nAside from the disturbing scenes with BL, I thoroughly enjoyed watching Seitokai no Ichizon. It's something that I think helps you unwind after a long day or after watching something depressing. The more anime you watch that aired before Seitokai no Ichizon, the better your experience will be when you watch it since they reference many other popular anime out there. I recommend this to almost anyone who enjoys some comedy or who is looking for some anime to kill their time with. No matter what kind of anime you may be seeking, give Seitokai no Ichizon a try. As for me, I'm going to wait for season two. Hopefully, it will provide the same feel as season one but with something new. Looking forward to it.",
            "date": "2011-07-24T19:27:00+00:00",
            "helpful_count": 15,
            "mal_id": 39877,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=39877"
        },
        {
            "content": "Allow me to share my opinion on Seitokai no Ichizon.\r\nStudent Council's Discretion (Seitokai no Ichizon) is a parody, comedy, harem anime based on the light novel by Aoi Sekina and Kira Inugami. The show was produced by Studio Deen and aired between October 2, 2009 and December 18, 2009. The anime has 12 episodes in total. \r\nStory-line (8/10)\r\nSeitokai no Ichizon doesn’t have a plot, as its episodes are standalone and the events of all episodes don’t add much to the next episodes. Every episode shows the council members chatting, instead of doing things a normal student council should do. Each episode is packed with plentyof jokes and parodies from other anime. The show doesn’t have enough characters’ development; yet, it does describe characters, which helps the viewer to form a better opinion on the anime’s cast.\\n\\n\r\nArt (8/10)\\n\\n\r\nSeitokai no Ichizon’s art style uses a mix of colors to make the show more appealing to the viewer. The show takes place mostly in the student council’s room, which is surprisingly doesn’t get boring at all. For the scenes that don’t take place in the student council room, they are beautiful to look at. The characters have all been well designed and are pleasing to look at. Overall, the show’s art style has a feel that nothing has been sloppily made, or rushed, which was, of course, a big plus of this show.\\n\\n\r\nSound (8/10)\\n\\n\r\nThe music of the opening gives the viewer a nice feeling with its cute and soft vocals, whereas the ending songs leave the viewer with a laugh, as the lyrics make fun of the otaku culture and are just funny to listen to. Each ending song is different to give the viewer something new at the end of each episode, which I liked much. The background music has been well-made, because each music piece fits the mood of what the characters are talking about. To my big surprise, all voice actors did one hell of a job voicing their characters. They were new to the industry; yet, they managed their work. \\n\\n\r\nCharacters (10/10)\\n\\n\r\nThe anime follows five members of the student council at Hekiyou Academy.\\n\\n\r\n--Kurimu Sakurano, voiced by Mariko Honda (Yuuko Aioi from Nichijou and Mazinger Z from Robot Girls Z) - is a child-like president of the student council, who acts somewhat childish and loves sweets. At the beginning of nearly every episode she writes briefings on a white board.\\n\r\n--Chizura Akaba, voiced by Yuka Saitou (Mira from High School DxD and Ritsu Kisaragi from Kiniro no Corda: Blue♪Sky) - is a sadistic secretary, who loves Kurimu and is always trying to cuddle and abuse her. \\n\r\n--Minatsu Shiina, voiced by Misuzu Togashi (Origami Tobiichi from Date A Live and Yukiteru Amano from Mirai Nikki) - is a tomboyish vice-president, who loves shounen to a point that most of her suggestions are based on them.\\n\r\n--Mafuyu Shiina, voiced by Yuki Horinaka - is Minatsu’s little sister and the club’s treasurer. She is addicted to video games and loves BL novels.\\n\r\n--Ken Sugisaki, voiced by Takashi Kondou  (Hibiki Laytis from Fairy Tail and Takumi Kaizu from _Summer) - is the valedictorian, or “blue chip” seat on the council because of being the highest scoring student. He loves to play eroge and bishoujo games. He dreams and plans to make the rest of the student council members his harem.\\n\\n\r\nEnjoyment (8/10)\\n\\n\r\nSeitokai no Ichizon is an anime that shows that a heavily detailed plot isn’t always needed to make an enjoyable anime. Its use of jokes and parodies really helps to carry the show. The anime’s cast made the show very amusing, and I found them quite likable. The message that is given to the viewer in Seitokai no Ichizon is friendship. It reminds the viewer what most high schoolers find important, being able to spend time on studying, talking, relying on others for support, and building bonds with people they like.\\n\\n\r\nOverall (8,4/10)\\n\\n\r\nSeitokai no Ichizon has a nice charm to it with its comedy. The only problem of this show is that some of the show’s jokes rely on the viewer and that the viewer should have a good experience in anime, which may be difficult for one. While there are many anime better than Seitokai no Ichizon, it may still be enjoyable for one. I recommend this show to people who like comedy and simple stories without the need for a deeper plot.",
            "date": "2015-07-02T01:49:00+00:00",
            "helpful_count": 14,
            "mal_id": 192009,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4557188.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seto_Masamune",
                "username": "Seto_Masamune"
            },
            "url": "https://myanimelist.net/reviews.php?id=192009"
        },
        {
            "content": "Seitokai no Ichizon is a parody anime, so, therefore, it would make a lot of sense for me to try to fit in as many references as I can because, why not? \r\nStory: The story of Seitokai no Ichizon revolves around 5 people who exist in a school that determine their student council via a popularity contest.  Because of that, they are usually good-looking girls.  The fifth member is always the person who scores highest on a midterm.  And so, with 4 girls and a guy, what's going to ensue?  HAREM!  or not.  With this in mind, the plotof this anime doesn't really go anywhere.  In fact, it goes nowhere.  But, for an anime that purely focuses on its characters and comedy, plot really has no need to exist, so yeah.  Think about it like \"Lucky Star\" or \"Love Hina\" if you will.\\n\\n\r\nCharacters: For the main characters, we have, as I have stated before, 4 girls and a guy.  Ken Sugisaki as literally the only guy in this anime is well, a pervert.  Constantly playing h-games and trying to set \"flags\" on the girls like Keima, his only goal in this anime is to not date one of said girls, but to create his own \"harem ending\", which basically means that he wants every girl to love him, without actually dating them.  This goal came along with the motivation to actually get into the student council and meet said girls.  Similar to animes like Love Hina, the world god only knows, and Nyarko-san.  (They all have a harem ending sort of deal).  However, this character has a more, softer side to him.  After they finish pissing about in an episode, he always accomplishes the work that they were supposed to do together, by himself.  Showing that he in fact wants the girls to be happy.  Next, Kurimu Sakurano.  As the lolita of the series, she is the oldest of the group, being a third year in high school.  As the student council president, she makes sure everyone is doing their job and no one is slacking of-hahahaha!  I can't go through with it.  Being the smallest and most child-like of the group, she basically acts like a 7-year old.  To summarize her briefly, she has a sweet tooth, she's child-like, she's horrible at school, and she's self conscious about her body.  Not really much else to say.  Next, Chizuru.  As the most \"sadistic\" one of the group, she bears resemblance to Mikako from Sora no Otoshimono, as they are both insane!  Thinking about world domination and possessing Kurimu as a servant, she truly is the most \"evil\" one out of the bunch.  It should also be noteworthy that she has a Death Note with her.  Next, Minatsu.  To put it short, Sports, fighting manga, aggressive attitude.  As the tomboy of the group, she has is basically who she is.  Not too many characteristics with her.  And finally, Minatsu's sister, Mafuyu.  As the youngest member of the student council, she possesses incredible game knowledge and doesn't really possess much of a personality other then being shy talking to guys.  As a master of games as she is, she constantly works on blogs for game strategies and love yaoi.  Yes, yaoi.  All these characters are very one-sided with very little character growth.  The side characters really have no purpose other then pose a problem or move the story along.  \\n\\n\r\nArt and sound: The character designs in this anime a incredibly well done due to how fine detailed they are.  Because the school outfits have ruffles in them, it's very plain to see how precise the creators are when it comes to designing them.  As for sound, well, it's definitely good to listen to, but not really anything to get stuck in your head.  The OP has a sort of somber feel to it which is very off putting because of how energetic this show actually is.  It doesn't really fit.  The ending however has a comedic chibi art style and is quite energetic, but not as much as it should.  In short, the soundtrack sounds good, but not as memorable as it can be.  \\n\\n\r\nPersonal Enjoyment: As a harem fan, I was pleasantly surprised on how this show would turn out.  In fact, it surpassed my initial expectations with the idea of a harem only being in one person's head, which is actually pretty funny.  The comedy in this is slapstick to a certain degree, with Japanese humor which sometimes, people don't get.  It's always funny to see the lead male get mistreated to the point of actually feeling sorry for him for suffering the abuse he gets from the girls, i.e. getting thrown into a cramped locker so the he wouldn't see the girls in swimsuits.  They sometimes break the fourth wall which is usually pretty entertaining.  i.e. the fact that they have an anime in the first place, and trying to change their characters via a sentence ending.  Ex. Squid girl's \"de geso.\"  While this show has many references that entitle it to being a parody anime, it sort of loses its touch with the amount of references it shows.  Sure, there're a bunch in the first few episodes, with its first \"opening\" in the first episode being lucky star, but to me, there should've been more references/episode.  Another turn off for me was the addition of plot.  As a comedy anime, there shouldn't be any plot whatsoever.  But the thing is, the anime tries to take itself seriously for 2-3 episodes and make it seem like an actual story.  To me, a comedy should just be pure mindless humor, and the addition of trying to make a plot just made it lose its touch.  But nonetheless, it is interesting to delve into the minds of these characters and see if there were any ties, which there are, but it doesn't really all come together as nicely as it could've.  In any case, Seitokai no Ichizon is a hilarious little short anime that almost lives up to the parody name, and I would suggest to watch it if you want to just kill time.",
            "date": "2013-09-22T19:43:00+00:00",
            "helpful_count": 10,
            "mal_id": 113859,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=113859"
        },
        {
            "content": "Due to the fact that this anime focuses primarily on comedy I was a little hesitant in starting this series, however I was greatly surprised when this series kept its interest up for me all while sticking to its parady basis.\r\nThe art for this series was surprisingly good for a comedy, let alone any anime for that matter.  The artists did a great job on creating moving backgrounds which captures the eye of the viewer and draws you into the scene even more.  However, the backgrounds were barely used as a majority of this anime takes place in the student council room.Fear not for the characters of the student council were each beautifully drawn and their movements throughout were fluid and seamless.\\n\\n\r\nThe characters were each unique and filled all the particular slots needed for a true harem to Kens approval I am sure.  The relationship between the characters steadily grows throughout the anime despite the girls utter disrespect towards Kens goal of forming the student council into his own personal harem they still grow closer as a group as they realize each others passions and feelings.\\n\\n\r\nThe plot of this anime is souly focused around the student council and their activities with a side plot of Kens Harem.  This plot is very weak, yet through humorous chatter, a multitude of paradies (Melancholy of Haruhi Suzumiya, Death Note, Clannad, and many more), and the over all want of Kens dream to come true this series remains very entertaining.  I found myself quickly finishing this anime.\\n\\n\r\nThe comedy of Seitokai No Ichizon was hillarious.  The main reason I feel is not only because of the jokes themselves but also that each character is so well concieved that their personalities become part of each joke.  This is somehow seamlessly done within just a few episodes that it amazed me how I was able to feel connected to the characters in such a short time, without background stories and just by watching and listening to the endless banter.\\n\\n\r\nDue to the sheer volume of entertainment this anime provides I highly recommend this series and I look forward to season 2 which has been confirmed :D (http://www.ani.me/zine/anime/article/709/).  However despite the entertainment value it does lack substance in plot and character progression, but hey…its a comedy…deal with it :D. \\n\\n\r\nRating 7/10\\n\\n\r\n@GameJok3r \\n\\n\r\nhttp://animejok3r.tumblr.com",
            "date": "2011-09-16T12:29:00+00:00",
            "helpful_count": 10,
            "mal_id": 43529,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/532191.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/gamejok3r",
                "username": "gamejok3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=43529"
        },
        {
            "content": "There have been a lot of mixed feelings about Seitokai no Ichizon,  I for one think this anime was quite good and this is why.  (Ya I suck with introductions)\r\nAlthough Seitokai no Ichizon has no real plot to it I still found this anime very refreshing to watch.  The anime includes a ton of references and quite a bit of the material made me laugh.  However at some points I did feel that Seitokai no Ichizon overdid it with the comedy.  Even though it was fun to watch at some points I felt some of the material was really randomand it really had no point to it.\\n\\n\r\nOne of the things I really liked about Seitokai no Ichizon was the serious story at the end of the episodes.  Although at first I didn't know what it was there for in the end it all tied together in the end, which is one of the main reasons to why it got so much popularity during it's last episode.  I think that the back story behind Seitokai no Ichizon was what pulled me in because to me a comedy just for the sake of being a comedy is not good. However that is just me, other people might not like the serious story behind it.\\n\\n\r\nThe artwork for this anime was actually pretty good except it has one major flaw, about 90% of the anime took place in one room.  I don't know if this was because they had a limited animation budget or what. Other than that I really liked the artwork but since everything happened in one room I can't give it that high of a score for this category.\\n\\n\r\nThe characters were greatly done.  Each character has a distinct feature that makes them, them.  The main male lead was especially well done, I cannot put my finger on it but he just stands out from other male protagonists.  Although I liked the characters I still think they were a bit plain but not that much.\\n\\n\r\nOverall this anime is a really good time waster, it's very refreshing but it does overdo it.  If you want to watch something that would make you laugh I would recommend Seitokai no Ichizon. 7/10",
            "date": "2010-02-05T18:34:00+00:00",
            "helpful_count": 9,
            "mal_id": 22968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=22968"
        },
        {
            "content": "Ok well this is my first review and it might be kind of weird so here we go!!... anyways Seitokai no Ichizon was an amazing anime!! It was funny, so very moe, and very entertaining. The anime is about a school council, that...well does nothing. The School council consists of 5 students, Kurimu Sakurano, the president, who has a small stature and has an insane sweet tooth, and has a lot of moe moments. Then there is Ken Sugisaki, who in my opinion is the greatest lead male character ever. He is addicted to H-games and wants to make the student council into his harem.Then the two siblings Minatsu Shiina and Mafuyu Shiina. Minatsu being the athletic one who is really into Action manga etc. and Mafuyu who talks in 3rd person throughout the whole anime, and is heavily addicted to RPG's and BL's (Boys Love). Then last but not least there is Chizuru Akaba who is probably the most intimidating person...ever. Thought she has one of the cutest moments ever :3. The art work for the anime is very well done! It was a delight to watch and everyones character was unique in a way. Everyone ('cept for Ken) has moe moments that are just soo adorable you just have to rewind the video. And with great character design comes great voice acting too. Each character has a voice that matched their appearance! And in my opinion Mafuyu and Ken had the best voices. The anime is extremely funny and makes refrences too almost everything out there. For example on the first episode within the first 5 min then make fun of Dragonball Evolution! (the crappy american made dragonball live action movie that we all wish never existed). But this anime does have one drawback. (in my opinion) This anime makes references to a lot of other anime out there and knowing what they are referring is what makes it funnier, and more enjoyable. So if you are just starting to watch anime i don't recommend this one just yet. Watch a bunch of other anime first then watch this one. This anime is very funny and cute, tho it doesn't have a super deep story line, it has one that is pretty decent and the anime ends in a nice fashion. Hope for season 2 X3",
            "date": "2010-05-29T20:28:00+00:00",
            "helpful_count": 9,
            "mal_id": 26578,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/285564.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bakatsu",
                "username": "Bakatsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=26578"
        },
        {
            "content": "This is my very first review on MAL,and I 've decided that it's going to be about my favourite fall season show which just ended recently,Seitokai no Ichizon.This review might contain grammar mistakes and wrong uses of words,since I myself am not a native speaker to begin with.however,I'd be very glad if someone found this useful.\r\nPlease notice that the overall ratings doesn't show how much I like this show.It's just the average of all the aspects like animation or sound,etc...Therefore it should provide you a true and fair view about how enjoyable this show is in my opinion\r\nStory:left out\r\nAs mentioned,SnI is a show about theendless chatting of a group of teenagers in the student council room.There's not much thing going on,therefore I decided to leave out the rating for the story,since it might be unfair to do the rating for such a serie like this\\n\r\nSound:9/10\\n\r\nSnI features a bunch of rookie voice actors (4/5 of the main cast had their first debut in the show).However, I must say that they did a really great job there.The voices greatly suit the characters's personalities and successfully reflect them,from the shy,BL and games addict Mafuyu to the \"so-called\" tsundere Minatsu;the manipulative and dark but mature and kind hearted Chizuru and the childish Prez.And,of course we can't forget about Kondo Takashi,a rather experienced voice actor who did a really great job in dubbing Sugizaki Ken.Put all of them together in a show and you are sure to experience fast-paced,gatling gun conversation exchanges,which I found to be very exciting and unique on its own.The BGM is nothing special,as well as the OP song,althought the varieties of the ED songs might be a plus point(there is 1 ED for each episode!!!)\\n\r\nCharacter:9/10\\n\r\nAt a glance,the cast of SnI might seem to be nothing special,a harem consisting of a specific group of girls:a student council president,a tsundere,a shy girl and a mature one;and a main lead.However,each an every character has their own traits which make them very unique.The Prez is a loli inside-out,the tsundere doesn't have any \"dere\" at all as well as being good at maths and athletic(very contrary,I know) ,the mature girl is a bit of a sadist and a lesbian while also being manipulative herself,and the common shy girl also happens to be a game addict and a BL lovers(which gives wings to many of her fantasies between the main lead and a certain boy).And,unlike your common harem,the girls hardly show any feelings towards the boy,results in the show having no \"romance\" tag\\n\r\ndespite being a harem anime.And,last but not least is the main protagonist,Sugizaki Ken,who serves as a punch-line character,a harem lead without any usual wishy-washiness as he declared to conquer the student council and make them his own harem but actually is a good boy at heart.\\n\r\nThe rest of the cast is also interesting.I had to admit that Elise is one of the most(if not the most) interesting and manipulative loli I've ever seen,despite her cute appearance.\\n\r\nArt:7/10\\n\r\nThe art is above average.The character designs are cute,however as the show features mainly in a room,there is not much thing to say about it\\n\r\nEnjoyment:8/10\\n\r\nAs a parody show it requires a bit of experience in watching anime to fully appreciate all the jokes and parodies(personally I could only catch 70% of the references after having watched anime for 5 years),therefore it might be not that good for people who just start watching anime .The drama is a bit lame as it only gives us a vague idea about Sugizaki Ken's past.The fan service is suprisingly good an humourous since more than half of them coming from the main lead's fantasies.Overall,it is really an enjoyable show and my favourite for the fall season\\n\r\nThank you for reading.Hope this can be useful for you",
            "date": "2010-01-03T13:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 21998,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokoronoato",
                "username": "kokoronoato"
            },
            "url": "https://myanimelist.net/reviews.php?id=21998"
        }
    ],
    [
        {
            "content": "Seitokai no Ichizon- a.k.a average ecchi anime is the main tag here. Even being an \"average\" ecchi anime, Personally, I enjoyed this anime from the first episode to the last. But that's only personally, and SURELY this anime won't appeal to everyone.\r\nMain character is Ken Sugisaki, being the only male in the Student council club while all the other club members are all females. Well, that does sound like a average ecchi/harem anime! Nothing special.\r\nStory- No story. Nothing. All its about is random events and chatter of the members of the student council club. Although Ken Sugisaki has one objective, which is to make theclub his own harem. He repeats it in each episode, but in the end, only gets bullied/ beaten up by the other council members. To put it simply, he is only a perverted idiot who cares about his objective- and I mean to make the club his own harem. There were many parodies involving Suzumiya haruhi, Death note, Higurashi No Naku Koro Ni and even Resident Evil(a.k.a Biohazard) which I knew. There were also many other parodies, but I didn't recognize them. I think the only flaw of this anime was the story, but also it is a big flaw.\\n\\n\r\nArt- Graphics/animation is amazing, that's for sure. Nothing bad to talk about in this section. Well, many anime made in these modern times mostly had good graphics/animation of course.\\n\\n\r\nSound- Voice-acting was good and suited to their characters. Opening Theme and ending theme was also very good. Personally I found the OP very \"catchy\".\\n\\n\r\nCharacter- Characters were all nicely \"designed\" and had funny attitudes. Personally, I liked all the characters in the anime. Nothing bad here.\\n\\n\r\nEnjoyment- Well, It was funny, but not really that funny. It gave me few giggles and chuckles but not to extreme laughter. Some episodes revealed the council members' pasts and that was enjoyable. I recognized most of the parodies but also some I didn't know of, which led me to blankness. I didn't know what they were talking about sometimes. It is funny only if you understand. Well, that's only small flaw I found in this section.\\n\\n\r\nOverall- Seitokai no Ichizon can be a good anime to watch for some people, but not to all. Lets say, maybe 50% chance that you might like it and a 50% that you might despise this anime. I only recommend it to anyone who likes ecchi/comedy/drama anime. And of course its also recommended to anyone who likes random stuff.",
            "date": "2010-01-09T21:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 22258,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/34830.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Radeon",
                "username": "Radeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=22258"
        },
        {
            "content": "Never judge a book by its cover. Sounds cliche and overused, but this doesn't ring truer to this particular anime. At first I was confused: was this a comedy, a slice-of-life, or somewhere in between? Why wasn't this straightforward? It didn't matter; I fell in love with each and every character. This wasn't the typical slice of life, because something bigger was working behind the scenes, something larger than each character's problem, one that would eventually tie everything together.\r\nStory: 8/10\r\nA little background: Sugisaki is one lucky man. The student council at Hekiyou Gakuen are chosen by popularity vote, and it so happens that all 4of the members are girls. There's a fifth slot, however, for one student with the best grades in the school: and that happens to be Sugisaki. It's his dream come true, literally: he openly discusses his desire for a true harem, often inviting the girls to make his dreams come true, but of course that never happens. What may seem like a happy, carefree, go-lucky student council quickly changes as certain pasts are revealed and conflicts arise...\\n\\n\r\nIt's weird, though, honestly: I expected this to be complacent, slice-of-life I could sit back and enjoy thoroughly. There were subtle hints here and there, showing that their pasts couldn't hide forever under their seemingly implacable demeanor. Student council life is tough: it requires work, determination, skill, people skills, and other notable traits. However, the council generally goofs off while Sugisaki, the stupid one, the one that obsesses with adult games and harem fantasies, stays after and does the council's work all by himself. The girls don't take much notice of this until later, when they realize the reasons why.\\n\\n\r\nArt: 8/10\\n\\n\r\nNothing special here, but nothing bland either. There was enough detail to please the eyes, sometimes much more than needed. That's never a bad thing; usually the art never disappointed me. However, I couldn't give it a higher score simply because since the anime mainly stayed in one room, nothing much changed. Also, the art never went above and beyond, so I can't give it a superior score because it simply didn't impress me. I did enjoy the OP and ED a lot, especially the chibi animation in the ED. Cute. The characters were drawn short-ish, differently, with wide eyes and child-like expressions at most times. Lovely.\\n\\n\r\nSound: 8/10\\n\\n\r\nThe sound wasn't anything crazy either. I didn't see anything insanely amazing, but there wasn't anything horrid either. The background music was pleasant, soothing. The OP was catchy and fast, making the lighthearted mood seem even more lighthearted. The ED was similarly bright and cheery, but it makes the underlying serious theme a little dumb-downed. The voice-acting, though nothing special, satisfied me immensely and solidified the characters well. I loved the sound-effects and other little things, like Sugisaki's adult games or the sounds of them in general.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nHere we have a classic set-up: a tsundere, a serious one,  two sisters that are nothing alike, and a guy that loves women of every caliber and trait. However, as the anime progressed, their interactions melded in such a way that it was different than the norm. I thoroughly enjoyed the backstory and how it was slowly revealed. Loved it. However, many of the characters stayed static and didn't change all that much. Though that was disappointing, there was also the fact that there were only 12 episodes, so there wasn't much time to even develop different personalities. But in that short amount of time, Sugisaki, Kurimu, and the others really grew on me.\\n\\n\r\nOverall, this wasn't a bad anime, and I was very entertained for the ridiculously short 12 episodes. Loved the way it was presented, loved the way the characters interacted, and loved the music. I was entertained and satisfied, though not to an \"ZOMG THIS IS AMAZING\" but just extremely content and I wouldn't want this any other way. It was presented well, kept me wanting more, and made me happy the entire time because the comedy was pretty stellar (as well as making frequent references to other anime - those were gems). Remember, never, ever judge a book by its cover; give the book a chance and you might just uncover something that'll change you forever.",
            "date": "2012-06-17T20:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 63681,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/726905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ibelucas",
                "username": "Ibelucas"
            },
            "url": "https://myanimelist.net/reviews.php?id=63681"
        },
        {
            "content": "First off, we’ll start with the characters.  Sugisaki is our main character, and his personality is easily described as a pervert with a heart of gold.  Unlike many other ecchi or harem series, it’s quite explicit that he’s a pervert.  He constantly thinks of situations in terms of hentai games and his goal in life is to achieve the “harem ending.”  That said, he is fiercely loyal and protective to the girls in the student council and is a generally kind and unselfish person.  The quartet of girls, for the most part, fit into stereotypes of the genre.  Kurimuis the student council president, but she is also the most childlike out of the quartet.  Minatsu is literally made of hot blood, shonen action, and a booming voice.  Mafuyu is a borderline hikikomori yet has a surprising amount of inner strength.  Finally, Chizuru is the aloof big sister type character, and can at times be downright dangerous.\\n\\n\\n\r\nMost of this series rests on the comedy aspect.  Parodies of various anime series and aspects of Japanese culture abound, and if you’ve been watching anime for the past few years, you should be able to keep up.  The one that really sticks out in my mind is a very long salute to the Sentai genre where they all try to figure out what color ranger they would be and what kind of plot their supposed series would have.  They also poke fun at genre archetypes.  In one episode, they all attempt to write a novel of their lives in the student council, which all vary wildly based on their interests.  There’s also a two-minute segment where the cast manages to make a joke about almost every drama archetype in existence.  Since tropes are my thing, I really enjoyed how the writers played with them.  The writers make sure nothing is safe here, and stretch out enough that everyone will have something to laugh at.\\n\\n\\n\r\nThe series is not entirely episodic though, there is a bit of a plot involved, but it’s quite nonstandard.  You see, all the character development that would usually take place in an anime series has already happened.  You get the characters as they exist in the present.  The story aspects, which usually take place in the first and last few minutes of each episode, trace back the characters and their pasts.  Every girl gets a small piece of the story, and all four have suffered some kind of trauma.  Sugisaki serves as the focal point that connects all the girls together.  Once you finally get to the end of the series, the individual threads converge on him as they play what would have been the opening seconds of the series as the ending.  What we would laugh off at the start is actually kind of a touching moment at the end.  This is no deep plot, but it’s enough to nicely tie the series together as one collective work.\\n\\n\\n\r\nFrom an animation standpoint, the series is executed very well.  I honestly have to say that I have never seen a locker portray so much emotion before, just wait for episode 5 to understand that.  Given that the vast majority of the series takes place in one little room, the artists put a lot of detail into the design, but that doesn’t leave the few scene changes in the lurch.  Also, since this is a parody series, there’s a lot of call for style shifts and costume changes, in addition to the change in uniform as the seasons pass.  The voice acting is one of the areas where this series shines the most.  All four women in the student council have rookie seiyus, and they nail their roles to the wall.  Takahashi Kondo voices Sugisaki, and he really conveys the pervert quality to his speech and tone.  The OP is your standard Jpop fare, while the ED is somewhat nonstandard.  A lot of series like this have different EDs for each episode, and while Ichizon does that, it always uses the same tune, just different lyrics or inflection.  Unfortunately, one or two of the rookie team can’t quite stand up to the task.\\n\\n\\n\r\nAll things considered, Seitokai no Ichizon is a fairly standard series.  The series doesn't manage to break any new ground within its genres, but it does everything well enough that I feel it warrants a look.  It also manages to do it in such a way that it doesn’t grate on people who traditionally avoid its core genre, such as myself.  It might be worth a look for you.",
            "date": "2010-01-06T18:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 22139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70638.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rakuen42",
                "username": "Rakuen42"
            },
            "url": "https://myanimelist.net/reviews.php?id=22139"
        },
        {
            "content": "There are times where I come across an anime and I really don't know what to think of it...Seitokai no Ichizon is certainly one of those animes. For the most part, it is an anime that parodies many other popular animes, such as Haruhi, Death Note, Bleach, Majutsu no Index, and many, MANY more, so it's natural to assume not to take this anime very seriously. It is, after all, a lighthearted comedy series revolving around a student council.\r\nThe biggest strength of this anime was it's characters and comedy writing. There's no doubt this is one of the funniest animes I've ever seen. I foundmyself rolling in laughter at all the characters' fantasies and obscure anime references (the Death Note reference always got some good chuckles out of me). I also loved the characters in this anime very much. First of all, you have Ken, the lighthearted harem junkie that tries to do all the work to make the girls happy, Kurimu, the adorable president that acts more like a child than a high schooler, Chizuru, the calm and dark council member with an ominous presence, Mafuyu, a cute, mild-mannered video game junkie that also has an obsession over Yuri (or Boys' Love) games, manga, and the like, and finally, her older sister Minatsu, a strong, athletic personality that loves her action games and manga. Overall, I found this to be an interesting mix of characters that made for some great dialogue. \\n\\n\r\nThe biggest weakness of this anime, which I'm not really sure if I can consider it a weakness considering that they never really tried, is that there is no plot to this thing. It really is just an episodic anime of these five council members doing next to nothing during their meetings, or more specifically, how they get sidetracked from doing actual work. It just doesn't make for an interesting story. Even part of this anime's running gag were the characters commenting on how there is no story to their own anime. The artwork was also fairly sub-par...not terrible but nothing really that unique other than the anime's OP and ED. \\n\\n\r\nHowever, despite this anime's weak plot/story, there was a sub-plot discovered later in the series that actually made it kind of interesting. I can't really say a whole lot about it without revealing it but I can honestly tell you that it revolves around Ken before he was in the student council and how he knows each of the girls. There were some fairly touching moments in the last three episodes that made me wonder, why didn't they try this sooner? Then again, perhaps it might not have worked if they tried it sooner.\\n\\n\r\nOverall, it's a very nice comedy series if you're not looking for anything too complex and want to get some cheap laughs. There isn't really any fan service or ecchi moments, even though Ken's (and Mafuyu's) fantasies get a little revealing, so I find that to be a plus. If you're looking for a romance with some semblance of a plot, you won't find it in this anime. There really isn't anything in this anime to take that seriously. It's just a nice, simple anime to watch if you want to get a good hard laugh.",
            "date": "2012-07-18T08:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 66961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=66961"
        },
        {
            "content": "First off, I encourage you to ignore the numeric rating.  I only used it because it's a mandatory field.\r\nI had low expectations coming into this show.  I first heard about it on [GG]'s blog, which talked about how terrible it was, and later how glad they were to dump the project onto Eclipse.  They were further lowered when I watched a stream of the first few episodes.  They weren't as bad as the blog and general chatter implied, but I still wasn't impressed.  \r\nAfter downloaded it on a whim and started watching episodes over lunch it started growing on methough.  Episodes grew progressively more enjoyable, as the show threw off its ecchi comedy disguise to reveal its true form, slice of life.  This little anime that could, with no plot and a cast of purely archetypal characters, left me feeling satisfied that I had invested my time well, and disappointed that it was over so soon.  \\n\\n\r\nIs the show good?  I choose to skirt this question entirely and say it's enjoyable.  If conversation and character development appeal to you, and you have a decent understanding of Japanese culture (terms like eroge and yandere are tossed around quite a bit) then you will probably enjoy it as much as I did.  This is certainly a niche series though, and many viewers won't be able to get into it.",
            "date": "2010-03-02T00:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 23662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/42520.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/stryk3r85",
                "username": "stryk3r85"
            },
            "url": "https://myanimelist.net/reviews.php?id=23662"
        },
        {
            "content": "I like to think of myself as a comedy fan, being a fan of series like Milky Holmes, Nichijou and Arakawa Under the Bridge. I had heard a lot about Ichizon and had seen a few Youtube clips, and it looked like decent comedy. On the recommendation of a few trusted recommendations, I decided to take the plunge and was quite surprised at how absolutely hilarious this series is.\r\nI normally am a fan of the skit-based slapstick style comedy like in Arakawa, Nichijou and the recent Daily Lives of High School Boys, so Ichizon's slice of life-style presentation was a nice change of pace frommy usual favorites. For a comedy, it actually does a really good job at developing the characters thanks to this format. Speaking of which, the characters in this series are amazing. They have some of the best voice acting I've heard in anime, especially Ken's seiyu. I can't help but crack up whenever Ken starts into one of his heated rants about his dream harem ending. \\n\r\nThe sense of comedic timing in the voice acting is out of this world, they know just when to change tone with the current situation. The girls surrounding Ken may seem to be typical anime personalities and to an extent they are parodies of stereotypes but I found them all to be very well written, as they know just when to through the view off into an unexpected fit of laughter.\\n\\n\r\nThere are also lots of guest appearances throughout the series, which I will not spoil for you. I will say that Fumihiko Tachiki's cameo had me absolutely rolling, as I'm a huge Eva and Kaiji fan.\\n\\n\r\nMy only real issue with the series that it's very short and some of the backgrounds are a bit drab (probably budget constraints, and they are in one one for most of the series). But I think the quality of the voice acting and writing make the series well worth a watch, it's been one of the funniest things I've watched recently.",
            "date": "2012-04-02T08:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 57691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/683869.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheChillburger",
                "username": "TheChillburger"
            },
            "url": "https://myanimelist.net/reviews.php?id=57691"
        },
        {
            "content": "Seitokai no Ichizon is a anime that will make you laugh and make you feel all warm inside. \r\nSeitokai no Ichizon is more like a parody anime, like Hayate no Gotoku, but in this case they will use a lot of devices that may confuse those who are still young in the anime world. But for those who understand the basics of these devices (such as death note, Dragon Ball Z, Monster Hunter, etc.), this show might turn out to be very enjoyable.\r\nFor those who just want an anime where they can lay back from the serious stuff and just want to get a goodlaugh, this is the anime for you \\n",
            "date": "2012-02-12T03:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 53707,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1071765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KiriyaXIII",
                "username": "KiriyaXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=53707"
        },
        {
            "content": "My second review that will never get to the top four reviews. Read until the end... I logged in my dormant account since ages, just for this... Okay fck it! \r\nPersonally, I loved and enjoyed watching this anime since I like an Anime with at least a good humor, has a messy, crazy, fun lifestyle and not boring! After almost having no good anime to watch as of late, I finally found this! Never heard of it before and if I did, I had probably forgotten since it has almost the same name as that ecchi anime that I find boring aka Seitokai Yakuindomo. Butyeah, this is really good and too bad it doesn't have much recognition. \\n\\n\r\nIf you have a popular YouTube Channel, Facebook Page, Blog or any sh!t that would share this anime's greatness and give it more recognition than it deserves, please do so... I want more seasons of this because it's fun to watch and it's better than those waste of money ecchi, cliche and boring anime out there! \\n\\n\r\nI don't have other things to say other than this being a great anime and these other sh!ts I've written! I mean who the fck cares about numbers! People who visit this page just probably wants to know if this is any good, worth watching or not, and not other people's \"as if\" detailed rating! Unless you're paid online to do so ;) I mean you're not a judge for fck sakes! Just a random person watching Anime!\\n\\n\r\nI gave it 10 because I can, and well... most MAL Ratings are so fcking underrated in my fcking opinion! A rating of 10 should counter that a little bit, I don't want to see this on 6 and below ratings because that affects great Animes a bit in not having more seasons! \\n\\n\r\n8-10 ratings are what I consider to be awesome, enjoyable, great, fun and worth watching. 7 rating is like saying \"it's okay, but could've been better\".From 1-6, ratings are the descending worst types of how you can describe the word \"boring\" or \"sh!t\".",
            "date": "2016-12-25T21:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 236511,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5065314.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CrimsonBloodmare",
                "username": "CrimsonBloodmare"
            },
            "url": "https://myanimelist.net/reviews.php?id=236511"
        },
        {
            "content": "Most animes leave the fourth wall intact, presumably because 9 of 10 times it's broken the show quality plummets and the 10th time it neither adds or detracts. The only exception in the history of everything forever that has managed to make breaking it a fun thing that adds to the enjoyment is... NOT Seitokai no Ichizon, it's Deadpool.\r\nWhen a plot can be summed up with 4 girls and one guy in the same room 95% of each episode, a big temptation for the writer is to throw in references to other things and start breaking the wall that shall not be defiled with breaking,except by Deadpool since he defiles everything anyway. In this anime there are loads of very forced pokes at numerous other animes, maybe a slight bit fun for those who've watched those animes but for everyone else it's mostly a waste of screen time since the segments often don't even come with a good punchline. (I didn't like most references even though I've seen the other animes)\\n\\n\r\nThe art and sound are only just good enough to be called \"good\" by 2017 standards, the characters however are sort of difficult to rate. The delusional guy constantly calling the girls his harem is on one hand refreshing compared to most other harem protagonists, but on the other hand he gets stale when compared to himself since the originality ended at just defining him as a guy seriously aiming for a harem. The girls also stick to their roles really hard but it works a lot better for them.\\n\\n\r\nWay back forever ago this anime was probably one of the better but by modern standards it isn't impressive. The comedy is endless hit and miss, with more missing than hitting, however if you're bored and have watched most other stuff out there you may as well watch this too.",
            "date": "2017-10-29T10:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 262026,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6311485.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BriefEd",
                "username": "BriefEd"
            },
            "url": "https://myanimelist.net/reviews.php?id=262026"
        },
        {
            "content": "I'll just cover the main points that I enjoyed/disliked about this anime.\r\n1. The characters are all unique and awesome.\r\n2. For ME personally, I got bored watching the anime around episode 5. I realized that I cannot stand animes that doesn't have continuous stories between episodes. \r\n3. The anime got interesting again around episode 7-8 where they start to show the male leads past and his connection to each members of the club. It was touching and overall a nice story.\r\nI recommend this to anyone who are okay with watching anime without a big \"story line\". Also do not watch this if you are expecting traditional\"harem\" since throughout the anime, the male lead doesn't get any!",
            "date": "2013-09-19T11:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 113419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3067679.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yaki_niku",
                "username": "yaki_niku"
            },
            "url": "https://myanimelist.net/reviews.php?id=113419"
        },
        {
            "content": "Before writing a review, most people write some sort of catchy thing that gets a person's interest, but I can not think of anything other than to say that I can not think of anything.   Now then, lets get started with the review.\r\nStory:\r\nSeitokai no Ichizon is about a male student, Sugisaki Ken, who is the only male student on the Student Council which consists of four girls and a female teacher who is their advisor.  The rest of the plot revolves around the days of student council members and on how Ken wants to make all the girls on the council, hisharem.  That is all there is to say about the main story.  At first it sounds really lame and boring but it slowly grows and at the end, explains the rather honest and sincere reason for why he wants to have all the girls be in his harem (yes, the reason is good, even if the word harem is used to describe it lol).    Although that is the main story, what makes this anime different than a regular comedy anime, is that it is a parody comedy.\\n\\n\r\nThroughout the show, especially the first half, there are countless references to shows such as Higurashi, The Mel. of Haruhi, Strike Witch, Death Note, K On!, and possibly others.   However, instead of limiting the comedy to just parody, there were many moments where the characters would practically break the fourth wall in and say things like \"So why is it that the main character in the anime talked this episode?\" or on episode 1 \"We need a opening theme for the show, but what should we do?\"   \\n\\n\\n\r\nArt:\\n\\n\r\nNothing too special about the art style.  It does have a similar style that reminded me of Higurashi (especially with the main male character from both anime), and School Days.  When doing the parody parts, the art style would briefly change to fit the theme, but overall stayed true.\\n\\n\\n\r\nSound/music:\\n\\n\r\nNothing special here either.  The OP was fine, the ED was cute, the sound effects used were fitting.\\n\\n\\n\r\nCharacter:\\n\\n\r\nI thought they were great at fitting their own little niche, like the girl who is too innocent to realize what others mean when they say certain things (even though she likes BL novels), or the girl who was the more busty n lusty yet deadly and scary.   The main male, Ken, did a great job at being awkwardly perverted and still be enjoyable when he was honest and serious.  \\n\\n\\n\r\nEnjoyment:\\n\\n\r\nWell, I enjoyed it, so hows that?  Ok, I liked this anime quite a lot, but it was getting dry near the end, but once you make it to the final episode, you learn about the true reason why Ken is doing what he is doing, which was a really sweet and touching moment that made it all worth it.  The fact that the show was a parody type, made various references to the viewers watching the show, and other things, made me enjoy this.  I don't think this is the anime that everyone will enjoy , but for those who want a comedy that uses parody, then this is a good find.",
            "date": "2014-07-31T07:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 154601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=154601"
        },
        {
            "content": "This anime based on a view of a harem story.\r\nThe boy (can't come up on his name right now) wants a \"happy\" harem in the end with all the girls in the club of the council club, it seems like a regular anime, just like all other anime with this sort of stuff, but yet, there are some moments that does let you feel good, that's why I keep watching this anime.\r\nSo keep it up. :)",
            "date": "2009-10-21T11:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 19894,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218943.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/perform",
                "username": "perform"
            },
            "url": "https://myanimelist.net/reviews.php?id=19894"
        },
        {
            "content": "I'm going to keep this review short and simple.\r\nSeitokai no Ichizon is basically a show that involves 4 bishoujos, and one man dedicated to making them all his harem. And surprisingly enough, the show actually does have plot. \r\nIf you like watching cutely drawn girls, anime references, and BL ;D watch Seitokai no Ichizon.\r\nOh and, ECHO OF DEATH-NIISAN",
            "date": "2010-05-31T02:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 26616,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/15394.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/zinv72",
                "username": "zinv72"
            },
            "url": "https://myanimelist.net/reviews.php?id=26616"
        },
        {
            "content": "I think it's very good and funny very amusing besides I could write fanfics storys for some of the characters besides the art is very good and i love the music of it 2.",
            "date": "2009-11-05T12:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 20289,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/192563.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/amutogirl18",
                "username": "amutogirl18"
            },
            "url": "https://myanimelist.net/reviews.php?id=20289"
        },
        {
            "content": "Seitokai no ichizon is probably the anime equivalent of Seinfeld. This is mainly due in part to the fact that it holds the same main idea. It is mainly a show about... nothing. Basically, the story follows 5 high school teenagers through their \"Student Council Meetings\". However, the \"meetings\", if that, are just the characters' rambles ranging from BL, harems, sports, action, masochism, and loli. To top it all off, most of the anime is contained to one room,  the Student Council Room. While this idea may seem like a horrible setting and a recipe for disaster, the setting is the perfect fit fortheir meetings. The anime's comedy is essentially what holds the entire series together, and it would certainly hold anyone's attention for the duration of each and every episode. \\n\r\nPersonally, I love each and every episode of Seitokai no ichizon. Each character has their own moment, and no one is left out. The entire series, both first and second season, hold a special place in my heart. Now, I might be a little biased, being that this was the first anime that I had ever watched, but I stand by my position nonetheless. This anime's plot of complete and utter nothingness is pure gold. The freedom that it gave itself was infinite, and the creators certainly put it to good use. I found myself laughing each and every episode,  and I couldn't help but watch the next episode. In conclusion, the anime set the standard for what I feel every harem comedy should be. The anime isn't full of action, drama, or suspense. However, if anyone out there is looking to laugh, I feel that they should give this title a chance to make them do just that.",
            "date": "2015-08-03T09:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 195070,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4727094.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/themelancholy8",
                "username": "themelancholy8"
            },
            "url": "https://myanimelist.net/reviews.php?id=195070"
        },
        {
            "content": "Story (10):\r\nSeitokai no Ichizon is one of the best anime ever done. Unlike classic Harems which focuses on single route ending, Seitokai no Ichizon makes everybody smiling, I mean viewers in first place.\r\nSo, Seitokai no Ichizon is more moral and feeling, comedy-oriented series. If you want to see the real feeling, you have to deduce them because they're not told clearly\r\nSeitokai no Ichizon also features one of the best parodies that circle around 2000~2008 animes. If you want parodying this is your best chance to get understandable parody without having to watching 50 episodes or 200 ones.\r\nAlthough, only the first episodes are parodying.\r\nArt (9):\r\nGood animationand suitable for 2009/2010 anime-era. GC are good, not great but it does what it has to be done: getting idea\\n\\n\r\nSound (8):\\n\r\nThe sound may not be great deal. They're standard \\n\r\nSeiyuu are good but not great\\n\\n\r\nCharacters (10):\\n\r\nNicely picked characters. Each has its own taste and each is different. \\n\r\nAlso, each was picked (not by random like others) by several specifications making them accurate and highly respectable.\\n\r\nAs for Ken and his personality, I made him top of my fav characters :)\\n\\n\r\nEnjoyment (9):\\n\r\nI really enjoyed Seitokai no Ichizon. I guess Season 2 (the ONA) won't be as the first season. I've actually enjoyed Seitokai no Ichizon in a way that kept watching it for days repeating it over and over again and each time I understand something new!\\n\\n\r\nOverall (9):\\n\r\nso for now I'll leave the first season as one of my top favorite always referencing its ideas since they're more like mirror to real society and have even deeper analysis than just mere 4 characters + our main character.\\n\\n\r\nRECOMMENDED! Even may not be your genre but I guess I recommend it as an ICON of anime",
            "date": "2012-08-30T05:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 71173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/461060.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lightningfalcon",
                "username": "lightningfalcon"
            },
            "url": "https://myanimelist.net/reviews.php?id=71173"
        },
        {
            "content": "OK.this anime is mostly on the MOE factor and every episode is mostly just a day in their life as hekiou academy's student council ,though it also has refrences from other animes,actually a lot of animes.this is an anime that a lot of people would like,its like lucky star that will get famous in about a few more months or maybe i'll give it a year.A lot of it is mostly parodies from other animes such as deathnote,fullmetal alchemist and other more,there is even a parody of monster hunter.This is an anime for people who like to see references in anime and fo course comedyis always needed",
            "date": "2010-02-09T04:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 23082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237390.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kota-ken",
                "username": "Kota-ken"
            },
            "url": "https://myanimelist.net/reviews.php?id=23082"
        },
        {
            "content": "Harem! Taken a little further in Seitokai no Ichizon, as our hero aims to have the entire student council (all composed of cute girls) his own personal harem! \r\n..... That made it sound soooooo weird. But in many ways, this anime is also weird. In the outer part, Seitokai may look like it's just a conventional harem. But once one looks deeper, one may find that the fun part about Seitokai, is not in its \"Harem\" part, but it's story.\r\nNow, usually a story in a Harem is pretty much shallow. The girls fight over one guy that is usually hated, something happens, and poof! they'reall in-love with him. But in Seitokai's place, almost none of that happens. I have seen a lot of Harem anime before, but Seitokai has my vote when it comes to originality of story. \\n\\n\r\nNow as for the art, it's a little bit off for me. I find the 2D face-style a bit old, yet attractive and cute at the same time. It comes with an array of colorful sceneries that need no more explanation.\\n\\n\r\nThe sound on the other hand, I'm not too satisfied with. I was not that impressed or taken by its OP and ED, so I can't really say much about it.\\n\\n\r\nAll in all, Seitokai no Ichizon was a great watch. It's one of the anime that made me think and recover myself, so to speak. I suggest you watch the entire season, so that you can get the most out of it.",
            "date": "2012-06-13T06:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 63325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1342693.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kuro_kuro",
                "username": "kuro_kuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=63325"
        },
        {
            "content": "This is the most authentical \"high school\" genre anime I've watched so far and fact is it was really good! Seitokai no Ichizon focuses completely on Hekyiou's Student Council and then... BOOM! It finishes unpredictably well! Nice choice! It also parodies many famous works, including even TTGL!\r\n{STORY - 7/10}\r\nAs its name says, it's about Hekyiou's Student Council reunions. No darker plots, no twists, no enemies, just the story of Ken Sugisaki, a guy who struggled a lot to enter the council, with the sole dream of having his own harem. Like any other pervert, he's a total douche, but with a kind, sweet side, thatthe other four girls take some time to see and understand.\\n\\n\r\nHis efforts on getting closer to all this girls have a deep meaning, later revealled. His intentions are above having a bunch of pretty girls surrounding him... He wanted to make them happy... Helping with all the main activities and calling enough attention during reunions with his dumb jokes and shameless actions are some of his ways to show affection... Would this end as expected? Strong feelings may disturb the council's peace, but who knows?\\n\\n\r\n{ART - 6/10}\\n\\n\r\nOverally pleasant, but with no distinctive characteristics. Actually, it reminds me of an anime I've watched two weeks ago, with the same oversized eyes, despite not being based on a VN this time... Protagonists have mostly the same basic visual aspects, with small changes on their appearance and, obviously, different personalities.\\n\\n\r\n{SOUND - 7/10}\\n\\n\r\nThe song featured on its OP theme is stuck in my head... It's not that special or amazing and, still, is kind of addicting... However, I was most impressed by songs used on endings... I mean, there's more than one, every one of them performed by the voice actresses, but they don't differ too much and on some themes, singers become desynchronized and their voices, out of tune... That's way too funny and, actually, pretty nice, despite being terribly awful... Don't try to understand me...\\n\\n\r\n{CHARACTERS - 4/10}\\n\\n\r\nLike on any other harem, we have a male protagonist with this ambition in mind. Ken is totally shameless, but he hides a sweet side and can be really affective at some moments. Council's president, Kurimu, entitled as the \"kawaii/moe\" female protagonist is a typical childish girl, whose attitude is able to attract anyone.\\n\\n\r\nWe also have the mysterious and mature Chizuru. Her strong and sadist personality reminds me Makiko from Sora no Otoshimono. Maybe she was based on her, since this anime parodies SnO as well. Mafuyu, addicted to both games and yaoi manga, is the shyest and her gentle and calm behaviour compares to Asia, from High School DxD. Minatsu is the one chosen to take the tsundere role and acts like a boy on many different ways. One of those is reading many shounen mangas.\\n\\n\r\n{ENJOYMENT - 8/10}\\n\\n\r\nThis was also the first parody anime I've ever watched. Seeing \"Haruhi Suzumiya\" and \"Death Note\" references, besides many others was awesome! Despite all that, it was so unique, original...\\n\\n\r\n{OVERALL - 7/10}\\n\\n\r\nFrom the beginning, it may seem weird... Expecting 12 episodes about school stuff? It's a parody, with a few romance and tons of comedy. Close to the end, it gets more serious and gives us the opportunity to comprehend Ken's true intentions on joining the council... It's really touching...",
            "date": "2013-11-09T19:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 119785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=119785"
        },
        {
            "content": "Seitokai no Ichizon and the follow up series Seitokai no Ichizon lvl 2 is a little different from the usual harem series where the innocent protagonist accidentally attracts a lot of attention. This series is almost a parody of this generic plot and instead, on day 1 of joining the council ken sugisak the protagonisti openly admits he will make the council made up of 4 women fall in love with him. This series is a light hearted, good feeling anime with little drama but many jokes and lots of references to other anime series.\r\nThis anime is similar to seitokai yakuindomo but not as funnyor as lewd. This anime has no real plot or drama, most of the series takes part in the council room itself and nothing really every happens, its mainly just talking which can bore some viewers but I thoroughly enjoyed this anime nonetheless. \\n\\n\r\nIn summary, this anime is quite funny, good to see references to other animes, almost parody like of the standard harem settings. The main reason I enjoyed this anime is because it is a happy and relaxing anime that avoids any depressing scenes, ecchi scenes etc and is just fun to watch.",
            "date": "2014-08-24T08:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 157729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4033273.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/callmebiko",
                "username": "callmebiko"
            },
            "url": "https://myanimelist.net/reviews.php?id=157729"
        }
    ]
]