[
    [
        {
            "content": "When I first heard that there would be a continuation of Kimi ni Todoke I was overjoyed but also filled with great trepidation.  The original had a less than stellar ending, so the prospect of getting a worthy finale to the series was an exciting opportunity.  But at the same time I know the track record when it comes to sequels in anything, and considering how much I loved the original I feared it would be impossible for it to live up the expectations I had for it.  In the end both came true in a way, being at the same timebetter and worse than the first season.\\n\\n\r\nWhat really attracted me originally to Kimi ni Todoke was the way it broke the typical shoujo stereotypes and mostly stayed away from them.  Instead standing many of them on their heads and having fun with them.  It stayed away from love triangles, misunderstandings, and the other typical cockblocks that plague romance anime.  This begins to change somewhat from episode one when we are introduced to a new character Kento Miura.  A character that could only have one purpose and a type that anyone familiar with the genre could recognize from the start.  While in retrospect I probably shouldn't have been surprised that a rival might make an appearance, I also think that it’s a bit out of character for the series as well.  Sawako is just too innocent and simple of a personality to have her heart swayed by the appearance of additional bishies.  Though his character doesn't really pan out the way I feared he would, I am still left wondering if it was even necessary to include him at all.  \\n\\n\r\nAs much as Kento's arrival initially annoyed me, the main problem overall with this anime is the frustratingly slow pace.  This started to bother me in the first season towards the end but most of the time you just found yourself tapping your cheeks and exclaiming, \"Aw, they're so cute!\"  However now I found myself more often pounding on the arm of my chair screaming, \"Get on with it already!\"   The constant string of misunderstandings and hand-wringing gets old really fast.  There is a limit to how clueless, how bashful, and socially awkward two people can be.  And this is the source of most of my frustration with the plot. \\n\\n\r\nHowever, as much chagrin and annoyance as most of the series' pacing caused me it’s almost completely offset by how it ends up.  All of my expectations were fulfilled as we are treated to a wonderful culmination of their struggles to reach each other’s hearts.  We are even treated to something that we rarely get to see in romance stories, the after the confession story.\\n\\n\r\nAnother rewarding aspect of this season is the continued growth of Sawako's character as a normal well adjusted person.  As much annoyance as certain characteristics of her personality caused me at times by the end you see a girl who changed quite a bit from the shy and gloomy person at the start of the first season.  Even Kazehaya is changed, though it is not as noticeable with his outgoing personality as a shell to cover up his own insecurities. \\n\\n\r\nThe rest of the cast remains pretty much unchanged with one notable exception; Kurumi.  Her role in this season is greatly diminished but all of her appearances are quite impactful.  Each one displays an element of her character, from jealousy and vindictiveness to vulnerability and honesty.  Over the course of the series she manages to both stand in Sawako's way and to help her get around her.  Though you could say they are technically not \"friends\", this kind of tough love probably changed Sawako in more ways than any of her other friends managed to.  I think that everyone can relate to Kurumi's feelings and her unrequited love.  It's hard to not feel a little sorry for her, but while she's still not over Kazehaya by the end its clear she is going to be ok.  Unlike most rejected romance characters, it’s hard to imagine Kurumi pining for Kazehaya for the rest of her life.\\n\\n\r\nArtistically there is really no change from this season to the past one.  It remains the most beautiful shoujo romance probably ever made.  If there is any fault to be had it is with the overuse of Sawako's chibi form.  While I myself happen to love chibi style animation, I felt they were used inappropriately at times.  Particularly in some of the more impactful scenes which ended up taking away from them.  The music and voice acting remains top notch,  MAY's \"Kimi ni Todoke\" ED song I think is the best one of the entire series.  Mamiko Noto's performance is also quite memorable.  I really believe this is a defining role for her, almost as if the character had been created specifically for her.  I cant imagine any other seiyuu voicing Sawako.\\n\\n\r\nOverall the 2nd Season of Kimi ni Todoke is an excellent conclusion to the series.  Though even with its excellent ending it never feels like it equals the quality of the first one.  Combined with the frustratingly slow pace and an implausible string of misunderstandings, makes the experience as a whole uneven.  Despite these warts if you loved the first season your still going to like and perhaps love this as well.\\n",
            "date": "2011-03-31T06:23:00+00:00",
            "helpful_count": 346,
            "mal_id": 35512,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=35512"
        },
        {
            "content": "Disclaimer: Kinda sorta spoilers, but not really.\r\nBefore you skip over this because of the low score, do me the courtesy of reading through the review, first.\r\nI came into the second season immediately after watching the first. It might be a good idea to read my review of the first season, to give you some context. \r\nEven if you don't, the short story is that I really, really liked the first season. I was this close to giving it a 9, which for me is an amazing grade.\r\nThe point is, I came into the second season with very, very high hopes and expectations.\r\nThey were not met.In fact, they were crushed.\\n\\n\r\nLet me get some good points out of the way. The animation is still very good, with some very powerful moments here and there.\\n\\n\r\nThe music, surprisingly, fit in a bit better and actually left an impression at times rather than being nonexistent like in the first season. The closing song sounded better this time, too.\\n\\n\r\nNow, on to the plot:\\n\r\nDisappointing first few episodes. In fact, the first 7 episodes were a total disaster. Cheap drama created by characters thinking but not actually saying what would fix an otherwise simple situation.\\n\\n\r\nTotal reboot of the relationship, invalidating the last several episodes of the first season and cheapening the plot overall for pointless drama.\\n\\n\r\nA lot of the things that I hate about drama anime surface on the second season, while they were absent the first. Namely, it's the retarded misunderstandings. The sort of situations that arise only because a character took something someone said completely the wrong way, or didn't say something simple yet vital. These sort of things are easy, cheap drama generators and would never happen in real life because in real life people are not that stupid.\\n\\n\r\nSimilarly, Sawako seems to have taken the same steep dive the show itself has. There is no sign of the backbone that she had in the first season. She's turned into the depressed, passive and utterly stupid classic anime chick who believes whoever's mouth is moving at the time. What the hell? Sawako in season1 spoke her mind and, even though she was afraid, always tried her best for what she wanted to achieve and wasn't afraid to contradict other people. What happened to that? For f-'s sake, even Kurumi admitted that she didn't expect Sawako to be such a mindless sheep.\\n\\n\r\nSimilarly, Kazehaya seems to have realized he's starring in an anime and started doing all the retarded shit anime characters sometimes do, even though he'd made it a point to contradict those expectations in season 1. Things like being led around by the nose by everyone who speaks to him, having no personal conviction, and not respecting other people's right to a decision, like he demanded in season 1 for himself. The latter episodes kind of fix this, but the damage is done by then.\\n\\n\r\nI mean, what the actual f-? Did they seriously make more than one episode's worth of drama based on the misunderstanding that both think the other meant a different definition of 'like'? How can that elicit any emotion other than bafflement from the viewer? How are we supposed to empathize with the characters when their only problems consist of having exactly 0 communication skills?\\n\\n\r\nWhen the answer 'Does your anime's conflict get solved if the characters say a single reasonable sentence to each other?' is 'Yes' then you're doing something wrong, goddammit.\\n\\n\r\nI wanted to drop it on the first 4 episodes. I really wanted to drop it on episode 5. I should have dropped it on episode 6. I kept going because I'm the kind of guy who can't look away from a train wreck, and because after watching the first season I at least wanted to see how the second one concluded.\\n\\n\r\nThe episodes after 6-7 seem to merely be trying to reel back in the shit parade. They're not bad. In fact, they're fine. However, that doesn't erase the fact that none of this should have happened. Much as I enjoyed the episodes from 8 onwards, the fact remains.  The last few episodes are spent resolving situations that arose out of pure and unadulterated stupidity that are definitely not the kind of thing I was expecting coming into this.\\n\\n\r\nThe last episode is appropriately heartwarming, I'll give the series that. However, imagine the last two episodes being, in fact, the FIRST two, and then the rest of the season being the two of them exploring their new relationship. There was no need for the pointless and outright silly drama of the first 7 episodes.\\n\\n\r\nThe fact that the last few episodes were good kind of softened me up by the time I finished it, but it doesn't change the fact that more than half of the season was garbage. I want to rate it high because of the last two episodes, and I want to rate it very, very low because of the first few.\\n\\n\r\nI guess I didn't do myself any favors by having high expectations.\\n\\n\r\nAs it is, I'll just sigh and give it a 5/10.",
            "date": "2015-04-07T09:04:00+00:00",
            "helpful_count": 200,
            "mal_id": 185045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4500546.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RepThe21st",
                "username": "RepThe21st"
            },
            "url": "https://myanimelist.net/reviews.php?id=185045"
        },
        {
            "content": "**THIS REVIEW CONTAINS MAJOR SPOILERS**\r\nI thought that in the second season Kuronuma and Kazehaya would be dating early on and that the episodes would be about their relationship together. When I realized that it was going to be twelve episodes of them doing nothing, it was pretty frustrating.\r\nIn the first season, I liked all of the characters (especially the protagonist Kuronuma Sawako) because I found them all funny and enjoyable. By the fourth episode of the second season, Kuronuma became obnoxious. There was no plot development at all in this season, and it seemed like every episode was exactly the same, with the characters restatingtheir feelings of, \"I like him/her but what if it ruins our friendship!\"\\n\\n\r\nI really enjoyed the first season of this show, but I was surprised when they didn't get together in the end since we had already reached the conclusion of \"they both like each other\" quite a few episodes prior.\\n\\n\r\nThere was no need to drag this out so long. If this was all that was happening, they should have just gotten together at the end of the first season and had no second season.\\n\\n\r\nOverall, even though I liked the ending and I was happy to see them get together, the frustration of seeing nothing happen for twelve episodes straight was a waste of time and I think this season was a waste.",
            "date": "2014-11-18T10:33:00+00:00",
            "helpful_count": 97,
            "mal_id": 169083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201354.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Karudima",
                "username": "Karudima"
            },
            "url": "https://myanimelist.net/reviews.php?id=169083"
        },
        {
            "content": "PATIENCE IS A VIRTUE \r\nStory: 10/10 Beautifully continued from the first season, Kimi Ni Todoke Season 2 kept me hungry for more with the developing relationship between Shouta and Sawako growing.\r\nArt: 10/10 I fell in love with the stunning artwork when I was introduced to it in the first season. The characters are drawn more realistically than most Japanese Anime and the scenery (cherry blossoms) are amazing.\r\nSound: 10/10 I love the music. My favorites are the romantic tunes when Shouta and Sawako look at eachother.\r\nCharacter: 9/10 I love Shouta's character. He's this cute, outgoing athlete who becomes this cutely shy guy when it comes toSawako. Sawako is this introverted girl who becomes extremely shy when it comes to Shouta. The only problem I have with this is that for many episodes throughout Kimi Ni Todoke (in general, but more in the 2nd season) there are times where I think they are too shy. It even becomes quite unbearable at one point in the 2nd season; I almost wanted to stop watching the anime. However, I understand that Sawako was very unsocial to begin with and Shouta is just shy around her because he likes her. I needed to cut her a little slack.. but Shouta couldn't tell that she liked him. It took him a while before he started to get it. I hate it when anime characters are DENSE. \\n\\n\r\nEnjoyment: 9/10 Besides the middle of the 2nd season of Kimi Ni Todoke where I wanted to rip out my hair because I was so frustrated that Sawako wasn't getting it, I love this anime. :) I really enjoyed this anime more as it went towards the end of the season (Episode 10 to be exact). That one episode is amazing.\\n\\n\r\nOverall: 10/10 I love this anime. Despite the shyness, I thought that everything was well done. I recommend this anime to people who love a cute love story, but have the patience to sit through it. It took a while but in the end, I felt happy. In fact, if they didn't drag on the developing relationship, then there would be no strong meaning to the title.\\n\\n\r\nI can't wait to see the last 2 episodes. I'm sad that there are only 2 though..:(\\n\\n\r\n-MsCHOCOHOLICishere",
            "date": "2011-03-24T17:02:00+00:00",
            "helpful_count": 89,
            "mal_id": 35318,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465416.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MsCHOCOHOLIC",
                "username": "MsCHOCOHOLIC"
            },
            "url": "https://myanimelist.net/reviews.php?id=35318"
        },
        {
            "content": "I have to give this anime the highest score you can possibly give. For a while, I've heard of this anime and how amazingly adorable it was. I watched it for the first time in January and immediately got hooked.\r\n The story is of a shy, misunderstood girl name Sawako (known to others by Sadako) and a bright, \"refreshing\" young man named Kazehaya (Shouta). This story bases mostly on friendship and romance, which I think is awesome :)\r\n In the first season, Kazehaya helps Sawako gain more confidence and she is able to speak out better. She also found new friends (who are the BESTby the way). In the first season, Sawako realizes her love for Kazehaya and wants more. Therefore moving on to the second season. :D The last season was amazing. I recommend you watch it first. A happy ending in almost all the episodes ( wait, maybe all of them).\\n\\n\r\n In the second season, it's more focused on love. Kazehaya and Sawako will probably take their relationship to the next level, but more misunderstandings before that. The story is outstanding. The plot is not going too fast, or too slow. The art makes you understand the mood and the story better. And the settings are beautiful. The sound always has a great help in the atmosphere and a lot of the times are nostalgic sounding. The characters are the most ingenious. Especially the mains. Sawako's cuteness and naturally creepiness is the main reason I'm still here. Also, Kazehaya is not too unrealistically sweet and can get mad and impatient. Which makes him the dream boy for most girls (including me). The best friends, Yano and Chizu are total polar opposites, which makes it funny to watch. Also, the teacher Pin and Chizu's childhood friend are just hilarious and funny to see :D\\n\\n\r\n I just LOOOVE this anime and I hope you do too~",
            "date": "2011-01-24T16:07:00+00:00",
            "helpful_count": 62,
            "mal_id": 34017,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/433592.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ixWishingx3",
                "username": "ixWishingx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=34017"
        },
        {
            "content": "This review is for both Season 1 and 2\r\nRating - 10\r\nSorry for giving it a 10. I know it's probably because I am a sucker for a rom-com genre but hear me out. Rarely does an anime give me the urge to have an all-nighter once I started watching one. Kimi ni Todoke did not make me sleep at all. I have watched the 2nd season, specifically episodes 9 - 12 a couple of time for it to sink in. It was a joy to watch Kazehaya and Kuronuma finally get together in the end. The plot may be slow but it was definitely worththe wait. Although I feel like there should be more, I am contented on how the story went and ended. I love the characters especially Kazehaya because despite of being the person who can have the woman he wanted, he pursued someone who he thought is unreachable. I just love the plot so much.\\n\\n\r\nGive it a try folks! It's worth the wait, I swear!",
            "date": "2015-08-11T00:10:00+00:00",
            "helpful_count": 59,
            "mal_id": 195794,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4770883.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ashiang07",
                "username": "Ashiang07"
            },
            "url": "https://myanimelist.net/reviews.php?id=195794"
        },
        {
            "content": "So here we are, already at season 2. It seems like just yesterday, I was reading chapter 0 of the manga.\r\nAnyways, just me sounding like an old grandma.\r\nSo if you didn't watch the first season, I would because A) it's awesone and B) if you try to watch the second season without the first one, you're going to be seriously confused. But if you didn't watch the first season, it's basically an amazingly cute romantic-school comedy. Yes, it doesn't sound very compelling at first, but it really does become addictive.\r\nStory: 9\r\nFor those that don't know, Kimi Ni Todoke is about the story of the buddingrelationship between a shy, scary-looking girl (Sawako) who everyone is afraid of and the super popular but super nice boy in her class (Kazehaya). I'll admit, at first I was kinda skeptical on the story because it sounded like it was going to be like every other romantic school comedy but I was pleasantly surprised. The story is (for lack of a better term) refreshing and absolutely adorable. \\n\\n\r\nArt: 7\\n\r\nI'm not a huge fan of the art style for the eyes in the anime but everything else is great. The animation is very precise and detailed and backrounds are intricate. The coloring is also good and evokes a kind of nostagic feeling.\\n\\n\r\nSound: 9\\n\r\nJust looking at the list of voice actors in Kimi Ni Todoke will make any anime fan excited (Daisuke Namakawa, anyone?!?). And as they should, they do a great job expressing the characters' feelings. As for music, the OP and ED are fittingly adorable (I'm literally counting down the days until they are released) and the insert music is fitting and nice sounding.\\n\\n\r\nCharacter: 8\\n\r\nOne of the really great parts about Kimi Ni Todoke is the characters. Sawako is as cute as a fluffy puppy with rainbow sparkles, Kazehaya is the ideal boy (at least to me) and Chizu and Ayane (Sawako's other friends for those people who missed out on the first season) are the perfect friends. They make me laugh, cry and go \"AWWWWWWWW\" really loudly. Realistic? Not really. But hey, its anime.\\n\\n\r\nFinal Score: 9\\n\r\nSo what have we learned? Kimi Ni Todoke 2nd Season is the continuation of the totally amazing first season and can be summed up in two words, \"absolutely adorable\". The story and characters, while not realistic, are absolutely charming. The sound and art, are both great although the art was a bit lacking in the faces. But all in all? A solid anime that is (I'll say it once again), absolutely adorable.",
            "date": "2011-01-07T07:31:00+00:00",
            "helpful_count": 51,
            "mal_id": 33542,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362418.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PoweredByRamen",
                "username": "PoweredByRamen"
            },
            "url": "https://myanimelist.net/reviews.php?id=33542"
        },
        {
            "content": "THE TURTLE RACE ENTERS STAGE 2!!! Thats gotta be the best way I can describe how I felt when I sat down to watch this 2nd season of kimi ni todoke. As is the case with many/most of you, I watched the first season and was rather annoyed(or simply straight-up pissed) by the extremely slow approach they took; so just to let you all know, its gonna be more of the same here.\r\nThe story: This continues right where the first season left off with sawako and kazehaya each secretly loving each other from afar(or as far as one can get in the same class) andfeeling that their affections are one-sided.\\n\r\nIf season one could be described as a turtle race, the first half of this could be described as \"an uphill leg of the tour de france, between two guys with no legs\"  As you have hopefully gained from this clever analogy, not only is this slow paced, but at the begining it actually goes backwards briefly. This is resolved eventually, and the show couldve been over at least three times by episode six, but why would they do that when they could drag it out for another six episodes.\\n\\n\r\nThe art: Same as ever, kinda seems to be done in a joking manner but it works well; sawako can look super pretty, or fool me into thinking the zombie appocalypse just started.\\n\\n\r\nThe characters: All the same as last season, with the addidtion of some flamboyant blonde guy who seems interested in sawako but I dont know that we ever know what he's after.\\n\\n\r\nEnjoyment: I was happy when it was over, I mean this is two ways. Firstly, I felt like I had spent too much time on it and was happy that it was finally done with. Secondly, I liked the ending, it was one of those \"bout f-ing time\" things, and while some of you may consider this to be a spoiler, think about it, why would they make a second season for any other reason?\\n\\n\r\nOverall this was really a sweet little story, but it took forever. I thought that it was kinda generic with the expection of sawakos role which was actually quite refreshing. Honestly I dont know if I would recomend this to anyone, but on the flip side, I also wouldnt tell anyone not to watch this. This is kinda just up to you, in hindsight, im glad to have watched this.\\n\\n",
            "date": "2013-04-26T05:59:00+00:00",
            "helpful_count": 45,
            "mal_id": 94981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=94981"
        },
        {
            "content": "Kimi ni Todoke has stunned me. To sum the first season up for me; well it was fun but the pacing really got to me, and by the end I felt discontent for something that ran for half a year. If that is what made me give the first season a 7, it is what is giving this a 9. Of course scores are arbitrary, some people won't give less than a 6, but there is one thing that this season does: Makes all this time worth it.\r\nRetaining the humor, if not funnier when appropriate, this show put a smile to my face. With allthe build up from last season, it only allows those characters to interact better with each other on a more complex relationship. Of course there are those others that are enjoyable because to be honest, who can't help but enjoy a joke from Pin or that annoying Joe? If anything, the show takes all that anticipation I had last season and quenches it - The progress undergone by Sawako and Chizuru and of course Kazehaya and Ryuu is really great.\\n\\n\r\nUnfortunately, not everything is flowers and sunshine for this shoujo piece. The thing that bugged me the most was a misunderstanding forms that really shouldn't have happened. I know that sometimes that characters are incredibly dense, but the significance of it really made me think I was watching some shounen harem. It just felt out of place to me in a show that is very serious and logical when it should be. A new face also shows up, which acts as an instigator as a jealous Kazehaya can no longer sit around and twiddle his thumbs.\\n\\n\r\nThankfully, the character in our new love triangle is really awesome for somebody who you should be thinking \"#$%@ you dude, leave the damn couple alone.\" This character truly has Sawako's wellbeing at heart, and never 'really' makes an ass of himself.\\n\\n\r\nHowever at heart Kimi ni Todoke remains its original self, full of internal monologues, a lot of new(?) sadako jokes, and couching of our introverted female lead. As a male viewer who previously thought this was just a run of a mill shoujo the second season made me think twice, pick up the manga, and write a review. Although it might be somewhat predictable at times there is no doubt this show will be able to reach you whether it be your funny bone, fangirl/boy-ism, or your heart. \\n",
            "date": "2011-06-27T15:51:00+00:00",
            "helpful_count": 43,
            "mal_id": 38388,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=38388"
        },
        {
            "content": "Konnichiwa =) this is my first time writing a review (please be kind and don spam the \"not helpful\" button, i am a really sensitive person).. i wanted to do one for an anime that hasn't being done by many yet and since KnT season 2 has only just being released, i thought this is the best opportunity for me =] \r\nWhen i first watched the first and second season of KnT, i thought it was quite good at how realistic and practical this anime is compared to others where you can literally predict what is going to happen as well as the way thecharacters are going to be developed. But in this anime, they give you the main character Kuronoma Sawako, a misunderstood but kind girl who is shunned by the people around her because of her eerie looks and unnatural tone she takes on when speaking to strangers. However, another character, Kazehaya sees her for who she really is and befriends her. \\n\\n\r\nAs the story progresses into season 2, both of them develop distinct feelings towards each other and they get into all kinds of epic situation due to the fact that they are both EXTREMELY dense. I mean seriously....there is a limit to how dense a person can be, right??? But this anime develops the characters in such an amazing way so that they have a perfectly logical reason to be dense. For kuronoma, she is a girl who never had a friend before and doesn't know how to handle awkward or misunderstanding situations thus misreading Kazehaya feelings towards her. For Kazehaya, he is a super popular guy and many girls have already confessed to him, thus he unconsciously assumes that everyone, including kuronoma is the same, meaning normal (being alone without having any friends for 14 years is definitely NOT normal) and therefore misunderstands her words and actions. \\n\\n\r\nSorry for rattling on but anyway lets go into the marking rubrics =) \\n\r\nStory: 10/10\\n\r\nPersonally, i feel that the main reason some people mark down on this sector is because of there is hardly any progress at all in the relationship between the two. But, beauty is in the eye of the beholder and i find that the epic denseness of them both is actually the main factor keeping my eyes glued to the series. Believe me, restraining myself from yelling stupidly at the screen is no small feat. Sometimes you just feel that you want to go in there and slap some sense into them. And then you realised,,, Its just an anime show. Its. Not. Real. See what it had done to you? Not many other shoujo have the ability to this to you. Thats what make KnT so special.\\n\\n\r\nArt: 10/10\\n\r\nThe animation is quite remarkable. I really liked the parts where they show koronoma smiling. Some people may find it.... scary? But i think it requires great skill to be able to draw out something that inspires such emotions within you. Be it, scary or warmth. \\n\\n\r\nSound: 8/10\\n\r\nThe voice actors are kinda good.. i mean.. it must be tough.. to take on such a low, scary tone kuronoma is supposed to have. And i really really really like the ending song for this season =)  \\n\\n\r\nCharacter: 9/10\\n\r\nThe character development, (unlike the romance, thankfully) moves at a reasonably pleasant pace revealing several surprising and interesting details about each character. And each of them, be it in denseness or kindness have their own strengths and weaknesses whether they realised it or not. (most of the times they don't, which is what makes it so interesting)\\n\\n\r\nEnjoyment:10/10 \\n\r\nOverall: 10/10\\n\r\nI have talked enough about these areas in my starting commentary.. and frankly, i think its a miracle if you even read until this part.. And so this concludes the end of my first review =) \"phew\" *breathes air of relief* its hard work writing a review, and that shows how much i like this series. Give it a try, you might like it too... ;)\\n\\n",
            "date": "2011-03-12T05:23:00+00:00",
            "helpful_count": 40,
            "mal_id": 35032,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/275170.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wingar",
                "username": "wingar"
            },
            "url": "https://myanimelist.net/reviews.php?id=35032"
        },
        {
            "content": "\"Slow and steady wins the race\". Although there is huge criticism on the pacing of this story, the actual message and genre that this show follows is true to its values. Following the events of the first season, the second season does a great job picking up where it left off. The second season focuses more on romance but still being true to the SoL and Drama genres. Here are my reasons why I gave this anime a perfect score:\r\nStory 10/10:\r\nAlthough the story does drag on and you sometimes feel like what's the point on going on and on about the same issue that thecharacters are facing, you need to remember that the anime is an adaptation of the manga. Maybe the studio did try to drag it on for the purpose of allowing the manga to catch up, or maybe because they needed a couple of extra episodes to be able to do the 12 episodes that were allocated for this season, but every episode served its purpose on developing each character. There are certain times where I can agree with comments about how \"childish\", \"immature\" or \"slow\" the characters are, but you need to remind yourself that 1) Sawako has never had this type of human interaction before, 2) the pace of the anime is kind of realistic because personally in real life, some misunderstandings and issues don't get solved in a matter of days, even less, a 20 minute episode. This just reminds us that everything in life takes time, and once you are able to figure it out, the time spent going over it was worth it in the end.\\n\\n\r\nArt 10/10\\n\r\nThe anime's art is unique. Even though it was made in 2011, its art is and style is very different from contemporary anime. It kind of reminds of me Japanese styled paintings you see in scrolls. You even have glances of Van Gogh art-styled backgrounds, which gives it a nice touch in my opinion. The art also favors the anime and helps set the mood for the characters.\\n\\n\r\nSound 10/10\\n\r\nI really enjoyed the opening and ending themes of the anime. I usually skip them when I watch anime but I didn't do it for this one. The music is also slow tempo overall which give this \"slow\" effect to the anime, but as I mentioned before, stays true to the slow drama and slice of life that this anime deserves to be.\\n\\n\r\nCharacter 10/10\\n\r\nEach character gets their development. There are no lose ends in the story. All main characters are given some type of closure at the end which, although longing for a third season, makes this season have a truly worthy ending. Given that its a romance, slice of life and drama anime, the interactions between characters all have a purpose that develop and move the story further. The characters are true to themselves which made it easy for me to relate to them. If I miss this anime, I would say it would be because of the characters rather than the story.\\n\\n\r\nEnjoyment 10/10\\n\r\nThis anime is a roller coaster ride of emotions. It moves you, makes you disappointed, makes you cry, makes you smile, but overall, it made me happy - enough for me to write this review. \\n\\n\r\nOverall 10/10\\n\r\nIf you really have enough time, and really want to watch an anime true to its genre I recommend this anime for you. Even though as I said, I agree with some comments with the pacing of the story, but in the end, it was really worth my time watching. If you want to dwell into an anime with human emotions, relationships and touch, this is a great anime for you.\\n\\n\r\nI would like to thank everyone who took their time to read this review as it is my first review in MAL. Hope you enjoyed it and hope it was useful to you.",
            "date": "2015-05-29T22:10:00+00:00",
            "helpful_count": 30,
            "mal_id": 189143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jorgechen1993",
                "username": "jorgechen1993"
            },
            "url": "https://myanimelist.net/reviews.php?id=189143"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nWhen it comes to most forms of media, sequels are a tricky business. Many people argue that the first iteration is the best due to nostalgia. Others argue that what comes after is able to build upon what came before so it is clearly better. For some shows, their sequels are phenomenal, such as Monogatari: Second Season or Chihayafuru Season Two. However, and sadly, when it comes to Kimi ni Todoke Season Two, they severely dropped the ball.\r\nSTORY\r\nKnT2 begins shortly after KnT1 left off, with our characters returning back to school for their sophomore year.\r\nInitially, I found thepacing of the show to be pretty much off. Part of the problem comes from the season only having 12 episodes to work with. When watching, each episode has about a one-month time skip when going from one to the next. Meaning, there is a great amount of back-story that is either ignored or at the minimum must be fantasized about in the viewers mind. Perhaps they felt that there was nothing to be told during these month-long spans, but it felt awkward that the characters would interact on one day and seemingly nothing happens between any of them for an entire month.\\n\\n\r\nBeyond the pacing, what I found incredibly frustrating was the level of misunderstanding that the show imposed. Kazehaya and Sawako experience some of the worst miscommunication between potential lovers I have ever seen (probably the only worst offender would be from School Days). Personally, I don't mind this trope in romance, as long as it isn't extremely prevalent. However, Sawako being unable to deal with her feelings and subsequently being unable to speak in crucial situations caused the plot to focus on her and Kazehaya's inability to talk with one another as opposed to focusing on their relationship.\\n\\n\r\nFurthermore, there were numerous times when certain events would be interrupted by side characters. This only compounded the frustration I had with the characters' interactions. It really doesn't help when progress is attempting to be made and it is constantly being thwarted by outside forces.\\n\\n\r\nANIMATION\\n\\n\r\nShort section, but Season Two maintains the quality it had from Season One. They still employ the \"rounder\" animation styling for comedic effect (and it still made me laugh when it was used). Again, many face shots and sparkles are to be had, so actual animation is kept to a minimum. But this doesn't deter from the overall pleasant look of the show.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhile many of the characters return once again for Season Two, I found their development this time to be severely lacking. This is mainly due in part to my ranting above; that is, the miscommunication doesn't generate growth in the characters. Rather, it halts it.\\n\\n\r\nThis season focuses more on Kazehaya and Sawako than anyone else, which I felt was a good move. However I think that the show should have attempted to do a better job on focusing on their relationship, much like Season One did between its characters. Instead, what it does is try to explore their feelings for one another, but due to the overall aloofness, it is poorly executed.\\n\\n\r\nSeason Two also introduces a new character, Kento, who acts as a catalyst in ruining Kazehaya's and Sawako's relationship while simultaneously making Sawako \"more popular\". I put \"more popular\" in quotes because this trait seemed to mirror what Kazehaya had already been doing. That is, he was the one that had given Sawako the confidence to enter into the social gatherings and be generally more open to those around her. Plus, he just adds further to the already massive amount of misunderstandings. Besides these traits, I didn't really much care for his character.\\n\\n\r\nLastly, I still feel that Kurumi's character, like Season One, was underutilized. She was greatly fleshed out and explored in Season One, dropped, then brought back briefly in the beginning and end of Season Two. But these small occurrences were some of the best parts of the show. At this point, I just think it was a poor decision on Production I.G.'s part to ignore her character throughout the second half of Season One and all of Season Two since she is arguably the most complex member of the cast.\\n\\n\r\nSOUND\\n\\n\r\nThis time around, I wasn't a big fan of both the OP and the ED. The OP gives a sense of urgency that doesn't really complement the show well. The ED, on the other hand, is very orchestral and leaves you feeling hopeful.\\n\r\nThe soundtrack is mostly the same with newer pieces added. These newer pieces were more \"uppity\" than those from Season One and did not really fit the show's themes and overall tone to my liking.\\n\\n\r\nThe voice acting is good once again, with Sawako, as always, doing a good job switching between her incredibly sweet side to her confused, nasal-y voice.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhen going into Season Two, I was hoping that Kazehaya and Sawako's relationship would take off from where Season One ended. They set it up nicely to have them come together so the show could finally focus on a relationship that was based on true love. However, each episode only makes you more mad than the last due to how inept the characters are at handling the situations.\\n\\n\r\nTo be honest, I was quite disappointed. Season One was very good in its focus and overall narrative. But to me, the majority of the show was unappealing. Only the final two episodes were any good, and what happens in them should have been the focus for this season from the start.\\n\\n\r\nThe show still has the same sense of humor, so if you laughed a lot during Season One, you will do so here as well. The romance elements are here, but again they are not truly explored until the end but by that point it is already too late. I really wanted to enjoy this season as much as the first one, but I just couldn't get over how badly the characters responded to one another, the loss of focus on relationship building, and the constant misunderstandings.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the misunderstanding level is incredibly frustrating to watch\\n\\n\r\nAnimation: Good, about the same as Season One\\n\\n\r\nCharacters: Fine, new character is pretty bad and character exploration seems rather repetitive, but good returning cast regardless\\n\\n\r\nSound: Fine, OP and ED are no good, newer soundtrack pieces are okay\\n\\n\r\nEnjoyment: Fine, I love romance but it just didn't feel quite right\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-09-19T21:30:00+00:00",
            "helpful_count": 25,
            "mal_id": 161095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=161095"
        },
        {
            "content": "'Kimi ni Todoke', vaguely translating to '(Let My Feelings) Reach You', tells the story of a gloomy girl falling for a handsome classmate. We saw in the first season that the protagonist Sawako used to be so creepy that her nickname is \"Sadako\" (reference to the antagonist from the 'Ringu' trilogy). One day she meets Kazehaya, a refreshing prince-like guy who didn't seem to care about her appearance or reputation, and Sawako sets out to change her own introverted personality in order to be accepted by him and other classmates. Series title is far more appropriate for the second season, as Sawako and Kazehaya bothstruggle to get their feelings across.\\n\\n\r\nThe premise in 'KimiTodo' was eerily similar to 2005 hit TV dorama 'Nobuta. wo Produce'. The only difference was that the prince sets out to produce/makeover \"Nobuta\" in dorama, whereas Sawako produces herself with help of friends. The appearance of Kento in the second season effectively cements 'KimiTodo' as a knockoff by completing Shuuji + Akira love triangle with the protagonist. It is especially disturbing that all three characters having identical personalities, and even same roles as the dorama counterparts. Both protagonists had a gloomy personality and appearance that scares classmates, both have unique nicknames derived from their names (Nobuko - Nobuta (Wild Pig), Sawako - Sadako (Ringu Character)), and both characters slowly gained confidence in themselves and earned the acceptance of classmates by the end. Kazehaya plays the role of the prince as Shuuji did in dorama, both of them are popular, cheerful archetype princes who casually interacted with respective protagonists at first, but slowly realizes their feelings and eventually confess their love. Finally, we have Kento. Unlike Akira in 'Nobuta', he appeared half way, but both characters have that carefree gaudy playboy persona and falls for the protagonist after the prince, to complicate the situation. Both characters try to steal the girl, both eventually fail, but remain supportive in the end. In addition, protagonists in both series had a rival fighting for the prince, again with identical persona. The two major events in the second season: Valentine's Day and School Festival (with protagonist as centerpiece) also happens to be the major turnaround events in 'Nobuta'. It's impossible to deny by this point that 'KimiTodo' is essentially a knockoff of 'Nobuta'.\\n\\n\r\n'KimiTodo' depicts the development of unconditional friendship, joy of school life, difficulty of confession, and awkward and blushing first love. All of which staple themes of seishun (coming of age romance) genre, which begs the question: \"Why anime?\" I was puzzled at first, because live-action TV dorama offers far larger audience than that of anime, and as Japanese networks have been shifting from housewives to fangirls as main dorama targets in recent years, seishun has become the perfect dorama genre. So why does the author and producers decide to waste money drawing something they could've easily filmed live-action to reach fewer, less relevant audience for a seishun manga series? It became clear to me by the end of second season that there were two main reasons. First, it is apparent by the end of second season that 'KimiTodo' is a mediocre knockoff of 'Nobuta'... it would never be appreciated by the 'Nobuta' audience, thus cannot be aired in prime time. Second, pacing. While there are plenty of slow paced dorama around, 'KimiTodo' appears to drag on forever with endless shoujo monologues. This series would have been completely unwatchable without the chibi-forms used to constantly provide comedic relief.\\n\\n\r\nBackgrounds were done really well for this series with spray effect that left a dreamy impressionist feel to most scenes. This is certainly a nice change to the standard digital fill or gradient effect in most series airing now. Unfortunately, characters often appear to be deformed because there were too little detail for the realistic design of their faces. The chibi-forms were also less than impressive compared to most comedy series. My biggest concern was the prevalence of frozen frames where little if any movement was present on the screen. This further contributes to the slow pacing that makes 'KimiTodo' a difficult watch.\\n\\n\r\nBGM sounded appropriate for most scenes, but lacks variety, with same tracks being recycled over and over. Sawako's voice acting was very tiring to listen to because of constant high-pitched whispering. On the other hand, supporting cast's voice, especially Ayane, Chizuru, and Kento were very distinct and fitting. OP has nothing much to talk about, but the ED song was absolutely wonderful. 'Kimi ni Todoke...' by MAY'S has the same poignant feel of 2005 hit song 'Story' by Japanese R&B singer AI, that same emotional, all-out tone accompanied by amazingly touching lyric that was perfect for this series. It did not enjoy the level of commercial success as 'Story', but this song probably ranks in top 10 heart moving theme songs across all forms of Japanese media content I've come across.\\n\\n\r\n'KimiTodo' is incredibly unoriginal and cliché, but there were some dramatic buildups and touching moments. My biggest complaint with the first season was that Sawako faced too few obstacles and overcame those too easily. The second season does offer more conflicts. However, it was ultimately a bland series that played too safe, and had nothing particularly remarkable or memorable about. I would definitely recommend 'Nobuta. wo Produce' live action dorama if you're into this type of premise.",
            "date": "2011-04-05T06:30:00+00:00",
            "helpful_count": 22,
            "mal_id": 35704,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=35704"
        },
        {
            "content": "Honestly, I was already bored near the end of season 1 but, it was tolerable so it's okay. However, this season was the complete opposite, it was so frustrating from the beginning till the end.\r\nStory: 2/10\r\nI was frowning the whole time while watching this anime. It became very annoying, boring and super cliche. After everything that happened in season 1, you will think that something different or something interesting is going to happen in this season but, nothing really changed - not the characters, not their relationship or anything- nothing change at all - they just keep on doing the same things they did inseason 1: worry about petty things, misunderstandings and all.\\n\\n\r\nArt: 7/10\\n\r\nNothing much has change from how it was in season 1.\\n\\n\r\nSound: 5/10\\n\r\nI only listen to the opening and ending song once...they are not really that interesting.\\n\\n\r\nCharacters: 1/10\\n\r\nSawako's character is understandable and tolerable during the first season and I liked how she tried so hard to change herself and make her classmates change her impression of her and be friends with them. But that \"will\" was completely forgotten. She became so weak and easily manipulated - constantly worrying and crying for almost every little thing, so her friends always need to help her, in the end she's one of those characters who always need to depend on people.\\n\\n\r\nKazehaya: I had a little crush on him during the first season. He was handsome and interesting character - at first - but as the series goes on, he became boring.\\n\\n\r\nOverall: 2/10\\n\r\nI was utterly disappointed, it could've been better. The whole season ended up with nothing but same old things, same old petty problems over and over again.",
            "date": "2015-12-29T07:06:00+00:00",
            "helpful_count": 17,
            "mal_id": 207203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5063637.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Nunnally03",
                "username": "Nunnally03"
            },
            "url": "https://myanimelist.net/reviews.php?id=207203"
        },
        {
            "content": "A very brief review, Kimi Ni Todoke 2 will probably be a very entertaining anime for the ones who've watched the 1st season. Me personally, I didn't enjoy the 1st one very much so it was probable that I am not very happy with the 2nd season.\r\nStory: 7, the 2nd season obviously focuses more on Sawako's love life and her want to deliver her feelings to Kazehaya. Development is seen in characters just like in the 1st season and Sawako is much more easily been able to fit in with the class. In the 1st season, there was a dramatic development in friendship and inthe 2nd season Sawako continues to make friends but the bulk is about her love for Kazehaya.\\n\\n\r\nArt: 10, I feel like the art is better than the 1st season and as seen in the 1st season the art was already very good. The colors set the feeling of the anime and make it look beautiful.\\n\\n\r\nCharacter: 7, if I were to focus on Sawako, this is the reason why the 2nd season frustrates me very much. Sawako is ridiculously weak with conveying her feelings and feel like she's way too nervous and overthinking everything. She's too easily influenced by other outsiders and even if she has more courage this season its very frustrating to see how she deals things with Kazehaya. Kazehaya on the other hand can be seen very straightforward with his feelings for Sawako. \\n\\n\r\nOverall my enjoyment for this anime is 5 because its ridiculous how this anime frustrates me so much. There is a ridiculous amount of misunderstandings in this anime that can be solved by a simple clearing. If the characters were able to say like 1 more sentence or so, there would not be as many misunderstandings to this point of episodes. I personally think Sawako is so stupid to not see through all these misunderstandings and surprised of how blind she is.\\n",
            "date": "2011-02-24T00:30:00+00:00",
            "helpful_count": 14,
            "mal_id": 34706,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/363056.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Antagonizes",
                "username": "Antagonizes"
            },
            "url": "https://myanimelist.net/reviews.php?id=34706"
        },
        {
            "content": "I personally think that there shouldn't be a 2nd season to this series. A pity it turned out to be such a disappointment since I enjoyed the 1st season quite a lot. Meh...\r\nStory: 3\r\nContrary to the 1st season, the story was centered upon Sawako and Shouta TOO much: how they were too shy to confess to each other and how all those misunderstandings interfered to make things even more difficult without reason. It was annoying and it made me lose my patience. It's the kind of story that if it was not a sequel, I wouldn't watch it even if I was paid to doso.\\n\\n\r\nArt: 9\\n\r\nNothing to add here. It was of the same quality as season 1. Quite bright and refreshing.\\n\\n\r\nSound: 7\\n\r\nWell, OT and ET didn't amaze me, but they fit nicely with the story. Voice acting is nice too (Noto Mamiko is my favorite). They really know how to throw the punchlines. Generally, nothing was out of place.\\n\\n\r\nCharacter: 4\\n\r\nCharacters such as Ayane and Chizu were totally given no significance other than the role of the matchmakers. It was really a waste because they were really interesting and contributing a great deal with their humor and backstories as well. The new character, Kento, was just helping new misunderstandings to show up. Sawako and Shouta were useless on expressing their feelings. The only character I liked was Kurumi, at least she showed consistency and bravery at times.\\n\\n\r\nEnjoyment: 4\\n\r\nI just watched it to shoothe myself after a gore anime. And because I had to complete it - call it OCD or whatever.\\n\\n\r\nOverall: 4\\n\r\nIt really changed my opinion about sequels. Previously I thought that I should watch sequels in order to see what happens in the end, but they don't always add something to the story. I would be happy with just the first season, nothing really happened in the second worthy of watching...\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-10-19T23:56:00+00:00",
            "helpful_count": 13,
            "mal_id": 201626,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4936171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/yolerMit",
                "username": "yolerMit"
            },
            "url": "https://myanimelist.net/reviews.php?id=201626"
        },
        {
            "content": "Kimi ni Todoke 2 is a continuation of the 1st season with Sawako(aka Sadako) and her friends graduating to their second year of high school. To those who had loved/liked the 1st and rated it highly will find the 2nd season no different as the pacing, comedy and teenage romantic angst which made up the 1st, still present in KnT2.\r\nFor those who had rated it poorly, well there's not much I can say except not to have too high an expectation as not much has changed or will change(apart from the art). The misunderstandings which some had found to be irritating in the 1st season,have now doubled as the 2nd heavily focuses on the new found romantic feelings of an introverted girl who can't seem to open up regardless of how much help she gets from those around her.\\n\\n\r\nThen again, who watches a sequel of something they don't like?\\n\\n\r\nSo what makes this series worth watching? Closure. It's all about closure in Kimi ni Todoke 2nd Season. The open ending which viewers received in the last episode of season 1 finally feels like a chapter is over this season, which should give them a sense of relief that the doors for the KnT anime has finally closed. Whilst the manga is still ongoing, I believe where season 2 ends is enough for a happy and fulfilling ending without giving too much of a spoiler. You could say I'm a fan of happy endings and unfortunately while season 1 did end on a happy note, it still left us with a question or two unanswered.\\n\\n\r\nNow it usually takes me a while to get comfortable watching romantic shoujo series without cringing to some of the casts lovey-dovey behavior(and I'm still getting used to it), but with the help of my wife renting a fair few of them especially when she has her girlfriends over, I've started to appreciate the genre and hence why I've really gotten to like this series as a whole.\\n\\n\r\nOne major change as I mentioned earlier would have to be the art for KnT2, which I was very amazed with as it had only been a year since the 1st season had aired early 2010. Backgrounds seem to be finer in texture, and the shoujo-esque character designs from 1st season seemed to have been better detailed. Of course we're not talking dramatic changes here and for those who loved the 'chibi-type' characters well known in season 1 for its comedy routine can rest assure as it still influences a major part of KnT2.\\n\\n\r\nHaving just finished watching the 1st season for the second time(prior to writing this review), the sound for KnT2 took some time to get used to, but once I did I found it fitting to season 2's mood and pacing. The OP 'Sawakaze'(Refreshing Breeze in English) performed by J-pop artist Tomofumi Tanizawa felt so appropriate for the series and the ED which also shares the title 'Kimi ni Todoke' performed by MAY'S, is set in a slow ballad's tempo which really sets the mood for the overall series.\\n\\n\r\nIn KnT2, we see the full cast return from 1st season(with their matching voice actors) including Kurumi who I now see in a new light(although still bitchy as ever), and we also see a new character by the name of Kento Muira who plays catalyst for the would-be couple. The main cast are still the same as the last season with the female lead Sawako still introverted as ever(even more so this season) and the school she goes to still puts her love interest Kazehaya on a high pedestal(to a point that I'm starting to think some of the guys are gay for Shota). Well I guess that's one shoujo-esque trait I will never get used to.\\n\\n\r\nFor those who felt frustrated with the misunderstandings which played a major role of season 1, may not like where season 2 is heading as it now plays as the series core setting. There's enough hair-pulling tension to be seen in season 2 that it's enough to make one go bald. Well I guess that's teenage shoujo for you.\\n\\n\r\nSo in a nutshell:\\n\\n\r\nStory - 8\\n\r\nArt - 9\\n\r\nSound - 9\\n\r\nCharacter - 8\\n\r\nEnjoyment - 8\\n\r\nOverall - 8\\n\\n\r\nTHE GOOD - The Art, the Animation and Closure. Specially closure which is a really big plus for me with the whole Sawako x Kazehaya romance. What the first season had lacked, is now the main focus for the second. \\n\\n\r\nTHE BAD - The slow pacing and the embellished misunderstandings. It takes 3 episodes to get over 1 misunderstanding!! If you haven't seen season 1, then there will be some things you won't understand in KnT2 as the series does not serve as a standalone. Apart from Kurumi's special recap at the beginning of the series, not much is explained to the how's and when's that take place in season 2.\\n\\n\r\nIf you are a fan of the first, Kimi ni Todoke 2nd Season will be like icing on your cake. Of course if you haven't seen season 1, I strongly suggest watching it before even making the endeavor to start season 2(and who in their right mind starts something mid-ways anyways?)",
            "date": "2011-03-06T17:15:00+00:00",
            "helpful_count": 13,
            "mal_id": 34934,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scrypt",
                "username": "Scrypt"
            },
            "url": "https://myanimelist.net/reviews.php?id=34934"
        },
        {
            "content": "✵WARNING THIS REVIEW IS KINDA SPOILERISH SO READ AT YOUR OWN RISK✵\r\n✵YOU'VE BEEN WARNED✵\r\n   I can't express how much this second season let me down, I was really looking forward to it but all that it was, was the first season shortened and allot more boring. I swear, in every episode I was like ¨When is this gonna end?¨ and the anime was like ¨Never! I will haunt you forever!¨\r\n   Story 5: Why a 5? Because this season was almost like the 1st one, I don't even know why they called it a second season, they could happily shorten it abit and make it part of the 1st one. In the second season Kazehaya is still in love with Sawako -surprise- but doesn't know how to tell her his feelings for her, the same goes for Sawako that discovered in the end of the 1st season she ACTUALLY loved Kazehaya -no shit- but is too shy to go and tell him that. So that's why all the second season revolves about them trying but failing miserably to tell the other how they feel, there were actually three confessions; The first 2 being epic fails making them grow apart and feeling awkward and insecure around each other, and the third one-FINALLY- being successful which leads  them to start dating. But it's incredible because every little confusion and tear could have been avoided if Sawako wasn't that dumb for godamn sake, she herself starts overthinking evrey little word and expression that leads her to believe he can't stand her or he finds her annoying-even after all the time they spent together she actually believed that- or he likes someone else-wow! How unique! Didn't see that coming, did ya?. But the last thing is what I want to talk about next, because she didn't thought that up herself, she had actual help...OF A GUY!\\n\\n\r\n    Let's talk about this guy for a sec, his name is Kento Miura, and holy mother of god if he isn't hot. Kento -Ken for short- was a new classmate of Sawako, because as they passed to 2nd year all the classes were mixed -but surprise, surprise,Sawako stayed with all her friends, even Joe was there- so she ended up with him sitting next to her in class. Well, long story short, he came to like, in the romantic way, and that, of course, made Kazehaya jelous. And gee if that wasn't new, I mean, didn't something similar happened with Ryuu in the 1st season? Is like all the producers of the anime got together and said ¨Let's think of all the things that happened in season 1 change it a little and put it in season 2! I mean, kids this days are so stupid they won't even notice!¨Well, I noticed, I noticed!!\\n\\n\r\n   And now you are wondering what happened with that guy...Nothing. He just became a friend. That's it. After making Sawako believe the guy she loved liked someone else, he just said ¨Ha, YOLO¨and became her friend. NO! NO NO NO! I WANTED TO SEE SOME CHARACTER DEVELOPMENT! NOT SOME THING THEY DECIDED TO PUT IN THERE FOR THE SEASON TO BE LONGER! ARGH!\\n\r\nThis precious second season, that I was looking forward with all my heart, was just some giant, disappointing, ball of shit. Oh, but in the end everything turns out well, and Sawako and Kazehaya end together like a happy couple, but by the time you get there you already smashed your computer screen with a hammer 3 times.\\n\\n\r\n   So that's all I wanted to say, that if the producers intended for them to end happily ever after, they could just make 3 episodes, put it in the 1st season and VOILA, perfect ending, me smiling, and computer screen not crushed to a million pieces. Ahhh,feels good to take all of that out of my chest. Well's that's all, I guess.",
            "date": "2014-02-19T22:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 133215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3465169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/scarletgirl",
                "username": "scarletgirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=133215"
        },
        {
            "content": "Kimi ni todoke tells the story of a shy girl named Sawako. She falls for the most popular student Kazehaya school. The story then unfolds. \r\nSTORY: (5/10)\r\nThe first season was good,  because there were good  secondary characters   At first, the story was very cliché, but the first season had a good direction and a decent script. The romance in my view never caught my attention. And I confess that I found silly and naive.\r\nThe second season was poor compared to the first. A bad script and poor direction. I watched all the episodes and concluded that all are tiring and repetitive.There were episodes without any importance for the plot and for those who wanted a serious romance and developed characters was a big disappointment.\\n\\n\r\nART: (8/10)\\n\r\nIn relation to art and animation, Kimi ni Todoke was good. The design and animation is somewhat reminiscent Haikyuu !! Only after I find that belong to the same studio: Production IG. Generally this studio produces good animation , although don´t be a Kyoto Animation.\\n\\n\r\nSOUND: (7.5/10)\\n\r\nThe opening and ending of Kimi ni Todoke are good and matches the smoothness of the animation with light tones. The soundtrack is also good, although not quite match with certain exaggerated scenes especially in drama. Overall, the opening, the ending and the soundtracks are creative.\\n\\n\r\nCHARACTERS: (6/10)\\n\r\nAbout the characters: there are characters of all kinds. But the best characters were the supporting cast: Ayane, Ryuu and Chizuru. Of these, I liked most of Ayane, because she is quite mature and observant. It's a shame the script doesn´t value this character. Should at least focus more on Ayane than unsympathetic main characters. Ryuu and Chizuru form a beautiful couple, well explored in the first season. However, in the second season these two were little valued.\\n\\n\r\nOn the main couple: it´s really hard to like Sawako. All right, she's shy, but too forced this feature. I found the script selfish, since during the 12 episodes she little effort to mature (she could still be shy). In the end I found very superficial her relationship with Kazehaya. I did not like Kazehaya, but not hated. For me he was the character who suffered most. That's because Sawako is a weak and characterless character. And Kazehaya however like to Sawako, did not know her feelings\\n\\n\r\nAbout the \"antagonists\": I liked the Ume. Despite being popular, she is very lonely. I like her sincerity, well used in the first season. In the second, the character is half cleared and only appears at the end (last episode). I found cowardice by the script because she does not have much chance to explore the love that  had with Kazehaya.\\n\r\nI do not have much to talk about Kento. I found it odd how and why he was attracted by Sawako. It did not help much in the plot and as well as Ume, Kento was underexplored.\\n\\n\r\nAbout the girls who loved Kazehaya: I got tired of seeing girls falling in love with a popular boy. This is a feature that Shoujo animes are for attracting the female audience. The same thing happens in the shounen and ecchi, but with different fan service.\\n\\n\r\nENJOYMENT: (5.5/10)\\n\r\nFor me as entertainment it wasn´t good. For the general public maybe yes. Not much value the entertainment, but it´s necessary have a good script, a good direction, good characters and good stories. Kimi ni Todoke (first season) did not have a good entertainment, but there was a good script and good direction. The second season: no entertainment, no good script and direction.\\n\r\nAlso, I prefer animes nonstandard.\\n\\n\r\nIt´s hard to see an anime shoujo nonstandard, different and interesting as Akatsuki no Yona, Akagami, Nana and interesting Joseis as Chihayafuru and Sakamichi no Appolon.\\n\\n\r\nOVERALL: (5/10)\\n\r\nOverall, Kimi ni Todoke 2 isn´t a good anime. I would not recommend, what saves is the first season. The script is super repetitive and tiring added to a bad direction. The animation and the supporting characters are good, but can not be quite strong enough to overcome negatives.",
            "date": "2016-03-09T11:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 212562,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4578004.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Anriee",
                "username": "Anriee"
            },
            "url": "https://myanimelist.net/reviews.php?id=212562"
        },
        {
            "content": "This is the continuation from the first season of Kimi ni Todoke and as slow paced as ever! This hadn't been much of a bother in the first season, but had became an annoyance. Every time I finished an episode i wanted to break my face in with my keyboard.\r\nI had originally loved the ending of the first season and expected just as much. I wanted to feel that happiness for them and the satisfaction I need... Was I asking to much? Of course the ending was great, but it didn't even feel like an ending. This was only confirmed by checking the manga, afterlearning that the series had stopped at Chapter 46. \\n\r\nThe manga itself is still on going. This leaves the question, will they will continue to adapt it?\\n\\n\r\nStory 8: The story leaves straight off from the first season. Both Sawako and Kazehaya relationship was starting to deepen and problems were creeping in. \\n\r\nLoving one another from far away wasn't just enough anymore. Feelings of one-sided affection was now a problem. \\n\r\nAs slow as ever, it seemed to drag on for to long and was very aggravating. All the avoidance and sadness took far to much of this season. The happiness and hope had seemed long gone and was starting to turn into a show I didn't like. Hopefully, Kimi ni Todoke saved itself.\\n\\n\r\nArt 7: I dont think i every seen such a bipolar change in art. At times the show amazed me in awe of how beautiful the characters were (especially Sawako's smiles). It has an almost light and soft art style that is enjoyable.\\n\r\nThe shear amount of chibi in each episode makes me sometimes wonder, what was the need of that? I'd say it ruined the beauty it had going for it. \\n\\n\r\ncharacters 8 : Let' start with Sawako, a very fulfilling character. She started off as a awkward shy girl with almost no emotions in the first season...Due to her friends she now know what it is to feel happy and how to talk to others.  Her dense head can make her quite hilarious to, but can make trouble. Sawako's character almost shines with innocence.\\n\r\nMaking her one of my favorite characters.\\n\\n\r\nKazehaya: A popular and kind boy, but at times is selfish and rash. You won't notice it though. Kazehaya is very social to cover up what his insecurities are. Other than that he is a great guy that treat everyone equal.\\n\\n\r\nEnjoyment 6: All I can say is the middle of the season almost made me stop watching and break the tv screen... It will get better. \\n\\n\r\nOverall, the 2nd season ended well and cleaned up all the hate I felt for it, but I cant help to think of how much better the first season was. Kimi ni Todoke is in fact one of the better shoujo's out their. Give it a try and you might be surprised.",
            "date": "2013-05-02T02:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 95661,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1669675.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xDiablo",
                "username": "xDiablo"
            },
            "url": "https://myanimelist.net/reviews.php?id=95661"
        }
    ],
    [
        {
            "content": "When I first heard that there would be a continuation of Kimi ni Todoke I was overjoyed but also filled with great trepidation.  The original had a less than stellar ending, so the prospect of getting a worthy finale to the series was an exciting opportunity.  But at the same time I know the track record when it comes to sequels in anything, and considering how much I loved the original I feared it would be impossible for it to live up the expectations I had for it.  In the end both came true in a way, being at the same timebetter and worse than the first season.\\n\\n\r\nWhat really attracted me originally to Kimi ni Todoke was the way it broke the typical shoujo stereotypes and mostly stayed away from them.  Instead standing many of them on their heads and having fun with them.  It stayed away from love triangles, misunderstandings, and the other typical cockblocks that plague romance anime.  This begins to change somewhat from episode one when we are introduced to a new character Kento Miura.  A character that could only have one purpose and a type that anyone familiar with the genre could recognize from the start.  While in retrospect I probably shouldn't have been surprised that a rival might make an appearance, I also think that it’s a bit out of character for the series as well.  Sawako is just too innocent and simple of a personality to have her heart swayed by the appearance of additional bishies.  Though his character doesn't really pan out the way I feared he would, I am still left wondering if it was even necessary to include him at all.  \\n\\n\r\nAs much as Kento's arrival initially annoyed me, the main problem overall with this anime is the frustratingly slow pace.  This started to bother me in the first season towards the end but most of the time you just found yourself tapping your cheeks and exclaiming, \"Aw, they're so cute!\"  However now I found myself more often pounding on the arm of my chair screaming, \"Get on with it already!\"   The constant string of misunderstandings and hand-wringing gets old really fast.  There is a limit to how clueless, how bashful, and socially awkward two people can be.  And this is the source of most of my frustration with the plot. \\n\\n\r\nHowever, as much chagrin and annoyance as most of the series' pacing caused me it’s almost completely offset by how it ends up.  All of my expectations were fulfilled as we are treated to a wonderful culmination of their struggles to reach each other’s hearts.  We are even treated to something that we rarely get to see in romance stories, the after the confession story.\\n\\n\r\nAnother rewarding aspect of this season is the continued growth of Sawako's character as a normal well adjusted person.  As much annoyance as certain characteristics of her personality caused me at times by the end you see a girl who changed quite a bit from the shy and gloomy person at the start of the first season.  Even Kazehaya is changed, though it is not as noticeable with his outgoing personality as a shell to cover up his own insecurities. \\n\\n\r\nThe rest of the cast remains pretty much unchanged with one notable exception; Kurumi.  Her role in this season is greatly diminished but all of her appearances are quite impactful.  Each one displays an element of her character, from jealousy and vindictiveness to vulnerability and honesty.  Over the course of the series she manages to both stand in Sawako's way and to help her get around her.  Though you could say they are technically not \"friends\", this kind of tough love probably changed Sawako in more ways than any of her other friends managed to.  I think that everyone can relate to Kurumi's feelings and her unrequited love.  It's hard to not feel a little sorry for her, but while she's still not over Kazehaya by the end its clear she is going to be ok.  Unlike most rejected romance characters, it’s hard to imagine Kurumi pining for Kazehaya for the rest of her life.\\n\\n\r\nArtistically there is really no change from this season to the past one.  It remains the most beautiful shoujo romance probably ever made.  If there is any fault to be had it is with the overuse of Sawako's chibi form.  While I myself happen to love chibi style animation, I felt they were used inappropriately at times.  Particularly in some of the more impactful scenes which ended up taking away from them.  The music and voice acting remains top notch,  MAY's \"Kimi ni Todoke\" ED song I think is the best one of the entire series.  Mamiko Noto's performance is also quite memorable.  I really believe this is a defining role for her, almost as if the character had been created specifically for her.  I cant imagine any other seiyuu voicing Sawako.\\n\\n\r\nOverall the 2nd Season of Kimi ni Todoke is an excellent conclusion to the series.  Though even with its excellent ending it never feels like it equals the quality of the first one.  Combined with the frustratingly slow pace and an implausible string of misunderstandings, makes the experience as a whole uneven.  Despite these warts if you loved the first season your still going to like and perhaps love this as well.\\n",
            "date": "2011-03-31T06:23:00+00:00",
            "helpful_count": 346,
            "mal_id": 35512,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=35512"
        },
        {
            "content": "Disclaimer: Kinda sorta spoilers, but not really.\r\nBefore you skip over this because of the low score, do me the courtesy of reading through the review, first.\r\nI came into the second season immediately after watching the first. It might be a good idea to read my review of the first season, to give you some context. \r\nEven if you don't, the short story is that I really, really liked the first season. I was this close to giving it a 9, which for me is an amazing grade.\r\nThe point is, I came into the second season with very, very high hopes and expectations.\r\nThey were not met.In fact, they were crushed.\\n\\n\r\nLet me get some good points out of the way. The animation is still very good, with some very powerful moments here and there.\\n\\n\r\nThe music, surprisingly, fit in a bit better and actually left an impression at times rather than being nonexistent like in the first season. The closing song sounded better this time, too.\\n\\n\r\nNow, on to the plot:\\n\r\nDisappointing first few episodes. In fact, the first 7 episodes were a total disaster. Cheap drama created by characters thinking but not actually saying what would fix an otherwise simple situation.\\n\\n\r\nTotal reboot of the relationship, invalidating the last several episodes of the first season and cheapening the plot overall for pointless drama.\\n\\n\r\nA lot of the things that I hate about drama anime surface on the second season, while they were absent the first. Namely, it's the retarded misunderstandings. The sort of situations that arise only because a character took something someone said completely the wrong way, or didn't say something simple yet vital. These sort of things are easy, cheap drama generators and would never happen in real life because in real life people are not that stupid.\\n\\n\r\nSimilarly, Sawako seems to have taken the same steep dive the show itself has. There is no sign of the backbone that she had in the first season. She's turned into the depressed, passive and utterly stupid classic anime chick who believes whoever's mouth is moving at the time. What the hell? Sawako in season1 spoke her mind and, even though she was afraid, always tried her best for what she wanted to achieve and wasn't afraid to contradict other people. What happened to that? For f-'s sake, even Kurumi admitted that she didn't expect Sawako to be such a mindless sheep.\\n\\n\r\nSimilarly, Kazehaya seems to have realized he's starring in an anime and started doing all the retarded shit anime characters sometimes do, even though he'd made it a point to contradict those expectations in season 1. Things like being led around by the nose by everyone who speaks to him, having no personal conviction, and not respecting other people's right to a decision, like he demanded in season 1 for himself. The latter episodes kind of fix this, but the damage is done by then.\\n\\n\r\nI mean, what the actual f-? Did they seriously make more than one episode's worth of drama based on the misunderstanding that both think the other meant a different definition of 'like'? How can that elicit any emotion other than bafflement from the viewer? How are we supposed to empathize with the characters when their only problems consist of having exactly 0 communication skills?\\n\\n\r\nWhen the answer 'Does your anime's conflict get solved if the characters say a single reasonable sentence to each other?' is 'Yes' then you're doing something wrong, goddammit.\\n\\n\r\nI wanted to drop it on the first 4 episodes. I really wanted to drop it on episode 5. I should have dropped it on episode 6. I kept going because I'm the kind of guy who can't look away from a train wreck, and because after watching the first season I at least wanted to see how the second one concluded.\\n\\n\r\nThe episodes after 6-7 seem to merely be trying to reel back in the shit parade. They're not bad. In fact, they're fine. However, that doesn't erase the fact that none of this should have happened. Much as I enjoyed the episodes from 8 onwards, the fact remains.  The last few episodes are spent resolving situations that arose out of pure and unadulterated stupidity that are definitely not the kind of thing I was expecting coming into this.\\n\\n\r\nThe last episode is appropriately heartwarming, I'll give the series that. However, imagine the last two episodes being, in fact, the FIRST two, and then the rest of the season being the two of them exploring their new relationship. There was no need for the pointless and outright silly drama of the first 7 episodes.\\n\\n\r\nThe fact that the last few episodes were good kind of softened me up by the time I finished it, but it doesn't change the fact that more than half of the season was garbage. I want to rate it high because of the last two episodes, and I want to rate it very, very low because of the first few.\\n\\n\r\nI guess I didn't do myself any favors by having high expectations.\\n\\n\r\nAs it is, I'll just sigh and give it a 5/10.",
            "date": "2015-04-07T09:04:00+00:00",
            "helpful_count": 200,
            "mal_id": 185045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4500546.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RepThe21st",
                "username": "RepThe21st"
            },
            "url": "https://myanimelist.net/reviews.php?id=185045"
        },
        {
            "content": "**THIS REVIEW CONTAINS MAJOR SPOILERS**\r\nI thought that in the second season Kuronuma and Kazehaya would be dating early on and that the episodes would be about their relationship together. When I realized that it was going to be twelve episodes of them doing nothing, it was pretty frustrating.\r\nIn the first season, I liked all of the characters (especially the protagonist Kuronuma Sawako) because I found them all funny and enjoyable. By the fourth episode of the second season, Kuronuma became obnoxious. There was no plot development at all in this season, and it seemed like every episode was exactly the same, with the characters restatingtheir feelings of, \"I like him/her but what if it ruins our friendship!\"\\n\\n\r\nI really enjoyed the first season of this show, but I was surprised when they didn't get together in the end since we had already reached the conclusion of \"they both like each other\" quite a few episodes prior.\\n\\n\r\nThere was no need to drag this out so long. If this was all that was happening, they should have just gotten together at the end of the first season and had no second season.\\n\\n\r\nOverall, even though I liked the ending and I was happy to see them get together, the frustration of seeing nothing happen for twelve episodes straight was a waste of time and I think this season was a waste.",
            "date": "2014-11-18T10:33:00+00:00",
            "helpful_count": 97,
            "mal_id": 169083,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201354.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Karudima",
                "username": "Karudima"
            },
            "url": "https://myanimelist.net/reviews.php?id=169083"
        },
        {
            "content": "PATIENCE IS A VIRTUE \r\nStory: 10/10 Beautifully continued from the first season, Kimi Ni Todoke Season 2 kept me hungry for more with the developing relationship between Shouta and Sawako growing.\r\nArt: 10/10 I fell in love with the stunning artwork when I was introduced to it in the first season. The characters are drawn more realistically than most Japanese Anime and the scenery (cherry blossoms) are amazing.\r\nSound: 10/10 I love the music. My favorites are the romantic tunes when Shouta and Sawako look at eachother.\r\nCharacter: 9/10 I love Shouta's character. He's this cute, outgoing athlete who becomes this cutely shy guy when it comes toSawako. Sawako is this introverted girl who becomes extremely shy when it comes to Shouta. The only problem I have with this is that for many episodes throughout Kimi Ni Todoke (in general, but more in the 2nd season) there are times where I think they are too shy. It even becomes quite unbearable at one point in the 2nd season; I almost wanted to stop watching the anime. However, I understand that Sawako was very unsocial to begin with and Shouta is just shy around her because he likes her. I needed to cut her a little slack.. but Shouta couldn't tell that she liked him. It took him a while before he started to get it. I hate it when anime characters are DENSE. \\n\\n\r\nEnjoyment: 9/10 Besides the middle of the 2nd season of Kimi Ni Todoke where I wanted to rip out my hair because I was so frustrated that Sawako wasn't getting it, I love this anime. :) I really enjoyed this anime more as it went towards the end of the season (Episode 10 to be exact). That one episode is amazing.\\n\\n\r\nOverall: 10/10 I love this anime. Despite the shyness, I thought that everything was well done. I recommend this anime to people who love a cute love story, but have the patience to sit through it. It took a while but in the end, I felt happy. In fact, if they didn't drag on the developing relationship, then there would be no strong meaning to the title.\\n\\n\r\nI can't wait to see the last 2 episodes. I'm sad that there are only 2 though..:(\\n\\n\r\n-MsCHOCOHOLICishere",
            "date": "2011-03-24T17:02:00+00:00",
            "helpful_count": 89,
            "mal_id": 35318,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465416.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MsCHOCOHOLIC",
                "username": "MsCHOCOHOLIC"
            },
            "url": "https://myanimelist.net/reviews.php?id=35318"
        },
        {
            "content": "I have to give this anime the highest score you can possibly give. For a while, I've heard of this anime and how amazingly adorable it was. I watched it for the first time in January and immediately got hooked.\r\n The story is of a shy, misunderstood girl name Sawako (known to others by Sadako) and a bright, \"refreshing\" young man named Kazehaya (Shouta). This story bases mostly on friendship and romance, which I think is awesome :)\r\n In the first season, Kazehaya helps Sawako gain more confidence and she is able to speak out better. She also found new friends (who are the BESTby the way). In the first season, Sawako realizes her love for Kazehaya and wants more. Therefore moving on to the second season. :D The last season was amazing. I recommend you watch it first. A happy ending in almost all the episodes ( wait, maybe all of them).\\n\\n\r\n In the second season, it's more focused on love. Kazehaya and Sawako will probably take their relationship to the next level, but more misunderstandings before that. The story is outstanding. The plot is not going too fast, or too slow. The art makes you understand the mood and the story better. And the settings are beautiful. The sound always has a great help in the atmosphere and a lot of the times are nostalgic sounding. The characters are the most ingenious. Especially the mains. Sawako's cuteness and naturally creepiness is the main reason I'm still here. Also, Kazehaya is not too unrealistically sweet and can get mad and impatient. Which makes him the dream boy for most girls (including me). The best friends, Yano and Chizu are total polar opposites, which makes it funny to watch. Also, the teacher Pin and Chizu's childhood friend are just hilarious and funny to see :D\\n\\n\r\n I just LOOOVE this anime and I hope you do too~",
            "date": "2011-01-24T16:07:00+00:00",
            "helpful_count": 62,
            "mal_id": 34017,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/433592.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ixWishingx3",
                "username": "ixWishingx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=34017"
        },
        {
            "content": "This review is for both Season 1 and 2\r\nRating - 10\r\nSorry for giving it a 10. I know it's probably because I am a sucker for a rom-com genre but hear me out. Rarely does an anime give me the urge to have an all-nighter once I started watching one. Kimi ni Todoke did not make me sleep at all. I have watched the 2nd season, specifically episodes 9 - 12 a couple of time for it to sink in. It was a joy to watch Kazehaya and Kuronuma finally get together in the end. The plot may be slow but it was definitely worththe wait. Although I feel like there should be more, I am contented on how the story went and ended. I love the characters especially Kazehaya because despite of being the person who can have the woman he wanted, he pursued someone who he thought is unreachable. I just love the plot so much.\\n\\n\r\nGive it a try folks! It's worth the wait, I swear!",
            "date": "2015-08-11T00:10:00+00:00",
            "helpful_count": 59,
            "mal_id": 195794,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4770883.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ashiang07",
                "username": "Ashiang07"
            },
            "url": "https://myanimelist.net/reviews.php?id=195794"
        },
        {
            "content": "So here we are, already at season 2. It seems like just yesterday, I was reading chapter 0 of the manga.\r\nAnyways, just me sounding like an old grandma.\r\nSo if you didn't watch the first season, I would because A) it's awesone and B) if you try to watch the second season without the first one, you're going to be seriously confused. But if you didn't watch the first season, it's basically an amazingly cute romantic-school comedy. Yes, it doesn't sound very compelling at first, but it really does become addictive.\r\nStory: 9\r\nFor those that don't know, Kimi Ni Todoke is about the story of the buddingrelationship between a shy, scary-looking girl (Sawako) who everyone is afraid of and the super popular but super nice boy in her class (Kazehaya). I'll admit, at first I was kinda skeptical on the story because it sounded like it was going to be like every other romantic school comedy but I was pleasantly surprised. The story is (for lack of a better term) refreshing and absolutely adorable. \\n\\n\r\nArt: 7\\n\r\nI'm not a huge fan of the art style for the eyes in the anime but everything else is great. The animation is very precise and detailed and backrounds are intricate. The coloring is also good and evokes a kind of nostagic feeling.\\n\\n\r\nSound: 9\\n\r\nJust looking at the list of voice actors in Kimi Ni Todoke will make any anime fan excited (Daisuke Namakawa, anyone?!?). And as they should, they do a great job expressing the characters' feelings. As for music, the OP and ED are fittingly adorable (I'm literally counting down the days until they are released) and the insert music is fitting and nice sounding.\\n\\n\r\nCharacter: 8\\n\r\nOne of the really great parts about Kimi Ni Todoke is the characters. Sawako is as cute as a fluffy puppy with rainbow sparkles, Kazehaya is the ideal boy (at least to me) and Chizu and Ayane (Sawako's other friends for those people who missed out on the first season) are the perfect friends. They make me laugh, cry and go \"AWWWWWWWW\" really loudly. Realistic? Not really. But hey, its anime.\\n\\n\r\nFinal Score: 9\\n\r\nSo what have we learned? Kimi Ni Todoke 2nd Season is the continuation of the totally amazing first season and can be summed up in two words, \"absolutely adorable\". The story and characters, while not realistic, are absolutely charming. The sound and art, are both great although the art was a bit lacking in the faces. But all in all? A solid anime that is (I'll say it once again), absolutely adorable.",
            "date": "2011-01-07T07:31:00+00:00",
            "helpful_count": 51,
            "mal_id": 33542,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362418.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PoweredByRamen",
                "username": "PoweredByRamen"
            },
            "url": "https://myanimelist.net/reviews.php?id=33542"
        },
        {
            "content": "THE TURTLE RACE ENTERS STAGE 2!!! Thats gotta be the best way I can describe how I felt when I sat down to watch this 2nd season of kimi ni todoke. As is the case with many/most of you, I watched the first season and was rather annoyed(or simply straight-up pissed) by the extremely slow approach they took; so just to let you all know, its gonna be more of the same here.\r\nThe story: This continues right where the first season left off with sawako and kazehaya each secretly loving each other from afar(or as far as one can get in the same class) andfeeling that their affections are one-sided.\\n\r\nIf season one could be described as a turtle race, the first half of this could be described as \"an uphill leg of the tour de france, between two guys with no legs\"  As you have hopefully gained from this clever analogy, not only is this slow paced, but at the begining it actually goes backwards briefly. This is resolved eventually, and the show couldve been over at least three times by episode six, but why would they do that when they could drag it out for another six episodes.\\n\\n\r\nThe art: Same as ever, kinda seems to be done in a joking manner but it works well; sawako can look super pretty, or fool me into thinking the zombie appocalypse just started.\\n\\n\r\nThe characters: All the same as last season, with the addidtion of some flamboyant blonde guy who seems interested in sawako but I dont know that we ever know what he's after.\\n\\n\r\nEnjoyment: I was happy when it was over, I mean this is two ways. Firstly, I felt like I had spent too much time on it and was happy that it was finally done with. Secondly, I liked the ending, it was one of those \"bout f-ing time\" things, and while some of you may consider this to be a spoiler, think about it, why would they make a second season for any other reason?\\n\\n\r\nOverall this was really a sweet little story, but it took forever. I thought that it was kinda generic with the expection of sawakos role which was actually quite refreshing. Honestly I dont know if I would recomend this to anyone, but on the flip side, I also wouldnt tell anyone not to watch this. This is kinda just up to you, in hindsight, im glad to have watched this.\\n\\n",
            "date": "2013-04-26T05:59:00+00:00",
            "helpful_count": 45,
            "mal_id": 94981,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=94981"
        },
        {
            "content": "Kimi ni Todoke has stunned me. To sum the first season up for me; well it was fun but the pacing really got to me, and by the end I felt discontent for something that ran for half a year. If that is what made me give the first season a 7, it is what is giving this a 9. Of course scores are arbitrary, some people won't give less than a 6, but there is one thing that this season does: Makes all this time worth it.\r\nRetaining the humor, if not funnier when appropriate, this show put a smile to my face. With allthe build up from last season, it only allows those characters to interact better with each other on a more complex relationship. Of course there are those others that are enjoyable because to be honest, who can't help but enjoy a joke from Pin or that annoying Joe? If anything, the show takes all that anticipation I had last season and quenches it - The progress undergone by Sawako and Chizuru and of course Kazehaya and Ryuu is really great.\\n\\n\r\nUnfortunately, not everything is flowers and sunshine for this shoujo piece. The thing that bugged me the most was a misunderstanding forms that really shouldn't have happened. I know that sometimes that characters are incredibly dense, but the significance of it really made me think I was watching some shounen harem. It just felt out of place to me in a show that is very serious and logical when it should be. A new face also shows up, which acts as an instigator as a jealous Kazehaya can no longer sit around and twiddle his thumbs.\\n\\n\r\nThankfully, the character in our new love triangle is really awesome for somebody who you should be thinking \"#$%@ you dude, leave the damn couple alone.\" This character truly has Sawako's wellbeing at heart, and never 'really' makes an ass of himself.\\n\\n\r\nHowever at heart Kimi ni Todoke remains its original self, full of internal monologues, a lot of new(?) sadako jokes, and couching of our introverted female lead. As a male viewer who previously thought this was just a run of a mill shoujo the second season made me think twice, pick up the manga, and write a review. Although it might be somewhat predictable at times there is no doubt this show will be able to reach you whether it be your funny bone, fangirl/boy-ism, or your heart. \\n",
            "date": "2011-06-27T15:51:00+00:00",
            "helpful_count": 43,
            "mal_id": 38388,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=38388"
        },
        {
            "content": "Konnichiwa =) this is my first time writing a review (please be kind and don spam the \"not helpful\" button, i am a really sensitive person).. i wanted to do one for an anime that hasn't being done by many yet and since KnT season 2 has only just being released, i thought this is the best opportunity for me =] \r\nWhen i first watched the first and second season of KnT, i thought it was quite good at how realistic and practical this anime is compared to others where you can literally predict what is going to happen as well as the way thecharacters are going to be developed. But in this anime, they give you the main character Kuronoma Sawako, a misunderstood but kind girl who is shunned by the people around her because of her eerie looks and unnatural tone she takes on when speaking to strangers. However, another character, Kazehaya sees her for who she really is and befriends her. \\n\\n\r\nAs the story progresses into season 2, both of them develop distinct feelings towards each other and they get into all kinds of epic situation due to the fact that they are both EXTREMELY dense. I mean seriously....there is a limit to how dense a person can be, right??? But this anime develops the characters in such an amazing way so that they have a perfectly logical reason to be dense. For kuronoma, she is a girl who never had a friend before and doesn't know how to handle awkward or misunderstanding situations thus misreading Kazehaya feelings towards her. For Kazehaya, he is a super popular guy and many girls have already confessed to him, thus he unconsciously assumes that everyone, including kuronoma is the same, meaning normal (being alone without having any friends for 14 years is definitely NOT normal) and therefore misunderstands her words and actions. \\n\\n\r\nSorry for rattling on but anyway lets go into the marking rubrics =) \\n\r\nStory: 10/10\\n\r\nPersonally, i feel that the main reason some people mark down on this sector is because of there is hardly any progress at all in the relationship between the two. But, beauty is in the eye of the beholder and i find that the epic denseness of them both is actually the main factor keeping my eyes glued to the series. Believe me, restraining myself from yelling stupidly at the screen is no small feat. Sometimes you just feel that you want to go in there and slap some sense into them. And then you realised,,, Its just an anime show. Its. Not. Real. See what it had done to you? Not many other shoujo have the ability to this to you. Thats what make KnT so special.\\n\\n\r\nArt: 10/10\\n\r\nThe animation is quite remarkable. I really liked the parts where they show koronoma smiling. Some people may find it.... scary? But i think it requires great skill to be able to draw out something that inspires such emotions within you. Be it, scary or warmth. \\n\\n\r\nSound: 8/10\\n\r\nThe voice actors are kinda good.. i mean.. it must be tough.. to take on such a low, scary tone kuronoma is supposed to have. And i really really really like the ending song for this season =)  \\n\\n\r\nCharacter: 9/10\\n\r\nThe character development, (unlike the romance, thankfully) moves at a reasonably pleasant pace revealing several surprising and interesting details about each character. And each of them, be it in denseness or kindness have their own strengths and weaknesses whether they realised it or not. (most of the times they don't, which is what makes it so interesting)\\n\\n\r\nEnjoyment:10/10 \\n\r\nOverall: 10/10\\n\r\nI have talked enough about these areas in my starting commentary.. and frankly, i think its a miracle if you even read until this part.. And so this concludes the end of my first review =) \"phew\" *breathes air of relief* its hard work writing a review, and that shows how much i like this series. Give it a try, you might like it too... ;)\\n\\n",
            "date": "2011-03-12T05:23:00+00:00",
            "helpful_count": 40,
            "mal_id": 35032,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/275170.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wingar",
                "username": "wingar"
            },
            "url": "https://myanimelist.net/reviews.php?id=35032"
        },
        {
            "content": "\"Slow and steady wins the race\". Although there is huge criticism on the pacing of this story, the actual message and genre that this show follows is true to its values. Following the events of the first season, the second season does a great job picking up where it left off. The second season focuses more on romance but still being true to the SoL and Drama genres. Here are my reasons why I gave this anime a perfect score:\r\nStory 10/10:\r\nAlthough the story does drag on and you sometimes feel like what's the point on going on and on about the same issue that thecharacters are facing, you need to remember that the anime is an adaptation of the manga. Maybe the studio did try to drag it on for the purpose of allowing the manga to catch up, or maybe because they needed a couple of extra episodes to be able to do the 12 episodes that were allocated for this season, but every episode served its purpose on developing each character. There are certain times where I can agree with comments about how \"childish\", \"immature\" or \"slow\" the characters are, but you need to remind yourself that 1) Sawako has never had this type of human interaction before, 2) the pace of the anime is kind of realistic because personally in real life, some misunderstandings and issues don't get solved in a matter of days, even less, a 20 minute episode. This just reminds us that everything in life takes time, and once you are able to figure it out, the time spent going over it was worth it in the end.\\n\\n\r\nArt 10/10\\n\r\nThe anime's art is unique. Even though it was made in 2011, its art is and style is very different from contemporary anime. It kind of reminds of me Japanese styled paintings you see in scrolls. You even have glances of Van Gogh art-styled backgrounds, which gives it a nice touch in my opinion. The art also favors the anime and helps set the mood for the characters.\\n\\n\r\nSound 10/10\\n\r\nI really enjoyed the opening and ending themes of the anime. I usually skip them when I watch anime but I didn't do it for this one. The music is also slow tempo overall which give this \"slow\" effect to the anime, but as I mentioned before, stays true to the slow drama and slice of life that this anime deserves to be.\\n\\n\r\nCharacter 10/10\\n\r\nEach character gets their development. There are no lose ends in the story. All main characters are given some type of closure at the end which, although longing for a third season, makes this season have a truly worthy ending. Given that its a romance, slice of life and drama anime, the interactions between characters all have a purpose that develop and move the story further. The characters are true to themselves which made it easy for me to relate to them. If I miss this anime, I would say it would be because of the characters rather than the story.\\n\\n\r\nEnjoyment 10/10\\n\r\nThis anime is a roller coaster ride of emotions. It moves you, makes you disappointed, makes you cry, makes you smile, but overall, it made me happy - enough for me to write this review. \\n\\n\r\nOverall 10/10\\n\r\nIf you really have enough time, and really want to watch an anime true to its genre I recommend this anime for you. Even though as I said, I agree with some comments with the pacing of the story, but in the end, it was really worth my time watching. If you want to dwell into an anime with human emotions, relationships and touch, this is a great anime for you.\\n\\n\r\nI would like to thank everyone who took their time to read this review as it is my first review in MAL. Hope you enjoyed it and hope it was useful to you.",
            "date": "2015-05-29T22:10:00+00:00",
            "helpful_count": 30,
            "mal_id": 189143,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jorgechen1993",
                "username": "jorgechen1993"
            },
            "url": "https://myanimelist.net/reviews.php?id=189143"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nWhen it comes to most forms of media, sequels are a tricky business. Many people argue that the first iteration is the best due to nostalgia. Others argue that what comes after is able to build upon what came before so it is clearly better. For some shows, their sequels are phenomenal, such as Monogatari: Second Season or Chihayafuru Season Two. However, and sadly, when it comes to Kimi ni Todoke Season Two, they severely dropped the ball.\r\nSTORY\r\nKnT2 begins shortly after KnT1 left off, with our characters returning back to school for their sophomore year.\r\nInitially, I found thepacing of the show to be pretty much off. Part of the problem comes from the season only having 12 episodes to work with. When watching, each episode has about a one-month time skip when going from one to the next. Meaning, there is a great amount of back-story that is either ignored or at the minimum must be fantasized about in the viewers mind. Perhaps they felt that there was nothing to be told during these month-long spans, but it felt awkward that the characters would interact on one day and seemingly nothing happens between any of them for an entire month.\\n\\n\r\nBeyond the pacing, what I found incredibly frustrating was the level of misunderstanding that the show imposed. Kazehaya and Sawako experience some of the worst miscommunication between potential lovers I have ever seen (probably the only worst offender would be from School Days). Personally, I don't mind this trope in romance, as long as it isn't extremely prevalent. However, Sawako being unable to deal with her feelings and subsequently being unable to speak in crucial situations caused the plot to focus on her and Kazehaya's inability to talk with one another as opposed to focusing on their relationship.\\n\\n\r\nFurthermore, there were numerous times when certain events would be interrupted by side characters. This only compounded the frustration I had with the characters' interactions. It really doesn't help when progress is attempting to be made and it is constantly being thwarted by outside forces.\\n\\n\r\nANIMATION\\n\\n\r\nShort section, but Season Two maintains the quality it had from Season One. They still employ the \"rounder\" animation styling for comedic effect (and it still made me laugh when it was used). Again, many face shots and sparkles are to be had, so actual animation is kept to a minimum. But this doesn't deter from the overall pleasant look of the show.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhile many of the characters return once again for Season Two, I found their development this time to be severely lacking. This is mainly due in part to my ranting above; that is, the miscommunication doesn't generate growth in the characters. Rather, it halts it.\\n\\n\r\nThis season focuses more on Kazehaya and Sawako than anyone else, which I felt was a good move. However I think that the show should have attempted to do a better job on focusing on their relationship, much like Season One did between its characters. Instead, what it does is try to explore their feelings for one another, but due to the overall aloofness, it is poorly executed.\\n\\n\r\nSeason Two also introduces a new character, Kento, who acts as a catalyst in ruining Kazehaya's and Sawako's relationship while simultaneously making Sawako \"more popular\". I put \"more popular\" in quotes because this trait seemed to mirror what Kazehaya had already been doing. That is, he was the one that had given Sawako the confidence to enter into the social gatherings and be generally more open to those around her. Plus, he just adds further to the already massive amount of misunderstandings. Besides these traits, I didn't really much care for his character.\\n\\n\r\nLastly, I still feel that Kurumi's character, like Season One, was underutilized. She was greatly fleshed out and explored in Season One, dropped, then brought back briefly in the beginning and end of Season Two. But these small occurrences were some of the best parts of the show. At this point, I just think it was a poor decision on Production I.G.'s part to ignore her character throughout the second half of Season One and all of Season Two since she is arguably the most complex member of the cast.\\n\\n\r\nSOUND\\n\\n\r\nThis time around, I wasn't a big fan of both the OP and the ED. The OP gives a sense of urgency that doesn't really complement the show well. The ED, on the other hand, is very orchestral and leaves you feeling hopeful.\\n\r\nThe soundtrack is mostly the same with newer pieces added. These newer pieces were more \"uppity\" than those from Season One and did not really fit the show's themes and overall tone to my liking.\\n\\n\r\nThe voice acting is good once again, with Sawako, as always, doing a good job switching between her incredibly sweet side to her confused, nasal-y voice.\\n\\n\r\nENJOYMENT\\n\\n\r\nWhen going into Season Two, I was hoping that Kazehaya and Sawako's relationship would take off from where Season One ended. They set it up nicely to have them come together so the show could finally focus on a relationship that was based on true love. However, each episode only makes you more mad than the last due to how inept the characters are at handling the situations.\\n\\n\r\nTo be honest, I was quite disappointed. Season One was very good in its focus and overall narrative. But to me, the majority of the show was unappealing. Only the final two episodes were any good, and what happens in them should have been the focus for this season from the start.\\n\\n\r\nThe show still has the same sense of humor, so if you laughed a lot during Season One, you will do so here as well. The romance elements are here, but again they are not truly explored until the end but by that point it is already too late. I really wanted to enjoy this season as much as the first one, but I just couldn't get over how badly the characters responded to one another, the loss of focus on relationship building, and the constant misunderstandings.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the misunderstanding level is incredibly frustrating to watch\\n\\n\r\nAnimation: Good, about the same as Season One\\n\\n\r\nCharacters: Fine, new character is pretty bad and character exploration seems rather repetitive, but good returning cast regardless\\n\\n\r\nSound: Fine, OP and ED are no good, newer soundtrack pieces are okay\\n\\n\r\nEnjoyment: Fine, I love romance but it just didn't feel quite right\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-09-19T21:30:00+00:00",
            "helpful_count": 25,
            "mal_id": 161095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=161095"
        },
        {
            "content": "'Kimi ni Todoke', vaguely translating to '(Let My Feelings) Reach You', tells the story of a gloomy girl falling for a handsome classmate. We saw in the first season that the protagonist Sawako used to be so creepy that her nickname is \"Sadako\" (reference to the antagonist from the 'Ringu' trilogy). One day she meets Kazehaya, a refreshing prince-like guy who didn't seem to care about her appearance or reputation, and Sawako sets out to change her own introverted personality in order to be accepted by him and other classmates. Series title is far more appropriate for the second season, as Sawako and Kazehaya bothstruggle to get their feelings across.\\n\\n\r\nThe premise in 'KimiTodo' was eerily similar to 2005 hit TV dorama 'Nobuta. wo Produce'. The only difference was that the prince sets out to produce/makeover \"Nobuta\" in dorama, whereas Sawako produces herself with help of friends. The appearance of Kento in the second season effectively cements 'KimiTodo' as a knockoff by completing Shuuji + Akira love triangle with the protagonist. It is especially disturbing that all three characters having identical personalities, and even same roles as the dorama counterparts. Both protagonists had a gloomy personality and appearance that scares classmates, both have unique nicknames derived from their names (Nobuko - Nobuta (Wild Pig), Sawako - Sadako (Ringu Character)), and both characters slowly gained confidence in themselves and earned the acceptance of classmates by the end. Kazehaya plays the role of the prince as Shuuji did in dorama, both of them are popular, cheerful archetype princes who casually interacted with respective protagonists at first, but slowly realizes their feelings and eventually confess their love. Finally, we have Kento. Unlike Akira in 'Nobuta', he appeared half way, but both characters have that carefree gaudy playboy persona and falls for the protagonist after the prince, to complicate the situation. Both characters try to steal the girl, both eventually fail, but remain supportive in the end. In addition, protagonists in both series had a rival fighting for the prince, again with identical persona. The two major events in the second season: Valentine's Day and School Festival (with protagonist as centerpiece) also happens to be the major turnaround events in 'Nobuta'. It's impossible to deny by this point that 'KimiTodo' is essentially a knockoff of 'Nobuta'.\\n\\n\r\n'KimiTodo' depicts the development of unconditional friendship, joy of school life, difficulty of confession, and awkward and blushing first love. All of which staple themes of seishun (coming of age romance) genre, which begs the question: \"Why anime?\" I was puzzled at first, because live-action TV dorama offers far larger audience than that of anime, and as Japanese networks have been shifting from housewives to fangirls as main dorama targets in recent years, seishun has become the perfect dorama genre. So why does the author and producers decide to waste money drawing something they could've easily filmed live-action to reach fewer, less relevant audience for a seishun manga series? It became clear to me by the end of second season that there were two main reasons. First, it is apparent by the end of second season that 'KimiTodo' is a mediocre knockoff of 'Nobuta'... it would never be appreciated by the 'Nobuta' audience, thus cannot be aired in prime time. Second, pacing. While there are plenty of slow paced dorama around, 'KimiTodo' appears to drag on forever with endless shoujo monologues. This series would have been completely unwatchable without the chibi-forms used to constantly provide comedic relief.\\n\\n\r\nBackgrounds were done really well for this series with spray effect that left a dreamy impressionist feel to most scenes. This is certainly a nice change to the standard digital fill or gradient effect in most series airing now. Unfortunately, characters often appear to be deformed because there were too little detail for the realistic design of their faces. The chibi-forms were also less than impressive compared to most comedy series. My biggest concern was the prevalence of frozen frames where little if any movement was present on the screen. This further contributes to the slow pacing that makes 'KimiTodo' a difficult watch.\\n\\n\r\nBGM sounded appropriate for most scenes, but lacks variety, with same tracks being recycled over and over. Sawako's voice acting was very tiring to listen to because of constant high-pitched whispering. On the other hand, supporting cast's voice, especially Ayane, Chizuru, and Kento were very distinct and fitting. OP has nothing much to talk about, but the ED song was absolutely wonderful. 'Kimi ni Todoke...' by MAY'S has the same poignant feel of 2005 hit song 'Story' by Japanese R&B singer AI, that same emotional, all-out tone accompanied by amazingly touching lyric that was perfect for this series. It did not enjoy the level of commercial success as 'Story', but this song probably ranks in top 10 heart moving theme songs across all forms of Japanese media content I've come across.\\n\\n\r\n'KimiTodo' is incredibly unoriginal and cliché, but there were some dramatic buildups and touching moments. My biggest complaint with the first season was that Sawako faced too few obstacles and overcame those too easily. The second season does offer more conflicts. However, it was ultimately a bland series that played too safe, and had nothing particularly remarkable or memorable about. I would definitely recommend 'Nobuta. wo Produce' live action dorama if you're into this type of premise.",
            "date": "2011-04-05T06:30:00+00:00",
            "helpful_count": 22,
            "mal_id": 35704,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=35704"
        },
        {
            "content": "Honestly, I was already bored near the end of season 1 but, it was tolerable so it's okay. However, this season was the complete opposite, it was so frustrating from the beginning till the end.\r\nStory: 2/10\r\nI was frowning the whole time while watching this anime. It became very annoying, boring and super cliche. After everything that happened in season 1, you will think that something different or something interesting is going to happen in this season but, nothing really changed - not the characters, not their relationship or anything- nothing change at all - they just keep on doing the same things they did inseason 1: worry about petty things, misunderstandings and all.\\n\\n\r\nArt: 7/10\\n\r\nNothing much has change from how it was in season 1.\\n\\n\r\nSound: 5/10\\n\r\nI only listen to the opening and ending song once...they are not really that interesting.\\n\\n\r\nCharacters: 1/10\\n\r\nSawako's character is understandable and tolerable during the first season and I liked how she tried so hard to change herself and make her classmates change her impression of her and be friends with them. But that \"will\" was completely forgotten. She became so weak and easily manipulated - constantly worrying and crying for almost every little thing, so her friends always need to help her, in the end she's one of those characters who always need to depend on people.\\n\\n\r\nKazehaya: I had a little crush on him during the first season. He was handsome and interesting character - at first - but as the series goes on, he became boring.\\n\\n\r\nOverall: 2/10\\n\r\nI was utterly disappointed, it could've been better. The whole season ended up with nothing but same old things, same old petty problems over and over again.",
            "date": "2015-12-29T07:06:00+00:00",
            "helpful_count": 17,
            "mal_id": 207203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5063637.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Nunnally03",
                "username": "Nunnally03"
            },
            "url": "https://myanimelist.net/reviews.php?id=207203"
        },
        {
            "content": "A very brief review, Kimi Ni Todoke 2 will probably be a very entertaining anime for the ones who've watched the 1st season. Me personally, I didn't enjoy the 1st one very much so it was probable that I am not very happy with the 2nd season.\r\nStory: 7, the 2nd season obviously focuses more on Sawako's love life and her want to deliver her feelings to Kazehaya. Development is seen in characters just like in the 1st season and Sawako is much more easily been able to fit in with the class. In the 1st season, there was a dramatic development in friendship and inthe 2nd season Sawako continues to make friends but the bulk is about her love for Kazehaya.\\n\\n\r\nArt: 10, I feel like the art is better than the 1st season and as seen in the 1st season the art was already very good. The colors set the feeling of the anime and make it look beautiful.\\n\\n\r\nCharacter: 7, if I were to focus on Sawako, this is the reason why the 2nd season frustrates me very much. Sawako is ridiculously weak with conveying her feelings and feel like she's way too nervous and overthinking everything. She's too easily influenced by other outsiders and even if she has more courage this season its very frustrating to see how she deals things with Kazehaya. Kazehaya on the other hand can be seen very straightforward with his feelings for Sawako. \\n\\n\r\nOverall my enjoyment for this anime is 5 because its ridiculous how this anime frustrates me so much. There is a ridiculous amount of misunderstandings in this anime that can be solved by a simple clearing. If the characters were able to say like 1 more sentence or so, there would not be as many misunderstandings to this point of episodes. I personally think Sawako is so stupid to not see through all these misunderstandings and surprised of how blind she is.\\n",
            "date": "2011-02-24T00:30:00+00:00",
            "helpful_count": 14,
            "mal_id": 34706,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/363056.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Antagonizes",
                "username": "Antagonizes"
            },
            "url": "https://myanimelist.net/reviews.php?id=34706"
        },
        {
            "content": "I personally think that there shouldn't be a 2nd season to this series. A pity it turned out to be such a disappointment since I enjoyed the 1st season quite a lot. Meh...\r\nStory: 3\r\nContrary to the 1st season, the story was centered upon Sawako and Shouta TOO much: how they were too shy to confess to each other and how all those misunderstandings interfered to make things even more difficult without reason. It was annoying and it made me lose my patience. It's the kind of story that if it was not a sequel, I wouldn't watch it even if I was paid to doso.\\n\\n\r\nArt: 9\\n\r\nNothing to add here. It was of the same quality as season 1. Quite bright and refreshing.\\n\\n\r\nSound: 7\\n\r\nWell, OT and ET didn't amaze me, but they fit nicely with the story. Voice acting is nice too (Noto Mamiko is my favorite). They really know how to throw the punchlines. Generally, nothing was out of place.\\n\\n\r\nCharacter: 4\\n\r\nCharacters such as Ayane and Chizu were totally given no significance other than the role of the matchmakers. It was really a waste because they were really interesting and contributing a great deal with their humor and backstories as well. The new character, Kento, was just helping new misunderstandings to show up. Sawako and Shouta were useless on expressing their feelings. The only character I liked was Kurumi, at least she showed consistency and bravery at times.\\n\\n\r\nEnjoyment: 4\\n\r\nI just watched it to shoothe myself after a gore anime. And because I had to complete it - call it OCD or whatever.\\n\\n\r\nOverall: 4\\n\r\nIt really changed my opinion about sequels. Previously I thought that I should watch sequels in order to see what happens in the end, but they don't always add something to the story. I would be happy with just the first season, nothing really happened in the second worthy of watching...\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-10-19T23:56:00+00:00",
            "helpful_count": 13,
            "mal_id": 201626,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4936171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/yolerMit",
                "username": "yolerMit"
            },
            "url": "https://myanimelist.net/reviews.php?id=201626"
        },
        {
            "content": "Kimi ni Todoke 2 is a continuation of the 1st season with Sawako(aka Sadako) and her friends graduating to their second year of high school. To those who had loved/liked the 1st and rated it highly will find the 2nd season no different as the pacing, comedy and teenage romantic angst which made up the 1st, still present in KnT2.\r\nFor those who had rated it poorly, well there's not much I can say except not to have too high an expectation as not much has changed or will change(apart from the art). The misunderstandings which some had found to be irritating in the 1st season,have now doubled as the 2nd heavily focuses on the new found romantic feelings of an introverted girl who can't seem to open up regardless of how much help she gets from those around her.\\n\\n\r\nThen again, who watches a sequel of something they don't like?\\n\\n\r\nSo what makes this series worth watching? Closure. It's all about closure in Kimi ni Todoke 2nd Season. The open ending which viewers received in the last episode of season 1 finally feels like a chapter is over this season, which should give them a sense of relief that the doors for the KnT anime has finally closed. Whilst the manga is still ongoing, I believe where season 2 ends is enough for a happy and fulfilling ending without giving too much of a spoiler. You could say I'm a fan of happy endings and unfortunately while season 1 did end on a happy note, it still left us with a question or two unanswered.\\n\\n\r\nNow it usually takes me a while to get comfortable watching romantic shoujo series without cringing to some of the casts lovey-dovey behavior(and I'm still getting used to it), but with the help of my wife renting a fair few of them especially when she has her girlfriends over, I've started to appreciate the genre and hence why I've really gotten to like this series as a whole.\\n\\n\r\nOne major change as I mentioned earlier would have to be the art for KnT2, which I was very amazed with as it had only been a year since the 1st season had aired early 2010. Backgrounds seem to be finer in texture, and the shoujo-esque character designs from 1st season seemed to have been better detailed. Of course we're not talking dramatic changes here and for those who loved the 'chibi-type' characters well known in season 1 for its comedy routine can rest assure as it still influences a major part of KnT2.\\n\\n\r\nHaving just finished watching the 1st season for the second time(prior to writing this review), the sound for KnT2 took some time to get used to, but once I did I found it fitting to season 2's mood and pacing. The OP 'Sawakaze'(Refreshing Breeze in English) performed by J-pop artist Tomofumi Tanizawa felt so appropriate for the series and the ED which also shares the title 'Kimi ni Todoke' performed by MAY'S, is set in a slow ballad's tempo which really sets the mood for the overall series.\\n\\n\r\nIn KnT2, we see the full cast return from 1st season(with their matching voice actors) including Kurumi who I now see in a new light(although still bitchy as ever), and we also see a new character by the name of Kento Muira who plays catalyst for the would-be couple. The main cast are still the same as the last season with the female lead Sawako still introverted as ever(even more so this season) and the school she goes to still puts her love interest Kazehaya on a high pedestal(to a point that I'm starting to think some of the guys are gay for Shota). Well I guess that's one shoujo-esque trait I will never get used to.\\n\\n\r\nFor those who felt frustrated with the misunderstandings which played a major role of season 1, may not like where season 2 is heading as it now plays as the series core setting. There's enough hair-pulling tension to be seen in season 2 that it's enough to make one go bald. Well I guess that's teenage shoujo for you.\\n\\n\r\nSo in a nutshell:\\n\\n\r\nStory - 8\\n\r\nArt - 9\\n\r\nSound - 9\\n\r\nCharacter - 8\\n\r\nEnjoyment - 8\\n\r\nOverall - 8\\n\\n\r\nTHE GOOD - The Art, the Animation and Closure. Specially closure which is a really big plus for me with the whole Sawako x Kazehaya romance. What the first season had lacked, is now the main focus for the second. \\n\\n\r\nTHE BAD - The slow pacing and the embellished misunderstandings. It takes 3 episodes to get over 1 misunderstanding!! If you haven't seen season 1, then there will be some things you won't understand in KnT2 as the series does not serve as a standalone. Apart from Kurumi's special recap at the beginning of the series, not much is explained to the how's and when's that take place in season 2.\\n\\n\r\nIf you are a fan of the first, Kimi ni Todoke 2nd Season will be like icing on your cake. Of course if you haven't seen season 1, I strongly suggest watching it before even making the endeavor to start season 2(and who in their right mind starts something mid-ways anyways?)",
            "date": "2011-03-06T17:15:00+00:00",
            "helpful_count": 13,
            "mal_id": 34934,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scrypt",
                "username": "Scrypt"
            },
            "url": "https://myanimelist.net/reviews.php?id=34934"
        },
        {
            "content": "✵WARNING THIS REVIEW IS KINDA SPOILERISH SO READ AT YOUR OWN RISK✵\r\n✵YOU'VE BEEN WARNED✵\r\n   I can't express how much this second season let me down, I was really looking forward to it but all that it was, was the first season shortened and allot more boring. I swear, in every episode I was like ¨When is this gonna end?¨ and the anime was like ¨Never! I will haunt you forever!¨\r\n   Story 5: Why a 5? Because this season was almost like the 1st one, I don't even know why they called it a second season, they could happily shorten it abit and make it part of the 1st one. In the second season Kazehaya is still in love with Sawako -surprise- but doesn't know how to tell her his feelings for her, the same goes for Sawako that discovered in the end of the 1st season she ACTUALLY loved Kazehaya -no shit- but is too shy to go and tell him that. So that's why all the second season revolves about them trying but failing miserably to tell the other how they feel, there were actually three confessions; The first 2 being epic fails making them grow apart and feeling awkward and insecure around each other, and the third one-FINALLY- being successful which leads  them to start dating. But it's incredible because every little confusion and tear could have been avoided if Sawako wasn't that dumb for godamn sake, she herself starts overthinking evrey little word and expression that leads her to believe he can't stand her or he finds her annoying-even after all the time they spent together she actually believed that- or he likes someone else-wow! How unique! Didn't see that coming, did ya?. But the last thing is what I want to talk about next, because she didn't thought that up herself, she had actual help...OF A GUY!\\n\\n\r\n    Let's talk about this guy for a sec, his name is Kento Miura, and holy mother of god if he isn't hot. Kento -Ken for short- was a new classmate of Sawako, because as they passed to 2nd year all the classes were mixed -but surprise, surprise,Sawako stayed with all her friends, even Joe was there- so she ended up with him sitting next to her in class. Well, long story short, he came to like, in the romantic way, and that, of course, made Kazehaya jelous. And gee if that wasn't new, I mean, didn't something similar happened with Ryuu in the 1st season? Is like all the producers of the anime got together and said ¨Let's think of all the things that happened in season 1 change it a little and put it in season 2! I mean, kids this days are so stupid they won't even notice!¨Well, I noticed, I noticed!!\\n\\n\r\n   And now you are wondering what happened with that guy...Nothing. He just became a friend. That's it. After making Sawako believe the guy she loved liked someone else, he just said ¨Ha, YOLO¨and became her friend. NO! NO NO NO! I WANTED TO SEE SOME CHARACTER DEVELOPMENT! NOT SOME THING THEY DECIDED TO PUT IN THERE FOR THE SEASON TO BE LONGER! ARGH!\\n\r\nThis precious second season, that I was looking forward with all my heart, was just some giant, disappointing, ball of shit. Oh, but in the end everything turns out well, and Sawako and Kazehaya end together like a happy couple, but by the time you get there you already smashed your computer screen with a hammer 3 times.\\n\\n\r\n   So that's all I wanted to say, that if the producers intended for them to end happily ever after, they could just make 3 episodes, put it in the 1st season and VOILA, perfect ending, me smiling, and computer screen not crushed to a million pieces. Ahhh,feels good to take all of that out of my chest. Well's that's all, I guess.",
            "date": "2014-02-19T22:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 133215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3465169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/scarletgirl",
                "username": "scarletgirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=133215"
        },
        {
            "content": "Kimi ni todoke tells the story of a shy girl named Sawako. She falls for the most popular student Kazehaya school. The story then unfolds. \r\nSTORY: (5/10)\r\nThe first season was good,  because there were good  secondary characters   At first, the story was very cliché, but the first season had a good direction and a decent script. The romance in my view never caught my attention. And I confess that I found silly and naive.\r\nThe second season was poor compared to the first. A bad script and poor direction. I watched all the episodes and concluded that all are tiring and repetitive.There were episodes without any importance for the plot and for those who wanted a serious romance and developed characters was a big disappointment.\\n\\n\r\nART: (8/10)\\n\r\nIn relation to art and animation, Kimi ni Todoke was good. The design and animation is somewhat reminiscent Haikyuu !! Only after I find that belong to the same studio: Production IG. Generally this studio produces good animation , although don´t be a Kyoto Animation.\\n\\n\r\nSOUND: (7.5/10)\\n\r\nThe opening and ending of Kimi ni Todoke are good and matches the smoothness of the animation with light tones. The soundtrack is also good, although not quite match with certain exaggerated scenes especially in drama. Overall, the opening, the ending and the soundtracks are creative.\\n\\n\r\nCHARACTERS: (6/10)\\n\r\nAbout the characters: there are characters of all kinds. But the best characters were the supporting cast: Ayane, Ryuu and Chizuru. Of these, I liked most of Ayane, because she is quite mature and observant. It's a shame the script doesn´t value this character. Should at least focus more on Ayane than unsympathetic main characters. Ryuu and Chizuru form a beautiful couple, well explored in the first season. However, in the second season these two were little valued.\\n\\n\r\nOn the main couple: it´s really hard to like Sawako. All right, she's shy, but too forced this feature. I found the script selfish, since during the 12 episodes she little effort to mature (she could still be shy). In the end I found very superficial her relationship with Kazehaya. I did not like Kazehaya, but not hated. For me he was the character who suffered most. That's because Sawako is a weak and characterless character. And Kazehaya however like to Sawako, did not know her feelings\\n\\n\r\nAbout the \"antagonists\": I liked the Ume. Despite being popular, she is very lonely. I like her sincerity, well used in the first season. In the second, the character is half cleared and only appears at the end (last episode). I found cowardice by the script because she does not have much chance to explore the love that  had with Kazehaya.\\n\r\nI do not have much to talk about Kento. I found it odd how and why he was attracted by Sawako. It did not help much in the plot and as well as Ume, Kento was underexplored.\\n\\n\r\nAbout the girls who loved Kazehaya: I got tired of seeing girls falling in love with a popular boy. This is a feature that Shoujo animes are for attracting the female audience. The same thing happens in the shounen and ecchi, but with different fan service.\\n\\n\r\nENJOYMENT: (5.5/10)\\n\r\nFor me as entertainment it wasn´t good. For the general public maybe yes. Not much value the entertainment, but it´s necessary have a good script, a good direction, good characters and good stories. Kimi ni Todoke (first season) did not have a good entertainment, but there was a good script and good direction. The second season: no entertainment, no good script and direction.\\n\r\nAlso, I prefer animes nonstandard.\\n\\n\r\nIt´s hard to see an anime shoujo nonstandard, different and interesting as Akatsuki no Yona, Akagami, Nana and interesting Joseis as Chihayafuru and Sakamichi no Appolon.\\n\\n\r\nOVERALL: (5/10)\\n\r\nOverall, Kimi ni Todoke 2 isn´t a good anime. I would not recommend, what saves is the first season. The script is super repetitive and tiring added to a bad direction. The animation and the supporting characters are good, but can not be quite strong enough to overcome negatives.",
            "date": "2016-03-09T11:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 212562,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4578004.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Anriee",
                "username": "Anriee"
            },
            "url": "https://myanimelist.net/reviews.php?id=212562"
        },
        {
            "content": "This is the continuation from the first season of Kimi ni Todoke and as slow paced as ever! This hadn't been much of a bother in the first season, but had became an annoyance. Every time I finished an episode i wanted to break my face in with my keyboard.\r\nI had originally loved the ending of the first season and expected just as much. I wanted to feel that happiness for them and the satisfaction I need... Was I asking to much? Of course the ending was great, but it didn't even feel like an ending. This was only confirmed by checking the manga, afterlearning that the series had stopped at Chapter 46. \\n\r\nThe manga itself is still on going. This leaves the question, will they will continue to adapt it?\\n\\n\r\nStory 8: The story leaves straight off from the first season. Both Sawako and Kazehaya relationship was starting to deepen and problems were creeping in. \\n\r\nLoving one another from far away wasn't just enough anymore. Feelings of one-sided affection was now a problem. \\n\r\nAs slow as ever, it seemed to drag on for to long and was very aggravating. All the avoidance and sadness took far to much of this season. The happiness and hope had seemed long gone and was starting to turn into a show I didn't like. Hopefully, Kimi ni Todoke saved itself.\\n\\n\r\nArt 7: I dont think i every seen such a bipolar change in art. At times the show amazed me in awe of how beautiful the characters were (especially Sawako's smiles). It has an almost light and soft art style that is enjoyable.\\n\r\nThe shear amount of chibi in each episode makes me sometimes wonder, what was the need of that? I'd say it ruined the beauty it had going for it. \\n\\n\r\ncharacters 8 : Let' start with Sawako, a very fulfilling character. She started off as a awkward shy girl with almost no emotions in the first season...Due to her friends she now know what it is to feel happy and how to talk to others.  Her dense head can make her quite hilarious to, but can make trouble. Sawako's character almost shines with innocence.\\n\r\nMaking her one of my favorite characters.\\n\\n\r\nKazehaya: A popular and kind boy, but at times is selfish and rash. You won't notice it though. Kazehaya is very social to cover up what his insecurities are. Other than that he is a great guy that treat everyone equal.\\n\\n\r\nEnjoyment 6: All I can say is the middle of the season almost made me stop watching and break the tv screen... It will get better. \\n\\n\r\nOverall, the 2nd season ended well and cleaned up all the hate I felt for it, but I cant help to think of how much better the first season was. Kimi ni Todoke is in fact one of the better shoujo's out their. Give it a try and you might be surprised.",
            "date": "2013-05-02T02:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 95661,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1669675.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xDiablo",
                "username": "xDiablo"
            },
            "url": "https://myanimelist.net/reviews.php?id=95661"
        }
    ],
    [
        {
            "content": "** REVIEW CONTAINS SOME SPOILERS **\r\nOh man oh man oh man, what a roller coaster of emotions.\r\nI usually never write reviews and this is my first time writing one so, I'm writing this review for both season 1 and season 2.\r\nIf you're looking for romance, adorably cute characters, interesting story and amazing artwork, look no further!\r\nStory: 10/10 - The story is somewhat slow but progressive and enjoyable.\r\nArt: 10/10 - Realistic character drawing and amazing scenery, I fell in love with the artwork from the very first episode.\r\nSound: 10/10 - From the opening to the ending, from the songs to the scenery sounds, It really setsyour mood.\\n\\n\r\nCharacters: 9/10 - The main characters (Sawako and Kazehaya) are adorably cute! The moment they start looking and talking to each other it really gives you cute vibes despite how SOMETIMES they main characters can be dense.\\n\\n\r\nEnjoyment: 10/10 - Romance, Slice of Life, Drama, School and Comedy. What else could you ask for?\\n\\n\r\nOverall: 10/10 - Absolutely a 10/10. Kimi ni Todoke season 1 and season 2 easily strikes all of the categories I mentioned above EASILY. Everything from the romance aspect to the amazing artwork, I enjoyed every single second watching both seasons and it makes me want a continuation of this anime despite sawako and kazehaya ending up together. I definitely see some room for a season 3 judging from the manga.\\n\\n\r\nI highly recommend this anime. (If you're patient tho!)\\n\\n",
            "date": "2019-02-07T01:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 301067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7307450.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Simaris",
                "username": "Simaris"
            },
            "url": "https://myanimelist.net/reviews.php?id=301067"
        },
        {
            "content": "Now I watched this right after watching the first season and it continues right off. I feel like a lot of the things that make the second season great are the same or similar to those that make the first season great. By this I mean the main character Sawako and the art. \r\nThe thing this season adds is a whole lot of frustration! After watching the show on crunchyroll, I scrolled down several times to see the comments and majority of people seem to have simultaneously punch holes in their laptop screens. I mean it was really entertaining and it keeps you waiting tofinish the season but man does it get frustrating at times.\\n\\n\r\nI already reviews the first season and since majority of the style and character elements that make the show so good are the same I won't copy and paste my original thoughts. I'll try to just explain what's new.\\n\\n\r\nIt really is just a continuation of the first season, they go into second year and take on some events that may have been missing from the fist season in terms of classical high school drama \"events\" (ie: that whole cultural club thing where everyone usually does maid cafes..) thats pretty fun, and I'd say in this instead of focusing as much with Sawako developing her skills, its more about her relationship with Shota. There some drama, a few other characters get involved and it gets really interesting.\\n\\n\r\nAt some points you want to cry and some points you want to throw your keyboard through the wall. It takes a really good anime to get you to go through all these emotions and I think that's what I really like about this series.",
            "date": "2019-01-05T02:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 298109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2828511.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Taylor5wift",
                "username": "Taylor5wift"
            },
            "url": "https://myanimelist.net/reviews.php?id=298109"
        },
        {
            "content": "Just as a warning, this review will probably contain spoilers... So, it's probably best not to read this unless you've finished the whole anime. I'll try my best not to say any spoilers, but i'm not that great at that. This review will also be on the anime as a whole. \r\nStory - 10\r\nAs much as this anime may just look like your typical school romance, it is not. Welcome to the life of Kuronuma Sawako, a misunderstood, timid girl. What I love about this anime is how pure it is. The love between the two main characters is innocent and real, something you donot find in many other animes. In this anime, we follow Sawako through her first and second years of high school. We come upon all of those typical school situations, from making new friends to the gossip and rumors. The first season of Kimi ni Todoke is pure bliss. Everything is just getting started out. Sawako slowly becomes more open and sociable with her classmates due to the courage she gets from nobody other than Kazehaya. Upon developing friendships, Sawako experiences many new feelings and things. The feeling of being cared for, the feeling of having a friend. Her first cellphone, her first sleepover. You will find yourself smiling through it all. The ending of season 1 seemed perfect, did it not? Prepare yourself for season 2. Anger, saddness, frustration... prepare to experience it all. Well, that's what I experienced, at least. The first half or so of the season is a peek into how, really, everything is not so perfect. Fading away from friends, misunderstandings, and those characters you will find yourself absolutely hating. Followed by this though, is the ending. I was very pleased with it... I loved Kimi ni Todoke. The story was simple, yet amazing. \\n\\n\r\nArt - 9\\n\\n\r\nI personally, really liked the art. The style seemed unique, in a way. The openings of the anime really expressed it. The art somehow seemed calming, which fits the anime very well. The characters were well-made, and detailed. It's hard not to be pleased with the art.  \\n\\n\r\nSound - 8\\n\\n\r\nI didn't pay a lot of attention to the sound, I admit. The plot was really all on my mind. Now that I think about it though, the sound wasn't too bad. The openings of both seasons were great, and I enjoyed the background music that played at times in the anime. \\n\\n\r\nCharacters - 10\\n\\n\r\nBoth the unique and the overused characters come into play in this anime. The class clown, the gossips, the popular guy, the outcasts... You can't help but fall in love with the characters. Some you may start out hating, (Kurumi) but in the end, you won't feel any, or as much, hate towards those characters as before. Everyone has a part in this anime, and without them, the anime just wouldn't be the same. Now... Sawako. The main character of the anime. She's ignorant, she's dense... but you can't help but love her. Everything she says, everything she does, is full of good intentions. She may misunderstand things incredibly easily, (causing a portion of the problems in the anime) but she is such a lovable character. I normally do not like the ignorant characters in animes, but instead, hate them; Sawako is an exception. How can you not love her? Now, to Kazehaya. The perfect and popular boy. He's one of those guys, that if you ever have anime crushes, you'll definitely fall for. He's sweet, he's kind, he's the absolute perfect guy. Don't worry, i'm not done yet (I could never forgot Ayane, Chizuru, and Ryuu). Ayane is the mother of this group of friends... putting makeup on Sawako, comforting Chizuru, and somehow she seems to understand everything. Chizuru is a crybaby. A complete crybaby. She's just about as ignorant as Sawako... but despite all of this, I think you'll come to love her too.. Or maybe you already do, if you've already watched this anime! Ryuu is quiet, yet such a loving guy. Everyone has their part. Great characters.\\n\\n\r\nEnjoyment - 10\\n\\n\r\nI definitely enjoyed this anime. I experienced every emotion while watching it, and was both laughing and crying through it. I admit that there were some moments where I just got so mad at some of the characters, but that's one thing that makes an anime great, right? Feeling for the characters? I definitely felt for them. If you like school or slice of life animes, I can almost guarntee you'll love this anime. \\n\\n\r\nOverall - 10\\n\\n\r\nOverall, this anime was superb. The characters were great, the story was great, the art was great... and I definitely enjoyed it. I absolutely recommend this anime. Through this anime, you learn to appreciate what you have, and find yourself thinking about Sawako even outside of watching it... I definitely appreciate my friends much more after it. Seeing life through Sawako's eyes definitely does something to you. Maybe i'm rating everything a bit too high, who knows. I really loved this anime though, and am sure anybody else watching it would enjoy it too.",
            "date": "2012-11-25T11:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 78387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1507631.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Unfulfilled",
                "username": "Unfulfilled"
            },
            "url": "https://myanimelist.net/reviews.php?id=78387"
        },
        {
            "content": "This continuation of Kimi ni Todoke does exactly what I wanted the first season to do. It develops the characters, it makes choices, and dares to progress the story further.\r\nBecause the foundation has been set by the first season, the story has a decent pacing, and dares to venture further than most romance anime do. This makes it  a very satisfying experience, to the contrary of the first season.\r\nThe art also seemed to have improved, but maybe that was just my imagination because I was enjoying the anime more. Not to mention this anime has one of my favourite openings ever.\r\nOverall I would saywatching the first season to reach this will give you a heartfelt romantic story which can be enjoyed by a lot of people.",
            "date": "2017-04-02T12:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 244390,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4819065.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Seidai",
                "username": "Seidai"
            },
            "url": "https://myanimelist.net/reviews.php?id=244390"
        },
        {
            "content": "I was a little doubtful about what they were going to do to the second series, but here is my opinion.\r\nStory: \r\nTo be honest it’s a very normal shojo. Boy meets girl and they fall in love. I would like to say there is also a hint of amazing, because the girl is scary looking. Buuutt that’s been done. So for a shojo it’s not a bad story line because it gets you totally hooked. They didn’t waver from the first season either and kept it for the original watchers.\r\nSo it gets a 9.\r\nArt:\r\nBrilliant! Kimi ni todoke has got to be my favourite style ofart because it’s refreshing.\\n\r\nAll the characters could and probably do resemble the normal looking people. The art work has the ideal sort of proportioning and is nice to the eye.\\n\\n\r\nScore: 10\\n\\n\r\nSound:\\n\r\nAll characters kept to the original voice actors making it over all very enjoyable experience. None of the voice actors were unfitting to their characters, if they needed to be loud they were. If they were quiet they were. On to the music it always got me when they had that music whenever they're together and it tugged on my heart sting bad.\\n\\n\r\nGaining: 10\\n\\n\r\nCharacters:\\n\r\nNew characters fitted in nicely to the new season and were definitely not unnecessary and bought a nice twist into the series. All old characters that we might have not seen as much were introduced more. Even the mains gained new backgrounds we didn’t know about which was cool.\\n\\n\r\nGaining: 10\\n\\n\r\nReally I enjoyed this. The second series wasn’t a letdown and definitely wasn’t a waste of time and it made me feel the love I felt for the first series. They didn’t make it cheesy or pointless as I thought they might and I was hooked from episode 1.\\n\\n\r\nIf you enjoyed the first series this is a must see.\\n\r\nOverall: 10\\n",
            "date": "2011-04-07T11:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 35780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/297941.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mousehime",
                "username": "Mousehime"
            },
            "url": "https://myanimelist.net/reviews.php?id=35780"
        },
        {
            "content": "The danger in producing a season two in anything is you run the chance of ruining some of the magic in the first season. Season 2 of Kimi ni Todoke continues with its slow, walk-in-the-park pace that many find so charming and refreshing when the anime first aired, but that’s also where season 2 starts to irk people, it feels like the plot is going nowhere. The first six episodes or so have many moments where you just feel like tearing off the fourth wall and bring the two protagonists together yourself, but on hindsight I feel that that frustration was natural and necessary. Thepeople in the anime are realistic, if not downright relatable; that’s what I like about this anime - Sawako and Kazehaya won’t just suddenly become a lovey-dopey couple, even Kazehaya will have his moments of doubt in their relationship.  All the silly misunderstandings and frustration mounts up to this realization and development so profound and genuine that I promise will be worth twelve episodes of your time.\\n\\n\r\nAs for characters, Kurumi came back to make her mark as one of my favorite characters in the show. That confrontation-like scene with Sawako in the last episode explains it all. Kurumi is not a sore loser, and the mutual respect she and Sawako held for each other as a ‘rival’ is something quite admirable, and such a refreshing change from all the catty, backstabbing rivalry you usually get from the female population. She already stood out as an unexpected villainess in season one when she cried about her insecurities in front of Sawako, again it is that sense of Kurumi being a ‘real’ person with her own thoughts that make this series so realistic. And bonus points to her for spicing Sawako up to being more honest and direct with her feelings (and for giving Kento that much-deserved slap!).  \\n\\n\r\nThe new character Kento, besides drawing out the jealousy in Kazehaya and providing a few comedic scenes initially, I really don’t understand the point in having. His personality seems inconsistent and unclear, and his behavior sometimes just downright irritating, considering he is one of the main causes for the six tedious episodes of miscommunication and doubts we have to endure. Here is perhaps where the magic of Kimi ni Todoke fails to deliver; however if you go on to read the manga you will find he has more to give in later chapters, and may perhaps be a little more forgiving over this cardboard, annoying character that somehow make his way into the wonderful world of Kimi ni Todoke. \\n\\n\r\nAnd some praise must be thrown in for Pin as an adult character that fools around but always throw the right amount of words of wisdom about life and youth onto his clueless students. I think he speaks for all of us when he says ‘All this mopping around (between Sawako and Kazehaya) is getting old’ Amen. \\n\\n\r\nNow for the music and animation. I don’t think anything can ever compare to Tanizawa Tomofumi’s Kimi ni Todoke from the first season, which sets the tone perfectly to this aesthetic piece of art, though his opening song for this season has captured the same essence. The ending song is also very enjoyable, conveniently named Kimi ni Todoke as well. And as some of the other reviewers have pointed out, I do find season 2 to have a greater tendency to incline to chibi scenes more often than before. Whether it is to cut cost, or they think it is what the demographic wants; well, it’s not, it makes serious scenes unsatisfying and left viewers puzzling over the mood we should be feeling sometimes. But overall the art style was still very like the previous season – simple and pure like the storyline itself.\\n\\n\r\nIf there’s one theme in Kimi ni Todoke, I’ll say it is, not love (though it’s a huge part of the anime and what makes me all cheesy and warm inside), but communication. It’s in the title, ‘Reaching You’, getting the feelings across; and boy, was that so much harder than we thought. And is it worth it? The answer to that will determine the extent you will enjoy the second season of Kimi ni Todoke.  I personally enjoyed it, even through all the frustrations of the episodes midway, as it points out all the more obviously how many opportunities are lost or moments missed when we didn’t channel properly what we think. Kimi ni Todoke is not a fast-paced love-love story, treat it like a cup of freshly brewed coffee on a Sunday morning, sit back and take time to savor it.\\n",
            "date": "2012-03-12T17:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 55861,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MinamiKaze",
                "username": "MinamiKaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=55861"
        },
        {
            "content": "Just some quick advice with this second series, don't start watching it too late. \r\nIt's a wonderful series and develops their relationship and reveals more of the other characters stories. I absolutely love the Princess Kaguya style of artwork which sort of slips in sometimes, the animation I think is rather beautiful.  \r\nI give the above waning only because the development in this second series is much slower! It is still enjoyable because it just reveals how awkward communication can be especially at their age and it's different that things aren't rushed and each moment is complete before moving onto the next. \r\nI recommendwatching this if you loved the first series but the speed of the episodes can make for frustrating late night watching as it does keep you hooked.",
            "date": "2017-01-22T02:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 238829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5152651.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hanna93",
                "username": "hanna93"
            },
            "url": "https://myanimelist.net/reviews.php?id=238829"
        },
        {
            "content": "I actually rewatched the 1st season before starting with the 2nd as I enjoyed the first so much and I can say with confidence the second season of Kimi ni Todoke does not disappoint.\r\nThis anime is a slooow paced romantic comedy that may sometimes drive you off the wall waiting for something to happen only to be hooked in to watching the following episode EVERY TIME.  I actually only had 3 hours sleep before going to work today because I just couldnt let it go.  Now I feel like a zombie sitting at my desk, and thats why Im writing this review insteadof doing any work..\\n\\n\r\nThe IMPORTANT stuff:\\n\\n\r\nThis 2nd season kicks off right where the first season left us hanging and continues to impress where a similar time-span style is used, that is a day-to-next-day -> situation develops and is resolved or whatever in a few days that spans 3-4 eps.  \\n\\n\r\nThis second season has a really strong ending and leaves no loose ends like many others do, where there are still stuff to be taken care of Kimi ni Todoke took care of it. Im truly satisfied with how the story developed and finished. \\n\\n\r\nFor me, including the timespan, one of this anime's signiture attributes is that when you take away the \"Sadako the scary ghost\" part out of it, it leaves you with a cliche romcom base, BUT!! It is executed so perfectly that it actually sets the standard for future animes of this genre - if that makes any sense at all, Im sure you get what Im saying haha.\\n\\n\r\nWhy not a 10?\\n\r\nUnfortunately the above mentioned is also why I couldnt give it a 10.  There is just that little originality missing from the romcom scenes that is like I said perfectly executed but not something new and unexpected.\\n\\n\r\nIm not sure if there rEalLy is someone out there I need to be telling this but Ill do it anaway: IF YOU LIKE THE FIRST SEASON YOUR GONNA LOVE THE SECOND! -- And for you ppls unfortune enough not to have seen it at all, if you love romcom animes this is one of the best youll see!  Just watch the 1st season first, MKAY!",
            "date": "2013-03-25T01:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 90817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1136995.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xedroz07",
                "username": "Xedroz07"
            },
            "url": "https://myanimelist.net/reviews.php?id=90817"
        },
        {
            "content": "(Spoiler free)\r\nSUMMARY\r\nKimi ni Todake 2nd Season, is a disappointing conclusion to Sawako’s story. It’s by no means terrible but manages to undo a lot of Sawako’s character progression from the end of the first season, and reduces the time given to the interactions of her lovable friends Ayane and Chizou, as well as reduces love interest Shouta Kazehuya to a bumbling idiot for the majority of the season.\r\nAn introduction of more character conflict works in some areas but fails in others – without really making clear what motivations are. Ultimately this short season finishes on a positive note – but it was not a captivatingride to get there.\\n\\n\r\nIf you are reading this, and considering going through both Season 1 and 2 -  I would warn that the first season is “good” but the second season is disappointing.\\n\\n\r\nOVERVIEW\\n\r\nSawako Kunomura, a shy and awkward girl begins a new year of school with her friends Ayane Yona and Chizou Yoshida. After developing a stronger social circle in the last season, she moves on to dealing with more drama and a romantic interest in Shouta Kazehuya – not helped with a new male student in her class taking an interest in her as well.\\n\\n\r\nREVIEW\\n\r\nThe last season left Sawako coming out of her shell and finally being able to embrace the social circle of her classmates, friends (Ayane & Chizou) and love interest Shouta Kazehuya. You’ll start watching this season thinking things will develop further from where things were left off – however the first 6 episodes are infuriating. This ends up having Sawako taking a completely backwards direction from all of her personal development from the last season. Similarly Shouta Kazehuya’s warm and confident self is reduced to a clichéd bumbling idiot.\\n\\n\r\nIrritatingly there isn’t any real explanation given, as to why the leads behaviours have changed. Yes, there clearly is an attraction between the two – which was evident in the last season, but now it has undone most of the good prior development. The tediousness of the first 6 episodes can be alleviated by making it to the last half of the season, which are a lot more focused.\\n\\n\r\nA raft of misunderstandings between Sawako and other characters continue to pile up, and are not clarified promptly – in stark contrast to how well they were handled in the first season.\\n\\n\r\nSawako’s friends Ayane and Chizou, undoubtedly the stars of the first season, have reduced screen time which is a shame. Instead Sawako’s internal monologues and worries are allowed to take over the viewer’s attention. Ayane is reduced to a McGuffin – who’s only present at key plot points to help Sawako along with inspiring words of wisdom. This is a big disappointment compared to her appearances in the first season, which were based around her actually being a friend to Sawako and not just someone to drive the story forward.\\n\\n\r\nChizou’s character had the potential for more development, especially with regards to a romantic interest – but this was left unaddressed for the most part. At the end of the series, I actually began to realise that I wondered what happened to her, instead of Sawako and Shouta. I guess, it’s a telling point when you are more invested in the supporting characters instead of the main leads.\\n\\n\r\nThe animation style is virtually unchanged from the first season, and the switching between ultra-cute and a more grounded art style is still jarring.\\n\\n\r\nOverall, this is a disappointing conclusion to the series. Having known how this would end, I would have skipped watching all the seasons at all.",
            "date": "2017-05-02T12:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 246830,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nuanimal",
                "username": "nuanimal"
            },
            "url": "https://myanimelist.net/reviews.php?id=246830"
        },
        {
            "content": "Y'all, I watched this during work because I was so into it. Don't tell my boss.\r\nAlright, so I'm gonna harp on why this romance is such a good one for anime. It's realistic. Well, as realistic as a fictional romance can be. I like that it's messy and sad and confusing and painful. I like that it's surprising and mundane. I just like it. \r\nThis anime gets a lot of things right-- a lot of cliches right. For example, the very premise of this anime is overdone, right? Popular boy meets shy girl? And yet, somehow, this anime takes that premise and turns it intosomething special. I think the main thing that makes this series so lovable is its characters. The way they relate to each other, support each other, hurt each other, listen to each other... I mean, the list goes on. In other words, they're all extremely well written. They've all got flaws and unique personalities. They're all interesting to watch, and I want to see more of all of them all the time. \\n\\n\r\nOf course, the characters are the only thing this anime has going for it, though they is probably one of the better things. As I've explained above, the story in this anime is really amazing. I think taking something as boring as adolescence and turning it into something inspirational and touching is something I don't get from a lot of slice of life anime. It showcases life in the best way. I do think, at times, the humorous segments are a bit misplaced and end up taking the viewer out of the moment, but all in all, it's very well paced and considered.\\n\\n\r\nListen, I have nothing but praise for this anime, and you should probably take the time to watch it if you're looking for a solid romance anime. It isn't all about that, either. You're going to get a genuinely good story with every character, not just the main two. That's what makes it great. This season 100% made me want to read the manga. So... I'm gonna go do that. The end.",
            "date": "2019-03-25T12:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 304290,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=304290"
        },
        {
            "content": "The story should have picked up from ep. 9. \r\nThe first 7 episodes (the first 4 of which were so frustrating I was about to scream) are forgettable, typical shoujo drama. \r\nIt was disappointing to see Sawako regress in character development until ep. 8, first enjoyable episode after 2hrs and a half of torture. Too much crying, too much silence and unspoken words.\r\nIf there's something redeeming about the anime it's the supporting characters, which delivered a much-needed comedy relief, as well as more credible personalities.\r\nThe first series was refreshing and pure (which I rated 9, near perfect), the second had a slow pace, no progression.\r\nAtleast the ending was enjoyable, and a fair conclusion to the anime. \\n\\n\r\nEp. 1-7: Dreadful\\n\r\nEp. 8-12: Fair",
            "date": "2016-11-27T16:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 234505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3620841.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Artatsuki",
                "username": "Artatsuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=234505"
        },
        {
            "content": "I am going off the memory of watching this years ago, and I don't have the disc release. As such I don't remember minute details, but rather the overall story.\r\nThere may be spoilers.\r\nThe opener was stronger in season 1, but maybe instead of the excitement of new experiences of season 1, they were going for a more \"let's keep it mellow and watch our friends\" vibe. And unfortunately I seem to recall that Sawako was put into a sort of spectator mode this season because (a) New Guy and (b) we want to get Ryu and Chizuru paired up. I seem to remember thinking theending in season 2, another love song, was stronger than the cloyingly sweet (as in too sweet) song from season 1... but not something I'd go out of my way to buy and listen to.\\n\\n\r\nWhen last we saw our band of teenagers...\\n\r\n- Sawako and Shouta each realize they're attracted to one another, but don't communicate that\\n\r\n- Chizu and Ryu, having made up after the fuss involving Ryu's brother, are nevertheless awkward around one another\\n\r\n- Ayane was fending off Boy Extra #1's advances\\n\r\n- Pin, well, was his usual arrogant self\\n\\n\r\nPlot-wise, the anime follows the manga... sort of. The anime almost did here what torpedoed the first anime adaptation of Rozen Maiden (plot conflicted with the manga), but as it happens, the same things happen in the manga but in different order.\\n\\n\r\n... With one exception: they ALMOST followed the second Ryu/Chizuru arc... but ended differently than the manga, which was a bit of a disappointment.\\n\\n\r\nI got the impression from the manga (and thus the anime) that the original artist wasn't 100% sure what to do with Ayane. At first she was almost depicted as a very, ah, \"experienced\" girl (and a salacious rumor was spread about her), and easily being the most mature-acting character made her a key character in the season 1 conflict between Ryu and Chizuru. Her own breakup showed us that there's something missing about her, possibly a past trauma she's repressed, that led her to begin and end romantic relationships almost as easily as hailing a taxi.\\n\\n\r\nEnter the bane of many a sequel: The New Guy, or in this show's case, Kent. I think the main problem I had with him is that he's kinda like the boy version of Ayane, and not much more-- he seemed to me exactly as shallow as he initially seemed. I mean, it's fine to come up with The New Guy so that Ayane is also paired up with someone other than Pin, but it just didn't feel organic in the manga or the anime-- I didn't see much chemistry here, possibly because we don't really get to see what's in Ayane's thoughts nearly as much as we do Sawako's. That, and she had better chemistry with Pin, even if it was a false tsundere.\\n\\n\r\nOf course, my memories could be way off (I don't remember much in the way of comedy, I'm sorry to say), which means I should probably find some way to re-watch the show.\\n\\n\r\nAs I recall, the manga continued with enough chapters for at least a 3rd season, but unfortunately this is it for the KimiTodo anime. There's also a live-action film, but that's like starting over and watching the show in fast-forward, which wreaks havoc with the plot pacing. It's a bit of a shame, but also an opportunity to seek out the manga and finish the story that way.",
            "date": "2018-07-17T20:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 284210,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2367307.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/earl_of_sandvich",
                "username": "earl_of_sandvich"
            },
            "url": "https://myanimelist.net/reviews.php?id=284210"
        },
        {
            "content": "I loved the first season, but the majority of this one is just damn unbearable. \r\nYou can disagree if you want, but the naivety and childishness of the two characters this \"second season\" (really just an unnecessary extension ruining the ending of the first season) ruins this anime for anyone who is actually mature, and lacks saintly patience to ignorance and naivety.  It is not cute, it is just fing annoying.\r\nHow oblivious can two people be?  If you want to see that scene played out over, and over, and over, and over, and over again—you will LOVE this show!  I can onlyclaim frustration for how soft they were to a girl so incredibly lacking any confidence.  The pain she felt was self-inflicted, and in conjunction with the naivety and annoying personality of the one she likes.  Maybe I am not debilitatingly introvert enough to get this, but even my fiancee was extremely shy, and incredibly hard to read, but being a man, I could at least let my feelings be known to her (and I could have in high school too!).  Kazehaya is just as bad as she is.  He can't just come out and say exactly what he thinks or wants to say, and gives these ridiculous statements that are simply too easy to misinterpret with two such naive and stupid main characters. \\n\\n\r\nThis horrendous continuation of a great previous season really just served as a frustration-inducing waste of time.  There was so much potential squandered by pointless pandering to naive interactions that serve as nothing but filler, in what otherwise could have been summarized in simply a few OVA episodes or less.",
            "date": "2016-10-01T15:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 230819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5224341.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blaice",
                "username": "blaice"
            },
            "url": "https://myanimelist.net/reviews.php?id=230819"
        },
        {
            "content": "Okay, so after months of waffling in and out of this show, I finally completed the entire thing. And this is what I have to say:\r\nIt was good. Overall, I think I enjoyed the first season better than the second, though, since by the second season I found myself getting annoyed with the characters and wishing that the main characters Sawako and Kazehaya would just give it up and confess their love already. For an already relatively slow-moving series, this became frustrating now and again. That said, the inevitable but adorable and mostly satisfying ending brought my score up for this season.\r\nKimi ni Todoke isa fairly typical high school romance anime. Nothing all that special about the characters or the art style, and at the same time a sort of light-hearted sweetness that always brings you back for more. Sure, sometimes you stare at the screen and wonder how a character could possibly be so stupid and there are plenty of coincidences and overly dramatic misunderstandings for the sake of drawing out the plot, but isn't that what makes it fun in the end? Honestly, even though I was gritting my teeth in annoyance at times, I could never find it in my heart to stay angry at Sawako for too long. Her shyness often became the culprit behind many misunderstandings in the show, but I would be lying if I said I couldn't relate to that. Unlike in some Shoujo anime, the guy Kazehaya isn't rude or over-confident. While he is the popular guy, he has the title not just because of his looks, but because he is genuinely kind and warm-hearted as a person, which I can appreciate. Sawako's friends are loving and supportive, and even most of the characters who initially come of as antagonists have some redeemable qualities. So although I wouldn't say I put any of the characters in my top ten list, I didn't outright dislike anyone.\\n\\n\r\nOverall, it was a sweet story and I recommend it to romance fans who like a fluffy, slow-paced good time. Not bad at all.",
            "date": "2016-09-30T17:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 230718,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/snowflower234",
                "username": "snowflower234"
            },
            "url": "https://myanimelist.net/reviews.php?id=230718"
        },
        {
            "content": "I loved season 1 of this anime and ultimately at the end of season 2, I found myself a little disappointed by how it all went. I'll try to tie everything in with my season 1 review because I believe that the ending of the anime actually in many ways affects everything that comes before.\r\nIn many ways the end 2 episodes were the best 2 episodes in season 2. Why? Because it actually progressed the story and let us see a bit of the reward of all that promise and struggle through the earlier 35 episodes.\r\nHaving said that, as others have pointed out, the first7 episodes were so frustrating I wanted to gouge my eyes out at points. I accept that people can go backwards but to use the typical rival and competition mechanic as well as the classic misunderstanding twist was in some ways a cheap way of prolonging the series. \\n\\n\r\nAll stories reach a critical point, where the author has to let the characters come to a natural conclusion based on their pattern of behaviour established over the previous development. Unfortunately at times, it felt that the drama was forced and as such the show lost a lot of emotional potential. This second season just never reached the heights of feeling and excitement as the first one.\\n\\n\r\nUltimately I'd still give this season an 8 (just barely), simply because it did keep it's promise in the end of finishing on a good note. If you are in the mood for a rom com, with lovable characters, fun moments and in the end an uplifting fulfilling conclusion, then you won't go wrong watching this series. It does not match the outstanding first season but I think most people would still enjoy it enough to not regret watching it all.",
            "date": "2016-08-29T07:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 227865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4629270.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/theadrin",
                "username": "theadrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=227865"
        },
        {
            "content": "My tips: skip the first 8 episodes and just watch 9-12. \r\nThis 2nd season feels like artificial padding - it's the same type of conflicts and drama as the main duo fail to understand each other and drag out that misunderstanding for the majority of the show.\r\nYou'd think 26 episodes of will-they-won't-they and them doing very couply/intimate things in the finale of S1 would resolve things..NOPE. They drag things out. A new character enters who's pretty much a male replica of Kurumi (the blonde jealous love interest of S1...bonus, he's even blonde) and this is just a rehash. It's very disappointing.\r\nThis season does have goodmoments though - heartingwarming and hilarious, so if you really enjoyed S1 go for it. But they could've pulled off this season much better and I'm very disappointed in what we got.",
            "date": "2016-08-16T12:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 226864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4479861.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/taski897",
                "username": "taski897"
            },
            "url": "https://myanimelist.net/reviews.php?id=226864"
        },
        {
            "content": "If you loved the first season of Kimi ni Todoke like I did, you may also feel as betrayed by season two as I do. The writing quality changed so drastically between seasons one and two that I was unsure whether or not I was even watching the same show. Bad news; I was.\r\nThe first season of KnT was pretty darn good. It had tons of heart, great characters in Sawako, Chizuru, Ayane, Kurumi, and the rest. The comedic elements were solid, if not occasionally timed awkwardly, and up until the very end, I was invested 100%.\r\nThen comes season two. Instead of the story flowingalong smoothly like it did in S1, S2 immediately time skips again and again, right from the get-go. Ayane said in S1, \"love is all about timing\". Well, the story lost its sense of time, and not just in a narrative sense. The story beats and comedic timing also suffered greatly in this poor follow-up to a pretty good first run.\\n\\n\r\nThe biggest sin of KnT's second season, though, is how they erased 25 episodes of character development with the aforementioned time skips and some pretty insane contrived drama. I can't remember a time I've been more frustrated with a romantic comedy story's tropes and cliches than in this 12 episode run.\\n\\n\r\nSeriously, they pulled out all the stops here. It's almost impressive. Not to say that S1 didn't have its fair share of romance story cliches either, but it at least used them within the walls of its cohesive narrative filled with likable characters.\\n\\n\r\nThe art maintains most of the first season's quality, and the sound design is alright. The voice acting remained solid, too.\\n\\n\r\nOverall, this second season was incredibly frustrating to watch. It's a very jarring difference when compared to the great first season. In my opinion, skipping the drama and having Sawako and Kazehaya get together in a 26th episode in the first season, followed by a second season of further character development with the two in a relationship, as well as further developing the other characters around them (poor Ryuu x Chizuru pairing got almost zero attention) would have been a far, far better and more compelling second story.\\n\\n\r\ntl;dr A very disappointing and frustrating 2/10.",
            "date": "2016-07-24T23:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 224908,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5443827.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/rskt",
                "username": "rskt"
            },
            "url": "https://myanimelist.net/reviews.php?id=224908"
        },
        {
            "content": "They should rename this to the \"Series of Unfortunate Misunderstandings\" \r\nI enjoyed the first season even if i felt like it went on way to long. Something that could be done in 12 episodes was stretched into a 24 episodes. There was also things with how the characters all clamor around the MC. So there being a second season felt really unneeded. \r\nThere is 13 episodes if you count episode 0. Episode 0 is pointless and just a recap of the first 24 episodes with nothing new. Then the next 5 to 6 episodes acts as no progress was made the first season. The restkind of ruins the character of the Male MC imo.\\n\\n\r\nI still think that this story would be so better if it was about Chizuru and Ryuu relationship. By far the most interesting couple in the show. I still also feel that the MC just isn't that interesting of a character. Same with the Male MC. \\n\\n\r\nOverall there is some stuff i still enjoy from the first season in this but i just don't feel that this was that needed of a season.",
            "date": "2017-12-26T02:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 266422,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=266422"
        },
        {
            "content": "“Man, I wish they were my friends.”\r\nTha’ts what stuck with me when I watched this. I really, really loved this. I mean, really loved it. Because I literally over-analyze every, single, little, thing, ever; I could relate to Sawako. For other reasons also, but that was the mean reason. I really understood her and felt so happy for her. What really grabbed my heart, was the moments after something really profound and meaningful happened to her and she would smile that infectious smile. I think I fell in love a little bit when they showed that. Also, what made it special was the fact thatthey didn’t show it very often, or rather, showed it in different forms as to not take away it’s importance and I absolutely loved that. Man, I would have loved and cherished being her friend.\\n\\n\r\nI thoroughly enjoyed watching not only Sawako grow, but Ayane and Chizu, Kazahaya and Kurumi as well. It really goes to show how just one person can be so influenctial in a person’s life. No, not just Kazahaya, but everyone else as well. We’re all here for a reason, we all have a part, no matter how minuscule or great, to play in each other’s lives. Kurumi emphasized that perfectly in the last episode. As I said before, I wish they were my friends. I really meant that. Watching Ayane and Chizu be the wonderful people they were to Sawako made my heart warm. \\n\\n\r\nBut while this is all mushy and shit, here’s what’s really important here: communication. What you say to someone, how you say it, and relaying that message in it’s entirety is massively important no matter what situation you’re in. Also, “listen with your ears, not with your mouth,” is really vital.People get so wrapped up in just what a person said that they don’t actually take the time to truly understand. So what happens? Misunderstandings. The anime does a fantastic job of showing that, albeit in an extreme and dramatic way, but it does push the point across. \\n\\n\r\nThere was a lot for me to ponder and learn from this as I watched it. It made me think about things differently. I hope you’ll let it teach you too. Just watching that infectious, beautiful smile is enough to beg for another episode.",
            "date": "2017-11-25T02:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 263906,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Witcher151",
                "username": "Witcher151"
            },
            "url": "https://myanimelist.net/reviews.php?id=263906"
        },
        {
            "content": "I think this season was weaker than the 1st season. I thought I will enjoy the story like the 1st season, but it was boring and make you very regretful because you have watched it.\r\nI expected that season will be richer in events, especially because it's a complementary for the 1st season.\r\nThis is my opinion.",
            "date": "2012-06-20T04:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 63887,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1200843.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Elle_D",
                "username": "Elle_D"
            },
            "url": "https://myanimelist.net/reviews.php?id=63887"
        }
    ],
    [
        {
            "content": "To put it bluntly, it's very difficult for me to name any other romance anime that isn't ecchi or based entirely on sexual feelings. I've seen characters \"accidentally\" feel each other up, I've seen characters kiss when they barely know each other, and I've even seen characters preparing to have sex when they just started dating. Kimi ni Todoke takes a far more pure approach. \r\nI think these are some of Kimi ni Todoke's best points:\r\n[+] Both characters are already in love with each other; the other isn't being forced.\r\n[+] The characters feel happy just seeing each other smile; their love is pure.\r\n[+] Sawako dressesmodestly, has natural looking hair, and is pretty much flat-chested; she is not fanservice.\\n\\n\r\nSome complain about the slow progression and misunderstandings, but I think it adds suspense and makes this worth watching. What'd be the point if they got together right off the bat? And come on, we've seen the \"interfering third party\" thing too often. I think it's good there wasn't some absurd number of rivals flowing in or some past history that taints the purity. This season was more focused on Sawako and Kazehaya overcoming their own personal obstacles, which I think was more interesting and made for a more acceptable ending.\\n\\n\r\nI think these are Kimi ni Todoke's worst points:\\n\r\n[x] Sawako turning chibi regularly was pretty unsightly and not funny. I think this anime would've looked a lot better without the chibi parts. \\n\r\n[x] The art was just plain lazy at some parts, such as having ball hands. The shading on the teacher's hair also looked like total crap.\\n\r\n[x] There was a lack of animation in many parts, substituted with an abundance of pentagon-shaped bubbles floating everywhere.\\n\\n\r\nI liked Kimi ni Todoke for its simple/realistic character design, character development, pretty good love story, and its occasional funny parts. It was just all around good to me while, thankfully, avoiding most of anime's typical shortcomings.",
            "date": "2012-11-21T19:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 78115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Danno",
                "username": "Danno"
            },
            "url": "https://myanimelist.net/reviews.php?id=78115"
        },
        {
            "content": "Much like its first season, it is very enjoyable! \r\nIt  can be a bit frustrating, because it is a slow build-up but it is so...heartwarming to watch. You see every character maturing, growing up, and overcoming their problems. Sawako fills your heart with determination. \r\nThey don't encounter as many new challenges as in the first season, because they are just ending the storyline, but you will find out more about different characters POVs, not only Sawako's, which is refreshing. \r\nHonestly, if you have watched the first season you have to watch this season. It is, after all, the end of a beautiful story.\r\n[kinda s/poilerythis part but] I feel like this season Sawako understands and comes to therms with parts of her personality, and learns confidence and self-respect, u know, without losing her personality. I LOVED that. She didn't change for anybody but her!\\n",
            "date": "2017-04-21T05:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 245947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6092592.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/falloutyoli",
                "username": "falloutyoli"
            },
            "url": "https://myanimelist.net/reviews.php?id=245947"
        },
        {
            "content": "I loved this anime so much especially Season 1. I agree with lot of people commenting  here.Yes in season 2 they should have started up with Ep 9-12 instead of stretching season with useless episodes. SAWAKO for me was still awesome but lacked in confidence as compared to season 1. I was thinking of an episode entirely dedicated to there date.... and no Kiss ....season 2 lacks all that romantic charm....But for that manga made my wish come true....a kiss and now waiting for college. lets hope it turns out to be a neat,good and romantic story rather than stretching plots or as mangacomes up with a twisted plot where someone dies or they breakup and  in the end they meet each other....KIMI NI TODOKE started in 2009 and I`m still following it 6-7 years I dont even remember faces from 2009....Hm mm Still I will keep following it....",
            "date": "2016-08-06T13:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 226069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526349.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xpendables_T101",
                "username": "Xpendables_T101"
            },
            "url": "https://myanimelist.net/reviews.php?id=226069"
        },
        {
            "content": "A measure of a good romance anime is when the adaption entices you to read the original source. It should make you feel that you can experience the emotion yourself. And, no matter how impossible it is, it should always give you hope that the same thing might happen to you in real life. Kimi ni Todoke (KnT from here on out) satisfies all criteria well, but not without making you want to punch something midway. Keep in mind that this review is only for the second season, covering just 12 episodes. Most of the themes and styles from the first season are carried overthough, so this reviewer will try to point out just the elements that stand out. \\n\\n\r\nStory/Character: 10\\n\\n\r\nLights, sound and art might make an anime shine and sparkle (there’s plenty of that as well, so we’ll talk more about that later) but the story is what keeps you from dropping the show. And when you consider that KnT is a spin on the usual “boy-meets-girl” scenario, it does very well to make itself stand out from the already crowded pack. KnT also does well to avoid any cliché events, so there is no beach/onsen/fanservice scene that most anime show these days.  \\n\\n\r\n Most of the development for the other characters were back in season one, this time around the focus in solely on the two main characters, Kuronuma Sawako and Kazehaya Shouta. It showed how they slowly figured out their feelings for each other and finally (and I do mean FINALLY) got together as a couple. There were a lot of times when I found myself actually shouting at the TV, frustrated by the madness that was going on with these two. Nevertheless, it was great seeing how Sawako changed from the first season. They managed to tie up all the loose ends, even the one with another character, Kurumizawa Ume. In some way, a character or two will endear him or herself with you.\\n\\n\r\nArt/Sound: 9\\n\\n\r\nIf you could pardon the reference, the world of KnT was simply “shining, shimmering, splendid”. There were so much color and so much sparkle (or what I call “bokeh”) that it would make a good piece in an art exhibit. Though it might feel over the top sometimes, the art does help portray and intensify the emotion or action being showed. Nothing feels out of place, from the “bokeh” of Sawako’s smile to the chibi-fied and simplified versions of the characters to show comedic appeal. Quality is the key word here and the studio, Production I.G., didn’t skimp out on eye-candy as far as I can see. \\n\\n\r\nAs for the sound, the majority of the music from KnT is piano and violin ensembles which fit the overall feel of the show. Just like with the art, not one note felt out of place. For comedic scenes, the BGM would usually be something quirky and funky to make you laugh out loud. And for romantic scenes, the music would be enough for you to shed a manly tear or two (or womanly tear, for the ladies out there). Overall, both the art and the music meshed together to help deliver the story the best way possible. And it has surely done its part well. \\n\\n\r\nOverall: 9\\n\\n\r\nAs with any second season, it is recommended that you watch the first season first (duh~) unless you want to feel out of place with the story. That being said, Kimi ni Todoke is certainly an anime worthy of anyone’s Top 10. It shows us love, makes us love [the characters] and let us feel love in return. True to its name, this anime absolutely reaches out to us. \\n\\n\\n",
            "date": "2012-02-02T07:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 53049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/337742.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/seyrine",
                "username": "seyrine"
            },
            "url": "https://myanimelist.net/reviews.php?id=53049"
        },
        {
            "content": "This review is a combination of the 1st and 2nd season. If i can sum up this entire series in one sentence it would be: \"It took them long enough.\"\r\nStory = 7 - Nothing new, loser girl and popular guy with a lot of misunderstandings and chances to be together. Chibifying the characters during dramatic scenes were kinda dumb, those scene were supposed to make you cry not laugh and smile, but that didn't stop me from crying like a little girl.\r\nArt = 8 - the art is good! It is well drawn and animated.\r\nSound= 8 - It's so calming and relaxed, when tension builds,the BGM builds up along with it.\\n\\n\r\nCharacter = 8\\n\\n\r\nSawako Kuronuma - Ai Enma and Sunako Nakahara's long lost sister. The Female Main Character, she looks scary that's why people made rumors about her being able to summon ghosts and monsters but in reality, is kind and loving person.\\n\\n\r\nShota Kazehaya - Kazehaya-kun, the Male Main Character, very popular. He is always seen laughing and smiling, he is what Sawako strives to be, a lively and energetic person.\\n\\n\r\nAyane-chan - one of Sawako's bffs. She gives Sawako support when she needs it.\\n\\n\r\nChizuru-chan - one of Sawako's bffs. She likes Ryu's onii-chan. She's a delinquent but, she is one of the kindest people in the show. She and Ayane are the main jokers of the show.\\n\\n\r\nPin-sensei - one word: \"EPIC.\"\\n\\n\r\nRyu- Kazehaya-kun's best friend, he has feelings for Chizuru. Is seen always asleep.\\n\\n\r\nUme Kurumizawa - DIE\\n\\n\r\nMaru/Pedro Martinez - Cute.\\n\\n\r\nEnjoyment = 8 - After 37 episodes of blushing, aww moments and misunderstanding, I grew immune to those kinds of animes. What i enjoyed most about the 37 episodes of Kimi ni Todoke was Kazehaya-kun and Sawako's aww moments followed by either Chizuru or Ayane or both teasing them. Seeing both Kazehaya-kun and Sawako blush and get embarrass gets me everytime.\\n\\n\r\nOverall = 9 - I gave it a 9 because I'm a sucker for Happy endings. They finally got together! I would've given it a 10 but no kiss.",
            "date": "2014-04-21T18:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 140833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3641079.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jean-chyan",
                "username": "Jean-chyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=140833"
        },
        {
            "content": "To be quite frank, the first season was a lot better. At least you had more interaction, but here everything just becomes awkward and distant. \r\nExpect a lot of confusion and I'm-Going-To-Pull-My-Hair-Out moments. I stayed up until almost three in the morning watching the episodes, convinced that something was going to happen.\r\nIt turned out to be a huge waste of time. The ending episode(s?) were alright, but not enough to actually gain the privilege of being named a romance.",
            "date": "2014-01-17T11:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 129099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3482323.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Silvermoon05",
                "username": "Silvermoon05"
            },
            "url": "https://myanimelist.net/reviews.php?id=129099"
        },
        {
            "content": "arece the 2nd Season trying to move more than usual, the drama is kind of a little stressed and also the humor, try to show the insecurities and doubts of Sawako's kind of a mental torture, you see the path but can not find the exit . Yet still it can be said that this continuation is pretty cool.",
            "date": "2015-07-03T17:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 192211,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4547041.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iky009",
                "username": "iky009"
            },
            "url": "https://myanimelist.net/reviews.php?id=192211"
        },
        {
            "content": "I won't give any spoilers here so read without worry\r\nSo first thing you need to know- This season is an emotional roller coaster and if you get into anime like I do you will be screaming at the screen for about 5 episodes straight. (episodes 2-7 to be exact).\r\nSecond thing you need to know- It is definitely worth it. The last few episode are great and honestly looking in retrospect the writers of the anime did a great job purposefully giving me heartburn for the first half because that is the way you are supposed to feel. They had all of the character development theyneeded in the first season to really attach you to the characters and this season drags you in so far using that that you might forget that this is an anime temporarily as the people of your house wonder why you are screeching then suddenly very quite as they hear light sobs coming from your room.\\n\r\nOk so maybe that is a slight exaggeration, but its not too far off. If you like anime that can touch each one of your emotions just by being a good story then this is what you are looking for.\\n\r\nNow I'll go through my ratings\\n\r\nStory 9: Everything I said above goes here\\n\r\nArt 7: Its a little outdated and omg the sparkles but it actually brings a good overall feel to the anime and suits it well.\\n\r\nSound 8: As you watch remember its the little things that count. A bell here, soft music there, a short breath, they really pull you in and you have to pay attention to notice it. And of course the OP and ED are awesome.\\n\r\nCharacter: Sawako is one of my fav MC's. She is precious and innocent and good natured through and through. The whole cast is enjoyable, even Joe and Pin (those idiots... you'll understand when you watch it. Honestly the only one I don't give top marks is Kazehaya. I mean Sawako is dense because she doesn't understand how things work but Kazehaya has no excuse that DENSE PIECE OF.... Once again you need to watch it.\\n\r\nEnjoyment 8: I would give it a 9 but the heartburn was real....\\n\r\nOverall 9: Something I would recommend to any anime fan, seasoned or no.",
            "date": "2016-01-13T01:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 208409,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5067543.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BakaMasuta",
                "username": "BakaMasuta"
            },
            "url": "https://myanimelist.net/reviews.php?id=208409"
        },
        {
            "content": "I watched this one so fast..... Because i couldn't stop thinking about it! It was funny, sad, and heart wrenching all at the same time. It is very shojo though, but that's ok because I love shojo! Had been wanting to watch this one for a long time and finally got around to it. Glad I did.",
            "date": "2013-11-27T16:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 121613,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2514417.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hopelongacre",
                "username": "hopelongacre"
            },
            "url": "https://myanimelist.net/reviews.php?id=121613"
        },
        {
            "content": "once in a while i like to watch rom-com school drama. i had watched almost all the good ones except this.\r\ni finished season 1 .. and it completely bored me... there was no interesting story whatsoever and the pace was SLOW\r\ni really didnt want to season 2 .. but IM GLAD I DID WATCH IT\r\nthe art and sound are quite good \r\nthe story.. well its more gradual and REALISTIC than other similar animes, probably because of the pace of this anime , and the character development.\r\nif season 1 and 2 were combined.. its a really sweet story of a girl who is extremely shy (andyes such shy people do exist, and i was one of them in middle school), who got bullied, was lonely, who found friendship, and finally love\\n\\n\r\nand ofcourse jealousy, rivalry, misunderstandings, and complications were included too\\n\\n\r\nbut all's well what ends well :)\\n\\n\r\ni gave this a 7 on 10, although of the good story, but it dragged a bit, and omg the pace... it would have been better to increase the speed in the anime (i dont knw about the manga since i havent read it) and also that sawako really annoyed me... i mean im a girl too... but WHO THINKS SOOO MUCH BEFORE DOING ANYTHING!! goshhh\\n\\n\r\ni do recommend this anime from those who like shoujo mangas, but ull need patience to watch it :)",
            "date": "2013-08-16T17:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 109993,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1729417.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/IzayaKuchiki",
                "username": "IzayaKuchiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=109993"
        },
        {
            "content": "And so the magical love story continues…….\r\nAfter seemingly a very long wait the sequel is here!\r\nThere’s a long review coming!\r\nABOUT THE STORY\r\nIn this sequel Sawako already managed to really have friends naturally. She even became so popular that it seemed people was fearing and worshipping her like a God. With her hard work and helped from friends, she became more sociable. And of course, the much awaited love story of Sawako and Kazehaya was the main plot in this series. With the appearance of a new character and somewhat a third party between them, their relationship gotten so complicated at first but with the adviceand helped behind the scenes from their friends they finally expressed what they truly felt and at the end they managed to be together.\\n\\n\r\nAgain! This story never ceases to move me! This is the best love story in the history of anime. This sequel was even more amazing than the previous one, not that I don’t love the season one. It was irritating at the beginning but the ending was so damn worth it. The story was simple and light yet it was so amazing. I am already fed up with love stories with characters just confessing then going out then kisses then going all the way then getting married in the end. It is so cliché and over used. In this series, the love story is very much elaborated so you will really feel the romance of it; from the small gestures of affection to the overwhelming feelings. That amazing feeling and happiness from just looking at him then the embarrassing feeling when he/she caught you staring at him/her. The nerve-wracking sensation when he’s/she’s coming then the heart-pounding feeling when he’s/she’s close to you. And the excitement and nervous feeling of finally confessing and of course, the most magnificent feeling of realizing that it is mutual. We sometimes forget that those small gestures are what make the first stage of falling in love the most wonderful part of the whole experience.  It is almost like a sin how the author managed to create such master piece.\\n\\n\r\nABOUT THE CHARACTERS\\n\r\nThe characters were more amazing because the main plot showed each and everyone’s real personality and how it affected each character. The appearance of somewhat playboy third party influenced the flow of the story. Though it was mainly for Kazehaya because he was so jealous of Miura and feared for the first time of the possibility that someone might fall for Sawako, too. At first, Miura was so irritating for butting in between the two but he showed his significance later on. Even though not directly, their friends was so reliable and helpful to them for advising and making them realize their feelings for each other. Especially Pin, who was magnificently and hilariously giving them encouraging words. He even bragged about it himself. It was so hilarious that he always appeared at the right time and moment for Sawako and Kazehaya. He can really give important advice in his own very unique way. In fact, he was the main source of encouraging words for Kazehaya.\\n\\n\r\nABOUT KAZEHAYA AND SAWAKO\\n\r\n Of course, let’s not forget the two love birds! In the beginning both of them were so damn irritating but most of the time funny. Both had to realize what they really felt. For Sawako, she had to make up her mind if what she really felt for Kazehaya were mere admiration or genuine love. For Kazehaya, he had to really understand that it was truly possible that Sawako might felt the same feelings for him, too, and not just simple admiration. Oh! I also really loved whenever Kazehaya got jealous because he was so cute, well, most guys get really cute when they’re jealous. They struggled a lot because both of them were so dense that they didn’t even realize that what they felt was the same. They ended up saying harsh words to each other without even realizing it when the truth was the opposite of what they were saying. Well, at the end they managed to truly express what they felt and FINALLY they reached each other’s feelings.  Like what the significance of the title “KIMI NI TODOKE”! In the very first episode of season one, Kazehaya wondered if his feelings will reach Sawako and now, in this sequel, his feelings finally reached her. After so many complications, at last they were finally together. I am genuinely so happy for them. It even feels like they are real-life friends of mine and I am rooting for them so bad. That’s how much I am moved by this series!\\n\\n\r\nABOUT THE ANIMATION and SOUND\\n\r\nThe animation was still superb. Every episode was magically made. There was no episode that was not worth watching. The dialogues of every character genuinely moved me. The characters was so beautifully made that it literally blew me away from my seat. I’ve never seen such gorgeous looking couple in any anime for so many years. With the great voice talent of the seiyus, every line was so captivating. The lines were sincerely delivered because of them. Every hug, every touch, and every word genuinely showed how much the two characters loved each other. To sum it up, the soundtracks made the whole experience unforgettable. \\n\\n\r\nFor so many years, Lovely Complex has never been replaced in its spot for my number one love story but it would be a sin to not put Kimi ni Todoke in the first slot. This series genuinely moved me and gave me something precious to remember for the rest of my life. This series is one of the very few animes which I am dying to see for a continual airing like my favorites; Naruto: Shippuden, Bleach and One piece. I am just so sad finishing it. SO SAD!  I was begging for more!  I just want more of them! I just want to continue witnessing their love story! I literally fall in love with this master piece!\\n",
            "date": "2012-12-09T07:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 79576,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79576"
        },
        {
            "content": "I waited an awful long time to come back to this anime, I can honestly say... I'm not sure if it was worth the wait..\r\nThe score I have given this anime is purely based on the fact that it gave some well deserved closure to the series, Though I am well aware the manga does carry on past this point, I honestly think their is not much reason to, being that their is only so much you can add to anime like this without over doing it.\r\nI'm writing this review based on the idea that you have already watched the first series, If however youhave not watched the first series, and seem vaguely interested in the story, then i recommend viewing that first before reading this.\\n\\n\r\nThe first I'd like to say is that their is only so many misunderstanding one can take watching a series, and those Japanese guys do sure like to milk it, I'm not sure if the person writing this manga/anime had a complex at school where they feel they could not pronounce more than 2 sentences without hyperventilating, or whether they simply they just wanted their main heroin to suffer as much as humanly possible, But, and a big but, I digress, \\n\r\nThis anime is vague show of how complicated and bittersweet romance can be in your high school years, and though the majority of you may not of had such a problem, I'm sure one or two of you felt on a deeper level with our main heroin, and how the struggles to get your feelings across, can be quite difficult sometimes.\\n\\n\r\nAs you can tell I have not given away any of the story, this is simply a review of my personal opinions towards this anime, In short, If you liked the first series, then do pick this up, because one thing us humans do love in this world, and that is closure, and what better than closure that simply gives you everything you hoped for.",
            "date": "2013-02-04T08:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 85811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373255.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lithik",
                "username": "Lithik"
            },
            "url": "https://myanimelist.net/reviews.php?id=85811"
        },
        {
            "content": "\"I finally...reached you!\" \r\nThe second season of Kimi ni Todoke can be summed up in this sentence. Yes, I know this is probably a spoiler, but it's not like you didn't know it was going to happen. The twelve episodes continue right were the first season left off, our main couple continues its sloooow but unbelievably sweet path to romance...encountering a great deal of misunderstandings and situations that made me at times facepalm myself, these guys are so naive. Yet, I didn't find those moments overwhelming, because it's all part of the ride. I found the second season very satisfactory, truly, the interactions between Kazehayaand Sawako were so beautiful and heartfelt, a kiss wasn't really needed. I haven't encountered another romantic anime that made me feel that way.",
            "date": "2013-06-14T12:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 101069,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2467599.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/floryfede4ever",
                "username": "floryfede4ever"
            },
            "url": "https://myanimelist.net/reviews.php?id=101069"
        },
        {
            "content": "Considering that it took 26 episodes in the first season for Sawako to finally hold the hand of the boy she liked, I was doubtful that a 13-episode second season could really make any progress if it held to the same pacing as the first season. \r\nI was dismayed to see the route that was taken in the second season. After reaching a relative pinnacle of closeness in their relationship at the end of the first season, the second season seems intent on back-pedalling, stalling, and otherwise dismantling all the progress they've made up to that point. The inclusion of new characters and rivals wasto be expected, but it reaches a point where it seems everyone in the school is set on sabotaging or supporting the two main character's relationship. The reasons or excuses keeping Sawako and Kazehaya apart become increasingly absurd and implausible; in the penultimate incident, their relationship is effectively killed by a nuance in conversation so subtle that Western audiences may not even catch it. \\n\r\nKimi ni Todoke second season carries on the warmth and amusing insight of the first, but the strategic efforts of the author to prolong the courtship are too effective, making this story arc more grueling and unhappy. Even if the audience is committed to these characters by now, the second season may exhaust their patience.",
            "date": "2013-12-25T11:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 125543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/astillar",
                "username": "astillar"
            },
            "url": "https://myanimelist.net/reviews.php?id=125543"
        },
        {
            "content": "Ok first off I gotta say I dove in head first to watch this because I felt like there wasn't enough closure for the first season. I wan't to say that I liked this season overall better then the last because there was an actaul ending to it all and there some nice new character's to refresh the series a bit. \r\n  What I didn't like is how instead of branching the story out in a new or different direction it seems like they just added a new character here and there to push the same dilema that was striking the firstseason. She get's to brink of completion with her relationship and then something happens to knock it all out and make start over from square one. I guess the appeal could be the fact that the writer's never gave in and just wrapped it up from the get go and kept pushing their relationship resolve to the very end. I think I literally watched all of it just to see what I wanted to happen in season one.\\n\\n\r\n  Well I guess that's enough bickering overall I want to say that the show has it's moments of comedic relief and it's fustrational points just enough to keep you reeled in to watch the next episode I give this anime a 7.5 =D.",
            "date": "2012-05-30T20:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 62295,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1240391.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Abeldaking",
                "username": "Abeldaking"
            },
            "url": "https://myanimelist.net/reviews.php?id=62295"
        }
    ]
]