[
    [
        {
            "content": "Why do you watch anime? Think about it for a second. We all have our own reasons to consume media. Different people will have different reasons but at the end of the day each of us has our own reason for watching anime. While entertainment is the main point of media like anime, for me it's more than just that. There are many things that I can do that are entertaining. For example shitposting is entertaining. But is it fulfilling? No, not really. Video games can be entertaining (Although they've fallen out of favor for me.), so if entertainment was the goal why not playone of those. For me, that would be board games. I love the challenges and strategies that are present in board games, and I personally find them entertaining. So if entertainment is the goal, then why anime specifically?\\n\\n\r\nThis is why shows like Konosuba end up getting 7's for me. They are funny and entertaining but the enjoyment ends once the episode does. And while that is worthwhile, I want something more. I feel like the unique experience that animation can bring is the ability to be sucked into a world and learn to love and care for those that inhabit it. There is richness in finding something that is loveable, something that doesn't just live in the experience but something that can be taken away from it. I feel like out of everything fiction is what best does that. And so when I deal with fiction, that is what I look for. Something that I can love completely. Something that makes me want to see every bit and moment of it. Something I can rewatch over and over again. Something where not only do I love the characters but I also have the characters play out in my mind doing random things. \\n\\n\r\nWhy do I tell you this? Because that is exactly what Urara was to me. Something that not only made me eagerly wait for each episode so I could watch in and see the characters I loved so much but something that made me want to think about it in my mind. Create works of it with what tools I could, and gush about it whenever and whatever I could. It's exactly what I wanted. But what makes it so good? Everything.\\n\\n\r\nCharacters and character interactions I would say are the most important part of CGDCT shows. How is one supposed to enjoy the cute things that the cute girls are doing if the characters aren't likeable? Furthermore character interactions is what helps supply the cuteness that makes these shows work so well. A CGDCT without interesting or likeable characters or with bad character interactions is going to be bad. So it's important that Urara does characters well. And it does!\\n\\n\r\nOur cast has quite a variety to it and while the girls may skate near common tropes they all have their own character traits that keep them away from being another iteration of those tropes. We have Chiya who is one of the funnest characters to get to watch. Despite being a feral child she's surprisingly wise about some things, as well as being a complete and total sweetheart.  At heart she is a feral child but she has her own fun quirks to her. The most notable one is that she loves bellies. She loves them a lot and likes to bring them up as much as possible. She also tends to be endlessly positive and sweet. That doesn't stop her from having some insecurities though.  Despite all her kind words and her acceptance of others. She has a reluctance to make herself vulnerable which adds another layer of interest to her, giving more depth to her character.\\n\\n\r\nKon is the character that I would say is the most interesting. At first glance she seems like a character modelled in the line of Mio from K-On! And she is, however she has her own depth and peculiarities to her that make her fun and unique. One interesting point about Kon is that while she certainly tries hard and does her best to study as much as possible she isn't portrayed as much smarter than the rest of the cast. Often times she'll fall into the same pitfalls that the rest of them do. Rather her skill and knowledge is from dedication through and through. \\n\\n\r\nKoume is the fun girl of the cast and overall I have a hard time pinning her down into any bracket. I guess mostly she is a tease and a Frenchaboo taken in via Marie's influence. She's not exactly a genki girl, that's more Chiya, but she does fit more onto the happy side. She's also quite interested in beauty despite being the one of the cast most interesting in eating sweets. Out of the cast she's the one I have the least of a handle on, although that's not due to any fault of her own. She does try hard herself despite trying to have fun when she can\\n\\n\r\nNono at first glance seems like a typical shy girl. She even spends the first half of the episode hiding behind her big sister. Given how shy characters in media are treated, she could have been yet another one of many shy characters whose main problem is not being social with others. These plots have been done over and over again almost repeated word for word. The shy character wants to have friends or get farther in life but they lack the courage, so the main characters work to give the shy character the push that they needs to be out in front. So of course Urara decides to... not do that at all. In fact, Nono's main development and push comes from the fact that she wants to be self-sufficient. It would be easy to rely on her friends to give her that push to be better. But instead most of her problems have to deal with her removing herself from the shadows of those around her and being truly by herself. It's a noble and interesting path of development for her, and it does also tackle the fact that she is shy. But that shyness is not treated as the only part of her character or even the main hurdle. This sets her character and development apart from others in a similar ilk.\\n\\n\r\nThe character interactions are a big highlight of the series. One thing I enjoyed from this show is how much the main cast cares about each other and the things that they're willing to do for each other. Take Chiya and her belly exposing habit. Most people would look down at her for doing that and call her a weird pervert. Judging from my high school experience she would be mocked totally and completely. And as seen in episode 1 they too think this trait is weird, and yet they embrace it. Sometimes they'll make a light little joke about it like Koume does at the beginning of episode 2. Or sometimes they'll reveal their own bellies as if that would be what Chiya does. They embrace the trait even though it's somewhat weird and out there, which shows a lot about their character. While a show could have gone for the route of making that characters trait into a joke for the other characters to laugh at, this show has the characters embrace it and take it into their own. In itself its already heartwarming to see these girls all with different backgrounds accepting each other for who they are and how they act even if they might not be normal. It's one of the great pleasures I got from this show.\\n\\n\r\nNote there is some nice yuri undertones as well, leading to hints towards some powerful relationships, but that all comes later in the series.\\n\\n\r\nAs you can see, the characters are great. But characters aren't everything, what about the plot. Now you might be asking yourself, plot? What's a plot? This is is a CGDCT show there isn't supposed to be any plot! But guess what there is a plot, and it's executed wonderfully.\\n\\n\r\nUrara revolves the four girls trying to become top ranking urara or diviners. This is a nice little plot that makes clear the motivations of the characters but yet also doesn't overshadow the tone of the show. Because the show is primarily about the fun things the girls do together it's good to have a plot that while there isn't taking up all the space and time but also provides a template for where the show is going, as well as a goal to strive for.\\n\\n\r\nThe way this is executed in my opinion is brilliant. Most of the episodes are those of the variety that would be light and fluffy. They don't have much plot dependence and for the most part they show the good times that the girls all have together. Sometimes a bit of key information will be leaked but the tone of these parts always stays on the fluffy side. These episodes give us the nice pleasant atmosphere that we are used to from CGDCT shows. The characters interact with each other, play off of each other. They learn about themselves and others, as well as study up on how to be better uraras. \\n\\n\r\nBut remember how I mentioned the plot? It's not just a book opener and a book ender. It's there for a reason. There are mysteries that lie beneath the show with regards to Chiya. Leaving a vile of intrigue under the wraps the show. There are several episodes where the struggles of the characters and more deeper issues come to the forefront. There are heartwarming moments between the characters due to the things that happen to them. Urara strikes the delicate balance between being lighthearted and having substance in it. For me it hits right into the sweet spot. It has just enough emotional moments and depth to be substance full yet it has enough playful times and fun bonding that makes it lighthearted and comfy. This allows the best of both worlds, both a deeper presence in the show but also the fun happy times that strike joy into one's heart. It's a mix that I find few shows are able to pull off well, and certainly most shows don't pull it off as well as Urara does. The pacing between these elements are also key. The more intense moments don't come out of nowhere. They are there for a reason and when watching it's clear why. Also it has a baseline of the happy moments so that one doesn't need to worry about the mysteries while the girls are having a fun time. Rather they are dealt with when they are needed to, which I feel like is the best wy to do this. It represents life and going through life in a balanced manner. Yes there are problems, and there are going to be bigger things that happen especially when they have such lofty goals. But there are also lots of fun times. And usually if things are good those fun times will be most of the times. And that's how it is here. It's a very nice balance.\\n\\n\r\nI also want to note that the plot itself (being the best Urara), and some of the more god based mysteries seems a bit shounen-esk. Personally, I like this mixture as it makes the show a bit more original and adds a nice flavor. I'm not a fan of shounen in general but I do like bits and pieces of it. So when some bits and pieces of it is added into a nice comfy show well it enhances the show. It's nice to have tropes and stylings taken from multiple genres imo, and I always do enjoy when a show is willing to borrow across like that rather than stick to what is most commonly found in the genre.\\n\\n\r\nI would like to sidestep for a moment and talk about fanservice. Fanservice is not always a liked thing in anime and some people are turned off by it. Because of this I'm sometimes hesitant to talk about the fanservice that is in Urara. But I would like to be complete in this so I will note there is fanservice. And guess what? It's not just that there is fanservice, but it's excellently done fanservice.\\n\\n\r\nWhat do I mean by that? Well, two things. First off most of the fanservice that is there is the natural kind. What is the natural kind? Take your average show with fanservice. How do they get there? There are common fanservice tropes like the accidental pervert, who'll trip onto some girls boobs, or the type where the camera magically tilts towards the girl's panties. These are what I'd call unnatural fanservice. IT's hard to imagine them happening in real life, and rather they feel forced into the narrative in order to provide something that would give the audience a rise. In Urara that is not the case for the most part. In fact most of the fanservice is caused by the girls themselves, and in most cases Chiya. \\n\\n\r\nChiya loves bellies. She loves them a lot Sometimes, she tries to do things to expose other's bellies. She also doesn't like clothes and sometimes makes innocent mistakes when she tries to check for tails. It's easy to see where some of these fanservice elements can arise from. And while they might not be what everyone wants to see, they are true to her character. Every one of her fanservice moments I can point out why she did what she did. It may not be what everyone would do. No, it most certainly wouldn't be but Chiya is Chiya, and that's fine. Furthermore, the other girls can help at times too. Whether it be them teasing each other or just having fun in general, the atmosphere that I get from these moments are ones that are fun more than anything. And the funness of those situations make as a viewer happy. It's what they want to do and how they choose to play around at times; I personally find nothing wrong with that. Sure sometimes there are sneaky crabs but for the most part it's the girls being themselves, and I like that.\\n\\n\r\nThe second reason I'd say Urara's fanservice is good is because it's original. There's lots of belly fanservice due to Chiya's quirk. But guess how much belly fanservice there usually is? Not much. Urara decides to go for its own unique corner to the fanservice and that I find it something much more respectable. Even if one doesn't like fanservice, I think one could appreciate they're at least doing something unique with it, as well as having it fit in with the characters, rather than it be the endless amounts of accidental perverts. \\n\\n\r\nThe sound quality of Urara is also top notch. The OST is solid and it's rare that the music doesn't match the mood. The Voice Actors shine in the show. The VA's of Chiya and Nono did a great job with giving them distinctive voices. It's easy to tell when they're talking since they sound so different. Nono's shy squeaky voice perfectly matches her character while Chiya's soft and soothing voice matches the kind personality that she radiates. The voices match so well and are so unique that it adds an extra layer to it. It's rare that I find voices that match so perfectly but for the case of Chiya and Nono they absolutely nailed it.\\n\\n\r\nThe art as well is a delight to see. The animation isn't the most technical or impressive but it fits well with the mood of the show. For example, the little chibi faces that they use may be a way to cut corners but they are cute and get across the feeling from the show. The backgrounds are often nicely done and add to the soft atmosphere that it has. The art is especially notable whenever they go into the mystical events of the show. The color choices during them and the execution of them make them such wonders to watch. The palettes use a mixture of soft but notable colors never stoking too far to go out of the boundaries. They capture that feel of mystery and supernatural in a way I feel like other shows don't. \\n\\n\r\nThat was a lot to cover. I usually don't do reviews this way. I tend to focus on everything that seemed notable to me. So then why did I try to write about everything. Well silly, it's because EVERYTHING SEEMED NOTABLE TO ME! That's just how good this show is. Characters, story, pacing, writing, sound, art everything fits together so well creating its own original little show. I never felt like Urara was like anything else, that may be due to my limited experience but it felt fresh and fun. \\n\\n\r\nTo be fair I tried to talk about the more objective components of why I liked this show. I also just want to note that this show was very much catered to my taste. I am biased and it's important that you're all aware of that. I still do think this show is masterfully done but it is a show that very much aligns with my interests. \\n\\n\r\nIt's been a while since I've been this excited each and every week for the newest episode. The last show I can think of that did that happens to be my favorite show of all time. I love everything about this show. And now that it's over I can make it official. Urara Meirochou is my 2nd favorite anime.\\n\\n\r\n10/10",
            "date": "2017-03-24T17:21:00+00:00",
            "helpful_count": 166,
            "mal_id": 243423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984878.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fircoal",
                "username": "Fircoal"
            },
            "url": "https://myanimelist.net/reviews.php?id=243423"
        },
        {
            "content": "Urara Meirochou.  Alright, you're a moe blob anime, what's your gimmick this time?  Let's see here...  Set in a town of 10 districts...  Divination...  Gods and spirits...?  And...lots of yuri baiting.  Alright well this is going to be a 'fun' venture, now isn't it?\r\nStory: Labyrinth Town is a town of fortune tellers where girls with spiritual powers starting at the age of fifteen come to the city with the prospect of becoming rank one urara, the highest rank of fortune teller that one can receive.  It's here where we meet Chiya, a girl raised in the woodswho comes to Labyrinth town to meet friends with the goal of becoming a rank one Urara in hopes of finding her mother.  \\n\\n\r\nUrara Meirochou is what one would expect coming into a moe show filled with cute girls.  The show has an all female cast, cute character antics between the four main characters (cause 4 is apparently the magic number for this), some fanservice for those who're fans of seeing animated underage girls with less than a full set of clothes on, and a large majority of pointless dialogue talking about how they're all friends and how happy they all are being with one another.  Standard fare, nothing special, so what does the show's gimmick, the divination and setting of Labyrinth town, add to the overall story?\\n\\n\r\nAs far as impact goes, the added story elements help to spice up the story just a little bit to make it a bit more than the basic moe blob formula.  The majority of the episodes feature the girls learning various forms of divination while providing both the audience and each other with backstories and slight development with their ultimate goal being \"we're going to be #1.\"  In addition, the story manages to sprinkle in moments of unease (contrary to what a happy go lucky show like this may have normally) and show how the gods and spirits of the town interact with the Urara to an extent that I honestly wasn't expecting at all from this series.  The contribution of these elements actually do help keep parts of the story to feel interesting, but what makes it disappointing is how uncommonly these elements, particularly revolving around the lore of Labyrinth Town, is used.  \\n\\n\r\nAs far as endings go, the show has what is known as a 'throwaway episode', where the story of what the cour wants to achieve has been told in full before the entire 12-13 episodes is completed, causing the creators to use the remaining time for a fluff episode that the story could just as easily go without, and it wouldn't make a difference.  I'm not a fan of throwaway episode, and it felt like I was just wasting my time to finish up all 12 episodes of this show.  \\n\\n\r\nUltimately, Urara Meirochou is what one would come to expect from a cute girl moe show with unrealized potential.  Largely focusing on moe antics, the rest of the series involving the lore of Labyrinth town and the secrets of the gods and spirits that reside over Labyrinth town go largely unnoticed, thus creating only specific moments of the series which I would say is even worth watching.  The divination aspect stays with the series throughout its runtime, and it's an ever-looming concept that's thankfully fully a part of the whole series, but at the same time, just like the show's other parts, doesn't get fully realized, thus relegating all of the show's unique elements to feel more like gimmicks than absolute necessary components of the main story.\\n\\n\r\nOverview:\\n\r\n+ Manages to integrate unique elements well\\n\r\n+/- Largely still moe-blob based\\n\r\n+/- Unique elements however don't feel fully realized\\n\r\n-  Throwaway episode at the end\\n\\n\r\nCharacters: The girls in these types of shows are usually only ankle deep in character.  And to be honest, Meirochou doesn't do anything that different.\\n\\n\r\nChiya, as the main character/girl of the series, can be summed up in just three words.  A feral child.  Raised in the woods, Chiya adopts the cheerful genki persona while adding a twist of woodland qualities by consistently showing off animal-like behavior whenever she interacts with the other characters in the series.  Her goal in the series is to find her mother, and, as expected of a short adaptation of an on-going series, does not happen.  (Gotta keep the readers reading.)  Beyond wanting to make friends with everything and trying to find her mom, there's really not much to say about Chiya.  Admittedly the fact that she has a motivation is commendable enough for a character in a moe show, but again, this is a case of \"They could've done more.\"\\n\\n\r\nThe other three girls, Kon, Koume, and Nono, can also be summed up in just a few words.  The hardworking fox, the witch, and the shy one respectively.  All three of these girls bear similar character depth as Chiya, and as far as characterization goes, only goes as far as a backstory to give the audience a little bit of a better understand for as to what is motivating these girls to move forward on their journey to become first rank Uraras.  Again, there's really not much to say here.  They're all cheerful friends with one another as expected, and the show's lack of conflict or its use of laughably easily resolved conflict in such a bright and cheery show make the viewing experience of these girls surprisingly dull.\\n\\n\r\nThe rest of the cast is relegated to the side and feature other girls/women who act mostly as comic relief or unreliable mentor-types to add a little more variety to the character types that we're given in this show.  You have the one who stands up for the law, the yuri fangirls, one who's a sadist cause why not, and a troublesome teacher.  Again, nothing too special, nothing really worth mentioning beyond this tiny, tiny paragraph, so we're going to move onto art.\\n\\n\r\nOverview:\\n\r\n+/-  Typical moe cast\\n\\n\r\nArt: Produced by J.C. Staff, Urara Meirochou has some pretty standard art for the company's track record.  Characters are drawn in your typical cutesy art style, the color palette is bright and shiny to give off that colorful and cheerful feel, and characters are given exaggerated faces complimented with background changes to signify comedy and other moments like those.  They also put the characters' faces dangerously close together so often to the point that I swear they were going to kiss at least once or twice.\\n\\n\r\nWhile the show's normal art has nothing too terribly special to mention, Urara has another style situated in the show's more unsettling moments when they feature the show's more mysterious component of gods, spirits, and divination.  The art for these scenes are done with mesmerizing patterns and unsettling shapes and colors combined with a much darker color palette when compared to the rest of the art that I can't help but feel like wanting more.  It's not fantastic by art or animation standards, but these scenes really had me intrigued by what this series could've done with these concepts.  They don't use this style very often, and I really would've loved to see more of this contrast just so the story could've had a bit more oomph to its established lore.\\n\\n\r\nOverview:\\n\r\n+ Contrasted artstyle from its normal art\\n\r\n+/-  Rest of the artwork/animation is standard fare\\n\\n\r\nSound: The OST is nothing special.  Admittedly while both the OP and ED each have parts to them that are catchy, nothing about them screams memorable.  So in my opinion, not worth the time.\\n\\n\r\nPersonal Enjoyment: Urara Meirochou was a moe blob that I thought would have potential and was something I saw as something that could be potentially interesting.  I was wrong.  While there are parts of it that I liked, the show largely didn't have much of itself to be interesting, and I got bored of it pretty fast.  Regardless of how often they weaved the divination concept into the main story, very few things about it stood out to me.\\n\\n\r\nDid I like this series?\\n\\n\r\nI feel neither joy nor sorrow about this series.  Meh is about all I can say to explain it broadly.  In terms of specifics however, I like Kon as a character.  I don't know why; she was just that one character that I liked.  Maybe it's because I'm a fan of foxes and her entire character is wrapped around that concept (quite literally because her name is the sound that they believe foxes make).\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nIn terms of specifics, the two yuri guards that pop in as comic relief.  Characters whose entire character revolve around fawning over one character and how great they are shouldn't even be called people.  I hate them and the series would be much better off without them.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nEh...watch if you want is all I can say.  Honestly, the time spent watching this series could be better used on watching something else.  Meirochou doesn't really fulfill any kind of niche that other shows can fill, and you could find most if not all of its elements in other better shows.  Is Meirochou a bad show?  No.  Is it a good show?  No.  Is it ultimately worth your time?  Well, if you ask me, no.",
            "date": "2017-03-24T11:40:00+00:00",
            "helpful_count": 28,
            "mal_id": 243386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=243386"
        },
        {
            "content": "There’s no questioning how popular the cute girls doing cute things genre is and I can see why, for some people (me included) it is a very effective way to relax. Due to this popularity, many series of this genre exist out there, most them having a twist or two to differentiate themselves from each other but still having the same core. However, Urara Meirochou not only adds twists to differentiate itself from others, but it also takes the existing mold and adds a lot more to it.\r\nUrara Meirochou takes place in a traditional Japanese town of fortune tellers (uraras) called Meirochou, where the fourmain characters have recently started their studies to become top uraras. During this series we see all the adventures and trials these girls go through as we follow the journey these four girls go through to achieve their goals.\\n\\n\r\nDespite having a plot, this series is still a cute girls doing cute things anime at its core. Through-out the series the girls go on a little adventure and have cute and funny interactions with their surroundings, each other and other characters, things you would typically expect from a work of this genre. To make itself not stale, this series uses its setting as a major part of its events to make them more unique (such as fortune telling and working at a shop of magical items). Another aspect of this series is that it banks on its cuteness, which makes this not so much super funny (although there are still a lot of funny moments) but it allows it to be endearing and fun to watch. While it is fun and endearing to watch, the setting alone isn’t enough to make the events unique enough to separate itself from other shows of this genre, but luckily this isn’t the only angle this anime uses.  Despite this not being the most plot tight series in the world, the plot itself is not an afterthought as it plays a major role in why this series is good.  Although the plot is simple, what it does is it gives these characters’ goals that they want to achieve. This combined with the characters motivations creates a lot of heartwarming and emotional moments which are probably the best parts of this show and what truly separates it from other shows of this genre.\\n\\n\r\nThe characters themselves are perhaps the best aspect of this show. For a series in its genre, the characters of the main cast have a surprising amount of depth. On the surface, the main cast is nothing special, each one has a personality that one could expect from any series of this genre with one or two unique facets. However, it doesn’t just stop there with the characters, instead every member of the main cast is expanded upon. Each one of the four girls have their own motivations and is given a back story which is explored somewhat extensively, which not only explains the girls’ unique facets in their personality (such as Koume’s interest in the European life style) but it also what helps make these heartwarming and emotional moments so impactful.  The supporting cast is nothing too special (as they don’t really get a lot of screen time) but they do play their part in making this series as fun as it is, which is honestly all I can ask of a supporting cast of a series of this nature.\\n\\n\r\nUsually, a series in the cute girls doing cute things slice of life genre will have to rely a lot on character interactions as that is what most of this genre is about and this show delivers on that pretty well. Not only do the characters have great chemistry, they play off each other well, and as the series goes on we get to see the bond between these girls only get stronger. However, one weakness this show does have is it over uses Chiya a bit, most of the heartwarming moments that include character interactions include Chiya and it would have been nice to see more of the other characters in these moments to see the strengthening of the bonds between the others of the main cast. There also is a lot of yuri subtext, (which is very common in this genre these days) and this series executes on this aspect well as it does increase chemistry between characters. However, while I do think most fans of this genre enjoy that or are indifferent to it, this could also be a turn-off to some people.\\n\\n\r\nThe production values of this show, while it’s nothing spectacular, are better than average. The art style is very simple but it fits the cute style of the show and the color palette while being very light and having a very wide range of colors, is not over-saturated, instead the colors are very easy on the eyes which does enhance the viewing experience. The opening and ending are what one would typically expect with the opening being sung by the main cast and both songs fitting the series well, but not being anything too special. The background music, while not being anything too complex, was more than just the simple music you typically hear, some of the compositions are actually quite lengthy with multiple instruments and they all enhance the mood of each scene. The voice actors were pretty impressive in their roles, not only did their voice fit their characters but they also nailed how the characters would sound like in emotional moments, one example being was when Kon was crying, not only did her voice actor nail how a crying person would sound when they talked, she also nailed how they would sound when they are breathing.\\n\\n\r\nIn a sea of cute girls doing cute things anime, Urara Meirochou is definitely one of the better ones. In addition to being cute and endearing, the characters have depth and it is littered with heartwarming moments. While it is nothing ground breaking it executes well on all the main aspects of a series in its genre has and adds more to it.\\n\\n\r\nFinal Rating: A very strong 7/10\\n",
            "date": "2017-03-24T08:43:00+00:00",
            "helpful_count": 18,
            "mal_id": 243370,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=243370"
        },
        {
            "content": "-FULL REVIEW-\r\nWe have quite a few Slice of life anime aired this season and one of them is Urara Meirochou. A 12 episode series about a girl named Chiya arriving at the Labyrinth City in which her main objective is to find her mom who is living in the city and rising through the ranks of Urara.\r\nThe episode started off well with the introduction of the four main characters and their main purpose of why they are in Labyrinth City. With the all the episodes being aired, it’s great that the girls has been adapting to the city quite well and are aiming to getto the first district through challenges they're facing throughout the series, even passing one of the promotional test. As far as i could see, the series plot line is not too complex to understand as the story would continue where it left from the last episode. Sadly, as most anime has an episode limit cap (usually 12 to 13), the viewers didn’t have the chance to see the girls background though they did talk about it briefly, even finding Chiya’s mom is rather ended as cliffhanging, but at least there is hints given of how Chiya’s mom look like and her name of course. There would always be manga to continue where the episode left off so it’s a plus. The addition of comedy scenes is a plus sign to encourage the viewers to see more.\\n\\n\r\nThe studio that handles Urara Meirochou is JC Staff, the studio famous for producing ToraDora and Little Busters series. It's been a while since they produced a series with 4 girls since 2011 which is Joshiraku. Nevertheless, still quite impressed with the animation and character design of Urara Meirochou, very cute indeed. Background designs aren't that too saturated and there aren't any animation loopholes. \\n\\n\r\nP.S Koume kinda look like Nico from Love Live. +1 \\n\\n\r\nThe OP Song is very catchy and cute at the same time, love to listen it again. The ED song is also good to listen, match with the series genre. The seiyuus that are voice acting the four main characters are decent and has professionalism feel in it though they are not really well known and maybe new to the seiyuu industry, however they still did their job well and could have potential in getting more roles in the future, not much of a horrible or awkward voices heard throughout the series. Kon’s VA is pretty good at changing behaviours from being a playful vampire girl to obedient fox girl.  JC Staff is decent in choosing their seiyuus. \\n\\n\r\nThe characters in this series are really proactive and very eager to take challenges on what they are facing ahead of them, Chiya is considerably known for her playfulness and cuteness and mysterious (?), she tend to try to cheer up people who are in deepshit or really having a hard time. And is also cute that she tend to show her belly as a way to apologize people. Kon, one of my favorite girl for the series, not only because of how stunning she is when Koume tease fully wear sexy clothes which really match her doe, is due to her maturity and the leadership she had which she is potential for leading the team and getting the first rank urara. I love how shy she is when she being appraised on. Koume, due to the fact she look like Nico, couldn’t think but to call her Nico because of her hair style. She also has the ‘never give up’ motto which motivate the girls to work hard. Nono, well she’s quite cute, I couldn’t resist seeing her cute pity face. Overall, what I like the most about this girls are teamworking and also the ‘no man left behind’ first is what made me like this show, there are characters development in it and the background stories of them but with only brief brief explaination. \\n\\n\r\nI've enjoyed watching this show though not many people are anticipating on it as I've would like to know how the four girls would achieve in getting the first district and of course Chiya's main objective of finding her mom. Even tho, the series ended up short on the current manga, I still enjoy watching Urara Meichorou as in addition with that is the slice of life and comedy genre and how funny and cute the girls are. \\n\\n\r\nIt’s sad that the series wouldn’t get a second season however, the staff and the studio of the anime has done well to deliver a decent anime that is focusing more onto the girls everyday lives and challanges they're facing. Hence, I would recommend to viewers who are typically more into SOLs and the less intense type of genre, this would suit you and would fill up your spare time. \\n\\n\r\nHence to conclude, it’s a pretty decent anime with good deliverance for the viewers to watch, least JC managed to take a rest from doing ecchi intense genre for a while.\\n",
            "date": "2017-03-24T10:00:00+00:00",
            "helpful_count": 14,
            "mal_id": 243376,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=243376"
        },
        {
            "content": "we are having quite a fair share of slice of life anime this season and this anime is also one of them. \r\nLike any other slice of life, this anime focuses more on the character and their interactions rather than the story. The plot itself is quite simple, its about a girl chiya , who on turning 15 ,goes to meirochou (labyrinth town ) to learn the art of fortune telling. There she meets up with 3 other girls Koume , Kon and Nono . We follow their everyday lives as these girls try to achieve of their dreams of becoming fortune tellers.\r\nThe art andanimation for this anime is really good. The character design and background are all done really well. As expected from the masterfull hand of J.C Staff (P.S they are one of my favorite studios) \\n\\n\r\nthe music ,though being nothing special, is still pretty good. the OP is relly catchy and the ED is also good.\\n\\n\r\nOverall I really enjoyed this anime. If u are not a big fan slice of life ,unlike me, you might not enjoy this that much, but this anime is still worth watching.\\n",
            "date": "2017-02-05T02:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 239932,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5715004.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Aman_Bhaskar",
                "username": "Aman_Bhaskar"
            },
            "url": "https://myanimelist.net/reviews.php?id=239932"
        },
        {
            "content": "Intro \r\nUrara Meirocho is based off a rather short manga panel series and is a comedy/supernatural genre manga. The combination of having both comedy and supernatural within a manga series I felt was rather unique why was why I decided to give this series a try. I have not read the original source material that this anime is adapted from but after watching this im interested to read it.\r\n Story and setting \r\nUrara’s story is a fantasy world that looks similar to a fantasy version of ancient Japan with the story’s theme being divination. The story is largely set in the town of Meirocho thatis more well known as the Labyrinth town. Within the town are many diviners that are both divided by their skill level and by their divination practices with each rank of urara as the diviners are called being based in a specific sector. The anime follows the adventures of Four girls who come to the town in order to become urara’s with the main character Chiya hoping to become a first ranked Urara for a personal reason. \\n\r\nThe Divination that serves as the main subject for this anime is in reality almost a form of magic and can take a great many forms from the Crystal ball divination used by Tokie to Kokkuri and Tarot card divination used by Kon and Koume. According to the lore of the show Urara powers are limited to usage by woman with the earliest age of training to become one if one has the talent to be 15. This I felt was interesting as I would have thought that earlier ages would have been better. \\n\r\nAlthough the main topic of the anime is divination and learning to become good urara’s there are other themes that are also explored in urara such as friendship, the forging of bonds and overcoming of challenges with teamwork and intellect. These are part of the training that the four girls go through as they learn and bond with each other. The aspect of taking four strangers that all have one goal in mind and get them to work together is interesting as although they are rivals when they become top ranked urara’s when they are still in learning they can still become friends. Watching the girls who each have their own divination specialty and personality traits and forge friendships and bond with each other was a great thing to see. \\n\\n\\n\r\nChiya \\n\\n\r\nChiya voiced by new seiyuu Sayaka Harada in her second main role in her career is one of the main characters of the series and the main protagonist of the series. A 15-year-old year that grew up in the wild Chiya is a cheerful, positive and overactive girl that looks a bit like an animal due to the animal like ears and the tail that she has. Fast and agile Chiya is a relatively fast mover that is because of growing up with animals in the wild and can run on both the ground and on roofs in equal measure. Chiya has several notable traits that make her stand out with the first being that she hates wearing restrictive clothing which usually means any of the clothes that people wear in the town. In fact, Chiya wears her own outfit that is more suited to her personality which like the outfit is more open and emphasizes on freedom of movement. Her second trait is that as a result of growing up outside of populated areas Chiya’s understanding of how things work in towns such as the need to pay for something after you chosen to eat it is almost non-existent with the funniest part of this trait being how she apologizes in this case by showing her stomach and rubbing it. Though Chiya eventually learns about these things seeing it happen was just hilarious. In terms of character development Chiya actually gets developed pretty well with her recklessness and somewhat crazy habit of jumping on the roofs being curbed in gradually while making her more positive and caring towards her friends and allies. Unlike the other three girls at first Chiya did not have a specific divination specialty which made her somewhat less efficient than the other girls at times but this was offset by how hard she worked to study and the support of her friends and by the end of the series she too a power of sorts. All in all I felt that Chiya was a pretty good character and that her seiyuu Sayaka Harada despite being new did a pretty good job portraying her. \\n\\n\r\nKon \\n\r\nKon voiced by veteran seiyuu Kaede Hondo is one of the main characters of the series and is one of Chiya’s fellow rookie Urara’s. A 15-year-old girl like the rest of her fellow rookies Kon is an intelligent, focused and calm person that also has a studious and serious personality. Unlike Chiya who tends to spend more of her time having fun Kon prefers to spend her time studying and improving her divination skills.  However, while it’s easy to assume that these two characters may clash due to their different personalities its actually the opposite that happens. Due to Kon’s studious nature although she managed to learn a great deal when she was little this was at the cost of not having any close friends and as a result Kon does have trouble in making them. As a result, in the beginning of the series she had to battle between being studious and lonely and being loud and neglectful of her studies. This served as the main point of development for Kon’s character and in the end I was glad to see that she had adapted the middle ground between the two as her new personality with her still being serious and studious while at the same time taking the time out to help friends and be with them. Like all the girls Kon has her own specialized divination with Kon’s being Kokkuri divination. This form of divination I felt was actually quite interesting and funny in that what this essentially does is that Kon will summon a fox spirit through the use of a scroll that looks somewhat like a Ouija board and a movable object which in this case is a coin. Whats funny about this is that whenever Kon tries this she more often than not gets possessed by the spirit which has a rather spirited personality. While the spirit may appear haughty and dismissive of the girls its comical in that it always gets dominated by Chiya. Overall I thought that Kon was a pretty well designed character and that her seiyuu Hondo Kaede did a great job portraying her. \\n\\n\r\nKoume \\n\\n\r\nKoume voiced by veteran seiyuu Yurika Kubo of High school fleet fame is one of the main characters of the series and one of Chiya’s fellow Urara rookies. A positive, energetic and classy young girl that is from a relatively rich family Koume can be described as the image of a refined young lady. While appearing to be haughty and competitive at times Koume’s personality is rather simple in that while she doesn’t study as hard as Kon does or is as carefree as Chiya is she makes up for it by being diligent and hardworking when it counts and more importantly she cares about her friends and the friendships that they have formed. Besides Kon Koume is the one that knows more about Urara’s than the remaining girls and often Koume is the one that points out the facts that the others may be missing. Unlike the other girls that tend to dress conservatively in what can be considered the normal style of dress in the town Koume dresses in western dress which includes among others a corset and a skirt. This comes from the fact that Koume has a deep interest into western culture in part due to an encounter that she had in the past that led to her interest in divination. Like the other girls Koume has her own specialty in terms of divination with hers being tarot cards divination. Less often seen in Japan but more so outside of it Tarot cards are widely thought to have mythical powers so I thought that it was a good idea to an include a western divination method in for Koume as she is interested in western culture. Though all girls bring with them their own blend of comedic effect to the series Koume brings a lot with her usually wacky ideas or when her thoughts are visualized on screen.  All in all I thought Koume was a pretty well designed character and that her seiyuu Yurika Kubo did a great job voicing her. \\n\\n\\n\r\nNono \\n\\n\r\nNono voiced by veteran seiyuu Haruka Yoshimura of Asterisk wars fame is one of the main characters of the series and one of Chiya’s fellow rookie. The younger sister of the girl’s teacher Nina sensei Nono is a quiet, withdrawn and shy person which is a contrast to her sister who is positive, cheerful and talkative. However, while Nono can be quite shy and timid beneath that nature lies a fierce sense of determination that she can make use of when she’s brave enough. One of the main part of the series main plot line is the development of each of the characters through effective character development. At the start of the series Nono was quiet, shy and relatively timid and as a result she was unable to properly express her views and opinions to others that well. This caused a great deal for not just Chiya and her fellow Urara’s but also for her sister Nina as well. However, as the series goes on Nono eventually learns to become braver mostly due to Chiya’s help and she eventually is able to become a more talkative person and able to express her opinions more easily. Like all the girls Nono has some notable traits that make her stand out. The first is that despite her shy personality Nono has a pretty amazing singing voice which really surprised me when she sang for the first time. The second trait is Nono’s relationship with her doll that she uses as a medium for her divination. As with Chiya and the others Nono has her own Divination and arguably she has the most unique method. Nono’s method revolves around the use of her doll that she calls Matsuko that seems to be alive to a degree in that its able to perform actions on her own which includes assisting Nono with many different things. I feel that Nono’s seiyuu Haruka Yoshimura did a great job portraying Nono. \\n\\n\r\nNina \\n\\n\r\nNina voiced by veteran seiyuu Ai Kayano of Guilty crown and Anohana fame and one of my favourite seiyuu’s is one of the main support characters of the series serving as the girl’s master and teacher as they began to learn how to become a good urara. A rank 5 urara Nina is a positive, cheerful and caring person that apart from teaching the girls all they need to know about becoming a urara also cares deeply about each of them referring to them as her precious students. Equally strict and carefree Nina understands that sometimes they girls must take time to relax and not study every hour of the day and as such gives the girls some leeway in their behavior. However, Nina while rarely getting angry does do so on occasion which is more comical than serious. A notable trait of Nina is that when she gets drunk Nina becomes rather hyperactive and excitable which has the effect of making her look funny. Like all Urara Nina is specialized towards a certain discipline with hers being tea leaves divination. Overall I felt that Ai Kayano did a great job portraying Nina. \\n\\n\r\nTokie\\n\\n\r\nTokie played by veteran seiyuu Mamiko Noto of Persona 3 movies and Muv Luv alternative is a veteran urara and a rank 2 urara within the city and is a friend of Nina. Like Nina Tokie manages her own school of Urara and as such Nina and Tokie can be considered rivals. Not introduced until much later in the series Tokie is a powerful Urara that is also sassy and has a bit of a sadistic personality evident in the series final test. Despite that Tokie does care about the well-being of young urara’s and does try to rein this in when possible. A practitioner of the crystal ball divination which is arguably one of the most famous types of divination Tokie plays a important part in the plot in the latter part of the series. Though mainly a support character I felt that Mamiko Noto did a great job portraying Tokie and I hope to see her again in the sequel. \\n\\n\\n\r\nSaku \\n\\n\r\nSaku voiced by veteran seiyuu Ayaka Suwa of absolute Duo and Asterisk wars fame is one of the main support characters of the series. The commander of district 10’s guard and patrol force Saku and Nina are old friends and as such Saku also serves to guild and protect her charges. A dutiful, honorable and innocent person that believes heavily in law and justice and the fact that it’s the guards duties to protect the people of the district from harm. However, Saku usually has her hands full in not just dealing with criminals but also with her fan club subordinates and the antics of Nina’s students particularly Chiya. A running gag about Saku is that she gets embarrassed by Chiya just about every time she meets her and losing her usual calm composure. This I felt was quite funny. Additionally, Saku’s relationship with Nina is rather interesting as well. All in all I felt that Ayaka Suwa did a great job portraying Saku. \\n\\n\r\nArts and animation \\n\r\nThe arts and animation for the series I felt was good. The character designs for each of the characters was well done and designed and I liked the animation and the design of the town environments that the series takes part in. Animation itself was good and there was a wide range and balance of colors for the environments that were shown. \\n\\n\r\nMusic \\n\r\nMusic for the series I felt was good with the opening and ending themes being cheery and positive and catchy. \\n\\n\\n\\n\r\nVoice acting \\n\r\nVoice acting, I felt was pretty good in the series with each member of the cast doing an excellent job voicing their respective characters. Sayaka Harada, Kaeda Hondo, Yurika Kobo and Haruka Yoshimura who voiced the characters of Chiya, Kon, Koume and Nono respectively I felt deserve special praise as I felt that they were able to portray their characters reasonably well. \\n\\n\r\nOverall conclusion \\n\\n\r\nOverall I quite enjoyed Urara as I found the subject matter of Divination and the various divination methods that were shown in the anime to be quite interesting. The overall story as well as the characters that were in it I thought was pretty good and Chiya’s quest added a more personal stake into the story for her that I felt only enhanced the story and made it better. Character designs and voice acting were both things that I felt was pretty strong in this series as I liked that apart from their personalities each character was unique enough not just in terms of their divination skills but also in their character designs. As anime that contains both comedy and supernatural elements it must be able to balance out the two while also featuring enough of them to make a difference and in that o felt that it was successful. This is one anime that I hope will be one that gets a sequel as the series hints at the end. \\n\\n",
            "date": "2017-03-30T14:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 244046,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=244046"
        },
        {
            "content": "Fortune Telling with Cute Girls!\r\nSo another slice of life comedy anime with cute girls doing cute things done by JC Staff?, LA's in!\r\nSo for this kind of anime, the premise is very simple, of Chiya voiced by Sayaka Harada wanting to find her mother in the town of Meirochou, a fortune telling town where girls aspire to the be the best urara, she along with three others meets Chiya to be the best urara and for Chiya to find her mother.\r\nLet's talk about Urara Meirochou's character shall we?. Well let's start with Chiya, the main protagonist, she the wild card of the group, hyper genkiand tons of yuri undertoned moments all due to her experience in the wild, able to talk to animals, she is actually one of LA's favourite characters in the anime, mainly because she for one, gets the group together, her genkiness is NOT annoying for a main protagonist and her central focus of finding her mother comes into play and although some people might think her plotline in finding her mother gets \"serious & dark\" to say the least bringing in the mood shift at times, but for an anime about fortune telling and \"predictability\", Chiya's mother plotline is unpredictable to say the least and keeps you on your toes. Kon Tatsumi voiced by Kaede Hondo is the strict yet motherly type and has an affiliation with kitsune (it's in her name!) and she's quite easily the innocent fanservice girl of the group, she more or less keeps everyone else in line (usually Chiya and Koume) thus she's usually the tsukommi in the comedic stance. Next is the aforementioned Koume Yukimi voiced by Yurika Kubo, an outgoing girl affiliated with witchcraft and along with Chiya is the more \"rambunctious\" of the group and because of that she's usually the boke at times but can occasionally be the tsukommi if only for character jabbing. Finally for our main cast is Nono Natsume voiced by Haruka Yoshimura, the younger sister to Nina voiced by Ai Kayano, the main cast's urara teacher, Nono is the extremely shy one and her wanting to be a urara is so that she can better herself out of her shy persona (typical)...she was LA's least favourite character because of this. The other characters include Nina, Saku Iroi voiced by Ayaka Suwa, the Captain of the patrol unit of Meirochou and is the target of affection of her deputies Ooshima voiced by Yuka Takakura and Shiozawa voiced by Hitomi Sasaki and Saku and Nina have some yuri undertones from time to time just like the main cast's chemistry...as for Saku with Ooshima and Shiozawa it's pretty much blatant. \\n\\n\r\nLA will say this easily but if an anime like this doesn't have good character chemistry it fails, however this anime from the main cast to it's minor cast have VERY much a strong chemistry with one another be it character-wise or in the comedic stance. On speaking of which...\\n\\n\r\nThe comedy is very much character jabbing punchlines to some blatant yuri undertoned punchlines for the most part, but the characters themselves really work in the comedic moments quite well, even if some of the comedic moments have the characters go through some fanservice, the fanservice is light but instigates the yuri alarm bells quite a lot for that kind of fanservice either way.\\n\\n\r\nIn terms of animation by JC Staff, the animation is expected to be moe as hell, but the animation utilized many other styles such as using pastel or watercolored backgrounding here and there to make the anime vibrant and lively to say the least even making the character designs look polished and expectedly moe. Expected that the comedic moe moments have chibi/chibi face for expressions here and there as well. JC Staff may have done lots of animes for Winter 2017, and LA can easily see where they are dedicating the most in animation in Urara Meirochou. Very well done animation for JC Staff, even for a slice of life 4-koma anime adaptation.\\n\\n\r\nIn terms of voice acting, the acting ranges from squeaky as hell to acceptably moe and that range respectively goes...Haruka Yoshimura to Sayaka Harada. LA really had a problem with Haruka Yoshimura as her level of \"squeak\" is prevalent and permanent to the point LA got struck with diabetes whenever Haruka spoke, but her moeness somehow kept her vocals in check to the point of NOT being annoying. Kaede Hondo and Yurika Kubo did acceptable enough but LA's favourite voice actor goes to Sayaka Harada as Chiya, her moeness and genkiness were balanced enough to never be annoying and LA found her genki cadence smooth yet wild making her rather unpredictable thus expanding her range...especially for a recently rookie seiyuu.\\n\\n\r\nLike the town of Meirochou, like the urara who wants to be the best, Urara Meirochou as a slice of life comedy anime with cute girls wanting to be the best fortune tellers, this slice of life anime may have the trappings of it's genre, but it has an unpredictability factor with it's main protagonist and us wanting to find more about Chiya's mother being the central focus and sure the anime \"might\" have some filler episodes in the form of one-shot lessons about fortune telling, but this being an anime ABOUT fortune telling, it's not necessarily filler not to mention we get some insight to the main cast and as to why they want to even become urara in the first place!. If you need a slice of life comedy, a breather anime let alone one of the \"cutest\" animes from Winter 2017, then LA will easily recommend Urara Meirochou. JC Staff is getting a rather massive streak in making decent slice of life comedy animes as LA writes this review and Urara Meirchou is no exception...",
            "date": "2017-03-24T18:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 243432,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=243432"
        },
        {
            "content": "Seriously Urara Meirochou is cataloged as an anime \"Seinen\"? WTF? This Seinen has nothing,it seems more a comedy a little fun with Lolis and Shoujo ai.\r\nThe story of a group of friends who live in a city full of women (seriously no men) where they sought to become a kind of witch guessing known as \"Urara\" to achieve their different personal goals. It's actually simpler than it sounds.\r\nThe art is not bad, the characters are similar to Manga, although they abuse much of the miniatures in certain parts, but it is not something that greatly affects the story.\r\nI found the Sound Very good, not becauseits opening and ending are very good (they are regular, repetitive and sticky songs), but because it has the background sounds suitable for the comedy that is.\\n\\n\r\nAbout the characters the most outstanding of all is Chiya, his personality is the most striking, I think the rest of the characters could have something more of protagonism.\\n\\n\r\nOverall it's not a big anime but it made me have a good time (although I think this \"Incomplete\" story), I look forward to seeing the continuation of the story in a second season ....",
            "date": "2017-08-09T00:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 255027,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6025498.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rising_Sun",
                "username": "Rising_Sun"
            },
            "url": "https://myanimelist.net/reviews.php?id=255027"
        },
        {
            "content": "In the end, this is a \"cute girls doing cute things\" show at its core, nothing will change that and since most of us are veterans, we know what to expect and what not to expect from a show like that, saving us unnecessary annoyance when it lacks things shows like these doesn't offer.\r\nIt has a mediocre, average story at best, it's nothing special, there's this labyrinth city where everyone(only females there) wants to become \"urara\"(probably from the word \"uranaisha/uranaishi\" which means diviner, fortuneteller, soothsayer etc) and that's pretty much what it's about, they want to become able to divine things using the many differentgods, so we have a plethora of different systems, from kokkuri and star divining to tea reading and crystal balls. The main point is the ability to divine stuff in different ways, each having parts its strong and weak at. By the way, the western people have witches instead of urara. The mc is this white/silver haired girl that comes to find her mother which seems to be a first rate urara, she also conveniently can't enter the inner parts of the city because you get kicked out if you enter ward 9 when you're still just a level 10 urara(the levels are 1-10, with 10 being newbies). Everyone is just being jolly everyday while dealing with daily issues and the occasional \"drama\" event where something bad happens briefly and they bond or get some new powers. That's pretty much the gist of it all.\\n\\n\r\nThe art is pretty good and pleasing to the eyes, the sound is good enough. The characters are likable but of course shallow with a focus in cuteness and naivety. It's all about friendship and love as the characters are more tightly knit than gollum and the ring. Everyone has pretty much one or two character traits and doesn't really act outside of those limits. Still, none of them become obnoxious and we should've all known that the relationship would be overy cute and reasonably cheesy. It's supposed to be the story of a few girls bonding and having fun with a few added elements, like the mystery of the mc and who her mother is, what the power she has is and related things. We get some background information on pretty much every character of the main cast, so I feel closer than them than I do for most other shows, each of them has their own motivations and reasons, something we're allowed to know.\\n\\n\r\nThe comedy isn't too bad, it's more heartwarming than hilarious though. Sometimes it can be fairly funny, at the very least I chuckled a few times throughout the show. The comedy is pretty much never that intense in an anime/manga such as this, but there are a lot of light jokes going on, though it's mostly based on the \"cute girls doing silly/cute things\" gig. It can be somewhat repetitive since almost every single character just has a very limited amount of gags that they use over and over again in different situations. Like, the mc is beloved by animals and is wild and innocent, the other girl looks and sometimes acts like a fox and is uptight and serious, this other girl is very timid. The gags just revolve around their personalities and since they don't have deep or complex personalities, we end up with repeated jokes. It's not too bad though, I didn't feel bored of the comedy after 12 episodes, neither did the story overall bore me at all, something which is rare nowadays, I usually get the feeling that I just want it to freaking end already after watching twelve episodes of a show like this as if it's a chore, but I felt nothing like that here.\\n\\n\r\nI liked this anime quite a bit, it was relatively enjoyable. Maybe it was thanks to the fact that it's set in a fantasy world and that they're trying to become diviners. It allows for many situations that you don't usually find in other \"cute girls doing cute things\" anime, giving the show many reasonably fresh parts, it also has some mystery elements that other similar shows doesn't have, to the point that I'm fairly interested in knowing more about the mc's powers, her mother and the world itself. An anime gets much more interesting if you actually care about what's happening around the main cast. The scores for the story, sound and character is lower than 8, no doubt about it, it's pretty much just around average for everything but art, but my enjoyment was 8/10 and thus the overall gets to be 8/10 because a show like this is judged mainly by enjoyment, it's SUPPOSED to lack in other parts.\\n\\n\r\nI recommend this for anyone who likes \"cute girls doing cute things\" type anime, especially if you like fantasy as well.",
            "date": "2018-09-29T04:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 290347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=290347"
        },
        {
            "content": "At first glance, some people might think this anime is the same as any other of it's genre, but they couldn't be more wrong if they tried, this series is unique and we probably won't have something as good as this in a long time, and this is why:\r\nLet's start with the less remarkable part for me, the art, sure the show had high production values, that's expected from J.C. Staff, but it did nothing to make the art, well, outstanding, it was just there. The art of the manga is by far superior, so that's a good reason to read the manga after finishingthe anime.\\n\\n\r\nBut the art is the only thing I can say has flaws in this show.\\n\\n\r\nThe story. For starters, this show has a story, a plot, a main goal the cast of girls want to achieve and individual goals each of them have (besides all of them wanting to become first rank Ura, Chiya wants to find her mom, Kon wants to beat and be better than her mom, Koume wants to be the best so she can return to her loved witch, and Nono wants to stop relying on her big sister for everything) that's unexpected, that's more than any other show about an Slice of Life with cute girls has, sure there might be some exceptions that tried to have a plot too, but didn't executed nearly as well (Haifuri and Taroumaru Gurashi... I feel so bad for those poor shows.)\\n\\n\r\nThe thing that this show does well is mix and alternate between the slice of life and plot, and develop it successfully and with believable progression, so it never loses it's slice of life charm while at the same time giving the feeling that something happened. Sure most of the plot revolves around Chiya and the overall mystery that surrounds her character, but that's why this show did it so well, it stayed focused and knew what it wanted to do.\\n\\n\r\nThe sound. The OST reminds me of medieval RPGs, if I'd to compare it with something current I'd say it reminds me of Zelda: Breath of the Wild, which is a bit expected because Chiya is a wild feral girl, some tracks that were used to depict the city of Labyrinth Town fit right in the game, so if you liked the soundtrack of that, you'll love the soundtrack of this. There are other kind of tracks too, of course, the \"comedy tracks\" used in most slice of lifey moments and the \"serious tracks\" used in most plot heavy scenes, mostly revolving around Chiya and Kon. Which bring us to the next point.\\n\\n\r\nThe characters. Overall, the dynamic between all the four characters is unique because of how intimate they are and how casual they are about it, they aren't scared on touching each other bodies (Kon was only at the start) and this makes this cast different to any other cast you'll find in any other show of its genre.\\n\\n\r\nBut the characters individually.\\n\\n\r\nDon't get me wrong, Nono and Koume are great, they got some great moments and a bit of development, maybe Koume more than Nono, but besides episode 3 and 7, Koume was only used for comedy in all the other episodes. Which makes the rest of the show the Chiya & Kon show, feat. Koume, and it's great because all the characters played the roles they were supposed to play, so it's not the show's fault Koume and Nono got the short end of the stick, somebody had to put the comedy in this Slice of Life, Comedy show.\\n\\n\r\nBut I'm gonna focus on Chiya and Kon here.\\n\\n\r\nThis two play each other really well, at the start of the show, before we had any clue about Chiya, Kon seemed to be the most protagonistic of all of them, she had her main goal and worked the hardest to get there, after episode 5 Chiya started to show signs of why she's the protagonist (besides those yuri heavy scenes she had with Kon, Koume and Nono in episodes 2, 3 and 4 respectively) and in the same episode she started to have some influence in Kon, and suddenly that scene they had in episode 2 became a lot more important.\\n\\n\r\nKon used to think that the rules to do everything were set in stone, she did everything by the book and what she studied there was law. Even her train of thoughts for non-Urara related things were like that, she used to be worried of never getting married when Chiya lifted her skirt and ended blushing when they touched foreheads without even thinking of pulling back. Easily, she's the character that developed the most, thanks to her scenes with Chiya, like the soulmate scene, the incident with the kitsune spirit and everything about episode 8, she learned to rely on her and even got some traits from her, she learned to develop her own methods of divination instead of trying to memorize old ones and focused her hard work that was initially going nowhere into a better path that will hopefully actually help her achieve her dream. When she repeated at the end the thing Chiya told her in episode 8, I realized how much she had changed since the start of the show.\\n\\n\r\nChiya parallels directly with her, but at the same time she got her unique developments. As a good protagonist she's someone alpha that never gives up, she's not scared of even gods and she's willing to do anything to help her friends and find her mom. Which kinda made her have a rough start when she didn't care about the rules of the town and almost tried to sneak to different districts that she wasn't allowed to go in, she had to learn how things are done and what path take to accomplish her goal, which ended her giving some traits from Kon as seen in the kitsune spirit incident. After that she developed some sense of protectiveness when she promised to stay forever together with Kon, no matter what even the gods say, in one of the most romantic scenes ever done in any anime or manga. Later, with all the girls, she realized she didn't have her own divination method, but after a plot relevant incident in which she got more info from her mom, she found her own thanks to some family ties, even if she can't use it whenever she wants. I can say that Chiya's determination was the part that developed most from her during these 12 episodes.\\n\\n\r\nI don't think it's possible to enjoy a show more than I did this one, that's why I'm giving it a perfect 10/10",
            "date": "2017-03-25T10:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 243493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3028883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Anon028",
                "username": "Anon028"
            },
            "url": "https://myanimelist.net/reviews.php?id=243493"
        },
        {
            "content": "NOTE: this review is for my own personal use only. i've noticed after a while, i forget why i rated a show highly or poorly, so i'm going to write reviews after completing each series so i can reference them in the future.\r\nurara meirochou started off as a comfy \"cute girls doing cute things\" show, but my eyes quickly dulled after each episode had to have a bonding event. each and every episode had to have one character feel alone or out of place and then it has to end with someone crying and everyone saying \"we'll do it together\" or some bullshit like that.the whole \"friends give me strength\" thing is fine, albeit overused, but it was just so dumb and cheesy.\\n\\n\r\ntowards the end, we started to get some sprinkling of an underlying story, but of course it ends on a cliff hanger and refuses take itself seriously. in the middle of a major plot point, it hard cuts to a slapstick joke. it feels horribly out of pace and kills the mood and pacing. and it does this more than once in the same episode. in this regard, it follows the same pitfalls and many other slice of life shows: have your majority of the show be comfy and then force drama at the end, but don't have any form of conciseness. not to say that this will always kill a show for me, but it does leave a bad taste in my mouth ESPECIALLY when you tease me this hard. the problem is the show brings up something extremely interesting and starts to form a compelling story, just to spit in your face for getting your hopes up.\\n\\n\r\nthe characters are just merely caricatures. it's what i expected to begin with, given that it is a slice of life show. the characters don't change, but are given the illusion of change. for example, each character undergoes a moment when they \"realize\" that they can rely on their friends (or some similar epiphany) and this gives the illusion that our character has changed. but this doesn't change the way our character acts or how they interact with the others at all. regardless of this \"epiphany\", the character would still go to the ends of the earth for their friends and vice versa.\\n",
            "date": "2018-04-04T01:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 276818,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4787974.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rexosorous",
                "username": "Rexosorous"
            },
            "url": "https://myanimelist.net/reviews.php?id=276818"
        },
        {
            "content": "It feels good to watch the CGDCT genre (cute girls doing cute things) at the end of the day, after life punching you in the face. \r\nAs expected, the plot isn't a big thing, but it's comfortable to see these girls always having fun, always putting friendship in a high position along the episodes. The overcoming of Hinako talking to people is great, btw.\r\nThey also did a good job in art, all traces are beautiful and symmetrical, aesthetic goals.\r\nIn the general context, I'd recommend this anime if you don't want to worry about heavy plot or really deep characters.\r\n(characters may be a little bit sexualized,but if wasn't like this, probably wasn't anime)",
            "date": "2018-01-01T19:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 267145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6850455.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MagiMoe",
                "username": "MagiMoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=267145"
        },
        {
            "content": "I came into this with high hopes, Even with the mediocre score rating of 7.17. I was really surprised by how much i enjoyed it to be honest. I feel that the score isn't near to what this deserves.\r\nI heard this compared a couple times to Kobayashi-san Chi no Maid Dragon. I find it kind of unfair to compare them sense they both are different from each other with the only thing in common is Cast of Girls, Magical elements and that Art style is kind of similar. But if i were to compare them i don't think Kobayashi is as good as Urara Meirochou.I do enjoy Kobayashi a good amount. It used to be my only 10 rated show. But lately after further inspection i lowered it down to a 9 then just recently a 8. Only real thing i'd say Kobayashi has over this is that it uses a lot more adult humor and doesn't restrict itself as much.\\n\\n\r\n~~SPOILERS~~\\n\r\nThis show while does use a good amount of Cliches it's still very fun and good. Just because something uses a cliche doesn't make it bad. It depends on how it uses the cliche.\\n\\n\r\nThere is a lot that i love with this. The Cast,Art,Sounds and Comedy.\\n\\n\r\nWe have very lovable characters. Such as Chiya and Kon. Also have god like entities. Chiya herself is really fun and interesting to see and i wish we got too see more of her. Koun i believe is the name ( The fox looking creature that follows Chiya) We even have an enjoyable fox spirit that only possesses Kon. \\n\\n\r\nThere is also a lot of duo's you can't help but want to see together( It's even applied a couple times) Such as \\n\r\nChiyaxKon \\n\r\nSakuxNina \\n\\n\r\nKon and Chiya seem to be the real main character. With more focus on them than any other of the characters. I feel like this is a good thing too sense they are the two most interesting characters in the show.\\n\\n\r\nThere is one scene that both Chiya and Kon are doing this thing underwater and it is honestly kind of cool. I was half expecting them to use this as their excuse for a body swap episode between the two of them.\\n\\n\r\nOverall i really love this show and while i doubt it, I really hope for a 2nd season.",
            "date": "2017-11-20T20:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 263639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=263639"
        },
        {
            "content": "I'm not going to go too into depth with this review, I'll just put my thoughts down for this. Of course, there will be spoilers, but I'll try to keep them as vague as possible. \r\nI thoroughly enjoyed this anime, and felt that it was an adorable anime, with adorable characters, doing adorable things. The romance ships were there and the ending even supported some of them, and it had so much potential for a serious plot while remaining carefree and soft. \r\nHowever, the end of this anime has left me wanting so much more, but NOT in a good way. They started with thepremise of an adorable show with a lot of character development, with a potential for a serious story in the background, then discarded all of that for a slice-of-life show for most of the series. It remembered the story that had sunk into the background towards the end, and left nothing resolved.\\n\\n\r\nThe entire story revolves around the main character, Chiya, trying to find her mother. She also aspires to become a first-rank Urara to find her mother, if need be. Yet by the end of 12 full episodes, we learn very little of her mother, and she is barely even mentioned for the majority of the series. Most of the information we learn in episode 11. Episode 12 could have been spent finding heavy clues for her mother perhaps, or exploring where the future will take them, but instead it's spent with an obligatory bathhouse episode. Not going to say I don't appreciate it, but it felt like a waste of potential advancements.\\n\\n\r\nI genuinely hope a season 2 will happen to tie up the loose ends that are, honestly, the entire show. Next to none of the original plot points have been resolved, few have been furthered, and the show leaves a lot to be desired. However, despite the failed plotline of the entire show, there seemed to be plenty of character development, and that much I can appreciate.\\n\\n\r\nI still enjoyed it though, as it was very cute and I enjoyed watching the girls getting up to their antics. I just wish that the show could decide whether it wanted to be a cutesy slice-of-life anime, or something more serious. The show didn't decide in time, and failed to balance it out whatsoever. It seemed that they were trying to do far too much with the episode limit that they had. Perhaps making this a 24-episode anime would have been a great workaround for this problem? Regardless, I'm giving it a 6/10, because story is very important to me.",
            "date": "2017-04-12T21:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 245363,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Evladimira183",
                "username": "Evladimira183"
            },
            "url": "https://myanimelist.net/reviews.php?id=245363"
        },
        {
            "content": "MC , Chiya , went on a journey to find her mother at a place for Urara only. Urara means that some kind of priest.\r\nThere is nothing remarkable for songs/songtracks... won't leave deep impression but i guess is fine...\r\nThe voice actors did well toovoices will be saying them.\\n\\n\r\nTheir achievement is that they ranked up 1 level. From rookie to newbie.\\n\\n\r\nPersonally , i enjoy it a lot because it is really cute and refreshing to watch. Not really moe moe compared to kanna kamui , is just cute characters. Have a lot of fan services scenes.\\n\\n\r\nTry watching 1st episode and see whether you have da feel.. if don't have da feel to carry on then drop.. it doesn't really have its climax.. just really cute shit here.\\n",
            "date": "2017-04-06T19:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 244884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5519061.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ILoveOreImo",
                "username": "ILoveOreImo"
            },
            "url": "https://myanimelist.net/reviews.php?id=244884"
        },
        {
            "content": "I watched the first 3 episodes of Urara Meirochou before dropping it, but here's what I've got.\r\nStory & Characters: The story is simple and has some potential, but ultimately never goes through, ending up as another show that just forces the whole cute/moe/waifu material deal. The characters are stale and uninteresting like a 2 week old bread that has been standing outside through wind and weather, rain and sun, turning tough and chewy. There's no depth at all in any of the characters, and as the story relies heavily on the characters to move on, it stays pus.\r\nArt & Sound: Both the art style andsound are good, but at the same time feel kinda mediocre as it's about the same as we see in most shows nowadays.\\n\r\nOverall: The show isn't very bad in it's own rights, but doesn't really bring anything to the table either. This leaves, in my opinion, our hungry family of anime watchers to starve as we pursue, hopefully, quality. I just couldn't keep watching something that was only pointless moe feed.",
            "date": "2018-12-27T18:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 297108,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=297108"
        },
        {
            "content": "An anime of enjoyment and comedy, with some slice of life is such a great combination. In Urara Meirochou it shows great friendship with 4 girls that overcome problems together. A girl named Chiya goes to Labyrinth Town when she is at the age of 15, this young girl is friendly, outgoing with a strong heart that makes people smile around her, even though there are times she does make a phew problems. The absolute reason I liked this anime is because of the warm and cute friendship 4 girls show all throughout the episodes, especially when Chiya is making a ruckus and they arecaught in it. The characteristics of the other girls are Nono who is shy, caring and putting her friends before herself, Koume who likes teasing her friends, but doesn't like seeing them sad/depressed and then lastly Kon who is a young lady, likes working hard and can become shy/embarrassed easily. If you like anime with spirits, magic and witchery spells or divination with some comedy and cute girls, then this is the anime you could be looking for.",
            "date": "2018-01-19T21:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 269080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4928215.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Loveanime1213",
                "username": "Loveanime1213"
            },
            "url": "https://myanimelist.net/reviews.php?id=269080"
        },
        {
            "content": "This anime was surprisingly enjoyable. The characters were all cute, funny and interesting, with the main character, Chiya, being especially good. Chiya really brings all the characters together and is one of the best characters ive seen in a while. The show's cute character designs and art style, paired with the amazing opening and ending song really make the anime that much more enjoyable. \r\nThe only flaw in the anime would have to be the story. While it is very intriguing, it is far from finished. The show really grabs the attention of the viewer and makes them want to find out how the storyunfolds. Sadly though it seems to be about 1/10th done with the story and the original material is still publishing so it's really disappointing. The anime does have a good ending, which is enough to satisfy the viewer and not leave them at a complete loss. Also, the ending of the story (past the anime) seems fairly predictable and it is quite easy to see how it would unfold. But we are still missing out on the journey of the main cast.\\n\\n\r\nOverall, i highly recommend this show to anyone. The sound, characters and art style all fit perfectly together. It's intriguing story is amazing, but also it's only downfall. But with the satisfying ending, it makes the anime worth while. \\n",
            "date": "2017-11-14T04:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 263198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4830357.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Everlasting-",
                "username": "-Everlasting-"
            },
            "url": "https://myanimelist.net/reviews.php?id=263198"
        },
        {
            "content": "Story:\r\nDoesn't really have a story here, is just bunch of cute girls doing cute things to entertain us! \r\nArt:\r\nVery pleasing to look at, the girls are all kawaii enough to make you ***. I also quite like the color scheme of the overall show\r\nSound:\r\nAn above average soundtrack, won't buy it with real cash but will definately listen to it sometime\r\nCharacter:\r\nAll 4 girls have a pretty simple background, it doesn't go too deep or too sad! Some people might not like that but I'm fine with that since the story isn't really there anyway\r\nEnjoyment:\r\nVery enjoyable!! Is kinda like watching a bunch of kids just running aroundand doing funny things\\n\\n\r\nOverall: \\n\r\nIf your just searching for an anime to watch and giggle, you should not really think any further! The art and color scheme just did justice to the show for me. I will not recommend if your looking for a deep story here cause there is really none!",
            "date": "2017-06-23T00:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 250729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5914208.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PinkyForever",
                "username": "PinkyForever"
            },
            "url": "https://myanimelist.net/reviews.php?id=250729"
        }
    ],
    [
        {
            "content": "Why do you watch anime? Think about it for a second. We all have our own reasons to consume media. Different people will have different reasons but at the end of the day each of us has our own reason for watching anime. While entertainment is the main point of media like anime, for me it's more than just that. There are many things that I can do that are entertaining. For example shitposting is entertaining. But is it fulfilling? No, not really. Video games can be entertaining (Although they've fallen out of favor for me.), so if entertainment was the goal why not playone of those. For me, that would be board games. I love the challenges and strategies that are present in board games, and I personally find them entertaining. So if entertainment is the goal, then why anime specifically?\\n\\n\r\nThis is why shows like Konosuba end up getting 7's for me. They are funny and entertaining but the enjoyment ends once the episode does. And while that is worthwhile, I want something more. I feel like the unique experience that animation can bring is the ability to be sucked into a world and learn to love and care for those that inhabit it. There is richness in finding something that is loveable, something that doesn't just live in the experience but something that can be taken away from it. I feel like out of everything fiction is what best does that. And so when I deal with fiction, that is what I look for. Something that I can love completely. Something that makes me want to see every bit and moment of it. Something I can rewatch over and over again. Something where not only do I love the characters but I also have the characters play out in my mind doing random things. \\n\\n\r\nWhy do I tell you this? Because that is exactly what Urara was to me. Something that not only made me eagerly wait for each episode so I could watch in and see the characters I loved so much but something that made me want to think about it in my mind. Create works of it with what tools I could, and gush about it whenever and whatever I could. It's exactly what I wanted. But what makes it so good? Everything.\\n\\n\r\nCharacters and character interactions I would say are the most important part of CGDCT shows. How is one supposed to enjoy the cute things that the cute girls are doing if the characters aren't likeable? Furthermore character interactions is what helps supply the cuteness that makes these shows work so well. A CGDCT without interesting or likeable characters or with bad character interactions is going to be bad. So it's important that Urara does characters well. And it does!\\n\\n\r\nOur cast has quite a variety to it and while the girls may skate near common tropes they all have their own character traits that keep them away from being another iteration of those tropes. We have Chiya who is one of the funnest characters to get to watch. Despite being a feral child she's surprisingly wise about some things, as well as being a complete and total sweetheart.  At heart she is a feral child but she has her own fun quirks to her. The most notable one is that she loves bellies. She loves them a lot and likes to bring them up as much as possible. She also tends to be endlessly positive and sweet. That doesn't stop her from having some insecurities though.  Despite all her kind words and her acceptance of others. She has a reluctance to make herself vulnerable which adds another layer of interest to her, giving more depth to her character.\\n\\n\r\nKon is the character that I would say is the most interesting. At first glance she seems like a character modelled in the line of Mio from K-On! And she is, however she has her own depth and peculiarities to her that make her fun and unique. One interesting point about Kon is that while she certainly tries hard and does her best to study as much as possible she isn't portrayed as much smarter than the rest of the cast. Often times she'll fall into the same pitfalls that the rest of them do. Rather her skill and knowledge is from dedication through and through. \\n\\n\r\nKoume is the fun girl of the cast and overall I have a hard time pinning her down into any bracket. I guess mostly she is a tease and a Frenchaboo taken in via Marie's influence. She's not exactly a genki girl, that's more Chiya, but she does fit more onto the happy side. She's also quite interested in beauty despite being the one of the cast most interesting in eating sweets. Out of the cast she's the one I have the least of a handle on, although that's not due to any fault of her own. She does try hard herself despite trying to have fun when she can\\n\\n\r\nNono at first glance seems like a typical shy girl. She even spends the first half of the episode hiding behind her big sister. Given how shy characters in media are treated, she could have been yet another one of many shy characters whose main problem is not being social with others. These plots have been done over and over again almost repeated word for word. The shy character wants to have friends or get farther in life but they lack the courage, so the main characters work to give the shy character the push that they needs to be out in front. So of course Urara decides to... not do that at all. In fact, Nono's main development and push comes from the fact that she wants to be self-sufficient. It would be easy to rely on her friends to give her that push to be better. But instead most of her problems have to deal with her removing herself from the shadows of those around her and being truly by herself. It's a noble and interesting path of development for her, and it does also tackle the fact that she is shy. But that shyness is not treated as the only part of her character or even the main hurdle. This sets her character and development apart from others in a similar ilk.\\n\\n\r\nThe character interactions are a big highlight of the series. One thing I enjoyed from this show is how much the main cast cares about each other and the things that they're willing to do for each other. Take Chiya and her belly exposing habit. Most people would look down at her for doing that and call her a weird pervert. Judging from my high school experience she would be mocked totally and completely. And as seen in episode 1 they too think this trait is weird, and yet they embrace it. Sometimes they'll make a light little joke about it like Koume does at the beginning of episode 2. Or sometimes they'll reveal their own bellies as if that would be what Chiya does. They embrace the trait even though it's somewhat weird and out there, which shows a lot about their character. While a show could have gone for the route of making that characters trait into a joke for the other characters to laugh at, this show has the characters embrace it and take it into their own. In itself its already heartwarming to see these girls all with different backgrounds accepting each other for who they are and how they act even if they might not be normal. It's one of the great pleasures I got from this show.\\n\\n\r\nNote there is some nice yuri undertones as well, leading to hints towards some powerful relationships, but that all comes later in the series.\\n\\n\r\nAs you can see, the characters are great. But characters aren't everything, what about the plot. Now you might be asking yourself, plot? What's a plot? This is is a CGDCT show there isn't supposed to be any plot! But guess what there is a plot, and it's executed wonderfully.\\n\\n\r\nUrara revolves the four girls trying to become top ranking urara or diviners. This is a nice little plot that makes clear the motivations of the characters but yet also doesn't overshadow the tone of the show. Because the show is primarily about the fun things the girls do together it's good to have a plot that while there isn't taking up all the space and time but also provides a template for where the show is going, as well as a goal to strive for.\\n\\n\r\nThe way this is executed in my opinion is brilliant. Most of the episodes are those of the variety that would be light and fluffy. They don't have much plot dependence and for the most part they show the good times that the girls all have together. Sometimes a bit of key information will be leaked but the tone of these parts always stays on the fluffy side. These episodes give us the nice pleasant atmosphere that we are used to from CGDCT shows. The characters interact with each other, play off of each other. They learn about themselves and others, as well as study up on how to be better uraras. \\n\\n\r\nBut remember how I mentioned the plot? It's not just a book opener and a book ender. It's there for a reason. There are mysteries that lie beneath the show with regards to Chiya. Leaving a vile of intrigue under the wraps the show. There are several episodes where the struggles of the characters and more deeper issues come to the forefront. There are heartwarming moments between the characters due to the things that happen to them. Urara strikes the delicate balance between being lighthearted and having substance in it. For me it hits right into the sweet spot. It has just enough emotional moments and depth to be substance full yet it has enough playful times and fun bonding that makes it lighthearted and comfy. This allows the best of both worlds, both a deeper presence in the show but also the fun happy times that strike joy into one's heart. It's a mix that I find few shows are able to pull off well, and certainly most shows don't pull it off as well as Urara does. The pacing between these elements are also key. The more intense moments don't come out of nowhere. They are there for a reason and when watching it's clear why. Also it has a baseline of the happy moments so that one doesn't need to worry about the mysteries while the girls are having a fun time. Rather they are dealt with when they are needed to, which I feel like is the best wy to do this. It represents life and going through life in a balanced manner. Yes there are problems, and there are going to be bigger things that happen especially when they have such lofty goals. But there are also lots of fun times. And usually if things are good those fun times will be most of the times. And that's how it is here. It's a very nice balance.\\n\\n\r\nI also want to note that the plot itself (being the best Urara), and some of the more god based mysteries seems a bit shounen-esk. Personally, I like this mixture as it makes the show a bit more original and adds a nice flavor. I'm not a fan of shounen in general but I do like bits and pieces of it. So when some bits and pieces of it is added into a nice comfy show well it enhances the show. It's nice to have tropes and stylings taken from multiple genres imo, and I always do enjoy when a show is willing to borrow across like that rather than stick to what is most commonly found in the genre.\\n\\n\r\nI would like to sidestep for a moment and talk about fanservice. Fanservice is not always a liked thing in anime and some people are turned off by it. Because of this I'm sometimes hesitant to talk about the fanservice that is in Urara. But I would like to be complete in this so I will note there is fanservice. And guess what? It's not just that there is fanservice, but it's excellently done fanservice.\\n\\n\r\nWhat do I mean by that? Well, two things. First off most of the fanservice that is there is the natural kind. What is the natural kind? Take your average show with fanservice. How do they get there? There are common fanservice tropes like the accidental pervert, who'll trip onto some girls boobs, or the type where the camera magically tilts towards the girl's panties. These are what I'd call unnatural fanservice. IT's hard to imagine them happening in real life, and rather they feel forced into the narrative in order to provide something that would give the audience a rise. In Urara that is not the case for the most part. In fact most of the fanservice is caused by the girls themselves, and in most cases Chiya. \\n\\n\r\nChiya loves bellies. She loves them a lot Sometimes, she tries to do things to expose other's bellies. She also doesn't like clothes and sometimes makes innocent mistakes when she tries to check for tails. It's easy to see where some of these fanservice elements can arise from. And while they might not be what everyone wants to see, they are true to her character. Every one of her fanservice moments I can point out why she did what she did. It may not be what everyone would do. No, it most certainly wouldn't be but Chiya is Chiya, and that's fine. Furthermore, the other girls can help at times too. Whether it be them teasing each other or just having fun in general, the atmosphere that I get from these moments are ones that are fun more than anything. And the funness of those situations make as a viewer happy. It's what they want to do and how they choose to play around at times; I personally find nothing wrong with that. Sure sometimes there are sneaky crabs but for the most part it's the girls being themselves, and I like that.\\n\\n\r\nThe second reason I'd say Urara's fanservice is good is because it's original. There's lots of belly fanservice due to Chiya's quirk. But guess how much belly fanservice there usually is? Not much. Urara decides to go for its own unique corner to the fanservice and that I find it something much more respectable. Even if one doesn't like fanservice, I think one could appreciate they're at least doing something unique with it, as well as having it fit in with the characters, rather than it be the endless amounts of accidental perverts. \\n\\n\r\nThe sound quality of Urara is also top notch. The OST is solid and it's rare that the music doesn't match the mood. The Voice Actors shine in the show. The VA's of Chiya and Nono did a great job with giving them distinctive voices. It's easy to tell when they're talking since they sound so different. Nono's shy squeaky voice perfectly matches her character while Chiya's soft and soothing voice matches the kind personality that she radiates. The voices match so well and are so unique that it adds an extra layer to it. It's rare that I find voices that match so perfectly but for the case of Chiya and Nono they absolutely nailed it.\\n\\n\r\nThe art as well is a delight to see. The animation isn't the most technical or impressive but it fits well with the mood of the show. For example, the little chibi faces that they use may be a way to cut corners but they are cute and get across the feeling from the show. The backgrounds are often nicely done and add to the soft atmosphere that it has. The art is especially notable whenever they go into the mystical events of the show. The color choices during them and the execution of them make them such wonders to watch. The palettes use a mixture of soft but notable colors never stoking too far to go out of the boundaries. They capture that feel of mystery and supernatural in a way I feel like other shows don't. \\n\\n\r\nThat was a lot to cover. I usually don't do reviews this way. I tend to focus on everything that seemed notable to me. So then why did I try to write about everything. Well silly, it's because EVERYTHING SEEMED NOTABLE TO ME! That's just how good this show is. Characters, story, pacing, writing, sound, art everything fits together so well creating its own original little show. I never felt like Urara was like anything else, that may be due to my limited experience but it felt fresh and fun. \\n\\n\r\nTo be fair I tried to talk about the more objective components of why I liked this show. I also just want to note that this show was very much catered to my taste. I am biased and it's important that you're all aware of that. I still do think this show is masterfully done but it is a show that very much aligns with my interests. \\n\\n\r\nIt's been a while since I've been this excited each and every week for the newest episode. The last show I can think of that did that happens to be my favorite show of all time. I love everything about this show. And now that it's over I can make it official. Urara Meirochou is my 2nd favorite anime.\\n\\n\r\n10/10",
            "date": "2017-03-24T17:21:00+00:00",
            "helpful_count": 166,
            "mal_id": 243423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984878.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fircoal",
                "username": "Fircoal"
            },
            "url": "https://myanimelist.net/reviews.php?id=243423"
        },
        {
            "content": "Urara Meirochou.  Alright, you're a moe blob anime, what's your gimmick this time?  Let's see here...  Set in a town of 10 districts...  Divination...  Gods and spirits...?  And...lots of yuri baiting.  Alright well this is going to be a 'fun' venture, now isn't it?\r\nStory: Labyrinth Town is a town of fortune tellers where girls with spiritual powers starting at the age of fifteen come to the city with the prospect of becoming rank one urara, the highest rank of fortune teller that one can receive.  It's here where we meet Chiya, a girl raised in the woodswho comes to Labyrinth town to meet friends with the goal of becoming a rank one Urara in hopes of finding her mother.  \\n\\n\r\nUrara Meirochou is what one would expect coming into a moe show filled with cute girls.  The show has an all female cast, cute character antics between the four main characters (cause 4 is apparently the magic number for this), some fanservice for those who're fans of seeing animated underage girls with less than a full set of clothes on, and a large majority of pointless dialogue talking about how they're all friends and how happy they all are being with one another.  Standard fare, nothing special, so what does the show's gimmick, the divination and setting of Labyrinth town, add to the overall story?\\n\\n\r\nAs far as impact goes, the added story elements help to spice up the story just a little bit to make it a bit more than the basic moe blob formula.  The majority of the episodes feature the girls learning various forms of divination while providing both the audience and each other with backstories and slight development with their ultimate goal being \"we're going to be #1.\"  In addition, the story manages to sprinkle in moments of unease (contrary to what a happy go lucky show like this may have normally) and show how the gods and spirits of the town interact with the Urara to an extent that I honestly wasn't expecting at all from this series.  The contribution of these elements actually do help keep parts of the story to feel interesting, but what makes it disappointing is how uncommonly these elements, particularly revolving around the lore of Labyrinth Town, is used.  \\n\\n\r\nAs far as endings go, the show has what is known as a 'throwaway episode', where the story of what the cour wants to achieve has been told in full before the entire 12-13 episodes is completed, causing the creators to use the remaining time for a fluff episode that the story could just as easily go without, and it wouldn't make a difference.  I'm not a fan of throwaway episode, and it felt like I was just wasting my time to finish up all 12 episodes of this show.  \\n\\n\r\nUltimately, Urara Meirochou is what one would come to expect from a cute girl moe show with unrealized potential.  Largely focusing on moe antics, the rest of the series involving the lore of Labyrinth town and the secrets of the gods and spirits that reside over Labyrinth town go largely unnoticed, thus creating only specific moments of the series which I would say is even worth watching.  The divination aspect stays with the series throughout its runtime, and it's an ever-looming concept that's thankfully fully a part of the whole series, but at the same time, just like the show's other parts, doesn't get fully realized, thus relegating all of the show's unique elements to feel more like gimmicks than absolute necessary components of the main story.\\n\\n\r\nOverview:\\n\r\n+ Manages to integrate unique elements well\\n\r\n+/- Largely still moe-blob based\\n\r\n+/- Unique elements however don't feel fully realized\\n\r\n-  Throwaway episode at the end\\n\\n\r\nCharacters: The girls in these types of shows are usually only ankle deep in character.  And to be honest, Meirochou doesn't do anything that different.\\n\\n\r\nChiya, as the main character/girl of the series, can be summed up in just three words.  A feral child.  Raised in the woods, Chiya adopts the cheerful genki persona while adding a twist of woodland qualities by consistently showing off animal-like behavior whenever she interacts with the other characters in the series.  Her goal in the series is to find her mother, and, as expected of a short adaptation of an on-going series, does not happen.  (Gotta keep the readers reading.)  Beyond wanting to make friends with everything and trying to find her mom, there's really not much to say about Chiya.  Admittedly the fact that she has a motivation is commendable enough for a character in a moe show, but again, this is a case of \"They could've done more.\"\\n\\n\r\nThe other three girls, Kon, Koume, and Nono, can also be summed up in just a few words.  The hardworking fox, the witch, and the shy one respectively.  All three of these girls bear similar character depth as Chiya, and as far as characterization goes, only goes as far as a backstory to give the audience a little bit of a better understand for as to what is motivating these girls to move forward on their journey to become first rank Uraras.  Again, there's really not much to say here.  They're all cheerful friends with one another as expected, and the show's lack of conflict or its use of laughably easily resolved conflict in such a bright and cheery show make the viewing experience of these girls surprisingly dull.\\n\\n\r\nThe rest of the cast is relegated to the side and feature other girls/women who act mostly as comic relief or unreliable mentor-types to add a little more variety to the character types that we're given in this show.  You have the one who stands up for the law, the yuri fangirls, one who's a sadist cause why not, and a troublesome teacher.  Again, nothing too special, nothing really worth mentioning beyond this tiny, tiny paragraph, so we're going to move onto art.\\n\\n\r\nOverview:\\n\r\n+/-  Typical moe cast\\n\\n\r\nArt: Produced by J.C. Staff, Urara Meirochou has some pretty standard art for the company's track record.  Characters are drawn in your typical cutesy art style, the color palette is bright and shiny to give off that colorful and cheerful feel, and characters are given exaggerated faces complimented with background changes to signify comedy and other moments like those.  They also put the characters' faces dangerously close together so often to the point that I swear they were going to kiss at least once or twice.\\n\\n\r\nWhile the show's normal art has nothing too terribly special to mention, Urara has another style situated in the show's more unsettling moments when they feature the show's more mysterious component of gods, spirits, and divination.  The art for these scenes are done with mesmerizing patterns and unsettling shapes and colors combined with a much darker color palette when compared to the rest of the art that I can't help but feel like wanting more.  It's not fantastic by art or animation standards, but these scenes really had me intrigued by what this series could've done with these concepts.  They don't use this style very often, and I really would've loved to see more of this contrast just so the story could've had a bit more oomph to its established lore.\\n\\n\r\nOverview:\\n\r\n+ Contrasted artstyle from its normal art\\n\r\n+/-  Rest of the artwork/animation is standard fare\\n\\n\r\nSound: The OST is nothing special.  Admittedly while both the OP and ED each have parts to them that are catchy, nothing about them screams memorable.  So in my opinion, not worth the time.\\n\\n\r\nPersonal Enjoyment: Urara Meirochou was a moe blob that I thought would have potential and was something I saw as something that could be potentially interesting.  I was wrong.  While there are parts of it that I liked, the show largely didn't have much of itself to be interesting, and I got bored of it pretty fast.  Regardless of how often they weaved the divination concept into the main story, very few things about it stood out to me.\\n\\n\r\nDid I like this series?\\n\\n\r\nI feel neither joy nor sorrow about this series.  Meh is about all I can say to explain it broadly.  In terms of specifics however, I like Kon as a character.  I don't know why; she was just that one character that I liked.  Maybe it's because I'm a fan of foxes and her entire character is wrapped around that concept (quite literally because her name is the sound that they believe foxes make).\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nIn terms of specifics, the two yuri guards that pop in as comic relief.  Characters whose entire character revolve around fawning over one character and how great they are shouldn't even be called people.  I hate them and the series would be much better off without them.\\n\\n\r\nWould I recommend this series?\\n\\n\r\nEh...watch if you want is all I can say.  Honestly, the time spent watching this series could be better used on watching something else.  Meirochou doesn't really fulfill any kind of niche that other shows can fill, and you could find most if not all of its elements in other better shows.  Is Meirochou a bad show?  No.  Is it a good show?  No.  Is it ultimately worth your time?  Well, if you ask me, no.",
            "date": "2017-03-24T11:40:00+00:00",
            "helpful_count": 28,
            "mal_id": 243386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=243386"
        },
        {
            "content": "There’s no questioning how popular the cute girls doing cute things genre is and I can see why, for some people (me included) it is a very effective way to relax. Due to this popularity, many series of this genre exist out there, most them having a twist or two to differentiate themselves from each other but still having the same core. However, Urara Meirochou not only adds twists to differentiate itself from others, but it also takes the existing mold and adds a lot more to it.\r\nUrara Meirochou takes place in a traditional Japanese town of fortune tellers (uraras) called Meirochou, where the fourmain characters have recently started their studies to become top uraras. During this series we see all the adventures and trials these girls go through as we follow the journey these four girls go through to achieve their goals.\\n\\n\r\nDespite having a plot, this series is still a cute girls doing cute things anime at its core. Through-out the series the girls go on a little adventure and have cute and funny interactions with their surroundings, each other and other characters, things you would typically expect from a work of this genre. To make itself not stale, this series uses its setting as a major part of its events to make them more unique (such as fortune telling and working at a shop of magical items). Another aspect of this series is that it banks on its cuteness, which makes this not so much super funny (although there are still a lot of funny moments) but it allows it to be endearing and fun to watch. While it is fun and endearing to watch, the setting alone isn’t enough to make the events unique enough to separate itself from other shows of this genre, but luckily this isn’t the only angle this anime uses.  Despite this not being the most plot tight series in the world, the plot itself is not an afterthought as it plays a major role in why this series is good.  Although the plot is simple, what it does is it gives these characters’ goals that they want to achieve. This combined with the characters motivations creates a lot of heartwarming and emotional moments which are probably the best parts of this show and what truly separates it from other shows of this genre.\\n\\n\r\nThe characters themselves are perhaps the best aspect of this show. For a series in its genre, the characters of the main cast have a surprising amount of depth. On the surface, the main cast is nothing special, each one has a personality that one could expect from any series of this genre with one or two unique facets. However, it doesn’t just stop there with the characters, instead every member of the main cast is expanded upon. Each one of the four girls have their own motivations and is given a back story which is explored somewhat extensively, which not only explains the girls’ unique facets in their personality (such as Koume’s interest in the European life style) but it also what helps make these heartwarming and emotional moments so impactful.  The supporting cast is nothing too special (as they don’t really get a lot of screen time) but they do play their part in making this series as fun as it is, which is honestly all I can ask of a supporting cast of a series of this nature.\\n\\n\r\nUsually, a series in the cute girls doing cute things slice of life genre will have to rely a lot on character interactions as that is what most of this genre is about and this show delivers on that pretty well. Not only do the characters have great chemistry, they play off each other well, and as the series goes on we get to see the bond between these girls only get stronger. However, one weakness this show does have is it over uses Chiya a bit, most of the heartwarming moments that include character interactions include Chiya and it would have been nice to see more of the other characters in these moments to see the strengthening of the bonds between the others of the main cast. There also is a lot of yuri subtext, (which is very common in this genre these days) and this series executes on this aspect well as it does increase chemistry between characters. However, while I do think most fans of this genre enjoy that or are indifferent to it, this could also be a turn-off to some people.\\n\\n\r\nThe production values of this show, while it’s nothing spectacular, are better than average. The art style is very simple but it fits the cute style of the show and the color palette while being very light and having a very wide range of colors, is not over-saturated, instead the colors are very easy on the eyes which does enhance the viewing experience. The opening and ending are what one would typically expect with the opening being sung by the main cast and both songs fitting the series well, but not being anything too special. The background music, while not being anything too complex, was more than just the simple music you typically hear, some of the compositions are actually quite lengthy with multiple instruments and they all enhance the mood of each scene. The voice actors were pretty impressive in their roles, not only did their voice fit their characters but they also nailed how the characters would sound like in emotional moments, one example being was when Kon was crying, not only did her voice actor nail how a crying person would sound when they talked, she also nailed how they would sound when they are breathing.\\n\\n\r\nIn a sea of cute girls doing cute things anime, Urara Meirochou is definitely one of the better ones. In addition to being cute and endearing, the characters have depth and it is littered with heartwarming moments. While it is nothing ground breaking it executes well on all the main aspects of a series in its genre has and adds more to it.\\n\\n\r\nFinal Rating: A very strong 7/10\\n",
            "date": "2017-03-24T08:43:00+00:00",
            "helpful_count": 18,
            "mal_id": 243370,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=243370"
        },
        {
            "content": "-FULL REVIEW-\r\nWe have quite a few Slice of life anime aired this season and one of them is Urara Meirochou. A 12 episode series about a girl named Chiya arriving at the Labyrinth City in which her main objective is to find her mom who is living in the city and rising through the ranks of Urara.\r\nThe episode started off well with the introduction of the four main characters and their main purpose of why they are in Labyrinth City. With the all the episodes being aired, it’s great that the girls has been adapting to the city quite well and are aiming to getto the first district through challenges they're facing throughout the series, even passing one of the promotional test. As far as i could see, the series plot line is not too complex to understand as the story would continue where it left from the last episode. Sadly, as most anime has an episode limit cap (usually 12 to 13), the viewers didn’t have the chance to see the girls background though they did talk about it briefly, even finding Chiya’s mom is rather ended as cliffhanging, but at least there is hints given of how Chiya’s mom look like and her name of course. There would always be manga to continue where the episode left off so it’s a plus. The addition of comedy scenes is a plus sign to encourage the viewers to see more.\\n\\n\r\nThe studio that handles Urara Meirochou is JC Staff, the studio famous for producing ToraDora and Little Busters series. It's been a while since they produced a series with 4 girls since 2011 which is Joshiraku. Nevertheless, still quite impressed with the animation and character design of Urara Meirochou, very cute indeed. Background designs aren't that too saturated and there aren't any animation loopholes. \\n\\n\r\nP.S Koume kinda look like Nico from Love Live. +1 \\n\\n\r\nThe OP Song is very catchy and cute at the same time, love to listen it again. The ED song is also good to listen, match with the series genre. The seiyuus that are voice acting the four main characters are decent and has professionalism feel in it though they are not really well known and maybe new to the seiyuu industry, however they still did their job well and could have potential in getting more roles in the future, not much of a horrible or awkward voices heard throughout the series. Kon’s VA is pretty good at changing behaviours from being a playful vampire girl to obedient fox girl.  JC Staff is decent in choosing their seiyuus. \\n\\n\r\nThe characters in this series are really proactive and very eager to take challenges on what they are facing ahead of them, Chiya is considerably known for her playfulness and cuteness and mysterious (?), she tend to try to cheer up people who are in deepshit or really having a hard time. And is also cute that she tend to show her belly as a way to apologize people. Kon, one of my favorite girl for the series, not only because of how stunning she is when Koume tease fully wear sexy clothes which really match her doe, is due to her maturity and the leadership she had which she is potential for leading the team and getting the first rank urara. I love how shy she is when she being appraised on. Koume, due to the fact she look like Nico, couldn’t think but to call her Nico because of her hair style. She also has the ‘never give up’ motto which motivate the girls to work hard. Nono, well she’s quite cute, I couldn’t resist seeing her cute pity face. Overall, what I like the most about this girls are teamworking and also the ‘no man left behind’ first is what made me like this show, there are characters development in it and the background stories of them but with only brief brief explaination. \\n\\n\r\nI've enjoyed watching this show though not many people are anticipating on it as I've would like to know how the four girls would achieve in getting the first district and of course Chiya's main objective of finding her mom. Even tho, the series ended up short on the current manga, I still enjoy watching Urara Meichorou as in addition with that is the slice of life and comedy genre and how funny and cute the girls are. \\n\\n\r\nIt’s sad that the series wouldn’t get a second season however, the staff and the studio of the anime has done well to deliver a decent anime that is focusing more onto the girls everyday lives and challanges they're facing. Hence, I would recommend to viewers who are typically more into SOLs and the less intense type of genre, this would suit you and would fill up your spare time. \\n\\n\r\nHence to conclude, it’s a pretty decent anime with good deliverance for the viewers to watch, least JC managed to take a rest from doing ecchi intense genre for a while.\\n",
            "date": "2017-03-24T10:00:00+00:00",
            "helpful_count": 14,
            "mal_id": 243376,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=243376"
        },
        {
            "content": "we are having quite a fair share of slice of life anime this season and this anime is also one of them. \r\nLike any other slice of life, this anime focuses more on the character and their interactions rather than the story. The plot itself is quite simple, its about a girl chiya , who on turning 15 ,goes to meirochou (labyrinth town ) to learn the art of fortune telling. There she meets up with 3 other girls Koume , Kon and Nono . We follow their everyday lives as these girls try to achieve of their dreams of becoming fortune tellers.\r\nThe art andanimation for this anime is really good. The character design and background are all done really well. As expected from the masterfull hand of J.C Staff (P.S they are one of my favorite studios) \\n\\n\r\nthe music ,though being nothing special, is still pretty good. the OP is relly catchy and the ED is also good.\\n\\n\r\nOverall I really enjoyed this anime. If u are not a big fan slice of life ,unlike me, you might not enjoy this that much, but this anime is still worth watching.\\n",
            "date": "2017-02-05T02:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 239932,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5715004.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Aman_Bhaskar",
                "username": "Aman_Bhaskar"
            },
            "url": "https://myanimelist.net/reviews.php?id=239932"
        },
        {
            "content": "Intro \r\nUrara Meirocho is based off a rather short manga panel series and is a comedy/supernatural genre manga. The combination of having both comedy and supernatural within a manga series I felt was rather unique why was why I decided to give this series a try. I have not read the original source material that this anime is adapted from but after watching this im interested to read it.\r\n Story and setting \r\nUrara’s story is a fantasy world that looks similar to a fantasy version of ancient Japan with the story’s theme being divination. The story is largely set in the town of Meirocho thatis more well known as the Labyrinth town. Within the town are many diviners that are both divided by their skill level and by their divination practices with each rank of urara as the diviners are called being based in a specific sector. The anime follows the adventures of Four girls who come to the town in order to become urara’s with the main character Chiya hoping to become a first ranked Urara for a personal reason. \\n\r\nThe Divination that serves as the main subject for this anime is in reality almost a form of magic and can take a great many forms from the Crystal ball divination used by Tokie to Kokkuri and Tarot card divination used by Kon and Koume. According to the lore of the show Urara powers are limited to usage by woman with the earliest age of training to become one if one has the talent to be 15. This I felt was interesting as I would have thought that earlier ages would have been better. \\n\r\nAlthough the main topic of the anime is divination and learning to become good urara’s there are other themes that are also explored in urara such as friendship, the forging of bonds and overcoming of challenges with teamwork and intellect. These are part of the training that the four girls go through as they learn and bond with each other. The aspect of taking four strangers that all have one goal in mind and get them to work together is interesting as although they are rivals when they become top ranked urara’s when they are still in learning they can still become friends. Watching the girls who each have their own divination specialty and personality traits and forge friendships and bond with each other was a great thing to see. \\n\\n\\n\r\nChiya \\n\\n\r\nChiya voiced by new seiyuu Sayaka Harada in her second main role in her career is one of the main characters of the series and the main protagonist of the series. A 15-year-old year that grew up in the wild Chiya is a cheerful, positive and overactive girl that looks a bit like an animal due to the animal like ears and the tail that she has. Fast and agile Chiya is a relatively fast mover that is because of growing up with animals in the wild and can run on both the ground and on roofs in equal measure. Chiya has several notable traits that make her stand out with the first being that she hates wearing restrictive clothing which usually means any of the clothes that people wear in the town. In fact, Chiya wears her own outfit that is more suited to her personality which like the outfit is more open and emphasizes on freedom of movement. Her second trait is that as a result of growing up outside of populated areas Chiya’s understanding of how things work in towns such as the need to pay for something after you chosen to eat it is almost non-existent with the funniest part of this trait being how she apologizes in this case by showing her stomach and rubbing it. Though Chiya eventually learns about these things seeing it happen was just hilarious. In terms of character development Chiya actually gets developed pretty well with her recklessness and somewhat crazy habit of jumping on the roofs being curbed in gradually while making her more positive and caring towards her friends and allies. Unlike the other three girls at first Chiya did not have a specific divination specialty which made her somewhat less efficient than the other girls at times but this was offset by how hard she worked to study and the support of her friends and by the end of the series she too a power of sorts. All in all I felt that Chiya was a pretty good character and that her seiyuu Sayaka Harada despite being new did a pretty good job portraying her. \\n\\n\r\nKon \\n\r\nKon voiced by veteran seiyuu Kaede Hondo is one of the main characters of the series and is one of Chiya’s fellow rookie Urara’s. A 15-year-old girl like the rest of her fellow rookies Kon is an intelligent, focused and calm person that also has a studious and serious personality. Unlike Chiya who tends to spend more of her time having fun Kon prefers to spend her time studying and improving her divination skills.  However, while it’s easy to assume that these two characters may clash due to their different personalities its actually the opposite that happens. Due to Kon’s studious nature although she managed to learn a great deal when she was little this was at the cost of not having any close friends and as a result Kon does have trouble in making them. As a result, in the beginning of the series she had to battle between being studious and lonely and being loud and neglectful of her studies. This served as the main point of development for Kon’s character and in the end I was glad to see that she had adapted the middle ground between the two as her new personality with her still being serious and studious while at the same time taking the time out to help friends and be with them. Like all the girls Kon has her own specialized divination with Kon’s being Kokkuri divination. This form of divination I felt was actually quite interesting and funny in that what this essentially does is that Kon will summon a fox spirit through the use of a scroll that looks somewhat like a Ouija board and a movable object which in this case is a coin. Whats funny about this is that whenever Kon tries this she more often than not gets possessed by the spirit which has a rather spirited personality. While the spirit may appear haughty and dismissive of the girls its comical in that it always gets dominated by Chiya. Overall I thought that Kon was a pretty well designed character and that her seiyuu Hondo Kaede did a great job portraying her. \\n\\n\r\nKoume \\n\\n\r\nKoume voiced by veteran seiyuu Yurika Kubo of High school fleet fame is one of the main characters of the series and one of Chiya’s fellow Urara rookies. A positive, energetic and classy young girl that is from a relatively rich family Koume can be described as the image of a refined young lady. While appearing to be haughty and competitive at times Koume’s personality is rather simple in that while she doesn’t study as hard as Kon does or is as carefree as Chiya is she makes up for it by being diligent and hardworking when it counts and more importantly she cares about her friends and the friendships that they have formed. Besides Kon Koume is the one that knows more about Urara’s than the remaining girls and often Koume is the one that points out the facts that the others may be missing. Unlike the other girls that tend to dress conservatively in what can be considered the normal style of dress in the town Koume dresses in western dress which includes among others a corset and a skirt. This comes from the fact that Koume has a deep interest into western culture in part due to an encounter that she had in the past that led to her interest in divination. Like the other girls Koume has her own specialty in terms of divination with hers being tarot cards divination. Less often seen in Japan but more so outside of it Tarot cards are widely thought to have mythical powers so I thought that it was a good idea to an include a western divination method in for Koume as she is interested in western culture. Though all girls bring with them their own blend of comedic effect to the series Koume brings a lot with her usually wacky ideas or when her thoughts are visualized on screen.  All in all I thought Koume was a pretty well designed character and that her seiyuu Yurika Kubo did a great job voicing her. \\n\\n\\n\r\nNono \\n\\n\r\nNono voiced by veteran seiyuu Haruka Yoshimura of Asterisk wars fame is one of the main characters of the series and one of Chiya’s fellow rookie. The younger sister of the girl’s teacher Nina sensei Nono is a quiet, withdrawn and shy person which is a contrast to her sister who is positive, cheerful and talkative. However, while Nono can be quite shy and timid beneath that nature lies a fierce sense of determination that she can make use of when she’s brave enough. One of the main part of the series main plot line is the development of each of the characters through effective character development. At the start of the series Nono was quiet, shy and relatively timid and as a result she was unable to properly express her views and opinions to others that well. This caused a great deal for not just Chiya and her fellow Urara’s but also for her sister Nina as well. However, as the series goes on Nono eventually learns to become braver mostly due to Chiya’s help and she eventually is able to become a more talkative person and able to express her opinions more easily. Like all the girls Nono has some notable traits that make her stand out. The first is that despite her shy personality Nono has a pretty amazing singing voice which really surprised me when she sang for the first time. The second trait is Nono’s relationship with her doll that she uses as a medium for her divination. As with Chiya and the others Nono has her own Divination and arguably she has the most unique method. Nono’s method revolves around the use of her doll that she calls Matsuko that seems to be alive to a degree in that its able to perform actions on her own which includes assisting Nono with many different things. I feel that Nono’s seiyuu Haruka Yoshimura did a great job portraying Nono. \\n\\n\r\nNina \\n\\n\r\nNina voiced by veteran seiyuu Ai Kayano of Guilty crown and Anohana fame and one of my favourite seiyuu’s is one of the main support characters of the series serving as the girl’s master and teacher as they began to learn how to become a good urara. A rank 5 urara Nina is a positive, cheerful and caring person that apart from teaching the girls all they need to know about becoming a urara also cares deeply about each of them referring to them as her precious students. Equally strict and carefree Nina understands that sometimes they girls must take time to relax and not study every hour of the day and as such gives the girls some leeway in their behavior. However, Nina while rarely getting angry does do so on occasion which is more comical than serious. A notable trait of Nina is that when she gets drunk Nina becomes rather hyperactive and excitable which has the effect of making her look funny. Like all Urara Nina is specialized towards a certain discipline with hers being tea leaves divination. Overall I felt that Ai Kayano did a great job portraying Nina. \\n\\n\r\nTokie\\n\\n\r\nTokie played by veteran seiyuu Mamiko Noto of Persona 3 movies and Muv Luv alternative is a veteran urara and a rank 2 urara within the city and is a friend of Nina. Like Nina Tokie manages her own school of Urara and as such Nina and Tokie can be considered rivals. Not introduced until much later in the series Tokie is a powerful Urara that is also sassy and has a bit of a sadistic personality evident in the series final test. Despite that Tokie does care about the well-being of young urara’s and does try to rein this in when possible. A practitioner of the crystal ball divination which is arguably one of the most famous types of divination Tokie plays a important part in the plot in the latter part of the series. Though mainly a support character I felt that Mamiko Noto did a great job portraying Tokie and I hope to see her again in the sequel. \\n\\n\\n\r\nSaku \\n\\n\r\nSaku voiced by veteran seiyuu Ayaka Suwa of absolute Duo and Asterisk wars fame is one of the main support characters of the series. The commander of district 10’s guard and patrol force Saku and Nina are old friends and as such Saku also serves to guild and protect her charges. A dutiful, honorable and innocent person that believes heavily in law and justice and the fact that it’s the guards duties to protect the people of the district from harm. However, Saku usually has her hands full in not just dealing with criminals but also with her fan club subordinates and the antics of Nina’s students particularly Chiya. A running gag about Saku is that she gets embarrassed by Chiya just about every time she meets her and losing her usual calm composure. This I felt was quite funny. Additionally, Saku’s relationship with Nina is rather interesting as well. All in all I felt that Ayaka Suwa did a great job portraying Saku. \\n\\n\r\nArts and animation \\n\r\nThe arts and animation for the series I felt was good. The character designs for each of the characters was well done and designed and I liked the animation and the design of the town environments that the series takes part in. Animation itself was good and there was a wide range and balance of colors for the environments that were shown. \\n\\n\r\nMusic \\n\r\nMusic for the series I felt was good with the opening and ending themes being cheery and positive and catchy. \\n\\n\\n\\n\r\nVoice acting \\n\r\nVoice acting, I felt was pretty good in the series with each member of the cast doing an excellent job voicing their respective characters. Sayaka Harada, Kaeda Hondo, Yurika Kobo and Haruka Yoshimura who voiced the characters of Chiya, Kon, Koume and Nono respectively I felt deserve special praise as I felt that they were able to portray their characters reasonably well. \\n\\n\r\nOverall conclusion \\n\\n\r\nOverall I quite enjoyed Urara as I found the subject matter of Divination and the various divination methods that were shown in the anime to be quite interesting. The overall story as well as the characters that were in it I thought was pretty good and Chiya’s quest added a more personal stake into the story for her that I felt only enhanced the story and made it better. Character designs and voice acting were both things that I felt was pretty strong in this series as I liked that apart from their personalities each character was unique enough not just in terms of their divination skills but also in their character designs. As anime that contains both comedy and supernatural elements it must be able to balance out the two while also featuring enough of them to make a difference and in that o felt that it was successful. This is one anime that I hope will be one that gets a sequel as the series hints at the end. \\n\\n",
            "date": "2017-03-30T14:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 244046,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=244046"
        },
        {
            "content": "Fortune Telling with Cute Girls!\r\nSo another slice of life comedy anime with cute girls doing cute things done by JC Staff?, LA's in!\r\nSo for this kind of anime, the premise is very simple, of Chiya voiced by Sayaka Harada wanting to find her mother in the town of Meirochou, a fortune telling town where girls aspire to the be the best urara, she along with three others meets Chiya to be the best urara and for Chiya to find her mother.\r\nLet's talk about Urara Meirochou's character shall we?. Well let's start with Chiya, the main protagonist, she the wild card of the group, hyper genkiand tons of yuri undertoned moments all due to her experience in the wild, able to talk to animals, she is actually one of LA's favourite characters in the anime, mainly because she for one, gets the group together, her genkiness is NOT annoying for a main protagonist and her central focus of finding her mother comes into play and although some people might think her plotline in finding her mother gets \"serious & dark\" to say the least bringing in the mood shift at times, but for an anime about fortune telling and \"predictability\", Chiya's mother plotline is unpredictable to say the least and keeps you on your toes. Kon Tatsumi voiced by Kaede Hondo is the strict yet motherly type and has an affiliation with kitsune (it's in her name!) and she's quite easily the innocent fanservice girl of the group, she more or less keeps everyone else in line (usually Chiya and Koume) thus she's usually the tsukommi in the comedic stance. Next is the aforementioned Koume Yukimi voiced by Yurika Kubo, an outgoing girl affiliated with witchcraft and along with Chiya is the more \"rambunctious\" of the group and because of that she's usually the boke at times but can occasionally be the tsukommi if only for character jabbing. Finally for our main cast is Nono Natsume voiced by Haruka Yoshimura, the younger sister to Nina voiced by Ai Kayano, the main cast's urara teacher, Nono is the extremely shy one and her wanting to be a urara is so that she can better herself out of her shy persona (typical)...she was LA's least favourite character because of this. The other characters include Nina, Saku Iroi voiced by Ayaka Suwa, the Captain of the patrol unit of Meirochou and is the target of affection of her deputies Ooshima voiced by Yuka Takakura and Shiozawa voiced by Hitomi Sasaki and Saku and Nina have some yuri undertones from time to time just like the main cast's chemistry...as for Saku with Ooshima and Shiozawa it's pretty much blatant. \\n\\n\r\nLA will say this easily but if an anime like this doesn't have good character chemistry it fails, however this anime from the main cast to it's minor cast have VERY much a strong chemistry with one another be it character-wise or in the comedic stance. On speaking of which...\\n\\n\r\nThe comedy is very much character jabbing punchlines to some blatant yuri undertoned punchlines for the most part, but the characters themselves really work in the comedic moments quite well, even if some of the comedic moments have the characters go through some fanservice, the fanservice is light but instigates the yuri alarm bells quite a lot for that kind of fanservice either way.\\n\\n\r\nIn terms of animation by JC Staff, the animation is expected to be moe as hell, but the animation utilized many other styles such as using pastel or watercolored backgrounding here and there to make the anime vibrant and lively to say the least even making the character designs look polished and expectedly moe. Expected that the comedic moe moments have chibi/chibi face for expressions here and there as well. JC Staff may have done lots of animes for Winter 2017, and LA can easily see where they are dedicating the most in animation in Urara Meirochou. Very well done animation for JC Staff, even for a slice of life 4-koma anime adaptation.\\n\\n\r\nIn terms of voice acting, the acting ranges from squeaky as hell to acceptably moe and that range respectively goes...Haruka Yoshimura to Sayaka Harada. LA really had a problem with Haruka Yoshimura as her level of \"squeak\" is prevalent and permanent to the point LA got struck with diabetes whenever Haruka spoke, but her moeness somehow kept her vocals in check to the point of NOT being annoying. Kaede Hondo and Yurika Kubo did acceptable enough but LA's favourite voice actor goes to Sayaka Harada as Chiya, her moeness and genkiness were balanced enough to never be annoying and LA found her genki cadence smooth yet wild making her rather unpredictable thus expanding her range...especially for a recently rookie seiyuu.\\n\\n\r\nLike the town of Meirochou, like the urara who wants to be the best, Urara Meirochou as a slice of life comedy anime with cute girls wanting to be the best fortune tellers, this slice of life anime may have the trappings of it's genre, but it has an unpredictability factor with it's main protagonist and us wanting to find more about Chiya's mother being the central focus and sure the anime \"might\" have some filler episodes in the form of one-shot lessons about fortune telling, but this being an anime ABOUT fortune telling, it's not necessarily filler not to mention we get some insight to the main cast and as to why they want to even become urara in the first place!. If you need a slice of life comedy, a breather anime let alone one of the \"cutest\" animes from Winter 2017, then LA will easily recommend Urara Meirochou. JC Staff is getting a rather massive streak in making decent slice of life comedy animes as LA writes this review and Urara Meirchou is no exception...",
            "date": "2017-03-24T18:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 243432,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=243432"
        },
        {
            "content": "Seriously Urara Meirochou is cataloged as an anime \"Seinen\"? WTF? This Seinen has nothing,it seems more a comedy a little fun with Lolis and Shoujo ai.\r\nThe story of a group of friends who live in a city full of women (seriously no men) where they sought to become a kind of witch guessing known as \"Urara\" to achieve their different personal goals. It's actually simpler than it sounds.\r\nThe art is not bad, the characters are similar to Manga, although they abuse much of the miniatures in certain parts, but it is not something that greatly affects the story.\r\nI found the Sound Very good, not becauseits opening and ending are very good (they are regular, repetitive and sticky songs), but because it has the background sounds suitable for the comedy that is.\\n\\n\r\nAbout the characters the most outstanding of all is Chiya, his personality is the most striking, I think the rest of the characters could have something more of protagonism.\\n\\n\r\nOverall it's not a big anime but it made me have a good time (although I think this \"Incomplete\" story), I look forward to seeing the continuation of the story in a second season ....",
            "date": "2017-08-09T00:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 255027,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6025498.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rising_Sun",
                "username": "Rising_Sun"
            },
            "url": "https://myanimelist.net/reviews.php?id=255027"
        },
        {
            "content": "In the end, this is a \"cute girls doing cute things\" show at its core, nothing will change that and since most of us are veterans, we know what to expect and what not to expect from a show like that, saving us unnecessary annoyance when it lacks things shows like these doesn't offer.\r\nIt has a mediocre, average story at best, it's nothing special, there's this labyrinth city where everyone(only females there) wants to become \"urara\"(probably from the word \"uranaisha/uranaishi\" which means diviner, fortuneteller, soothsayer etc) and that's pretty much what it's about, they want to become able to divine things using the many differentgods, so we have a plethora of different systems, from kokkuri and star divining to tea reading and crystal balls. The main point is the ability to divine stuff in different ways, each having parts its strong and weak at. By the way, the western people have witches instead of urara. The mc is this white/silver haired girl that comes to find her mother which seems to be a first rate urara, she also conveniently can't enter the inner parts of the city because you get kicked out if you enter ward 9 when you're still just a level 10 urara(the levels are 1-10, with 10 being newbies). Everyone is just being jolly everyday while dealing with daily issues and the occasional \"drama\" event where something bad happens briefly and they bond or get some new powers. That's pretty much the gist of it all.\\n\\n\r\nThe art is pretty good and pleasing to the eyes, the sound is good enough. The characters are likable but of course shallow with a focus in cuteness and naivety. It's all about friendship and love as the characters are more tightly knit than gollum and the ring. Everyone has pretty much one or two character traits and doesn't really act outside of those limits. Still, none of them become obnoxious and we should've all known that the relationship would be overy cute and reasonably cheesy. It's supposed to be the story of a few girls bonding and having fun with a few added elements, like the mystery of the mc and who her mother is, what the power she has is and related things. We get some background information on pretty much every character of the main cast, so I feel closer than them than I do for most other shows, each of them has their own motivations and reasons, something we're allowed to know.\\n\\n\r\nThe comedy isn't too bad, it's more heartwarming than hilarious though. Sometimes it can be fairly funny, at the very least I chuckled a few times throughout the show. The comedy is pretty much never that intense in an anime/manga such as this, but there are a lot of light jokes going on, though it's mostly based on the \"cute girls doing silly/cute things\" gig. It can be somewhat repetitive since almost every single character just has a very limited amount of gags that they use over and over again in different situations. Like, the mc is beloved by animals and is wild and innocent, the other girl looks and sometimes acts like a fox and is uptight and serious, this other girl is very timid. The gags just revolve around their personalities and since they don't have deep or complex personalities, we end up with repeated jokes. It's not too bad though, I didn't feel bored of the comedy after 12 episodes, neither did the story overall bore me at all, something which is rare nowadays, I usually get the feeling that I just want it to freaking end already after watching twelve episodes of a show like this as if it's a chore, but I felt nothing like that here.\\n\\n\r\nI liked this anime quite a bit, it was relatively enjoyable. Maybe it was thanks to the fact that it's set in a fantasy world and that they're trying to become diviners. It allows for many situations that you don't usually find in other \"cute girls doing cute things\" anime, giving the show many reasonably fresh parts, it also has some mystery elements that other similar shows doesn't have, to the point that I'm fairly interested in knowing more about the mc's powers, her mother and the world itself. An anime gets much more interesting if you actually care about what's happening around the main cast. The scores for the story, sound and character is lower than 8, no doubt about it, it's pretty much just around average for everything but art, but my enjoyment was 8/10 and thus the overall gets to be 8/10 because a show like this is judged mainly by enjoyment, it's SUPPOSED to lack in other parts.\\n\\n\r\nI recommend this for anyone who likes \"cute girls doing cute things\" type anime, especially if you like fantasy as well.",
            "date": "2018-09-29T04:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 290347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=290347"
        },
        {
            "content": "At first glance, some people might think this anime is the same as any other of it's genre, but they couldn't be more wrong if they tried, this series is unique and we probably won't have something as good as this in a long time, and this is why:\r\nLet's start with the less remarkable part for me, the art, sure the show had high production values, that's expected from J.C. Staff, but it did nothing to make the art, well, outstanding, it was just there. The art of the manga is by far superior, so that's a good reason to read the manga after finishingthe anime.\\n\\n\r\nBut the art is the only thing I can say has flaws in this show.\\n\\n\r\nThe story. For starters, this show has a story, a plot, a main goal the cast of girls want to achieve and individual goals each of them have (besides all of them wanting to become first rank Ura, Chiya wants to find her mom, Kon wants to beat and be better than her mom, Koume wants to be the best so she can return to her loved witch, and Nono wants to stop relying on her big sister for everything) that's unexpected, that's more than any other show about an Slice of Life with cute girls has, sure there might be some exceptions that tried to have a plot too, but didn't executed nearly as well (Haifuri and Taroumaru Gurashi... I feel so bad for those poor shows.)\\n\\n\r\nThe thing that this show does well is mix and alternate between the slice of life and plot, and develop it successfully and with believable progression, so it never loses it's slice of life charm while at the same time giving the feeling that something happened. Sure most of the plot revolves around Chiya and the overall mystery that surrounds her character, but that's why this show did it so well, it stayed focused and knew what it wanted to do.\\n\\n\r\nThe sound. The OST reminds me of medieval RPGs, if I'd to compare it with something current I'd say it reminds me of Zelda: Breath of the Wild, which is a bit expected because Chiya is a wild feral girl, some tracks that were used to depict the city of Labyrinth Town fit right in the game, so if you liked the soundtrack of that, you'll love the soundtrack of this. There are other kind of tracks too, of course, the \"comedy tracks\" used in most slice of lifey moments and the \"serious tracks\" used in most plot heavy scenes, mostly revolving around Chiya and Kon. Which bring us to the next point.\\n\\n\r\nThe characters. Overall, the dynamic between all the four characters is unique because of how intimate they are and how casual they are about it, they aren't scared on touching each other bodies (Kon was only at the start) and this makes this cast different to any other cast you'll find in any other show of its genre.\\n\\n\r\nBut the characters individually.\\n\\n\r\nDon't get me wrong, Nono and Koume are great, they got some great moments and a bit of development, maybe Koume more than Nono, but besides episode 3 and 7, Koume was only used for comedy in all the other episodes. Which makes the rest of the show the Chiya & Kon show, feat. Koume, and it's great because all the characters played the roles they were supposed to play, so it's not the show's fault Koume and Nono got the short end of the stick, somebody had to put the comedy in this Slice of Life, Comedy show.\\n\\n\r\nBut I'm gonna focus on Chiya and Kon here.\\n\\n\r\nThis two play each other really well, at the start of the show, before we had any clue about Chiya, Kon seemed to be the most protagonistic of all of them, she had her main goal and worked the hardest to get there, after episode 5 Chiya started to show signs of why she's the protagonist (besides those yuri heavy scenes she had with Kon, Koume and Nono in episodes 2, 3 and 4 respectively) and in the same episode she started to have some influence in Kon, and suddenly that scene they had in episode 2 became a lot more important.\\n\\n\r\nKon used to think that the rules to do everything were set in stone, she did everything by the book and what she studied there was law. Even her train of thoughts for non-Urara related things were like that, she used to be worried of never getting married when Chiya lifted her skirt and ended blushing when they touched foreheads without even thinking of pulling back. Easily, she's the character that developed the most, thanks to her scenes with Chiya, like the soulmate scene, the incident with the kitsune spirit and everything about episode 8, she learned to rely on her and even got some traits from her, she learned to develop her own methods of divination instead of trying to memorize old ones and focused her hard work that was initially going nowhere into a better path that will hopefully actually help her achieve her dream. When she repeated at the end the thing Chiya told her in episode 8, I realized how much she had changed since the start of the show.\\n\\n\r\nChiya parallels directly with her, but at the same time she got her unique developments. As a good protagonist she's someone alpha that never gives up, she's not scared of even gods and she's willing to do anything to help her friends and find her mom. Which kinda made her have a rough start when she didn't care about the rules of the town and almost tried to sneak to different districts that she wasn't allowed to go in, she had to learn how things are done and what path take to accomplish her goal, which ended her giving some traits from Kon as seen in the kitsune spirit incident. After that she developed some sense of protectiveness when she promised to stay forever together with Kon, no matter what even the gods say, in one of the most romantic scenes ever done in any anime or manga. Later, with all the girls, she realized she didn't have her own divination method, but after a plot relevant incident in which she got more info from her mom, she found her own thanks to some family ties, even if she can't use it whenever she wants. I can say that Chiya's determination was the part that developed most from her during these 12 episodes.\\n\\n\r\nI don't think it's possible to enjoy a show more than I did this one, that's why I'm giving it a perfect 10/10",
            "date": "2017-03-25T10:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 243493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3028883.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Anon028",
                "username": "Anon028"
            },
            "url": "https://myanimelist.net/reviews.php?id=243493"
        },
        {
            "content": "NOTE: this review is for my own personal use only. i've noticed after a while, i forget why i rated a show highly or poorly, so i'm going to write reviews after completing each series so i can reference them in the future.\r\nurara meirochou started off as a comfy \"cute girls doing cute things\" show, but my eyes quickly dulled after each episode had to have a bonding event. each and every episode had to have one character feel alone or out of place and then it has to end with someone crying and everyone saying \"we'll do it together\" or some bullshit like that.the whole \"friends give me strength\" thing is fine, albeit overused, but it was just so dumb and cheesy.\\n\\n\r\ntowards the end, we started to get some sprinkling of an underlying story, but of course it ends on a cliff hanger and refuses take itself seriously. in the middle of a major plot point, it hard cuts to a slapstick joke. it feels horribly out of pace and kills the mood and pacing. and it does this more than once in the same episode. in this regard, it follows the same pitfalls and many other slice of life shows: have your majority of the show be comfy and then force drama at the end, but don't have any form of conciseness. not to say that this will always kill a show for me, but it does leave a bad taste in my mouth ESPECIALLY when you tease me this hard. the problem is the show brings up something extremely interesting and starts to form a compelling story, just to spit in your face for getting your hopes up.\\n\\n\r\nthe characters are just merely caricatures. it's what i expected to begin with, given that it is a slice of life show. the characters don't change, but are given the illusion of change. for example, each character undergoes a moment when they \"realize\" that they can rely on their friends (or some similar epiphany) and this gives the illusion that our character has changed. but this doesn't change the way our character acts or how they interact with the others at all. regardless of this \"epiphany\", the character would still go to the ends of the earth for their friends and vice versa.\\n",
            "date": "2018-04-04T01:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 276818,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4787974.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rexosorous",
                "username": "Rexosorous"
            },
            "url": "https://myanimelist.net/reviews.php?id=276818"
        },
        {
            "content": "It feels good to watch the CGDCT genre (cute girls doing cute things) at the end of the day, after life punching you in the face. \r\nAs expected, the plot isn't a big thing, but it's comfortable to see these girls always having fun, always putting friendship in a high position along the episodes. The overcoming of Hinako talking to people is great, btw.\r\nThey also did a good job in art, all traces are beautiful and symmetrical, aesthetic goals.\r\nIn the general context, I'd recommend this anime if you don't want to worry about heavy plot or really deep characters.\r\n(characters may be a little bit sexualized,but if wasn't like this, probably wasn't anime)",
            "date": "2018-01-01T19:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 267145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6850455.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MagiMoe",
                "username": "MagiMoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=267145"
        },
        {
            "content": "I came into this with high hopes, Even with the mediocre score rating of 7.17. I was really surprised by how much i enjoyed it to be honest. I feel that the score isn't near to what this deserves.\r\nI heard this compared a couple times to Kobayashi-san Chi no Maid Dragon. I find it kind of unfair to compare them sense they both are different from each other with the only thing in common is Cast of Girls, Magical elements and that Art style is kind of similar. But if i were to compare them i don't think Kobayashi is as good as Urara Meirochou.I do enjoy Kobayashi a good amount. It used to be my only 10 rated show. But lately after further inspection i lowered it down to a 9 then just recently a 8. Only real thing i'd say Kobayashi has over this is that it uses a lot more adult humor and doesn't restrict itself as much.\\n\\n\r\n~~SPOILERS~~\\n\r\nThis show while does use a good amount of Cliches it's still very fun and good. Just because something uses a cliche doesn't make it bad. It depends on how it uses the cliche.\\n\\n\r\nThere is a lot that i love with this. The Cast,Art,Sounds and Comedy.\\n\\n\r\nWe have very lovable characters. Such as Chiya and Kon. Also have god like entities. Chiya herself is really fun and interesting to see and i wish we got too see more of her. Koun i believe is the name ( The fox looking creature that follows Chiya) We even have an enjoyable fox spirit that only possesses Kon. \\n\\n\r\nThere is also a lot of duo's you can't help but want to see together( It's even applied a couple times) Such as \\n\r\nChiyaxKon \\n\r\nSakuxNina \\n\\n\r\nKon and Chiya seem to be the real main character. With more focus on them than any other of the characters. I feel like this is a good thing too sense they are the two most interesting characters in the show.\\n\\n\r\nThere is one scene that both Chiya and Kon are doing this thing underwater and it is honestly kind of cool. I was half expecting them to use this as their excuse for a body swap episode between the two of them.\\n\\n\r\nOverall i really love this show and while i doubt it, I really hope for a 2nd season.",
            "date": "2017-11-20T20:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 263639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=263639"
        },
        {
            "content": "I'm not going to go too into depth with this review, I'll just put my thoughts down for this. Of course, there will be spoilers, but I'll try to keep them as vague as possible. \r\nI thoroughly enjoyed this anime, and felt that it was an adorable anime, with adorable characters, doing adorable things. The romance ships were there and the ending even supported some of them, and it had so much potential for a serious plot while remaining carefree and soft. \r\nHowever, the end of this anime has left me wanting so much more, but NOT in a good way. They started with thepremise of an adorable show with a lot of character development, with a potential for a serious story in the background, then discarded all of that for a slice-of-life show for most of the series. It remembered the story that had sunk into the background towards the end, and left nothing resolved.\\n\\n\r\nThe entire story revolves around the main character, Chiya, trying to find her mother. She also aspires to become a first-rank Urara to find her mother, if need be. Yet by the end of 12 full episodes, we learn very little of her mother, and she is barely even mentioned for the majority of the series. Most of the information we learn in episode 11. Episode 12 could have been spent finding heavy clues for her mother perhaps, or exploring where the future will take them, but instead it's spent with an obligatory bathhouse episode. Not going to say I don't appreciate it, but it felt like a waste of potential advancements.\\n\\n\r\nI genuinely hope a season 2 will happen to tie up the loose ends that are, honestly, the entire show. Next to none of the original plot points have been resolved, few have been furthered, and the show leaves a lot to be desired. However, despite the failed plotline of the entire show, there seemed to be plenty of character development, and that much I can appreciate.\\n\\n\r\nI still enjoyed it though, as it was very cute and I enjoyed watching the girls getting up to their antics. I just wish that the show could decide whether it wanted to be a cutesy slice-of-life anime, or something more serious. The show didn't decide in time, and failed to balance it out whatsoever. It seemed that they were trying to do far too much with the episode limit that they had. Perhaps making this a 24-episode anime would have been a great workaround for this problem? Regardless, I'm giving it a 6/10, because story is very important to me.",
            "date": "2017-04-12T21:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 245363,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Evladimira183",
                "username": "Evladimira183"
            },
            "url": "https://myanimelist.net/reviews.php?id=245363"
        },
        {
            "content": "MC , Chiya , went on a journey to find her mother at a place for Urara only. Urara means that some kind of priest.\r\nThere is nothing remarkable for songs/songtracks... won't leave deep impression but i guess is fine...\r\nThe voice actors did well toovoices will be saying them.\\n\\n\r\nTheir achievement is that they ranked up 1 level. From rookie to newbie.\\n\\n\r\nPersonally , i enjoy it a lot because it is really cute and refreshing to watch. Not really moe moe compared to kanna kamui , is just cute characters. Have a lot of fan services scenes.\\n\\n\r\nTry watching 1st episode and see whether you have da feel.. if don't have da feel to carry on then drop.. it doesn't really have its climax.. just really cute shit here.\\n",
            "date": "2017-04-06T19:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 244884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5519061.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ILoveOreImo",
                "username": "ILoveOreImo"
            },
            "url": "https://myanimelist.net/reviews.php?id=244884"
        },
        {
            "content": "I watched the first 3 episodes of Urara Meirochou before dropping it, but here's what I've got.\r\nStory & Characters: The story is simple and has some potential, but ultimately never goes through, ending up as another show that just forces the whole cute/moe/waifu material deal. The characters are stale and uninteresting like a 2 week old bread that has been standing outside through wind and weather, rain and sun, turning tough and chewy. There's no depth at all in any of the characters, and as the story relies heavily on the characters to move on, it stays pus.\r\nArt & Sound: Both the art style andsound are good, but at the same time feel kinda mediocre as it's about the same as we see in most shows nowadays.\\n\r\nOverall: The show isn't very bad in it's own rights, but doesn't really bring anything to the table either. This leaves, in my opinion, our hungry family of anime watchers to starve as we pursue, hopefully, quality. I just couldn't keep watching something that was only pointless moe feed.",
            "date": "2018-12-27T18:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 297108,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=297108"
        },
        {
            "content": "An anime of enjoyment and comedy, with some slice of life is such a great combination. In Urara Meirochou it shows great friendship with 4 girls that overcome problems together. A girl named Chiya goes to Labyrinth Town when she is at the age of 15, this young girl is friendly, outgoing with a strong heart that makes people smile around her, even though there are times she does make a phew problems. The absolute reason I liked this anime is because of the warm and cute friendship 4 girls show all throughout the episodes, especially when Chiya is making a ruckus and they arecaught in it. The characteristics of the other girls are Nono who is shy, caring and putting her friends before herself, Koume who likes teasing her friends, but doesn't like seeing them sad/depressed and then lastly Kon who is a young lady, likes working hard and can become shy/embarrassed easily. If you like anime with spirits, magic and witchery spells or divination with some comedy and cute girls, then this is the anime you could be looking for.",
            "date": "2018-01-19T21:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 269080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4928215.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Loveanime1213",
                "username": "Loveanime1213"
            },
            "url": "https://myanimelist.net/reviews.php?id=269080"
        },
        {
            "content": "This anime was surprisingly enjoyable. The characters were all cute, funny and interesting, with the main character, Chiya, being especially good. Chiya really brings all the characters together and is one of the best characters ive seen in a while. The show's cute character designs and art style, paired with the amazing opening and ending song really make the anime that much more enjoyable. \r\nThe only flaw in the anime would have to be the story. While it is very intriguing, it is far from finished. The show really grabs the attention of the viewer and makes them want to find out how the storyunfolds. Sadly though it seems to be about 1/10th done with the story and the original material is still publishing so it's really disappointing. The anime does have a good ending, which is enough to satisfy the viewer and not leave them at a complete loss. Also, the ending of the story (past the anime) seems fairly predictable and it is quite easy to see how it would unfold. But we are still missing out on the journey of the main cast.\\n\\n\r\nOverall, i highly recommend this show to anyone. The sound, characters and art style all fit perfectly together. It's intriguing story is amazing, but also it's only downfall. But with the satisfying ending, it makes the anime worth while. \\n",
            "date": "2017-11-14T04:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 263198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4830357.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Everlasting-",
                "username": "-Everlasting-"
            },
            "url": "https://myanimelist.net/reviews.php?id=263198"
        },
        {
            "content": "Story:\r\nDoesn't really have a story here, is just bunch of cute girls doing cute things to entertain us! \r\nArt:\r\nVery pleasing to look at, the girls are all kawaii enough to make you ***. I also quite like the color scheme of the overall show\r\nSound:\r\nAn above average soundtrack, won't buy it with real cash but will definately listen to it sometime\r\nCharacter:\r\nAll 4 girls have a pretty simple background, it doesn't go too deep or too sad! Some people might not like that but I'm fine with that since the story isn't really there anyway\r\nEnjoyment:\r\nVery enjoyable!! Is kinda like watching a bunch of kids just running aroundand doing funny things\\n\\n\r\nOverall: \\n\r\nIf your just searching for an anime to watch and giggle, you should not really think any further! The art and color scheme just did justice to the show for me. I will not recommend if your looking for a deep story here cause there is really none!",
            "date": "2017-06-23T00:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 250729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5914208.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PinkyForever",
                "username": "PinkyForever"
            },
            "url": "https://myanimelist.net/reviews.php?id=250729"
        }
    ]
]