[
    [
        {
            "content": "I have forgotten now how I came to watch Mushishi Zoku Shou. But whatever that reason is, I surely don't regret it.\r\nIt may be appalling at first how it may seem slow-paced or even stagnant. Looking closely, we'll realize that it is this stillness and calm that give Mushishi its distinction, making it worthy to be called a masterpiece.\r\nAfter all the action and drama that anime can flaunt, Mushishi gives us a refreshing retreat, a break from the hustle and bustle of trite anime antics, and presents to us its own brand of action and drama enveloped in its unique and perhaps unpredictable storytelling.\r\nWe followGinko, the main character, in his travels across Japan where he meets people affected by mushi, strange, ethereal creatures that coexist silently with every other living being. Interacting with different mushi has its implications and Ginko, as a mushishi, offers his help to those troubled by mushi to the best of his ability. The setting itself offers a horizon of opportunities. It is a captivating feat that each episode can be the darkest of tales reminiscent of Edgar Allan Poe (Fragrant Darkness, Lingering Crimson) or even the most lighthearted of stories (Banquet at the Forest's Edge). The story fills out every edge of possibility and leaves room for even more.\\n\\n\r\nThe slow movement and breathtaking scenery are what absorb you and even more so when its superb musical arrangements come in to accompany it. Its masterful direction bring out the best of each scene - the deep-rooted characters, the intense emotions, the over-all mood (you'd have to take a closer look to see this). Mushishi couldn't ask for a better production.\\n\\n\r\nThe whole experience takes you to a time when man and nature treated each other with respect and lived together in peace and harmony. With each episode told in a way that closely resembles the fable of Aesop and the parables of Jesus coupled with its magnificent art direction, Mushishi gives us an experience evocative of the ways of Shinto and Zen embedded in classical Japanese culture.\\n\\n\r\nAnd yet, Mushishi never tries to be grandiose and flamboyant in its ways. Its simplicity is its most favorable trait and it is in there that you will find its grandeur. \"Mabaw nga kalipay\" (\"simple pleasure\") is what we'd call it in Cebuano. It is not laden with complications and twists but that makes it all the more entertaining.\\n\\n\r\nAmong the anime series I'm watching this season, Mushishi Zoku Shou stands out the most and is easily one of my favorites in my limited repertoire. I would very much recommend the series to anyone and everyone, especially to those with an open mind.",
            "date": "2014-12-20T18:45:00+00:00",
            "helpful_count": 138,
            "mal_id": 173329,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3643923.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/chesudesu",
                "username": "chesudesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=173329"
        },
        {
            "content": "It's a bit difficult to write about a series that has been hailed as one of the anime industry's greats. The first season was an atmospheric work of art, an enrapturing experience that sent chills down my spine with the end of every episode. But I'm not entirely sure that Mushishi's second season has necessarily lived up to those memories. It's still an excellent anime, and while it is better than almost anything that has come out in the past few years, there's this constant sense that something - just something - is missing. \r\nPerhaps that 'something' is the fact that the series has goneon for a long time now and no longer feels as fresh as it did at the beginning. Maybe it's just that I've gotten older since I watched the first season and am no longer capable of feeling those same emotions again. Or maybe the staff just haven't been able to fully reproduce the magic of the first season. Even so, whatever the case may be, it turns out that Mushishi's second season, even if it is a slightly inferior Mushishi, is still one of the most pleasant experiences I've had watching an anime in quite a long time. \\n\\n\r\nAn interesting detail about Mushishi is how not all its stories end on a happy note. Many of them are bittersweet or flat-out depressing, which eliminates any of the predictability that often comes with storytelling. The episodes are not merely different in their content, but also deliver completely different emotions at the end of each episode, ensuring that the series never reaches the point of staleness. Mushishi always has something new to offer to its audience. And it never goes the route of preaching morals, as even its villains are deep and human enough to be empathised with. Nobody is inherently right or wrong in Mushishi; even Ginko cannot say for sure what the best path would have been. \\n\\n\r\nNot surprisingly, Mushishi delivers on the atmosphere front. It is minimalistic in nature and focuses once again on quiet rural life -- the supernatural issues plaguing a modest farmer or small group of villagers -- rather than the usual city problems we have seen in so many anime before. And that's for the better, I think, as there haven't been many other anime out there that have captured rural life in the quiet, subdued way that Mushishi has. It makes you want to roam around the woods or raise a family where things are calm and peaceful, even if those thoughts are only for a fleeting moment. \\n\\n\r\nThere are only two minor issues I have with Mushishi's second season. First, the show focuses exclusively on mushishi incidents and the victims surrounding them and does surprisingly little with Ginko himself. The entire story is about Ginko's travels, yet at the endgame of the story, we know very little about him or his thought process. Secondly, the mushishi incidents feel far too numerous, perhaps owing to the episode count. It feels like Ginko just comes across some world-changing event every second day, which makes one wonder what he's doing in-between all the episodes. Showing those quiet moments, the moments when he's not dealing with mushishi, would be just as interesting as the supernatural. \\n\\n\r\nMushishi continues to have some of the best scenery in anime. It looks absolutely fantastic, with nearly every shot of a forest or a lake being embodied by a simple sort of beauty, similar to the wabi-sabi aesthetic in Japanese culture. The animation itself leaves some room for improvement, though, as characters will sometimes have missing faces, and the show seemingly prefers panning shots far more than movement. \\n\\n\r\nIt also has an incredible soundtrack, much like before. Mushishi is a master at timing its music. Often a quiet piece will start playing in the background without you even noticing, and gradually it will pick up and seamlessly lead right into the credits. Small little touches like this do a lot to enhance the emotional value of the show. And of course I would be silly to not mention the opening track, which is one of the most relaxing things I've perhaps ever heard. It is medicine for the soul. \\n\\n\r\nMushishi's second season may be a bit weaker than its first, but that doesn't necessarily mean it's disappointing. It still delivers the same mature themes and atmosphere that you'd come to expect from the series. It just doesn't carry those same awing moments of before, the ones that screamed \"I'm watching a masterpiece\". But I don't think that is necessarily a problem. If its greatest sin is being merely great rather than a masterpiece, then Mushishi's second offering is already leagues ahead of its competition.",
            "date": "2015-05-09T12:33:00+00:00",
            "helpful_count": 135,
            "mal_id": 187455,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=187455"
        },
        {
            "content": "Simply put, Mushishi is special. As a whole, it’s a fifty episode journey through the lives of the character, a grand slice-of-life about experiences and life lessons. It’s a unique work, because viewers don’t just watch this series; they drift slowly into its dreamy world. The origins of Mushi are mysterious, but their presence undoubtedly affects people’s lives. The focus is however, not on the Mushi, but the people who come in contact with them and how their lives are changed after their mysterious encounter. As a story, somehow nothing is complex, yet everything is meaningful, each episodes features different yet connected stories. The wayit actively expounds its themes might leave it open to accusations of being didactic, but it’s so honest in its belief of its messages, that it’s completely disarming. A lesser series would have fallen on its face with this approach, and repulsed its audience by its over-sentimentalism, but Mushishi somehow makes you embrace it. I’ll admit, I have only a bare understanding of how it has managed to achieve this. All I know is that it’ll be a long time before we see another anime quite like it.\\n\\n\r\nThe stories are still episodic in nature, and fairly simple, but Mushishi somehow manages to maintain an amazing amount of originality even in spite of its simplicity. Since it is presented in a way that doesn’t have an arc and just telling its story to the point, it didn’t feel rushed. Often deliberate and slow, but it sets the mood and ambience quite well. It's almost a given that I was going to enjoy the show's meditative musings on the role that mushi play in the world, as well as its gorgeous scenery, and luckily, neither has changed in this production (though the problem of some of the humans looking the same lingers). One of the most noticeable changeover is that Zoku Shou 2 looks darker and more grim to its presentation. There’s a scenes in which people is turned to grass and a kid dies through his body evaporating into thin air. That said, the first two series should be watched prior to this so the viewers could get used to its tonal shift from light to darker and grim style. \\n\\n\r\nOne of the greatest aspect of Mushishi is that The atmosphere and mood that it creates has a powerful effect on its storytelling. Zoku Shou is no means different. from Lucy Rose's gentle Intro \"The Shiver song\", the opening leads into a gently animated piece set in pastoral surroundings in the forest at the morning. And since each episodes is standalone, the characters are very well developed even into a deeper level, Ginko himself is even got development in this final series, in which tells the story when he was a child. Every episode is a lesson, but rarely do these characters have to be taught anything twice. The character development, particularly in this final series, is both rich and enriching, which makes the story a rewarding experience.\\n\\n\r\nHowever there are minor thing that fairly bugged me with Zoku Shou as a whole, while the visuals are nice and crisp. It seems too flashy, even in one episode when the darkest moment happens. Though it is quite understandable considering how far improved animation comparing to when it first come out in 2005, but still I think it lessened the atmosphere quite a bit. As for the animation it is fairly consistent. The characters are drawn even more expressionate than ever, especially as the show rounds the last turn to the finishing line. Even some early, offhand scenes that don't have much to do with this main story add a lot, where we get plenty of beautiful shots of mushi trailing through the sky (eye candy is always good). As a show based off such nature set in rural japan, of course the background is the highlight of the art. Whether it is the lavish forests, organic swaps, and frosty mountains paints, the background is so lust and vivid while everything is overflowing with color and appears to be an incredible series of paintings brought to life. \\n\\n\r\nOne of the greater boons about Mushishi has always been that its observations about itself are always full of wonder, but never really goes completely overboard with its romanticism. This has been true for the most part, but if I was asked to pick one flash, then that would be this final season. What I mean by that is that despite the fact that every visual is shot with purpose in order to convey a message through horror means and every individual story is conflict-driven, the messages/themes are starting to become too simplistic; it focusing too much on the characters’ problems and not enough on why I should care about said problems with the only difference being that it’s set in the Mushishi world. Some people have different criteria for how a character should be interesting or why we should care about said problems. I think I can understand it a little. But then, I thought the show more than made up for it with the rest of the episodes anyway, by keeping up a steady -- not to mention impressive -- pace for the rest of its runtime.\\n\\n\r\nDespite complain I said above the next chapter of Mushishi is still great. The anime as a whole is easily one of the greenest show I have ever seen, though we will occasionally see Ginko wander through some of the most spectacular rainfalss I've seen in anime. If the series isn't impressing you with its animation or its eyecatching background (which did not will quite happen), it reels you in with its story. Interesting and simple without crossing over into convoluted territory. Overall Zoku Shou is a very good addition to the Mushishi’s anime franchise.\\n",
            "date": "2016-05-25T19:59:00+00:00",
            "helpful_count": 63,
            "mal_id": 219318,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3365201.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DannyTheDonkey",
                "username": "DannyTheDonkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=219318"
        },
        {
            "content": "As understood by most sensible viewers that dissect the content they watch, anime, throughout the years, has become an expressive form of art in its own way. It's a medium that utilizes and relies heavily on audiovisuals in accompaniment with a script to bring a story to life; a story that takes on new impressions and interpretations depending on the creative choices taken up by those involved. Sometimes this art is used as a vehicle to service self-indulgent shows, and other times, it's used for something that's worth its salt. Regardless of the quality of the title, or the effort on the part of thecreators, what remains true is that in some way or another, they can all be considered \"art.\" Beauty is in the eyes of the beholder after all, and as long as an individual finds something to be aesthetically appealing, whether that be a visual experience with plot or a visual experience with \"plot,\" that's all that really matters at the end of the day. \\n\\n\r\nBut sometimes, among the clutter, you'll stumble across titles that take it a step further, it doesn't simply use audiovisuals as a tool to compensate for whatever is written, but rather, it embodies both breathtaking audiovisuals and proper storytelling to become something far loftier. It reaches an equilibrium that's usually unobtainable by many that strive for it. Finding a delicate balance that's almost ethereal in quality, something that can't truly be expressed and appreciated until it is experienced first-hand. And for many that actively follow the anime industry for an extended period of time, one title that reaches that benchmark in terms of quality is, with little dispute, Mushishi. \\n\\n\r\nWhile all anime could be considered \"art\" in its own way, Mushishi itself is like a master canvas being brought to life; it's art personified. The elegance and command in which it carries itself is both awe-inspiring and inviting. It doesn't take long before you're sucked into its universe, with vignettes of lush, layered color and soothing imagery that quickly breathes life into its folklore and characters living in it. Everything feels organic, undisturbed by human tampering. It's a feeling that many titles have attempted to emulate but very rarely coming close to sharing the same living quarters with Mushishi's level. \\n\\n\r\nFollowing our protagonist, Ginko, we find ourselves back on a journey that feels unwavering to the current anime climate that surrounds it. Almost a full decade after its first 2005 run, Mushishi shows no sign of compromise, containing the same dense melancholic atmosphere and simplistic, yet universal messages that made it a household name among anime fans, to begin with. Just this fact alone is impressive enough, given the market's current need to produce more self-indulgent works. Any fan of the first season will be more than satisfied with this follow-up. You could even inter-splice the episodes from both seasons and not notice any change in terms of quality, outside of a more gussied up art and animation output of course.\\n\\n\r\nBut despite that fact, or maybe because of it, this follow-up season may technically reach the same heights as the first but can't help shake the feeling that there's just a sense of something being absent. This isn't to say this season wasn't a great sequel; on the contrary, it's one of the best entries of the 2010s, but rather, there was an element that the first had that didn't seem to transfer quite as well. It's a missing ingredient, an \"aha\" moment that seemed to have been lost in translation. This could be a result of the novelty of the mushi and their mysterious functions growing less intriguing after seeing it play out numerous times before or a case of the second season being stuck with less impactful storylines. Either way, there was a slight disconnect to be found. The essence was still there, just more watered down this time around. But don't let that deter you, as this bit of grievance only comes as a result of comparing what I consider being \"the lesser of both greats.\" By comparison to almost everything else being produced around it, Mushishi still stands tall, reaching the apex of visual storytelling that lands it so highly on most critics' \"best of\" lists, to begin with.   \\n\\n\r\nOne of Mushishi's strongest suits is its ability to never take sides in any conflict. It presents the story as is, and like the mushi that populates the universe of the show, everything here is treated as occurrences outside of malice or forced circumstances. Nothing is ever painted in stark black or white, it's a show that constantly dabbles in the gray. Like Ginko, we are mere spectators to the occurrences that happen in any given situation. Life is never picking favorites and the show knows that. Instead of catering to what would be favorable, all incidents that pan out to any given end result are usually determined by basic cause and effect. It doesn't wrap things up in a tidy little bow, like everything else in this world, the show simply moves on, uninterrupted by the personal struggles of man and creatures alike. This unspoken understanding is what makes the case by case basis of each episode to feel so engrossing. You never know the outcome, there's no predictable line of thought; like nature itself, every occurrence simply... exists.\\n\\n\r\nBut outside of the show's strong writing, the prominent feature of Mushishi that initially draws audiences in is without question the breathtaking scenery and haunting musical selection. Whether you like Mushishi or not, it cannot be denied that this title's prowess for crafting dense atmosphere is almost unrivaled. The blend of rich visuals and coaxing auditory cues brings forth a strong sense of pathos and satisfaction to whoever is consumed into the lore of its universe. Mushishi isn't simply something you watch, it's something you actively experience with each passing minute. \\n\\n\r\nThe opening song \"Shiver\" by Lucy Rose is perhaps one of anime's most tranquil and transcending musical intros. It embodies everything Mushishi stands for in the brief 1:30 seconds it takes to lead us into any given episode. Capped off by the musical outros that transition itself with a seamless quality and you have yourself a complete package. This doesn't even touch upon the gorgeous soundtrack, which was comprised of a mixture traditional Japanese instruments with other ear-grabbing pieces; from the slow introduction of the Kugo harp that's later accompanied by the softly plucked strings of a Shamisen, to the less common Handpan bell that interweaves itself into the mix to create walls of textured sound. All instruments playing off the strengths of each other, a balancing act of synchronicity and purposeful calculation. The music here is simply therapeutic. \\n\\n\r\nThere are many instances throughout the show where no word of dialogue is even uttered, but instead, leaves only long sweeping vistas of nature to keep the audience entranced in its world. Something that's properly exemplified with the introduction of each new episode, as the title banner slowly fades in, the landscape shifting behind it with steady ease. Not many shows can boast that ability of instant immersion. It's even elevated further when the music slowly chimes in without even bringing attention to itself. Working as the backbone to the scenes being presented but never overstepping its boundary; an act of complete unison, giving a voice to the textures and shapes that make up the feature presentation. It's these moments where Mushishi shines the brightest; these moments of uninterrupted serenity. Moments that hold onto you long after the credits roll, leaving an almost sticky and instantaneous feeling of nostalgia. \\n\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nThere are very few shows that I think unquestionably deserve their place at the top of anime's podium and Mushishi is one of them. It's a title that never ceases to amaze me with its simplicity and beauty. Nothing is wasted here. Every aspect coalesces into an artistic goldmine, where great writing, visual presentation, and enjoyment completely harmonizes to give birth to an experience that forever stays with you. To me, it's a project that has transcended the medium altogether, becoming something far more significant as a result. It's an all time favorite, a show I can revisit at any time with the reassurance of its quality forever holding firm. \\n\\n\r\nOverall: 8.5/10\\n\\n\r\nMushishi isn't great for any complex philosophical pondering or sociological observations; what makes Mushishi so great is that it doesn't try to impress the viewer by subjecting some kind of birthright of importance. It doesn't draw attention to itself, it isn't an ostentatious try-hard screaming at the top of its lungs for a chance at the limelight. It simply shows what it has to offer and leaves it upon the viewer to take the initiative in exploring its layers. There's a zen-like quality that sweeps into every crevice of this anime, and those willing to get invested into it will surely find something worthwhile tucked between the folds of its narrative.",
            "date": "2016-03-15T18:27:00+00:00",
            "helpful_count": 51,
            "mal_id": 213016,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=213016"
        },
        {
            "content": "\"Mushishi\" - perhaps one of the greatest anime I've ever seen. \"Masterpiece,\" as corny as it may sound, is the first word that comes to mind -- and not only regarding the second half of the second season, but regarding the entire franchise as a whole. There is, however, a catch: Mushishi is the kind of series that practically defines the phrase \"not for everyone.\"\r\nFirst and foremost, there is nothing in here that you would usually expect to find in Japanese animation. In Mushishi, giant fighting robots, spaceship travels, and scantily clad schoolgirls are absent -- and if you expect or require your anime tocontain these elements, then Mushishi is not worth your time and will likely put you to sleep before the first credits roll. If you're partial to unexpected plot twists, subtle foreshadowing and hints that beckon you to unravel the meaning implied by the author, or meticulously crafted plots, then most likely you, too, will be disappointed. As you can see, it is easier to advise someone NOT to watch this anime, than to find those who might like it.\\n\\n\r\nWhen watching Mushishi, I felt as though what slowly unfolds on the other side of the screen begins to pull at the my heart strings, forcing think and ponder a lot and about many different things. I dive into an unknown world, one which is almost impossible to understand, a fantasy world superimposed on reality, and it is easy to get lost in this world. Seems to be, a bit of dynamics in the story, but while watching, time flies instantly. Is Mushishi a fairy tale? I do not know. It is too realistic to be a fairy tale, yet too fantastical to be true.\\n\\n\r\nHonestly, in the beginning I was pretty skeptical. I was troubled by the graphics shown in previews and screenshots, and troubled by the fact that each episode had and \"independent\" plot. I entered the show's first few episodes with some skepticism. But after watching a few episodes more i really popped out - no one episodes did cause me disgust. Beautiful, almost to tears in the eyes landscapes, I really was amazed. Differences in character designs were fairly subtle, as if the creators wanted to say, \"this could happen to anyone,\" and yet every character also had some traits peculiar to him or her alone. Each character must deal with the mushi, under his or her own, unique circumstances and situation. Because of this, many viewers fault Mushishi for having the same secondary characters. However, this is not a minus, but a \"vice-versa\" - plus - almost like creators wanted to say us: all people are different, but at the same time, all people, in many aspects, are similar to each other, and Mushishi displays this brilliantly. All of peoples are \"all\" and \"every\".\\n\\n\r\nAnd the execution of these stories' design is just gorgeous. Rather than going the traditional anime route and using bright, eye-popping, multicolored landscapes, everything is drawn in soft pastels, with very simple color scheme reflecting the natural world and resembling watercolors. It is reminiscent of traditional Japanese ink painting. It seems that the first-season story of the artist who painted on the lining of his haori mountain from their native lands seems to be the essence of the series. There are mountains and valleys, the sky and the ocean, and with them another element, Mushi -- different and the same, neither good nor evil, the element that both feeds and kills. Just like history, there is neither bad nor good, just whatever the viewer feels each episode. All the same, everyone just lives their lives. There is no evil or good.\\n\\n\r\nRegarding Mushishi's music: On the screen, under the sound of bells, you can see the panorama of the fresh green forest; close your eyes, and you feel the same. The music blends with the picture, to become a \"voice\" of nature. Without its brilliant OST, I think, anime would lose its soul. At the end of each episode, it is simply impossible to cut the ending short, because it is the logical conclusion of each episode, where the visual image transforms into the music.\\n\\n\r\nJapanese philosophy is very ambivalent and are unlikely to be truly understood by our audience, but for anyone who has ever stopped to listen to the whisper of the forest, \"Mushishi\" will never be only a \"passable\" anime.\\n\\n\r\nMushishi - an amazing anime. Simply amazing. One of those anime that really deserves its place in the top.\\n\\n\r\nP.S So here's the perfect anime for the night. Leaves behind a phenomenally light feeling and fleeting thought. And yet — it is filled with some all-consuming, though not hurting eyes, love of peace and love of one's neighbour.\\n\\n\r\nP.P.S I would like to mention a story from the second half of the second season, about a man who lived his life several times. So sad and at the same time, life-affirming interpretation of \"Groundhog Day\" I have never seen before.\\n\\n\r\nP.P.P.S English is not my native, so thank you so much my friend, for correcting my mistakes and sentence errors )",
            "date": "2016-08-10T08:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 226391,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802557.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Akagi-kun",
                "username": "Akagi-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=226391"
        },
        {
            "content": "Ginko smokes it out while thinking about what to do.  Instead of making real choices he lets the creature in the forest come to him as he continues to smoke.  He smokes some more as he seems confident that he can smoke through just about anything.  As the never ending blunt between Ginko's mouth continues to burn, the story picks up through out the season.  You will get the urge to smoke throughout this anime.  I suggest smoking the entire you watch this good tale of how to smoke as you find whatever it is you are looking for.\\n\\n\\n\\n\\n\\n\\n\\n\r\n            -MURDER MOORE",
            "date": "2016-06-08T22:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 220321,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5464091.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DanielMoore",
                "username": "DanielMoore"
            },
            "url": "https://myanimelist.net/reviews.php?id=220321"
        },
        {
            "content": "Mushishi is more... natural, than supernatural. \r\nWatching Mushishi makes you really see the world around you. It makes you wonder how phenomenon occur and why miraculous events occur. On the one hand you are seeing a world filled to the brim with the supernatural, and yet strangely real. You feel as if Mushi could exist, that another dimension could be present that science or religion cannot explain, a guiding hand that determines why some things happen and others don't.\r\nBut what strikes me most about Mushishi (from the first season to the end of Zoku Shou) though, is the human side of it. When faced withthe supernatural, how do we respond? How do we adapt? That question is answered in so many ways in these episodes, and it really makes you realise just how strong and yet how fragile we humans can be.\\n\\n",
            "date": "2019-01-02T03:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 297787,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4951076.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mhizzing",
                "username": "Mhizzing"
            },
            "url": "https://myanimelist.net/reviews.php?id=297787"
        },
        {
            "content": "before you'll start reading this review i'll say that i've never written one before but i feel i need to write one because to many people overlook this hidden gem.\r\nstory: 10\r\neach episode contains its own story with its own new caracters (except our protagonist). that works very well for this anime because it allows it to tell stories with all kinds of diffrent settings. each episode is very well written and sometimes leaves you with a tear.\r\nart:9\r\ni feel like this is a very importand part of mushishi. the mushishi are drawn very well and settings have alot of detail in them. \r\ncaracters: 8\r\nginko is agood main caracter. he is very likable because of his helpfull nature and has good dialog. \\n\\n\r\nmost of the people ginko helps have thier own story and background. you'll get to know them in the episode and you feel with them because you'll get to understand thier problems.\\n\\n\r\nbut i do need to say that the caracter design is done somewhat poorly. i feel like most of the side caracters look alike.\\n\\n\\n\r\nsound: 8\\n\\n\r\nthe sound tracks is good and fits the series well. but it also isnt good enough to give it a 10. it has a few notable tracks (which are amazing btw)\\n\\n\r\nenjoymend: 9\\n\\n\r\ni really enjoyed this show and would definitlly watch more if i could.\\n\\n\r\noverall: 9\\n\\n\r\nthis show is a hidden gem. but if you only watch action anime you could find it boring. but i do believe this show is aimed more to an adult audience. \\n\r\ntry a few episodes if you're unsure wether to watch it or not, if you dont like it you could always stop because the episodes are not connected at all.",
            "date": "2015-12-20T15:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 206180,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/not_a_shrimp",
                "username": "not_a_shrimp"
            },
            "url": "https://myanimelist.net/reviews.php?id=206180"
        },
        {
            "content": "Mushishi Zoku Shou season 2, or as it truly is, Mushishi season 3, steps in, giving us more of what has made so many love the Mushishi-universe.\r\nStory: We continue our travels with the Mushi-shi Ginko as he meets more people and solve more problems. The show gives us those bittersweet feelings that Mushishi always has, and makes us think about what, truly, is right or wrong.\r\nArt & Sound: Stellar soundtracks and nice art style has always permeated this series and I'm relieved that it never seems to stray away from that.\r\nCharacters: We get more characters, more realistic backstories (at least as realistic as you couldget from a fantasy story) and situations.\\n\r\nOverall: I love it! A show that has never gotten to invested in a singular aspect, always showing that there are light and darkness in everything.\\n\r\nEnjoy!",
            "date": "2018-12-08T14:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 295455,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=295455"
        },
        {
            "content": "This is an example of a truly remarkable and artistic masterpiece for the anime, and perhaps entertainment world in general. \r\nIt is such an atmospheric experience, with many compelling characters and even more compelling and mind-blowing stories with each episode. It is episodic like the seasons before, but that kind of setup ultimately proves to be done masterfully and with great nuance. \r\nGinko continues to be a fantastic and thoughtful protagonist who encounters these various Mushi-related incidences in some very resourceful and interesting ways. \r\nSome of the episodes in this series are absolutely breathtaking, containing a large amount of emotional baggage, as well as sometwists and turns that keeps the viewer on edge. Some of the moments from this show are truly moving, and after viewing I feel that I have actually gained a lot from this series. \\n\\n\r\nZoku Shou 2nd Season is equally as good as the first season for me, and there were so many moments where I was blown away. The writing is fantastic, and the slow pacing is done in such a remarkable and captivating manner. Some could view this as boring since yet again, this show isn't exactly an action anime, or even neatly fitting into any other usual genre people are accustomed to. Yet, the differences with this series are something that people should at least try and watch, for I feel that they could come to really appreciate the beauty in the writing of this show. \\n\\n\r\nThe spiritual and mythological elements intertwining with these people's lives as well as the natural world around them are extremely moving and thought-provoking. This has proven to be one of the greatest series I have seen, period. Whether in the anime world or otherwise.",
            "date": "2016-12-27T12:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 236682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4820224.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mantislord000",
                "username": "Mantislord000"
            },
            "url": "https://myanimelist.net/reviews.php?id=236682"
        },
        {
            "content": "\"They seem strange and alien, primitive and peculiar. They are unlike any flora or fauna known to us. From time immemorial, men have feared these shapeless entities which came to be known as “Mushi”.\"\r\nSpeaking of slice of life anime , it wouldn’t be a stretch to say Mushishi is one of the \"train heads\" in this category. I myself was curious about it when I first got into anime 2 years ago, and it sure had my attention since then. However, took me long enough before I got the chance to finish it, and wow, what a ride it was.\r\nTo begin with, Mushishi is, IMO,not an anime for everyone. Yeah you must have sick of hearing this kind of excuse but I think this one small description fits Mushishi perfectly. Unless you have a mindset of a geezer who’s tired of all the noise in the city and just wanna have something peaceful, a bit dramatic and a touch of life, then yeah Mushishi is definitely your cup of tea. Other than that, people who don’t have enough patience would leave in less than 3 episodes (maybe).\\n\\n\r\nWhen I first watched Mushishi I was in awe of how studio Artland handled the mysteries as well as fantasy in this slice of life anime. Though I must admit the pacing can be a problem sometimes which might trigger uneasiness-es, in the end, the solution for each episode always paid off.\\n\\n\r\nMushishi doesn’t have an overarching plot, it’s rather straightforward with nothing really complicated or contains some pretentious, 2deep4u philosophies. Mushishi is a journey, a voyage to find the value of living beings while at the same time, witness and uncover some of the human’s trait that we rarely get to see on the media as a whole.\\n\\n\r\nIn the process of solving a problem, Ginko, our protagonist, usually has to struggle to find the most optimized answer for both human and the Mushi race. With the metaphor used in almost every episode, we, the audience, get to see and know a bit more about the whimsical trend of Japanese’s folktale, culture stuff, such as their concept about heaven and earth, life and death etc. which is, IMO, a good add-on that help spice things up a bit.\\n\\n\r\nThis isn’t some kind of shounen story where we have a main character seeking/obtaining superpower, defeating the “bad guys” and saving the days while being surrounded by nice girls. In fact, Mushishi actually has no clear direction honestly speaking. It’s just there showing us the story of Ginko’s POV and unravel different scenarios each episode, constantly changing side characters but not without maintaining its substance.\\n\\n\r\nWhat really separates Mushjshi from most conventional SoL animes is that it doesn’t hesitate to challenge the “dark side”. Slowly but surely, you’ll get to bear witness to some certain disturbing subjects accompanied by a little bit of horror for the change of tone. This is IMO one of the best things about Mushishi, it harvests an innumerable amount of themes regardless of their “color”, thus enriches and expands the scale of this fantasy saga.\\n\\n\r\nWatching Mushishi is like sitting down and “listening” to a tale of a guy who traveled greatly in his life. What’s more, this kind of tale is supplemented with magnificent art and beautiful soundtrack to help enhance your experience. Character design is simple yet very effective, I don’t really have trouble remembering their faces because it’s all almost the same. The breathtaking landscape simply nails the “feel” atmosphere, as it makes me wanna chill out for a bit and forget about all the ruckus of a day at work.\\n\\n\r\nThe sound and BGM is also one of Mushishi’s strongest asset. It wasn’t just the quality of the track that matter, it was how they were played at the right moment in order to fully augment the highlight of a particular episode. The OP is pure magic, I can listen to it every time without getting tired. The EDs varies from each episode and thus making it even more prolific and special. My favorite one is probably no.7 track of Zokou shou SS1.\\n\\n\r\nAlthough Mushishi doesn’t have a great cast, Ginko alone is sufficient to make up for the lack of quantity. Throughout the journey, we get to see more about his story, his personality and some of his humorous traits. He isn’t some kind of OP or godlike genius that can practically get or figures out everything. But that’s what makes him the star of the show, a faithful and easygoing fella that keeps the show from feeling lackluster.\\n\\n\r\nDespite all the praise I gave, Mushishi is not flawless. However, the flaws here is up to how the viewers perceive to decide its level. I myself think Mushishi should have stopped at Zokou, the OVAs are nice but I can’t say they’re on the same level with the main series, mostly due to the pacing as well as “recycled” ideas. I admit that sometimes this anime makes me feel very sleepy, but the end result really made up for that.\\n\\n\r\nIn conclusion, Mushishi was a great tour with many memorable moments. I laughed a lot, I learned a lot, I “felt” a lot, I shocked a lot, and it’s all worth it. So long Ginko, have a nice trip and good luck.",
            "date": "2018-03-15T20:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 273928,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5315093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CzeroC",
                "username": "CzeroC"
            },
            "url": "https://myanimelist.net/reviews.php?id=273928"
        }
    ],
    [
        {
            "content": "I have forgotten now how I came to watch Mushishi Zoku Shou. But whatever that reason is, I surely don't regret it.\r\nIt may be appalling at first how it may seem slow-paced or even stagnant. Looking closely, we'll realize that it is this stillness and calm that give Mushishi its distinction, making it worthy to be called a masterpiece.\r\nAfter all the action and drama that anime can flaunt, Mushishi gives us a refreshing retreat, a break from the hustle and bustle of trite anime antics, and presents to us its own brand of action and drama enveloped in its unique and perhaps unpredictable storytelling.\r\nWe followGinko, the main character, in his travels across Japan where he meets people affected by mushi, strange, ethereal creatures that coexist silently with every other living being. Interacting with different mushi has its implications and Ginko, as a mushishi, offers his help to those troubled by mushi to the best of his ability. The setting itself offers a horizon of opportunities. It is a captivating feat that each episode can be the darkest of tales reminiscent of Edgar Allan Poe (Fragrant Darkness, Lingering Crimson) or even the most lighthearted of stories (Banquet at the Forest's Edge). The story fills out every edge of possibility and leaves room for even more.\\n\\n\r\nThe slow movement and breathtaking scenery are what absorb you and even more so when its superb musical arrangements come in to accompany it. Its masterful direction bring out the best of each scene - the deep-rooted characters, the intense emotions, the over-all mood (you'd have to take a closer look to see this). Mushishi couldn't ask for a better production.\\n\\n\r\nThe whole experience takes you to a time when man and nature treated each other with respect and lived together in peace and harmony. With each episode told in a way that closely resembles the fable of Aesop and the parables of Jesus coupled with its magnificent art direction, Mushishi gives us an experience evocative of the ways of Shinto and Zen embedded in classical Japanese culture.\\n\\n\r\nAnd yet, Mushishi never tries to be grandiose and flamboyant in its ways. Its simplicity is its most favorable trait and it is in there that you will find its grandeur. \"Mabaw nga kalipay\" (\"simple pleasure\") is what we'd call it in Cebuano. It is not laden with complications and twists but that makes it all the more entertaining.\\n\\n\r\nAmong the anime series I'm watching this season, Mushishi Zoku Shou stands out the most and is easily one of my favorites in my limited repertoire. I would very much recommend the series to anyone and everyone, especially to those with an open mind.",
            "date": "2014-12-20T18:45:00+00:00",
            "helpful_count": 138,
            "mal_id": 173329,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3643923.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/chesudesu",
                "username": "chesudesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=173329"
        },
        {
            "content": "It's a bit difficult to write about a series that has been hailed as one of the anime industry's greats. The first season was an atmospheric work of art, an enrapturing experience that sent chills down my spine with the end of every episode. But I'm not entirely sure that Mushishi's second season has necessarily lived up to those memories. It's still an excellent anime, and while it is better than almost anything that has come out in the past few years, there's this constant sense that something - just something - is missing. \r\nPerhaps that 'something' is the fact that the series has goneon for a long time now and no longer feels as fresh as it did at the beginning. Maybe it's just that I've gotten older since I watched the first season and am no longer capable of feeling those same emotions again. Or maybe the staff just haven't been able to fully reproduce the magic of the first season. Even so, whatever the case may be, it turns out that Mushishi's second season, even if it is a slightly inferior Mushishi, is still one of the most pleasant experiences I've had watching an anime in quite a long time. \\n\\n\r\nAn interesting detail about Mushishi is how not all its stories end on a happy note. Many of them are bittersweet or flat-out depressing, which eliminates any of the predictability that often comes with storytelling. The episodes are not merely different in their content, but also deliver completely different emotions at the end of each episode, ensuring that the series never reaches the point of staleness. Mushishi always has something new to offer to its audience. And it never goes the route of preaching morals, as even its villains are deep and human enough to be empathised with. Nobody is inherently right or wrong in Mushishi; even Ginko cannot say for sure what the best path would have been. \\n\\n\r\nNot surprisingly, Mushishi delivers on the atmosphere front. It is minimalistic in nature and focuses once again on quiet rural life -- the supernatural issues plaguing a modest farmer or small group of villagers -- rather than the usual city problems we have seen in so many anime before. And that's for the better, I think, as there haven't been many other anime out there that have captured rural life in the quiet, subdued way that Mushishi has. It makes you want to roam around the woods or raise a family where things are calm and peaceful, even if those thoughts are only for a fleeting moment. \\n\\n\r\nThere are only two minor issues I have with Mushishi's second season. First, the show focuses exclusively on mushishi incidents and the victims surrounding them and does surprisingly little with Ginko himself. The entire story is about Ginko's travels, yet at the endgame of the story, we know very little about him or his thought process. Secondly, the mushishi incidents feel far too numerous, perhaps owing to the episode count. It feels like Ginko just comes across some world-changing event every second day, which makes one wonder what he's doing in-between all the episodes. Showing those quiet moments, the moments when he's not dealing with mushishi, would be just as interesting as the supernatural. \\n\\n\r\nMushishi continues to have some of the best scenery in anime. It looks absolutely fantastic, with nearly every shot of a forest or a lake being embodied by a simple sort of beauty, similar to the wabi-sabi aesthetic in Japanese culture. The animation itself leaves some room for improvement, though, as characters will sometimes have missing faces, and the show seemingly prefers panning shots far more than movement. \\n\\n\r\nIt also has an incredible soundtrack, much like before. Mushishi is a master at timing its music. Often a quiet piece will start playing in the background without you even noticing, and gradually it will pick up and seamlessly lead right into the credits. Small little touches like this do a lot to enhance the emotional value of the show. And of course I would be silly to not mention the opening track, which is one of the most relaxing things I've perhaps ever heard. It is medicine for the soul. \\n\\n\r\nMushishi's second season may be a bit weaker than its first, but that doesn't necessarily mean it's disappointing. It still delivers the same mature themes and atmosphere that you'd come to expect from the series. It just doesn't carry those same awing moments of before, the ones that screamed \"I'm watching a masterpiece\". But I don't think that is necessarily a problem. If its greatest sin is being merely great rather than a masterpiece, then Mushishi's second offering is already leagues ahead of its competition.",
            "date": "2015-05-09T12:33:00+00:00",
            "helpful_count": 135,
            "mal_id": 187455,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=187455"
        },
        {
            "content": "Simply put, Mushishi is special. As a whole, it’s a fifty episode journey through the lives of the character, a grand slice-of-life about experiences and life lessons. It’s a unique work, because viewers don’t just watch this series; they drift slowly into its dreamy world. The origins of Mushi are mysterious, but their presence undoubtedly affects people’s lives. The focus is however, not on the Mushi, but the people who come in contact with them and how their lives are changed after their mysterious encounter. As a story, somehow nothing is complex, yet everything is meaningful, each episodes features different yet connected stories. The wayit actively expounds its themes might leave it open to accusations of being didactic, but it’s so honest in its belief of its messages, that it’s completely disarming. A lesser series would have fallen on its face with this approach, and repulsed its audience by its over-sentimentalism, but Mushishi somehow makes you embrace it. I’ll admit, I have only a bare understanding of how it has managed to achieve this. All I know is that it’ll be a long time before we see another anime quite like it.\\n\\n\r\nThe stories are still episodic in nature, and fairly simple, but Mushishi somehow manages to maintain an amazing amount of originality even in spite of its simplicity. Since it is presented in a way that doesn’t have an arc and just telling its story to the point, it didn’t feel rushed. Often deliberate and slow, but it sets the mood and ambience quite well. It's almost a given that I was going to enjoy the show's meditative musings on the role that mushi play in the world, as well as its gorgeous scenery, and luckily, neither has changed in this production (though the problem of some of the humans looking the same lingers). One of the most noticeable changeover is that Zoku Shou 2 looks darker and more grim to its presentation. There’s a scenes in which people is turned to grass and a kid dies through his body evaporating into thin air. That said, the first two series should be watched prior to this so the viewers could get used to its tonal shift from light to darker and grim style. \\n\\n\r\nOne of the greatest aspect of Mushishi is that The atmosphere and mood that it creates has a powerful effect on its storytelling. Zoku Shou is no means different. from Lucy Rose's gentle Intro \"The Shiver song\", the opening leads into a gently animated piece set in pastoral surroundings in the forest at the morning. And since each episodes is standalone, the characters are very well developed even into a deeper level, Ginko himself is even got development in this final series, in which tells the story when he was a child. Every episode is a lesson, but rarely do these characters have to be taught anything twice. The character development, particularly in this final series, is both rich and enriching, which makes the story a rewarding experience.\\n\\n\r\nHowever there are minor thing that fairly bugged me with Zoku Shou as a whole, while the visuals are nice and crisp. It seems too flashy, even in one episode when the darkest moment happens. Though it is quite understandable considering how far improved animation comparing to when it first come out in 2005, but still I think it lessened the atmosphere quite a bit. As for the animation it is fairly consistent. The characters are drawn even more expressionate than ever, especially as the show rounds the last turn to the finishing line. Even some early, offhand scenes that don't have much to do with this main story add a lot, where we get plenty of beautiful shots of mushi trailing through the sky (eye candy is always good). As a show based off such nature set in rural japan, of course the background is the highlight of the art. Whether it is the lavish forests, organic swaps, and frosty mountains paints, the background is so lust and vivid while everything is overflowing with color and appears to be an incredible series of paintings brought to life. \\n\\n\r\nOne of the greater boons about Mushishi has always been that its observations about itself are always full of wonder, but never really goes completely overboard with its romanticism. This has been true for the most part, but if I was asked to pick one flash, then that would be this final season. What I mean by that is that despite the fact that every visual is shot with purpose in order to convey a message through horror means and every individual story is conflict-driven, the messages/themes are starting to become too simplistic; it focusing too much on the characters’ problems and not enough on why I should care about said problems with the only difference being that it’s set in the Mushishi world. Some people have different criteria for how a character should be interesting or why we should care about said problems. I think I can understand it a little. But then, I thought the show more than made up for it with the rest of the episodes anyway, by keeping up a steady -- not to mention impressive -- pace for the rest of its runtime.\\n\\n\r\nDespite complain I said above the next chapter of Mushishi is still great. The anime as a whole is easily one of the greenest show I have ever seen, though we will occasionally see Ginko wander through some of the most spectacular rainfalss I've seen in anime. If the series isn't impressing you with its animation or its eyecatching background (which did not will quite happen), it reels you in with its story. Interesting and simple without crossing over into convoluted territory. Overall Zoku Shou is a very good addition to the Mushishi’s anime franchise.\\n",
            "date": "2016-05-25T19:59:00+00:00",
            "helpful_count": 63,
            "mal_id": 219318,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3365201.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DannyTheDonkey",
                "username": "DannyTheDonkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=219318"
        },
        {
            "content": "As understood by most sensible viewers that dissect the content they watch, anime, throughout the years, has become an expressive form of art in its own way. It's a medium that utilizes and relies heavily on audiovisuals in accompaniment with a script to bring a story to life; a story that takes on new impressions and interpretations depending on the creative choices taken up by those involved. Sometimes this art is used as a vehicle to service self-indulgent shows, and other times, it's used for something that's worth its salt. Regardless of the quality of the title, or the effort on the part of thecreators, what remains true is that in some way or another, they can all be considered \"art.\" Beauty is in the eyes of the beholder after all, and as long as an individual finds something to be aesthetically appealing, whether that be a visual experience with plot or a visual experience with \"plot,\" that's all that really matters at the end of the day. \\n\\n\r\nBut sometimes, among the clutter, you'll stumble across titles that take it a step further, it doesn't simply use audiovisuals as a tool to compensate for whatever is written, but rather, it embodies both breathtaking audiovisuals and proper storytelling to become something far loftier. It reaches an equilibrium that's usually unobtainable by many that strive for it. Finding a delicate balance that's almost ethereal in quality, something that can't truly be expressed and appreciated until it is experienced first-hand. And for many that actively follow the anime industry for an extended period of time, one title that reaches that benchmark in terms of quality is, with little dispute, Mushishi. \\n\\n\r\nWhile all anime could be considered \"art\" in its own way, Mushishi itself is like a master canvas being brought to life; it's art personified. The elegance and command in which it carries itself is both awe-inspiring and inviting. It doesn't take long before you're sucked into its universe, with vignettes of lush, layered color and soothing imagery that quickly breathes life into its folklore and characters living in it. Everything feels organic, undisturbed by human tampering. It's a feeling that many titles have attempted to emulate but very rarely coming close to sharing the same living quarters with Mushishi's level. \\n\\n\r\nFollowing our protagonist, Ginko, we find ourselves back on a journey that feels unwavering to the current anime climate that surrounds it. Almost a full decade after its first 2005 run, Mushishi shows no sign of compromise, containing the same dense melancholic atmosphere and simplistic, yet universal messages that made it a household name among anime fans, to begin with. Just this fact alone is impressive enough, given the market's current need to produce more self-indulgent works. Any fan of the first season will be more than satisfied with this follow-up. You could even inter-splice the episodes from both seasons and not notice any change in terms of quality, outside of a more gussied up art and animation output of course.\\n\\n\r\nBut despite that fact, or maybe because of it, this follow-up season may technically reach the same heights as the first but can't help shake the feeling that there's just a sense of something being absent. This isn't to say this season wasn't a great sequel; on the contrary, it's one of the best entries of the 2010s, but rather, there was an element that the first had that didn't seem to transfer quite as well. It's a missing ingredient, an \"aha\" moment that seemed to have been lost in translation. This could be a result of the novelty of the mushi and their mysterious functions growing less intriguing after seeing it play out numerous times before or a case of the second season being stuck with less impactful storylines. Either way, there was a slight disconnect to be found. The essence was still there, just more watered down this time around. But don't let that deter you, as this bit of grievance only comes as a result of comparing what I consider being \"the lesser of both greats.\" By comparison to almost everything else being produced around it, Mushishi still stands tall, reaching the apex of visual storytelling that lands it so highly on most critics' \"best of\" lists, to begin with.   \\n\\n\r\nOne of Mushishi's strongest suits is its ability to never take sides in any conflict. It presents the story as is, and like the mushi that populates the universe of the show, everything here is treated as occurrences outside of malice or forced circumstances. Nothing is ever painted in stark black or white, it's a show that constantly dabbles in the gray. Like Ginko, we are mere spectators to the occurrences that happen in any given situation. Life is never picking favorites and the show knows that. Instead of catering to what would be favorable, all incidents that pan out to any given end result are usually determined by basic cause and effect. It doesn't wrap things up in a tidy little bow, like everything else in this world, the show simply moves on, uninterrupted by the personal struggles of man and creatures alike. This unspoken understanding is what makes the case by case basis of each episode to feel so engrossing. You never know the outcome, there's no predictable line of thought; like nature itself, every occurrence simply... exists.\\n\\n\r\nBut outside of the show's strong writing, the prominent feature of Mushishi that initially draws audiences in is without question the breathtaking scenery and haunting musical selection. Whether you like Mushishi or not, it cannot be denied that this title's prowess for crafting dense atmosphere is almost unrivaled. The blend of rich visuals and coaxing auditory cues brings forth a strong sense of pathos and satisfaction to whoever is consumed into the lore of its universe. Mushishi isn't simply something you watch, it's something you actively experience with each passing minute. \\n\\n\r\nThe opening song \"Shiver\" by Lucy Rose is perhaps one of anime's most tranquil and transcending musical intros. It embodies everything Mushishi stands for in the brief 1:30 seconds it takes to lead us into any given episode. Capped off by the musical outros that transition itself with a seamless quality and you have yourself a complete package. This doesn't even touch upon the gorgeous soundtrack, which was comprised of a mixture traditional Japanese instruments with other ear-grabbing pieces; from the slow introduction of the Kugo harp that's later accompanied by the softly plucked strings of a Shamisen, to the less common Handpan bell that interweaves itself into the mix to create walls of textured sound. All instruments playing off the strengths of each other, a balancing act of synchronicity and purposeful calculation. The music here is simply therapeutic. \\n\\n\r\nThere are many instances throughout the show where no word of dialogue is even uttered, but instead, leaves only long sweeping vistas of nature to keep the audience entranced in its world. Something that's properly exemplified with the introduction of each new episode, as the title banner slowly fades in, the landscape shifting behind it with steady ease. Not many shows can boast that ability of instant immersion. It's even elevated further when the music slowly chimes in without even bringing attention to itself. Working as the backbone to the scenes being presented but never overstepping its boundary; an act of complete unison, giving a voice to the textures and shapes that make up the feature presentation. It's these moments where Mushishi shines the brightest; these moments of uninterrupted serenity. Moments that hold onto you long after the credits roll, leaving an almost sticky and instantaneous feeling of nostalgia. \\n\\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nThere are very few shows that I think unquestionably deserve their place at the top of anime's podium and Mushishi is one of them. It's a title that never ceases to amaze me with its simplicity and beauty. Nothing is wasted here. Every aspect coalesces into an artistic goldmine, where great writing, visual presentation, and enjoyment completely harmonizes to give birth to an experience that forever stays with you. To me, it's a project that has transcended the medium altogether, becoming something far more significant as a result. It's an all time favorite, a show I can revisit at any time with the reassurance of its quality forever holding firm. \\n\\n\r\nOverall: 8.5/10\\n\\n\r\nMushishi isn't great for any complex philosophical pondering or sociological observations; what makes Mushishi so great is that it doesn't try to impress the viewer by subjecting some kind of birthright of importance. It doesn't draw attention to itself, it isn't an ostentatious try-hard screaming at the top of its lungs for a chance at the limelight. It simply shows what it has to offer and leaves it upon the viewer to take the initiative in exploring its layers. There's a zen-like quality that sweeps into every crevice of this anime, and those willing to get invested into it will surely find something worthwhile tucked between the folds of its narrative.",
            "date": "2016-03-15T18:27:00+00:00",
            "helpful_count": 51,
            "mal_id": 213016,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=213016"
        },
        {
            "content": "\"Mushishi\" - perhaps one of the greatest anime I've ever seen. \"Masterpiece,\" as corny as it may sound, is the first word that comes to mind -- and not only regarding the second half of the second season, but regarding the entire franchise as a whole. There is, however, a catch: Mushishi is the kind of series that practically defines the phrase \"not for everyone.\"\r\nFirst and foremost, there is nothing in here that you would usually expect to find in Japanese animation. In Mushishi, giant fighting robots, spaceship travels, and scantily clad schoolgirls are absent -- and if you expect or require your anime tocontain these elements, then Mushishi is not worth your time and will likely put you to sleep before the first credits roll. If you're partial to unexpected plot twists, subtle foreshadowing and hints that beckon you to unravel the meaning implied by the author, or meticulously crafted plots, then most likely you, too, will be disappointed. As you can see, it is easier to advise someone NOT to watch this anime, than to find those who might like it.\\n\\n\r\nWhen watching Mushishi, I felt as though what slowly unfolds on the other side of the screen begins to pull at the my heart strings, forcing think and ponder a lot and about many different things. I dive into an unknown world, one which is almost impossible to understand, a fantasy world superimposed on reality, and it is easy to get lost in this world. Seems to be, a bit of dynamics in the story, but while watching, time flies instantly. Is Mushishi a fairy tale? I do not know. It is too realistic to be a fairy tale, yet too fantastical to be true.\\n\\n\r\nHonestly, in the beginning I was pretty skeptical. I was troubled by the graphics shown in previews and screenshots, and troubled by the fact that each episode had and \"independent\" plot. I entered the show's first few episodes with some skepticism. But after watching a few episodes more i really popped out - no one episodes did cause me disgust. Beautiful, almost to tears in the eyes landscapes, I really was amazed. Differences in character designs were fairly subtle, as if the creators wanted to say, \"this could happen to anyone,\" and yet every character also had some traits peculiar to him or her alone. Each character must deal with the mushi, under his or her own, unique circumstances and situation. Because of this, many viewers fault Mushishi for having the same secondary characters. However, this is not a minus, but a \"vice-versa\" - plus - almost like creators wanted to say us: all people are different, but at the same time, all people, in many aspects, are similar to each other, and Mushishi displays this brilliantly. All of peoples are \"all\" and \"every\".\\n\\n\r\nAnd the execution of these stories' design is just gorgeous. Rather than going the traditional anime route and using bright, eye-popping, multicolored landscapes, everything is drawn in soft pastels, with very simple color scheme reflecting the natural world and resembling watercolors. It is reminiscent of traditional Japanese ink painting. It seems that the first-season story of the artist who painted on the lining of his haori mountain from their native lands seems to be the essence of the series. There are mountains and valleys, the sky and the ocean, and with them another element, Mushi -- different and the same, neither good nor evil, the element that both feeds and kills. Just like history, there is neither bad nor good, just whatever the viewer feels each episode. All the same, everyone just lives their lives. There is no evil or good.\\n\\n\r\nRegarding Mushishi's music: On the screen, under the sound of bells, you can see the panorama of the fresh green forest; close your eyes, and you feel the same. The music blends with the picture, to become a \"voice\" of nature. Without its brilliant OST, I think, anime would lose its soul. At the end of each episode, it is simply impossible to cut the ending short, because it is the logical conclusion of each episode, where the visual image transforms into the music.\\n\\n\r\nJapanese philosophy is very ambivalent and are unlikely to be truly understood by our audience, but for anyone who has ever stopped to listen to the whisper of the forest, \"Mushishi\" will never be only a \"passable\" anime.\\n\\n\r\nMushishi - an amazing anime. Simply amazing. One of those anime that really deserves its place in the top.\\n\\n\r\nP.S So here's the perfect anime for the night. Leaves behind a phenomenally light feeling and fleeting thought. And yet — it is filled with some all-consuming, though not hurting eyes, love of peace and love of one's neighbour.\\n\\n\r\nP.P.S I would like to mention a story from the second half of the second season, about a man who lived his life several times. So sad and at the same time, life-affirming interpretation of \"Groundhog Day\" I have never seen before.\\n\\n\r\nP.P.P.S English is not my native, so thank you so much my friend, for correcting my mistakes and sentence errors )",
            "date": "2016-08-10T08:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 226391,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802557.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Akagi-kun",
                "username": "Akagi-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=226391"
        },
        {
            "content": "Ginko smokes it out while thinking about what to do.  Instead of making real choices he lets the creature in the forest come to him as he continues to smoke.  He smokes some more as he seems confident that he can smoke through just about anything.  As the never ending blunt between Ginko's mouth continues to burn, the story picks up through out the season.  You will get the urge to smoke throughout this anime.  I suggest smoking the entire you watch this good tale of how to smoke as you find whatever it is you are looking for.\\n\\n\\n\\n\\n\\n\\n\\n\r\n            -MURDER MOORE",
            "date": "2016-06-08T22:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 220321,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5464091.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DanielMoore",
                "username": "DanielMoore"
            },
            "url": "https://myanimelist.net/reviews.php?id=220321"
        },
        {
            "content": "Mushishi is more... natural, than supernatural. \r\nWatching Mushishi makes you really see the world around you. It makes you wonder how phenomenon occur and why miraculous events occur. On the one hand you are seeing a world filled to the brim with the supernatural, and yet strangely real. You feel as if Mushi could exist, that another dimension could be present that science or religion cannot explain, a guiding hand that determines why some things happen and others don't.\r\nBut what strikes me most about Mushishi (from the first season to the end of Zoku Shou) though, is the human side of it. When faced withthe supernatural, how do we respond? How do we adapt? That question is answered in so many ways in these episodes, and it really makes you realise just how strong and yet how fragile we humans can be.\\n\\n",
            "date": "2019-01-02T03:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 297787,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4951076.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mhizzing",
                "username": "Mhizzing"
            },
            "url": "https://myanimelist.net/reviews.php?id=297787"
        },
        {
            "content": "before you'll start reading this review i'll say that i've never written one before but i feel i need to write one because to many people overlook this hidden gem.\r\nstory: 10\r\neach episode contains its own story with its own new caracters (except our protagonist). that works very well for this anime because it allows it to tell stories with all kinds of diffrent settings. each episode is very well written and sometimes leaves you with a tear.\r\nart:9\r\ni feel like this is a very importand part of mushishi. the mushishi are drawn very well and settings have alot of detail in them. \r\ncaracters: 8\r\nginko is agood main caracter. he is very likable because of his helpfull nature and has good dialog. \\n\\n\r\nmost of the people ginko helps have thier own story and background. you'll get to know them in the episode and you feel with them because you'll get to understand thier problems.\\n\\n\r\nbut i do need to say that the caracter design is done somewhat poorly. i feel like most of the side caracters look alike.\\n\\n\\n\r\nsound: 8\\n\\n\r\nthe sound tracks is good and fits the series well. but it also isnt good enough to give it a 10. it has a few notable tracks (which are amazing btw)\\n\\n\r\nenjoymend: 9\\n\\n\r\ni really enjoyed this show and would definitlly watch more if i could.\\n\\n\r\noverall: 9\\n\\n\r\nthis show is a hidden gem. but if you only watch action anime you could find it boring. but i do believe this show is aimed more to an adult audience. \\n\r\ntry a few episodes if you're unsure wether to watch it or not, if you dont like it you could always stop because the episodes are not connected at all.",
            "date": "2015-12-20T15:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 206180,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/not_a_shrimp",
                "username": "not_a_shrimp"
            },
            "url": "https://myanimelist.net/reviews.php?id=206180"
        },
        {
            "content": "Mushishi Zoku Shou season 2, or as it truly is, Mushishi season 3, steps in, giving us more of what has made so many love the Mushishi-universe.\r\nStory: We continue our travels with the Mushi-shi Ginko as he meets more people and solve more problems. The show gives us those bittersweet feelings that Mushishi always has, and makes us think about what, truly, is right or wrong.\r\nArt & Sound: Stellar soundtracks and nice art style has always permeated this series and I'm relieved that it never seems to stray away from that.\r\nCharacters: We get more characters, more realistic backstories (at least as realistic as you couldget from a fantasy story) and situations.\\n\r\nOverall: I love it! A show that has never gotten to invested in a singular aspect, always showing that there are light and darkness in everything.\\n\r\nEnjoy!",
            "date": "2018-12-08T14:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 295455,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7250351.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ThorNN-heim7",
                "username": "ThorNN-heim7"
            },
            "url": "https://myanimelist.net/reviews.php?id=295455"
        },
        {
            "content": "This is an example of a truly remarkable and artistic masterpiece for the anime, and perhaps entertainment world in general. \r\nIt is such an atmospheric experience, with many compelling characters and even more compelling and mind-blowing stories with each episode. It is episodic like the seasons before, but that kind of setup ultimately proves to be done masterfully and with great nuance. \r\nGinko continues to be a fantastic and thoughtful protagonist who encounters these various Mushi-related incidences in some very resourceful and interesting ways. \r\nSome of the episodes in this series are absolutely breathtaking, containing a large amount of emotional baggage, as well as sometwists and turns that keeps the viewer on edge. Some of the moments from this show are truly moving, and after viewing I feel that I have actually gained a lot from this series. \\n\\n\r\nZoku Shou 2nd Season is equally as good as the first season for me, and there were so many moments where I was blown away. The writing is fantastic, and the slow pacing is done in such a remarkable and captivating manner. Some could view this as boring since yet again, this show isn't exactly an action anime, or even neatly fitting into any other usual genre people are accustomed to. Yet, the differences with this series are something that people should at least try and watch, for I feel that they could come to really appreciate the beauty in the writing of this show. \\n\\n\r\nThe spiritual and mythological elements intertwining with these people's lives as well as the natural world around them are extremely moving and thought-provoking. This has proven to be one of the greatest series I have seen, period. Whether in the anime world or otherwise.",
            "date": "2016-12-27T12:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 236682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4820224.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mantislord000",
                "username": "Mantislord000"
            },
            "url": "https://myanimelist.net/reviews.php?id=236682"
        },
        {
            "content": "\"They seem strange and alien, primitive and peculiar. They are unlike any flora or fauna known to us. From time immemorial, men have feared these shapeless entities which came to be known as “Mushi”.\"\r\nSpeaking of slice of life anime , it wouldn’t be a stretch to say Mushishi is one of the \"train heads\" in this category. I myself was curious about it when I first got into anime 2 years ago, and it sure had my attention since then. However, took me long enough before I got the chance to finish it, and wow, what a ride it was.\r\nTo begin with, Mushishi is, IMO,not an anime for everyone. Yeah you must have sick of hearing this kind of excuse but I think this one small description fits Mushishi perfectly. Unless you have a mindset of a geezer who’s tired of all the noise in the city and just wanna have something peaceful, a bit dramatic and a touch of life, then yeah Mushishi is definitely your cup of tea. Other than that, people who don’t have enough patience would leave in less than 3 episodes (maybe).\\n\\n\r\nWhen I first watched Mushishi I was in awe of how studio Artland handled the mysteries as well as fantasy in this slice of life anime. Though I must admit the pacing can be a problem sometimes which might trigger uneasiness-es, in the end, the solution for each episode always paid off.\\n\\n\r\nMushishi doesn’t have an overarching plot, it’s rather straightforward with nothing really complicated or contains some pretentious, 2deep4u philosophies. Mushishi is a journey, a voyage to find the value of living beings while at the same time, witness and uncover some of the human’s trait that we rarely get to see on the media as a whole.\\n\\n\r\nIn the process of solving a problem, Ginko, our protagonist, usually has to struggle to find the most optimized answer for both human and the Mushi race. With the metaphor used in almost every episode, we, the audience, get to see and know a bit more about the whimsical trend of Japanese’s folktale, culture stuff, such as their concept about heaven and earth, life and death etc. which is, IMO, a good add-on that help spice things up a bit.\\n\\n\r\nThis isn’t some kind of shounen story where we have a main character seeking/obtaining superpower, defeating the “bad guys” and saving the days while being surrounded by nice girls. In fact, Mushishi actually has no clear direction honestly speaking. It’s just there showing us the story of Ginko’s POV and unravel different scenarios each episode, constantly changing side characters but not without maintaining its substance.\\n\\n\r\nWhat really separates Mushjshi from most conventional SoL animes is that it doesn’t hesitate to challenge the “dark side”. Slowly but surely, you’ll get to bear witness to some certain disturbing subjects accompanied by a little bit of horror for the change of tone. This is IMO one of the best things about Mushishi, it harvests an innumerable amount of themes regardless of their “color”, thus enriches and expands the scale of this fantasy saga.\\n\\n\r\nWatching Mushishi is like sitting down and “listening” to a tale of a guy who traveled greatly in his life. What’s more, this kind of tale is supplemented with magnificent art and beautiful soundtrack to help enhance your experience. Character design is simple yet very effective, I don’t really have trouble remembering their faces because it’s all almost the same. The breathtaking landscape simply nails the “feel” atmosphere, as it makes me wanna chill out for a bit and forget about all the ruckus of a day at work.\\n\\n\r\nThe sound and BGM is also one of Mushishi’s strongest asset. It wasn’t just the quality of the track that matter, it was how they were played at the right moment in order to fully augment the highlight of a particular episode. The OP is pure magic, I can listen to it every time without getting tired. The EDs varies from each episode and thus making it even more prolific and special. My favorite one is probably no.7 track of Zokou shou SS1.\\n\\n\r\nAlthough Mushishi doesn’t have a great cast, Ginko alone is sufficient to make up for the lack of quantity. Throughout the journey, we get to see more about his story, his personality and some of his humorous traits. He isn’t some kind of OP or godlike genius that can practically get or figures out everything. But that’s what makes him the star of the show, a faithful and easygoing fella that keeps the show from feeling lackluster.\\n\\n\r\nDespite all the praise I gave, Mushishi is not flawless. However, the flaws here is up to how the viewers perceive to decide its level. I myself think Mushishi should have stopped at Zokou, the OVAs are nice but I can’t say they’re on the same level with the main series, mostly due to the pacing as well as “recycled” ideas. I admit that sometimes this anime makes me feel very sleepy, but the end result really made up for that.\\n\\n\r\nIn conclusion, Mushishi was a great tour with many memorable moments. I laughed a lot, I learned a lot, I “felt” a lot, I shocked a lot, and it’s all worth it. So long Ginko, have a nice trip and good luck.",
            "date": "2018-03-15T20:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 273928,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5315093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CzeroC",
                "username": "CzeroC"
            },
            "url": "https://myanimelist.net/reviews.php?id=273928"
        }
    ]
]