[
    [
        {
            "content": "The Yuru Yuri franchise is what I have always considered to be my all-time favorite slice of life comedy. Kyouko's crazy antics, Akari's lack of presence, Chinatsu's magic hair and all the yuri elements that come along with it... all-in-all it's just too good. Now as much as I'd like to say that you should already know exactly what to expect from San Hai based on the previous seasons... that's actually not entirely true. You see unlike the first two seasons that were adapted by Doga Kobo, San Hai (as well as the Nachuyachumi OVAs) are produced by a less known company called TYO Animations;most famous for previous works such as B Gata H Kei, Squid Girl, Plastic Nee-san and the majority of Tamayura. This new studio brings with it some notable changes to the third season compared to the first two, and that's what I primarily want to talk about in this review.\\n\\n\r\nIn general, San Hai is a lot more... *calm* than the previous seasons. There is a lot less utter chaos and over-the-top gags utilized this time around, and instead it is replaced by more traditional, relaxing slice of life scenes. Now this does not mean that it's suddenly like Non Non Biyori exactly, it's still a lot more hyperactive than that but not to the extent which the series has been in the past. Akari is pretty much always noticed now. There are very few jokes utilized regarding her lack of presence anymore. Similarily, I don't think there was a single scene in San Hai where Chinatsu's supernatural hair comes into effect (like how it absorbed ping pong balls and stuff in the past), and the amount of yuri fantasies on Chitose's behalf has been cut down quite a lot. Even Akari's classic intro segment that used to start every episode in the past is now completely gone. And all of this is quite a shame to me, because it was that type of craziness that made the series stand out so much from the crowd and originally made me fall in love with it. Of course it's not like *all* the old running gags have been thrown out; some of them naturally persist such as Chinatsu's horrendous artistic skills for example, but they're definitely not quite as prevalent as before. That being said, even if San Hai is a lot more 'normal' in comparison... it still makes it work a lot better than I feared it would. And this is primarily because although some good things may have been lost, some good things have also been gained in the process.\\n\\n\r\nMost notably, the amount of yuri scenes has been significantly increased. I'm not talking about Chitose's fantasies here (those have decreased in number after all), I'm talking about actual events here. There is no need for Chitose to fantasize about things when they're actually playing out in reality instead, right? Kyouko x Ayano, Sakurako x Himawari, Chinatsu x Yui, Tomoko x Akane x Akari, etcetera. All of these couplings and more get some truly heartwarming moments together and it's a treat to see. So I guess you can say that the quality of the show itself hasn't changed, but the focal point has. Instead of the wacky comedy that it used to be, it is now more of a shoujo ai slice of life anime. And given how rare yuri anime tend to be, I can never consider it a bad thing to get some more emphasis on that front.\\n\\n\r\nAnother thing that unsurprisingly has changed with the new studio is the art style. However, this change is very subtle to say the least. If I didn't know it was a different studio producing it I might never have noticed it. And even now if I make side-by-side comparisons of the old and new art, I still can't say one really looks any better than the other. It's about the same to me. And as far as the audio goes, the voice actresses are thankfully the same as before, and the background music is barely noticeable so I don't have much to say about it. The new OP and ED themes however... in my mind they were pretty disappointing, at least given that Yuru Yuri has had some great theme songs in the past, but both of these fell pretty flat to me. Though of course this isn't exactly a huge deal in the grand scheme of things.\\n\\n\r\nIn the end, San Hai is quite clearly different from what we've seen from Yuru Yuri in the past, but as for whether it's any better or worse... well that probably depends on who you ask. In my mind, either version works, albeit for different reasons, and despite everything what we got is still one of the better shows of the year. As I mentioned in the beginning, Yuru Yuri is and always has been my favorite slice of life comedy series ever, and as far as the comedy aspect goes then San Hai does not quite live up to the expectations I had on it. However, it makes up for that fact with an abundance of additional yuri elements instead, which is also perfectly fine with me. At the very least it still provided an incredibly entertaining anime, and you can't really ask for a whole lot more than that.",
            "date": "2015-12-21T11:50:00+00:00",
            "helpful_count": 99,
            "mal_id": 206302,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=206302"
        },
        {
            "content": "The Yuru Yuri series is by far one of the more popular and well-known Shoujo Ai series to exist in Japanese media.  Taking the simple concept of a high school comedy and mixing in its own unique characters, the series as a whole has become well known in the anime community.  But with it's third season, a lot of that luster seems to have faded over time, and with TYO Animation taking the reins this time in production instead of Doga Kobo leading to some...unexpected results.\r\nStory: The story of Yuru Yuri still maintains the same general plotline, featuring out four main girls, Kyouko,Yui, Akari, and Chinatsu spending time in their signature clubhouse as the Amusement Club, spending more time together with all of the other characters in the series and generally creating a lot of wackiness and moments that make the show so memorable and great.  That however is not the case this time around.\\n\\n\r\nAs a result of the production company change, this season feels a lot more disjointed and watered down from the original.  While a great number of the things from the previous seasons when the series was produced by Doga Kobo crossed over, such as Sakurako and Himewari's breast warfare, Chinatsu's fangirling over Yui, and Kyouko's extremely bubbly and Kyouko-like manner, a couple of the more signature things about the series before like some extremely wacky scenarios and most predominantly the lack of the vanishing \"Akarin~\" gag just don't exist in this season.  In fact, I will go as far as to say that the show as a whole lost a lot of its charm and felt a lot more standard and normal than it should've been.  \\n\\n\r\nThe show does bounce back a little bit by having several characters grow in development in this season, but it's not as noticeable as a lot of the 'development' happens with the side characters that get far less screentime than they deserved.  Not to mention some characters feel different than they were previously in previous seasons.  (Cue Mari, who feels more child-like to her previously smart appearances.)\\n\\n\r\nAll in all, while this season of Yuru Yuri was by no means bad, a lot of what made the Yuru Yuri series great just didn't feel like it was there or was blocked off by Chinatsu's excessive fangirling.  (Seriously though, they go overboard with the whole Yui-worshipping thing.  Far more than they should've.)  It just felt too normal, and normality is not something that I expected from this show.\\n\\n\r\nOverview:\\n\r\n+ Same Yuru Yuri plotline\\n\r\n-  A lot of the old format is missing or watered down\\n\r\n-  Lack of some iconic gags\\n\\n\r\nCharacters: Characters in Yuru Yuri are still present and accounted for.  We still have the main four girls, Akari, Kyouko, Yui, and Chinatsu.  There's still the student council consisting of Rise (who gets FAR too little screentime.  Even less than before), Ayano, Himawari, Sakurako, and Chitose, and the other girls that come in and out of the screen whenever they need to.  \\n\\n\r\nOne of my complaints about the characters is that there are some that don't really show up or are so pointless to the series that they never show up.  This includes Akari's sister, Chitose, who only shows up 3/4 of the way into the series, Nishikagi, and the whole Mirakurun cast.  While they were never the most vital characters in the series, it was a bit sad to see already pronounced and known characters be shoved even further into the background.  They were a part of what I felt made Yuru Yuri more exciting as a series and as such, contributed to the lack of spark that this season has.  \\n\\n\r\nOverview:\\n\r\n+ Main cast is all here and accounted for\\n\r\n-  The more side characters get little to no screentime and are mostly absent from the series\\n\\n\r\nArt: As I mentioned before, Yuru Yuri's third season was produced by TYO Animation instead of the two previous seasons' makers, Doga Kobo.  As such, the artwork for San Hai is a lot duller in comparison to the brighter and more colorful artwork that the characters had before.\\n\\n\r\nWhile the characters looks the same in terms of design, the color palette just isn't all the bright, as the normal colors of the characters are muted to look a bit grayer than normal, and the lack of exaggerated comedic effect doesn't really happen here.  Akari's buns don't pop off, we don't get too many stylistic changes in order to show off a more comedical moment, or anything like that.  It just feels a bit bland and odd.\\n\\n\r\nOverview:\\n\r\n+ Characters look the same\\n\r\n-  The different color palette and lack of comedic appearance made the show look more bland.\\n\\n\r\nSound:  The sound for Yuru Yuri isn't really something that I found to ever really be all that exciting.  The opening and the ending of this season are both songs that reflect the show's general excitable and energy-filled feel, but don't really have much of a place in anime as a memorable soundtrack.  They both pretty much sound the same and while are good, aren't really tracks that I found to be worth remembering.\\n\\n\r\nOverview:\\n\r\n+  Good soundtrack\\n\r\n-  Not really all that memorable\\n\\n\r\nPersonal Enjoyment:  While Yuru Yuri was never really my first go to choice when it came to watching a high school comedy about 4 girls (because lord knows we have plenty of those), this season just felt a bit like a disappointment.  Not only because of the lack of Akarin (seriously, what happened to that gag?  I want it back!) but because the show didn't feel the same as it did before.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nI'll admit, it was still rather fun to watch.  Kyouko makes the world go round and all of her antics make up Yuru Yuri, so I'm happy to see that she still takes the spotlight and moves the plot forward as much as she can.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nAside from the lack of appearance for a lot of cast members and a lot of comedic changes since they relied mostly on comedic retorts and Kyouko antics for the majority of the series, the one thing I was not happy about was how much they focused on Chinatsu.  As a character, Chinatsu's entire schtick was the fact that she wanted Yui-senpai to notice her.  As such, the show focused what I felt like an excessive amount of time on her and her gag and not really on others as much.  This created an imbalance that I personally was not too keen on.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you've seen any of Yuru Yuri, I would say tread lightly on this one.  Because the production change made so many things different in the series, I'm a bit on the fence as to suggesting this for Yuru Yuri fans, especially those familiar with the anime.  While it still is the same base concept and the same characters, there's just something about it that feels off when watching it.",
            "date": "2015-12-21T17:29:00+00:00",
            "helpful_count": 43,
            "mal_id": 206340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206340"
        },
        {
            "content": "Yuru Yuri is back for its third season, and with it has come a change in studio. As we know, it is not common for a series to receive more than one to two seasons unless it is highly successful in Japan. There is a clear understanding that studios behind multi-season anime have lofty standards to fulfill. This expectation now falls on TYO Animations as it produces one of the most beloved shoujo ai. So far, the studio understands what it has to accomplish as OVAs Yuru Yuri Nachuyachumi! and Yuru Yuri Nachuyachumi!+ have been received well. \r\nThe story of Yuru Yuri San Hai isexpected for its shoujo ai and slice-of-life genres. There is not anything particularly revolutionary, however, there is nothing wrong with this whatsoever. It follows a formula which continues to work and does not need to be fixed. \\n\\n\r\nMore specifically, Yuru Yuri San Hai is a continuation of the first two seasons and, like these seasons before it, follows its source material, the manga of Yuru Yuri. I do not know how closely it follows the manga because I have not read any of it just yet. This definitely will change. The story does well in showing development of characters and progression of the many (subtly romantic) relationships between them. I have to add, while essentially every character undergoes them, these developments are not equal. Meanwhile, some characters experience only personal growth or only a change in their relationship with one or more others.\\n\\n\r\nThe pacing is just right. No episode seems to be a filler in the sense that personal development or development of at least one relationship is not occurring for a substantial part of it.\\n\\n\r\nThe comedy also is good, although in comparison to seasons one and two, it is more calm. I am not sure if this is because of the source material or a decision on TYO Animations’ part, but much of the exaggerated humor is no longer here. I am somewhat fine with this because it allows the aforementioned developments to be more of the focus. Still, this becomes a detriment to some of the characters as humor is a major component of their roles in prior seasons.\\n\\n\r\nIn addition, the story’s conclusion is endearing and leaves me wanting more. I believe it’s the type of ending one expects of comedic slice-of-life, and it fortunately is neither abrupt nor leaves major plotlines unexplained. As Yuru Yuri is not a complex drama by any means, I would be surprised if creators somehow do not resolve major plotlines in a cute, relaxed slice-of-life such as this.\\n\\n\r\nSince a new studio directs the Yuru Yuri franchise, the change in art style perhaps is the most important part of the series. TYO Animations still is a relatively new studio, with its first animation created in early 2010. According to MyAnimeList’s database, currently, its three most popular series are B Gata H Kei, Ookami Shoujo to Kuro Ouji, and Shinryaku! Ika Musume in this order. I have not seen these or other works created by TYO Animations. Therefore, Yuru Yuri San Hai is my first exposure to its art style and its production as a whole.\\n\\n\r\nAs for its art style, personally, I enjoy it. There are subtle differences between TYO Animations’ and Doga Kobo’s art styles, such as, most notably to me, the color palette. The current studio uses a slightly muted one for the characters. A good way to check this is to compare the current hair colors of the characters to their Doga Kobo counterparts. For example, you will notice that Yui’s hair is a dark purple in the first two seasons and black in Yuru Yuri San Hai. This is also true for her and the other characters’ eyes, which typically are not as bright in their current designs. I had not noticed either of these until closer inspection. Even now that I know, I do not mind this change in the color palette. I also find the background art to be rather impressive with its photorealistic style. Lastly, this style as a whole and its quality remain constant throughout the season.\\n\\n\r\nNow, we come to the sound. \\n\\n\r\nThe seiyuus all have returned to comprise their roles, and they are as appropriate as ever. Their consistency reflects unwavering dedication to their roles. \\n\\n\r\nThe background music is appropriate, as well, but it does not stand out much. Certainly, this is not bad per se. After all, ill-fitting music too can stand out. The opening theme is cute and catchy with its quite up-tempo, orchestral production. I will admit I do prefer first season’s and second season’s themes in that order, but this can be attributed to my love of alternative rock and alternative metal. You may prefer this opening’s production because it does not contain an electric guitar. It does make a return in the ending’s theme mix of pop and metal, which I believe also is cute and catchy. Although between it and the opening, I ironically favor the opening due to its higher tempo.\\n\\n\r\nThe characters personalities, with one notable exception, remain unchanged. They react to situations and events in ways I would expect for the slice-of-life genre. I essentially have been able to relate to them, particularly in moments where one or more characters misinterpret something another states or does. As I explained earlier, characters experience personal growth or growth in their relationship with at least one other character, although to varying degrees. None of them retrogress in either regard, but some are almost completely static in not just one aspect but both. I expected this for some characters due to Yuru Yuri’s large cast. Still, I am a little surprised at a few who seem to have been left behind. Perhaps, there is more development in the currently ongoing manga and to come in a later season for the TV adaptation.\\n\\n\r\nTo conclude, Yuru Yuri San Hai is an example of a successful formula which does not need to be overhauled. Growth and/or other changes relating to character development and relationships are fine and even expected, of course. I only state Yuru Yuri does not need suddenly to become avant-garde or some other genre for the sake of innovation. Instead, I believe a person like myself prefers to see creators build on the successful foundation which has been laid. This series continues to do that now with the great job TYO Animations has done. I wish them the best of luck with any future installments if there are any, and I certainly am looking forward to catching up on the Nachuyachumi! OVAs. Yuru Yuri San Hai receives a 9 because, while I enjoy the developments of individual characters and their relationships, I believe some of these characters do not receive all of the attention they deserve and the humor is a little too compromised. The humor may signal the series is going into a more mature direction, which I accept if that is the case. Nevertheless, I understand it must come to an end after a while, as well. However, judging just by the response on MyAnimeList, (mostly Western) fans of Yuru Yuri haven’t had enough of this just yet. I know I have not. I will rewatch this at some arbitrary time from now, and I definitely want to own all of it as a part of my personal collection one day.",
            "date": "2015-12-21T19:50:00+00:00",
            "helpful_count": 24,
            "mal_id": 206356,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4331463.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Symphopathy",
                "username": "Symphopathy"
            },
            "url": "https://myanimelist.net/reviews.php?id=206356"
        },
        {
            "content": "I'm going to start off by saying that I'm a picky rater of anime in MaL standards, and that I'm going to be covering the first two seasons briefly in order to explain this season.\r\n Devoid of any heavy plot it's impossible to rate the \"story\", however I will rate how well the show was written, or the script. The show has many recurring jokes and character traits that they write in so well that you don't get the feeling that they're just putting it in because they feel obliged to, instead, cleverly written in at perfect times. The plot of each episode also doesa very good job of not being boring, sure not much might be happening, but it is never boring. \\n\\n\r\nThe art is fantastic for what the show is trying to portray, it has a very unique style that you can look at and know from your first glance that this is most likely a light hearted comedy. The soundtrack is not that memorable but the voice acting is fantastic. Every seasons Opening and Ending songs have also had a lot of effort and detail put into them and are what I would consider to be good.\\n\\n\r\nThe characters are what make this show one of my favourites, Yuru Yuri is an all female show with little to no men at all, this is a scenario that I am a huge fan of (like K-on!) because when there's men and women in a slice of life, there's usually drama, not in Yuru Yuri, there's not a second of drama in this show. \\n\r\nEach character has a unique interaction with each other and the script gives moments to each girl to have a chance to spend time with different friends. Lesbian undertones are a great change of pace as it's something I haven't seen elsewhere, the show features my favourite and one of the funniest tsunderes of all time as well.\\n\r\nIt should also be stated that the show does not have one main character that it \"follows\" from their perspective, it rotates around the four main girls.\\n\\n\r\nNow that that's out of the way I'll explain why I think Season 3 is the best season. \\n\r\nSeason 1 and 2 do a great job setting the tone, developing the characters (thus adding rewatch value), establishing jokes, etc. \\n\r\nBut Season 3 is where it all just clicks perfectly, it is the most enjoyable season by far and it is written under the assumption that you have already seen the first two seasons and therefore doesn't try to reintroduce the characters to you and all that, but instead it throws you right into what you loved about the previous seasons. \\n\\n\r\nThe popularity of this season is astonishing (19,000 members that have completed the show at the time of writing this), hopefully they have enough funds to make another season because I certainly haven't seen enough of this show yet.\\n\r\n My enjoyment is an easy 10/10, is the show perfect? no. is the show for everyone? absolutely not. But if you enjoyed the first two seasons, I unbelievably highly recommend that you watch this, you will not be disappointed. \\n\\n\r\n9/10\\n\r\nThanks for reading, if you found this review helpful or had something you wanted to talk about, feel free to message me.\\n\r\nburnso",
            "date": "2016-04-07T13:35:00+00:00",
            "helpful_count": 24,
            "mal_id": 215768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4507858.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/burnso",
                "username": "burnso"
            },
            "url": "https://myanimelist.net/reviews.php?id=215768"
        },
        {
            "content": "Namori's Yuru Yuri has had two fairly strong series from Dogakobo. My biggest issue with the second was the overuse of Akane and her single unfunny joke. From early October to late December of last year, there was a third series, this one from TYO Animations. Yuru Yuri San Hai. Does the studio transition work to the series' favour?\r\nStory:\r\nLike the other two series, San Hai doesn't have much in terms of a narrative. A group of junior high girls go about their everyday lives having quirky, and highly Sapphic, fun. It's primarily a comedic work so the question we have to ask is how welldoes the comedy fare in this one?\\n\\n\r\nMy biggest issue is with Akane, again. We get it, she has incestuous feelings for her little sister. It's really not funny. It was funny the first time when you used it for a horror parody. Ever since then it hasn't been funny, it's just been an unnecessarily creepy element in a light-hearted comedic work. To be fair, though, her role is downplayed in this series and the stuff with her and Tomoko is actually pretty decent. Aside from that, the series is really entertaining with a lot of strong comedic and cute moments. One of the interesting things they do is emphasise the interactions between characters who haven't had much, if any, time together and it actually works really well, demonstrating a fuller range of comedic possibilities with the set up they have. Overall, the comedy almost always works well and it is quite charming.\\n\\n\r\nCharacters:\\n\\n\r\nThe cast of characters in Yuru Yuri isn't the most complex. However, they are largely charming and they have good interactions for comedic purposes. Sakurako is probably the strongest in this particular series since a lot of the funniest moments, and some of the cutest, revolve around her. Ayano also gets a lot of strong scenes in this one.\\n\\n\r\nArt:\\n\\n\r\nThe artwork is bright, vibrant and suits the series well. TYO does a good job of replicating the look of the prior series and backs it up with solid animation.\\n\\n\r\nSound:\\n\\n\r\nThe cast remains a strong point of the series. Ootsubo Yuka, Mikami Shiori, Tsuda Minami, Ookubo Rumi, Mimori Suzuko, Katou Emiri and the other actresses all deliver strong performances. The music is really good too and suits the series well.\\n\\n\\n\r\nHo-Yay:\\n\\n\r\nThere are a lot of cute yuri scenes. Chinatsu's crush on Yui is still a big thing. Kyouko is still flirting with all the girls. Ayano and Kyouko get some really good scenes. Sakurako and Himawari get a couple good moments of their own. Chitose's fantasies are as vivid as always. About the biggest addition to this series, in terms of yuri, is that Chizuru gets some scenes with her classmates. The girls in this are homo-erotic that I think it may be heading for a future where they've started a poly-amorous coven. I can't decide whether that would be the greatest or the dumbest sequel of all time. Given the franchise as a whole and its atmosphere, I'm leaning more towards the former. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nYuru Yuri San Hai is an entertaining series with a lot of charm and endearing characters. My one complaint about the series is only really a major problem in one episode. All in all, I think it's the best instalment of the franchise thus far. Overall, I give it a 9/10. Next week I'll take a look at Studio Ghibli's Whisper of the Heart.",
            "date": "2016-01-13T10:48:00+00:00",
            "helpful_count": 12,
            "mal_id": 208439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=208439"
        },
        {
            "content": "To be fair, you have to have a very high IQ to understand Yuru Yuri. The humour is extremely subtle, and without a solid grasp of Japanese culture most of the jokes will go over a typical viewer's head. There's also Akari's nihilistic outlook, which is deftly woven into her characterisation- her personal philosophy draws heavily from Narodnaya Volya literature, for instance. The fans understand this stuff; they have the intellectual capacity to truly appreciate the depths of these jokes, to realise that they're not just funny- they say something deep about LIFE. As a consequence people who dislike Yuru Yuri truly ARE idiots- ofcourse they wouldn't appreciate, for instance, the humour in Akari's existential catchphrase \"AKARIIIIIIIIN,\" which itself is a cryptic reference to Turgenev's Russian epic Fathers and Sons. I'm smirking right now just imagining one of those addlepated simpletons scratching their heads in confusion as TYO animation's genius wit unfolds itself on their television screens. What fools.. how I pity them. 😂\\n\\n\r\nAnd yes, by the way, i DO have a Kyoko tattoo. And no, you cannot see it. It's for the ladies' eyes only- and even then they have to demonstrate that they're within 5 IQ points of my own (preferably lower) beforehand. Nothin personnel yuru 😎",
            "date": "2018-10-09T04:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 291314,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7451148.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Amajor",
                "username": "Amajor"
            },
            "url": "https://myanimelist.net/reviews.php?id=291314"
        },
        {
            "content": "Finally, my third review for the third season for the anime I found to be truly interesting in its entirety. As usual, I start my article with a praise pertaining to the series as it is truly praiseworthy as well as great overall.\r\nThere is a saying that goes like: \"Do not take in more than what you can chew.\"\r\nWho cares? The anime is so great that I can't stop watching it. Every time my cellphone (I watch using my phone) discharges, I try my best to suppress my disappointment. Why did they even make cellphones have limited energy, by the way? (An everlasting power sourceis impossible. Wait for another million years.) Everything I assumed that was going to be there was…ummm....there. \\n\\n\r\nFollowing the events of the first season, then the second season, again, the story, or not-a-true-story-because-it-has-no-plot centers around the main characters Akari, Kyouko, Yui and Chinatsu, again, in their Amusement Club in the Tea Club's clubhouse, along with the supporting characters Ayano, the Ikeda twins, Sakurako and her sisters, Himawari and Kaede, Nishigaki-sensei and Matsumoto, Akari's sister Akane, and others who are again,for a third time, in an all-girls school with many comedic routines, a little drama that I really found entertainment at. Truly astounding.\\n\\n\r\nThe three seasons has a theme that reflects each of us in our lives: Friendship. The scenes in it signifies it so much that, in some scenes, you can relate yourself with the characters. Even if you come across many difficulties in life, you can overcome it with people that you care for. And that's what friends are for. You share precious memories, have fun together, and even face hardships together. That's what I think Yuru Yuri is all about. And that's what I think that makes it interesting and outstanding. Don't you have any friends? I find that hard to believe. If not, then I don't think this is for you. May you be seeking for something sexual? Oh, well.\\n\\n\r\nAs long as there is Yuru Yuri, I can never get tired of the arts it has to offer. I am quite like Chinatsu, who is terrible at drawing. But nevertheless, the arts in it are satisfying that I yearn for more. The drawing, the animations, all of them. Truly wonderful and sophisticated work made by the anime industry. The character designs, too, even though unchanged, never gets old and are something invaluable to even consider.\\n\\n\r\nThe music. Even though I didn’t like the third season’s OP and ED that MUCH, (Note: Much…that means I still liked it. Who wouldn’t like something they like, anyway?) it was still an exhilarating experience to me that I got the chance to listen to it. Before I really say that I didn’t like the OP and ED that much, I really LOVED that ED at the end of the series itself because of its relaxing tone and the meaning (I can understand Nihongo, that’s why I can get the meaning beyond than what the subtitles say.) I loved it that I can even sing the lyrics while typing it at the same speed. And that’s not a hyperbole.\\n\\n\r\n“kawaru koto no nai kono kimochi ga asu wo kagayakasete kureru”\\n\\n\r\nOh my…that song was truly fantastic.\\n\\n\r\nThe characters, I’ll say it again for it never changes, their significance never fades away. From the main characters up to the background characters, all of them played their roles along with their personalities wonderfully. They all played their part efficiently in order to make this experience watching Yuru Yuri truly unforgettable to me. The characters was a must-see encounter.\\n\\n\r\nAgain and again, I will say that this anime excited me the most when it came to content, art, music and anything that you might consider in what anime should be really is. Yuri? No. The theme is what I’m talking about. Even if its theme is yuri, love between two girls, the story within is really superb. I cannot say anything negative about this.\\n\\n\r\nOverall, the anime is simply splendid. \\n\\n\r\n.\\n\\n\r\n.\\n\\n\r\n.\\n\\n\r\nA simple afterword\\n\\n\\n\r\nBy writing three reviews in the span of three hours, I found myself satisfied. Not only this was a great achievement for myself, I also found out that my overall vocabulary isn’t that…good. I found myself finding synonymous words for great, nice, good and many more (like in my previous two reviews.) Phew. Now that’s good.\\n",
            "date": "2017-07-31T02:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 254308,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6297554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexPaulLEWZ",
                "username": "AlexPaulLEWZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=254308"
        },
        {
            "content": "Much better than the other seasons. I felt as if this season allowed you to know more about the characters and really added some beauty to the story. The other seasons kinda just put these characters in front of you and made them do entertaining things. This season, however, shows the relationships and bonds between different characters all while making you laugh and love them more. It just really made me care about the characters and relate to them and their various situations. Because of this I believe that overall this season should be considered as a prime example of good comedy anime.",
            "date": "2017-10-13T23:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 260719,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6256765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MusicalTsunami",
                "username": "MusicalTsunami"
            },
            "url": "https://myanimelist.net/reviews.php?id=260719"
        },
        {
            "content": "I think this review is completely biased by my opinion. Blast it, who cares? I love this show, and if you don't agree then that's perfectly okay. But this show really stands out as the best of Yuru Yuri so far, and if you're watching this show because you enjoyed the last two seasons, then I hope you can see what I mean.\r\nStory: 10\r\nThe story STILL hasn't changed. In fact, it has changed so little from the first season, the synopsis of Yuru Yuri San☆Hai! is LITERALLY \"Third season of Yuru Yuri.\" So, what makes this story outstanding in my eyes?\r\nFirst of all, it's simple.Even for slice-of-life genres, it is simple. Four girls who use an abandoned club room to hang out. It's totally against the rules, but the student council has a peace treaty with them.\\n\r\nWhat else? Obviously it would be unfair to argue using phrases such as \"lacking originality\" or \"not exciting\" since the show wasn't written to have a moving plot. So, how does it stay refreshing? Well, each season is roughly a year in the girls' timeline. The same year. That in itself is an interesting thing, not just because of it being somewhat novelty, but because there's some strangeness going on with the fourth wall. The characters themselves nearly caught on during the second season, that there was some sort of time loop going on, yet it sort of remains as an unmentioned thing. Sure, they are repeating the same year of middle school for the third time, but there are new events and nobody actually realizes it. Unlike Non Non Biyori Repeat where it actually rewinds to show more moments from the same year, Yuru Yuri continues moving forward.. without moving forward.\\n\r\nI probably just complicated the whole thing, but I just love the idea of it all.\\n\\n\r\nArt: 9\\n\r\nThe art is still amazing and cute, and there are some disturbingly graphic scenes involving blood and tears. I didn't notice any changes from the last season or the OVA, so I honestly don't know what else to say here. The animation in the opening and ending seem like a lot more effort was put into them, although the 3-D effects in the former make the actual characters seem sort of edited in. It could do with a bit more work there. The characters' expressions follow the same style, and I feel like the art fits the show. For the most part, Chitose probably causes the most controversy with her nosebleeds.\\n\r\nThe half-time intermissions are, if you ask me, much better than before. I like the still scene that has a different style than the rest of the show MUCH better than the character page thing. Not saying that was bad, but this is much more.. intimate, you could say.\\n\\n\r\nSound: 8\\n\r\nThe sound of this show has no issues. While I definitely think the music was a lot better in the second season, it still does the job well. I can never find a problem with sound effects, and while there was one specific episode where it sounded like it was a sample from a horror film, that didn't bother me. Not really. It might be scary, a little bit, but hey.\\n\\n\r\nCharacter: 10\\n\r\nAnd I thought that the previous seasons had it perfect, this show made me want to lower the ratings on the other shows just because the characters were so much more realistic in San☆Hai!.\\n\r\nFirst of all, every character who doesn't show up in the ending is a side character to me. So, the eight girls from the Amusement Club and the student council are the main characters.\\n\r\nThe reason I think this is that each character got the time they deserved. We saw a lot more of Mari-chan, Kaede-chan, and I won't list everybody. But what's most important, MOST important, is that there was a lot of character development. This season felt a lot more personal, a lot more intimate, a lot closer to the characters. There are plenty of scenes where one of the girls grows in one way or another, or where something special happens that surprises everybody. Yuru Yuri San☆Hai! is full of those moments.\\n\\n\r\nEnjoyment: 10\\n\r\nI would watch this entire series from the start. That's how much I enjoyed it. Not necessarily saying that everybody else has to enjoy it that much, but that's how I feel. I love this show, and this season has to be the best of Yuru Yuri so far.\\n\\n\r\nOverall: 10\\n\r\nFor my standards, this is a masterpiece. A masterpiece doesn't have to be the best, nor does it have to be unique. It just has to be something that was excellent in enough ways to make it deserving of the praise it receives. In Yuru Yuri's case: a simple story that still stays in motion, cute art and good illustration, lovable characters that have distinct traits and quirks, and thirty-eight episodes plus one movie to enjoy.",
            "date": "2016-01-05T22:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 207865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3606903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Symantra",
                "username": "Symantra"
            },
            "url": "https://myanimelist.net/reviews.php?id=207865"
        },
        {
            "content": "Yuru Yuri San Hai is the third season of the Yuru Yuri anime. \r\nTo be completely honest, I started the Yuru Yuri anime after the third season started airing so I was able to watch all the episodes in connection with one another. When I had reached San Hai, about 4-5 episodes have already aired. I immediately noticed how different the season is compared to the others.\r\nThe art style was actually very similar to the other seasons and if I didn't know better that a different studio handled it, I would think the style was the same. If I were to say which art styleI prefer it would probably be the third season because the characters look more detailed and mature. Though this also contributed to 'normalizing' the show as well. The backgrounds were pretty nice too and I've noticed some big changes with the setting/background art. Most of which were improvements in making the scenes more immersive.\\n\\n\r\nThe bgm wasn't too attention-attracting for me or maybe I just wasn't paying attention. However, I noticed that for this season I had a lot more easier time paying attention to the soundtrack maybe because the season lacked the immense silliness from the previous seasons that distracted me from it or because the bgms were catchier. The OP theme Chochocho! Yuru Yuri Capriccio!!!, I would agree with most others that it lacks in impact. As for the ED Acchu~ma Seishun!, I wouldn't say it's the best out there but it was better than the OP for me. I still prefer the music from S1 and S2. But the band in the ED theme was really cute!\\n\\n\r\nWhat I've noticed the most is that it seemed a lot more subtle and casual with less craziness happening. Even Chinatsu and Kyoko who are supposed to be the crazy ones in the show have been toned down. We don't get to see as much of Chinatsu's crazy side besides her obsession with Yui and occasional twisted tendencies towards Akari. Chitose also does not fantasize as much which isn't exactly a bad thing since it was getting old for me anyways. Though Kyoko is still completely random with her ideas but I definitely felt that she was more subtle. I don't know, I guess Kyoko seemed more immature in the previous seasons and seemed more reliable in the third season and I'm fine with this change too. However, one of the things that disappointed me was that the intro before the show starting with Akari is now gone but in its place, Akari is now more noticeable as a protagonist during the show. The eyecatches with the catchy music is now gone too but eyecatches normally portraying a scene still exist.\\n\\n\r\nOverall, I would say I enjoyed this show a lot and since this show aired on Mondays for me, for a while even if it was short, Mondays weren't as depressing and boring for me as before. No matter what, this show was able to somehow put a smile on my face after my dreadful tiring day of work. Even if this show was a lot more calm, it doesn't take away the core value of this show as one of the best or better slice of life comedy animes out there.\\n\\n\r\n10/10 for making my Mondays amusing.\\n\r\n9/10 because no Akari intros + not as much Chinatsu horror.\\n\\n\r\nSorry for wasting everyone's time with this boring and unremarkable review of mine if anyone noticed this review.",
            "date": "2016-01-12T00:04:00+00:00",
            "helpful_count": 7,
            "mal_id": 208328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Neptune-",
                "username": "-Neptune-"
            },
            "url": "https://myanimelist.net/reviews.php?id=208328"
        },
        {
            "content": "Akarinnn~! Haii~ Yuru Yuri, haji mare yo!! [mind the spelling]\r\nWell, with Fall/Autumn season coming to an end and moving on to winter season, of course most of the Fall/Autumn Anime series will conclude with 12 episode or continue till Winter season is over. Unfortunately, Yuru Yuri is not one of them as they only had 12 episodes. But I’m grateful that Yuru Yuri were given a green light to be animated for a 3rd season despite different studios being handled. Without further a due, let me give my thoughts and impressions as well as trying to keep the spoilers to its minimum level.\r\nAfterwatching Yuru Yuri Nachuyachumi and its specials which is the Yuru Yuri Nachuyachumi PLUS. I put a lot of trust for this studio to handle well for the third season, well after watching twelve whole episodes every week, they did a good job despite having some lack of comedic moments or those legendary nose bleeds from its previous studio. Story likewise, it maintains from what they had from the manga, well some may be cut out due to time slot issue, I may also assume that this continues from where the events of Nachyachumi and Nachuyachumi plus took place, And what made me think is that, Akari the supposedly main character for YRYR has a lot of screen time compared to the previous seasons. Other minor characters were also given more screen time, which is a welcome change for me (my opinions). Since this is a slice of life genre, no specific plotlines or whatsoever are needed, its main focus of the story is the everyday life of four girls doing their everyday lives such as club activities, weekend activities and more. Character development in this series, well I don’t really talk that much but most of the friendship bonding between all the girls are deepen and they tend to adapt with them, such Yui trying to use puns with Ayano. I’m glad that Akari wasn’t really treated badly by the new staffs compare to other since I’m pitiful for Akari to be left out, eventhough I miss some of the Akari jokes made by Dogakobo studio. Also, I’m glad that the story is rather kept simple and understandable rather than complex or a filler, complete cliché episode or rather being deus ex machina. \\n\\n\r\nMoving on to the art or animation, as it is handled by different studio, in this case handled by TYO Animations, I say it made a significant impact on Yuru Yuri’s fans perspective as they had previously accustomed to Yuru Yuri’s dogakobo art style [since they look more matured in TYO's animation], but nevertheless, it still retain some of the character designs of Yuru Yuri. I typically like Akari’s character design which she has retain most but not all of the design from previous season. The character eyes are also different and the facial reaction are good in some part and mediocre in some part for example Akari’s raped face. The typical non-stop nose bleed by Chitose is not there but TYO really did make Chitose nose bleed more splendid compare to Dogakobo. Anyhow, the animations is rather smooth and up to par with other anime, background images are vivid and splendid but some are too dark, which I don’t really mind as long I can see the character’s face. Overall I loved the animations and glad there aren’t many weird animation, or loop animation or a “power-point” style animation. Boy, do I love the Chinatsu x Yui art style, they sure do put a lot of effort to make it happen.\\n\\n\r\nSeiyuus are the key elements to make anime happen, without them, we will be back in the 1900s. I’m glad that they retain all the seiyuus from previous season, I imagine if they changed the seiyuu, it wouldn’t be the same Yuru Yuri anymore, but I’m glad that the seiyuu members did not changed since I enjoy listening their comedic voice acting from the previous seasons. The OP song is pretty catchy, I don’t know why some people hate it or find it ‘sh*t’ [that maybe their own perspective] as for me I find it nice, well one thing that was missing is the Akari calls which I find it understandable why don’t include it. The ED song is nice but I don’t really like it. The OST for this series is rather different than the previous seasons, but in the end, it’s nice to hear. Overall, I’m happy they retain the seiyuus from the previous seasons and overall the OP,ED and the OST aren’t that horrible.\\n\\n\r\nFor the characters, all of the girls were given more screen time especially Akari, Akari used to had little screen time because of her lackness in amusement or specialty compared to Kyoko which she had more screen time, TYO decided to give Akari more screen time. With Akari having more screen time [despite having few episodes she didn’t appear], we see her interacting more with the other girls, and other than that, I enjoy seeing her cooking, helping each other and socializing with others. Ahh, adorable Akari. Kyoko on other hand, rather do dexterous things just to impress the girls and the viewers, I typically enjoy it. Overall, I don’t really talk much about the characters because it might take up a lot time to write so I sum it up that most of the characters have the same trait back in YRYR previous seasons, while Akari on the other hand has bigger impact due to having more screen time.\\n\\n\r\nLast but not least, I enjoyed watching this anime from where it started to aired, since then I commented on how enjoyable the episode it was in the forums up to the final episode. It also cleared me all the worries I had in my school and also help me reduce stress after having a load of school works in the weekend. Even if the comedic scenes are wrong timed, I still burst my laughter because Yuru Yuri is very funny and fun series even if the studio changed. Now with the season over, I’m kinda sad and disappointed since it only has 12 episodes but I’m rather grateful that it received a 3rd season [it ended up nicely, very warm and cute ending], and frankly I enjoyed it to the max! Hence, if you already watch the first and the second season, do watch the third season! Don’t forget the OVAs too, it’s good too. Even if it has Yuri genre, most of the scenes are basically slice of life type, don’t worry there are Yuri scenes too, haha. [Ayano x Kyoko]\\n\\n\r\nWith that I conclude this review with Story (7), Art (8), Sound (8), Characters (8), and Enjoyment (8) and with the overall 8 out of 10. I do apologize if the review is too long or too crap because I’m still a newbie of writing review, I do hopefully it is helpful as it can encourage more people to watch Yuru Yuri. With that, thank you for taking your time in reading it.\\n\r\nAnd have a nice peaceful day!~\\n",
            "date": "2015-12-21T13:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 206320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=206320"
        },
        {
            "content": "After watching the first two seasons of Yuru Yuri, I was really excited about the third one, and watched it as soon as I finished the second season. The problem turned out to be the show took a very different route, and failed in its purpose.\r\nSo the first season established some funny inside jokes and good character description, so it made the show funny and cute, which are a very good combo. The second season continued the things that made the first season a success, but added some relationships to promote the yuri aspect of it, making it all the better. We see relationships form,and progress throughout the season.\\n\\n\r\nHowever, the third season breaks this trend - it is decided that all the inside jokes should stop, and change the pace of the season completely separate to the first two, making it more slice of life, and less Yuru Yuri.\\n\\n\r\nI definitely see why they did it - they decided to focus on the \"yuri\" aspect of it, which is definitely welcome. However, adding a few extra yuri scenes doesn't really cut it for me, because we see almost no development of the relationship, and instead get frustrated by the encounters. Because it took the serious route, it lost all of the original Yuru Yuri touch, and it failed at being serious with no character development, which caused the whole season to fail. I forced myself to watch it because I really hoped it got better, but except for one episode, it was really boring.\\n\\n\r\nHowever, the worst part was Chinatsu. I get that some people might like how she loves her senpai Yui, and she does some crazy things to get her attention. Although I find it cringey, I get that some people like it, and it was pretty chill throughout the whole thing, so I largely wrote it off and continued to enjoy the show. However, I felt like most of the time that was the ONLY thing happening, and by god did it get annoying. We just have this girl getting close to raping Yui and being super cringe about it, and basically ruining everybody's day with it. I mean, I was hoping somebody would beat her up or kick her out or something, but alas, it did not happen. \\n\\n\r\nAlthough the rest of what I said really added to lowering the rating of this show, the Chinatsu thing was just awful. I was dying of boredom and fury at the end for her even existing. If you didn't really like her, you should never watch this season or you will be very disappointed.\\n\\n\r\nMy main reason for writing a review for this show is because it is an absolute DISGRACE this got higher ratings than both previous seasons, because it doesn't compare to the enjoyment of the first two. They were funny, cute, and full of yuri. This was boring, completely threw away the idea of Yuru Yuri, and failed at having any significant impacting yuri. You cannot just change the pace of the show like that - it just broke the flow of the show.\\n\\n\r\nIf you really liked Yuru Yuri, I would probably recommend because it will keep you awake at night if you don't finish it, but it's something that you can easily skip, especially if you didn't enjoy the series much.",
            "date": "2016-04-30T22:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 217570,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437457.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DaAwesomePwner",
                "username": "DaAwesomePwner"
            },
            "url": "https://myanimelist.net/reviews.php?id=217570"
        },
        {
            "content": "I had my doubts when I heard that a new studio was going to take over the series. I thought that the new season will not be capable of living up to Season 2 because of the new studio. Well, it’s safe to say that Season 3 is just as equally great as Season 2. \r\n[Story]: (8/10)\r\nThis is the 3rd Season of Yuru Yuri and is being created by a new studio called \"TYO Animation\". \r\nIf you've watched the previous seasons of Yuru Yuri then you should have noticed that the 3rd Season is a wee bit different than the 2nd Season. It's more calmernow..Calmer is probably not the word I'm looking for but this is the best word that I could say about the show. The first 2 seasons were way energetic than the 3rd Season. However, I am enjoying the 3rd Season as much as the 2nd season and here are my reasons why.\\n\\n\r\nFirstly, most of the characters who didn't get a lot of screentime in the previous seasons are getting more screentime here. For example, Sakurako and Himawari's arguments. There seems to be more argument towards these characters than the previous seasons. Since I'm a fan of their pairing and their arguments, I gotta say thank you \"TYO Animations\" for giving them more screentime. Now I won't have to read those Himawari X Sakurako fanfics anymore which I regret reading. Another example is Akari. She's now getting the same amount of screentime as Toshino Kyouko whereas in the first two seasons, she was not treated like a protagonist which was the running joke in the series. I admit, I'm going to miss the \"Akarin\" joke but on the other hand, I'm glad she's getting the amount of screentime a protagonist deserves. \\n\\n\r\nSecondly, the new jokes are different than second season but the new jokes surprisingly made me laugh like how second season made me laugh, even though S2 and S3 uses different gags. However, this is subjective because some might find S2's joke better than S3. If you're worried that the new studio replaced all the existing jokes then fear not because most of the existing jokes like Chitose's \"nosebleeds/yuri fantasy\", Ayano's puns, Chinatsu's horrible ass drawing and \"everything she designs are garbage\" joke, and etc. are still here. \\n\\n\r\nFinally, S3 has more Yuri....I mean, Shoujou Ai scenes than the predecessors. What I mean is the characters are all being lovey dovey towards each other but not to the point where it becomes a complete Shoujou Ai where the characters get together and starts dating or some shit. For example, there are more Toshino x Ayano (my favourite) moments and more Himawari x Sakurako (my 2nd favourite) moments. There are also some new \"character pairing\" moments that we haven't really seen in the previous seasons like the \"Toshino X Akari\" moment (so cute), Ayano X Yui moments (Ayano and Yui could (and probably should) form a new team together called the \"punny\" team.......No?......I'll leave) and etc. Goddammit, TYO..Why you want me to ship more characters?\\n\\n\r\nI am bummed out that the Akarin intro is gone. I always looked forward to Akarin's intro and her cute \"Yuru Yuri..hajimaru yo\" speech every episode and those intros never got old. They always cracked me up like Akari shooting down the UFO using her \"detachable\" hair buns thingy in her hair or Akari spreading her disease called \"Akarin\" to her friends. I am also bummed out that the \"eyecatches\" are gone which usually happens before and after the commercial break.\\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (9.5/10)\\n\r\nI am SO GLAD that a new animation company has taken over and produced Season 3 of Yuru Yuri. The background are a lot more detailed and their club room is where you'll spot the huge major changes plus the visuals and lighting are a lot better than the second season. The character designs are also better than S2 but the changes aren't that huge. The only changes that I saw in S3 that is different than S2's character design is their hairs which looks more glossy and shinier and their eyes which also looks more coloured and shinier \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8.5/10)\\n\r\nNothing really changed in the soundtrack department. The background theme sounds the same as S2 when a funny scene is playing, when they're fooling around or when they're having a normal conversation. Now the OP and ED theme song.\\n\\n\r\nThe OP theme song is \"Chochocho! Yuru Yuri?Capriccio!!!\" by Nanamori Chu?Goraku Bu and the ED theme song is Acchu~ma Seishun!\" by Nanamori Chu?Goraku Bu. I'm a fan of Yuru Yuri's OP because they're pretty catchy to listen to except for this OP. It's not bad but it's not great either. It's decent and it's really not that catchy. The ED theme song....three words, I love it. I mean, it's not better than Yuru Yuri's (S2) ED theme but it is definitely going in my top 3 favorite Yuru Yuri ED theme songs. \\n\\n\r\nNow the Voice Actors.. I heard some rumor that most voice actors were replaced due to a change in studio but I'm glad the rumor was false. Who would want Akarin's VA to be replaced? Her voice is amazing, especially when she screams. Who could also forget Ayano's \"TOSHINO KYOUKO!\" scream and her \"hilarious\" puns. \\n\r\n______________________________________________________________\\n\r\n[Characters]: (8/10)\\n\r\nLike I said above, the show is a lot more calmer than the previous seasons. The whole reason why the previous seasons were so energetic and lively is because of Toshino Kyouko. What happens if she starts to mature bit by bit? Well, you get this..Look, Toshino is still the most immature character in the series, along with Sakurako but if you compare the Toshino from this season and the Toshino from the previous seasons, you’ll notice that she has matured a little bit…By “little bit”, I mean 5 or 10% increase in maturity. \\n\\n\r\nThe characters are all still mostly the same. Chinatsu still drools and fantasizes over Yui, Akari is still the same ol’ clumsy girl except she now gets more screentime, Ayano still “non-intentionally” makes puns which aren’t even that great to begin with. As you know, Ayano is a lesbian tsundere and she was always on her \"tsun tsun\" side in the previous seasons. Well now, she's now on her \"dere dere\" side most of the time. Sakurako is getting way more immature which I’m ok with, Himawari’s tolerance on Sakurako seems to be increasing, and Chitose’s “nosebleed/fantasy yuri” is animated a lot better than the previous seasons.\\n\r\n______________________________________________________________ \\n\r\n[Enjoyment]: (9/10)\\n\r\nI honestly enjoyed the 3rd Season of Yuru Yuri as much as the Second Season. The jokes may be different than S2 but it is making me laugh like S2 did. It's also nice to see my favorite pairings like \"Toshino X Ayano\" and \"Himawari X Sakurako\" scenes get more screentime. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\n“Yuru Yuri San Hai (S3)” is a great addition to the Yuri Yuri series. It feels different than the 2nd Season so the new season feels kinda fresh and new for me. The studio may have handled the 3rd Season differently than \"Doga Kobo\" (The studio who made the first and second season of Yuru Yuri) but they did an amazing job handling the new season and not making it a piece of crap show. If you’ve watched the previous seasons then I recommend that you give the 3rd season a watch.\\n\\n\r\n[OVERALL]: (9/10)\\n\\n\\n\r\nPros:\\n\r\n+New Studio did a great job handling the 3rd Season\\n\r\n+Some existing jokes made a return for this season\\n\r\n+Animation by the new studio looks great\\n\r\n+Great Soundtrack\\n\r\n+More \"Character Pairing\" Moments\\n\r\n+Show is still funny\\n\\n\r\nCons:\\n\r\n-Some existing jokes are gone\\n",
            "date": "2016-01-02T12:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 207571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=207571"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nI think first main thing I would like to mention about this season, is that, this time it felt more of slice-of-life than a slapstick comedy. Whilst first season I enjoyed for its erratic comedy, this one I enjoyed more of its cute and laid back attitude. \r\nStory is pretty much with same concept. Kyouko and her team chills around with her friends, doing club activities and having lesbian fantasizes. But as mentioned before this one was more of a slice-of-life as it had quite some \"dramaand romance bait\" and less erratic comedy. SO in that aspect, comedy-wise its worse, but the polished feel of cute girls doing cute stuff in a slice-of-life genre. It's better.\\n\\n\r\nI did really enjoy this season opening. Rest of music and art value is pretty much same. It's simple, bright and fun.\\n\\n\r\nSo overall I did enjoy this, kinda got bored or tired of these characters now and then, but in the end I did enjoy this, thus I'll give it 7.",
            "date": "2017-08-20T10:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 255881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255881"
        },
        {
            "content": "This is the best SOL comedy anime.  There are yuri tease moments(sorry, most of the anime is yuritease moments) and unique characters.  Every episode is extremely unique, but most past episodes are never mentioned.  Also, somthing YRYR has going for it is the fact that the characters are all in middle school, which I have never seen in other romance animes.  This is great if you want to have a good laugh, and in my opinion I would rate it #1 on MAL.  The only thing it needs is better music, and what the devs need to do is makethis series have about 5 seasons, to not give people Post-Anime Depression for a while.",
            "date": "2017-06-30T10:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 251521,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6356010.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Misteroid",
                "username": "Misteroid"
            },
            "url": "https://myanimelist.net/reviews.php?id=251521"
        },
        {
            "content": "(this is my first review, and as a heads up, i'm not a big fan of huge fleshed out reviews. I just want to write a simple summary of what i thought and why i think it's worth my time writing up my feelings about this show)\r\nso i finally finished watching Yuru Yuri San Hai and wow..\r\nvery different than the the first two seasons..\r\nand now that i know it's because it's made from a different studio, that makes much more sense.\r\n(this new studio also made the OVA's, which really surprised me since i didn't enjoy the OVA's half as much as i enjoyed S3)\r\nimo, S3is my favorite type of Yuru Yuri.\\n\r\nbut more so as a great complement to the first two seasons rather than seeing it as a superior version.\\n\r\nA gift to the fans, but with fan service turned to 11.\\n\\n\r\nIn the first two seasons did you feel there was not enough yuri? well here you go.\\n\r\ndid the slice of life moments became too dull? let's speed the pace up a bit.\\n\r\nwere you tired of the same settings, same jokes, same relationship setups? we'll move things around and shake things up.\\n\r\nThis season puts more emphasis on the yuri and comedy.\\n\\n\r\ni never lol'd as much for the first two seasons as i did for S3.\\n\r\nTYO Animations fixed everything i considered to be\\n\r\nnegative or \"good at first but became annoying\" moments from the original two seasons.\\n\r\nwe saw settings that were never used before.\\n\r\ninteractions between characters that were never in a room alone together.\\n\r\nactual background characters to show these girls weren't the only ones in this school. and many more throughout.\\n\r\nA few tropes from the first two season were left out.\\n\r\nlike the Akarin intro's, and the gags about her small presence in the group, and also Chitose's yuri fantasies.\\n\r\nbut i will happily trades those for more Kyoko x Ayano scenes\\n\r\n(which is what we got, a very rewarding amount and quality of it)\\n\\n\r\nIf you enjoyed the first two seasons.\\n\r\nI can only assume you'll enjoy the 3rd season just as much, if not, more.",
            "date": "2016-06-01T02:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 219764,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kdsamreuang",
                "username": "Kdsamreuang"
            },
            "url": "https://myanimelist.net/reviews.php?id=219764"
        }
    ],
    [
        {
            "content": "The Yuru Yuri franchise is what I have always considered to be my all-time favorite slice of life comedy. Kyouko's crazy antics, Akari's lack of presence, Chinatsu's magic hair and all the yuri elements that come along with it... all-in-all it's just too good. Now as much as I'd like to say that you should already know exactly what to expect from San Hai based on the previous seasons... that's actually not entirely true. You see unlike the first two seasons that were adapted by Doga Kobo, San Hai (as well as the Nachuyachumi OVAs) are produced by a less known company called TYO Animations;most famous for previous works such as B Gata H Kei, Squid Girl, Plastic Nee-san and the majority of Tamayura. This new studio brings with it some notable changes to the third season compared to the first two, and that's what I primarily want to talk about in this review.\\n\\n\r\nIn general, San Hai is a lot more... *calm* than the previous seasons. There is a lot less utter chaos and over-the-top gags utilized this time around, and instead it is replaced by more traditional, relaxing slice of life scenes. Now this does not mean that it's suddenly like Non Non Biyori exactly, it's still a lot more hyperactive than that but not to the extent which the series has been in the past. Akari is pretty much always noticed now. There are very few jokes utilized regarding her lack of presence anymore. Similarily, I don't think there was a single scene in San Hai where Chinatsu's supernatural hair comes into effect (like how it absorbed ping pong balls and stuff in the past), and the amount of yuri fantasies on Chitose's behalf has been cut down quite a lot. Even Akari's classic intro segment that used to start every episode in the past is now completely gone. And all of this is quite a shame to me, because it was that type of craziness that made the series stand out so much from the crowd and originally made me fall in love with it. Of course it's not like *all* the old running gags have been thrown out; some of them naturally persist such as Chinatsu's horrendous artistic skills for example, but they're definitely not quite as prevalent as before. That being said, even if San Hai is a lot more 'normal' in comparison... it still makes it work a lot better than I feared it would. And this is primarily because although some good things may have been lost, some good things have also been gained in the process.\\n\\n\r\nMost notably, the amount of yuri scenes has been significantly increased. I'm not talking about Chitose's fantasies here (those have decreased in number after all), I'm talking about actual events here. There is no need for Chitose to fantasize about things when they're actually playing out in reality instead, right? Kyouko x Ayano, Sakurako x Himawari, Chinatsu x Yui, Tomoko x Akane x Akari, etcetera. All of these couplings and more get some truly heartwarming moments together and it's a treat to see. So I guess you can say that the quality of the show itself hasn't changed, but the focal point has. Instead of the wacky comedy that it used to be, it is now more of a shoujo ai slice of life anime. And given how rare yuri anime tend to be, I can never consider it a bad thing to get some more emphasis on that front.\\n\\n\r\nAnother thing that unsurprisingly has changed with the new studio is the art style. However, this change is very subtle to say the least. If I didn't know it was a different studio producing it I might never have noticed it. And even now if I make side-by-side comparisons of the old and new art, I still can't say one really looks any better than the other. It's about the same to me. And as far as the audio goes, the voice actresses are thankfully the same as before, and the background music is barely noticeable so I don't have much to say about it. The new OP and ED themes however... in my mind they were pretty disappointing, at least given that Yuru Yuri has had some great theme songs in the past, but both of these fell pretty flat to me. Though of course this isn't exactly a huge deal in the grand scheme of things.\\n\\n\r\nIn the end, San Hai is quite clearly different from what we've seen from Yuru Yuri in the past, but as for whether it's any better or worse... well that probably depends on who you ask. In my mind, either version works, albeit for different reasons, and despite everything what we got is still one of the better shows of the year. As I mentioned in the beginning, Yuru Yuri is and always has been my favorite slice of life comedy series ever, and as far as the comedy aspect goes then San Hai does not quite live up to the expectations I had on it. However, it makes up for that fact with an abundance of additional yuri elements instead, which is also perfectly fine with me. At the very least it still provided an incredibly entertaining anime, and you can't really ask for a whole lot more than that.",
            "date": "2015-12-21T11:50:00+00:00",
            "helpful_count": 99,
            "mal_id": 206302,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=206302"
        },
        {
            "content": "The Yuru Yuri series is by far one of the more popular and well-known Shoujo Ai series to exist in Japanese media.  Taking the simple concept of a high school comedy and mixing in its own unique characters, the series as a whole has become well known in the anime community.  But with it's third season, a lot of that luster seems to have faded over time, and with TYO Animation taking the reins this time in production instead of Doga Kobo leading to some...unexpected results.\r\nStory: The story of Yuru Yuri still maintains the same general plotline, featuring out four main girls, Kyouko,Yui, Akari, and Chinatsu spending time in their signature clubhouse as the Amusement Club, spending more time together with all of the other characters in the series and generally creating a lot of wackiness and moments that make the show so memorable and great.  That however is not the case this time around.\\n\\n\r\nAs a result of the production company change, this season feels a lot more disjointed and watered down from the original.  While a great number of the things from the previous seasons when the series was produced by Doga Kobo crossed over, such as Sakurako and Himewari's breast warfare, Chinatsu's fangirling over Yui, and Kyouko's extremely bubbly and Kyouko-like manner, a couple of the more signature things about the series before like some extremely wacky scenarios and most predominantly the lack of the vanishing \"Akarin~\" gag just don't exist in this season.  In fact, I will go as far as to say that the show as a whole lost a lot of its charm and felt a lot more standard and normal than it should've been.  \\n\\n\r\nThe show does bounce back a little bit by having several characters grow in development in this season, but it's not as noticeable as a lot of the 'development' happens with the side characters that get far less screentime than they deserved.  Not to mention some characters feel different than they were previously in previous seasons.  (Cue Mari, who feels more child-like to her previously smart appearances.)\\n\\n\r\nAll in all, while this season of Yuru Yuri was by no means bad, a lot of what made the Yuru Yuri series great just didn't feel like it was there or was blocked off by Chinatsu's excessive fangirling.  (Seriously though, they go overboard with the whole Yui-worshipping thing.  Far more than they should've.)  It just felt too normal, and normality is not something that I expected from this show.\\n\\n\r\nOverview:\\n\r\n+ Same Yuru Yuri plotline\\n\r\n-  A lot of the old format is missing or watered down\\n\r\n-  Lack of some iconic gags\\n\\n\r\nCharacters: Characters in Yuru Yuri are still present and accounted for.  We still have the main four girls, Akari, Kyouko, Yui, and Chinatsu.  There's still the student council consisting of Rise (who gets FAR too little screentime.  Even less than before), Ayano, Himawari, Sakurako, and Chitose, and the other girls that come in and out of the screen whenever they need to.  \\n\\n\r\nOne of my complaints about the characters is that there are some that don't really show up or are so pointless to the series that they never show up.  This includes Akari's sister, Chitose, who only shows up 3/4 of the way into the series, Nishikagi, and the whole Mirakurun cast.  While they were never the most vital characters in the series, it was a bit sad to see already pronounced and known characters be shoved even further into the background.  They were a part of what I felt made Yuru Yuri more exciting as a series and as such, contributed to the lack of spark that this season has.  \\n\\n\r\nOverview:\\n\r\n+ Main cast is all here and accounted for\\n\r\n-  The more side characters get little to no screentime and are mostly absent from the series\\n\\n\r\nArt: As I mentioned before, Yuru Yuri's third season was produced by TYO Animation instead of the two previous seasons' makers, Doga Kobo.  As such, the artwork for San Hai is a lot duller in comparison to the brighter and more colorful artwork that the characters had before.\\n\\n\r\nWhile the characters looks the same in terms of design, the color palette just isn't all the bright, as the normal colors of the characters are muted to look a bit grayer than normal, and the lack of exaggerated comedic effect doesn't really happen here.  Akari's buns don't pop off, we don't get too many stylistic changes in order to show off a more comedical moment, or anything like that.  It just feels a bit bland and odd.\\n\\n\r\nOverview:\\n\r\n+ Characters look the same\\n\r\n-  The different color palette and lack of comedic appearance made the show look more bland.\\n\\n\r\nSound:  The sound for Yuru Yuri isn't really something that I found to ever really be all that exciting.  The opening and the ending of this season are both songs that reflect the show's general excitable and energy-filled feel, but don't really have much of a place in anime as a memorable soundtrack.  They both pretty much sound the same and while are good, aren't really tracks that I found to be worth remembering.\\n\\n\r\nOverview:\\n\r\n+  Good soundtrack\\n\r\n-  Not really all that memorable\\n\\n\r\nPersonal Enjoyment:  While Yuru Yuri was never really my first go to choice when it came to watching a high school comedy about 4 girls (because lord knows we have plenty of those), this season just felt a bit like a disappointment.  Not only because of the lack of Akarin (seriously, what happened to that gag?  I want it back!) but because the show didn't feel the same as it did before.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nI'll admit, it was still rather fun to watch.  Kyouko makes the world go round and all of her antics make up Yuru Yuri, so I'm happy to see that she still takes the spotlight and moves the plot forward as much as she can.  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nAside from the lack of appearance for a lot of cast members and a lot of comedic changes since they relied mostly on comedic retorts and Kyouko antics for the majority of the series, the one thing I was not happy about was how much they focused on Chinatsu.  As a character, Chinatsu's entire schtick was the fact that she wanted Yui-senpai to notice her.  As such, the show focused what I felt like an excessive amount of time on her and her gag and not really on others as much.  This created an imbalance that I personally was not too keen on.\\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you've seen any of Yuru Yuri, I would say tread lightly on this one.  Because the production change made so many things different in the series, I'm a bit on the fence as to suggesting this for Yuru Yuri fans, especially those familiar with the anime.  While it still is the same base concept and the same characters, there's just something about it that feels off when watching it.",
            "date": "2015-12-21T17:29:00+00:00",
            "helpful_count": 43,
            "mal_id": 206340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=206340"
        },
        {
            "content": "Yuru Yuri is back for its third season, and with it has come a change in studio. As we know, it is not common for a series to receive more than one to two seasons unless it is highly successful in Japan. There is a clear understanding that studios behind multi-season anime have lofty standards to fulfill. This expectation now falls on TYO Animations as it produces one of the most beloved shoujo ai. So far, the studio understands what it has to accomplish as OVAs Yuru Yuri Nachuyachumi! and Yuru Yuri Nachuyachumi!+ have been received well. \r\nThe story of Yuru Yuri San Hai isexpected for its shoujo ai and slice-of-life genres. There is not anything particularly revolutionary, however, there is nothing wrong with this whatsoever. It follows a formula which continues to work and does not need to be fixed. \\n\\n\r\nMore specifically, Yuru Yuri San Hai is a continuation of the first two seasons and, like these seasons before it, follows its source material, the manga of Yuru Yuri. I do not know how closely it follows the manga because I have not read any of it just yet. This definitely will change. The story does well in showing development of characters and progression of the many (subtly romantic) relationships between them. I have to add, while essentially every character undergoes them, these developments are not equal. Meanwhile, some characters experience only personal growth or only a change in their relationship with one or more others.\\n\\n\r\nThe pacing is just right. No episode seems to be a filler in the sense that personal development or development of at least one relationship is not occurring for a substantial part of it.\\n\\n\r\nThe comedy also is good, although in comparison to seasons one and two, it is more calm. I am not sure if this is because of the source material or a decision on TYO Animations’ part, but much of the exaggerated humor is no longer here. I am somewhat fine with this because it allows the aforementioned developments to be more of the focus. Still, this becomes a detriment to some of the characters as humor is a major component of their roles in prior seasons.\\n\\n\r\nIn addition, the story’s conclusion is endearing and leaves me wanting more. I believe it’s the type of ending one expects of comedic slice-of-life, and it fortunately is neither abrupt nor leaves major plotlines unexplained. As Yuru Yuri is not a complex drama by any means, I would be surprised if creators somehow do not resolve major plotlines in a cute, relaxed slice-of-life such as this.\\n\\n\r\nSince a new studio directs the Yuru Yuri franchise, the change in art style perhaps is the most important part of the series. TYO Animations still is a relatively new studio, with its first animation created in early 2010. According to MyAnimeList’s database, currently, its three most popular series are B Gata H Kei, Ookami Shoujo to Kuro Ouji, and Shinryaku! Ika Musume in this order. I have not seen these or other works created by TYO Animations. Therefore, Yuru Yuri San Hai is my first exposure to its art style and its production as a whole.\\n\\n\r\nAs for its art style, personally, I enjoy it. There are subtle differences between TYO Animations’ and Doga Kobo’s art styles, such as, most notably to me, the color palette. The current studio uses a slightly muted one for the characters. A good way to check this is to compare the current hair colors of the characters to their Doga Kobo counterparts. For example, you will notice that Yui’s hair is a dark purple in the first two seasons and black in Yuru Yuri San Hai. This is also true for her and the other characters’ eyes, which typically are not as bright in their current designs. I had not noticed either of these until closer inspection. Even now that I know, I do not mind this change in the color palette. I also find the background art to be rather impressive with its photorealistic style. Lastly, this style as a whole and its quality remain constant throughout the season.\\n\\n\r\nNow, we come to the sound. \\n\\n\r\nThe seiyuus all have returned to comprise their roles, and they are as appropriate as ever. Their consistency reflects unwavering dedication to their roles. \\n\\n\r\nThe background music is appropriate, as well, but it does not stand out much. Certainly, this is not bad per se. After all, ill-fitting music too can stand out. The opening theme is cute and catchy with its quite up-tempo, orchestral production. I will admit I do prefer first season’s and second season’s themes in that order, but this can be attributed to my love of alternative rock and alternative metal. You may prefer this opening’s production because it does not contain an electric guitar. It does make a return in the ending’s theme mix of pop and metal, which I believe also is cute and catchy. Although between it and the opening, I ironically favor the opening due to its higher tempo.\\n\\n\r\nThe characters personalities, with one notable exception, remain unchanged. They react to situations and events in ways I would expect for the slice-of-life genre. I essentially have been able to relate to them, particularly in moments where one or more characters misinterpret something another states or does. As I explained earlier, characters experience personal growth or growth in their relationship with at least one other character, although to varying degrees. None of them retrogress in either regard, but some are almost completely static in not just one aspect but both. I expected this for some characters due to Yuru Yuri’s large cast. Still, I am a little surprised at a few who seem to have been left behind. Perhaps, there is more development in the currently ongoing manga and to come in a later season for the TV adaptation.\\n\\n\r\nTo conclude, Yuru Yuri San Hai is an example of a successful formula which does not need to be overhauled. Growth and/or other changes relating to character development and relationships are fine and even expected, of course. I only state Yuru Yuri does not need suddenly to become avant-garde or some other genre for the sake of innovation. Instead, I believe a person like myself prefers to see creators build on the successful foundation which has been laid. This series continues to do that now with the great job TYO Animations has done. I wish them the best of luck with any future installments if there are any, and I certainly am looking forward to catching up on the Nachuyachumi! OVAs. Yuru Yuri San Hai receives a 9 because, while I enjoy the developments of individual characters and their relationships, I believe some of these characters do not receive all of the attention they deserve and the humor is a little too compromised. The humor may signal the series is going into a more mature direction, which I accept if that is the case. Nevertheless, I understand it must come to an end after a while, as well. However, judging just by the response on MyAnimeList, (mostly Western) fans of Yuru Yuri haven’t had enough of this just yet. I know I have not. I will rewatch this at some arbitrary time from now, and I definitely want to own all of it as a part of my personal collection one day.",
            "date": "2015-12-21T19:50:00+00:00",
            "helpful_count": 24,
            "mal_id": 206356,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4331463.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Symphopathy",
                "username": "Symphopathy"
            },
            "url": "https://myanimelist.net/reviews.php?id=206356"
        },
        {
            "content": "I'm going to start off by saying that I'm a picky rater of anime in MaL standards, and that I'm going to be covering the first two seasons briefly in order to explain this season.\r\n Devoid of any heavy plot it's impossible to rate the \"story\", however I will rate how well the show was written, or the script. The show has many recurring jokes and character traits that they write in so well that you don't get the feeling that they're just putting it in because they feel obliged to, instead, cleverly written in at perfect times. The plot of each episode also doesa very good job of not being boring, sure not much might be happening, but it is never boring. \\n\\n\r\nThe art is fantastic for what the show is trying to portray, it has a very unique style that you can look at and know from your first glance that this is most likely a light hearted comedy. The soundtrack is not that memorable but the voice acting is fantastic. Every seasons Opening and Ending songs have also had a lot of effort and detail put into them and are what I would consider to be good.\\n\\n\r\nThe characters are what make this show one of my favourites, Yuru Yuri is an all female show with little to no men at all, this is a scenario that I am a huge fan of (like K-on!) because when there's men and women in a slice of life, there's usually drama, not in Yuru Yuri, there's not a second of drama in this show. \\n\r\nEach character has a unique interaction with each other and the script gives moments to each girl to have a chance to spend time with different friends. Lesbian undertones are a great change of pace as it's something I haven't seen elsewhere, the show features my favourite and one of the funniest tsunderes of all time as well.\\n\r\nIt should also be stated that the show does not have one main character that it \"follows\" from their perspective, it rotates around the four main girls.\\n\\n\r\nNow that that's out of the way I'll explain why I think Season 3 is the best season. \\n\r\nSeason 1 and 2 do a great job setting the tone, developing the characters (thus adding rewatch value), establishing jokes, etc. \\n\r\nBut Season 3 is where it all just clicks perfectly, it is the most enjoyable season by far and it is written under the assumption that you have already seen the first two seasons and therefore doesn't try to reintroduce the characters to you and all that, but instead it throws you right into what you loved about the previous seasons. \\n\\n\r\nThe popularity of this season is astonishing (19,000 members that have completed the show at the time of writing this), hopefully they have enough funds to make another season because I certainly haven't seen enough of this show yet.\\n\r\n My enjoyment is an easy 10/10, is the show perfect? no. is the show for everyone? absolutely not. But if you enjoyed the first two seasons, I unbelievably highly recommend that you watch this, you will not be disappointed. \\n\\n\r\n9/10\\n\r\nThanks for reading, if you found this review helpful or had something you wanted to talk about, feel free to message me.\\n\r\nburnso",
            "date": "2016-04-07T13:35:00+00:00",
            "helpful_count": 24,
            "mal_id": 215768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4507858.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/burnso",
                "username": "burnso"
            },
            "url": "https://myanimelist.net/reviews.php?id=215768"
        },
        {
            "content": "Namori's Yuru Yuri has had two fairly strong series from Dogakobo. My biggest issue with the second was the overuse of Akane and her single unfunny joke. From early October to late December of last year, there was a third series, this one from TYO Animations. Yuru Yuri San Hai. Does the studio transition work to the series' favour?\r\nStory:\r\nLike the other two series, San Hai doesn't have much in terms of a narrative. A group of junior high girls go about their everyday lives having quirky, and highly Sapphic, fun. It's primarily a comedic work so the question we have to ask is how welldoes the comedy fare in this one?\\n\\n\r\nMy biggest issue is with Akane, again. We get it, she has incestuous feelings for her little sister. It's really not funny. It was funny the first time when you used it for a horror parody. Ever since then it hasn't been funny, it's just been an unnecessarily creepy element in a light-hearted comedic work. To be fair, though, her role is downplayed in this series and the stuff with her and Tomoko is actually pretty decent. Aside from that, the series is really entertaining with a lot of strong comedic and cute moments. One of the interesting things they do is emphasise the interactions between characters who haven't had much, if any, time together and it actually works really well, demonstrating a fuller range of comedic possibilities with the set up they have. Overall, the comedy almost always works well and it is quite charming.\\n\\n\r\nCharacters:\\n\\n\r\nThe cast of characters in Yuru Yuri isn't the most complex. However, they are largely charming and they have good interactions for comedic purposes. Sakurako is probably the strongest in this particular series since a lot of the funniest moments, and some of the cutest, revolve around her. Ayano also gets a lot of strong scenes in this one.\\n\\n\r\nArt:\\n\\n\r\nThe artwork is bright, vibrant and suits the series well. TYO does a good job of replicating the look of the prior series and backs it up with solid animation.\\n\\n\r\nSound:\\n\\n\r\nThe cast remains a strong point of the series. Ootsubo Yuka, Mikami Shiori, Tsuda Minami, Ookubo Rumi, Mimori Suzuko, Katou Emiri and the other actresses all deliver strong performances. The music is really good too and suits the series well.\\n\\n\\n\r\nHo-Yay:\\n\\n\r\nThere are a lot of cute yuri scenes. Chinatsu's crush on Yui is still a big thing. Kyouko is still flirting with all the girls. Ayano and Kyouko get some really good scenes. Sakurako and Himawari get a couple good moments of their own. Chitose's fantasies are as vivid as always. About the biggest addition to this series, in terms of yuri, is that Chizuru gets some scenes with her classmates. The girls in this are homo-erotic that I think it may be heading for a future where they've started a poly-amorous coven. I can't decide whether that would be the greatest or the dumbest sequel of all time. Given the franchise as a whole and its atmosphere, I'm leaning more towards the former. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nYuru Yuri San Hai is an entertaining series with a lot of charm and endearing characters. My one complaint about the series is only really a major problem in one episode. All in all, I think it's the best instalment of the franchise thus far. Overall, I give it a 9/10. Next week I'll take a look at Studio Ghibli's Whisper of the Heart.",
            "date": "2016-01-13T10:48:00+00:00",
            "helpful_count": 12,
            "mal_id": 208439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=208439"
        },
        {
            "content": "To be fair, you have to have a very high IQ to understand Yuru Yuri. The humour is extremely subtle, and without a solid grasp of Japanese culture most of the jokes will go over a typical viewer's head. There's also Akari's nihilistic outlook, which is deftly woven into her characterisation- her personal philosophy draws heavily from Narodnaya Volya literature, for instance. The fans understand this stuff; they have the intellectual capacity to truly appreciate the depths of these jokes, to realise that they're not just funny- they say something deep about LIFE. As a consequence people who dislike Yuru Yuri truly ARE idiots- ofcourse they wouldn't appreciate, for instance, the humour in Akari's existential catchphrase \"AKARIIIIIIIIN,\" which itself is a cryptic reference to Turgenev's Russian epic Fathers and Sons. I'm smirking right now just imagining one of those addlepated simpletons scratching their heads in confusion as TYO animation's genius wit unfolds itself on their television screens. What fools.. how I pity them. 😂\\n\\n\r\nAnd yes, by the way, i DO have a Kyoko tattoo. And no, you cannot see it. It's for the ladies' eyes only- and even then they have to demonstrate that they're within 5 IQ points of my own (preferably lower) beforehand. Nothin personnel yuru 😎",
            "date": "2018-10-09T04:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 291314,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7451148.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Amajor",
                "username": "Amajor"
            },
            "url": "https://myanimelist.net/reviews.php?id=291314"
        },
        {
            "content": "Finally, my third review for the third season for the anime I found to be truly interesting in its entirety. As usual, I start my article with a praise pertaining to the series as it is truly praiseworthy as well as great overall.\r\nThere is a saying that goes like: \"Do not take in more than what you can chew.\"\r\nWho cares? The anime is so great that I can't stop watching it. Every time my cellphone (I watch using my phone) discharges, I try my best to suppress my disappointment. Why did they even make cellphones have limited energy, by the way? (An everlasting power sourceis impossible. Wait for another million years.) Everything I assumed that was going to be there was…ummm....there. \\n\\n\r\nFollowing the events of the first season, then the second season, again, the story, or not-a-true-story-because-it-has-no-plot centers around the main characters Akari, Kyouko, Yui and Chinatsu, again, in their Amusement Club in the Tea Club's clubhouse, along with the supporting characters Ayano, the Ikeda twins, Sakurako and her sisters, Himawari and Kaede, Nishigaki-sensei and Matsumoto, Akari's sister Akane, and others who are again,for a third time, in an all-girls school with many comedic routines, a little drama that I really found entertainment at. Truly astounding.\\n\\n\r\nThe three seasons has a theme that reflects each of us in our lives: Friendship. The scenes in it signifies it so much that, in some scenes, you can relate yourself with the characters. Even if you come across many difficulties in life, you can overcome it with people that you care for. And that's what friends are for. You share precious memories, have fun together, and even face hardships together. That's what I think Yuru Yuri is all about. And that's what I think that makes it interesting and outstanding. Don't you have any friends? I find that hard to believe. If not, then I don't think this is for you. May you be seeking for something sexual? Oh, well.\\n\\n\r\nAs long as there is Yuru Yuri, I can never get tired of the arts it has to offer. I am quite like Chinatsu, who is terrible at drawing. But nevertheless, the arts in it are satisfying that I yearn for more. The drawing, the animations, all of them. Truly wonderful and sophisticated work made by the anime industry. The character designs, too, even though unchanged, never gets old and are something invaluable to even consider.\\n\\n\r\nThe music. Even though I didn’t like the third season’s OP and ED that MUCH, (Note: Much…that means I still liked it. Who wouldn’t like something they like, anyway?) it was still an exhilarating experience to me that I got the chance to listen to it. Before I really say that I didn’t like the OP and ED that much, I really LOVED that ED at the end of the series itself because of its relaxing tone and the meaning (I can understand Nihongo, that’s why I can get the meaning beyond than what the subtitles say.) I loved it that I can even sing the lyrics while typing it at the same speed. And that’s not a hyperbole.\\n\\n\r\n“kawaru koto no nai kono kimochi ga asu wo kagayakasete kureru”\\n\\n\r\nOh my…that song was truly fantastic.\\n\\n\r\nThe characters, I’ll say it again for it never changes, their significance never fades away. From the main characters up to the background characters, all of them played their roles along with their personalities wonderfully. They all played their part efficiently in order to make this experience watching Yuru Yuri truly unforgettable to me. The characters was a must-see encounter.\\n\\n\r\nAgain and again, I will say that this anime excited me the most when it came to content, art, music and anything that you might consider in what anime should be really is. Yuri? No. The theme is what I’m talking about. Even if its theme is yuri, love between two girls, the story within is really superb. I cannot say anything negative about this.\\n\\n\r\nOverall, the anime is simply splendid. \\n\\n\r\n.\\n\\n\r\n.\\n\\n\r\n.\\n\\n\r\nA simple afterword\\n\\n\\n\r\nBy writing three reviews in the span of three hours, I found myself satisfied. Not only this was a great achievement for myself, I also found out that my overall vocabulary isn’t that…good. I found myself finding synonymous words for great, nice, good and many more (like in my previous two reviews.) Phew. Now that’s good.\\n",
            "date": "2017-07-31T02:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 254308,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6297554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexPaulLEWZ",
                "username": "AlexPaulLEWZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=254308"
        },
        {
            "content": "Much better than the other seasons. I felt as if this season allowed you to know more about the characters and really added some beauty to the story. The other seasons kinda just put these characters in front of you and made them do entertaining things. This season, however, shows the relationships and bonds between different characters all while making you laugh and love them more. It just really made me care about the characters and relate to them and their various situations. Because of this I believe that overall this season should be considered as a prime example of good comedy anime.",
            "date": "2017-10-13T23:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 260719,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6256765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MusicalTsunami",
                "username": "MusicalTsunami"
            },
            "url": "https://myanimelist.net/reviews.php?id=260719"
        },
        {
            "content": "I think this review is completely biased by my opinion. Blast it, who cares? I love this show, and if you don't agree then that's perfectly okay. But this show really stands out as the best of Yuru Yuri so far, and if you're watching this show because you enjoyed the last two seasons, then I hope you can see what I mean.\r\nStory: 10\r\nThe story STILL hasn't changed. In fact, it has changed so little from the first season, the synopsis of Yuru Yuri San☆Hai! is LITERALLY \"Third season of Yuru Yuri.\" So, what makes this story outstanding in my eyes?\r\nFirst of all, it's simple.Even for slice-of-life genres, it is simple. Four girls who use an abandoned club room to hang out. It's totally against the rules, but the student council has a peace treaty with them.\\n\r\nWhat else? Obviously it would be unfair to argue using phrases such as \"lacking originality\" or \"not exciting\" since the show wasn't written to have a moving plot. So, how does it stay refreshing? Well, each season is roughly a year in the girls' timeline. The same year. That in itself is an interesting thing, not just because of it being somewhat novelty, but because there's some strangeness going on with the fourth wall. The characters themselves nearly caught on during the second season, that there was some sort of time loop going on, yet it sort of remains as an unmentioned thing. Sure, they are repeating the same year of middle school for the third time, but there are new events and nobody actually realizes it. Unlike Non Non Biyori Repeat where it actually rewinds to show more moments from the same year, Yuru Yuri continues moving forward.. without moving forward.\\n\r\nI probably just complicated the whole thing, but I just love the idea of it all.\\n\\n\r\nArt: 9\\n\r\nThe art is still amazing and cute, and there are some disturbingly graphic scenes involving blood and tears. I didn't notice any changes from the last season or the OVA, so I honestly don't know what else to say here. The animation in the opening and ending seem like a lot more effort was put into them, although the 3-D effects in the former make the actual characters seem sort of edited in. It could do with a bit more work there. The characters' expressions follow the same style, and I feel like the art fits the show. For the most part, Chitose probably causes the most controversy with her nosebleeds.\\n\r\nThe half-time intermissions are, if you ask me, much better than before. I like the still scene that has a different style than the rest of the show MUCH better than the character page thing. Not saying that was bad, but this is much more.. intimate, you could say.\\n\\n\r\nSound: 8\\n\r\nThe sound of this show has no issues. While I definitely think the music was a lot better in the second season, it still does the job well. I can never find a problem with sound effects, and while there was one specific episode where it sounded like it was a sample from a horror film, that didn't bother me. Not really. It might be scary, a little bit, but hey.\\n\\n\r\nCharacter: 10\\n\r\nAnd I thought that the previous seasons had it perfect, this show made me want to lower the ratings on the other shows just because the characters were so much more realistic in San☆Hai!.\\n\r\nFirst of all, every character who doesn't show up in the ending is a side character to me. So, the eight girls from the Amusement Club and the student council are the main characters.\\n\r\nThe reason I think this is that each character got the time they deserved. We saw a lot more of Mari-chan, Kaede-chan, and I won't list everybody. But what's most important, MOST important, is that there was a lot of character development. This season felt a lot more personal, a lot more intimate, a lot closer to the characters. There are plenty of scenes where one of the girls grows in one way or another, or where something special happens that surprises everybody. Yuru Yuri San☆Hai! is full of those moments.\\n\\n\r\nEnjoyment: 10\\n\r\nI would watch this entire series from the start. That's how much I enjoyed it. Not necessarily saying that everybody else has to enjoy it that much, but that's how I feel. I love this show, and this season has to be the best of Yuru Yuri so far.\\n\\n\r\nOverall: 10\\n\r\nFor my standards, this is a masterpiece. A masterpiece doesn't have to be the best, nor does it have to be unique. It just has to be something that was excellent in enough ways to make it deserving of the praise it receives. In Yuru Yuri's case: a simple story that still stays in motion, cute art and good illustration, lovable characters that have distinct traits and quirks, and thirty-eight episodes plus one movie to enjoy.",
            "date": "2016-01-05T22:48:00+00:00",
            "helpful_count": 7,
            "mal_id": 207865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3606903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Symantra",
                "username": "Symantra"
            },
            "url": "https://myanimelist.net/reviews.php?id=207865"
        },
        {
            "content": "Yuru Yuri San Hai is the third season of the Yuru Yuri anime. \r\nTo be completely honest, I started the Yuru Yuri anime after the third season started airing so I was able to watch all the episodes in connection with one another. When I had reached San Hai, about 4-5 episodes have already aired. I immediately noticed how different the season is compared to the others.\r\nThe art style was actually very similar to the other seasons and if I didn't know better that a different studio handled it, I would think the style was the same. If I were to say which art styleI prefer it would probably be the third season because the characters look more detailed and mature. Though this also contributed to 'normalizing' the show as well. The backgrounds were pretty nice too and I've noticed some big changes with the setting/background art. Most of which were improvements in making the scenes more immersive.\\n\\n\r\nThe bgm wasn't too attention-attracting for me or maybe I just wasn't paying attention. However, I noticed that for this season I had a lot more easier time paying attention to the soundtrack maybe because the season lacked the immense silliness from the previous seasons that distracted me from it or because the bgms were catchier. The OP theme Chochocho! Yuru Yuri Capriccio!!!, I would agree with most others that it lacks in impact. As for the ED Acchu~ma Seishun!, I wouldn't say it's the best out there but it was better than the OP for me. I still prefer the music from S1 and S2. But the band in the ED theme was really cute!\\n\\n\r\nWhat I've noticed the most is that it seemed a lot more subtle and casual with less craziness happening. Even Chinatsu and Kyoko who are supposed to be the crazy ones in the show have been toned down. We don't get to see as much of Chinatsu's crazy side besides her obsession with Yui and occasional twisted tendencies towards Akari. Chitose also does not fantasize as much which isn't exactly a bad thing since it was getting old for me anyways. Though Kyoko is still completely random with her ideas but I definitely felt that she was more subtle. I don't know, I guess Kyoko seemed more immature in the previous seasons and seemed more reliable in the third season and I'm fine with this change too. However, one of the things that disappointed me was that the intro before the show starting with Akari is now gone but in its place, Akari is now more noticeable as a protagonist during the show. The eyecatches with the catchy music is now gone too but eyecatches normally portraying a scene still exist.\\n\\n\r\nOverall, I would say I enjoyed this show a lot and since this show aired on Mondays for me, for a while even if it was short, Mondays weren't as depressing and boring for me as before. No matter what, this show was able to somehow put a smile on my face after my dreadful tiring day of work. Even if this show was a lot more calm, it doesn't take away the core value of this show as one of the best or better slice of life comedy animes out there.\\n\\n\r\n10/10 for making my Mondays amusing.\\n\r\n9/10 because no Akari intros + not as much Chinatsu horror.\\n\\n\r\nSorry for wasting everyone's time with this boring and unremarkable review of mine if anyone noticed this review.",
            "date": "2016-01-12T00:04:00+00:00",
            "helpful_count": 7,
            "mal_id": 208328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3855801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/-Neptune-",
                "username": "-Neptune-"
            },
            "url": "https://myanimelist.net/reviews.php?id=208328"
        },
        {
            "content": "Akarinnn~! Haii~ Yuru Yuri, haji mare yo!! [mind the spelling]\r\nWell, with Fall/Autumn season coming to an end and moving on to winter season, of course most of the Fall/Autumn Anime series will conclude with 12 episode or continue till Winter season is over. Unfortunately, Yuru Yuri is not one of them as they only had 12 episodes. But I’m grateful that Yuru Yuri were given a green light to be animated for a 3rd season despite different studios being handled. Without further a due, let me give my thoughts and impressions as well as trying to keep the spoilers to its minimum level.\r\nAfterwatching Yuru Yuri Nachuyachumi and its specials which is the Yuru Yuri Nachuyachumi PLUS. I put a lot of trust for this studio to handle well for the third season, well after watching twelve whole episodes every week, they did a good job despite having some lack of comedic moments or those legendary nose bleeds from its previous studio. Story likewise, it maintains from what they had from the manga, well some may be cut out due to time slot issue, I may also assume that this continues from where the events of Nachyachumi and Nachuyachumi plus took place, And what made me think is that, Akari the supposedly main character for YRYR has a lot of screen time compared to the previous seasons. Other minor characters were also given more screen time, which is a welcome change for me (my opinions). Since this is a slice of life genre, no specific plotlines or whatsoever are needed, its main focus of the story is the everyday life of four girls doing their everyday lives such as club activities, weekend activities and more. Character development in this series, well I don’t really talk that much but most of the friendship bonding between all the girls are deepen and they tend to adapt with them, such Yui trying to use puns with Ayano. I’m glad that Akari wasn’t really treated badly by the new staffs compare to other since I’m pitiful for Akari to be left out, eventhough I miss some of the Akari jokes made by Dogakobo studio. Also, I’m glad that the story is rather kept simple and understandable rather than complex or a filler, complete cliché episode or rather being deus ex machina. \\n\\n\r\nMoving on to the art or animation, as it is handled by different studio, in this case handled by TYO Animations, I say it made a significant impact on Yuru Yuri’s fans perspective as they had previously accustomed to Yuru Yuri’s dogakobo art style [since they look more matured in TYO's animation], but nevertheless, it still retain some of the character designs of Yuru Yuri. I typically like Akari’s character design which she has retain most but not all of the design from previous season. The character eyes are also different and the facial reaction are good in some part and mediocre in some part for example Akari’s raped face. The typical non-stop nose bleed by Chitose is not there but TYO really did make Chitose nose bleed more splendid compare to Dogakobo. Anyhow, the animations is rather smooth and up to par with other anime, background images are vivid and splendid but some are too dark, which I don’t really mind as long I can see the character’s face. Overall I loved the animations and glad there aren’t many weird animation, or loop animation or a “power-point” style animation. Boy, do I love the Chinatsu x Yui art style, they sure do put a lot of effort to make it happen.\\n\\n\r\nSeiyuus are the key elements to make anime happen, without them, we will be back in the 1900s. I’m glad that they retain all the seiyuus from previous season, I imagine if they changed the seiyuu, it wouldn’t be the same Yuru Yuri anymore, but I’m glad that the seiyuu members did not changed since I enjoy listening their comedic voice acting from the previous seasons. The OP song is pretty catchy, I don’t know why some people hate it or find it ‘sh*t’ [that maybe their own perspective] as for me I find it nice, well one thing that was missing is the Akari calls which I find it understandable why don’t include it. The ED song is nice but I don’t really like it. The OST for this series is rather different than the previous seasons, but in the end, it’s nice to hear. Overall, I’m happy they retain the seiyuus from the previous seasons and overall the OP,ED and the OST aren’t that horrible.\\n\\n\r\nFor the characters, all of the girls were given more screen time especially Akari, Akari used to had little screen time because of her lackness in amusement or specialty compared to Kyoko which she had more screen time, TYO decided to give Akari more screen time. With Akari having more screen time [despite having few episodes she didn’t appear], we see her interacting more with the other girls, and other than that, I enjoy seeing her cooking, helping each other and socializing with others. Ahh, adorable Akari. Kyoko on other hand, rather do dexterous things just to impress the girls and the viewers, I typically enjoy it. Overall, I don’t really talk much about the characters because it might take up a lot time to write so I sum it up that most of the characters have the same trait back in YRYR previous seasons, while Akari on the other hand has bigger impact due to having more screen time.\\n\\n\r\nLast but not least, I enjoyed watching this anime from where it started to aired, since then I commented on how enjoyable the episode it was in the forums up to the final episode. It also cleared me all the worries I had in my school and also help me reduce stress after having a load of school works in the weekend. Even if the comedic scenes are wrong timed, I still burst my laughter because Yuru Yuri is very funny and fun series even if the studio changed. Now with the season over, I’m kinda sad and disappointed since it only has 12 episodes but I’m rather grateful that it received a 3rd season [it ended up nicely, very warm and cute ending], and frankly I enjoyed it to the max! Hence, if you already watch the first and the second season, do watch the third season! Don’t forget the OVAs too, it’s good too. Even if it has Yuri genre, most of the scenes are basically slice of life type, don’t worry there are Yuri scenes too, haha. [Ayano x Kyoko]\\n\\n\r\nWith that I conclude this review with Story (7), Art (8), Sound (8), Characters (8), and Enjoyment (8) and with the overall 8 out of 10. I do apologize if the review is too long or too crap because I’m still a newbie of writing review, I do hopefully it is helpful as it can encourage more people to watch Yuru Yuri. With that, thank you for taking your time in reading it.\\n\r\nAnd have a nice peaceful day!~\\n",
            "date": "2015-12-21T13:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 206320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=206320"
        },
        {
            "content": "After watching the first two seasons of Yuru Yuri, I was really excited about the third one, and watched it as soon as I finished the second season. The problem turned out to be the show took a very different route, and failed in its purpose.\r\nSo the first season established some funny inside jokes and good character description, so it made the show funny and cute, which are a very good combo. The second season continued the things that made the first season a success, but added some relationships to promote the yuri aspect of it, making it all the better. We see relationships form,and progress throughout the season.\\n\\n\r\nHowever, the third season breaks this trend - it is decided that all the inside jokes should stop, and change the pace of the season completely separate to the first two, making it more slice of life, and less Yuru Yuri.\\n\\n\r\nI definitely see why they did it - they decided to focus on the \"yuri\" aspect of it, which is definitely welcome. However, adding a few extra yuri scenes doesn't really cut it for me, because we see almost no development of the relationship, and instead get frustrated by the encounters. Because it took the serious route, it lost all of the original Yuru Yuri touch, and it failed at being serious with no character development, which caused the whole season to fail. I forced myself to watch it because I really hoped it got better, but except for one episode, it was really boring.\\n\\n\r\nHowever, the worst part was Chinatsu. I get that some people might like how she loves her senpai Yui, and she does some crazy things to get her attention. Although I find it cringey, I get that some people like it, and it was pretty chill throughout the whole thing, so I largely wrote it off and continued to enjoy the show. However, I felt like most of the time that was the ONLY thing happening, and by god did it get annoying. We just have this girl getting close to raping Yui and being super cringe about it, and basically ruining everybody's day with it. I mean, I was hoping somebody would beat her up or kick her out or something, but alas, it did not happen. \\n\\n\r\nAlthough the rest of what I said really added to lowering the rating of this show, the Chinatsu thing was just awful. I was dying of boredom and fury at the end for her even existing. If you didn't really like her, you should never watch this season or you will be very disappointed.\\n\\n\r\nMy main reason for writing a review for this show is because it is an absolute DISGRACE this got higher ratings than both previous seasons, because it doesn't compare to the enjoyment of the first two. They were funny, cute, and full of yuri. This was boring, completely threw away the idea of Yuru Yuri, and failed at having any significant impacting yuri. You cannot just change the pace of the show like that - it just broke the flow of the show.\\n\\n\r\nIf you really liked Yuru Yuri, I would probably recommend because it will keep you awake at night if you don't finish it, but it's something that you can easily skip, especially if you didn't enjoy the series much.",
            "date": "2016-04-30T22:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 217570,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437457.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DaAwesomePwner",
                "username": "DaAwesomePwner"
            },
            "url": "https://myanimelist.net/reviews.php?id=217570"
        },
        {
            "content": "I had my doubts when I heard that a new studio was going to take over the series. I thought that the new season will not be capable of living up to Season 2 because of the new studio. Well, it’s safe to say that Season 3 is just as equally great as Season 2. \r\n[Story]: (8/10)\r\nThis is the 3rd Season of Yuru Yuri and is being created by a new studio called \"TYO Animation\". \r\nIf you've watched the previous seasons of Yuru Yuri then you should have noticed that the 3rd Season is a wee bit different than the 2nd Season. It's more calmernow..Calmer is probably not the word I'm looking for but this is the best word that I could say about the show. The first 2 seasons were way energetic than the 3rd Season. However, I am enjoying the 3rd Season as much as the 2nd season and here are my reasons why.\\n\\n\r\nFirstly, most of the characters who didn't get a lot of screentime in the previous seasons are getting more screentime here. For example, Sakurako and Himawari's arguments. There seems to be more argument towards these characters than the previous seasons. Since I'm a fan of their pairing and their arguments, I gotta say thank you \"TYO Animations\" for giving them more screentime. Now I won't have to read those Himawari X Sakurako fanfics anymore which I regret reading. Another example is Akari. She's now getting the same amount of screentime as Toshino Kyouko whereas in the first two seasons, she was not treated like a protagonist which was the running joke in the series. I admit, I'm going to miss the \"Akarin\" joke but on the other hand, I'm glad she's getting the amount of screentime a protagonist deserves. \\n\\n\r\nSecondly, the new jokes are different than second season but the new jokes surprisingly made me laugh like how second season made me laugh, even though S2 and S3 uses different gags. However, this is subjective because some might find S2's joke better than S3. If you're worried that the new studio replaced all the existing jokes then fear not because most of the existing jokes like Chitose's \"nosebleeds/yuri fantasy\", Ayano's puns, Chinatsu's horrible ass drawing and \"everything she designs are garbage\" joke, and etc. are still here. \\n\\n\r\nFinally, S3 has more Yuri....I mean, Shoujou Ai scenes than the predecessors. What I mean is the characters are all being lovey dovey towards each other but not to the point where it becomes a complete Shoujou Ai where the characters get together and starts dating or some shit. For example, there are more Toshino x Ayano (my favourite) moments and more Himawari x Sakurako (my 2nd favourite) moments. There are also some new \"character pairing\" moments that we haven't really seen in the previous seasons like the \"Toshino X Akari\" moment (so cute), Ayano X Yui moments (Ayano and Yui could (and probably should) form a new team together called the \"punny\" team.......No?......I'll leave) and etc. Goddammit, TYO..Why you want me to ship more characters?\\n\\n\r\nI am bummed out that the Akarin intro is gone. I always looked forward to Akarin's intro and her cute \"Yuru Yuri..hajimaru yo\" speech every episode and those intros never got old. They always cracked me up like Akari shooting down the UFO using her \"detachable\" hair buns thingy in her hair or Akari spreading her disease called \"Akarin\" to her friends. I am also bummed out that the \"eyecatches\" are gone which usually happens before and after the commercial break.\\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (9.5/10)\\n\r\nI am SO GLAD that a new animation company has taken over and produced Season 3 of Yuru Yuri. The background are a lot more detailed and their club room is where you'll spot the huge major changes plus the visuals and lighting are a lot better than the second season. The character designs are also better than S2 but the changes aren't that huge. The only changes that I saw in S3 that is different than S2's character design is their hairs which looks more glossy and shinier and their eyes which also looks more coloured and shinier \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8.5/10)\\n\r\nNothing really changed in the soundtrack department. The background theme sounds the same as S2 when a funny scene is playing, when they're fooling around or when they're having a normal conversation. Now the OP and ED theme song.\\n\\n\r\nThe OP theme song is \"Chochocho! Yuru Yuri?Capriccio!!!\" by Nanamori Chu?Goraku Bu and the ED theme song is Acchu~ma Seishun!\" by Nanamori Chu?Goraku Bu. I'm a fan of Yuru Yuri's OP because they're pretty catchy to listen to except for this OP. It's not bad but it's not great either. It's decent and it's really not that catchy. The ED theme song....three words, I love it. I mean, it's not better than Yuru Yuri's (S2) ED theme but it is definitely going in my top 3 favorite Yuru Yuri ED theme songs. \\n\\n\r\nNow the Voice Actors.. I heard some rumor that most voice actors were replaced due to a change in studio but I'm glad the rumor was false. Who would want Akarin's VA to be replaced? Her voice is amazing, especially when she screams. Who could also forget Ayano's \"TOSHINO KYOUKO!\" scream and her \"hilarious\" puns. \\n\r\n______________________________________________________________\\n\r\n[Characters]: (8/10)\\n\r\nLike I said above, the show is a lot more calmer than the previous seasons. The whole reason why the previous seasons were so energetic and lively is because of Toshino Kyouko. What happens if she starts to mature bit by bit? Well, you get this..Look, Toshino is still the most immature character in the series, along with Sakurako but if you compare the Toshino from this season and the Toshino from the previous seasons, you’ll notice that she has matured a little bit…By “little bit”, I mean 5 or 10% increase in maturity. \\n\\n\r\nThe characters are all still mostly the same. Chinatsu still drools and fantasizes over Yui, Akari is still the same ol’ clumsy girl except she now gets more screentime, Ayano still “non-intentionally” makes puns which aren’t even that great to begin with. As you know, Ayano is a lesbian tsundere and she was always on her \"tsun tsun\" side in the previous seasons. Well now, she's now on her \"dere dere\" side most of the time. Sakurako is getting way more immature which I’m ok with, Himawari’s tolerance on Sakurako seems to be increasing, and Chitose’s “nosebleed/fantasy yuri” is animated a lot better than the previous seasons.\\n\r\n______________________________________________________________ \\n\r\n[Enjoyment]: (9/10)\\n\r\nI honestly enjoyed the 3rd Season of Yuru Yuri as much as the Second Season. The jokes may be different than S2 but it is making me laugh like S2 did. It's also nice to see my favorite pairings like \"Toshino X Ayano\" and \"Himawari X Sakurako\" scenes get more screentime. \\n\r\n______________________________________________________________\\n\r\n[VERDICT]\\n\r\n“Yuru Yuri San Hai (S3)” is a great addition to the Yuri Yuri series. It feels different than the 2nd Season so the new season feels kinda fresh and new for me. The studio may have handled the 3rd Season differently than \"Doga Kobo\" (The studio who made the first and second season of Yuru Yuri) but they did an amazing job handling the new season and not making it a piece of crap show. If you’ve watched the previous seasons then I recommend that you give the 3rd season a watch.\\n\\n\r\n[OVERALL]: (9/10)\\n\\n\\n\r\nPros:\\n\r\n+New Studio did a great job handling the 3rd Season\\n\r\n+Some existing jokes made a return for this season\\n\r\n+Animation by the new studio looks great\\n\r\n+Great Soundtrack\\n\r\n+More \"Character Pairing\" Moments\\n\r\n+Show is still funny\\n\\n\r\nCons:\\n\r\n-Some existing jokes are gone\\n",
            "date": "2016-01-02T12:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 207571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=207571"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nI think first main thing I would like to mention about this season, is that, this time it felt more of slice-of-life than a slapstick comedy. Whilst first season I enjoyed for its erratic comedy, this one I enjoyed more of its cute and laid back attitude. \r\nStory is pretty much with same concept. Kyouko and her team chills around with her friends, doing club activities and having lesbian fantasizes. But as mentioned before this one was more of a slice-of-life as it had quite some \"dramaand romance bait\" and less erratic comedy. SO in that aspect, comedy-wise its worse, but the polished feel of cute girls doing cute stuff in a slice-of-life genre. It's better.\\n\\n\r\nI did really enjoy this season opening. Rest of music and art value is pretty much same. It's simple, bright and fun.\\n\\n\r\nSo overall I did enjoy this, kinda got bored or tired of these characters now and then, but in the end I did enjoy this, thus I'll give it 7.",
            "date": "2017-08-20T10:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 255881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255881"
        },
        {
            "content": "This is the best SOL comedy anime.  There are yuri tease moments(sorry, most of the anime is yuritease moments) and unique characters.  Every episode is extremely unique, but most past episodes are never mentioned.  Also, somthing YRYR has going for it is the fact that the characters are all in middle school, which I have never seen in other romance animes.  This is great if you want to have a good laugh, and in my opinion I would rate it #1 on MAL.  The only thing it needs is better music, and what the devs need to do is makethis series have about 5 seasons, to not give people Post-Anime Depression for a while.",
            "date": "2017-06-30T10:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 251521,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6356010.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Misteroid",
                "username": "Misteroid"
            },
            "url": "https://myanimelist.net/reviews.php?id=251521"
        },
        {
            "content": "(this is my first review, and as a heads up, i'm not a big fan of huge fleshed out reviews. I just want to write a simple summary of what i thought and why i think it's worth my time writing up my feelings about this show)\r\nso i finally finished watching Yuru Yuri San Hai and wow..\r\nvery different than the the first two seasons..\r\nand now that i know it's because it's made from a different studio, that makes much more sense.\r\n(this new studio also made the OVA's, which really surprised me since i didn't enjoy the OVA's half as much as i enjoyed S3)\r\nimo, S3is my favorite type of Yuru Yuri.\\n\r\nbut more so as a great complement to the first two seasons rather than seeing it as a superior version.\\n\r\nA gift to the fans, but with fan service turned to 11.\\n\\n\r\nIn the first two seasons did you feel there was not enough yuri? well here you go.\\n\r\ndid the slice of life moments became too dull? let's speed the pace up a bit.\\n\r\nwere you tired of the same settings, same jokes, same relationship setups? we'll move things around and shake things up.\\n\r\nThis season puts more emphasis on the yuri and comedy.\\n\\n\r\ni never lol'd as much for the first two seasons as i did for S3.\\n\r\nTYO Animations fixed everything i considered to be\\n\r\nnegative or \"good at first but became annoying\" moments from the original two seasons.\\n\r\nwe saw settings that were never used before.\\n\r\ninteractions between characters that were never in a room alone together.\\n\r\nactual background characters to show these girls weren't the only ones in this school. and many more throughout.\\n\r\nA few tropes from the first two season were left out.\\n\r\nlike the Akarin intro's, and the gags about her small presence in the group, and also Chitose's yuri fantasies.\\n\r\nbut i will happily trades those for more Kyoko x Ayano scenes\\n\r\n(which is what we got, a very rewarding amount and quality of it)\\n\\n\r\nIf you enjoyed the first two seasons.\\n\r\nI can only assume you'll enjoy the 3rd season just as much, if not, more.",
            "date": "2016-06-01T02:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 219764,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4489799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kdsamreuang",
                "username": "Kdsamreuang"
            },
            "url": "https://myanimelist.net/reviews.php?id=219764"
        }
    ]
]