[
    [
        {
            "content": "Superpower anime has been the main solution to attract many people in order to keep the Anime industry in balance. Since the success of such famous anime like the big three (Naruto, One Piece, and Bleach), there are dozens anime that uses the super power as an appeal and works as a direct jump to make profits. One of them are the K - project franchise, which has been ongoing since 2012. K Return of Kings is the 3rd project that exists in K Franchise. As the series go, K really didn't maximize any potential that it have. \r\nThe 1st season started the story whileadding the mystery genre into it. While Return of Kings does a different thing, they're trying to build-up its world in this 13 episode. While doing that, the anime throw many flashbacks & scenes to build that, but they didn't succeed the 30% of it. \\n\\n\r\nFor about 8 episodes K: Return of Kings brings us an endless \"information dump\". The blank paper is filled, they fill it with many chit-chat and useless scenes and they just did the same mistakes once again. As the plot drive slowly, K Return of Kings really just wasting the time it has. The story can be described as 'disoriented' and didn't have a clear direction, it just floating in the air with unclear reasons. \\n\\n\r\nAs we expected, K strongest power is in the budget. The animation grows very colorful and beautiful. The town settings and the battle scenes are well produced. The character designs have hundreds of bishounen waiting for the fangirl to scream. To adding that, we have some useless fanservice scenes using boobs and many other round things to maintain the enjoyment of the fanboy. Well, those things remind me, \"What if K animation similar like Ping Pong?\", fortunately, the reality is not like that.\\n\\n\r\nSound settings are okay, the new Opening & Ending Song are not too bad either. The background music was still great like its prequel. Voice actors did a great thing in doing their job.\\n\\n\r\nAnother disappointment we have is there is no in-depth character development. They throw many flashbacks in this little amount of episodes but useless flashbacks indeed (especially the first 8 minutes of episode 1). The main character possibly didn't do as the main character, they just fleshed out by supporting characters, their role was actually minimum in this series. The green king's motive was relatively poor and slightly typical and we have the gray king in return. The problem is they unloaded a number of characters with not the right balance and I should say this \"None of the clansmen has a particular role in anything...\", they just as useless as ever and just filled the vacancy of the episodes. It's just so blank, useless, and ridiculous.\\n\\n\r\nThe useless scenes that occur in the first six episode really bring a bad effect to the enjoyment itself. Actually, the battle scenes are pretty cool and colorful. But it got such an unexpected downfall especially for the story section and character section.",
            "date": "2015-10-24T06:18:00+00:00",
            "helpful_count": 124,
            "mal_id": 201842,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=201842"
        },
        {
            "content": "**UPDATED** Added a paragraph with my thoughts on the ending.\r\nHonestly, I can't believe the negative reviews!\r\nThis anime is a rarity in my opinion. The first season of K was more of a mystery, trying to figure out who Shiro really was, this time it's about keeping the peace. It's focused on all of the groups as a whole rather than individually and explores a goal that all three kings share. \r\nThe animation is spectacular and far surpasses AoT, I particularly like the animation in scenes with Misaki on his skateboard, there has clearly been extra care into those types of scenes. There has been nomajor character development since the characters were probably explored to their full potential in the first season. The show is only three weeks away from its climax and I'm looking forward to it. I hope that this season doesn't have a disappointing finale, since the first season of K had an excellent finale, and as predictable as the show can be at times, it's thoroughly entertaining and I definitely feel like it's one of the best this year.\\n\\n\r\nOkay, so the ending did not disappoint, I appreciated that it was left on a cliff hanger kind of and I appreciate that a lot of loose ends from the past season were tied up. I don't feel like this anime really NEEDS a third season, because everything has already been tied up with a nice neat bow already. \\n\r\nI didn't get the type of ending I wanted, but I'm not disappointed with what we did get either. It's a nice ending. It was built up climatically, and I would've been happier with a darker ending, but the one that we got was nice. That's really all I can describe the end of the show as, \"Nice.\" \\n\\n\r\nThe soundtrack is also mind blowing, the soundtrack is actually one of the things that draw you into the show, as it compliments the colour pallet and spectacular animation and action scenes that the anime gives you in pretty much every episode. \\n\\n\r\nI give this show a solid 10/10 so far, I may downgrade the review depending on what happens in the finale though as I definitely feel like a bad finale can let down an entire show. Hopefully it's good!",
            "date": "2015-12-07T14:53:00+00:00",
            "helpful_count": 102,
            "mal_id": 204985,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4484331.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/whorifying",
                "username": "whorifying"
            },
            "url": "https://myanimelist.net/reviews.php?id=204985"
        },
        {
            "content": "To all the people who says this show is just too mysterious with it's plot and you can't understand it, therefore giving it a bad score, ohmygoodness, if you just paid a LITTLE more attention like maybe reading the story and actually TRY to understand it, then you'll get it.\r\n     Now first i'll say the cons, this show woulve got a 10 from me if some scenes were better, here's some parts: 1: If Nagare died first from losing power from the slates, how does the girl bring Fushimi back up the surface, she woulve lostthe power way before that. 2: How the heck did Adolf find his original body at the end. 3: How did Yukari not dodge Kuro's slash, it seemed like it was coming at turtle speed. 4: What did Zenjo do for the entire episode? he was just standing there, for two episodes.\\n\\n\r\n     Now let's move on to the pros. 1: DID you see the artstyle during the middle of 11? Suoh's jacket looks soo fresh it's like you never seen a good jacket in your entire life. 2: The battle scenes, they made the fight between Kuro and Yukari's sword actually have different sounds each time it clashes, such small details means something. 3: The story wasn't so bad, in the end, things did end up good, everyone was safe,(except you know, Nagare and Tenkei) and it didn't end badly. 4: Even though I listed less Pros then Cons, the Cons are small things.\\n\\n\r\n     For any of you who still bitch about \"what and where did the Sword of Damocles come from, I'll tell you what it means, It came from a passge from Cicero. A tyrant that seemed welathy and powerful to the public had a adsentatores (court flatterers) called Damocles compliment him one day about his power and wealth, so the tyrant said would you like to try out my life? Damocles accepted, and as he was enjoying his life, he notices a sharp sword dangled on the ceiling above his head by a horse hair, the tyrant explained that this was life as ruler was like. NOW K TOOK THIS, and it means that each of the kings, they have their responsiblities as kings, their Sword of Damocles falls means their death, when Suoh died, so will his Sword of Damocles and the burden it had, causing explosions. That's also why killing a king adds huge burden to your Sword of Damocles and when your burden exceeds ur limits, if will fall ending your life too. THAT'S WHY KINGS ARE JUST ONE PERSON, if everyone is kings, the burdens of everyone's Sword of Damocles can be chaotic. And this is where the Sword of Damocles came from.\\n\\n\r\n     This show was fantastic, the animation and good soundtracts (espacially you Suoh Mikoto's theme song *wink wink*), the character development isn't that bad either, the main characters all got a time and some screentime to shine. heck even the gold clansman got a scene! There's humor added time to time. And just coolness, added to almost all the characters, so calm for some, and others (talking about you Yata) shows some kind of emotion through someway or other. \\n\\n\r\nOverall, I give K a 9/10 Clouve gaved a 10 if wasn't for those Cons up there. (season 3's not coming, don't wish for it, story's over lol if you want more, imagine it, and add Suoh.)",
            "date": "2015-12-26T01:09:00+00:00",
            "helpful_count": 67,
            "mal_id": 206822,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4719984.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Childly",
                "username": "Childly"
            },
            "url": "https://myanimelist.net/reviews.php?id=206822"
        },
        {
            "content": "Mod Edit: Review may contain spoilers.\r\n--\r\nCurrently on episode 13/13\r\nI don't think this anime can be properly appreciated with out watching K: Missing Kings Movie between episodes 1 and 2. Because there are huge bits of info \"missing\" between the first 2 episodes. The movie isn't a prequel. It fits directly in between episodes 1 and 2 and explains what happens Mikoto and how Anna becomes the new Red King. What happened to the Gold King and the Gold clan members. As well as other pieces of key information related to the events leading up to the 4 episode.\r\nI love everything about this series so far.It's exciting to watch, the fight scenes are some of the best I've seen in a while, most of the characters are already pretty powerful so not a whole lot of room for growth, but we're talking about a series with 7 kings and their vassals so they have to be OP from the start because there are only 13 episodes and the 1 hour long insert movie so some things need to already be understood about the story line. Lengthy character development should be left for series exceeding more than 20 episodes. There just isn't enough time to explain every single little detail in a shorter series.\\n\\n\r\n*edit* So with the series wrapping up it's final episode I have to say I enjoyed it very much. For those of you that haven't watched it yet but are interested in doing so, you should know that K is part of a larger project so get the full experience watching the Missing Kings movie is a must. Even though the movie is a year older than Return of Kings it's not a fucking prequel but an insert for Return of Kings.\\n\r\nI recommend watching the movie after the first episode of Return of Kings. Then the second episode as it was probably intended. For whatever reason it was produced this way, the movie takes place after the first episode and before the second of Return of Kings. Explaining most of the gaps in the story between eps. 1 and 2. Also there are a few manga that go with the events of the entire K project. \\n\r\n \"K - Countdown\" is a must read it takes place after the events in the movie and contains the information and character viewpoints after Mikoto's death. (8 chapters)\\n\r\n\"K - Stray Dog Story\" - Kuro's story (5 chapters)\\n\r\n\"K - Days of Blue\" - Scepter 4's story (10 chapters)\\n\r\n\"K - Memory of Red\" Homra's story (15 chapters)\\n\r\n\"K - The First\" Shiro and the Gold Kings story (16 chapters)\\n\\n\r\nI highly recommend watching this anime it's so good. So far 9/10 overall from me. Thank you for reading! Enjoy the show! ^_^",
            "date": "2015-10-25T07:59:00+00:00",
            "helpful_count": 64,
            "mal_id": 201943,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4584865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mata1ch1",
                "username": "Mata1ch1"
            },
            "url": "https://myanimelist.net/reviews.php?id=201943"
        },
        {
            "content": "Too much style, less to none substance. That is how I see K: Return of Kings. \r\nContinuing from the events roughly after a year that occured in the first season and the movie, K: Return of Kings is a continuation of the series as it exposes the mysteries behind the seven kings and the Dresden Slate that was the cause of it all. \r\nFrankly talking, the story makes sense as all of the questions that were left behind in K is being answered but the narrative itself is very weak. What made K a successful anime was because it literally didn't care about anything. Youheard it right, K had little to no cohesive storyline to begin with. Stuff about Kings ruling the planet and keeping order to an inane teenager going around places to know who he was, where he came from as he remembered nothing about himself and being chased by gangster-like guys didn't make all that sense. But it was what that kept it going for thirteen episodes and made it a very charming show. Even if it had little to no plot whatsoever, K simply was a show that one could enjoy even it wasn't a masterpiece. K: Return of Kings tosses that reputation away. Too much exposition in the middle episodes assisted with a very slow start. Even at that the very first episode was nothing but a pandering to the fans with voluptuos breasts appearing in a way that would be unimaginable in real life. \\n\\n\r\nBut still that is what unique about anime, right? Honestly the amount of fanservice in the show and the pandering of Awashima Sera to the fans would top any ecchi or harem shows and bring them to shame. And it didn't stop in the first episode. After K: Return of Kings got underway it immediately shifted gears to a very tranquil mode with demonstration of words joining the game. To my surprise the stupidity of the fanservice did not stop at the first episode, but it kept coming every once in a while totally throwing all the post buildup to a dustbin. It would've been forgivable if just for the pilot episode, as it did bring me back memories of the unique experience of K I got in the first season. But no, GoHands really had to please the closet fans with all their Blu-ray sale accumulation from the first season. However it appearing once in a while really made the whole show mundane and made me lose glamour for the series.\\n\\n\r\nK: Return of Kings has almost the same set of characters as the first season, with the addition of Hisui Nagare who has a main role as the Green King. Almost all other characters remain the same with not a lot of development. Neko the very same annoying mix of Human-Cat hybrid and Kuro who now has his intentions set on protecting the Silver King Shiro, who he was after to kill in the first season. The main disappointing for me was the characteristics of Shiro. He's the same old soft and inane teenager who really doesn't seem like giving a shit even when he's now the one who created this all. The Silver King. The King of Beginnings. He was mostly portrayed as a weak character even if he was the First King compared to Hisui Nagare, who really seemed to have the upper hand against him the entire series. One of the main reasons for failure of for the show was the exclusion of the former Red King, Suoh Mikoto. Mikoto simply was a fiery and striking character right from the start. I know he died at the end of the first season and they had to continue with it, but yet the rivalry between Mikoto and the Munakata Reisi, the Blue King was one that I wanted most. Anna is a pretty good character however not as brilliant as Mikoto. K: Return of Kings mostly focuses around Anna and the OP is dedicated to her characteristics. Talking about the OP, the sound aspect of the show does not really disappoint. The ED of K: Return of Kings was my pick of the season. However I do share the opinion of most people that it should have been the OP and vice-versa. \\n\\n\r\nI've seen people either really hating the franchise and supporting it. If I had to say I'm the one in-between the two. I really liked the first season of K and also the following movie, but K: Return of Kings for me was unnecessary. It did not have to explain all the things bit by bit to position K as a successful anime. It already had its fanbase and even I was on the good side of it. Three years later though they really had to bring it back, and I have to say that after finishing the whole series I'm disappointed.\\n",
            "date": "2016-02-04T05:35:00+00:00",
            "helpful_count": 33,
            "mal_id": 210075,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903513.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/karlstein12",
                "username": "karlstein12"
            },
            "url": "https://myanimelist.net/reviews.php?id=210075"
        },
        {
            "content": "Watching K: Return of Kings is like running inside walls of a labyrinth, trying to find a way out. The confusion sinks in more and more and by the time you reach exit, it’ll be a relief. No, I don’t mean that the second season of K takes place inside a labyrinth. That would just be plain weird. What I mean is that K: Return of Kings lacks entertainment when it comes to storytelling. Each episode progressively makes the show more and more mind boggling. For a show that makes its big return, it’s also a big disappointment.\r\nAs the direct sequel of the movie, K:Missing Kings, this series also requires knowledge from the original season. Without it, watching the Return of Kings would be a dreadful experience. The first few episodes consists of setup that builds more and more for future events. Anna is now declared as the new Red King. She’s the little girl dressed in a goth loli outfit but has quite a confident personality when it comes to taking up the new role. Kuro also makes his return along with Neko and Shiro by his side as the original trio. Then, there’s new developments like the introduction of the Green Clan. Consisting of members with powerful abilities, they are labeled as the big bad of the season. \\n\\n\r\nThe structure of storytelling for the second season feels more like a car assembly. The first parts comes, then the building begins, and finally, we get the test drive. But unlike a car, it can get a bit confusing. First of all, the Green Clan consists of a prominent group of characters with ambiguous motivations. We don’t find out more about them until later on the season. But what’s interesting is that they treat almost everything like a game. What’s more is they use the social media to play out their plans through unpredictable strategies while causing confusion among the communities. In retrospect, the Green Clan is the big question mark fans will have for this season. Who exactly are they? What do they want? What’s their ultimate goal? Plot twists are also integrated into the story that makes them look even more deceptive. Unfortunately, it isn’t very interesting in the end. This is because there’s a lack of character growth and their role in the series seems condensed into more of their actions rather than real purpose. \\n\\n\r\nCharacterization for this season is also really a hit or miss. On a positive note, I think the show has chosen a suitable Red King and in this case would be Anna. She demonstrate her ideals, skills, and responsibility especially in her role against the Green Clan. In addition, she has earned the respect of her allies and is truly a character that is mysterious. The Green Clan also has some members that can be intriguing. Unfortunately, that’s really about it. The antagonists of the series are stereotypical and really lacks characterization. Shiro’s return to the show doesn’t bring anything special to the table. Not to mention, his sidekick Kuro still remains just as cat-like and almost lacks a personality. Her role is pretty much a cheerleader that again lacks any sort of prestige. And because the show has a large cast of characters, it’s really hard to pick out one to truly embrace. \\n\\n\r\nIf there’s one thing that is somewhat interesting is some of the morality and philosophical dialogues. While this does spark interest, most of it is masked by the frequent amount of generic content. Relationship dynamics are shortened with frequent mood changes and even the comedy feels dense with the die-hard dialogues. It sometimes feels like the show is mindlessly trying to appeal the audience through the rivalries of the colored clans. While this looks okay on the surface, it still doesn’t do justice for its execution.\\n\\n\r\nOn a technical front, the K franchise is a powerhouse. There’s a lot of emphasis put into the animation that is high quality with the setting. GoHands’ budget is put to use with highlighting the architecture backgrounds. The fluid animation also translates to character designs with their stylistic battle uniforms. While there’s lazy body movements at times, the action is mostly consistent with high caliber movements. The show is also known for some bits of fan service. While it doesn’t have the typical onsen or beach episode, there’s quite a decent amount of suggestive camera angles exclusively focused on Seri. It seems the cameras just love her.\\n\\n\r\nSoundtrack is more or less easy to forget or take notice. The OP song is a downgrade from the previous season with the lack of feature with other characters. It seems like they are making Anna the poster girl of the show as she is exclusively focused in the OP song. The lyrics combined with the choreography is sub-par this season as well. The OST seems to have improved in some aspects in particular with the Green Clan’s battle theme. However, when it comes to adapting soundtrack, K is less about what it wants you to hear but more what it wants you to see in the end.\\n\\n\r\nReturn of Kings is really an underwhelming return. Storytelling is a weakness in itself combined with its lack of concrete characterization. While there’s an interesting amount of mystery developing for the story at first, its execution and inadequate timings are what keeps the show from excelling. If you’re ready for some porn scenery, coolness, and curiosity about continuity, then this might be a show for you. In retrospect though, K has lost its freshness and became a hollow shell of its former self.",
            "date": "2015-12-25T21:04:00+00:00",
            "helpful_count": 26,
            "mal_id": 206810,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=206810"
        },
        {
            "content": "The first thing I could say is that this anime is K. Oh my, what a bad pun. Anyway, moving on to the review, K - Return of Kings is the long-awaited sequel to the original series for the ones who enjoyed the first season, whereas for the viewers who didn't might as well skip it, as it was more of the same. Audiences are presented once again with fantastic animation and sound, in addition to its interesting premise as well as its colourful cast; however, story and character development remain lacking as well.\r\nThe story of K - Return of Kings focuses on what thetitle suggests: the different kings that remained unknown in the first season, as well as the previous kings and its development, including the silver king and the newly crowned red king. What is more, it explores more on the mysterious \"Slates\" and its ability, in addition to introducing the mysterious group \"JUNGLE\" whose objectives are unknown. With that being said, the story remains unpredictable and entertaining, albeit having its share of flaws such as plot holes and the lackluster characters. \\n\\n\r\nViewers are presented with an expansion on the different kings and the Slates, and thus its powers; however, the explanation on how these work or their precise origin is never revealed to the audience. This was a drawback, as it was one of the aspects of the first season that I personally wanted to see in the sequel. The action scenes presented were varied as well as intriguing due to the unpredictable nature of the anime; however, it had its share of power imbalances, growing or lessening whenever the story required it.\\n\\n\r\nThe pacing itself was a bit \"chaotic\", meaning events were at times either to fast or too slow, yet had its typical K feel to it, which was a positive aspect at a personal level. Another thing that could be mentioned is the fact that it focused much less on the slice of life parts presented in its predecessor. However, there were also quite some scenes that were unnecessary for the story such as flashbacks, or either dwelling too much on certain scenes, characters or themes. Dialogue presented was quite lackluster and basic throughout the anime, repeating lines a bit too much to my liking: it was at times not straightforward.\\n\\n\r\nAs for the characters of K - Return of Kings, the cast presented is basically the same as the first season, with the addition of a handful of characters. It could be said that in one case it was doubtful whether the character was male or female because of its behaviour. Character development and the fleshing out of these remain overall very lackluster, to the exception of some. This is the case for Saruhiko for example, in which his motives and past are a bit better explored. What was very lackluster is the fact that some who remained mysterious in the first season remain unexplained, such as Neko: this character just seems to be there for fanservice purposes, besides of being quite annoying at times. This concerns the red king as well, who remains as plain as ever, with absolutely no change in character. The fact that it didn't further explore on the golden king or the silver one either was a shame as well. Nevertheless, the interactions between the various characters were at times interesting.\\n\\n\r\nMoving on the art style of the anime, this quite engaging to the viewer, especially concerning the environment and backgrounds, which applies to the characters as well. However, these are all \"bishonen\" type of characters, with a flamboyant hairstyle and figure: this applies to the few female characters as well. Which leads me to think the anime is mainly targeted to females, rather than the male demographic; and in case some males are watching, beautiful woman with overly large breasts are stationed there as well. As for the animation quality, this is of very high quality and colourful, as audiences are accustomed of the anime, with great action scenes.\\n\\n\r\nConcerning the sound, this was very befitting of the anime, using a variety of great compositions such as the piano ones. As for the voice actors, these performed their role well, which generally matched with the characters. What however must be mentioned is the fact that the dialogues are repeated a tad too many times, such when Scepter 4 unsheathed their swords.\\n\\n\r\nK - Return of Kings was overall an enjoyable anime, and a sequel that maintained the standards of the first season, yet not improving on its flaws. It was once again a pleasant experience animation and soundtrack wise, as well as the unpredictable story, albeit very flawed. The character designs were a bit of a drawback personally, in addition to some characters that remained unexplored. So do I recommend this sequel? I do for those who enjoyed the first season or the soundtrack and animation; yet for those who didn't, I would stay away from it, as it is basically the same with no improvements made, including a story of lesser quality.\\n\\n\r\nThank you for reading.",
            "date": "2015-12-25T23:01:00+00:00",
            "helpful_count": 19,
            "mal_id": 206818,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=206818"
        },
        {
            "content": "Story: 7/10\r\nWhile K's story is not bad, it's a lot of the same stuff we've seen before with a different flavor. We've got some conflicting factions of superpowered individuals based solely in Japan fighting over basically nothing other than the right to exist independently of the other clans. The first season was rife with flashbacks and infodumping in order to catch viewers up with the setting, which put a lot of people off as the plot was rather simple for the amount of info being introduced. Here in season two there is significantly less of that, with most infodumping contained to introducing us to themajor antagonistic force of the series. All in all, Return of Kings is a continuation of the same enjoyable plot we experienced in the first two entries into the series, but again, nothing new or groundbreaking.\\n\\n\r\nArt: 10/10\\n\\n\r\nIf you're watching K, chances are you're here because of the soundtrack or the art style. This series is absolutely gorgeous. The backgrounds are sharp and breathtaking. The cityscapes are vast and alive. The colors are rich and rife with symbolism and suggestion, given how important colors are to the setting and the plot. Even the side characters have enough detail to be the main characters of other anime. No expense was spared on the art here, and it shows. If there is one place K shines, this is it. Just watch the first few minutes of any episode and you'll see what everyone is talking about.\\n\\n\r\nSound: 9/10\\n\\n\r\nWhile not as overwhelmingly fantastic as the art style, K's soundtrack is a force to be reckoned with. Among the more notable tracks are Suoh Mikoto's theme, (which is what season one opened with) Kuro Yatagami's theme, which often punctuates his fight sequences or conflict scenes; and Shiro's theme, with its beautiful use of piano to convey a sense of regality accented with gentle demeanor. Every entry into the soundtrack is uniquely charming and carries with it a sense of purpose and vivid imagery. \\n\\n\r\nCharacter: 8/10\\n\\n\r\nThe characters weigh in just slightly higher than the story. While not nearly as noteworthy as the art or the soundtrack, the cast is diverse and interesting. Our side characters from the first season have moved into the foreground; Mr. Kusanagi has taken a much more active role in HOMRA's activities compared to his leisurely bartending and occasional participation from season one. Fushimi and Yata continue to be at ends with each other, though the events of the movie have brought them closer and more vulnerable to each other than we're used to seeing them. The boys at SCEPTRE 4 are getting a bit more screentime and exploration this season, in response to how well we know HOMRA from season one (and the manga, if you read Memories of Red).\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nIf you take K as it is and experience it in the moment, it is a feast for the senses. The action scenes are beautifully choreographed and intricate without confusing the viewer with unnecessary camera shifts and forced perspective. Every single location is eyecandy with beautiful backgrounds and masterful use of color to draw the eyes to important details. The soundtrack is a labor of love and every piece invokes complex feelings and vivid imagery. K doesn't have the most amazing, unique, or suspenseful story out of anything you've ever watched, and you probably aren't going to be too impressed with the plot or the characters save for a few shining exceptions sprinkled here and there, but if you're capable of sitting back and letting your eyes and ears be taken on a sensory adventure, you absolutely will not be disappointed.\\n\\n\r\nOverall: 9/10\\n\\n\r\nK is an interesting experience in my list. Other anime that make it into my 9's do so with masterful storytelling and intricate characters. Return of Kings makes it into the list by the good graces of its breathtaking visuals and commanding soundtrack. The imagery is sharp, detailed, and complex. The soundtrack is evocative and an absolute delight. Return of Kings slides in to the top of my list unapologetically, recognizing its faults but not being afraid to capitalize on its merits. It's a continuation of everything we loved about the first season (well, ALMOST everything) but done better, and with more style. Treat yourself: check this out as soon as you can.",
            "date": "2015-11-08T12:28:00+00:00",
            "helpful_count": 18,
            "mal_id": 202987,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4581554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RegulusNorth",
                "username": "RegulusNorth"
            },
            "url": "https://myanimelist.net/reviews.php?id=202987"
        },
        {
            "content": "As bad as the first season will be the simple conclusion for Return of Kings except the absence of Angela's OP.\r\nNo story indeed, Please help me to find one.\r\nAnd the lines are keep repeating because there are too few lines and the plot is too thin.\r\nK is still very beautiful and holds a lot of production value on it's own. The artstyle is distinctive yet pretty, the backgrounds are truly amazing.\r\nNo doubt its the best looking anime of the season(Winter 15).\r\nThe OP is terrible. They switched Angela out and used the seiyuu of Anna. What a mess. The ending is quite bland but manageable.\r\nSoundtracks usedare another shining point of the show. Perfect bland with the flow especially the battles. And sounds posh during normal scenes too along with the gorgeous visuals.\\n\r\nEveryone who stays for the show are here for the boys. And they're even better, just freaking resurrect my Mikoto already.\\n\r\nCharacters own very strong personalities. Like they're the point of the show.\\n\r\nI found myself constantly skipping scenes especially with Yashiro repeating the same things or random craps. It's quite bad but on the same time Yukari is making me stay for the show, Munakata is shining bright for this season too.\\n\r\nAs a conclusion, for fujoshi's or fudanshi's eyes only. No one will come for the story. In some sense quite alike with the Kancolle or the will-be-happening Touken anime, but way better looking.",
            "date": "2015-12-12T10:41:00+00:00",
            "helpful_count": 14,
            "mal_id": 205338,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3454089.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Melvin117",
                "username": "Melvin117"
            },
            "url": "https://myanimelist.net/reviews.php?id=205338"
        },
        {
            "content": "WARNING: The following review contains some spoilers, please read further at your own risk.\r\nLet me start by taking some of the negative reviews into account. I do not understand what there is not to understand in this anime. What part of it can possibly be so confusing? It’s just plain simple, it expands to all the kings in this sequel, does not involve any mystery which was there in K (Which was the rather “confusing” bit).\r\n- Story 7/10\r\nThe story in K: Return of Kings is just an extension to the story in K. It further adds 2 kings and removes 2. Which again sums upto 5 total Kings. It involves the same deal they’re up with in the movie, which is JUNGLE. (Green Clan + Grey King)\\n\\n\r\n- Art 8/10\\n\r\n- Sound 7/10\\n\r\nWho wouldn't love K franchise’s flashy animation and music? GoHands especially showed off their animation in Episode 1 of this Sequel. The CGI was impressively applied to some surrounding objects (Cars etc.). The composition was done well too, just like in season 1.\\n\r\nAlso, I’d also like to mention that increasing Seri and Neko’s “Panty Shot” frequency is a lame way to try to up the ratings :P (Personally, I didn't really care about that)\\n\\n\r\n- Character 6/10\\n\r\nThere wasn't much of character development for side characters in the anime (Although the character developing side stories are available in the form of Novels which I don’t know where to find). I would have especially loved if they expanded Gouki Zenjou’s past in the anime, since he looked like an interesting character. They also skimmed through Neko’s past…. which I really wish they showed (By showed I mean animated, not in manga/novel form). They only mentioned that she was involved in the Damocles Down years ago and her real name. (Pardon me, I wrote this review some days after watching the series, so I forgot Neko’s real name). They skipped the part where Adolf L. Weissman had to abandon Shiro’s body and return to his original as well. (PM and correct me if I'm wrong, or was it the same body but grown up?)\\n\\n\r\n- Enjoyment 7/10\\n\r\nSince this sequel focused on dialogue a bit, I would say it got a little boring mid-way. But since I don’t drop any anime, I had to keep going. Otherwise K was a great franchise. (It ended decently)\\n\\n\r\n- Overall 6/10\\n\r\nK: Return of Kings was a bit of a let-down from its prequel, for me. I loved the first season mainly due to its mystery, Shiro’s interesting character and K’s artwork and animation. But still, this was a decent original franchise. In my opinion, K is a little underrated for an original series. I wonder if it mostly gets hate because the animation stands out too much (?)\\n\\n\r\nPS. The Slate was destroyed and they all lost their king powers, so I don’t think there would be another season.\\n\\n\r\nWell that’s it for me. Thanks for reading this review.",
            "date": "2015-12-31T02:50:00+00:00",
            "helpful_count": 13,
            "mal_id": 207370,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960422.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/One",
                "username": "One"
            },
            "url": "https://myanimelist.net/reviews.php?id=207370"
        },
        {
            "content": "K is a beautiful anime, the animation quality is top-notch. The soundtrack is wonderful and amazing. The second season does start off fairly slow, despite being a 13 episode anime, but it does get a lot better as it progresses. There's more focus on fights this time around compared to the first season which the main focus was the mystery. The cast is great but is quite large so don't expect too much development. Overall, the concept is interesting and one of the better animes this season. Definitely check it out if you've seen prequel, and if you haven't already, go check it out. Don'tforget to watch the movie which takes place between Return of Kings and the first season.",
            "date": "2015-12-19T21:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 206067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4012749.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shiiiru",
                "username": "Shiiiru"
            },
            "url": "https://myanimelist.net/reviews.php?id=206067"
        },
        {
            "content": "This show isn't o-K (ba dum tsss... okay onto the review....)\r\nI usually don't drop anime when it is boring. Despite how boring it is, I still continue because maybe the hype is still there. This anime is an exception. For the first time in my life, I drop an anime that is so boring. I have only watched until 6 episodes and I cannot watch further. Oh, and the 10th episode came out today. Wew. I don't know if I still can catch up.\r\nI have indeed watch the first K, and my overall thought of it is that the story has so much potential, butit's all wasted because of bland character motivations. Not to mention, almost all of them (if not, all of them) are boring. I am guessing it's because the original only had 13 episodes and they cannot find a way to make character development in limited time (There's a reason why the first Durarara had 24 episodes).\\n\\n\r\nDid I watch the movie? No. After how boring the first one is, I don't bother watching it's movie. The question is, is it a good idea to watch K: Return of Kings without watching the movie?\\n\\n\r\nWell, K: Return of Kings does show a bit of flashbacks, so I can still \"connect the dots\" on what is going on so far.\\n\\n\r\nOkay, onto the review of this season of K. This time, The \"jungle\" (Green) are now goofing around, Red and Blue teams up with the help of \"Silver King\" (I am not going to spoil who Silver King is. Watch Season 1 if you want to know who).\\n\\n\r\nThe problems with season 1 can also be found on this season. The characters again have bland motivations and are downright boring. Though, for the build up of the story, this season is quick in building up the battle between Red and Blue VS. Green. Unlike Season 1, the build up was too slow. The story also has no sense of direction.\\n\\n\r\nThe animation though, is outstanding. This is where K truly shines. Very well choreographed fights and not to mention, the shadings used throughout the anime are very pleasant to look at. The soundtracks are also great especially that ending theme. The ending theme could be one of my top best ending themes this year. For the opening though, it feels meh. I prefer the first season's OP.\\n\\n\r\nI barely enjoyed the anime. I enjoyed it's music and art style, but what truly puts this anime down is it's story and it's characters. I still don't know where the story is going. Lack of character motivation and development especially for the new characters that just entered this season.\\n\\n\r\nWatch it for it's \"pleasant to the eye\" animation, but don't expect a lot from its story.\\n\\n\r\nScore: 5.8/10",
            "date": "2015-12-04T19:51:00+00:00",
            "helpful_count": 11,
            "mal_id": 204809,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204809"
        },
        {
            "content": "My K: Return of Kings review, No Blood, No Bone, No Ash!!!!\r\nRatings: Story: Good 7. \r\nArt: Fair 6. \r\nSound: Good 7.\r\nCharacter: Mediocre 5.\r\nEnjoyment: Good 7.\r\nOverall: Very Good 8.\r\nOk, so I guess it is safe to say that this series has now been put to an end by authors GoRA ( whoever she/he is) and Furuhashi Hedeyuki, and quite frnakly it has been a good sequel, considering all the flare that this anime has. so:\r\nStory (up)\r\nWell, IMO it deserves a \"Good\" score since the plot really did played out well, since the story is about Kings who engages each other like a gang. So, the 1stseason is all about them Reds called HOMRA , whom were portrayed as  bad guys,  here, as the title said..... despite of the wrong grammar (since the one who truly returned is Shiro ) the first king has returned to make things right, because of the chaos being cause by them greens better known as JUNGLE (Welcome to the JUNGLE) , just as the first king returns, he has to set things right by destroying the cause of the kings squabbles in the first place and 'Yes\" it was the slates, and this sequel basically gives this series whether in the anime or the manga (Btw I'm yet to go over with ) a good ending.\\n\\n\r\nArt (up) \\n\\n\r\nOk, so far when it comes to art, IMAO, this anime still has to rely on the fanservice,between Neko and Seri, though, I kinda hate the flashy fashion of Shiro , Anna, Kuro, SCEPTER 4 guys and them JUNGLE big shot, what kept me from givinh this category a lower score was because of Neko and Seri's fanserves and the simplicity of them HOMRA's casual attire. BTW Both Shiro and Kuro look like a couple of pimps and Neko and Seri look like a couple of whores.\\n\\n\r\nSound (up) \\n\\n\r\nThe score was for the background theme being played during the action scene, of cousre I also like the seiyu who did Seri's voice, but for Anna to be voice by Yui Horie was just too unfitting since Yui Horie is already in her 30's to even be voicing Anna, it should have done by Bridcutt, Sarah Emi, since she has that childish voice.\\n\\n\r\nCharacter (up)\\n\\n\r\nSince this is a sequel, it wouldn't be fair to make any additional discussion about them, since they're the same ones from the previous season and the OVA before this was aired, so the ones to be discuss here are them JUNGLE guys, now here's the thing, IMO they're just the quintessential antagonist, and it's nice that only the Grey king and the head Jungle king has to die, and that's that.\\n\\n\r\nEnjoyment (up) \\n\\n\r\nWell, I thought that this is gonna be another good versus bad thingy, but with some fanservice and the sequel having a good plot it was all \"Good to say the least,  especially when we're made to think that somebody from the Blues have turned its coat only for us to discover that it was all the big man's idea, also the ending was nice since it was a happy ending when we see Shirio becoming a grown up Wisemann.\\n\\n\r\nOverall (up)\\n\\n\r\nIt was a very good ending to the sequel, so season 3????? Maybe, but I'm not counting on it, cu'a it may violate as to how things have ended already.\\n\\n\r\nFeliz Navidad, amigos.  \\n\\n",
            "date": "2015-12-26T02:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 206825,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=206825"
        },
        {
            "content": "I waited long for the sequel of K and I'm very disappointed to see how GoRa and the writers themselves messed the second season of my favorite Anime up.\r\nI set high hopes in 'Return of Kings' but I'm angry, somehow, how the story took it's course.\r\nThe show started with a nice flashback but after that - nothing. \r\nI don't want to spoiler because it's unfair for anyone who hasn't seen the second season yet, but in my opinion there would have been many other ways, better ways to let it end.\r\nThe biggest bother for me were the repeating scenes (for example  scenes with Annaor Reisi in it) and the OST's from season one, those aspects, and also the lame animated fight scenes ruined the enjoyment for me.\\n\r\nNot even the beautiful art, drawing style, animation were able to make it better. \\n\r\nMost of the fans who supported K waited for this sequel three years, expected a badass and amazing comeback but it was way too predictable. The first season gave high expectations and it also made a path for a very entertaining second season but the plans and actions in RoK were knitted too easy, not a bit thoughtful, there wasn't a bit of mechanic in it.\\n\r\nIt's just a 7/10 for me because I know that GoRa usually could've make it better.",
            "date": "2015-12-27T12:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 206990,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4209843.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/higekiri",
                "username": "higekiri"
            },
            "url": "https://myanimelist.net/reviews.php?id=206990"
        },
        {
            "content": "This was a great anime. I say that but of course there is still room to improve. Such as an improvement on the storyline so that those who couldn't keep up with it can understand it. But mostly that's down to the reviewers who didn't fully understand the story because after watching it myself it all made sense.\r\nThe main reason i recommend watching it is the artwork and lovable characters. Have you ever wondered what would happen if you turned beautiful anime fan art into a animation? Well the K series is the answer. K return of kings just shows off with its stunning lightingand beautiful supernatural chaos without a harem or douchebag main character to go along.\\n\r\nThe characters are also loveable with Shiro being the funniest, kindest and friendliest MC I can think off of the top of my head. Neko and Kurou are also great characters along with Fushimi and Mikoto. All of them could make you cry or laugh at the drop of a hat.\\n\r\nI extremely recommend this anime even if it has room to improve you will have a great time watching it. I may be an optimistic reviewer but I guarantee you will enjoy this anime and the other ones in the series.\\n\\n\r\n(You should definetely watch the previous series to catch up on the story, both are equally beautiful and you should e fine tell check them out.)",
            "date": "2016-10-17T11:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 231949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760319.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/4AN0N",
                "username": "4AN0N"
            },
            "url": "https://myanimelist.net/reviews.php?id=231949"
        },
        {
            "content": "Well, this is my first review so I decided to write about the second season of this fantastic anime that is K Project.\r\nTo start, I am going to talk about the story. I think that the way that the story is developed is much better than in the first season, being more complex and introducing us differents new characters. It keeps you waiting for more everytime you end an episode and you are always asking yourself what's going to happen next. About the end of the anime, I feel like they could had finished it in a better way, but they explain everything very welland they close the story succesfully. \\n\\n\r\nTo continue, I need to admit that the art is one of the things that first caught my attention about K. The charachters are beautiful, the backgrounds are incredibles and the fight scenes are amazing. How all the colors mix and suits well, and how the apparence of the characters actually says a lot about them is just fantastic.\\n\\n\r\nThe soundtrack, in the other hand, is awsome too. The music fits so well with the atmosphere of each scene and the seiyuus did an amazing work, especially Jun Fukuyama (Misaki Yata), Mamoru Miyano (Saruhiko Fushimi) and Horie Yui (Anna Kushina), whom also sings the opening theme. \\n\\n\r\nAnd I can't talk about the character's development without mentioning my two favourite characters: Misaki Yata and Saruhiko Fushimi. Everyone who watched the first season knows about their hate relationship and a little bit abour their pasts. But on this season you will see them as you never did before. They change and grown up a lot, and that are the only things I can say without making any spoiler. But if you like this two, you are going to love this season very much. Anna Kushina is other character that had a fantastic development and make you say \"WOW\" at the end. \\n\\n\r\nTo sum up, I think that people are going to enjoy this second season very much (if you enjoyed de first one and the movie, of course), I would say even much than the first one. I already watch it a dozen times and I didn't get bored, speacilly because you always find things that you didn't notice before. \\n\r\nI have a lot of favourite characters in this anime and I'm going to never forget about how this incredible season made me feel.\\n\\n\r\nHope you find this review helpful and sorry for the mistakes (I'm a spanish native speaker).\\n\r\nAbby.",
            "date": "2016-12-12T15:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 235344,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5866391.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AbbyYata",
                "username": "AbbyYata"
            },
            "url": "https://myanimelist.net/reviews.php?id=235344"
        },
        {
            "content": "Despite having few releases overall, GoHands has produced a few successful series, one of which is the K, or K project series. I first discovered K back in 2013 a year after its release, without any expectation of what I was in for. At the time I was already a fan of one of GoHands’ other releases, Seitokai Yakuindomo, but even without watching K, it was clear that the two releases were of completely different genres. \r\nI immediately became a fan upon watching the first season. So when I discovered that not only was there a movie release one year later, but also a sequelseason on the way, I was ecstatic. Because K is an original work, I was a bit anxious for this season and whether or not it would be a good release, but I had good faith that it would follow. That faith was well placed, because K: Return of Kings certainly did meet my expectations and more. \\n\\n\r\nWhile no anime will ever have a 100% hit rate with the community, that K is an amazing series is certainly not a pervasive opinion. Strangely enough it seems opinions are often cleaved, with part the community singing its praises, and part convinced it is beautiful icing masking a mediocre cake. I don’t think the series is as good or bad as either would have you believe, but it’s important to note the objectivity. Everyone forms bias in anything they watch. K is somewhat of a controversial anime to review, so it is important that I had established my bias here. Those who enjoy an anime will tend to overlook objective flaws, while those who do not enjoy a series may be overly critical and jaded. Therefore, I think it is good to keep an open mind while reading or writing reviews. As evidence that my view is somewhat grounded, I will begin by listing the flaws of K. \\n\\n\r\nAny scenes and lines that are forced is conducive to flaws in writing. We have all heard the phrase “Show, don’t tell.” While the meaning changes slightly with context, the phrase still holds heavy weight here. In an anime that is plentiful in exposition, it is crucial to balance and execute lines presented by the characters. One of the biggest issues I had with the series were moments when exposition was flat and overbearing, and other moments when it was lacking. These are common flaws, albeit ones that are difficult to work around at times. Not to be misconceived that exposition is bad; it is important for the viewer to understand what is going on, but exposition must be presented cleverly, which K does not always do. In a similar vein, K has issues with pointless and awkward dialogue. K can be a very posed anime, which is a double edged sword. Cool characters saying cool lines while in cool poses is the name of the game, and while they greatly adds to the identity of the anime, scenes like these were sometimes un-tasteful. Lines like “Your opponent is me!” or “It is my duty.” felt like they were cliches pulled from popular shonen anime, which did not quite fit the classy and cool aura. Iwafune in particular was irritating at times; it felt like he had many more lines than necessary to telegraph that he was a “laid back old man” stock character.\\n\\n\r\nAnother point that must be addressed is pacing. This is more subjective, and may be perceived as a flaw to some, not others. K moves at a relatively slow place. There are many blocks of dialogue, and exchanges between characters may often seem long and unfruitful. The direction is also paced more slowly. Camera shots are wide and slow, intent on giving the viewer time to absorb the visual and audio. For some this may be a deal breaker, resulting in a boring and drawn out experience, especially considering there is a fair amount of action in this anime. The contrast may be jarring, and it seems like nothing progresses during these scenes. My personal opinion is that contrast allows the viewer time to catch his breath, but more importantly time to understand the relationship between characters on screen. I will elaborate on this in the next section.\\n\\n\r\nOne of the biggest complaints I see about the K series is its lack of a coherent story, that pretty animation and a nice soundtrack cannot cover such flaws. I do agree that animation and soundtrack are rarely as important as core elements such as plot or characters, but I do not think this is a justified argument. The opinion that the story is sloppily written is a misconception, and what is most likely causing the cleave in opinion towards this anime. Starting with the basics of storytelling, it is difficult to establish a protagonist in Return of Kings. In the beginning of the first season, the story was clearly centered around Shiro, but the story quickly evolves into something much greater than himself. Return of Kings still lists Shiro as the main, but Shiro is not nearly as pivotal or involved as in the first season. There does not seem to be a clear protagonist here. The way K is written leads to a development of a large percentage of it’s characters instead of focusing on one. This is a difficult line to tread, since having an obvious protagonist is often what anchors viewers in a series so that they may have someone to follow or relate to. This worked in the first season, because Shiro’s crisis was an opportunity for him to lead us into the world of kings as he uncovered the truth to his identity. It was a smooth and ingenious way for us to learn about a world in which history had taken a different route, one in which there existed kings. The first season was just that: an introduction. As we transition into the current season, we already understand the meta of kings and how they function in society. If Shiro’s main purpose as the protagonist of season one was to introduce us to this world, there is no reason in particular for him to be the main focus of the current season. The events that occur caused by the antagonist organization JUNGLE involve all three kings, silver, red, and blue, and their respective groups. You could argue that the kings themselves are the mains in the story, but this isn’t necessarily true either. Yata’s development and impact as a character hold arguably as much weight as Anna, despite him being third in command at HOMRA, and her being the red king. Each character holds his own importance in his role and relationships with others, which is what makes K unique in it’s character presentation. This brings me to the next point.\\n\\n\r\nThe biggest driving factor of K, and the reason why it holds as an objectively good anime despite its unconventional composition, is the underlying core concepts and ideas that the anime explores. Every anime has some level of purpose to it. For the common single protagonist, linear plot presentation, the purpose is to tell the story of a character on an adventure. Understanding the purpose of an anime is crucial to interpret its message. In this case, it is quickly clear that the purpose of K is not to tell the story of a single character. K is about kings. This may seem obvious, as kings are a central focus in the anime, and the title itself, “K,” is a clear allusion to the term “king”. The ultimate purpose is slightly different: To explore the concept of influence and relationships of a king. There are many anime with similar premises of a select few powerful characters that often fight or clash. K takes this idea to the next level by exploring how different people with different ideals implement their given power in order to shape the world in a way they see fit. This is most obviously exemplified in the character foil pair of the red and blue kings. The third king’s ideal was to create a clan that would support each other like a family, built on values such as honor and trust. The fourth king’s ideal, on the other hand, was to use his clan to maintain justice and order in the world, much like a police force. It is inevitable that these two forces would clash often, as their respective priorities are at odds with each other. The result is a world much different from the one we know, a world in which power sets those apart from others. More than conflict between men with supernatural abilities, the theme is one of diplomacy and politics, pressure leading to conflict. The power they possess gives them freedom to change the world and the lives of others, but it also binds them. Towards the end of his life, Suou allowed himself to be captured by Munakata because he was not confident in his ability to keep his powers under control anymore. Suou may no longer live freely. The only way he may relax is when under the supervision of another king. The power of the kings also affects relationships far beyond the kings themselves. The different philosophies of each clan is also reflected in the relationships between clansmen and their king, and between clans as well. Fushimi is a well developed character that greatly contributes to this end. Yata constantly refers to Fushimi as a traitor, and they often fight throughout the series. However, when the cards are on the table, Fushimi does not fail to help his old comrade. Even so he never seeks thanks, and never skips an opportunity to criticize or provoke Yata. The result is a character with unique relationship with HOMRA, in that he always remains faithful, yet feels like he does not belong with them. Another prime example is Kusanagi, second in command of the red clan, and his relationship with Awashima, second in command of the blue clan. In addition to serving conflicting groups, they are clear character foils. Despite all of this, it is heavily implied that their personal relationship is a positive one, and that they have some sort of history together. These are just two of the more clear examples presented in the anime, showing that overall, the conceptual execution of how the power of a king affects the personal and political relationships of those around it was very thorough. This is all further aided by the direction, which in previous mention, allows us time to comprehend dialogue and understand the subtext of every interaction between characters.\\n\\n\r\nNow that I have covered the bulk of my analysis, I will briefly comment on the more superficial aspects; the animation and the musical score. To reiterate what was commonly said about the K series, pretty animation and good music does not a solid anime make. I have already established that I don’t believe the fundamentals underlying the anime are as flawed as some are led to believe. Then I may state how the animation and music ties in as an auxiliary force. K is one of the few anime for which I am completely in love with the animation and music. It is true that K’s animation and music standalone are already noteworthy, but I believe they go above and beyond because they complement the essence of the series and establish aura effectively. The subtle yet vibrant hues and delicate lines work in perfect harmony with the unique piano based soundtrack. This all augments both the characters’ design and acting, which can be summed up in a word: cool. Even after deeper analysis, it is undeniable that K wanted to establish a certain theme of cool male characters with supernatural powers, to which it certainly succeeded. Although it is arguably superficial, establishing aura in an anime can be very difficult, as it requires synchronization between animation and musical style, voice acting, and even plot. For K to have established such a unique and strong aura as an original series was an incredible creative feat, one to which I will certainly not overlook or downplay.\\n\\n\r\nThe K series has garnered opinions black and white throughout the anime community, with some claiming it is the greatest thing to happen to modern anime, and others passing it off as superficial with flawed fundamentals. Although I greatly enjoyed this series, I don’t believe K rests on either end of the spectrum objectively. While it is true that some fundamentals such as dialogue are not as good as they could be, K looks at a common scenario in depth with an original perspective, which ultimately holds great value in the world of anime. I rate this anime highly because I believe it’s contributions outweigh its flaws. \\n\\n\r\nI firmly believe that you do not need a reason to like an anime. Conversely, if you did not like this anime, there is nothing I can do about that, and I have no reason to deny your opinions, but I hope that with this review I can open a new perspective to both those who enjoyed, and did not enjoy the K series.\\n",
            "date": "2016-01-24T20:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 209324,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3827243.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/luciferthesecond",
                "username": "luciferthesecond"
            },
            "url": "https://myanimelist.net/reviews.php?id=209324"
        },
        {
            "content": "The artwork is also amazing. Feels like watching a movie not an animation. I never saw something like this before. The lens setting make it feels like it's not a drawing, it's not anime, it's a movie. Catchy back-sound also make it more live! Like every back-sound is really suit every scene. The coloring itself also \"uncommon\". Feels like the animator give some \"effect\" inside.\r\nTalk about the story, well it's pretty stagnant yet focused in one mater. I love the consistency even though some of the story left curiousness like why there's only 5 kings while it says originally has 7 kings. What happened tothe other kings? Why they don't have any successor and ext that need to be told in my opinion. \\n\\n\r\nI also curios about the death of the green king. Why he can't be alive again while Weismann can be safe after the accident? Will it has the 3rd season or will explained more in an OVA? Who knows.  \\n\\n\r\nIn conclusion I love this anime and recommend you to watch it!",
            "date": "2018-10-21T05:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 292211,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7499784.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sazarits",
                "username": "sazarits"
            },
            "url": "https://myanimelist.net/reviews.php?id=292211"
        },
        {
            "content": "So this season of K does most of the things that the previous season did. I loved the previous season of K. So why didn't I like this season nearly as much??\r\nWell there are 3 reasons:\r\n1) The HUGE addition to Fan-Service. The first season had it and it was enjoyable. it added to the atmosphere and made some moments quite humorous. However, in Return of Kings, you can be in the middle of watching the most intense fight scene ever and suddenly you have breasts jiggling in your face. I'm talk about Dead or Alive Extreme Beach Volleyball level of jiggle physics\r\n2) The animators triedtoo hard. Like, the first season was perfectly fine and I still praise its animation. However, there were lots of moments in this season where things felt disjointed and forced animation-wise.\\n\r\n3) Nothing really happens. Sure you have a major conflict and the opening sequence is a joy to watch, but for a majority of the season, it's just...boring. The end really redeemed it, but still, the show didn't provide as well as it could have.\\n\\n\r\nThat being said, the season was still K. Beautiful style, great music, fun characters, cool concept. It just was not executed nearly as well as with the first season. In my honest opinion, Return of Kings in one word is unnecessary. They really should have just ended the show at the last episode of season one and been done with it. Season two, while still enjoyable to anyone who watched the first season, is a slight let down. However, I still very much enjoy this show and recommend you watch it if you have seen the first season. You have nothing to lose\\n\\n\r\nAnd that's why K: Return of Kings gets an 8/10",
            "date": "2015-12-27T17:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 207026,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4769556.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dalek_of_Skaro",
                "username": "Dalek_of_Skaro"
            },
            "url": "https://myanimelist.net/reviews.php?id=207026"
        },
        {
            "content": "K: Return of Kings or an anime with colorful animation.\r\nThis one is really popular, since it has a decent and at the same time, not your average anime, but this season is still right off the track.\r\nStory and Characters: 5\r\nOk this anime is an Action, Super Power, Supernatural, like Durarara\r\nThe Action is the best thing you can have, it's great for the eyes, but at the same time, it makes me dizzy @_@\r\nSuper Power, well it's just like durarara. I mean the setting was set on the city, with group wars and each individuals on that group does have a power, but unlike durarara whichhas unique powers on each individual, this has portrayed same abilities on each characters.\\n\\n\r\nSupernatural, not sure if this genre is different from super power, well I think it's just applied when the action comes, they've just added an element comparable to lightsabers on the weapons of every individual, and some Kings as their leaders with a floating sign in the sky. \\n\\n\r\nThis anime is a slice of life and mystery on disguise. But the characters are outstanding, even the supporting characters are noticeable. The characters here are not thrown out, they are very well maintained and each of them as unique features even their powers are the same.\\n\\n\r\nAnimation: 10\\n\r\nWell it's the best it got, everything(expression, character design, background, effects) is just perfect when it comes to art, but I think this anime is meant for girls, since the there are more beautiful guys than girls.\\n\\n\r\nExpression is really good, though I think it gives me a yaoi vibe especially to Kuro and Shiro(I'm a guy) but at least there's Neko\\n\\n\r\nCharacter Design is the best, so beautiful, it's an anime full of handsome guys, and Beautigful Girls, sometimes it gives fanservice to both genders.\\n\\n\r\nBackground, This is the Best So Far, Every background is eye catching, I were to be asked, I wanna make the background as my wallpaper. \\n\\n\r\nEffects, it's just great.\\n\\n\r\nSound: 7\\n\r\nThe OP is not good for me, It has great visuals, but the song is not my type. The ED is really good, It has great visuals, and I love the song.\\n\r\nThe Voice Actors, well I just love them, they are really good. The BGM is really good, it's unique and with a rich sound that I feel I'm having a tea time even though it's not my type.\\n\\n\r\nEnjoyment: 5\\n\r\nWell I love it, but there the slow pacing and the the plot is still off the track and some fillers makes the flaws of this anime. Well it's still decent and has a potential. But I think girls will love this one. But as a boy, it feels there's a yaoi feeling, but at least, it's not like that. \\n\r\nWell This one is recommended anime for this season, at least its pretty decent with a notable art.",
            "date": "2015-10-25T01:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 201917,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4762431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/VanAlex",
                "username": "VanAlex"
            },
            "url": "https://myanimelist.net/reviews.php?id=201917"
        }
    ],
    [
        {
            "content": "Superpower anime has been the main solution to attract many people in order to keep the Anime industry in balance. Since the success of such famous anime like the big three (Naruto, One Piece, and Bleach), there are dozens anime that uses the super power as an appeal and works as a direct jump to make profits. One of them are the K - project franchise, which has been ongoing since 2012. K Return of Kings is the 3rd project that exists in K Franchise. As the series go, K really didn't maximize any potential that it have. \r\nThe 1st season started the story whileadding the mystery genre into it. While Return of Kings does a different thing, they're trying to build-up its world in this 13 episode. While doing that, the anime throw many flashbacks & scenes to build that, but they didn't succeed the 30% of it. \\n\\n\r\nFor about 8 episodes K: Return of Kings brings us an endless \"information dump\". The blank paper is filled, they fill it with many chit-chat and useless scenes and they just did the same mistakes once again. As the plot drive slowly, K Return of Kings really just wasting the time it has. The story can be described as 'disoriented' and didn't have a clear direction, it just floating in the air with unclear reasons. \\n\\n\r\nAs we expected, K strongest power is in the budget. The animation grows very colorful and beautiful. The town settings and the battle scenes are well produced. The character designs have hundreds of bishounen waiting for the fangirl to scream. To adding that, we have some useless fanservice scenes using boobs and many other round things to maintain the enjoyment of the fanboy. Well, those things remind me, \"What if K animation similar like Ping Pong?\", fortunately, the reality is not like that.\\n\\n\r\nSound settings are okay, the new Opening & Ending Song are not too bad either. The background music was still great like its prequel. Voice actors did a great thing in doing their job.\\n\\n\r\nAnother disappointment we have is there is no in-depth character development. They throw many flashbacks in this little amount of episodes but useless flashbacks indeed (especially the first 8 minutes of episode 1). The main character possibly didn't do as the main character, they just fleshed out by supporting characters, their role was actually minimum in this series. The green king's motive was relatively poor and slightly typical and we have the gray king in return. The problem is they unloaded a number of characters with not the right balance and I should say this \"None of the clansmen has a particular role in anything...\", they just as useless as ever and just filled the vacancy of the episodes. It's just so blank, useless, and ridiculous.\\n\\n\r\nThe useless scenes that occur in the first six episode really bring a bad effect to the enjoyment itself. Actually, the battle scenes are pretty cool and colorful. But it got such an unexpected downfall especially for the story section and character section.",
            "date": "2015-10-24T06:18:00+00:00",
            "helpful_count": 124,
            "mal_id": 201842,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=201842"
        },
        {
            "content": "**UPDATED** Added a paragraph with my thoughts on the ending.\r\nHonestly, I can't believe the negative reviews!\r\nThis anime is a rarity in my opinion. The first season of K was more of a mystery, trying to figure out who Shiro really was, this time it's about keeping the peace. It's focused on all of the groups as a whole rather than individually and explores a goal that all three kings share. \r\nThe animation is spectacular and far surpasses AoT, I particularly like the animation in scenes with Misaki on his skateboard, there has clearly been extra care into those types of scenes. There has been nomajor character development since the characters were probably explored to their full potential in the first season. The show is only three weeks away from its climax and I'm looking forward to it. I hope that this season doesn't have a disappointing finale, since the first season of K had an excellent finale, and as predictable as the show can be at times, it's thoroughly entertaining and I definitely feel like it's one of the best this year.\\n\\n\r\nOkay, so the ending did not disappoint, I appreciated that it was left on a cliff hanger kind of and I appreciate that a lot of loose ends from the past season were tied up. I don't feel like this anime really NEEDS a third season, because everything has already been tied up with a nice neat bow already. \\n\r\nI didn't get the type of ending I wanted, but I'm not disappointed with what we did get either. It's a nice ending. It was built up climatically, and I would've been happier with a darker ending, but the one that we got was nice. That's really all I can describe the end of the show as, \"Nice.\" \\n\\n\r\nThe soundtrack is also mind blowing, the soundtrack is actually one of the things that draw you into the show, as it compliments the colour pallet and spectacular animation and action scenes that the anime gives you in pretty much every episode. \\n\\n\r\nI give this show a solid 10/10 so far, I may downgrade the review depending on what happens in the finale though as I definitely feel like a bad finale can let down an entire show. Hopefully it's good!",
            "date": "2015-12-07T14:53:00+00:00",
            "helpful_count": 102,
            "mal_id": 204985,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4484331.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/whorifying",
                "username": "whorifying"
            },
            "url": "https://myanimelist.net/reviews.php?id=204985"
        },
        {
            "content": "To all the people who says this show is just too mysterious with it's plot and you can't understand it, therefore giving it a bad score, ohmygoodness, if you just paid a LITTLE more attention like maybe reading the story and actually TRY to understand it, then you'll get it.\r\n     Now first i'll say the cons, this show woulve got a 10 from me if some scenes were better, here's some parts: 1: If Nagare died first from losing power from the slates, how does the girl bring Fushimi back up the surface, she woulve lostthe power way before that. 2: How the heck did Adolf find his original body at the end. 3: How did Yukari not dodge Kuro's slash, it seemed like it was coming at turtle speed. 4: What did Zenjo do for the entire episode? he was just standing there, for two episodes.\\n\\n\r\n     Now let's move on to the pros. 1: DID you see the artstyle during the middle of 11? Suoh's jacket looks soo fresh it's like you never seen a good jacket in your entire life. 2: The battle scenes, they made the fight between Kuro and Yukari's sword actually have different sounds each time it clashes, such small details means something. 3: The story wasn't so bad, in the end, things did end up good, everyone was safe,(except you know, Nagare and Tenkei) and it didn't end badly. 4: Even though I listed less Pros then Cons, the Cons are small things.\\n\\n\r\n     For any of you who still bitch about \"what and where did the Sword of Damocles come from, I'll tell you what it means, It came from a passge from Cicero. A tyrant that seemed welathy and powerful to the public had a adsentatores (court flatterers) called Damocles compliment him one day about his power and wealth, so the tyrant said would you like to try out my life? Damocles accepted, and as he was enjoying his life, he notices a sharp sword dangled on the ceiling above his head by a horse hair, the tyrant explained that this was life as ruler was like. NOW K TOOK THIS, and it means that each of the kings, they have their responsiblities as kings, their Sword of Damocles falls means their death, when Suoh died, so will his Sword of Damocles and the burden it had, causing explosions. That's also why killing a king adds huge burden to your Sword of Damocles and when your burden exceeds ur limits, if will fall ending your life too. THAT'S WHY KINGS ARE JUST ONE PERSON, if everyone is kings, the burdens of everyone's Sword of Damocles can be chaotic. And this is where the Sword of Damocles came from.\\n\\n\r\n     This show was fantastic, the animation and good soundtracts (espacially you Suoh Mikoto's theme song *wink wink*), the character development isn't that bad either, the main characters all got a time and some screentime to shine. heck even the gold clansman got a scene! There's humor added time to time. And just coolness, added to almost all the characters, so calm for some, and others (talking about you Yata) shows some kind of emotion through someway or other. \\n\\n\r\nOverall, I give K a 9/10 Clouve gaved a 10 if wasn't for those Cons up there. (season 3's not coming, don't wish for it, story's over lol if you want more, imagine it, and add Suoh.)",
            "date": "2015-12-26T01:09:00+00:00",
            "helpful_count": 67,
            "mal_id": 206822,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4719984.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Childly",
                "username": "Childly"
            },
            "url": "https://myanimelist.net/reviews.php?id=206822"
        },
        {
            "content": "Mod Edit: Review may contain spoilers.\r\n--\r\nCurrently on episode 13/13\r\nI don't think this anime can be properly appreciated with out watching K: Missing Kings Movie between episodes 1 and 2. Because there are huge bits of info \"missing\" between the first 2 episodes. The movie isn't a prequel. It fits directly in between episodes 1 and 2 and explains what happens Mikoto and how Anna becomes the new Red King. What happened to the Gold King and the Gold clan members. As well as other pieces of key information related to the events leading up to the 4 episode.\r\nI love everything about this series so far.It's exciting to watch, the fight scenes are some of the best I've seen in a while, most of the characters are already pretty powerful so not a whole lot of room for growth, but we're talking about a series with 7 kings and their vassals so they have to be OP from the start because there are only 13 episodes and the 1 hour long insert movie so some things need to already be understood about the story line. Lengthy character development should be left for series exceeding more than 20 episodes. There just isn't enough time to explain every single little detail in a shorter series.\\n\\n\r\n*edit* So with the series wrapping up it's final episode I have to say I enjoyed it very much. For those of you that haven't watched it yet but are interested in doing so, you should know that K is part of a larger project so get the full experience watching the Missing Kings movie is a must. Even though the movie is a year older than Return of Kings it's not a fucking prequel but an insert for Return of Kings.\\n\r\nI recommend watching the movie after the first episode of Return of Kings. Then the second episode as it was probably intended. For whatever reason it was produced this way, the movie takes place after the first episode and before the second of Return of Kings. Explaining most of the gaps in the story between eps. 1 and 2. Also there are a few manga that go with the events of the entire K project. \\n\r\n \"K - Countdown\" is a must read it takes place after the events in the movie and contains the information and character viewpoints after Mikoto's death. (8 chapters)\\n\r\n\"K - Stray Dog Story\" - Kuro's story (5 chapters)\\n\r\n\"K - Days of Blue\" - Scepter 4's story (10 chapters)\\n\r\n\"K - Memory of Red\" Homra's story (15 chapters)\\n\r\n\"K - The First\" Shiro and the Gold Kings story (16 chapters)\\n\\n\r\nI highly recommend watching this anime it's so good. So far 9/10 overall from me. Thank you for reading! Enjoy the show! ^_^",
            "date": "2015-10-25T07:59:00+00:00",
            "helpful_count": 64,
            "mal_id": 201943,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4584865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mata1ch1",
                "username": "Mata1ch1"
            },
            "url": "https://myanimelist.net/reviews.php?id=201943"
        },
        {
            "content": "Too much style, less to none substance. That is how I see K: Return of Kings. \r\nContinuing from the events roughly after a year that occured in the first season and the movie, K: Return of Kings is a continuation of the series as it exposes the mysteries behind the seven kings and the Dresden Slate that was the cause of it all. \r\nFrankly talking, the story makes sense as all of the questions that were left behind in K is being answered but the narrative itself is very weak. What made K a successful anime was because it literally didn't care about anything. Youheard it right, K had little to no cohesive storyline to begin with. Stuff about Kings ruling the planet and keeping order to an inane teenager going around places to know who he was, where he came from as he remembered nothing about himself and being chased by gangster-like guys didn't make all that sense. But it was what that kept it going for thirteen episodes and made it a very charming show. Even if it had little to no plot whatsoever, K simply was a show that one could enjoy even it wasn't a masterpiece. K: Return of Kings tosses that reputation away. Too much exposition in the middle episodes assisted with a very slow start. Even at that the very first episode was nothing but a pandering to the fans with voluptuos breasts appearing in a way that would be unimaginable in real life. \\n\\n\r\nBut still that is what unique about anime, right? Honestly the amount of fanservice in the show and the pandering of Awashima Sera to the fans would top any ecchi or harem shows and bring them to shame. And it didn't stop in the first episode. After K: Return of Kings got underway it immediately shifted gears to a very tranquil mode with demonstration of words joining the game. To my surprise the stupidity of the fanservice did not stop at the first episode, but it kept coming every once in a while totally throwing all the post buildup to a dustbin. It would've been forgivable if just for the pilot episode, as it did bring me back memories of the unique experience of K I got in the first season. But no, GoHands really had to please the closet fans with all their Blu-ray sale accumulation from the first season. However it appearing once in a while really made the whole show mundane and made me lose glamour for the series.\\n\\n\r\nK: Return of Kings has almost the same set of characters as the first season, with the addition of Hisui Nagare who has a main role as the Green King. Almost all other characters remain the same with not a lot of development. Neko the very same annoying mix of Human-Cat hybrid and Kuro who now has his intentions set on protecting the Silver King Shiro, who he was after to kill in the first season. The main disappointing for me was the characteristics of Shiro. He's the same old soft and inane teenager who really doesn't seem like giving a shit even when he's now the one who created this all. The Silver King. The King of Beginnings. He was mostly portrayed as a weak character even if he was the First King compared to Hisui Nagare, who really seemed to have the upper hand against him the entire series. One of the main reasons for failure of for the show was the exclusion of the former Red King, Suoh Mikoto. Mikoto simply was a fiery and striking character right from the start. I know he died at the end of the first season and they had to continue with it, but yet the rivalry between Mikoto and the Munakata Reisi, the Blue King was one that I wanted most. Anna is a pretty good character however not as brilliant as Mikoto. K: Return of Kings mostly focuses around Anna and the OP is dedicated to her characteristics. Talking about the OP, the sound aspect of the show does not really disappoint. The ED of K: Return of Kings was my pick of the season. However I do share the opinion of most people that it should have been the OP and vice-versa. \\n\\n\r\nI've seen people either really hating the franchise and supporting it. If I had to say I'm the one in-between the two. I really liked the first season of K and also the following movie, but K: Return of Kings for me was unnecessary. It did not have to explain all the things bit by bit to position K as a successful anime. It already had its fanbase and even I was on the good side of it. Three years later though they really had to bring it back, and I have to say that after finishing the whole series I'm disappointed.\\n",
            "date": "2016-02-04T05:35:00+00:00",
            "helpful_count": 33,
            "mal_id": 210075,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3903513.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/karlstein12",
                "username": "karlstein12"
            },
            "url": "https://myanimelist.net/reviews.php?id=210075"
        },
        {
            "content": "Watching K: Return of Kings is like running inside walls of a labyrinth, trying to find a way out. The confusion sinks in more and more and by the time you reach exit, it’ll be a relief. No, I don’t mean that the second season of K takes place inside a labyrinth. That would just be plain weird. What I mean is that K: Return of Kings lacks entertainment when it comes to storytelling. Each episode progressively makes the show more and more mind boggling. For a show that makes its big return, it’s also a big disappointment.\r\nAs the direct sequel of the movie, K:Missing Kings, this series also requires knowledge from the original season. Without it, watching the Return of Kings would be a dreadful experience. The first few episodes consists of setup that builds more and more for future events. Anna is now declared as the new Red King. She’s the little girl dressed in a goth loli outfit but has quite a confident personality when it comes to taking up the new role. Kuro also makes his return along with Neko and Shiro by his side as the original trio. Then, there’s new developments like the introduction of the Green Clan. Consisting of members with powerful abilities, they are labeled as the big bad of the season. \\n\\n\r\nThe structure of storytelling for the second season feels more like a car assembly. The first parts comes, then the building begins, and finally, we get the test drive. But unlike a car, it can get a bit confusing. First of all, the Green Clan consists of a prominent group of characters with ambiguous motivations. We don’t find out more about them until later on the season. But what’s interesting is that they treat almost everything like a game. What’s more is they use the social media to play out their plans through unpredictable strategies while causing confusion among the communities. In retrospect, the Green Clan is the big question mark fans will have for this season. Who exactly are they? What do they want? What’s their ultimate goal? Plot twists are also integrated into the story that makes them look even more deceptive. Unfortunately, it isn’t very interesting in the end. This is because there’s a lack of character growth and their role in the series seems condensed into more of their actions rather than real purpose. \\n\\n\r\nCharacterization for this season is also really a hit or miss. On a positive note, I think the show has chosen a suitable Red King and in this case would be Anna. She demonstrate her ideals, skills, and responsibility especially in her role against the Green Clan. In addition, she has earned the respect of her allies and is truly a character that is mysterious. The Green Clan also has some members that can be intriguing. Unfortunately, that’s really about it. The antagonists of the series are stereotypical and really lacks characterization. Shiro’s return to the show doesn’t bring anything special to the table. Not to mention, his sidekick Kuro still remains just as cat-like and almost lacks a personality. Her role is pretty much a cheerleader that again lacks any sort of prestige. And because the show has a large cast of characters, it’s really hard to pick out one to truly embrace. \\n\\n\r\nIf there’s one thing that is somewhat interesting is some of the morality and philosophical dialogues. While this does spark interest, most of it is masked by the frequent amount of generic content. Relationship dynamics are shortened with frequent mood changes and even the comedy feels dense with the die-hard dialogues. It sometimes feels like the show is mindlessly trying to appeal the audience through the rivalries of the colored clans. While this looks okay on the surface, it still doesn’t do justice for its execution.\\n\\n\r\nOn a technical front, the K franchise is a powerhouse. There’s a lot of emphasis put into the animation that is high quality with the setting. GoHands’ budget is put to use with highlighting the architecture backgrounds. The fluid animation also translates to character designs with their stylistic battle uniforms. While there’s lazy body movements at times, the action is mostly consistent with high caliber movements. The show is also known for some bits of fan service. While it doesn’t have the typical onsen or beach episode, there’s quite a decent amount of suggestive camera angles exclusively focused on Seri. It seems the cameras just love her.\\n\\n\r\nSoundtrack is more or less easy to forget or take notice. The OP song is a downgrade from the previous season with the lack of feature with other characters. It seems like they are making Anna the poster girl of the show as she is exclusively focused in the OP song. The lyrics combined with the choreography is sub-par this season as well. The OST seems to have improved in some aspects in particular with the Green Clan’s battle theme. However, when it comes to adapting soundtrack, K is less about what it wants you to hear but more what it wants you to see in the end.\\n\\n\r\nReturn of Kings is really an underwhelming return. Storytelling is a weakness in itself combined with its lack of concrete characterization. While there’s an interesting amount of mystery developing for the story at first, its execution and inadequate timings are what keeps the show from excelling. If you’re ready for some porn scenery, coolness, and curiosity about continuity, then this might be a show for you. In retrospect though, K has lost its freshness and became a hollow shell of its former self.",
            "date": "2015-12-25T21:04:00+00:00",
            "helpful_count": 26,
            "mal_id": 206810,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=206810"
        },
        {
            "content": "The first thing I could say is that this anime is K. Oh my, what a bad pun. Anyway, moving on to the review, K - Return of Kings is the long-awaited sequel to the original series for the ones who enjoyed the first season, whereas for the viewers who didn't might as well skip it, as it was more of the same. Audiences are presented once again with fantastic animation and sound, in addition to its interesting premise as well as its colourful cast; however, story and character development remain lacking as well.\r\nThe story of K - Return of Kings focuses on what thetitle suggests: the different kings that remained unknown in the first season, as well as the previous kings and its development, including the silver king and the newly crowned red king. What is more, it explores more on the mysterious \"Slates\" and its ability, in addition to introducing the mysterious group \"JUNGLE\" whose objectives are unknown. With that being said, the story remains unpredictable and entertaining, albeit having its share of flaws such as plot holes and the lackluster characters. \\n\\n\r\nViewers are presented with an expansion on the different kings and the Slates, and thus its powers; however, the explanation on how these work or their precise origin is never revealed to the audience. This was a drawback, as it was one of the aspects of the first season that I personally wanted to see in the sequel. The action scenes presented were varied as well as intriguing due to the unpredictable nature of the anime; however, it had its share of power imbalances, growing or lessening whenever the story required it.\\n\\n\r\nThe pacing itself was a bit \"chaotic\", meaning events were at times either to fast or too slow, yet had its typical K feel to it, which was a positive aspect at a personal level. Another thing that could be mentioned is the fact that it focused much less on the slice of life parts presented in its predecessor. However, there were also quite some scenes that were unnecessary for the story such as flashbacks, or either dwelling too much on certain scenes, characters or themes. Dialogue presented was quite lackluster and basic throughout the anime, repeating lines a bit too much to my liking: it was at times not straightforward.\\n\\n\r\nAs for the characters of K - Return of Kings, the cast presented is basically the same as the first season, with the addition of a handful of characters. It could be said that in one case it was doubtful whether the character was male or female because of its behaviour. Character development and the fleshing out of these remain overall very lackluster, to the exception of some. This is the case for Saruhiko for example, in which his motives and past are a bit better explored. What was very lackluster is the fact that some who remained mysterious in the first season remain unexplained, such as Neko: this character just seems to be there for fanservice purposes, besides of being quite annoying at times. This concerns the red king as well, who remains as plain as ever, with absolutely no change in character. The fact that it didn't further explore on the golden king or the silver one either was a shame as well. Nevertheless, the interactions between the various characters were at times interesting.\\n\\n\r\nMoving on the art style of the anime, this quite engaging to the viewer, especially concerning the environment and backgrounds, which applies to the characters as well. However, these are all \"bishonen\" type of characters, with a flamboyant hairstyle and figure: this applies to the few female characters as well. Which leads me to think the anime is mainly targeted to females, rather than the male demographic; and in case some males are watching, beautiful woman with overly large breasts are stationed there as well. As for the animation quality, this is of very high quality and colourful, as audiences are accustomed of the anime, with great action scenes.\\n\\n\r\nConcerning the sound, this was very befitting of the anime, using a variety of great compositions such as the piano ones. As for the voice actors, these performed their role well, which generally matched with the characters. What however must be mentioned is the fact that the dialogues are repeated a tad too many times, such when Scepter 4 unsheathed their swords.\\n\\n\r\nK - Return of Kings was overall an enjoyable anime, and a sequel that maintained the standards of the first season, yet not improving on its flaws. It was once again a pleasant experience animation and soundtrack wise, as well as the unpredictable story, albeit very flawed. The character designs were a bit of a drawback personally, in addition to some characters that remained unexplored. So do I recommend this sequel? I do for those who enjoyed the first season or the soundtrack and animation; yet for those who didn't, I would stay away from it, as it is basically the same with no improvements made, including a story of lesser quality.\\n\\n\r\nThank you for reading.",
            "date": "2015-12-25T23:01:00+00:00",
            "helpful_count": 19,
            "mal_id": 206818,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4296397.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nervin",
                "username": "Nervin"
            },
            "url": "https://myanimelist.net/reviews.php?id=206818"
        },
        {
            "content": "Story: 7/10\r\nWhile K's story is not bad, it's a lot of the same stuff we've seen before with a different flavor. We've got some conflicting factions of superpowered individuals based solely in Japan fighting over basically nothing other than the right to exist independently of the other clans. The first season was rife with flashbacks and infodumping in order to catch viewers up with the setting, which put a lot of people off as the plot was rather simple for the amount of info being introduced. Here in season two there is significantly less of that, with most infodumping contained to introducing us to themajor antagonistic force of the series. All in all, Return of Kings is a continuation of the same enjoyable plot we experienced in the first two entries into the series, but again, nothing new or groundbreaking.\\n\\n\r\nArt: 10/10\\n\\n\r\nIf you're watching K, chances are you're here because of the soundtrack or the art style. This series is absolutely gorgeous. The backgrounds are sharp and breathtaking. The cityscapes are vast and alive. The colors are rich and rife with symbolism and suggestion, given how important colors are to the setting and the plot. Even the side characters have enough detail to be the main characters of other anime. No expense was spared on the art here, and it shows. If there is one place K shines, this is it. Just watch the first few minutes of any episode and you'll see what everyone is talking about.\\n\\n\r\nSound: 9/10\\n\\n\r\nWhile not as overwhelmingly fantastic as the art style, K's soundtrack is a force to be reckoned with. Among the more notable tracks are Suoh Mikoto's theme, (which is what season one opened with) Kuro Yatagami's theme, which often punctuates his fight sequences or conflict scenes; and Shiro's theme, with its beautiful use of piano to convey a sense of regality accented with gentle demeanor. Every entry into the soundtrack is uniquely charming and carries with it a sense of purpose and vivid imagery. \\n\\n\r\nCharacter: 8/10\\n\\n\r\nThe characters weigh in just slightly higher than the story. While not nearly as noteworthy as the art or the soundtrack, the cast is diverse and interesting. Our side characters from the first season have moved into the foreground; Mr. Kusanagi has taken a much more active role in HOMRA's activities compared to his leisurely bartending and occasional participation from season one. Fushimi and Yata continue to be at ends with each other, though the events of the movie have brought them closer and more vulnerable to each other than we're used to seeing them. The boys at SCEPTRE 4 are getting a bit more screentime and exploration this season, in response to how well we know HOMRA from season one (and the manga, if you read Memories of Red).\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nIf you take K as it is and experience it in the moment, it is a feast for the senses. The action scenes are beautifully choreographed and intricate without confusing the viewer with unnecessary camera shifts and forced perspective. Every single location is eyecandy with beautiful backgrounds and masterful use of color to draw the eyes to important details. The soundtrack is a labor of love and every piece invokes complex feelings and vivid imagery. K doesn't have the most amazing, unique, or suspenseful story out of anything you've ever watched, and you probably aren't going to be too impressed with the plot or the characters save for a few shining exceptions sprinkled here and there, but if you're capable of sitting back and letting your eyes and ears be taken on a sensory adventure, you absolutely will not be disappointed.\\n\\n\r\nOverall: 9/10\\n\\n\r\nK is an interesting experience in my list. Other anime that make it into my 9's do so with masterful storytelling and intricate characters. Return of Kings makes it into the list by the good graces of its breathtaking visuals and commanding soundtrack. The imagery is sharp, detailed, and complex. The soundtrack is evocative and an absolute delight. Return of Kings slides in to the top of my list unapologetically, recognizing its faults but not being afraid to capitalize on its merits. It's a continuation of everything we loved about the first season (well, ALMOST everything) but done better, and with more style. Treat yourself: check this out as soon as you can.",
            "date": "2015-11-08T12:28:00+00:00",
            "helpful_count": 18,
            "mal_id": 202987,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4581554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RegulusNorth",
                "username": "RegulusNorth"
            },
            "url": "https://myanimelist.net/reviews.php?id=202987"
        },
        {
            "content": "As bad as the first season will be the simple conclusion for Return of Kings except the absence of Angela's OP.\r\nNo story indeed, Please help me to find one.\r\nAnd the lines are keep repeating because there are too few lines and the plot is too thin.\r\nK is still very beautiful and holds a lot of production value on it's own. The artstyle is distinctive yet pretty, the backgrounds are truly amazing.\r\nNo doubt its the best looking anime of the season(Winter 15).\r\nThe OP is terrible. They switched Angela out and used the seiyuu of Anna. What a mess. The ending is quite bland but manageable.\r\nSoundtracks usedare another shining point of the show. Perfect bland with the flow especially the battles. And sounds posh during normal scenes too along with the gorgeous visuals.\\n\r\nEveryone who stays for the show are here for the boys. And they're even better, just freaking resurrect my Mikoto already.\\n\r\nCharacters own very strong personalities. Like they're the point of the show.\\n\r\nI found myself constantly skipping scenes especially with Yashiro repeating the same things or random craps. It's quite bad but on the same time Yukari is making me stay for the show, Munakata is shining bright for this season too.\\n\r\nAs a conclusion, for fujoshi's or fudanshi's eyes only. No one will come for the story. In some sense quite alike with the Kancolle or the will-be-happening Touken anime, but way better looking.",
            "date": "2015-12-12T10:41:00+00:00",
            "helpful_count": 14,
            "mal_id": 205338,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3454089.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Melvin117",
                "username": "Melvin117"
            },
            "url": "https://myanimelist.net/reviews.php?id=205338"
        },
        {
            "content": "WARNING: The following review contains some spoilers, please read further at your own risk.\r\nLet me start by taking some of the negative reviews into account. I do not understand what there is not to understand in this anime. What part of it can possibly be so confusing? It’s just plain simple, it expands to all the kings in this sequel, does not involve any mystery which was there in K (Which was the rather “confusing” bit).\r\n- Story 7/10\r\nThe story in K: Return of Kings is just an extension to the story in K. It further adds 2 kings and removes 2. Which again sums upto 5 total Kings. It involves the same deal they’re up with in the movie, which is JUNGLE. (Green Clan + Grey King)\\n\\n\r\n- Art 8/10\\n\r\n- Sound 7/10\\n\r\nWho wouldn't love K franchise’s flashy animation and music? GoHands especially showed off their animation in Episode 1 of this Sequel. The CGI was impressively applied to some surrounding objects (Cars etc.). The composition was done well too, just like in season 1.\\n\r\nAlso, I’d also like to mention that increasing Seri and Neko’s “Panty Shot” frequency is a lame way to try to up the ratings :P (Personally, I didn't really care about that)\\n\\n\r\n- Character 6/10\\n\r\nThere wasn't much of character development for side characters in the anime (Although the character developing side stories are available in the form of Novels which I don’t know where to find). I would have especially loved if they expanded Gouki Zenjou’s past in the anime, since he looked like an interesting character. They also skimmed through Neko’s past…. which I really wish they showed (By showed I mean animated, not in manga/novel form). They only mentioned that she was involved in the Damocles Down years ago and her real name. (Pardon me, I wrote this review some days after watching the series, so I forgot Neko’s real name). They skipped the part where Adolf L. Weissman had to abandon Shiro’s body and return to his original as well. (PM and correct me if I'm wrong, or was it the same body but grown up?)\\n\\n\r\n- Enjoyment 7/10\\n\r\nSince this sequel focused on dialogue a bit, I would say it got a little boring mid-way. But since I don’t drop any anime, I had to keep going. Otherwise K was a great franchise. (It ended decently)\\n\\n\r\n- Overall 6/10\\n\r\nK: Return of Kings was a bit of a let-down from its prequel, for me. I loved the first season mainly due to its mystery, Shiro’s interesting character and K’s artwork and animation. But still, this was a decent original franchise. In my opinion, K is a little underrated for an original series. I wonder if it mostly gets hate because the animation stands out too much (?)\\n\\n\r\nPS. The Slate was destroyed and they all lost their king powers, so I don’t think there would be another season.\\n\\n\r\nWell that’s it for me. Thanks for reading this review.",
            "date": "2015-12-31T02:50:00+00:00",
            "helpful_count": 13,
            "mal_id": 207370,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960422.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/One",
                "username": "One"
            },
            "url": "https://myanimelist.net/reviews.php?id=207370"
        },
        {
            "content": "K is a beautiful anime, the animation quality is top-notch. The soundtrack is wonderful and amazing. The second season does start off fairly slow, despite being a 13 episode anime, but it does get a lot better as it progresses. There's more focus on fights this time around compared to the first season which the main focus was the mystery. The cast is great but is quite large so don't expect too much development. Overall, the concept is interesting and one of the better animes this season. Definitely check it out if you've seen prequel, and if you haven't already, go check it out. Don'tforget to watch the movie which takes place between Return of Kings and the first season.",
            "date": "2015-12-19T21:57:00+00:00",
            "helpful_count": 11,
            "mal_id": 206067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4012749.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shiiiru",
                "username": "Shiiiru"
            },
            "url": "https://myanimelist.net/reviews.php?id=206067"
        },
        {
            "content": "This show isn't o-K (ba dum tsss... okay onto the review....)\r\nI usually don't drop anime when it is boring. Despite how boring it is, I still continue because maybe the hype is still there. This anime is an exception. For the first time in my life, I drop an anime that is so boring. I have only watched until 6 episodes and I cannot watch further. Oh, and the 10th episode came out today. Wew. I don't know if I still can catch up.\r\nI have indeed watch the first K, and my overall thought of it is that the story has so much potential, butit's all wasted because of bland character motivations. Not to mention, almost all of them (if not, all of them) are boring. I am guessing it's because the original only had 13 episodes and they cannot find a way to make character development in limited time (There's a reason why the first Durarara had 24 episodes).\\n\\n\r\nDid I watch the movie? No. After how boring the first one is, I don't bother watching it's movie. The question is, is it a good idea to watch K: Return of Kings without watching the movie?\\n\\n\r\nWell, K: Return of Kings does show a bit of flashbacks, so I can still \"connect the dots\" on what is going on so far.\\n\\n\r\nOkay, onto the review of this season of K. This time, The \"jungle\" (Green) are now goofing around, Red and Blue teams up with the help of \"Silver King\" (I am not going to spoil who Silver King is. Watch Season 1 if you want to know who).\\n\\n\r\nThe problems with season 1 can also be found on this season. The characters again have bland motivations and are downright boring. Though, for the build up of the story, this season is quick in building up the battle between Red and Blue VS. Green. Unlike Season 1, the build up was too slow. The story also has no sense of direction.\\n\\n\r\nThe animation though, is outstanding. This is where K truly shines. Very well choreographed fights and not to mention, the shadings used throughout the anime are very pleasant to look at. The soundtracks are also great especially that ending theme. The ending theme could be one of my top best ending themes this year. For the opening though, it feels meh. I prefer the first season's OP.\\n\\n\r\nI barely enjoyed the anime. I enjoyed it's music and art style, but what truly puts this anime down is it's story and it's characters. I still don't know where the story is going. Lack of character motivation and development especially for the new characters that just entered this season.\\n\\n\r\nWatch it for it's \"pleasant to the eye\" animation, but don't expect a lot from its story.\\n\\n\r\nScore: 5.8/10",
            "date": "2015-12-04T19:51:00+00:00",
            "helpful_count": 11,
            "mal_id": 204809,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204809"
        },
        {
            "content": "My K: Return of Kings review, No Blood, No Bone, No Ash!!!!\r\nRatings: Story: Good 7. \r\nArt: Fair 6. \r\nSound: Good 7.\r\nCharacter: Mediocre 5.\r\nEnjoyment: Good 7.\r\nOverall: Very Good 8.\r\nOk, so I guess it is safe to say that this series has now been put to an end by authors GoRA ( whoever she/he is) and Furuhashi Hedeyuki, and quite frnakly it has been a good sequel, considering all the flare that this anime has. so:\r\nStory (up)\r\nWell, IMO it deserves a \"Good\" score since the plot really did played out well, since the story is about Kings who engages each other like a gang. So, the 1stseason is all about them Reds called HOMRA , whom were portrayed as  bad guys,  here, as the title said..... despite of the wrong grammar (since the one who truly returned is Shiro ) the first king has returned to make things right, because of the chaos being cause by them greens better known as JUNGLE (Welcome to the JUNGLE) , just as the first king returns, he has to set things right by destroying the cause of the kings squabbles in the first place and 'Yes\" it was the slates, and this sequel basically gives this series whether in the anime or the manga (Btw I'm yet to go over with ) a good ending.\\n\\n\r\nArt (up) \\n\\n\r\nOk, so far when it comes to art, IMAO, this anime still has to rely on the fanservice,between Neko and Seri, though, I kinda hate the flashy fashion of Shiro , Anna, Kuro, SCEPTER 4 guys and them JUNGLE big shot, what kept me from givinh this category a lower score was because of Neko and Seri's fanserves and the simplicity of them HOMRA's casual attire. BTW Both Shiro and Kuro look like a couple of pimps and Neko and Seri look like a couple of whores.\\n\\n\r\nSound (up) \\n\\n\r\nThe score was for the background theme being played during the action scene, of cousre I also like the seiyu who did Seri's voice, but for Anna to be voice by Yui Horie was just too unfitting since Yui Horie is already in her 30's to even be voicing Anna, it should have done by Bridcutt, Sarah Emi, since she has that childish voice.\\n\\n\r\nCharacter (up)\\n\\n\r\nSince this is a sequel, it wouldn't be fair to make any additional discussion about them, since they're the same ones from the previous season and the OVA before this was aired, so the ones to be discuss here are them JUNGLE guys, now here's the thing, IMO they're just the quintessential antagonist, and it's nice that only the Grey king and the head Jungle king has to die, and that's that.\\n\\n\r\nEnjoyment (up) \\n\\n\r\nWell, I thought that this is gonna be another good versus bad thingy, but with some fanservice and the sequel having a good plot it was all \"Good to say the least,  especially when we're made to think that somebody from the Blues have turned its coat only for us to discover that it was all the big man's idea, also the ending was nice since it was a happy ending when we see Shirio becoming a grown up Wisemann.\\n\\n\r\nOverall (up)\\n\\n\r\nIt was a very good ending to the sequel, so season 3????? Maybe, but I'm not counting on it, cu'a it may violate as to how things have ended already.\\n\\n\r\nFeliz Navidad, amigos.  \\n\\n",
            "date": "2015-12-26T02:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 206825,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=206825"
        },
        {
            "content": "I waited long for the sequel of K and I'm very disappointed to see how GoRa and the writers themselves messed the second season of my favorite Anime up.\r\nI set high hopes in 'Return of Kings' but I'm angry, somehow, how the story took it's course.\r\nThe show started with a nice flashback but after that - nothing. \r\nI don't want to spoiler because it's unfair for anyone who hasn't seen the second season yet, but in my opinion there would have been many other ways, better ways to let it end.\r\nThe biggest bother for me were the repeating scenes (for example  scenes with Annaor Reisi in it) and the OST's from season one, those aspects, and also the lame animated fight scenes ruined the enjoyment for me.\\n\r\nNot even the beautiful art, drawing style, animation were able to make it better. \\n\r\nMost of the fans who supported K waited for this sequel three years, expected a badass and amazing comeback but it was way too predictable. The first season gave high expectations and it also made a path for a very entertaining second season but the plans and actions in RoK were knitted too easy, not a bit thoughtful, there wasn't a bit of mechanic in it.\\n\r\nIt's just a 7/10 for me because I know that GoRa usually could've make it better.",
            "date": "2015-12-27T12:06:00+00:00",
            "helpful_count": 9,
            "mal_id": 206990,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4209843.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/higekiri",
                "username": "higekiri"
            },
            "url": "https://myanimelist.net/reviews.php?id=206990"
        },
        {
            "content": "This was a great anime. I say that but of course there is still room to improve. Such as an improvement on the storyline so that those who couldn't keep up with it can understand it. But mostly that's down to the reviewers who didn't fully understand the story because after watching it myself it all made sense.\r\nThe main reason i recommend watching it is the artwork and lovable characters. Have you ever wondered what would happen if you turned beautiful anime fan art into a animation? Well the K series is the answer. K return of kings just shows off with its stunning lightingand beautiful supernatural chaos without a harem or douchebag main character to go along.\\n\r\nThe characters are also loveable with Shiro being the funniest, kindest and friendliest MC I can think off of the top of my head. Neko and Kurou are also great characters along with Fushimi and Mikoto. All of them could make you cry or laugh at the drop of a hat.\\n\r\nI extremely recommend this anime even if it has room to improve you will have a great time watching it. I may be an optimistic reviewer but I guarantee you will enjoy this anime and the other ones in the series.\\n\\n\r\n(You should definetely watch the previous series to catch up on the story, both are equally beautiful and you should e fine tell check them out.)",
            "date": "2016-10-17T11:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 231949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5760319.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/4AN0N",
                "username": "4AN0N"
            },
            "url": "https://myanimelist.net/reviews.php?id=231949"
        },
        {
            "content": "Well, this is my first review so I decided to write about the second season of this fantastic anime that is K Project.\r\nTo start, I am going to talk about the story. I think that the way that the story is developed is much better than in the first season, being more complex and introducing us differents new characters. It keeps you waiting for more everytime you end an episode and you are always asking yourself what's going to happen next. About the end of the anime, I feel like they could had finished it in a better way, but they explain everything very welland they close the story succesfully. \\n\\n\r\nTo continue, I need to admit that the art is one of the things that first caught my attention about K. The charachters are beautiful, the backgrounds are incredibles and the fight scenes are amazing. How all the colors mix and suits well, and how the apparence of the characters actually says a lot about them is just fantastic.\\n\\n\r\nThe soundtrack, in the other hand, is awsome too. The music fits so well with the atmosphere of each scene and the seiyuus did an amazing work, especially Jun Fukuyama (Misaki Yata), Mamoru Miyano (Saruhiko Fushimi) and Horie Yui (Anna Kushina), whom also sings the opening theme. \\n\\n\r\nAnd I can't talk about the character's development without mentioning my two favourite characters: Misaki Yata and Saruhiko Fushimi. Everyone who watched the first season knows about their hate relationship and a little bit abour their pasts. But on this season you will see them as you never did before. They change and grown up a lot, and that are the only things I can say without making any spoiler. But if you like this two, you are going to love this season very much. Anna Kushina is other character that had a fantastic development and make you say \"WOW\" at the end. \\n\\n\r\nTo sum up, I think that people are going to enjoy this second season very much (if you enjoyed de first one and the movie, of course), I would say even much than the first one. I already watch it a dozen times and I didn't get bored, speacilly because you always find things that you didn't notice before. \\n\r\nI have a lot of favourite characters in this anime and I'm going to never forget about how this incredible season made me feel.\\n\\n\r\nHope you find this review helpful and sorry for the mistakes (I'm a spanish native speaker).\\n\r\nAbby.",
            "date": "2016-12-12T15:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 235344,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5866391.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AbbyYata",
                "username": "AbbyYata"
            },
            "url": "https://myanimelist.net/reviews.php?id=235344"
        },
        {
            "content": "Despite having few releases overall, GoHands has produced a few successful series, one of which is the K, or K project series. I first discovered K back in 2013 a year after its release, without any expectation of what I was in for. At the time I was already a fan of one of GoHands’ other releases, Seitokai Yakuindomo, but even without watching K, it was clear that the two releases were of completely different genres. \r\nI immediately became a fan upon watching the first season. So when I discovered that not only was there a movie release one year later, but also a sequelseason on the way, I was ecstatic. Because K is an original work, I was a bit anxious for this season and whether or not it would be a good release, but I had good faith that it would follow. That faith was well placed, because K: Return of Kings certainly did meet my expectations and more. \\n\\n\r\nWhile no anime will ever have a 100% hit rate with the community, that K is an amazing series is certainly not a pervasive opinion. Strangely enough it seems opinions are often cleaved, with part the community singing its praises, and part convinced it is beautiful icing masking a mediocre cake. I don’t think the series is as good or bad as either would have you believe, but it’s important to note the objectivity. Everyone forms bias in anything they watch. K is somewhat of a controversial anime to review, so it is important that I had established my bias here. Those who enjoy an anime will tend to overlook objective flaws, while those who do not enjoy a series may be overly critical and jaded. Therefore, I think it is good to keep an open mind while reading or writing reviews. As evidence that my view is somewhat grounded, I will begin by listing the flaws of K. \\n\\n\r\nAny scenes and lines that are forced is conducive to flaws in writing. We have all heard the phrase “Show, don’t tell.” While the meaning changes slightly with context, the phrase still holds heavy weight here. In an anime that is plentiful in exposition, it is crucial to balance and execute lines presented by the characters. One of the biggest issues I had with the series were moments when exposition was flat and overbearing, and other moments when it was lacking. These are common flaws, albeit ones that are difficult to work around at times. Not to be misconceived that exposition is bad; it is important for the viewer to understand what is going on, but exposition must be presented cleverly, which K does not always do. In a similar vein, K has issues with pointless and awkward dialogue. K can be a very posed anime, which is a double edged sword. Cool characters saying cool lines while in cool poses is the name of the game, and while they greatly adds to the identity of the anime, scenes like these were sometimes un-tasteful. Lines like “Your opponent is me!” or “It is my duty.” felt like they were cliches pulled from popular shonen anime, which did not quite fit the classy and cool aura. Iwafune in particular was irritating at times; it felt like he had many more lines than necessary to telegraph that he was a “laid back old man” stock character.\\n\\n\r\nAnother point that must be addressed is pacing. This is more subjective, and may be perceived as a flaw to some, not others. K moves at a relatively slow place. There are many blocks of dialogue, and exchanges between characters may often seem long and unfruitful. The direction is also paced more slowly. Camera shots are wide and slow, intent on giving the viewer time to absorb the visual and audio. For some this may be a deal breaker, resulting in a boring and drawn out experience, especially considering there is a fair amount of action in this anime. The contrast may be jarring, and it seems like nothing progresses during these scenes. My personal opinion is that contrast allows the viewer time to catch his breath, but more importantly time to understand the relationship between characters on screen. I will elaborate on this in the next section.\\n\\n\r\nOne of the biggest complaints I see about the K series is its lack of a coherent story, that pretty animation and a nice soundtrack cannot cover such flaws. I do agree that animation and soundtrack are rarely as important as core elements such as plot or characters, but I do not think this is a justified argument. The opinion that the story is sloppily written is a misconception, and what is most likely causing the cleave in opinion towards this anime. Starting with the basics of storytelling, it is difficult to establish a protagonist in Return of Kings. In the beginning of the first season, the story was clearly centered around Shiro, but the story quickly evolves into something much greater than himself. Return of Kings still lists Shiro as the main, but Shiro is not nearly as pivotal or involved as in the first season. There does not seem to be a clear protagonist here. The way K is written leads to a development of a large percentage of it’s characters instead of focusing on one. This is a difficult line to tread, since having an obvious protagonist is often what anchors viewers in a series so that they may have someone to follow or relate to. This worked in the first season, because Shiro’s crisis was an opportunity for him to lead us into the world of kings as he uncovered the truth to his identity. It was a smooth and ingenious way for us to learn about a world in which history had taken a different route, one in which there existed kings. The first season was just that: an introduction. As we transition into the current season, we already understand the meta of kings and how they function in society. If Shiro’s main purpose as the protagonist of season one was to introduce us to this world, there is no reason in particular for him to be the main focus of the current season. The events that occur caused by the antagonist organization JUNGLE involve all three kings, silver, red, and blue, and their respective groups. You could argue that the kings themselves are the mains in the story, but this isn’t necessarily true either. Yata’s development and impact as a character hold arguably as much weight as Anna, despite him being third in command at HOMRA, and her being the red king. Each character holds his own importance in his role and relationships with others, which is what makes K unique in it’s character presentation. This brings me to the next point.\\n\\n\r\nThe biggest driving factor of K, and the reason why it holds as an objectively good anime despite its unconventional composition, is the underlying core concepts and ideas that the anime explores. Every anime has some level of purpose to it. For the common single protagonist, linear plot presentation, the purpose is to tell the story of a character on an adventure. Understanding the purpose of an anime is crucial to interpret its message. In this case, it is quickly clear that the purpose of K is not to tell the story of a single character. K is about kings. This may seem obvious, as kings are a central focus in the anime, and the title itself, “K,” is a clear allusion to the term “king”. The ultimate purpose is slightly different: To explore the concept of influence and relationships of a king. There are many anime with similar premises of a select few powerful characters that often fight or clash. K takes this idea to the next level by exploring how different people with different ideals implement their given power in order to shape the world in a way they see fit. This is most obviously exemplified in the character foil pair of the red and blue kings. The third king’s ideal was to create a clan that would support each other like a family, built on values such as honor and trust. The fourth king’s ideal, on the other hand, was to use his clan to maintain justice and order in the world, much like a police force. It is inevitable that these two forces would clash often, as their respective priorities are at odds with each other. The result is a world much different from the one we know, a world in which power sets those apart from others. More than conflict between men with supernatural abilities, the theme is one of diplomacy and politics, pressure leading to conflict. The power they possess gives them freedom to change the world and the lives of others, but it also binds them. Towards the end of his life, Suou allowed himself to be captured by Munakata because he was not confident in his ability to keep his powers under control anymore. Suou may no longer live freely. The only way he may relax is when under the supervision of another king. The power of the kings also affects relationships far beyond the kings themselves. The different philosophies of each clan is also reflected in the relationships between clansmen and their king, and between clans as well. Fushimi is a well developed character that greatly contributes to this end. Yata constantly refers to Fushimi as a traitor, and they often fight throughout the series. However, when the cards are on the table, Fushimi does not fail to help his old comrade. Even so he never seeks thanks, and never skips an opportunity to criticize or provoke Yata. The result is a character with unique relationship with HOMRA, in that he always remains faithful, yet feels like he does not belong with them. Another prime example is Kusanagi, second in command of the red clan, and his relationship with Awashima, second in command of the blue clan. In addition to serving conflicting groups, they are clear character foils. Despite all of this, it is heavily implied that their personal relationship is a positive one, and that they have some sort of history together. These are just two of the more clear examples presented in the anime, showing that overall, the conceptual execution of how the power of a king affects the personal and political relationships of those around it was very thorough. This is all further aided by the direction, which in previous mention, allows us time to comprehend dialogue and understand the subtext of every interaction between characters.\\n\\n\r\nNow that I have covered the bulk of my analysis, I will briefly comment on the more superficial aspects; the animation and the musical score. To reiterate what was commonly said about the K series, pretty animation and good music does not a solid anime make. I have already established that I don’t believe the fundamentals underlying the anime are as flawed as some are led to believe. Then I may state how the animation and music ties in as an auxiliary force. K is one of the few anime for which I am completely in love with the animation and music. It is true that K’s animation and music standalone are already noteworthy, but I believe they go above and beyond because they complement the essence of the series and establish aura effectively. The subtle yet vibrant hues and delicate lines work in perfect harmony with the unique piano based soundtrack. This all augments both the characters’ design and acting, which can be summed up in a word: cool. Even after deeper analysis, it is undeniable that K wanted to establish a certain theme of cool male characters with supernatural powers, to which it certainly succeeded. Although it is arguably superficial, establishing aura in an anime can be very difficult, as it requires synchronization between animation and musical style, voice acting, and even plot. For K to have established such a unique and strong aura as an original series was an incredible creative feat, one to which I will certainly not overlook or downplay.\\n\\n\r\nThe K series has garnered opinions black and white throughout the anime community, with some claiming it is the greatest thing to happen to modern anime, and others passing it off as superficial with flawed fundamentals. Although I greatly enjoyed this series, I don’t believe K rests on either end of the spectrum objectively. While it is true that some fundamentals such as dialogue are not as good as they could be, K looks at a common scenario in depth with an original perspective, which ultimately holds great value in the world of anime. I rate this anime highly because I believe it’s contributions outweigh its flaws. \\n\\n\r\nI firmly believe that you do not need a reason to like an anime. Conversely, if you did not like this anime, there is nothing I can do about that, and I have no reason to deny your opinions, but I hope that with this review I can open a new perspective to both those who enjoyed, and did not enjoy the K series.\\n",
            "date": "2016-01-24T20:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 209324,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3827243.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/luciferthesecond",
                "username": "luciferthesecond"
            },
            "url": "https://myanimelist.net/reviews.php?id=209324"
        },
        {
            "content": "The artwork is also amazing. Feels like watching a movie not an animation. I never saw something like this before. The lens setting make it feels like it's not a drawing, it's not anime, it's a movie. Catchy back-sound also make it more live! Like every back-sound is really suit every scene. The coloring itself also \"uncommon\". Feels like the animator give some \"effect\" inside.\r\nTalk about the story, well it's pretty stagnant yet focused in one mater. I love the consistency even though some of the story left curiousness like why there's only 5 kings while it says originally has 7 kings. What happened tothe other kings? Why they don't have any successor and ext that need to be told in my opinion. \\n\\n\r\nI also curios about the death of the green king. Why he can't be alive again while Weismann can be safe after the accident? Will it has the 3rd season or will explained more in an OVA? Who knows.  \\n\\n\r\nIn conclusion I love this anime and recommend you to watch it!",
            "date": "2018-10-21T05:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 292211,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7499784.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sazarits",
                "username": "sazarits"
            },
            "url": "https://myanimelist.net/reviews.php?id=292211"
        },
        {
            "content": "So this season of K does most of the things that the previous season did. I loved the previous season of K. So why didn't I like this season nearly as much??\r\nWell there are 3 reasons:\r\n1) The HUGE addition to Fan-Service. The first season had it and it was enjoyable. it added to the atmosphere and made some moments quite humorous. However, in Return of Kings, you can be in the middle of watching the most intense fight scene ever and suddenly you have breasts jiggling in your face. I'm talk about Dead or Alive Extreme Beach Volleyball level of jiggle physics\r\n2) The animators triedtoo hard. Like, the first season was perfectly fine and I still praise its animation. However, there were lots of moments in this season where things felt disjointed and forced animation-wise.\\n\r\n3) Nothing really happens. Sure you have a major conflict and the opening sequence is a joy to watch, but for a majority of the season, it's just...boring. The end really redeemed it, but still, the show didn't provide as well as it could have.\\n\\n\r\nThat being said, the season was still K. Beautiful style, great music, fun characters, cool concept. It just was not executed nearly as well as with the first season. In my honest opinion, Return of Kings in one word is unnecessary. They really should have just ended the show at the last episode of season one and been done with it. Season two, while still enjoyable to anyone who watched the first season, is a slight let down. However, I still very much enjoy this show and recommend you watch it if you have seen the first season. You have nothing to lose\\n\\n\r\nAnd that's why K: Return of Kings gets an 8/10",
            "date": "2015-12-27T17:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 207026,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4769556.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dalek_of_Skaro",
                "username": "Dalek_of_Skaro"
            },
            "url": "https://myanimelist.net/reviews.php?id=207026"
        },
        {
            "content": "K: Return of Kings or an anime with colorful animation.\r\nThis one is really popular, since it has a decent and at the same time, not your average anime, but this season is still right off the track.\r\nStory and Characters: 5\r\nOk this anime is an Action, Super Power, Supernatural, like Durarara\r\nThe Action is the best thing you can have, it's great for the eyes, but at the same time, it makes me dizzy @_@\r\nSuper Power, well it's just like durarara. I mean the setting was set on the city, with group wars and each individuals on that group does have a power, but unlike durarara whichhas unique powers on each individual, this has portrayed same abilities on each characters.\\n\\n\r\nSupernatural, not sure if this genre is different from super power, well I think it's just applied when the action comes, they've just added an element comparable to lightsabers on the weapons of every individual, and some Kings as their leaders with a floating sign in the sky. \\n\\n\r\nThis anime is a slice of life and mystery on disguise. But the characters are outstanding, even the supporting characters are noticeable. The characters here are not thrown out, they are very well maintained and each of them as unique features even their powers are the same.\\n\\n\r\nAnimation: 10\\n\r\nWell it's the best it got, everything(expression, character design, background, effects) is just perfect when it comes to art, but I think this anime is meant for girls, since the there are more beautiful guys than girls.\\n\\n\r\nExpression is really good, though I think it gives me a yaoi vibe especially to Kuro and Shiro(I'm a guy) but at least there's Neko\\n\\n\r\nCharacter Design is the best, so beautiful, it's an anime full of handsome guys, and Beautigful Girls, sometimes it gives fanservice to both genders.\\n\\n\r\nBackground, This is the Best So Far, Every background is eye catching, I were to be asked, I wanna make the background as my wallpaper. \\n\\n\r\nEffects, it's just great.\\n\\n\r\nSound: 7\\n\r\nThe OP is not good for me, It has great visuals, but the song is not my type. The ED is really good, It has great visuals, and I love the song.\\n\r\nThe Voice Actors, well I just love them, they are really good. The BGM is really good, it's unique and with a rich sound that I feel I'm having a tea time even though it's not my type.\\n\\n\r\nEnjoyment: 5\\n\r\nWell I love it, but there the slow pacing and the the plot is still off the track and some fillers makes the flaws of this anime. Well it's still decent and has a potential. But I think girls will love this one. But as a boy, it feels there's a yaoi feeling, but at least, it's not like that. \\n\r\nWell This one is recommended anime for this season, at least its pretty decent with a notable art.",
            "date": "2015-10-25T01:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 201917,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4762431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/VanAlex",
                "username": "VanAlex"
            },
            "url": "https://myanimelist.net/reviews.php?id=201917"
        }
    ],
    [
        {
            "content": "first things first, if you don't want to read the rest of this review, and if you thought S1 had an awful plot, I suggest you give S2 another shot because I really found it a ton better than before. In every aspect.\r\nA rare gem- even more surprising considering how awful season one of K was. I'll be the first to admit that I didn't enjoy the first season one one whit despite the brilliant animation because of how awfully vague the storyline was. I went into S2 expecting something similar, and despite being lured in yet again by the animation quality, I was fullyprepared to drop the series midway through, and pleasantly surprised to find myself sticking it out to the end- and enjoying it, even. \\n\\n\r\nfirst, to state the obvious, the animation was superb- a lot of k's budget goes toward it, I think, so naturally it was top-notch. The art has always been awfully, almost trademark-pretty as well. I'm minorly ashamed to note that I can't remember if the bgm is identical to that of s1 (which shows how little an impression it had on me...) but anyways here it was used superbly and had a major effect on me. A++.\\n\\n\r\n(spoilers ahead)\\n\\n\r\nthe thing that put a lot of people off after the first season (myself included) was the sloppy plot- there were plot holes the size of texas and a lot of things went unexplained. At the end of S1 all I was still ????. In this season while some of those loopholes still exist (we still know next to nothing about adolf's past, for example), major ones have been patched up and they explain things A LOT MORE making it possible to easily follow the story's core plotline. We've got character development from a lot of characters from s1- Munekata, his lieutenant, Anna- and especially lovely to see was the development in Yata and Fushim's friendship. While the villains remained mostly predictable and cliche, it was still heartwarming to see their relations with each other (which parallel Shiro's little family unit somewhat), revel in their tragic backstories, and (spoiler!) Nagare's revelation at the very end tied everything up very neatly, leaving no doubt as to what the story's underlying message was. While Munekata being spared death and Shiro's return to his original body was somewhat anticlimatic, I'm kind of a sucker for happy endings and am pleased that generally all's well that ends well!\\n\\n\r\nI don't think there will be a season 3 of k considering the events of this season which kind of eradicates.. the premise.. of the whole show (now that's a bomb I'm refusing to drop; you'll have to watch to find out for yourself), but season 2 really redeemed the entire K franchise from the train wreck of S1 (I didn't watch the movie) in my opinion, and I really do believe this makes K the dark horse that emerged one of the winners of the season, and wholeheartedly recommend it.",
            "date": "2015-12-26T06:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 206845,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2524999.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mrtaxi",
                "username": "mrtaxi"
            },
            "url": "https://myanimelist.net/reviews.php?id=206845"
        },
        {
            "content": "Personally, I really enjoyed this series. Here are the following reasons why.\r\nFirst, the second season of this series enlightens on the backstory and for so long of a mysterious plot that seemed to not be all that visible in the first season. The second season especially shows that the first season was never meant to be a standalone.\r\nSecond, with each passing episode, most especially during the events of episode 5, in the second season more clarity to the events that transpired over in the first season is shined upon and made me appreciate the first season even more because with that new information unveiled, Iam able to make more sense of the plot and mystery that once overshadowed the entire series.\\n\\n\r\nThird, that \"shadowyness\" (made up word :P) and mysterious plot and motivation was a driving force for me to continue watching the series and sate my curiosity in reaching the climatic ending.\\n\\n\r\nIn my conclusion, the SOUNDTRACK WAS AMAZING! In all seriousness, give the series a chance. Even if the story may seem vague and the characters somewhat flat, the soundtrack is just perfect mesmerizing music to your ears. :D",
            "date": "2018-03-30T21:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 275835,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4523813.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeTiger07",
                "username": "AnimeTiger07"
            },
            "url": "https://myanimelist.net/reviews.php?id=275835"
        },
        {
            "content": "Absolutely amazing. The plot is superb. For new comers, this anime might be a little bit confusing considering there's a lot of clans and characters. If you feel like dropping this anime, I suggest you to push yourself through. If you do, you miss out a really good anime. Once you grasp the concept and the world of K, everything comes easily to you. \r\nPlot: 10/10\r\nAmazing. I've watched tones of anime and K's plot is definitely not a let down. It is built nicely and the plot expands as the story progresses. \r\nCharacterization: \r\nI'm not sure why but I definitely love the main character, IsanaYoshiro. He's not overly powerful and likeable and he has flaws which makes his character more realistic to a certain degree. Though I find myself not favouring the girls in this series except for Anna. However, I do feel that the Kings are overly powered, making their clansmen look extremely weak. But I guess that's how a king should be?\\n\\n\r\nOverall, I enjoy watching this anime and I recommend others to give this anime a try too! So, which team am I? It's a tough call but I would serve for Silver King.",
            "date": "2017-11-09T04:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 262854,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5567684.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kurosmile",
                "username": "kurosmile"
            },
            "url": "https://myanimelist.net/reviews.php?id=262854"
        },
        {
            "content": "I just finished watching it, and for me I think the story was summed up pretty well in the finale. Definitely have to watch the Missing Kings movie to fully appreciate it. I suppose one could say it was a little predictable--obviously the good guys win, the bad guys lose, and mostly everyone goes away pretty happily. But even still, I don't really mind that. How else would it end? With everyone getting powers and destroying the world like JUNGLE wanted?\r\nThe story wasn't all that unique for an anime from the beginning, but I don't understand some people's complaints about \"plot holes\". If you paidattention in the first season and in the film, and especially if you read some of the side stories and other manga (e.g. I read K: Black and White right before watching Missing Kings and it was nice to understand who Yukari was right away so he didn't seem like a random, out-of-the-blue bad guy or a plot convenience) most of the questions are already explained\\n\\n\r\nObviously, the artwork is beautiful. I do have to echo the complains of some others about reused animation, but I don't think it happens enough for me to dock it too severely. Yes, I'm one of those shallow people who watched the series 80% because of the bishounen. Some people complain about the unnecessary fan-service from Neko and Seri, but whatever; I was distracted by Kuroh's beautiful, long hair the whole time anyway...\\n\\n\r\nI did like and care about almost all of the characters, and I think the character development was fleshed-out pretty well. I actually liked that Anna became a more important person in Missing Kings and this second season. I also really liked Fushimi--he was honestly one of my favorites from the beginning anyway, and I like how in this season there's more depth to his character\\n\\n\r\nI understand that Neko is a prominent character, but even still she's just way too annoying for me to like. Honestly, I wouldn't mind if she weren't there at all and it were just Shiro and Kuroh; or better yet if Neko was in her cat form all the time, because at least that way her behaviors would make more sense and seem less annoying\\n\\n\r\nPersonally, I was really satisfied by Adolf/Shiro being alive and in his real body in the end, and also no longer being immortal--which is nice because it means he'll age along with his friends and doesn't have to worry about his second best friend growing old and dying long before he does again\\n\\n\r\nOn that note, I was also really happy with the relationship development in that department throughout the series: for it to go from Kuroh trying to kill Shiro in the first episode, to risking their lives to save each other on several occasions later on, to finally living together happily ever after with Weismann as the schoolteacher and Kuroh as the househusband and Neko as the loving housecat...\\n\\n\r\nSo that last part was probably not helpful. Anyway:\\n\r\nStory: 7\\n\r\nArt: 10\\n\r\nSound: 8 (honestly, I was hardly paying attention to the music)\\n\r\nCharacter: 9 (docked for Neko not always being a cat...)\\n\r\nEnjoyment: 10 (...because the handsome cast makes up for it)\\n\r\nOverall: 8.8",
            "date": "2016-11-18T22:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 233988,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5847159.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WinterVine",
                "username": "WinterVine"
            },
            "url": "https://myanimelist.net/reviews.php?id=233988"
        },
        {
            "content": "Basically for me this anime does not make the cut. While some may be anima/tv veterans and on top of their viewership for the best of the best I am very much behind and therefore I have little time for an anime that fails to get to the point its trying to make.\r\nStory: What story?\r\nCharacters: Main issue for me is that I don't care about any of them, their goals, their demons, ANYTHING. I don't feel any real connection to these characters whatsoever or what they are trying to achieve. Furthermore calling them 'kings' is a gross overstatement. This is basically about a good ofteenagers/young adult men who have been randomly given these powers and decide to use them however they wish. Only the Blue King and Gold King really have that authority/clout which you would expect a 'king' to have\\n\\n\r\nArt: Very nice and when they fight the colour flames and the kicking, it looks pretty cool. The fact that each clan has their own fighting style is great.\\n\\n\r\nSound: Not the best soundtrack, nothing memorable. So the music sounds way too similar to the first season in my opinion which gives the impression of a story which has not really progressed or changed in tone.\\n\\n\r\nEnjoyment: Find myself bored for long periods of time. \\n\\n\r\nOverall: In conclusion this anime from the basis of its story should be WAY more exciting and WAY more interesting than it actually is. When you read what its about and then actually what it its shocking how such an interesting premise is not really that interesting. I know I have not watched all the released episodes but its 3 ep limit for me, fail to engage me and I am out of here!\\n\\n\r\nHOW IS THIS ANIME SO BORING?! That's what I want to know",
            "date": "2015-11-17T08:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 203571,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jasmine555544",
                "username": "jasmine555544"
            },
            "url": "https://myanimelist.net/reviews.php?id=203571"
        },
        {
            "content": "Well I am very late in case of watching anime and it would be very rare if someone would actually saw it\r\nI am not going to explain story since there are other reviews for that(there are reviews for other things too but I am sharing my opinion)\r\nMay contain a spoiler or two \r\nLet's start!\r\n1:Story\r\nStory was pretty good and was enjoyable,learning that Colorless King wasn't alone was quiet the fun too,Anna being in fights,Shiro being not clueless,the three Kings alliance all was good\r\n9/10\r\n2:Art and Animation\r\nIf you talk about the art and animation,both were good in terms of resolution and attractiveness,but the studio used same scenes overand over again,from season one as well as season two\\n\r\nI didn't like their laziness at all,like use some new stuff!if you are spending Mooney on something then at least make it look like you put an effort and was not lazy or stingy\\n\r\n7/10\\n\r\n3:Sound and Voice\\n\r\nAgain same case as art and animation,sound acting was fair but the fact that it didn't sync on some occasions,like Shiro saying something and his lips aren't moving,Anna doing something but her action doesn't resemble her words,Neko showing another emotion in speaking while showing off something else\\n\r\nvery poor in my opinion,now a days,almost every 2 out of 5 anime is doing this sync thing which isn't great at all\\n\r\n6/10\\n\r\n4:Character\\n\r\nSince there weren't many new characters so they didn't had to put much effort,still Nagare's and Iwa-san's character wasn't explained very well,at least Nagare's character needed something more cause I understand that due to the spoiler they couldn't explain Iwa-san\\n\r\n9/10\\n\r\n5:Enjoyment\\n\r\nI enjoyed K season one and season two but there is less action and more strategy,there isn't much action involved as compare to season one and movie.Though the fighting wasn't as dope as season one,it was fair\\n\r\n9/10\\n\r\n6:Others\\n\r\nAlthough season one was pretty good,the studio tried harder to destroy its image in season two\\n\r\nThere were times when i was like\"WTF is going on?\"as well as enjoyment.At some point,the anime gets so boring that you want to drop it,but last episode covered it all\\n\r\nIt still doesn't explain the body switch,since Shiro was shown almost same in past,but didn't resembled(to me,you may not find any difference or agree with me)anything from last scene's Shiro\\n\r\nAlso Sukuna was crying,he didn't shed a single tear,and more than that,he moved on quicker than the speed of sound,hardly five seconds of sadness?Spoilers shouldn't be like that!\\n\r\n7:Overall\\n\r\nI think the anime as a whole isn't so bad but some scenes or dialogues affected it\\n\r\nIt at least deserves an 8 but I give it a 9\\n\r\n(To anyone who decided to waste his time on my review,thank you so much)",
            "date": "2017-08-11T11:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 255201,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6350682.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RealOnii-Chan",
                "username": "RealOnii-Chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=255201"
        },
        {
            "content": "I am writing this review under the assumption that you have already watched the 1st season of the show, as well as the movie bridging the 2 seasons. There will be some spoilers but I'll have a notation when that will be so you can skip to the next paragraph. \r\nProject K caught my attention a while back and coming out of the 1st season I was definitely interested and excited for the series continuation and how it would build upon the various elements it introduced. Does this 2nd (and from the looks of it Last) season of the show, satisfy the viewer with itsconclusion ? \\n\r\nTL;DR : Kinda.  But here is a breakdown as to why. \\n\\n\\n\r\nStory 5/10\\n\\n\r\nThis season kicks off after the events of the movie Missing Kings. The pivotal event in this season is the emergence of the Green Clan that now that the Gold King is nowhere to be seen, is free to start making their move. The Green Clan's activities seem to cause an uproar among the other Clans and they sport some pretty powerful members in order to carry out their master Plan. Once all the Kings are made aware of that, the \"clan war\" is set in motion.While the story was interesting in concept and rather ambitious, it's really lacking when it comes to execution, there are extensive scenes where we are basically info-dumped and while they are sparse, it can be quite annoying. After the first 7-8 episodes events seem to be kinda random and nonsensical due to the poor use of foreshadowing, but more so due to the absence of any foreshadowing. It seems that the show had problems managing how much information it needed to give and most importantly in what way it needed to convey it. While the story is somewhat decent and interesting in concept, the lack of proper pacing and structure greatly diminish its coherency. \\n\r\n[SPOILERS} \\n\\n\r\nThe final episodes in particular lack any sort of payoff, there's conflicts and face-offs that have a lot of build up behind them (e.g. Kuro VS Fujakuji Yukari , Shiro VS the Green Clan) but at the final showdown, they end up feeling flat and somewhat unsatisfying given the amount of hype they received. Another problem with the final episode is that it feels underwhelming when it should have been exciting, bombastic and gratifying, yet it's just somewhat decent. The last scene where Weissman is shown alive and well while crowd-pleasing , feels like a total ass-pull which is very disappointing, because they could have easily fixed it, if only they dedicated 5 minutes in some previous episode, presenting us the hints on how it may be possible. Seeing as this may be the final episode of K altogether, it's a rather mediocre ending.\\n\\n\\n\r\nCharacters 5/10\\n\\n\r\nThe show already featured a rather large cast which has grown even larger with the introduction of the Green Clan and some others. The characters much like the 1st season, have interesting chemistry and interactions are fun to watch. However while well defined with distinct personalities and their own shade of flavour, they many times feel archetypal and lack depth and/or development in most cases. Development is not always necessary and in the characters it does occur it is quite satisfying, however it seems that no character is given BOTH depth and development, making some characters seem really shallow and oftentimes annoying (will give examples in the spoilers section). I definitely think the show would have been better if more character development took place since now characters don't really feel like they've grown. (with a few exceptions) \\n\\n\r\nAnother thing that I should mention is that some characters seem to get the shaft, being reduced to archetypal cute-girls or bishounen. Fan service seems to get progressively tasteless as the show goes on, especially with the characters of Awashima, Neko and Kukuri being the most afflicted, male characters also receive a similar treatment but to a lesser extent. \\n\\n\r\n[SPOILERS]\\n\\n\r\nOne character that is explored further but lacks deveopment is Yata, the main issue however is that he is reduced to the \"angry guy stereotype\" remaining almost perpetually angry even when situations don't warrant it, there were many instances where I felt he was being a noisy dog, making him feel very monodiamensional. Fushimi on the other hand is the only character I felt went through meaningful character arcs and had some semblance of development. These two characters are like the extremes of the bad-good continuum in the show, everyone else falls somewhere in between.\\n\\n\\n\r\nArt & Animation 7 / 10 \\n\\n\r\nK has always looked gorgeous, the stunning visual, lighting and color effects of the 1st season and the movie are present in the 2nd season. The action scenes have fluid animation and the really well-done, sustained , perspective shots of the 1st season, make a triumphant return. Backgrounds are very detailed and vibrant, with vivid coloration and lighting. However a big problem is that nearing the final 4-5 episodes, the quality starts being a bit inconsistent, with 2 or 3 instances of crappy CGI and the character animations looking stiff and rigid. which is why this season gets a lower rating than it's prequels.\\n\\n\r\nSound 8/10 \\n\\n\r\nThe soundtrack of K:Return of Kings is amazing, featuring many character themes from the previous seasons as well as some new tracks. Be it for a character, a battle scene or to accompany emotions, the soundtrack of K:Return of Kings delivers what you would come to expect from the franchise, even if a large chunk is tracks from the previous installments. \\n\r\nVoice acting is on the same level as last time, pretty good, with the exception of some characters that were flat-out annoying to listen to.\\n\\n\r\nEnjoyment 6/10\\n\\n\r\nWhile K:Return of Kings looks and sounds gorgeous, its' characters are likable and multiple, even though most of them lack any depth and/or development their personalities are well defined and their interactions are enjoyable. However the story clearly required a greater degree of dexterity in its' exectution and the ending should have been explosive and gratifying, instead of underwhelming and \"okay\". Combine it with the aforementioned average character cast and tasteless fanservice cranked up and your enjoyment is diminished quite a bit, at least that was the case for me.\\n\r\nAt least the show maintained the quality of its prequels (with a few exceptions) \\n\\n\r\nOverall 6/10\\n\\n\\n",
            "date": "2016-01-05T11:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 207818,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736349.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yagyuu_Mugen",
                "username": "Yagyuu_Mugen"
            },
            "url": "https://myanimelist.net/reviews.php?id=207818"
        },
        {
            "content": "K: Return of Kings should really be called \"K: you can now finally watch this.\" What began as a brilliantly animated but horrifically puzzling work back in 2012 has now developed into a reasonably understandable and finally contiguous storyline. As a bonus, the show has outstanding production values with awe-inspiring, artistic graphics and a clean yet themed audio experience to match. It's hard to really classify K as there aren't a lot of other shows that I've watched like it. It has a wide range of characters that would probably satisfy both male and female viewers. The actual story is a fantasy, magic-based alternative tocurrent day Japan, with lots of high-budget action and a few dramatic moments.\\n\\n\r\nImagine an alternate world where several individuals have amazing super powers, be it immortality or control over fire. These Kings share their power with other individuals, known as clansmen. Through a delicate balance, they somehow bring prosperity to Japan. Now not all the Kings are happy with the status quo and some are instigating a coup so to speak. The story is told through multiple characters though mostly through members of the blue, red, and silver (or white depending on the source) clans. This season picks up directly after the events of the movie K: Missing Kings where we see the rise of the new red King. There is still no sign of the silver King Shiro and his clansmen, as well as those of the red and blue clans, are desperately holding back an onslaught from the green clan, who are bent on changing the world order forever. Given the turbulent past between the clans, will anyone be able to counter the seemingly endless tide of the green Jungle?\\n\\n\r\nAnimation:\\n\r\nBack when K was released in 2012, there really wasn't any challenge to the animation quality expect perhaps UfoTable. This is true today as well as the gap in animation quality between K and other ordinary shows remains vast. Expect gorgeous panoramic detailing in a multitude of different sceneries. The show has superb lighting and effects; sharp reflections literally move as the camera pans. There is also extensive and playful use of colored filters and lighting, which gives the show an especially unique feel. Other than some occasional CGI usage, this is literally the epitome of what we can expect today from a non-movie work. The cast of K is very large, and it only grows larger in this season. However, all the clans other than the Silver clan have a uniform and/or assigned color and thus the only possible confusion is between members of the same clan; and really a lot of the supporting members of the red and blue clan don't matter- as long as you get the #2 and #3 from each clan down you're good to go. The superb animation doesn't stop with the scenery as characters have a great deal of detail all the way from the styling on their outfits to the playful smirk on Reishi's face when he draws his sword.\\n\\n\r\nExpect excellent choreography throughout a multitude of adrenaline-filled battles with both magical and melee elements. Effects are sublime here, probably epitomized by the shiny clashes of fierce blades. There is a bit of blood and not all characters will make it through the season though the show spares the viewer from some of the more violent wounds. Rarely will you see such variety and innovation in attacks and abilities in a single show. There is a bit of ecchi as well ranging from very obvious panty shots to a lot of bouncing on the part of Seri. Neko gets plenty of innocent cat-like behavior as well- not really ecchi but enjoyable in its own way.\\n\\n\r\nSound:\\n\r\nYui Horie gets the honor of starting the show with a playful, brass-heavy piece, which also happens to have a pretty nice, if slightly dark melody. The show ends with a guy song with a cool vibe but mediocre main melody. The superb BGM of the original show is further refined here. Many of the new tracks build meaningfully on top of melodies of the original show. The BGM is composed of a lot of different instruments but works to create a uniform, clean and modern sound. Some tracks make use of piano and stringed instruments while others are just trendy, with extensive use of percussion and electronic instrumentation.\\n\\n\r\nOne of the reasons I originally picked up K was the high-powered sound cast, and it only grew stronger this season! First and foremost, Mikako Komatsu has had a lot of great roles since the original K, but I firmly believe that Neko is by far her best role- suggestive yet playful, occasionally strong yet fragile; her character here has it all. In addition to the ridiculous combined male talent pool of Daisuke Ono, Tomokazu Sugita, Mamoru Miyano, and Jun Fukuyama, you even get Houchuu Ootsuka, instantly recognizable as Jiraiya from Naruto. Miyuki Sawashiro gets an expanded role in this last installment, as does Yui Horie as 11-12-year-old Anna. In addition, surprisingly, we get Rie Kugimiya playing a guy, definitely a side we haven't heard too much of. Wow, what a list... and with a story that actually makes sense the characters finally come alive and give merit to the powerful cast.\\n\\n\r\nStory:\\n\r\nThe main pain point of the original K was the confusing nature of the story, where much of the setting was left unexplained. Though I still don't get how the kings system brings prosperity to the nation, a great deal of the other open questions is finally resolved in this series. It explains the horrific Damocles down that left a crater in Japan, Neko's true origins, and the history behind the Kings system among other things. What makes this installment particularly pleasant is that this is all explained organically while continuing down the central, linear plotline.\\n\\n\r\nThe show can be broken into two main arcs, which would require a spoiler tag to fully explain here. In any case, each arc is executed with great care and precision; it took what went well in the K movie and applied the same treatment to the arcs. The show is full of interesting twists and alliances- in a normal show you have usually two or three sides, this show has many more clans and yet keeps everything tidy and manageable. Though some of the final battles felt a bit anticlimactic, the overall pacing was very good. The final resolution is a bit rushed, and a fair amount of conclusion is told through images in the closing credits. Regardless, it does have a feeling of completion, which is particularly welcome after watching numerous open-ended shows this season.\\n\\n\r\nCharacter:\\n\r\nWhile this show won't win any awards for depth of character, you do get a bit more of a feel for some of the characters. My review for the original show mentioned how a lot of supporting characters felt underutilized despite being fairly developed, this season made full use of those characters; you'll see plenty of Anna as well as various supporting blue and red clan members. This season also introduces a handful of important clansmen of the green clan, which serve as the antagonist for the season.\\n\\n\r\nGiven the huge cast and complicated nature of the whole story, there isn't a lot of time left for character development; all characters are essentially static characters. Though we learn some interesting tidbits about characters, such as Neko, there isn't a whole lot to laud about in this category. If there is a positive, it's that the story doesn't center on the silver king Shiro, which was one of my largest gripes around the original show. In summary, expect many passable and entertaining static characters.\\n\\n\r\nValue:\\n\r\nK is a beautifully drawn show with good overall production values. K Return of Kings successfully brings the franchise back to an understandable level while executing an engaging and action-packed plot. The characters aren't the strongest but it's forgivable given the sheer scale of the story and brilliant animation. If you haven't given up on K yet, here's your prize for sticking with it.",
            "date": "2016-04-08T20:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 215894,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=215894"
        },
        {
            "content": "We return to modern Japan, where \"Kings\" with superpowers reign over clans that are constantly at war with each other. While season 1 focused on the Colorless King and White King, this season focuses on the Green King and his clan known as \"JUNGLE.\" The Green King, Hisui Nagare, seems to be plotting an act of utter chaos, and now it is the job of the new Red King, the Blue King and White King to stop him.\r\nK Season 1 caught my eye for a number of reasons, the most compelling of which being its beautiful visual and auditory aspects. K has a lovely colorscheme, rich with blues and reds and purples and greens. And its soundtrack has an ambient, smooth feeling that often contradicts the nature of scenes in the show. That's why, despite the shortcomings of season 1, I still gave it a 6/10.\\n\\n\r\nHowever, season 1 had its flaws. And season 2 suffers from the same flaws as the first season, but it adds some more to the list. Like season 1, season 2 is still severely lacking in character development and backstory. We have no idea who any of these characters are or anything about them (other than the fact that they're hot), we don't know how the kings' powers originated, and we have no idea what each king can do with his or her powers. The female characters are useless as before, only present as objects of fanservice.\\n\\n\r\nI say this pretty often in my reviews, that what matters most to me in a series are the characters. Characters can make an anime enjoyable even without a coherent plot, which is why I'm such a huge fan of so many slice of life shows. So in the absence of well fleshed-out, developed characters, the plot had better be AMAZING. A good example is Code Geass, and it was quite successful. Even Death Note could fit into that category. While some of K's characters are interesting or endearing, none of them are developed, aside from possibly Fushimi and Yata, the only characters in the series who are shown with legitimate inner turmoil. K's beautiful art, color palette and OST make up somewhat for the lack of good characters and plot, but not entirely. The plot is all over the place in this season, but unlike last season, this storyline just doesn't hold as much urgency.\\n\\n\r\nLast season we saw how dangerous the Colorless King was; we experienced the despair Shiro felt as he tried to figure out who he was. But this season, we have....the Slates. What are they? What do they do? Why are they important? And if they're so important, why were they never mentioned in season 1? Most of these questions get answered eventually, but only towards the very end of the series, after a good nine or so episodes of mindless filler and drama. And the ending of the series itself feels kind of anticlimactic, as if the previous nine episodes had nothing to do with the series' resolution and said resolution was cheap.\\n\\n\r\nThere are, however, two small things I appreciate about K: Return of Kings. The first is much-needed reconciliation between Fushimi and Yata; it feels realistic and touching, and leaves a positive feeling for viewers. And the second is an ending that definitively ends the K series, leaving room for MAYBE a short OVA about the characters but definitely not another season. Despite the fact that the Slates weren't mentioned at all in season 1, their destruction does wrap up the series and provide no believable path for a sequel. Which is a good thing, because even this season kind of felt like it was beating a dead horse.\\n\\n\r\nWhile K: Return of Kings had a couple redeeming qualities, the negatives of this series far outweigh the positives. I enjoyed a couple moments (especially the reconciliation), but the majority of my viewing experience was composed of \"what are the slates\" and \"fanservice why\". I only really watched for Fushimi, and even still, I considered dropping the anime. Overall, it falls far short of its predecessors (both season 1 and the movie), and the questions season 1 failed to answer remained unanswered in season 2.\\n\\n\r\nFinal score: 4/10 \\n\r\nDo I recommend it? If you don't care too much, NO. If you care a little, still no. If you're dying for closure, maybe.",
            "date": "2016-01-01T19:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 207498,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969759.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/psychoalchemist",
                "username": "psychoalchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=207498"
        },
        {
            "content": "At this point, i'm watching the 8th episode. Good art, good sound... But if you enjoyed the scenario, please, don't watch this season.\r\nIn few points, here is why :\r\n1) The anime turned into a 13 year old shounen, like naruto, bleach, one piece, and other 700 episodes anime. Every battle are very emergency, but they turn into a \"speack 2min with my opponent whatever\". Sometime you just want to hit the characters and say \"Hello, little boy, that's time to battle now\" Well, a young boy shonen.\r\n2) The scenarist abuse. \r\nImaginary exemple : \r\na) One time a character will be able to resist over morethan 30 RPG rocket, (cause he is so powerful, you know) but, 4 episodes latter, he can't do anything about a single revolver bullet.\\n\r\nb) Three overpowered character can't do anything about one medium powered enemy. Deal with it. (I guess this enemy eat scenarium at lunch)\\n\r\nc) An enemy can flee from the most ultra secured place in the world (By many kings and also the government) with an helicopter, well, no rocket launcher, no fighter jet, nothing against it. Why not.\\n\r\n- You just rage all the time cause of non-sense or just stupid twist. The anime say something, then he do the opposite.\\n\\n\r\n3) All the useless characters : Every-time, EVERY-TIME there is a big fight (Even in the 1rst season, that's true) there are more than 30 secondary character, and they are useless, cause even all together they can't do anything against a principal character. So they just fight between them, killing another useless secondary character, no one care about... They are only here to show how mighty a principal character is, but why ? Why are they here if they can't do anything in first place ? \\n\\n\r\nWell, I just can't deal with nobrain anime anymore. \\n\r\nThe first season deserved a 5/10, this one got a 2/10 cause she goes worst.",
            "date": "2016-11-07T18:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 233411,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5820646.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sheyne",
                "username": "Sheyne"
            },
            "url": "https://myanimelist.net/reviews.php?id=233411"
        },
        {
            "content": "I personally don't like this anime,\r\nThe 1st season and all of the hype for this anime is just making this worse, especially with the lack of plot twist from the 1st season and a lot of flashback just to keep us waiting.\r\nThe 1st season is special for me with all of their mystery and plot twist and the fact that it all works well, the 2nd season is just not that special.\r\nIf you watch K movie that was meant to confirm the existence of season 2 than you probably gonna be disappointed with the lack of dept and mystery exist within the new story.\r\nOverall... Ithink they can do way better than this \\n\\n",
            "date": "2016-10-20T17:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 232204,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/alvi_syahri",
                "username": "alvi_syahri"
            },
            "url": "https://myanimelist.net/reviews.php?id=232204"
        },
        {
            "content": "I was so hoping that I could grant this anime high marks. Sadly, though, it just didn't catch my interest. I didn't dislike much about the K franchise, but I also didn't find anything all that special. \r\nThe actual premise of this season was interesting, but the middle of the season would've been a better place to end it, in my opinion. The last five episodes or so were lacking excitement. I did still enjoy the characters I enjoyed in the first season of K, but there wasn't much more character development for any of them, so I bored of them quickly. \r\nI did findthe first season to be more intriguing than this one, as well, which is sort of the opposite of how I'd like it to be. One thing I can say that improved with this season was the music. It wasn't a huge improvement, but it wasn't as off putting as the previous two installments of K. \\n\\n\r\nAll in all, this season and this anime in general were average to me. I wish I could give a recommendation to tell you if you should or shouldn't watch it, but honestly, I think it may just be personal taste, so you'll have to give it a shot and find out for yourself.",
            "date": "2018-07-08T20:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 283466,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=283466"
        },
        {
            "content": "The first part benefited, i believe, from having only 13 episodes. This sequel suffered from it. Not in the sense that it was rushed, but in the one that they had too much time. (i gave the first season a 9 btw) Over the course of the review, i try to contrast what made the first season great and this season suck, and to anyone who hasn't watched it, i definitely recommend the first. The second maybe only for completion's sake.\r\nTo use the cliched phrase, as much as i hate it, the original K 'showed' and didn't tell. Much of the enjoyment i derived fromit was from its reluctance to just hand me everything on a plate and have me try to read into what was being shown. While the sequel tries to do the same at times, most others, it just punches you in the face with what it wants to say. The most infuriating part? More often than not, it doesn't have anything to say. Atleast nothing we haven't heard already a thousand times (without going into details, its the same old crap about the strength of humans, and the belief that they can do the right thing...sigh, it basically became a shonen in the end, with all the bullshit ' i believe' and 'i dont need anyone other than friends' being thrown around)\\n\r\nIt also doesn't help that the female characters are little more than a broken record that can repeat just the single line (especially the insufferable cat, i really hated her this time even more). Like seriously, while i didn't particularly mind the excessive fanservice at times, they are even lesser than 1-dimensional characters in terms of traits. This issue unfortunately spreads over to other characters that were quite good in terms of personality from the first season. Here, they just practically repeat the same lines over and over (looking at you Anna). If all the extra time was instead focused on characters like the blue king and...well only him i guess, it could have made things more interesting. After some thought, there are at most one or two who are interesting apart from him. Not exactly great for a show that has so many characters is it? But i guess you cant blame the show though. I feel like all that could have been explored in terms of character was done in the first season itself. So, this time they had to focus on more of the same (case in point: the red clan) or try to introduce a stupid conflict that was a nonentity anyways (the blue clan). Hence, why i feel they had too much time.\\n\r\nNow on the matter of plot. Its simplistic to say the least. Not that the first season was anything great in terms of complexity. But it wove multiple threads, revenge, coming to terms with past mistakes, trying to help a friend, all trite plot lines to be sure, but the execution was great. Also while the powers involved in the story themselves are grand, the plot felt grounded in more human emotions. This season it tries to be something more. But just fails epically at it, probably the only thing that was truly grand about it in the end anyway. That's about it without going into spoilers.\\n\\n\r\nTo go over the rest of the elements in brief. Animation is good. Sometimes too good. Enough so that a lot of times you can easily make out that they are reusing clips. And they reuse clips. A lot. And i mean a lot. Get it? A lot. Yeah, its that bad, that many 'lots'.\\n\r\nArt was good too. Really good designs and art choices. Not the colors though. It just felt strange sometimes.\\n\r\nMusic kind of changed styles as well, became more dancy, helped the fights seem more like dances, which i think was what the directors were going for so it helped i guess. No particular standout songs though. \\n\\n\r\nOverall, a disappointment. While i had some fun, i would have much rather spent the time on some other series. If you're a fan of the first and can't help but have more, go ahead, maybe you'll feel differently. If you're reading this without ever having seen K for some reason, go right ahead and watch the first. The first. And maybe forget the second exists before its too late.\\n\\n\r\n(Whew, that was long i think. thanks for reading. maybe i should keep a tl;dr version...)",
            "date": "2018-07-06T14:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 283144,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2797133.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/alexsilener",
                "username": "alexsilener"
            },
            "url": "https://myanimelist.net/reviews.php?id=283144"
        },
        {
            "content": "It's hard to determine exactly how I feel about the second season of K. Right from the go the second season has a completely different atmosphere than the first -- removing what made it special. \r\nThe first season was almost more about the mystery than anything else. The presentation, atmosphere and direction all felt unique, albeit off-putting at times. It was a clever blend of randomness and showmanship that kept the audience engaged.\r\nWhich is precisely why the direction the second season takes doesn't come as a total surprise. Instead of being cleverly unique, from the beginning the second season is a completely over-produced, hyper-stylized train-wreck.\\n\\n\r\nThe amazing sound design (/soundtrack) come back strong, but don't seem to match the atmosphere of the series at all. While I still adore the added music in-of itself, it simply feels like a jumbled mess that doesn't blend together well.\\n\\n\r\nThe story also loses what makes it special. The mysterious MC from the first season now accomplishes nearly nothing, and even when he finally attempts to, it feels completely unsatisfying. And all the side characters that had been justly treated in the first season, with their own sub-plots presented compellingly, are just kind of there this time around. Nothing much happens with them, and the story is pretty much just focused on its linear narrative.\\n\\n\r\nThis is only made even more abundantly clear with the reduction of all the female cast (of any significance) to straight-up, borderline sex dolls. They have no significant contribution to anything this time around, minus a gimmie here or there, but remain prevalent only for the purpose of many a fan-service shot. \\n\\n\r\nIt seems like they cranked everything up to 11 this time around, but somehow stripped the series of the depth it had in the first season, making it feel like a try-hard copycat. Many of the moving-camera shots even started to make me feel nauseous, especially when it's just one after another. \\n\\n\r\nI have no idea what went on behind the scenes between the movie and the second season, but this is a serious disappointment. Which, again, isn't a terrible surprise as the first season seems to be a perfect storm that probably had no right to be as good as it was. \\n\\n\r\nI probably would have been better off having NOT re-watched the first season (and movie) in preparation for the second, but alas my opinion on the series is going to lie where it may. Based on my personal experience, I can't legitimately recommend the second season (or the first movie for that matter) as its hard to not draw comparisons between it and the first. \\n\\n\r\nHowever, I do feel others may have more fun with the second season than I did. Its pomp and circumstance is likely welcome when not watching all 13 episodes back-to-back and it still has a few impactful scenes that made it enjoyable overall.",
            "date": "2016-10-04T21:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 231114,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211643.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nadrojiskool",
                "username": "Nadrojiskool"
            },
            "url": "https://myanimelist.net/reviews.php?id=231114"
        },
        {
            "content": "K: Return of Kings is the final installment of the K: Project Series. This is a pretty typical shounen anime, but I love shounen anime, so I may be a bit biased here. \r\n(This is a no spoilers review)\r\nStory:\r\nReturn of Kings picks up where Missing Kings (the movie) left off, with Kuro and Neko waiting/searching for Shiro. The main antogonist of this season is the Green King, and Shiro and the gang will have to pull out all the stops in order to match the super powerful Green King. The story seemlessly continues on the path the last two installments began, and the main plotof this season is fully thought out and well rounded.\\n\\n\r\nArt:\\n\\n\r\nReturn of Kings has absolutely breathtaking art. All the character designs and scenery from the first two series is amped up and pushed to the limit, producing gorgeous fight scenes that literally take your breath away. The colors and fluidity of animation are truly awesome. This category gets a 10.\\n\\n\r\nSound:\\n\\n\r\nAnother category that wins a 10 from me. The last two installments had pretty good music and sound, but Return of Kings takes this to a whole new level. The \"jazzy\" feeling that I disliked in the first series has been replaced by upbeat, techno sounding music that really helped each scene. The fight scenes feel particularly fresh and engaging.\\n\\n\r\nCharacter:\\n\\n\r\nThis show has A LOT of characters, but one of the things K is so good at is making you care about most, if not all of them. Each character is given enough screen time to feel fleshed out. Our main characters were of course given the most screen time, but not quite as much as I would have liked - I would have liked to have seen a lot more of Shiro and Kuro.\\n\\n\r\nTDLR::\\n\r\nOverall I really enjoyed Return of Kings. The story is well rounded, the characters fleshed out, the music and art are superb, and the show concludes nicely. If you are a fan of K, you will not be disappointed with this second series and with how it ends.",
            "date": "2018-03-11T17:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 273610,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102552.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/whatchamini",
                "username": "whatchamini"
            },
            "url": "https://myanimelist.net/reviews.php?id=273610"
        },
        {
            "content": "After Mikoto & Tatara died this become the worst anime ever!\r\nHOMRA!!\r\nThey are amazing they should become the main Characters, not the stupid Yashiro team!.\r\nIt will become more interesting and enjoyable if the main Characters like HOMRA!!\r\nNext time they should think of that. this was a big chance to create an amazing anime.\r\nUnfortunately, they focus on stupid atmosphere and some Ecchi shot.\r\nThat way (K: Memory of Red Manga) was amazing.\r\nAll HOMRA Characters has charisma make any one watch it scream with them (NO BLOOD,NO BONE,NO ASH!)\r\nThat what I want to say but it ask me to write more I don't have more word!",
            "date": "2017-08-22T07:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 256017,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456085.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Yuuki-Sama",
                "username": "Yuuki-Sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=256017"
        },
        {
            "content": "I really liked it a lot! I wish they could make a 3rd s.\r\nReally happy about Saruhiko and Misaki \r\nI'm kind of very sad that the powers they had are gone now but I'm happy for Munakata and Shiro.\r\nA bit sad... I liked the green clan somehow.\r\nI also wish they could make an Movie or an OVA about Saru and Misaki from the Lost Small World and then until now and maybe show us a bit more of them after making up.\r\nx\r\nI really liked it a lot! I wish they could make a 3rd s.\r\nReally happy about Saruhiko and Misaki \r\nI'm kind of very sadthat the powers they had are gone now but I'm happy for Munakata and Shiro.\\n\r\nA bit sad... I liked the green clan somehow.\\n\\n\r\nI also wish they could make an Movie or an OVA about Saru and Misaki from the Lost Small World and then until now and maybe show us a bit more of them after making up.",
            "date": "2015-12-28T10:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 207101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5082297.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kuromiki",
                "username": "kuromiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=207101"
        },
        {
            "content": "I don't know what happened with the quality of this season. I've spent the hole season annoyed with the shades of blue/green/red/orange/purple around the scenario or... everything?\r\nA lot of unnecessary fanservice when Neko and Awashima appeared. Awkward 3D. Annoying endless electronic music, even in momentos of tension there was the same happy electronic song going on. I mean, in season 1 the songs were a good combination and well disposed.\r\nThis season was a visual let down. The story was ok, I guess I would enjoy it better reading the novel.\r\nI don't know if I can stand another season like this one.",
            "date": "2016-03-26T13:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 214243,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/576367.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blackcastles",
                "username": "blackcastles"
            },
            "url": "https://myanimelist.net/reviews.php?id=214243"
        },
        {
            "content": "This is my first review. \r\nI have a love/hate relationship with this season of k .I love the artwork and music go perfect with scene.this is example of an anime with beautiful artwork ,but not so great story or plot ....well have another plot :/ .the character didnt have  character development much like for example Shiro act like same as he did in 1st season.I want to him in more i dont know fight in him.I cant get pass the plot ..sorry it in my face the whole season.the fan service dont make different.My opinion 1st is the better season.it is worth a 6in overall .if you want art then this is perfect for it but if you want story or plot then no .\\n\\n\r\nLiked\\n\r\nArtwork\\n\r\nMusic\\n\\n\r\ndisliked\\n\r\nPlot... big hole in the story\\n\r\nfan service...too much \\n\r\ncharacter development which nothing much",
            "date": "2015-12-26T13:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 206875,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1303089.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/msercert",
                "username": "msercert"
            },
            "url": "https://myanimelist.net/reviews.php?id=206875"
        },
        {
            "content": "K: Return of Kings is the long anticipated sequel of the anime K and the movie K: Missing Kings. It closely follows the style of its predecessors as a hot-blooded story about the tragedy aroused out of the differences in ideologies and the value of friendship coupled with quite a bit of Ho Yay (which is, to sidetrack a bit, part of the reason why I know this show). Its strengths and weaknesses are also similar to them, having excellent aesthetical attraction but merely mediocre plot.\r\nThe biggest appeal of the K franchise is its visual design, thanks to its generous budget. The scenery is gorgeous,to speak the least, and every character is visually attractive while having their distinctive designs. The only minor flaw is the 3D animations that may look awkward when juxtaposed against the 2D characters. I can't say whether all the panty shots and gainaxing makes the anime better or worse - I am not a big fan of fanservice, but your mileage may vary.\\n\\n\r\nTo add to the aesthetic value of the show, the aural effects are also good, if not outright excellent. The seiyuu is an all-star cast - we have Daisuke Ono (who voiced Sebastian) for Kuro, Mamoru Miyano (who voiced Light Yagami) for Fushimi, Jun Fukuyama (who voiced Lelouch vi Britannia) for Misaki, etc - and there is no doubt that all of them successfully bring out the emotions of the characters The background music is in a variety of genres including soft piano , electronic, orchestral, so on and so forth. The OP, Asymmetry by Yui Horie, is a typical J-Pop song while the ED, Solution by CustomiZ, is a more hardcore rock that suits the badass feeling of the anime. The soundtrack is probably inferior to shows like Puella Magi Madoka Magica and Steins; Gate, but that doesn't mean it is bad either.\\n\\n\r\nNot so, however, when it comes to the story. The numerous logical leaps and are also an eyesore. For example, how can Yashiro leap down for 3 episodes before landing at the exact right spot for a big damn heroes moment? Why can Kuro, even after the Dresden Plate is dealt with, still retain their power for some time? Why is Reisi suddenly empowered to beat his opponent, despite failing epically in the previous match? These flaws, accompanied with the hand-waved explanation, render the story mediocre at best.\\n\\n\r\nThe characters somewhat compensate for the mediocre story, but one needs to look at the side materials in order to truly appreciate them. The net result of having loads and loads of character is that each of them can only have a day under limelight, if any. Yashiro unfortunately received a huge badass decay when it comes to his guile and fighting skills, which is evident in how he manages the siege in Episode 6-8 by literally flying around. This can be explained by his pacifist nature, but it isn't clear on first sight. The Silver Clan receives little development. The motive behind the main antagonist, while more or less depicted in the side manga, is not clearly elaborated in the anime. HOMRA and Scepter 4 are also hosts of many interesting characters, but to truly appreciate them, side materials are, again, necessary. Especially Scepter 4 - the only people I can remember in the anime are Reisi, Seri and Fushimi. However, if you read the Days of Blue novella, you will soon see every character is idiosyncratic in one way or another, and their relationship is both professional and friendly.\\n\\n\r\nFortunately, the fleshed out characters and the well-constructed fighting scenes compensate for the above problems to make the show enjoyable overall. This show is not as much a melodrama as one may think at first, but one needs to rely on side materials and deeper appreciation in order to realize it.",
            "date": "2016-03-05T20:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 212328,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/fMegrez",
                "username": "fMegrez"
            },
            "url": "https://myanimelist.net/reviews.php?id=212328"
        }
    ],
    [
        {
            "content": "!!!!!!!!!!![SPOILER ALERT]!!!!!!!!!!!\r\nOkay, this season is totally different from the first one for many reasons. Generally it does not suck very bad but there are few points that you should be aware of that made this season less liked for me than the first season: \r\n1. The Background Music: It does not suck only it sucks much, I mean techno music made the situation more than funny to me, and many of the times the music was not on the right time or not appealing at least. \r\n2. The story: The kings thing is cool yet far from the first season even if we did nottry to compare it to the previous season it still far from perfect. The story does not seem well plotted and there are many fillers during the episodes that left all the good action to the last two eps (12 & 13) which was not even enough! The green kings are fine and I liked their characters however, they were defeated so easily at the end.  In addition, the episodes lost the taste of connection together which for me did not seem quite good.\\n\r\n3. The Enjoyment: it was fair because no much of enjoyment there unless you are looking for Neko's panties...that's a different story then. \\n\r\n4. The characters are quire good and the anime art is goodish, however there is more (not required) fan service in there.\\n\\n\r\nIn general, it was fine watching this season and I want to say it was totally not what I expected to see from the awesome K I used to know!",
            "date": "2017-05-12T01:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 247506,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1667951.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mythdeath",
                "username": "mythdeath"
            },
            "url": "https://myanimelist.net/reviews.php?id=247506"
        }
    ]
]