[
    [
        {
            "content": "(This has been adapted from my reddit thread)\r\nWhen a person first starts out in the world, the only connections he or she makes are between the immediate family. The mom feeds, the dad protects, and the siblings watch over the new addition to the house. But at a certain point, new bonds must be made, not within the household but within society itself. These new, usually different people that are met more often than not become \"friends.\" A friend is a confidant, a buddy, a guy or girl with which things are less serious and more fun. Sadly, even if such friends are found, theycan just as easily be lost. In Sora no Method, the idea of friendship is tested, and by the end, it becomes nothing more than a stranger.\\n\\n\r\nSTORY\\n\\n\r\nMethod begins with Nonoka, a middle schooler who is moving back to her childhood hometown after being away for some time. Upon arriving, a happy little girl named Noel appears to have been waiting for her for years, in the hopes that they can hang out once more.\\n\\n\r\nSomething went terribly wrong as Method was being produced. Imagine a river, flowing endlessly and consistently. Eventually, it reaches the open ocean after much trekking and hardship. This is how drama is usually handled; stuff happens, drama ensues, build-up, and resolution. Now, imagine if every mile or so, a dam was built, providing less and less water the further along it went. And in the end, instead of reaching the ocean, it was funneled haphazardly toward a ravine to forever become lost. That is how the drama of Method is handled.\\n\\n\r\nAnalogies aside, Method tackles its drama in a \"stop-and-go\" fashion. A problem is usually found from among the group, Nonoka tries to address it, and eventually solves the controversy. But it's always give and take. Where one set of issues is taken care of, a whole new set arises. It never feels as if any of the drama or any of the resolution amounts to anything significant. Characters employ physical abuse, miscommunication, avoidance, and literal refusal to unnecessarily ramp up the drama. What results is a plethora of melodramatic scenarios in which it is never quite clear if anything is ever truly being resolved. In fact, on multiple occasions, seemingly finished plot points are reinstated. The exact same drama unfolds as it had before, making the audience quite aware of the awkward repetition.\\n\\n\r\nIn order to exacerbate the problems further, Method leaves many rather important questions left unanswered. Despite it being small in terms of a contextual universe, there are particular events that either receive no explanation or, for what is given, it isn't enough to justify what happens. Characters being able to find one another on a whim, how the saucer works, and how certain characters are able to remember certain events can be guessed at, but it's not so much clever interpretation as it is misplaced confusion.\\n\\n\r\nEven the overall theme receives a blow. Throughout the entire show, it runs with the idea of what being a friend and having them really means. A friend doesn't always have to be around; while they may go separate ways, two friends are usually so for life. Stuff can appear along the way that tests the waters, but good friends, no matter what may have happened in the past, remain so. That is to say, it's not the memories that matter but rather the relationship that does...or that is what we are lead to believe. The final two episodes reverse the message Method was formulating and sending. It instead latches onto the opposite venue; the memories are more important than the actual bond that is shared. The apparent shift in focus comes about due to another melodramatic moment and only serves to solidify how misguided the anime truly is.\\n\\n\r\nANIMATION\\n\\n\r\nThe only feature of Method that is praiseworthy is in its art and animation.\\n\\n\r\nThe art is rather gorgeous. The backdrops are varied and filled with great lighting effects and detail. Colors are fresh and vibrant, giving the show a rather appealing look no matter where the situations are taking place. The locations vary nicely as well, with scenic beaches and gloomy lighthouses. It's always a feast for the eyes.\\n\\n\r\nThe character designs are not as impressive as the art itself, but they do their job. The main cast is simple in appearance, with normal haircuts and normal outfits, usually resorting to their school uniform. Only Noel is given any uniqueness, with her light-blue hair, black and white attire, and child-like stature.\\n\\n\r\nThe actual animation follows the art. The characters move quite fluidly at all times, whether alone or with multiple others on screen. Animation also exists for background and foreground objects, making the world look that much more alive.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhere the art excels, the characters plummet. Method's cast range from inconsequential to infuriating, and not even Noel's infinite cuteness can save them.\\n\\n\r\nOne of the worst \"main\" characters I have ever seen lies with Koharu. While kind, she acts as a literal fifth-wheel to the brother and sister combo and the other two best friends. Outside of working at the local tourist shop or being nice to the other four, she serves no purpose. Without any amount of character development or usefulness besides being the last \"friend\" needed to summon the saucer, any other person could replace her.\\n\\n\r\nAs the only male friend, Souta stands out slightly. A bit more rational, he has a need to escape his current life and try something new. He cares a lot for his sister and the people around him, despite his often mellow attitude. He works hard, no matter the subject, but is rather easy to tease. In the beginning, he appears to look out only for himself, not wanting to deal with any of the drama taking place around him. However, he learns through Noel that sometimes the best things in life are right next to you all along. Sadly, after the halfway point in the show, he loses what little relevancy he had, becoming almost as much of a side character as Koharu did.\\n\\n\r\nYuzuki is an energetic young girl. When she sets her mind on a goal, she strives to accomplish it with as much gusto as she can muster. Overreacting, protesting, and simply having fun is what she is known for. Being the first real obstacle that Nonoka must overcome, Yuzuki almost always runs away from her problems. Her refusal to deal with anyone or at least listen to what others have to say makes her out to be quite difficult to deal with, and even more so to watch. She exemplifies the notion that a friend sometimes needs more than just words to get through.\\n\\n\r\nArguably the most ridiculous cast member, Shione has her name shouted more times than one cares to hear. With a stoic appearance and a simple beauty about her, she remains entirely standoffish for nearly the whole season. Her signature headphones give her a literal and personified way to drown out the \"noise\" around her. She avoids the other members, especially Nonoka, as much as possible, causing an inability in any of the friends to rectify the situation with her. Shione's wishy-washy behavior manifests near the end, and her development causes her to completely contrast with who she was all along. And not just by a small amount; so much so that she becomes almost too sympathetic.\\n\\n\r\nTaking the lead, Nonoka is the childhood friend who is seen as ruining everything. Determined and kind, her mother taught her to always smile to spread happiness where needed. She hates seeing the people she held dear succumb to sadness, so she takes it mostly upon herself to fix the ties that were made between the four of them seven years ago. Even as the star, she never improves much as a character, with her feelings being known and shown at all points without much difference. She starts off being caring and thoughtful towards her friends, and she ends the exact same way.\\n\\n\r\nThe only memorable cast member is potentially Noel. Innocent and cute beyond measure, she constantly seeks to be with the five kids who called her. Rather carefree, she simply wants nothing more than to see Nonoka and the gang happy. Impossible not to like, mysterious to a degree, and always there at the right place at the right time, Noel is \"a diamond in the rough.\" Sadly, her character is treated rather lazily, making the impact of her inclusion within the story diminished due to the ending of the tale and her rushed transition from pure cuteness to emotionally aware.\\n\\n\r\nWhat's interesting is, with the exception of Noel, the more difficult the person was for Nonoka to befriend, the more development that character received. While this makes sense logically, it causes the problem shown here with the characters: some of the friends do close to nothing useful in regards to the narrative. Koharu and Souta receive little attention because they're stable, whereas Yuzuki and Shione are compromised. This doesn't work, because half the cast becomes unimportant. Yuzuki's and Shione's evolution as characters could have meant something, but the overextended drama relative to the events taking place outlined them as being quite irrational. What are left are both underdeveloped and unlikable characters.\\n\\n\r\nSOUND\\n\\n\r\nThe OP's beginning piano and singing start it off on the right note. When the generic beat kicks in, the rest of the song falls flat, except for the final lyrics giving it a rather touching feeling.\\n\\n\r\nThe ED is slightly better. Again, it starts off with instruments only, and is quite pleasant to hear. Following the beginning, the vocalist works well with the violin and trailing effects. While the beat usually leaves much to be desired, the singer does her best to make the song out to be better than what it is.\\n\\n\r\nThe soundtrack is actually quite good. The little humming tune, the tapping-and-vocal arrangement during uneasy scenes, and the harp-with-tingling-chimes piece for the more melancholic ones are performed well. They add more to the show than the story and characters are able to produce.\\n\\n\r\nVoice-acting sees mostly average performances for the cast. A special shout-out goes to Inori Minase as Noel.\\n\\n\r\nENJOYMENT\\n\\n\r\nOne of the reasons why I picked this up from the beginning was partly due to it being an original and being a new studio's first work. It's unfortunate that the end product isn't as good as it could have been. The story and characters seem to be pieces to a puzzle. Yet, watching Nonoka get slapped (more than once, too) was less dramatic and more hilarious. Seeing Yuzuki run away every chance she got was annoying, not endearing. Watching Shione be good friends with Noel and nobody else was continuously perplexing. There are just too many moments jumbled next to one another to call the puzzle correctly put together.\\n\\n\r\nThe only aspect making the anime tolerable was Noel. Her cute faces, constant smiling, and precious way of speaking provided some laughs and grins along the way. She in no way is capable of keeping the entire show afloat, but if she were not present at all, there would be absolutely nothing worthy coming from this one.\\n\\n\r\nAs a new venture, Sora no Method was a gamble that failed miserably. The story and characters are nonsensical without a doubt. While the music and art are refined, there just isn't enough present to call this one anything but forgettable.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, melodramatic, unneeded confusion, clashing themes\\n\\n\r\nAnimation: Good, nice art, okay character designs, good animation\\n\\n\r\nCharacters: Terrible, a mix of underdeveloped and unlikable\\n\\n\r\nSound: Fine, bad OP, okay ED, good soundtrack, okay VA work\\n\\n\r\nEnjoyment: Bad, Noel is the only reason to watch\\n\\n\r\nFinal Score: 3/10",
            "date": "2015-01-03T09:05:00+00:00",
            "helpful_count": 82,
            "mal_id": 175925,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=175925"
        },
        {
            "content": "When a giant saucer appears in the sky above a small town, what sort of events would you expect to follow? \r\nSora no Method poses this question, and then follows with the most mundane answer it could have gone with: a slice of life drama that spends about five minutes of the whole series actually talking about the saucer, despite it being the source of many troubles the characters face. The fact that someone thought it would be a good idea to through in such a large supernatural element and then treat it like it was nothing worth acknowledge subsequently succeeded in creating a veryfrustrating chain of events.\\n\\n\r\nFrom the same anime industry that brought you enormous headed children with trouble making friends (looking at you, Haganai), this season, this same industry introduced more enormous headed children with trouble making friends. \\n\r\nThe story does begin in a grabbing way; our main protagonist, Nonoka, is on her way to her new home with her father. This is obviously a basic scenario, but once Nonoka's car passes through a tunnel and into her new life, attention is drawn to the great glaring object in the sky. \\n\\n\r\nAnd it all goes down hill from there.\\n\\n\r\nAfter throwing the saucer into the plot, rather than choosing a story line to make Sora no Method unique from other anime, the main focus of the show becomes how badly Nonoka wants to make friends. She doesn't seem to give much of a damn about this thing that's hanging over the town constantly, but she will relentlessly bother another girl until she engages in conversation. \\n\r\nMost of the episodes out of the thirteen are back and forth nonsense consisting of 'will they be friends or won't they', only briefly mentioning the anime's unique, floating characteristic when its convenient to make the 'will they, won't they' business continues with petty argument. \\n\r\nIt's terrible to admit, but most of the episodes in Sora no Method could probably be skipped over, as it's mostly the same mundanity--Nonoka goes somewhere, tries to make friends with someone, it doesn't work until she applies willpower, it suddenly works, on to the next potential friend.\\n\\n\r\nNonoka may also be a problem here, as I've noticed one of the downfalls of many anime for me is an irritating main character, and to me, Nonoka is incredible irritating. It isn't her voice or her appearance, but the fact that she blindly assumes she can change everyone's opinion of her if she bothers them enough times. In fact, Nonoka pushes for all the other characters to change and accept her, when she does nothing to change herself. Nonoka experiences no character development and remains presently the likable moe factor, remaining the same desperate from episode one to episode thirteen. \\n\r\nThere are times where she would even blatantly prevent other characters from interacting with the saucer, which was perhaps the most frustrating part of her personality--physically watching her prevent any developments outside of her personal relationships nearly warranted a drop of the series halfway through.\\n\r\nIf the main goal of Nonoka was to make her cute and charismatic, that base was already covered by part of her supporting cast, Noel, who exhibited a much rounder version of whatever Nonoka was trying to supply. I believe other characters like Noel were made more likable because they weren't trying too hard or forcing their personality onto one another. Where the protagonist failed, the supporting cast strongly marched onward in the shadows.\\n\\n\r\nBeing an anime new this year, as expected, the art and sound were cleanly done, and most of Sora no Method's soundtrack was very relaxing. Toward the very end of the series, there was a strange change in art style that startled me, but it may have worked to leave somewhat of an impact. That is to say, it was startling, but it wasn't bad. I especially liked the color palettes used.\\n\\n\r\nIn the end, I suppose Sora no Method is a simple case of a plot in the hands of the wrong genre, where there are many exciting and innovative paths to choose in response to the saucer, but none of them were taken. As a drama in its own genre, the show was still a bit indecisive and wishy washy, though with so many other anime out there it isn't right to set expectations to high. \\n\\n\r\nAs a final warning, I believe the personality of the main character takes high tolerance to watch, and if tolerated, she is compensated for by the characters that surround her. Why the title focuses on the sky is something of a mystery, because no one else seems concerned with it at all. That aspect may take high tolerance as well.",
            "date": "2014-12-28T09:48:00+00:00",
            "helpful_count": 40,
            "mal_id": 174807,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3863993.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MangakaNotlora",
                "username": "MangakaNotlora"
            },
            "url": "https://myanimelist.net/reviews.php?id=174807"
        },
        {
            "content": "Bland. Frustrating. Disappointing. These are just a few words I would use to describe Sora no Method. These days, original anime are a bit more scarce than they were about 6 or 7 years ago so hearing about the release of this, and by a new studio, excitement and anticipation welled up within me. These feelings were quickly dashed within the first few episodes.\r\nStory 6/10\r\nThe story itself, albeit nothing particularly ground breaking, appears solid and, on the surface of things, rather interesting. In short, a girl named Nonoka returns to her home town from Tokyo. Upon arriving, she discovers that a huge saucer has beenpresent over the town ever since she left. The story progresses with her regaining lost memories, concerning her old friends, with the help of this shows poster girl, Noel. As things further progress, she soon realises that not all will be as happy compared to her first time in the town and thus she starts to walk down the path of pain and anguish. Now at first, this seems interesting and I must admit, I was thoroughly intrigued by the saucer itself but my intrigue was quickly cut down. Why you ask? Simply because the story wasn't as promising as it was set out to be. Yes, there were certain parts to the anime that weren't terrible and provided a good watch but the overall story itself quickly became predictable and boring. Watching it almost became a challenge. Not only did it become predictable, it also became quite annoying in stages. Without spoiling anything, certain plotlines just seemed out-right pointless and, in the grand scheme of things, not really an issue in the first place. These 'issues' were then solved quite easily which again proves my point. This is the classic case of drama being created for the sake of it. What didn't help the series was its array of uninspiring characters, which segways me into my main issue with the series, the characters.\\n\\n\r\n4/10\\n\r\nNever have I seen a bunch of uninspiring set of characters in my life. What I want to clarify is that they aren't horrendous in any specific way, apart from Shione, they are just boring to watch. None of them make you feel anything. You don't sympathise with them, you don't feel angry for them. There wasn't one part of the anime that made me feel anything towards the characters. Even when the anime hinted at big story lines concerning character relationships, such as the one about Yuzuki and Souta. You got yourself geared up for a big reveal only to be left disappointed. Poor character writing surrounded this anime. As mentioned earlier, there is also a typical 'poster girl' in this anime called noel. She has all the traits that make certain people fall head over heels for her type such as the childish and friendly nature, the 'unique' look and so on but does this make the character memorable and lovable? Not really to be honest. All the ingredients were present to make a memorable character that whenever you think back to the series, you immediately think back to her and smile but like all characters within the series, she was like a hollow shell. I wish I could elaborate further on why, but I simply can't. The whole situation just baffles me as the ingredients were there, but they weren't used properly. \\n\\n\r\nArt & sound 7/10\\n\r\nI give credit where credit is due. Considering this was the studio's first attempt at an anime, the art was pretty darn good. The backdrops looked beautiful and the saucer itself looked stunning. The music though was where they truly hit the right notes. Both opening and ending fit the atmosphere the creators were trying to create. On top of that, they were both memorable and stayed in my head for a number of weeks after the series finished airing. The ost was pretty good aswell, both concerning the sound and timing. I must say, I was rather impressed with these two aspects.\\n\\n\r\nOverall, this anime was a disappointment. It wasn't terrible, like some series out there, but, for me, it is far from being considered a 'good anime'. Maybe it was because of my anticipation for the series that led me to expressing fairly harsh views but one can only speculate. Some may think though that the score 6 isn't actually too bad, but considering the way I personally score anime, this is quite low. Maybe if one goes into this not expecting much and with a very open mind, this might actually be considered a good watch. Who knows.\\n",
            "date": "2015-01-26T08:37:00+00:00",
            "helpful_count": 33,
            "mal_id": 179004,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1831559.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thelotusf1fan",
                "username": "thelotusf1fan"
            },
            "url": "https://myanimelist.net/reviews.php?id=179004"
        },
        {
            "content": "Short Version of this review: \r\nThis anime is over-looked and pretty underrated but in a good way. Not in the fact that its shit but in the fact that it wasn't really known when airing. This show is worth a watch and heartwarming. The only strong factor may be its story with its simplicity and way of storytelling. The art and animation are good for the most part while the characters lack in potential.\r\nThe Review:\r\nThe slice of life genre is like an escape goat from all the thrillers and actions out there, its like a fresh breath of air from the blood and maturity andshows and is more of a relaxing way to watch. You could make something good out of the genre or fail terribly. Sora no Method is somewhere in about the middle. It has some good points but lack them. \\n\\n\r\nThe story is well written for the most part and original-ish with a few new ideas to the SOL genre. So recently a girl is returning to her old town, she meets up with new friends and then finds a mysterious little girl who then relates to the MCs past. The first episode is well done in showing us the setting and what to expect in this show. When an anime starts with its first episode, it should introduce you to what to expect, Sora no Method does it perfectly. Later on the story can drag on and some of the characters can be somewhat annoying and this factor cause them to somehow drag the story on. If the parts that drag on and the annoyingness of the characters are removed, this show could easily fit 10-11 episodes. Hell, looking at its setting its fit of the 11 or 22 episodes that a show would get for its interesting setting. The story is good but can really drag on.\\n\\n\r\nThe characters are pretty average and really don't need much detail. Nonoka, the MC, is just sloppy, she starts off well but later on seems more like a nuisance to the story, she has some good moments but the way she handles her friends is dumbwitted, you know how if you want to cheer up a friend and end up making them feel worser? Thats Nonoka but times 100 and you have one annoying ass MC. Souta is pretty ok, some of his developement scenes are pretty good and hell, he should be the MC, he knows how to cheer people up, he has his own harem (literally) so why not make him the MC? Noel, the saucer girl who is so goddamned cute, is a good one, her character developements are good and tear-worthy, overall she's a good character. Yuzuki is a average tsundre, Togawa is an annoying ass tsundre and Koharu is pretty much Friend A.\\n\\n\r\nThe animation is pretty nice, the backgrounds are well designed and the character designs, like how hard where the studio making this trying to get people to watch this, the characters are at least 13-14 yet they look like they're 10-11, they look like f-ing lolis, like what the fuck? The CGI is meh for the most part and normal animation is much better than it. The music is nice, both OPs and EDs are kind of catchy and enjoyable to the ears. The background music really fits some of the scenes in this including the character developements, its used well. The voice acting is pretty ok.\\n\\n\r\nNow sometimes, this show can get a little boring. Some parts just drag on and you wonder when the hell is a certain scene gonna end. Now Yuzuki and Togawa are the main sector of the annoying characters. Yuzuki is easily offended and it should feel sad but feels more like a reason to let the show reach its 13 episode mark, she dosen't go back to normal till way later on, like I understood the situation but it dragged on. You know that annoying ass tsundre in a show that you hate but at least have some heart to them. Togawa is a flat out tsundre who I hated from beggining to end, she's a bitch (literally) and is there just to let the main cast ahave problems, if Togawa isn't in this hsow, this show would probably get a much better rating than it does now. \\n\\n\r\nStory: 6.7\\n\r\nArt & Sound: 7\\n\r\nCharacters: 5\\n\r\nEnjoyment: 4.5\\n\\n\r\nSora no Method is more of a show to let time pass, if you don't have shit to watch or want something thats relaxing, watch Sora no Method. A great show? No. A shit show? No. A Flawed show? Yes. Sora no Method gets a 6/10.\\n\\n",
            "date": "2015-04-09T10:36:00+00:00",
            "helpful_count": 19,
            "mal_id": 185220,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4188619.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JKinky88",
                "username": "JKinky88"
            },
            "url": "https://myanimelist.net/reviews.php?id=185220"
        },
        {
            "content": "Sora no Method leaves an intensely illuminating image in the mind, reflective of the deep and abiding memories of its lead character, Nonoka. Sora no Method's visual splendor is like the prettiest fireworks in the sky, lighting up faces and hearts for both its characters and the show's viewers. This is one anime show that is both beautiful to behold, as well as beautiful in its emotionally resonant treatment of friendship, hope, family, and struggle against the corrosive effect that the passage of time can have on all three. \r\nHowever, as strong as Sora no Method's heart and artistry is, its story can tease andbewilder at times, even though it is not particularly complicated. I would recommend this anime to anyone who is a fan of Key-related anime works, as well as to fans of the AnoHana anime, but I do want to prepare you for some of the show's weaknesses.\\n\\n\r\nThe story often has an air of magically mesmerizing mystery about it. At its best, it can prove enchanting and engrossing. But at its worst, it can leave you raising eyebrows over the actions and choices of its characters.\\n\\n\r\nI found the characters to be very likeable, and well-actualized, but there are at times a questionable inconsistency to them. Their choices and emotional attachments sometimes fail to come across well, and it's often only later and in retrospect that they start to make more sense. So this is an anime that demands a certain type of patience. Not in a basic pacing sense, as I didn't find the plot overly fast or slow, but rather when it comes to how you approach the characters. \\n\\n\r\nThe characters develop gradually, meticulously, and sometimes in a \"2 steps forward, 1 step back\" sort of way. At times, they can be exasperating, and this can undermine the effectiveness and sense of flow to the story. \\n\\n\r\nNonetheless, the central characters all have a strong sense of agency to them, and it is easy to get caught up in their wondrously whimsical wavering and movement. Noel is of consistent chipper cheer, leaving her name a very fitting one given the well-known holiday that also bears that name. And so she serves as an anchor that keeps the Sora no Method ship sailing straight through the torrential storms of the other character's emotional typhoons and crashing waves. \\n\\n\r\nThe high-spirited yet also high-strung Yuzuki often amuses, and the relationship between her and her brother is one of the more realistic sibling relationships I've seen in anime in recent years. \\n\\n\r\nShione provides an edge and sharpness to the show that helps provide a good balance to its syrupy saccharine sentimental aims. She can exasperate or even infuriate in her worst moments, but those moments are probably essential in giving the otherwise straightforward story the momentum it needs.\\n\\n\r\nKoharu is the pleasant poised peacemaker, who's generally gentle touch is supported well by a touch of iron within. She has her moments of weakness, to be sure, but her softness speaks soundly of a good and reliable friend. \\n\\n\r\nThen there is Nonoka, who's dauntless determination infuses the show with a swiftly sprinting synergy of powerful and vibrant character relationship dynamics. Nonoka is a well-balanced lead character that I found very easy to like and cheer on. \\n\\n\r\nAnd it is because of exquisite emotional engagement, that I feel comfortable in giving this show a very good rating in spite of its narrative weaknesses. If you're looking for a thrilling or thought-provoking show, then this might not be the best show for you. But if you're looking for something strongly spirited, an aspirational adventure that slowly grows under the glimmering lights of a saucer above, then this is one show that I think you will heartily enjoy.",
            "date": "2015-06-04T19:03:00+00:00",
            "helpful_count": 17,
            "mal_id": 189559,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/431448.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Triple_R",
                "username": "Triple_R"
            },
            "url": "https://myanimelist.net/reviews.php?id=189559"
        },
        {
            "content": "This show is probably one of the most underrated show of the Fall 2014 season. It is a shame that this show is going to be lost with the others of its genre. This show falls victim to the \"don't judge a book by it's cover\" scenario where at first glance, it seems like a typical moe-blob show with hints of melodrama, but it grows into something much more than that and tries it's best to differentiate itself from the rest of the shows this season. Sure it is no Fate/ Stay Night UBW or Parasyte, and it isn't even close to being compared toclassics like Kanon or Anohana, but with the right mindset, this show can easily stand its own ground.\\n\r\nThe main problem I keep hearing about this show is that it's \"too melodramatic.\" Lets be honest, without a little drama and character conflict, this show will still get ripped on either way. The story itself starts off with a very solid premise with some shaky execution problems along the road. It should be noted that this show is really character driven, and if you hate one of the characters, the story might drag for you. Our MC Nonoka just moved into her childhood town where she reunites with some of her childhood friends. However, it might not be as easy as it seems as her friends drifted apart due to the presence of a saucer hovering over the cit, a saucer summoned by them when they were little 7 years ago. From there, Nonoka meets with Noel, a girl of unknown origin, and with her tries to reunite with her friends as they were before the saucer came in. The story itself isn't perfect, and it can be quite predictable at times. There are even some questionable moments such as \"why isn't the government doing anything about the saucer\" or \"is a certain character's reason for hatred towards the saucer justifiable?\" If we stand back and look at the story for what it is, a coming of age story about old friendships and new relationships, the story is quite bearable and delightful to watch.\\n\r\nAnother plus of the series is sound and art/animation department. The art style is really, how should I say, bright, cheery, and beautiful. The animation, for the most part, is pretty solid, it gets the job done. The soundtrack is quite well done. All the pieces compliments the scenes it was played too, setting the mood right, whether it is really sad, or really hopeful. The OP and ED songs are relatively good compared to shows of this genre. The OP is good but whether you want to download it \"legally\" is up to you. The ED on the other hand is agreeably great and definitely worth listening to outside the show.\\n\r\nIf there are any flaws in Sora No Method, and there are quite a few, it's the character department. Although some Characters. such as Shione, Nonoka, and Yuziki, had some decent character development and back story, some really didn't get any, like Nonoka's dad or Souta. If there is one character worth mentioning, its the shows mascot, Noel. Noel, in a nutshell, is \"THE MOST ADORABLE CHARACTER THIS SEASON!!!!\" Jokes aside, Noel played her part well. By that, I mean being the adorable girl everyone wants to hug and be around. Although her role in the story is somewhat disappointing as the main plot device revolves around her and the show hardly focuses on her and focuses more in Nonoka and her struggle to conform with her friends. Speaking of friends, some of her friends motivations for disbanding and conflict are somewhat shallow and could have explained upon more or at least portrayed better. There are seriously moments where you just want to facepalm and slap a certain character. Although it really didn't happen, what they all became in the end was really satisfactory and worth the journey.\\n\r\nSora No Method, sadly won't be remembered this season, besides that it is the \"moe-blob\" of this season. But it is just so much more than that. By the end of the series, I walked away really happy, and would love to see some more Noel cuteness and adorableness. This show is worth trying out as it is a good breather away from those adrenaline pumped action shows and hyperactive comedy/slice of life shows.  If you are looking for the next Anohana, steer clear away from this anime as it would leave you disappointed. But if you are looking for something different in the moe supernatural genre, check it out. I really hope this anime gets noticed more as it easily falls into one of my favorites this year.",
            "date": "2014-12-28T23:42:00+00:00",
            "helpful_count": 15,
            "mal_id": 174949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3468953.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AwesomeDudex3",
                "username": "AwesomeDudex3"
            },
            "url": "https://myanimelist.net/reviews.php?id=174949"
        },
        {
            "content": "Sore no Method – “That’s what I’m here for, to grant your wishes”. A simple and innocent story of a girl just trying to reconnect with all her friends so that they may all smile together again. Except it is much more than just a friendly story. It moves you in ways that you cannot explain. Emotions swell within you yet, these emotions cannot be distinguished from happy and sad. It becomes hard to differiate between heartbreak and heartwarming, or that the tears upon your cheeks are from joy or sorrow. Sora no Method takes all of these feelings and blends them together into thehappiest sad anime of the year.\\n\r\nStory – 7\\n\r\nNonoka is returning to her hometown after being in Tokyo for seven years. Although the town itself hasn’t changed much the attitudes and tourists have, because now there is a giant saucer hovering right over the middle of the lake. As Nonoka starts her new life she goes back to school. Luckily she ends up in the same class as most of her childhood friends unfortunately, she forgot about them after being gone for so long leading to some of them becoming mad at Nonoka for forgetting them.  Later as she returns home to start unpacking more of her belongings she finds Noel looking through the items, and in Noel’s hands is a picture of Nonoka’s late mother with its glass covering broken. Infuriated at the thought that Noel broke this picture she yells at Noel to leave, its not until her father returns and tells her that the picture was already broken while moving that Nonoka realizes the mistake she had made. As she desperately searches around the town for Noel she remembers a promise she made to Noel before she moved away. Nonoka then runs to the abandoned observatory, there she finds Noel and apologizes. Only to have Noel say it was ok and that after Nonoka fulfilled Noel’s wish of her returning, that it was her turn to make Nonoka’s wish come true.\\n\r\nThe story can easily be described with two words: melodramatic and moving. There are tons of forced drama in the first few episodes with everyone but one of her ex-friends holding a grudge. Slowly yet surely Nonoka with the help of the ultra-cute Noel becomes friends with almost everyone. And that basically ends most of the forced drama. The last few episodes are beyond moving. The story has such a beautiful meaning and delivery no one cannot help but feel their heart getting pulled upon, and for a few tears of both joy and sorrow roll down their cheeks. With a final ending that will just melt your soul.\\n\r\nCharacters – 7\\n\r\nNonoka only wants to be with friends again. She is a slight tragic character in the beginning with everyone blaming her for the saucer that came and changed their lives. Through it all though Nonoka never breaks, she does get beaten back especially when trying to sway Shione to forgive her. Luckily she is always helped by the wonderfully adorable Noel. And to get it out of the way: Noel is the most adorable character this season. Now I’m sure you’ve heard others call her that too and think she’s just become an overhyped loli who does a few cute things but nothing more. Instead Noel is one of the most dynamic characters of the story. Always working hard to bring everyone together with a smile, and while all the other characters might break down and cry Noel never once stops smiling. It’s unfortunate that the other characters, apart from Shione who only comes into herself in the final moments of the season, are somewhat bland compared to the developments that Nonoka and Noel go through. But that still makes them solid characters while not as important or entertaining each can easily hold their own throughout the story and all make important contributions.\\n\r\nFor the most part Koharu never holds any grudges against anyone, and actually blaming herself for the falling out of Yuzuki and her brother Souta before the events of the story. She never makes a large impact on the story but constantly keeps pushing everyone to be friends. The Mizusaka twins, Yuzuki and Souta, are two very different characters. Yuzuki is very active in both fending off Nonoka’s early attempts at befriending her, but then adamantly trying to sway Shione into becoming friends once again. While her brother Souta really is not much of a character as he stays in the background making sure the girls don’t hurt themselves. Shione is actually a difficult character to describe as she is almost two faced. She refuses to talk to Nonoka and even threatens her at points, but at the same time acting like a big sister to Noel. This relationship goes until the very end of the series and because of key spoilers I won’t discuss the matter to that point.\\n\r\nArt/Animation – 9\\n\r\nIt’s stunning. A very simple yet elegant art style perfectly matches the innocence of the characters and story. Beautiful background shots are used everywhere. The animation looks exceedingly good whenever they put they use the saucer as something to draw on. Also the final scenes are so beautiful and smooth the art itself was one of the reasons that it evoked so much emotion.\\n\r\nSound – 8\\n\r\nSimple and innocent, the ever going theme to describe this anime. While they can’t stand out from the anime itself the beautiful background music enhances every key moment and just makes you smile. The OP and ED are very cute sounding and some of my favourite’s of the season.\\n\r\nEnjoyment – 8\\n\r\nThe anime easily had its ups and downs. Over the course of the season it was unfortunate that this show was one of the first I would “save” until next week to watch. Until the final few episodes it was a basic slice of life, yes we saw an over-arching story and really good characters. But nothing made me think “You know I really need to watch Sora no Method this week” and it is just that unfortunate that is what the genre has us do. Now luckily what happened is that I pushed it back so much that I ending up marathoning the final four episodes which is actually something that needs to be done. Because it is these four episodes that everything comes to light, everything comes together, and everyone smiles.\\n\r\nOverall – 7.93\\n",
            "date": "2015-01-05T18:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 176413,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=176413"
        },
        {
            "content": "I finally got around to finishing this show, and I'm glad I did. It reminded me a lot of Nagi no Asukara or Glasslip, as all three are very heart-warming and relaxing. The opening and ending are both equally enjoyable. All of the main characters were very well written, and the story really sticks with me. I was surprised with how much better it got in the last two episodes. Shione is such an important character. The last episode must have given me chills 100 times, and I even teared up there when Shione was looking at the papers to enroll in her old school.Overall, I'd definitely recommend this show, and it was very enjoyable to watch!",
            "date": "2015-06-26T23:58:00+00:00",
            "helpful_count": 7,
            "mal_id": 191404,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685632.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nekocyan",
                "username": "nekocyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=191404"
        },
        {
            "content": "I just finished this Anime and I can say that it is underrated if you accept the fact that it’s target audience is skewed to a younger audience.  Basically, it is a show about growing up and friendship.  I selected it just by chance, when I was in the mood for something light and cute.  I must admit that I did during the first few episodes wonder why I was watching it but after a little while the characters started to grow on me and the plot became more interesting.  But it is the last few episodes that make the showworth watching.  The simple seen between Nonoka and her Mom is truly precious and the lesson about the impact a good friend can have on our life is heart warming to say the least.  So if you are in the mood for something simple and cute which is targeted to a younger audience then you may want to give it a try.",
            "date": "2018-09-17T10:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 289251,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5886051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rick57",
                "username": "Rick57"
            },
            "url": "https://myanimelist.net/reviews.php?id=289251"
        },
        {
            "content": "If this series were longer and didn't have Noel in it, I would not bother trying to force myself to just get this over with and then watch something else. Along with Sword Art Online, this was one of the most aggravating shows I have ever seen. Is it just as bad as SAO? Actually, no, not really, but if you decide to watch this show, be prepared for 13 of illogical nonsense.\r\nStory: 5/10.\r\nWe have a mysterious cute girl and a group of old friends that fell apart and was eventually brought together with the help of that mysterious girl... does that sound familiar? Ah,right, AnoHana. I cannot stand tearjerkers, but I did enjoy that show for some reason. This, however, does not feel like a weak attempt to repeat AnoHana's success. In fact, it does not feel like anything. It's not good, it's not bad, it's one big nothing. Nothing much happens as the conflict feels forced and ridiculous, characters demonstrate nothing but ineptitude and inability to solve simple problems.\\n\\n\r\nArt: 7/10.\\n\r\nArt is pretty, although it is not unique and you've probably seen better than that. It's not off-putting, but, if you do not like cute moe art styles, you might not enjoy watching big-eyed cute girls who do not even have any redeeming qualities and their ordinary character design cannot make up for it. But the scenery is impressive. But, unfortunately, a pretty picture cannot save a poor plot, I always say so.\\n\\n\r\nSound: 4/10.\\n\r\nPretty forgettable, there's not much to be said about it.\\n\\n\r\nCharacter: 2/10.\\n\r\nNoel is the reason why I decided to give this aspect 2 and not 1. I loved her, I loved how cute and adorable she was, refusing to give up and genuinely caring for the rest of the cast that did not deserve it. But one character is not capable of saving an entire show from going downhill.\\n\r\nNonoka is annoying. So annoying that I was cruel enough to enjoy scenes in which characters were so done with her they couldn't help but slap her. I admit that it is important to solve conficts, especially if you mess up, but Nonoka keeps forcing herself onto her ex-friend despite being told to get lost again and again. I get that there are times when people have to be assertive, but if somebody keeps telling you to leave them alone and nothing changes, I think it is better to follow this piece of advice.\\n\r\nShione is this quiet and oh-so-independent cold girl. Normally, these characters do not get on my nerves, but Shione's behavior and attitude are beyond unacceptable. Yes, I think that Nonoka should have left her alone, but that does not mean that Shione is on the right side of the conflict. She is not because it feels like she does not even want to try to solve a problem, running away from it and putting on a cold facade, enjoying her miserable and resentful role way too much.\\n\r\nThe Mizusaka twins and Koharu were pretty forgettable, but they are nowhere near as annoying as Nonoka and Shione.\\n\\n\r\nEnjoyment: 4/10.\\n\r\nOnce again, I wonder why 4 out of 10 is considered decent. I almost dropped this show because of a ridiculous conflict that could be solved in one or two episodes at best. If it weren't for Noel, this show's only interesting and, most importantly, adequate character, there would be nothing to look at.\\n\\n\r\nOverall, this is an average and pretty forgettable show and you find it hard to genuinely care for any of the characters (except for, maybe, Noel in my case, it's all subjective). I've seen worse and it's not exactly a disaster, but it is very boring and slow. And I don't know which is worse: a bad show you can drop or a series you watch just because you hope it will eventually get better, but it doesn't.",
            "date": "2017-05-16T07:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 247830,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5260988.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Waffle_Empress",
                "username": "Waffle_Empress"
            },
            "url": "https://myanimelist.net/reviews.php?id=247830"
        },
        {
            "content": "Sora no Method, or Cosmic Method, was a show that, when airing begun, didn't really attract much attention, but for the people that have watched it or plan to soon, this show is a very lighthearted slice of life that won't blow your mind, and it certainly won't resonate with everyone, but for what it's worth, i'd say it did it's job pretty well. \r\nStory - 7\r\nThe story isn't incredibly groundbreaking, but one word that i feel can be used quite effectively is unique, the story follows Komiya Nonoka, a girl that, at the best of times, is quite inspiring, and at the worst, annoyingas hell. She has moved back to her hometown where a saucer occupies the sky. The saucer was called by Nonoka and her friends when they were kids, and now Nonoka embarks on a emotional journey with her childhood friends, as they all become more and more entwined with the saucer and the mysterious girl that came with it. \\n\\n\r\nArt - 7\\n\\n\r\nNothing amazing in the art department, Animation had a really nice water colour look to it in my opinion, and the hair of almost every character was something i really liked looking at, the eyes however, not really, i like big eyes as much as the next guy but i don't know, something about the lighter shades at the bottom half of characters eyes just didn't look very nice to me, but then again, i am a picky person when it comes to eyes. Everything else was so-so, as aforementioned, nothing amazing, but it certainly isn't bad to look at.\\n\\n\r\nSound - 8\\n\\n\r\nBeautiful ED, pretty good OP, music in episodes was average, what you'd expect from the kind of show it is. That ending theme though, god that was great, I know a lot of shows do this but when I heard the start of the ED fade in at the end of each episode i got a little excited and, well, tried my best to sing along (we all do it, don't try to deny it). The OP was alright, I don't think it really displayed the right sort of scenes at time though, like when Nonoka runs onto the wharf, and turns around to see Noel, her face drops into despair it looks like for a second, i don't know, maybe it's just me but i found sometimes the OP didn't really fit the cheery song sometimes. \\n\\n\r\nCharacters - 7\\n\\n\r\nMost of the characters in this show were your averagely generated attitudes and personalities, you've got the stubborn one (Shione) the energetic one (Yuzuki) the nice one who accepts everything (Koharu) and the one who seems like they don't care but they really do in the end (Souta). As much as my descriptions might not be top notch, that's how i saw most of the characters, not to say that in a negative manner though, i enjoyed the dialogue between most of them, expect for Shione and Yuzuki being absolute bitches to Nonoka at first, that annoyed me a little. \\n\\n\r\nEnjoyment/Overall - 7\\n\\n\r\nOverall this was a very lighthearted show with some magical aspects about a group of friends going through what friends go through, mix in a cute loli with blue hair who is just the god damned cutest thing ever, i mean come on, Noel carried the comedy in this show, and you've got yourself an upper average slice of life that gives you a warm feeling with each episode, a smile at the nice ending and enough cutesy dialogue to make you see it through to the end. \\n\\n\r\n~Xeno156",
            "date": "2014-12-30T00:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 175165,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3628979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xeno156",
                "username": "xeno156"
            },
            "url": "https://myanimelist.net/reviews.php?id=175165"
        },
        {
            "content": "My simple review of Sora no Method.\r\n-------------\r\nArt: 9\r\nThe most redeeming quality Sora no Method offers is the extraordinary art. If you enjoyed the art in Nagi no Asukara, the color scheme and visuals are similar, though NagiAsu does it better in my opinion. \r\n-------------\r\nSound: 8\r\nThe second most redeeming quality is the ost and voice actors. The music was catchy and beautiful and the vice actors did amazing in their roles.\r\n-------------\r\nNow Story and Characters, where the series fell flat on their face.\r\nStory: 4.5\r\nStory was a decent setup but it delivered poorly without answering numerous questions and having too many plot holes to count. It really isa shame because they could've done so much with the set-up.\\n\r\n-------------\\n\\n\r\nCharacters: 5\\n\\n\r\nThe character designs are cute and unique but the personalities of these characters are bland and their actions hardly ever make sense or are even logical. Noel was the only decent character even though she was a typical moe blob copy.\\n\r\n-------------\\n\\n\r\nEnjoyment: 6\\n\\n\r\nI enjoyed this series as a viewer but as a reviewer I can see why it can be disliked. \\n\r\nBUT I don't think it deserves less than a 3 because the series had a lot of positives you cannot deny like the ost, voice actors, art, and character design.\\n\\n\r\nOverall: 6.5",
            "date": "2016-03-28T11:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 214548,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3590109.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Thnx4dafood",
                "username": "Thnx4dafood"
            },
            "url": "https://myanimelist.net/reviews.php?id=214548"
        },
        {
            "content": "Now, I can't just ignore an unusual show like this and say nothing.\r\n---First, let's examine the genre.\r\nSora no method, at first, it is said to be Slice of Life and Sci-fi. That's actually an interesting mix. And with that cute character? Seriously, that's how I start to watch this show.\r\nBut the unusual part of this show is here. After one or two episode, you will notice that there's a hint of mystery here (surprised?). Not really suspenseful, though. But it will keep you tilt your head. You will be constantly pondering questions like: \"why she's like that? why she want that? why she do that?why she didn't do that? what's happening here?\" Yeah, and you can only keep watching this show, bearing all the boredom, just to know the answer. Perhaps it could've been great if only executed better. So is it worth as mystery? not as far as that. \\n\r\nSo how good is the slice of life part, then? Well, to tell you the truth, I don't think it's slice of life of any kind. True, there's some part where you see cute girls doing slice of life things, but I think that is pretty common even in non-Slice of Life anime, especially anime nowadays, right? Rather than that, mostly you will often see a lot of people crying around people's relationship. So it's more like drama rather than slice of life, correct? So is it drama? Neither. How should i say? Even when the characters are in uptight situation, it doesn't feel uptight enough. You see people crying, there's no slice of life scene there, but the atmosphere still feels relaxed enough, even made you sleepy. Strange, huh? Don't even ask whether this show will make you cry or not. I really doubt that. \\n\r\nSchool? Well, I will say it's OK. they are students, and there's some club activities. \\n\r\nSo what about the sci-fi part? Hmm... You can't say it's sci-fi just because there's UFO in the show, right? I mean, there's nothing scientific at all. The show doesn't even tell you where the instruction to call the UFO came from, or explain any background explanation worth to be sci-fi. They just somehow have it there from the first place. That's all. If we are in literature, it's more like a touch of magical realism rather than sci-fi. But it's also not even close to be a fantasy, as the only magical thing in the show is just that crystal UFO hovering above the town. \\n\r\nAnd so, i'm sure this part where Sora no Method doesn't succeed on bringing the merit of any genre, is one of the reason why this show is not popular.\\n\\n\r\n---Next, let's see the story. Don't worry. No spoiler here. Maybe just vague minor spoiler. But still, skip this part if you want.\\n\r\nSora no method is about a group of a friend. They're very close in the past. They had a special place to gather and play around. For some reason, they started to be separated. Several years later, when they finally meet again, they are having cold shoulder to each other. Apparently, there's a mysterious incident in the past which makes them troubled. At first, it appears as if a certain someone is the one who's supposedly to blame. But actually, every each of them is secretly hiding something related about the incident. This show will be about those group of friend trying to fix their relationship and strengthen their friendship with the help of a not-so-human cute girl. But unfortunately, if that really come true, something bad might happen. \\n\r\nWait. \\n\r\nSounds familiar? Yeah. While the other named AnoHana is a so-called masterpiece of tearjerker drama in anime world, this one called Sora no Method is not so popular. \\n\r\nNow, please note that the story I sum up above is just the big plot or main point of it. It doesn't mean Sora no Method is very much similar with AnoHana. Nope. The overall detail of the story will be very different. I mentioned AnoHana just to give you a better idea on the story of Sora no Method. If I may say, compared to AnoHana, Sora no Method has more positive vibes in it and much more relaxed feels. I will not spoil anything. \\n\r\nWhat else is different? The ending. Again, I will not spoil anything so watch it yourself if you want to know. It might not like what you expect.\\n\r\nThe problem in the story is: it is boring. The execution is bad. The conflict cannot pull you in. You might even ask, why I even watch this? \\n\\n\r\n---Then, what's good about this show?\\n\r\nThe Art. \\n\r\nAfter watching it, the character design doesn't really stand out to me (maybe just those twin brother and sister)\\n\r\nBut what's really stand out is the scenery, it's so beautiful. I really like the sunset, the lake, the monuments, the mossy observatory, the sunflowers, the meteor shower, and the sunflowers in the final episode. And especially, in one of the episode, you will see the most beautiful UFO ever! So gorgeous it will give you chills!\\n\\n\r\n---What about the music?\\n\r\nWell, expect something sweet and beautiful from 'fhana'. If I could describe the music in a scenery, it will be like watching glittering star in a beautiful night sky. That kind of feeling.\\n\\n\r\n---So, is it worth watching?\\n\r\nOnly if you have time to waste. Or maybe if you need lullaby or some boredom in your fast-paced insomniac night.\\n",
            "date": "2016-04-22T06:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 216879,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5151059.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Reiraku",
                "username": "Reiraku"
            },
            "url": "https://myanimelist.net/reviews.php?id=216879"
        },
        {
            "content": "So I might be a little too harsh in my review on this, but regardless it is still how I feel. I originally dropped this anime. I was just done with it, but I wanted to give it another chance. I was unfortunately let down. So positives. The setting is interesting for a short little series. Not overstay its welcome. The art work is ok, and honestly these two things are the things that bring me in. They did a decent job on this part. Now the negatives. The character and the story is so boring and stale. Most importantly stale. Even a bad storyis enjoyable. It is something to laugh at, and mix in the weirdness of anime to a bad story for a laughable story. That is the opposite of this anime though. There is just a bit too much vagueness to this anime. The character to me doesn't really have too much motivation to do anything. It seems like she just did this stuff because she has nothing better to do. It feels like that if this saucer that nobody really questions, and honestly just becomes part of their commute. Is the thing that is driving the story. Which would be ok. If the story just wasn't so bland, and extremely predictable. To date this is the most two dimensional anime I have ever seen. It has a great idea, and aesthetics. It just poorly executes it's possibly interesting story. So I definitely not recommend it.",
            "date": "2017-06-24T21:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 250940,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3490275.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/SakaRaki",
                "username": "SakaRaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=250940"
        }
    ],
    [
        {
            "content": "(This has been adapted from my reddit thread)\r\nWhen a person first starts out in the world, the only connections he or she makes are between the immediate family. The mom feeds, the dad protects, and the siblings watch over the new addition to the house. But at a certain point, new bonds must be made, not within the household but within society itself. These new, usually different people that are met more often than not become \"friends.\" A friend is a confidant, a buddy, a guy or girl with which things are less serious and more fun. Sadly, even if such friends are found, theycan just as easily be lost. In Sora no Method, the idea of friendship is tested, and by the end, it becomes nothing more than a stranger.\\n\\n\r\nSTORY\\n\\n\r\nMethod begins with Nonoka, a middle schooler who is moving back to her childhood hometown after being away for some time. Upon arriving, a happy little girl named Noel appears to have been waiting for her for years, in the hopes that they can hang out once more.\\n\\n\r\nSomething went terribly wrong as Method was being produced. Imagine a river, flowing endlessly and consistently. Eventually, it reaches the open ocean after much trekking and hardship. This is how drama is usually handled; stuff happens, drama ensues, build-up, and resolution. Now, imagine if every mile or so, a dam was built, providing less and less water the further along it went. And in the end, instead of reaching the ocean, it was funneled haphazardly toward a ravine to forever become lost. That is how the drama of Method is handled.\\n\\n\r\nAnalogies aside, Method tackles its drama in a \"stop-and-go\" fashion. A problem is usually found from among the group, Nonoka tries to address it, and eventually solves the controversy. But it's always give and take. Where one set of issues is taken care of, a whole new set arises. It never feels as if any of the drama or any of the resolution amounts to anything significant. Characters employ physical abuse, miscommunication, avoidance, and literal refusal to unnecessarily ramp up the drama. What results is a plethora of melodramatic scenarios in which it is never quite clear if anything is ever truly being resolved. In fact, on multiple occasions, seemingly finished plot points are reinstated. The exact same drama unfolds as it had before, making the audience quite aware of the awkward repetition.\\n\\n\r\nIn order to exacerbate the problems further, Method leaves many rather important questions left unanswered. Despite it being small in terms of a contextual universe, there are particular events that either receive no explanation or, for what is given, it isn't enough to justify what happens. Characters being able to find one another on a whim, how the saucer works, and how certain characters are able to remember certain events can be guessed at, but it's not so much clever interpretation as it is misplaced confusion.\\n\\n\r\nEven the overall theme receives a blow. Throughout the entire show, it runs with the idea of what being a friend and having them really means. A friend doesn't always have to be around; while they may go separate ways, two friends are usually so for life. Stuff can appear along the way that tests the waters, but good friends, no matter what may have happened in the past, remain so. That is to say, it's not the memories that matter but rather the relationship that does...or that is what we are lead to believe. The final two episodes reverse the message Method was formulating and sending. It instead latches onto the opposite venue; the memories are more important than the actual bond that is shared. The apparent shift in focus comes about due to another melodramatic moment and only serves to solidify how misguided the anime truly is.\\n\\n\r\nANIMATION\\n\\n\r\nThe only feature of Method that is praiseworthy is in its art and animation.\\n\\n\r\nThe art is rather gorgeous. The backdrops are varied and filled with great lighting effects and detail. Colors are fresh and vibrant, giving the show a rather appealing look no matter where the situations are taking place. The locations vary nicely as well, with scenic beaches and gloomy lighthouses. It's always a feast for the eyes.\\n\\n\r\nThe character designs are not as impressive as the art itself, but they do their job. The main cast is simple in appearance, with normal haircuts and normal outfits, usually resorting to their school uniform. Only Noel is given any uniqueness, with her light-blue hair, black and white attire, and child-like stature.\\n\\n\r\nThe actual animation follows the art. The characters move quite fluidly at all times, whether alone or with multiple others on screen. Animation also exists for background and foreground objects, making the world look that much more alive.\\n\\n\r\nCHARACTERS\\n\\n\r\nWhere the art excels, the characters plummet. Method's cast range from inconsequential to infuriating, and not even Noel's infinite cuteness can save them.\\n\\n\r\nOne of the worst \"main\" characters I have ever seen lies with Koharu. While kind, she acts as a literal fifth-wheel to the brother and sister combo and the other two best friends. Outside of working at the local tourist shop or being nice to the other four, she serves no purpose. Without any amount of character development or usefulness besides being the last \"friend\" needed to summon the saucer, any other person could replace her.\\n\\n\r\nAs the only male friend, Souta stands out slightly. A bit more rational, he has a need to escape his current life and try something new. He cares a lot for his sister and the people around him, despite his often mellow attitude. He works hard, no matter the subject, but is rather easy to tease. In the beginning, he appears to look out only for himself, not wanting to deal with any of the drama taking place around him. However, he learns through Noel that sometimes the best things in life are right next to you all along. Sadly, after the halfway point in the show, he loses what little relevancy he had, becoming almost as much of a side character as Koharu did.\\n\\n\r\nYuzuki is an energetic young girl. When she sets her mind on a goal, she strives to accomplish it with as much gusto as she can muster. Overreacting, protesting, and simply having fun is what she is known for. Being the first real obstacle that Nonoka must overcome, Yuzuki almost always runs away from her problems. Her refusal to deal with anyone or at least listen to what others have to say makes her out to be quite difficult to deal with, and even more so to watch. She exemplifies the notion that a friend sometimes needs more than just words to get through.\\n\\n\r\nArguably the most ridiculous cast member, Shione has her name shouted more times than one cares to hear. With a stoic appearance and a simple beauty about her, she remains entirely standoffish for nearly the whole season. Her signature headphones give her a literal and personified way to drown out the \"noise\" around her. She avoids the other members, especially Nonoka, as much as possible, causing an inability in any of the friends to rectify the situation with her. Shione's wishy-washy behavior manifests near the end, and her development causes her to completely contrast with who she was all along. And not just by a small amount; so much so that she becomes almost too sympathetic.\\n\\n\r\nTaking the lead, Nonoka is the childhood friend who is seen as ruining everything. Determined and kind, her mother taught her to always smile to spread happiness where needed. She hates seeing the people she held dear succumb to sadness, so she takes it mostly upon herself to fix the ties that were made between the four of them seven years ago. Even as the star, she never improves much as a character, with her feelings being known and shown at all points without much difference. She starts off being caring and thoughtful towards her friends, and she ends the exact same way.\\n\\n\r\nThe only memorable cast member is potentially Noel. Innocent and cute beyond measure, she constantly seeks to be with the five kids who called her. Rather carefree, she simply wants nothing more than to see Nonoka and the gang happy. Impossible not to like, mysterious to a degree, and always there at the right place at the right time, Noel is \"a diamond in the rough.\" Sadly, her character is treated rather lazily, making the impact of her inclusion within the story diminished due to the ending of the tale and her rushed transition from pure cuteness to emotionally aware.\\n\\n\r\nWhat's interesting is, with the exception of Noel, the more difficult the person was for Nonoka to befriend, the more development that character received. While this makes sense logically, it causes the problem shown here with the characters: some of the friends do close to nothing useful in regards to the narrative. Koharu and Souta receive little attention because they're stable, whereas Yuzuki and Shione are compromised. This doesn't work, because half the cast becomes unimportant. Yuzuki's and Shione's evolution as characters could have meant something, but the overextended drama relative to the events taking place outlined them as being quite irrational. What are left are both underdeveloped and unlikable characters.\\n\\n\r\nSOUND\\n\\n\r\nThe OP's beginning piano and singing start it off on the right note. When the generic beat kicks in, the rest of the song falls flat, except for the final lyrics giving it a rather touching feeling.\\n\\n\r\nThe ED is slightly better. Again, it starts off with instruments only, and is quite pleasant to hear. Following the beginning, the vocalist works well with the violin and trailing effects. While the beat usually leaves much to be desired, the singer does her best to make the song out to be better than what it is.\\n\\n\r\nThe soundtrack is actually quite good. The little humming tune, the tapping-and-vocal arrangement during uneasy scenes, and the harp-with-tingling-chimes piece for the more melancholic ones are performed well. They add more to the show than the story and characters are able to produce.\\n\\n\r\nVoice-acting sees mostly average performances for the cast. A special shout-out goes to Inori Minase as Noel.\\n\\n\r\nENJOYMENT\\n\\n\r\nOne of the reasons why I picked this up from the beginning was partly due to it being an original and being a new studio's first work. It's unfortunate that the end product isn't as good as it could have been. The story and characters seem to be pieces to a puzzle. Yet, watching Nonoka get slapped (more than once, too) was less dramatic and more hilarious. Seeing Yuzuki run away every chance she got was annoying, not endearing. Watching Shione be good friends with Noel and nobody else was continuously perplexing. There are just too many moments jumbled next to one another to call the puzzle correctly put together.\\n\\n\r\nThe only aspect making the anime tolerable was Noel. Her cute faces, constant smiling, and precious way of speaking provided some laughs and grins along the way. She in no way is capable of keeping the entire show afloat, but if she were not present at all, there would be absolutely nothing worthy coming from this one.\\n\\n\r\nAs a new venture, Sora no Method was a gamble that failed miserably. The story and characters are nonsensical without a doubt. While the music and art are refined, there just isn't enough present to call this one anything but forgettable.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, melodramatic, unneeded confusion, clashing themes\\n\\n\r\nAnimation: Good, nice art, okay character designs, good animation\\n\\n\r\nCharacters: Terrible, a mix of underdeveloped and unlikable\\n\\n\r\nSound: Fine, bad OP, okay ED, good soundtrack, okay VA work\\n\\n\r\nEnjoyment: Bad, Noel is the only reason to watch\\n\\n\r\nFinal Score: 3/10",
            "date": "2015-01-03T09:05:00+00:00",
            "helpful_count": 82,
            "mal_id": 175925,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=175925"
        },
        {
            "content": "When a giant saucer appears in the sky above a small town, what sort of events would you expect to follow? \r\nSora no Method poses this question, and then follows with the most mundane answer it could have gone with: a slice of life drama that spends about five minutes of the whole series actually talking about the saucer, despite it being the source of many troubles the characters face. The fact that someone thought it would be a good idea to through in such a large supernatural element and then treat it like it was nothing worth acknowledge subsequently succeeded in creating a veryfrustrating chain of events.\\n\\n\r\nFrom the same anime industry that brought you enormous headed children with trouble making friends (looking at you, Haganai), this season, this same industry introduced more enormous headed children with trouble making friends. \\n\r\nThe story does begin in a grabbing way; our main protagonist, Nonoka, is on her way to her new home with her father. This is obviously a basic scenario, but once Nonoka's car passes through a tunnel and into her new life, attention is drawn to the great glaring object in the sky. \\n\\n\r\nAnd it all goes down hill from there.\\n\\n\r\nAfter throwing the saucer into the plot, rather than choosing a story line to make Sora no Method unique from other anime, the main focus of the show becomes how badly Nonoka wants to make friends. She doesn't seem to give much of a damn about this thing that's hanging over the town constantly, but she will relentlessly bother another girl until she engages in conversation. \\n\r\nMost of the episodes out of the thirteen are back and forth nonsense consisting of 'will they be friends or won't they', only briefly mentioning the anime's unique, floating characteristic when its convenient to make the 'will they, won't they' business continues with petty argument. \\n\r\nIt's terrible to admit, but most of the episodes in Sora no Method could probably be skipped over, as it's mostly the same mundanity--Nonoka goes somewhere, tries to make friends with someone, it doesn't work until she applies willpower, it suddenly works, on to the next potential friend.\\n\\n\r\nNonoka may also be a problem here, as I've noticed one of the downfalls of many anime for me is an irritating main character, and to me, Nonoka is incredible irritating. It isn't her voice or her appearance, but the fact that she blindly assumes she can change everyone's opinion of her if she bothers them enough times. In fact, Nonoka pushes for all the other characters to change and accept her, when she does nothing to change herself. Nonoka experiences no character development and remains presently the likable moe factor, remaining the same desperate from episode one to episode thirteen. \\n\r\nThere are times where she would even blatantly prevent other characters from interacting with the saucer, which was perhaps the most frustrating part of her personality--physically watching her prevent any developments outside of her personal relationships nearly warranted a drop of the series halfway through.\\n\r\nIf the main goal of Nonoka was to make her cute and charismatic, that base was already covered by part of her supporting cast, Noel, who exhibited a much rounder version of whatever Nonoka was trying to supply. I believe other characters like Noel were made more likable because they weren't trying too hard or forcing their personality onto one another. Where the protagonist failed, the supporting cast strongly marched onward in the shadows.\\n\\n\r\nBeing an anime new this year, as expected, the art and sound were cleanly done, and most of Sora no Method's soundtrack was very relaxing. Toward the very end of the series, there was a strange change in art style that startled me, but it may have worked to leave somewhat of an impact. That is to say, it was startling, but it wasn't bad. I especially liked the color palettes used.\\n\\n\r\nIn the end, I suppose Sora no Method is a simple case of a plot in the hands of the wrong genre, where there are many exciting and innovative paths to choose in response to the saucer, but none of them were taken. As a drama in its own genre, the show was still a bit indecisive and wishy washy, though with so many other anime out there it isn't right to set expectations to high. \\n\\n\r\nAs a final warning, I believe the personality of the main character takes high tolerance to watch, and if tolerated, she is compensated for by the characters that surround her. Why the title focuses on the sky is something of a mystery, because no one else seems concerned with it at all. That aspect may take high tolerance as well.",
            "date": "2014-12-28T09:48:00+00:00",
            "helpful_count": 40,
            "mal_id": 174807,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3863993.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MangakaNotlora",
                "username": "MangakaNotlora"
            },
            "url": "https://myanimelist.net/reviews.php?id=174807"
        },
        {
            "content": "Bland. Frustrating. Disappointing. These are just a few words I would use to describe Sora no Method. These days, original anime are a bit more scarce than they were about 6 or 7 years ago so hearing about the release of this, and by a new studio, excitement and anticipation welled up within me. These feelings were quickly dashed within the first few episodes.\r\nStory 6/10\r\nThe story itself, albeit nothing particularly ground breaking, appears solid and, on the surface of things, rather interesting. In short, a girl named Nonoka returns to her home town from Tokyo. Upon arriving, she discovers that a huge saucer has beenpresent over the town ever since she left. The story progresses with her regaining lost memories, concerning her old friends, with the help of this shows poster girl, Noel. As things further progress, she soon realises that not all will be as happy compared to her first time in the town and thus she starts to walk down the path of pain and anguish. Now at first, this seems interesting and I must admit, I was thoroughly intrigued by the saucer itself but my intrigue was quickly cut down. Why you ask? Simply because the story wasn't as promising as it was set out to be. Yes, there were certain parts to the anime that weren't terrible and provided a good watch but the overall story itself quickly became predictable and boring. Watching it almost became a challenge. Not only did it become predictable, it also became quite annoying in stages. Without spoiling anything, certain plotlines just seemed out-right pointless and, in the grand scheme of things, not really an issue in the first place. These 'issues' were then solved quite easily which again proves my point. This is the classic case of drama being created for the sake of it. What didn't help the series was its array of uninspiring characters, which segways me into my main issue with the series, the characters.\\n\\n\r\n4/10\\n\r\nNever have I seen a bunch of uninspiring set of characters in my life. What I want to clarify is that they aren't horrendous in any specific way, apart from Shione, they are just boring to watch. None of them make you feel anything. You don't sympathise with them, you don't feel angry for them. There wasn't one part of the anime that made me feel anything towards the characters. Even when the anime hinted at big story lines concerning character relationships, such as the one about Yuzuki and Souta. You got yourself geared up for a big reveal only to be left disappointed. Poor character writing surrounded this anime. As mentioned earlier, there is also a typical 'poster girl' in this anime called noel. She has all the traits that make certain people fall head over heels for her type such as the childish and friendly nature, the 'unique' look and so on but does this make the character memorable and lovable? Not really to be honest. All the ingredients were present to make a memorable character that whenever you think back to the series, you immediately think back to her and smile but like all characters within the series, she was like a hollow shell. I wish I could elaborate further on why, but I simply can't. The whole situation just baffles me as the ingredients were there, but they weren't used properly. \\n\\n\r\nArt & sound 7/10\\n\r\nI give credit where credit is due. Considering this was the studio's first attempt at an anime, the art was pretty darn good. The backdrops looked beautiful and the saucer itself looked stunning. The music though was where they truly hit the right notes. Both opening and ending fit the atmosphere the creators were trying to create. On top of that, they were both memorable and stayed in my head for a number of weeks after the series finished airing. The ost was pretty good aswell, both concerning the sound and timing. I must say, I was rather impressed with these two aspects.\\n\\n\r\nOverall, this anime was a disappointment. It wasn't terrible, like some series out there, but, for me, it is far from being considered a 'good anime'. Maybe it was because of my anticipation for the series that led me to expressing fairly harsh views but one can only speculate. Some may think though that the score 6 isn't actually too bad, but considering the way I personally score anime, this is quite low. Maybe if one goes into this not expecting much and with a very open mind, this might actually be considered a good watch. Who knows.\\n",
            "date": "2015-01-26T08:37:00+00:00",
            "helpful_count": 33,
            "mal_id": 179004,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1831559.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thelotusf1fan",
                "username": "thelotusf1fan"
            },
            "url": "https://myanimelist.net/reviews.php?id=179004"
        },
        {
            "content": "Short Version of this review: \r\nThis anime is over-looked and pretty underrated but in a good way. Not in the fact that its shit but in the fact that it wasn't really known when airing. This show is worth a watch and heartwarming. The only strong factor may be its story with its simplicity and way of storytelling. The art and animation are good for the most part while the characters lack in potential.\r\nThe Review:\r\nThe slice of life genre is like an escape goat from all the thrillers and actions out there, its like a fresh breath of air from the blood and maturity andshows and is more of a relaxing way to watch. You could make something good out of the genre or fail terribly. Sora no Method is somewhere in about the middle. It has some good points but lack them. \\n\\n\r\nThe story is well written for the most part and original-ish with a few new ideas to the SOL genre. So recently a girl is returning to her old town, she meets up with new friends and then finds a mysterious little girl who then relates to the MCs past. The first episode is well done in showing us the setting and what to expect in this show. When an anime starts with its first episode, it should introduce you to what to expect, Sora no Method does it perfectly. Later on the story can drag on and some of the characters can be somewhat annoying and this factor cause them to somehow drag the story on. If the parts that drag on and the annoyingness of the characters are removed, this show could easily fit 10-11 episodes. Hell, looking at its setting its fit of the 11 or 22 episodes that a show would get for its interesting setting. The story is good but can really drag on.\\n\\n\r\nThe characters are pretty average and really don't need much detail. Nonoka, the MC, is just sloppy, she starts off well but later on seems more like a nuisance to the story, she has some good moments but the way she handles her friends is dumbwitted, you know how if you want to cheer up a friend and end up making them feel worser? Thats Nonoka but times 100 and you have one annoying ass MC. Souta is pretty ok, some of his developement scenes are pretty good and hell, he should be the MC, he knows how to cheer people up, he has his own harem (literally) so why not make him the MC? Noel, the saucer girl who is so goddamned cute, is a good one, her character developements are good and tear-worthy, overall she's a good character. Yuzuki is a average tsundre, Togawa is an annoying ass tsundre and Koharu is pretty much Friend A.\\n\\n\r\nThe animation is pretty nice, the backgrounds are well designed and the character designs, like how hard where the studio making this trying to get people to watch this, the characters are at least 13-14 yet they look like they're 10-11, they look like f-ing lolis, like what the fuck? The CGI is meh for the most part and normal animation is much better than it. The music is nice, both OPs and EDs are kind of catchy and enjoyable to the ears. The background music really fits some of the scenes in this including the character developements, its used well. The voice acting is pretty ok.\\n\\n\r\nNow sometimes, this show can get a little boring. Some parts just drag on and you wonder when the hell is a certain scene gonna end. Now Yuzuki and Togawa are the main sector of the annoying characters. Yuzuki is easily offended and it should feel sad but feels more like a reason to let the show reach its 13 episode mark, she dosen't go back to normal till way later on, like I understood the situation but it dragged on. You know that annoying ass tsundre in a show that you hate but at least have some heart to them. Togawa is a flat out tsundre who I hated from beggining to end, she's a bitch (literally) and is there just to let the main cast ahave problems, if Togawa isn't in this hsow, this show would probably get a much better rating than it does now. \\n\\n\r\nStory: 6.7\\n\r\nArt & Sound: 7\\n\r\nCharacters: 5\\n\r\nEnjoyment: 4.5\\n\\n\r\nSora no Method is more of a show to let time pass, if you don't have shit to watch or want something thats relaxing, watch Sora no Method. A great show? No. A shit show? No. A Flawed show? Yes. Sora no Method gets a 6/10.\\n\\n",
            "date": "2015-04-09T10:36:00+00:00",
            "helpful_count": 19,
            "mal_id": 185220,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4188619.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JKinky88",
                "username": "JKinky88"
            },
            "url": "https://myanimelist.net/reviews.php?id=185220"
        },
        {
            "content": "Sora no Method leaves an intensely illuminating image in the mind, reflective of the deep and abiding memories of its lead character, Nonoka. Sora no Method's visual splendor is like the prettiest fireworks in the sky, lighting up faces and hearts for both its characters and the show's viewers. This is one anime show that is both beautiful to behold, as well as beautiful in its emotionally resonant treatment of friendship, hope, family, and struggle against the corrosive effect that the passage of time can have on all three. \r\nHowever, as strong as Sora no Method's heart and artistry is, its story can tease andbewilder at times, even though it is not particularly complicated. I would recommend this anime to anyone who is a fan of Key-related anime works, as well as to fans of the AnoHana anime, but I do want to prepare you for some of the show's weaknesses.\\n\\n\r\nThe story often has an air of magically mesmerizing mystery about it. At its best, it can prove enchanting and engrossing. But at its worst, it can leave you raising eyebrows over the actions and choices of its characters.\\n\\n\r\nI found the characters to be very likeable, and well-actualized, but there are at times a questionable inconsistency to them. Their choices and emotional attachments sometimes fail to come across well, and it's often only later and in retrospect that they start to make more sense. So this is an anime that demands a certain type of patience. Not in a basic pacing sense, as I didn't find the plot overly fast or slow, but rather when it comes to how you approach the characters. \\n\\n\r\nThe characters develop gradually, meticulously, and sometimes in a \"2 steps forward, 1 step back\" sort of way. At times, they can be exasperating, and this can undermine the effectiveness and sense of flow to the story. \\n\\n\r\nNonetheless, the central characters all have a strong sense of agency to them, and it is easy to get caught up in their wondrously whimsical wavering and movement. Noel is of consistent chipper cheer, leaving her name a very fitting one given the well-known holiday that also bears that name. And so she serves as an anchor that keeps the Sora no Method ship sailing straight through the torrential storms of the other character's emotional typhoons and crashing waves. \\n\\n\r\nThe high-spirited yet also high-strung Yuzuki often amuses, and the relationship between her and her brother is one of the more realistic sibling relationships I've seen in anime in recent years. \\n\\n\r\nShione provides an edge and sharpness to the show that helps provide a good balance to its syrupy saccharine sentimental aims. She can exasperate or even infuriate in her worst moments, but those moments are probably essential in giving the otherwise straightforward story the momentum it needs.\\n\\n\r\nKoharu is the pleasant poised peacemaker, who's generally gentle touch is supported well by a touch of iron within. She has her moments of weakness, to be sure, but her softness speaks soundly of a good and reliable friend. \\n\\n\r\nThen there is Nonoka, who's dauntless determination infuses the show with a swiftly sprinting synergy of powerful and vibrant character relationship dynamics. Nonoka is a well-balanced lead character that I found very easy to like and cheer on. \\n\\n\r\nAnd it is because of exquisite emotional engagement, that I feel comfortable in giving this show a very good rating in spite of its narrative weaknesses. If you're looking for a thrilling or thought-provoking show, then this might not be the best show for you. But if you're looking for something strongly spirited, an aspirational adventure that slowly grows under the glimmering lights of a saucer above, then this is one show that I think you will heartily enjoy.",
            "date": "2015-06-04T19:03:00+00:00",
            "helpful_count": 17,
            "mal_id": 189559,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/431448.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Triple_R",
                "username": "Triple_R"
            },
            "url": "https://myanimelist.net/reviews.php?id=189559"
        },
        {
            "content": "This show is probably one of the most underrated show of the Fall 2014 season. It is a shame that this show is going to be lost with the others of its genre. This show falls victim to the \"don't judge a book by it's cover\" scenario where at first glance, it seems like a typical moe-blob show with hints of melodrama, but it grows into something much more than that and tries it's best to differentiate itself from the rest of the shows this season. Sure it is no Fate/ Stay Night UBW or Parasyte, and it isn't even close to being compared toclassics like Kanon or Anohana, but with the right mindset, this show can easily stand its own ground.\\n\r\nThe main problem I keep hearing about this show is that it's \"too melodramatic.\" Lets be honest, without a little drama and character conflict, this show will still get ripped on either way. The story itself starts off with a very solid premise with some shaky execution problems along the road. It should be noted that this show is really character driven, and if you hate one of the characters, the story might drag for you. Our MC Nonoka just moved into her childhood town where she reunites with some of her childhood friends. However, it might not be as easy as it seems as her friends drifted apart due to the presence of a saucer hovering over the cit, a saucer summoned by them when they were little 7 years ago. From there, Nonoka meets with Noel, a girl of unknown origin, and with her tries to reunite with her friends as they were before the saucer came in. The story itself isn't perfect, and it can be quite predictable at times. There are even some questionable moments such as \"why isn't the government doing anything about the saucer\" or \"is a certain character's reason for hatred towards the saucer justifiable?\" If we stand back and look at the story for what it is, a coming of age story about old friendships and new relationships, the story is quite bearable and delightful to watch.\\n\r\nAnother plus of the series is sound and art/animation department. The art style is really, how should I say, bright, cheery, and beautiful. The animation, for the most part, is pretty solid, it gets the job done. The soundtrack is quite well done. All the pieces compliments the scenes it was played too, setting the mood right, whether it is really sad, or really hopeful. The OP and ED songs are relatively good compared to shows of this genre. The OP is good but whether you want to download it \"legally\" is up to you. The ED on the other hand is agreeably great and definitely worth listening to outside the show.\\n\r\nIf there are any flaws in Sora No Method, and there are quite a few, it's the character department. Although some Characters. such as Shione, Nonoka, and Yuziki, had some decent character development and back story, some really didn't get any, like Nonoka's dad or Souta. If there is one character worth mentioning, its the shows mascot, Noel. Noel, in a nutshell, is \"THE MOST ADORABLE CHARACTER THIS SEASON!!!!\" Jokes aside, Noel played her part well. By that, I mean being the adorable girl everyone wants to hug and be around. Although her role in the story is somewhat disappointing as the main plot device revolves around her and the show hardly focuses on her and focuses more in Nonoka and her struggle to conform with her friends. Speaking of friends, some of her friends motivations for disbanding and conflict are somewhat shallow and could have explained upon more or at least portrayed better. There are seriously moments where you just want to facepalm and slap a certain character. Although it really didn't happen, what they all became in the end was really satisfactory and worth the journey.\\n\r\nSora No Method, sadly won't be remembered this season, besides that it is the \"moe-blob\" of this season. But it is just so much more than that. By the end of the series, I walked away really happy, and would love to see some more Noel cuteness and adorableness. This show is worth trying out as it is a good breather away from those adrenaline pumped action shows and hyperactive comedy/slice of life shows.  If you are looking for the next Anohana, steer clear away from this anime as it would leave you disappointed. But if you are looking for something different in the moe supernatural genre, check it out. I really hope this anime gets noticed more as it easily falls into one of my favorites this year.",
            "date": "2014-12-28T23:42:00+00:00",
            "helpful_count": 15,
            "mal_id": 174949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3468953.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AwesomeDudex3",
                "username": "AwesomeDudex3"
            },
            "url": "https://myanimelist.net/reviews.php?id=174949"
        },
        {
            "content": "Sore no Method – “That’s what I’m here for, to grant your wishes”. A simple and innocent story of a girl just trying to reconnect with all her friends so that they may all smile together again. Except it is much more than just a friendly story. It moves you in ways that you cannot explain. Emotions swell within you yet, these emotions cannot be distinguished from happy and sad. It becomes hard to differiate between heartbreak and heartwarming, or that the tears upon your cheeks are from joy or sorrow. Sora no Method takes all of these feelings and blends them together into thehappiest sad anime of the year.\\n\r\nStory – 7\\n\r\nNonoka is returning to her hometown after being in Tokyo for seven years. Although the town itself hasn’t changed much the attitudes and tourists have, because now there is a giant saucer hovering right over the middle of the lake. As Nonoka starts her new life she goes back to school. Luckily she ends up in the same class as most of her childhood friends unfortunately, she forgot about them after being gone for so long leading to some of them becoming mad at Nonoka for forgetting them.  Later as she returns home to start unpacking more of her belongings she finds Noel looking through the items, and in Noel’s hands is a picture of Nonoka’s late mother with its glass covering broken. Infuriated at the thought that Noel broke this picture she yells at Noel to leave, its not until her father returns and tells her that the picture was already broken while moving that Nonoka realizes the mistake she had made. As she desperately searches around the town for Noel she remembers a promise she made to Noel before she moved away. Nonoka then runs to the abandoned observatory, there she finds Noel and apologizes. Only to have Noel say it was ok and that after Nonoka fulfilled Noel’s wish of her returning, that it was her turn to make Nonoka’s wish come true.\\n\r\nThe story can easily be described with two words: melodramatic and moving. There are tons of forced drama in the first few episodes with everyone but one of her ex-friends holding a grudge. Slowly yet surely Nonoka with the help of the ultra-cute Noel becomes friends with almost everyone. And that basically ends most of the forced drama. The last few episodes are beyond moving. The story has such a beautiful meaning and delivery no one cannot help but feel their heart getting pulled upon, and for a few tears of both joy and sorrow roll down their cheeks. With a final ending that will just melt your soul.\\n\r\nCharacters – 7\\n\r\nNonoka only wants to be with friends again. She is a slight tragic character in the beginning with everyone blaming her for the saucer that came and changed their lives. Through it all though Nonoka never breaks, she does get beaten back especially when trying to sway Shione to forgive her. Luckily she is always helped by the wonderfully adorable Noel. And to get it out of the way: Noel is the most adorable character this season. Now I’m sure you’ve heard others call her that too and think she’s just become an overhyped loli who does a few cute things but nothing more. Instead Noel is one of the most dynamic characters of the story. Always working hard to bring everyone together with a smile, and while all the other characters might break down and cry Noel never once stops smiling. It’s unfortunate that the other characters, apart from Shione who only comes into herself in the final moments of the season, are somewhat bland compared to the developments that Nonoka and Noel go through. But that still makes them solid characters while not as important or entertaining each can easily hold their own throughout the story and all make important contributions.\\n\r\nFor the most part Koharu never holds any grudges against anyone, and actually blaming herself for the falling out of Yuzuki and her brother Souta before the events of the story. She never makes a large impact on the story but constantly keeps pushing everyone to be friends. The Mizusaka twins, Yuzuki and Souta, are two very different characters. Yuzuki is very active in both fending off Nonoka’s early attempts at befriending her, but then adamantly trying to sway Shione into becoming friends once again. While her brother Souta really is not much of a character as he stays in the background making sure the girls don’t hurt themselves. Shione is actually a difficult character to describe as she is almost two faced. She refuses to talk to Nonoka and even threatens her at points, but at the same time acting like a big sister to Noel. This relationship goes until the very end of the series and because of key spoilers I won’t discuss the matter to that point.\\n\r\nArt/Animation – 9\\n\r\nIt’s stunning. A very simple yet elegant art style perfectly matches the innocence of the characters and story. Beautiful background shots are used everywhere. The animation looks exceedingly good whenever they put they use the saucer as something to draw on. Also the final scenes are so beautiful and smooth the art itself was one of the reasons that it evoked so much emotion.\\n\r\nSound – 8\\n\r\nSimple and innocent, the ever going theme to describe this anime. While they can’t stand out from the anime itself the beautiful background music enhances every key moment and just makes you smile. The OP and ED are very cute sounding and some of my favourite’s of the season.\\n\r\nEnjoyment – 8\\n\r\nThe anime easily had its ups and downs. Over the course of the season it was unfortunate that this show was one of the first I would “save” until next week to watch. Until the final few episodes it was a basic slice of life, yes we saw an over-arching story and really good characters. But nothing made me think “You know I really need to watch Sora no Method this week” and it is just that unfortunate that is what the genre has us do. Now luckily what happened is that I pushed it back so much that I ending up marathoning the final four episodes which is actually something that needs to be done. Because it is these four episodes that everything comes to light, everything comes together, and everyone smiles.\\n\r\nOverall – 7.93\\n",
            "date": "2015-01-05T18:04:00+00:00",
            "helpful_count": 8,
            "mal_id": 176413,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=176413"
        },
        {
            "content": "I finally got around to finishing this show, and I'm glad I did. It reminded me a lot of Nagi no Asukara or Glasslip, as all three are very heart-warming and relaxing. The opening and ending are both equally enjoyable. All of the main characters were very well written, and the story really sticks with me. I was surprised with how much better it got in the last two episodes. Shione is such an important character. The last episode must have given me chills 100 times, and I even teared up there when Shione was looking at the papers to enroll in her old school.Overall, I'd definitely recommend this show, and it was very enjoyable to watch!",
            "date": "2015-06-26T23:58:00+00:00",
            "helpful_count": 7,
            "mal_id": 191404,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685632.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nekocyan",
                "username": "nekocyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=191404"
        },
        {
            "content": "I just finished this Anime and I can say that it is underrated if you accept the fact that it’s target audience is skewed to a younger audience.  Basically, it is a show about growing up and friendship.  I selected it just by chance, when I was in the mood for something light and cute.  I must admit that I did during the first few episodes wonder why I was watching it but after a little while the characters started to grow on me and the plot became more interesting.  But it is the last few episodes that make the showworth watching.  The simple seen between Nonoka and her Mom is truly precious and the lesson about the impact a good friend can have on our life is heart warming to say the least.  So if you are in the mood for something simple and cute which is targeted to a younger audience then you may want to give it a try.",
            "date": "2018-09-17T10:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 289251,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5886051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rick57",
                "username": "Rick57"
            },
            "url": "https://myanimelist.net/reviews.php?id=289251"
        },
        {
            "content": "If this series were longer and didn't have Noel in it, I would not bother trying to force myself to just get this over with and then watch something else. Along with Sword Art Online, this was one of the most aggravating shows I have ever seen. Is it just as bad as SAO? Actually, no, not really, but if you decide to watch this show, be prepared for 13 of illogical nonsense.\r\nStory: 5/10.\r\nWe have a mysterious cute girl and a group of old friends that fell apart and was eventually brought together with the help of that mysterious girl... does that sound familiar? Ah,right, AnoHana. I cannot stand tearjerkers, but I did enjoy that show for some reason. This, however, does not feel like a weak attempt to repeat AnoHana's success. In fact, it does not feel like anything. It's not good, it's not bad, it's one big nothing. Nothing much happens as the conflict feels forced and ridiculous, characters demonstrate nothing but ineptitude and inability to solve simple problems.\\n\\n\r\nArt: 7/10.\\n\r\nArt is pretty, although it is not unique and you've probably seen better than that. It's not off-putting, but, if you do not like cute moe art styles, you might not enjoy watching big-eyed cute girls who do not even have any redeeming qualities and their ordinary character design cannot make up for it. But the scenery is impressive. But, unfortunately, a pretty picture cannot save a poor plot, I always say so.\\n\\n\r\nSound: 4/10.\\n\r\nPretty forgettable, there's not much to be said about it.\\n\\n\r\nCharacter: 2/10.\\n\r\nNoel is the reason why I decided to give this aspect 2 and not 1. I loved her, I loved how cute and adorable she was, refusing to give up and genuinely caring for the rest of the cast that did not deserve it. But one character is not capable of saving an entire show from going downhill.\\n\r\nNonoka is annoying. So annoying that I was cruel enough to enjoy scenes in which characters were so done with her they couldn't help but slap her. I admit that it is important to solve conficts, especially if you mess up, but Nonoka keeps forcing herself onto her ex-friend despite being told to get lost again and again. I get that there are times when people have to be assertive, but if somebody keeps telling you to leave them alone and nothing changes, I think it is better to follow this piece of advice.\\n\r\nShione is this quiet and oh-so-independent cold girl. Normally, these characters do not get on my nerves, but Shione's behavior and attitude are beyond unacceptable. Yes, I think that Nonoka should have left her alone, but that does not mean that Shione is on the right side of the conflict. She is not because it feels like she does not even want to try to solve a problem, running away from it and putting on a cold facade, enjoying her miserable and resentful role way too much.\\n\r\nThe Mizusaka twins and Koharu were pretty forgettable, but they are nowhere near as annoying as Nonoka and Shione.\\n\\n\r\nEnjoyment: 4/10.\\n\r\nOnce again, I wonder why 4 out of 10 is considered decent. I almost dropped this show because of a ridiculous conflict that could be solved in one or two episodes at best. If it weren't for Noel, this show's only interesting and, most importantly, adequate character, there would be nothing to look at.\\n\\n\r\nOverall, this is an average and pretty forgettable show and you find it hard to genuinely care for any of the characters (except for, maybe, Noel in my case, it's all subjective). I've seen worse and it's not exactly a disaster, but it is very boring and slow. And I don't know which is worse: a bad show you can drop or a series you watch just because you hope it will eventually get better, but it doesn't.",
            "date": "2017-05-16T07:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 247830,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5260988.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Waffle_Empress",
                "username": "Waffle_Empress"
            },
            "url": "https://myanimelist.net/reviews.php?id=247830"
        },
        {
            "content": "Sora no Method, or Cosmic Method, was a show that, when airing begun, didn't really attract much attention, but for the people that have watched it or plan to soon, this show is a very lighthearted slice of life that won't blow your mind, and it certainly won't resonate with everyone, but for what it's worth, i'd say it did it's job pretty well. \r\nStory - 7\r\nThe story isn't incredibly groundbreaking, but one word that i feel can be used quite effectively is unique, the story follows Komiya Nonoka, a girl that, at the best of times, is quite inspiring, and at the worst, annoyingas hell. She has moved back to her hometown where a saucer occupies the sky. The saucer was called by Nonoka and her friends when they were kids, and now Nonoka embarks on a emotional journey with her childhood friends, as they all become more and more entwined with the saucer and the mysterious girl that came with it. \\n\\n\r\nArt - 7\\n\\n\r\nNothing amazing in the art department, Animation had a really nice water colour look to it in my opinion, and the hair of almost every character was something i really liked looking at, the eyes however, not really, i like big eyes as much as the next guy but i don't know, something about the lighter shades at the bottom half of characters eyes just didn't look very nice to me, but then again, i am a picky person when it comes to eyes. Everything else was so-so, as aforementioned, nothing amazing, but it certainly isn't bad to look at.\\n\\n\r\nSound - 8\\n\\n\r\nBeautiful ED, pretty good OP, music in episodes was average, what you'd expect from the kind of show it is. That ending theme though, god that was great, I know a lot of shows do this but when I heard the start of the ED fade in at the end of each episode i got a little excited and, well, tried my best to sing along (we all do it, don't try to deny it). The OP was alright, I don't think it really displayed the right sort of scenes at time though, like when Nonoka runs onto the wharf, and turns around to see Noel, her face drops into despair it looks like for a second, i don't know, maybe it's just me but i found sometimes the OP didn't really fit the cheery song sometimes. \\n\\n\r\nCharacters - 7\\n\\n\r\nMost of the characters in this show were your averagely generated attitudes and personalities, you've got the stubborn one (Shione) the energetic one (Yuzuki) the nice one who accepts everything (Koharu) and the one who seems like they don't care but they really do in the end (Souta). As much as my descriptions might not be top notch, that's how i saw most of the characters, not to say that in a negative manner though, i enjoyed the dialogue between most of them, expect for Shione and Yuzuki being absolute bitches to Nonoka at first, that annoyed me a little. \\n\\n\r\nEnjoyment/Overall - 7\\n\\n\r\nOverall this was a very lighthearted show with some magical aspects about a group of friends going through what friends go through, mix in a cute loli with blue hair who is just the god damned cutest thing ever, i mean come on, Noel carried the comedy in this show, and you've got yourself an upper average slice of life that gives you a warm feeling with each episode, a smile at the nice ending and enough cutesy dialogue to make you see it through to the end. \\n\\n\r\n~Xeno156",
            "date": "2014-12-30T00:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 175165,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3628979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xeno156",
                "username": "xeno156"
            },
            "url": "https://myanimelist.net/reviews.php?id=175165"
        },
        {
            "content": "My simple review of Sora no Method.\r\n-------------\r\nArt: 9\r\nThe most redeeming quality Sora no Method offers is the extraordinary art. If you enjoyed the art in Nagi no Asukara, the color scheme and visuals are similar, though NagiAsu does it better in my opinion. \r\n-------------\r\nSound: 8\r\nThe second most redeeming quality is the ost and voice actors. The music was catchy and beautiful and the vice actors did amazing in their roles.\r\n-------------\r\nNow Story and Characters, where the series fell flat on their face.\r\nStory: 4.5\r\nStory was a decent setup but it delivered poorly without answering numerous questions and having too many plot holes to count. It really isa shame because they could've done so much with the set-up.\\n\r\n-------------\\n\\n\r\nCharacters: 5\\n\\n\r\nThe character designs are cute and unique but the personalities of these characters are bland and their actions hardly ever make sense or are even logical. Noel was the only decent character even though she was a typical moe blob copy.\\n\r\n-------------\\n\\n\r\nEnjoyment: 6\\n\\n\r\nI enjoyed this series as a viewer but as a reviewer I can see why it can be disliked. \\n\r\nBUT I don't think it deserves less than a 3 because the series had a lot of positives you cannot deny like the ost, voice actors, art, and character design.\\n\\n\r\nOverall: 6.5",
            "date": "2016-03-28T11:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 214548,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3590109.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Thnx4dafood",
                "username": "Thnx4dafood"
            },
            "url": "https://myanimelist.net/reviews.php?id=214548"
        },
        {
            "content": "Now, I can't just ignore an unusual show like this and say nothing.\r\n---First, let's examine the genre.\r\nSora no method, at first, it is said to be Slice of Life and Sci-fi. That's actually an interesting mix. And with that cute character? Seriously, that's how I start to watch this show.\r\nBut the unusual part of this show is here. After one or two episode, you will notice that there's a hint of mystery here (surprised?). Not really suspenseful, though. But it will keep you tilt your head. You will be constantly pondering questions like: \"why she's like that? why she want that? why she do that?why she didn't do that? what's happening here?\" Yeah, and you can only keep watching this show, bearing all the boredom, just to know the answer. Perhaps it could've been great if only executed better. So is it worth as mystery? not as far as that. \\n\r\nSo how good is the slice of life part, then? Well, to tell you the truth, I don't think it's slice of life of any kind. True, there's some part where you see cute girls doing slice of life things, but I think that is pretty common even in non-Slice of Life anime, especially anime nowadays, right? Rather than that, mostly you will often see a lot of people crying around people's relationship. So it's more like drama rather than slice of life, correct? So is it drama? Neither. How should i say? Even when the characters are in uptight situation, it doesn't feel uptight enough. You see people crying, there's no slice of life scene there, but the atmosphere still feels relaxed enough, even made you sleepy. Strange, huh? Don't even ask whether this show will make you cry or not. I really doubt that. \\n\r\nSchool? Well, I will say it's OK. they are students, and there's some club activities. \\n\r\nSo what about the sci-fi part? Hmm... You can't say it's sci-fi just because there's UFO in the show, right? I mean, there's nothing scientific at all. The show doesn't even tell you where the instruction to call the UFO came from, or explain any background explanation worth to be sci-fi. They just somehow have it there from the first place. That's all. If we are in literature, it's more like a touch of magical realism rather than sci-fi. But it's also not even close to be a fantasy, as the only magical thing in the show is just that crystal UFO hovering above the town. \\n\r\nAnd so, i'm sure this part where Sora no Method doesn't succeed on bringing the merit of any genre, is one of the reason why this show is not popular.\\n\\n\r\n---Next, let's see the story. Don't worry. No spoiler here. Maybe just vague minor spoiler. But still, skip this part if you want.\\n\r\nSora no method is about a group of a friend. They're very close in the past. They had a special place to gather and play around. For some reason, they started to be separated. Several years later, when they finally meet again, they are having cold shoulder to each other. Apparently, there's a mysterious incident in the past which makes them troubled. At first, it appears as if a certain someone is the one who's supposedly to blame. But actually, every each of them is secretly hiding something related about the incident. This show will be about those group of friend trying to fix their relationship and strengthen their friendship with the help of a not-so-human cute girl. But unfortunately, if that really come true, something bad might happen. \\n\r\nWait. \\n\r\nSounds familiar? Yeah. While the other named AnoHana is a so-called masterpiece of tearjerker drama in anime world, this one called Sora no Method is not so popular. \\n\r\nNow, please note that the story I sum up above is just the big plot or main point of it. It doesn't mean Sora no Method is very much similar with AnoHana. Nope. The overall detail of the story will be very different. I mentioned AnoHana just to give you a better idea on the story of Sora no Method. If I may say, compared to AnoHana, Sora no Method has more positive vibes in it and much more relaxed feels. I will not spoil anything. \\n\r\nWhat else is different? The ending. Again, I will not spoil anything so watch it yourself if you want to know. It might not like what you expect.\\n\r\nThe problem in the story is: it is boring. The execution is bad. The conflict cannot pull you in. You might even ask, why I even watch this? \\n\\n\r\n---Then, what's good about this show?\\n\r\nThe Art. \\n\r\nAfter watching it, the character design doesn't really stand out to me (maybe just those twin brother and sister)\\n\r\nBut what's really stand out is the scenery, it's so beautiful. I really like the sunset, the lake, the monuments, the mossy observatory, the sunflowers, the meteor shower, and the sunflowers in the final episode. And especially, in one of the episode, you will see the most beautiful UFO ever! So gorgeous it will give you chills!\\n\\n\r\n---What about the music?\\n\r\nWell, expect something sweet and beautiful from 'fhana'. If I could describe the music in a scenery, it will be like watching glittering star in a beautiful night sky. That kind of feeling.\\n\\n\r\n---So, is it worth watching?\\n\r\nOnly if you have time to waste. Or maybe if you need lullaby or some boredom in your fast-paced insomniac night.\\n",
            "date": "2016-04-22T06:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 216879,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5151059.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Reiraku",
                "username": "Reiraku"
            },
            "url": "https://myanimelist.net/reviews.php?id=216879"
        },
        {
            "content": "So I might be a little too harsh in my review on this, but regardless it is still how I feel. I originally dropped this anime. I was just done with it, but I wanted to give it another chance. I was unfortunately let down. So positives. The setting is interesting for a short little series. Not overstay its welcome. The art work is ok, and honestly these two things are the things that bring me in. They did a decent job on this part. Now the negatives. The character and the story is so boring and stale. Most importantly stale. Even a bad storyis enjoyable. It is something to laugh at, and mix in the weirdness of anime to a bad story for a laughable story. That is the opposite of this anime though. There is just a bit too much vagueness to this anime. The character to me doesn't really have too much motivation to do anything. It seems like she just did this stuff because she has nothing better to do. It feels like that if this saucer that nobody really questions, and honestly just becomes part of their commute. Is the thing that is driving the story. Which would be ok. If the story just wasn't so bland, and extremely predictable. To date this is the most two dimensional anime I have ever seen. It has a great idea, and aesthetics. It just poorly executes it's possibly interesting story. So I definitely not recommend it.",
            "date": "2017-06-24T21:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 250940,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3490275.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/SakaRaki",
                "username": "SakaRaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=250940"
        }
    ]
]