[
    [
        {
            "content": "I went into this show with a lot of hope. There have been other recent anime influenced by the work of Edogawa Ranpo that have been pretty enjoyable, namely Rampo Kitan: Game of Laplace and my favorite dumb anime from the 90s Kindaichi Shounen no Jikenbo, so I was really pulling for this one to at least be fun. It didn't even have to be good, just in some small way enjoyable and then I would've been IN. \r\nThen I watched the first episode of the show, and at the end I said to myself, \"Well that was kinda boring and lackluster, but I betthe next one will be better.\" Upon the next one being pretty much the same, the writing on the wall was becoming pretty clear. It has, unfortunately, been chugging along at the same level of bland for the past 7 episodes. Until this point, nothing had been unforgivable, I simply couldn't bring myself to care about it. And then episode 8, when I said, \"F this show for REAL.\"\\n\\n\r\nI don't know if they knew they had a stinker on their hands and pulled the entire animation budget, or if they simply didn't give any more of a crap than I did at that point, but all of a sudden what was once simply disappointing suddenly became catastrophic. Without exaggerating in the slightest, it looks like they couldn't even be bothered to finish. There are a few moments that look like they just colored the story boards and skipped everything else. \\n\\n\r\nI would review the characters and story and all the rest, but there are none. They didn't bother. You shouldn't either. If you want something dark and mysterious in the vein of Agatha Christie or Conan Doyle, or more to the point Edogawa Ranpo, watch either Ranpo Kitan for a more direct adaptation or Kindaichi for some dumb fun. Plenty of other mysteries like The Perfect Insider, Erased, Higurashi, or literally anything else with the \"Mystery\" tag will be more entertaining than this. \\n\r\nI'm not mad at this show, it just makes me sad. Which is kind of the worst.",
            "date": "2016-11-21T21:37:00+00:00",
            "helpful_count": 80,
            "mal_id": 234167,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983772.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jRad522",
                "username": "jRad522"
            },
            "url": "https://myanimelist.net/reviews.php?id=234167"
        },
        {
            "content": "Well about the anime Trickster\r\nDon't know what to tell you the anime at the start looked promising but after few episodes it has become boring and stupid nothing interesting happened,it's not worth watching....\r\nThe start was really good I thought gonna be a good anime since Kobayashi appear an immortal guy,and he wanted too die I was excited ,the 1st 7 or 8 episodes were ok really good to be honest,but after that it lost everything the story droped,nothing interesting,just boring conversation and some stupid mission and so it goes to the end....\r\nThe end is absolute crap...\r\nIf you want to waste your time go ahead:D                   \\n\\n\r\n- Story Boring\\n\r\n-Anime Characters nothing special\\n\r\n-Kobayashi immortal dude that wants to die\\n\r\n-Rest bull sh*t\\n\\n\r\nThe story maybe 4/10\\n\r\nArt style 3/10\\n\r\nSound 4/10\\n\r\nCharacters 4/10\\n\r\nEnjoyment 2/10\\n\\n\r\nI gave it a 5 still considering it's maybe to high rated for myself there are many animes with much better stories and fights and rest \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-27T15:43:00+00:00",
            "helpful_count": 38,
            "mal_id": 243726,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4502091.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Akuma_X",
                "username": "Akuma_X"
            },
            "url": "https://myanimelist.net/reviews.php?id=243726"
        },
        {
            "content": "I have never written a review before, but the injustice this show suffers made me want to actually write one.\r\nI binge watched this show in less than two days and it was a roller coaster ride the entire way! I have seen hundreds of anime by this point and I honestly have no idea why so many people hated on this show.\r\nI love any work having to do with the Boys' Detective Club or Edogawa Ranpo, and this series did an excellent joke of drawing the audience in, keeping you interested, and appreciating it right to the very end.\r\nWas it perfect? No, but what isnowadays? Did it have a great, coherent story line, well developed characters, thrills, spills, and chills? Heck yeah!\\n\\n\r\nI've been really disappointment with the reviews of many shows lately. Shows that had amazing reviews turned out to be utter trash, and shows like Trickster, having awful reviews, turned out far beyond my expectations.\\n\\n\r\nIf you aren't sure about watching... Give it a go and see if you like it for yourself!!!",
            "date": "2017-04-16T16:02:00+00:00",
            "helpful_count": 31,
            "mal_id": 245663,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447214.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tasha1313",
                "username": "Tasha1313"
            },
            "url": "https://myanimelist.net/reviews.php?id=245663"
        },
        {
            "content": "Trickster is right!, as in this anime tricked you into watching this borefest.\r\nWell LA will be quite honest here...from the eyesore of Soul Busters, to the utter lull of Bloodivores...Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori was LA WORST anime of Fall 2016 and had rightfully gained that title. So want to know why?...let's dive into it shall we?\r\nBefore getting to the flaws of Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori, let's at least see LA giving \"praise\"...though there's not gonna be much. For what the one-episode mysteries Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori brings out, some are interesting, no not intriguing or anything but the earliestmysteries were pretty weird or the resolution is at least funny enough. Next strength would be Nao Nakamura voiced by Azusa Tadokoro, a police detective. She is LA's favourite character and you'll know why later on when LA covers the flaws section, the only other character LA had an inkling of interest would be Makoto Noro voiced by Ibuki Kido the hacker of the Boys Detective Club. In terms of plotlines, Akechi and Twenty Faces connection was intriguing to LA which later gets wrecked majorly...but that later. Lastly, the anime voice cast is \"ok\" at best but LA does have to say that GACKT as Twenty Faces was sorely wasted potential and he could have been in something better than this.\\n\\n\r\nOk, let's get to this, there's alot of elements within Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori that annoyed LA all throughout the anime, be it sooo bad it's good or just annoyingly horrible. Let's start with the characters. The majority of the characters are god damn emo edgelords, Yoshio Kobayashi voiced by Daiki Yamashita is an immortal with inconsistent powers used to convenience the plot whenever it wants and doesn't care about anything or anyone besides his own death, Kensuke Hanasaki voiced by Ryota Osaka was a hyper-genki and really annoying main protagonist and probably even worse when he gets \"character development\" and turns into a depressing wreck, these two characters are the primarily focus of the anime, let's not even get started on the rest...with Kogorou Akechi voiced by Daisuke Ono the leader of the Boys Detective Club and sure his backstory is interesting, but what he does for the plot is nonsensical or expects Hanasaki and Kobayashi to deal with it....what a nice leader. Twenty Faces voiced by GACKT is a poorer version of Shoko Makeshima from Psycho Pass and his motivations and goals clashes greatly with the entire anime throughout (as LA said...GACKT is wasted potential to this anime but GACKT's theatrical vocals did put a smile on LA's face once in a while). Ryou Inoue voiced by Yuuichirou Umehara and Tasuku Yamane voiced by Yoshitaka Yamaya, Hisa Ootomo voiced by Makoto Furukawa all members of the Boys Detective Club do get an arc or an episode for character development respectively but they ultimately become active spectators or forgotten after their development finishes. As LA said in LA's strength section, both Nao Nakamura and Makoto Noro were LA's favourite characters only because they don't get caught up in Kobayashi, Hanasaki, Twenty Faces and Akechi's stupid mess...though Makoto Noro DOES get caught up in it but through the bridge bunny if anything...as for Nao Nakamura...she's \"was\" a badass that doesn't give a crap and just wants to do her job with the assistance of the Boys Detective Club...until the near final episodes of the anime where they absolutely RUINS her character...way to go Trickster, your stupid cliche writing even could destroy the best character of the anime, good plot twist and all, but her impact is just as eye rollingly annoying just to be thematically \"deep\". With these kind of characters...the interest to this anime wanes...the plot?...makes it even worse. \\n\\n\r\nThe plot in the earliest follows a one-shot-episode each mystery with the underlining goal of Hanasaki promising to kill Kobayashi where the mysteries were ok at best bringing in something of a double-edged side in looking at a mercenary-type detective club and the consequences it might entail...BUT is utterly annoying as soon as the topic of Kobayashi killing starts again and again and again, it's not until Hanasaki's character development or REGRESSION that it starts to \"kick off\" the anime. Hanasaki's character development felt both forced along with Hanasaki acting like a god damn idiot and what with Twenty Faces trying to be like Shoko Makeshima but not as great as him into brainwashing. Then by the half way point essentially Kobayashi and Hanasaki's roles are reversed and we learned more about Akechi and his connection to Twenty Faces, this is the time when the anime tried to redeem itself...then it utterly destroyed it with Kobayashi's backstory arc...and his backstory is as obvious as it gets and the ever annoying as they keep dangling the carrot when you already have it in bulk for. Plot twists DOES like to be theatrical in some sense...but for what they did on theatrics they substitute with common reasoning (partly with characters' denseness as well).\\n\\n\r\nOhh and can we talk about Kobayashi's inconsistent powers, namely his immortality. His immortality is one of the most infuriating and annoying things in the anime. One, is the fact that his immortality powers won't allow him to die to the point of him TOUCHING anything that might kill him will immediately explode...even hot water. Second is that even after his \"important backstory on how he got his powers\" his powers just get even more inconsistent as now his powers allows him to get hurt....wait what?, even little sharp stones can cause him to bleed even though his immortality was suppose to PROTECT him from dying yet he nonchalantly walks off WALKING ROBOT TURRET BULLETS like it's nothing. (To get into LA's headspace for the inconsistency, what would of happened if his immortality stopped like how the little stones managed to touch and caused him to bleed a bit, then shouldn't Kobayashi be A BIT fearful of his life instead of just walking in front of a mecha turret fire. UMM HELLO!?!??!, again Trickster's constant wanting the grand theatrics over common sense.). Finally, LA is gonna say the obvious, but because he's a OP IMMORTAL being, his battle scenes, hell ALL of his battle scenes immediately destroys any battle tension as we KNOW he'll NEVER get killed (post or pre-imporant backstory), again like Tatsuya Shiba from Mahouka Koukou no Rettousei, this is kinda what happens when you have TOO OP main protagonist...only Kobayashi doesn't have any of Tatsuya's badassness and to be replaced with constant angst and annoyance. Yes LA thinks Kobayashi is an emo asshat all throughout the anime, his powers is just a major factor of annoyance to it all.\\n\\n\r\nFor villains sake, Twenty Faces for being such a mysterious figure having a connection to Akechi and even his involvement to Hanasaki...he's a VERY relaxed villain that doesn't actively does anything to the plot unless the plot tells him to, sure he even orchestrated some of the one-shot mysteries at times (as LA said poor vers. of Shoko Makeshima) but it ultimately leads to an anti-climax (though hilariously stupid) what with Hanasaki's regression. The only thing that made LA a bit interested in Akechi's backstory in connection to Twenty Faces but that's about it as he just disappears after that until the final arc.\\n\\n\r\nThe animation done by TMS Entertainment is decent at best, derpy at worst to say the least, the best praise LA can give the animation is the character designs. Due to this being a 24 episode anime, the animation tended to dip by the latter half though with lots of derpy or lower quality scenes from time to time, TMS Entertainment tries to up their game when it came to the battles though slightly janky or worse...physics-defying in the weirdest possible way. The animation for LA is mixed but at the same time LA will say that the animation is one of the anime's worst elements of it, especially when the anime starts getting derpy and low quality when it was trying to be serious and \"awesome\" only to make it look funny when it wasn't suppose to and just lazy for no good reason (this especially during the later half of the anime when it just starts not caring and the quality DEFINITELY lowers even when the anime's plot is \"trying\" to go at all cylinders). TMS Entertainment get a hold of yourself, because this is laughably awful and \"trying too hard\" at best for animation and for an anime with lackluster plot and characters, this is one of the elements that kinda NEEDED to land and it stumbled and broke it legs in the process and limps the rest of the way.\\n\\n\r\nAs LA said in the strengths, the voice cast isn't that bad, if anything, it's the material that couldn't keep up with the voice cast and this was just what the voice cast had going for it so LA won't say the voice cast did horrible...if anything, the most annoying voice actors would easily go to both Daiki Yamashita and Ryota Osaka, LA wanted them to emote (but in Ryota's case...emote a lot less) instead of being wannabe emo edgelords and annoying the crap out of LA in the process. Favourite voice actor easily go to both Asuza Tadokoro and Ibuki Kido as they were the most acceptable and less annoying from the voice cast overall, though Ibuki Kido more for default but Asuza Tadokoro felt like she was giving her all through this dirge *cough* *cough* (YES..even more than GACKT and that's kinda saying something).\\n\\n\r\nThe ending...ohh boy, the ending god damn TRIES to be epic on a grand scale, what with Twenty Faces final showdown as well as Hanasaki's promise in killing Kobayashi annnnnnnnd it leads into an anti-climax with the straw that kept breaking this entire ending for LA was Kobayashi's inconsistent immortality powers...it's like the ending wanted to have it's cake and eat it too concerning his powers and bringing in tension which again failed due to the entire showdown of Twenty Faces, HELL...Nao DISAPPEARS after her major plot twist and has no relevance to the final showdown...-sigh-. The ending as anti-climaxed as it is, it ends in a happy front because of course it does just to annoy LA further!?!??!!\\n\\n\r\nTrickster: Edogawa Ranpo \"Shounen Tanteidan\" yori is without a doubt for LA, has an identity crisis mainly focused on our diametric opposite main protagonists Hanasaki and Kobayashi, to make it worse, the lazy and confused naval gazing character development that either means nothing in the long run or has no impact to the plot at large though not all the time as some of the minor characters development are interesting, LA just wished it could have been injected to Hanasaki and Kobayashi, the animation that is janky at worst, ok at best but ultimately fails in the end making it lazy and inconsistent even when it goes all out. Plot twists that occurs have more focus on theatricals sense than common sense, villains are effectively pawns to a bigger villain who ultimately doesn't actively does anything unless the \"plot says so\" when he could have used his theatrical mood to lighten up the emotional hostaging by Hanasaki and Kobayashi and mysteries by majority coincidentally link to backstories and are framing devices than anything else.\\n\\n\r\nTrickster: Edogawa Ranpo \"Shounen Tanteidan\" yori LA will say this honestly throughout the 24 weeks LA has been watching you...you were effectively a waste of time and quite frankly a chore to get through for LA's Tuesdays and sure you can claim \"why do you watch it if you think it's a waste of time\"...well LA watched Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori so that LA can find a silver of something good in you and LA did, only to ruin that silver of hope with terrible plot and character progression and not to mention not alleviating the utter boredom, character derailments, janky animation and emotional atmospheric mood hostaging to say otherwise for LA. Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori you DESERVE LA's title of the worst anime of Fall 2016 AND LA needing to put an addendum of LA's Worst Anime of 2016 list as the 2nd WORST anime LA watched in 2016.",
            "date": "2017-03-27T17:53:00+00:00",
            "helpful_count": 19,
            "mal_id": 243736,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=243736"
        },
        {
            "content": "I didn't really come in watching this show with a lot of hope. I didn't except it to be much and it wasn't I simplie watched because I had nothing else to watch. I like the dark and action packed kind of anime, don't get be wrong I did start to get a feel of that at first and got a little excited, but soon I just felt like I was torturing myself in order to watch 1 episode, it just got boring and dull and it seemed like they didn't give a crap about the script anymore. They tried to make the anime funnybut failed miserably it just started to get depressing.",
            "date": "2016-11-22T22:25:00+00:00",
            "helpful_count": 22,
            "mal_id": 234220,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569566.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mariel_Everett",
                "username": "Mariel_Everett"
            },
            "url": "https://myanimelist.net/reviews.php?id=234220"
        },
        {
            "content": "Wow did this show take a bad turn quickly. I actually really liked the premise and the characters weren't bad to begin with but around episode nine this show went into a different direction. Without trying to spoil anything, one of the main characters personality totally did a 180. This character was almost too difficult to watch and the hole time I expected things to get better but it all just  led up to a horrible season finally where nothing was sorted out. Very dissapointing since I thought this series had some potential. If anyone does decide to watch this I suggestion endingat episode eight. Sometimes I wonder if the shows creators actually watch the finished products..",
            "date": "2016-12-20T09:23:00+00:00",
            "helpful_count": 21,
            "mal_id": 235922,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4580242.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ecchi-wow-wa",
                "username": "Ecchi-wow-wa"
            },
            "url": "https://myanimelist.net/reviews.php?id=235922"
        },
        {
            "content": "Trickster was actually an alright show, overall.  It could've been a lot better, but it wasn't a bad show.\r\nThe story is about a bunch boys in the Boys Detective club solving cases they take up.  Hanasaki meets Kobayashi in the first episode, who has a power that prevents him from dying, and it goes on from there into cases being solved, character turmoil, and bunch of random stuff.\r\nThe art isn't really special, but it at least captures the tone of the vents properly.\r\nTheir nothing special about the sound.  I do like the second opening theme and ending theme.  The first onesweren't all that good.\\n\\n\r\nThe character department is kind of a mess.  Kobayashi, Hanasaki, Akechi, and the rest didn't really evolve much during the first half of the show.  They got some development in the second half, but a lot of them were kept off screen  most of the time.  Reducing the character numbers by a few would've helped a bit.\\n\\n\r\nI still enjoyed Trickster, but my enjoyment lessened overtime.  I really liked it at first, but it quickly became just an ok anime due to all the different events being thrown at you in kind of a non orderly fashion. It's not something I'd really recommend, but I won't highly discourage someone from watching it either.",
            "date": "2017-03-27T13:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 243708,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5520188.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AobaSuzukaze",
                "username": "AobaSuzukaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=243708"
        },
        {
            "content": "i don't know why people who doesn't like these genres even watched this...if you don't like these kinda anime series then do not watch this...you don't have to :D\r\ni like these kinds of stories so i started watching this anime and i ended up enjoying this anime X)\r\nstory 8/10 : i liked the story...i love detectives working with weird stuff so i liked the story...main story is about a guy who can't die and he desperately wants to die...another cheerful guy finds him and make him wanna live again somehow :)\r\nthe only big problem was that the stories are not stable enough to be perfect...ifthey could have made it more stable and enjoyable it would have been more popular than this :D\\n\\n\\n\r\nart 9/10:art was beautiful to be honest...the reason of giving this 9 is because i saw a little more beautiful art than this :)\\n\\n\r\nsound 8/10 : i enjoyed the soundtracks :) specially the first opening\\n\\n\r\ncharacters 8/10 :i loved the characters in general but some of them needed more explanations to know them better than this.\\n\\n\r\nenjoyment 8/10 : it was enjoyable to watch this anime for me...i watched the whole 24 episodes in two days...i have lots of anime series that i'm currently watching but after 5 or 6 episodes i got bored but i finished this in two days :D \\n\\n\r\n*personal note*: one true fact that you can learn from this anime:nothing happens if you kill yourself...you are the one who loses your chance to live this life :)\\n\r\ni get that...i do really...but i don't care...life is meaningless without others for me XD\\n\r\none thing that Yoshio realized was this...he got attached to Kensuke so he had something to live for :)\\n\\n\r\noverall 8/10 : if you like a weird detective story with a lot of different characters this anime is for you...go on and try this :D\\n\r\notherwise if you like an anime with beautiful art and soundtrack you can give this a try too :D\\n\r\nif you don't like these kinda stories don't watch this anime :)\\n\\n",
            "date": "2018-11-17T11:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 294232,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7245057.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sepid_96",
                "username": "sepid_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=294232"
        },
        {
            "content": "Most people i have noticed say that Kobayashi is the main even tho it kind of revolves around Sensei and Hanasaki because it drifts into Hanasaki's life with his fathers affection and the whole brother side which then created anoter path in the show which lead to Sensei and 20 Faces fighting at Hanasaki's Fathers company. \r\nWhat im saying is the show doesn't just revolve around one character Kobayashi \r\nKobayashi want's to die\r\nHanasaki is supposed to help him die but gets side tracked by sensei refusing to help his brother.\r\nSensei wanting to be a badass and avoids helping and sticks to boring shi* jobs untilhis bitc boy Hanasaki gets taken by 20 Faces.\\n\\n\r\nYou put to much presure for this show to be good GOD IT ONLY HAS ONE GENRE \\n\r\nMYSTERY NOTHING ELSE NOT ACTION OR SOMETHING JUST MYSTERY.\\n\r\nwe don't know about kobayashi or 20 Faces Yet JUST BE PATIENT!!!!!!!!!1",
            "date": "2016-12-20T11:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 235931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5915384.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CGJAnime",
                "username": "CGJAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=235931"
        },
        {
            "content": "I really tried to keep following it by seeing a huge potential in history. Basically as you know a suicidal boy just can not kill himself because of some mysterious power he has that makes him immortal.\r\nThroughout the episodes you know the important characters that will always appear in the story however they are not anything cool and remarkable. They even try a development of each character in some episodes but that simply does not work, in this story development issue and the basis of it, the script is horrible.\r\nThroughout the anime there are few scenes in which they exploit the boy's power and thelimit he has but there really are few scenes, quite sparse, they coil quite a lot with what I would call \"Fillers\" but these so-called fillers are just attempts at Develop the characters and give depth to them.\\n\\n\r\nThe art of the anime is very good, I can not say for sure exactly what it is but the colors and all the rest of the animation is unique and quite beautiful to see. The soundtrack is so bad and boring that I almost did not notice its existence.\\n\\n\r\nWhat really caught me in this anime is all the mystery that is built around the boy, you can get very curious with questions such as \"What is the origin of this power?\" Or \"Is there any weakness?\" But the scripts throughout the episodes are extremely horrible and I decided to drop by the time I went to watch one afternoon and when I realized I had slept so annoying that I was",
            "date": "2017-02-25T23:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 241407,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4470470.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Philipp-Nunes",
                "username": "Philipp-Nunes"
            },
            "url": "https://myanimelist.net/reviews.php?id=241407"
        },
        {
            "content": "I really enjoy this anime but I recommend it to people who are patient. This is not an anime for a person that likes the story to have a sense from the start. It is for people who like to watch and watch to see how everything is changing and how the MC has his moments but also the other characters. I am a bit angry that the MC is kind of forgotten sometimes but when I started to watch the first episode I would never think that the story will be so different from what I thought it will be. Sadly I wish theycould improve the graphics, it's hard to watch it sometimes. If you don't watch it for the plot or graphics, watch it for the music. It is brilliant.",
            "date": "2017-03-05T10:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 241923,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6031917.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hanabi-sama",
                "username": "Hanabi-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=241923"
        },
        {
            "content": "First time reviewing anything on here but i have to do this show justice and its not getting it with the negative reviews. I have watched this  show twice in a row and honestly its now one of my all time favourites.\r\nThe  main story as well as the subplots are both enjoyable and quite emotional at points and makes all of the characters seem important in someway or another. The main characters are all well written and believable and the case of Kobayashi and Hanasake both have great character depth and development from the start. \r\nMy final comments are that this show endswell leaving and opening for a season 2 which i truly hope it gets and i would say this show is perfect for anyone who wants a great story with ups and downs. amazing characters and/or compelling mysteries \\n",
            "date": "2019-03-19T05:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 303841,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5582011.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NaiMuhinyi619",
                "username": "NaiMuhinyi619"
            },
            "url": "https://myanimelist.net/reviews.php?id=303841"
        },
        {
            "content": "I found this on the \"latest episodes\" list, and watched the first 14 episodes.  Overall, the show simply doesn't seem to go anywhere, and I believe one of the character's attitude mirrors that of the people running the show \"tsk, I don't care\".  The show, as a concept, has potential, but the characters lack depth or even development beyond a very superficial level.  The plot line doesn't seem to exist beyond an episodic nature of solving the case of the day, and getting nowhere closer to actual character development beyond 2-d cookie cutter characters where a swimming pool with no water hasmore depth.\\n\\n\r\n  I'm not sure I'll finish watching the show except out of morbid curiosity to see how they finish this hatchet job of an anime, and while it might not be the worst anime out there, they just don't seem to be trying overly hard to put any depth into the characters or the show for that matter.\\n\\n\r\nOverall I rate it \"tsk, I don't care\".",
            "date": "2017-01-19T21:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 238659,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/deiosa",
                "username": "deiosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=238659"
        },
        {
            "content": "Trickster.. I found the very begining of the anime on social media. From just a minute video I was really interested in whole thing and couldnt wait to watch it.\r\nIf I would have to compare this anime to something.. I would say House MD. How can I compare these two?\r\nBoth are mostly focused on solving the cases. From time to time you get to know about characters.\r\nEven though the anime is focused on so called Boys' Detective Club, you do not have to be interested in detectivistic anime.\r\nI see it more as a mystery hidden behind all the characters. And I took a lot ofinterest in getting to know them.\\n\\n\r\nThe main character - Kobayashi - lost his memories. He dont know who he is, where is he from.. he just knows his name and that he cant control the power he holds. He also dont know the reason why at first place he has this power. \\n\r\nI couldnt wait to see the next episodes. It was definitely worth watching til the very end, because sometimes some actions might be predictable, but the end is totally a surprise to me. Its far different from what I imagined it to be.\\n\\n\r\nI find this anime underrated and not really apreciated enough.\\n\r\nPersonally I wish to see more of Trickster episodes. And after episode 24 I have no idea how to feel about the whole thing. But the one things sure. I definitely enjoyed it.",
            "date": "2017-06-21T08:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 250544,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3941035.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ImmortalShadow",
                "username": "ImmortalShadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=250544"
        },
        {
            "content": "I see that there are many bad reviews about this anime, but really.. Please watch it till the end first.. Sure, there are some boring episodes in there, I didn't expect too much when watching the 1st episode. But I personally love the characters relationship development in this anime. Not because I'm a fujoshi that I love to see the boys interacting with each other, but more to their friendship, I guess? And that Kobayashi finally be able to...*spoiler*... Just watch it. Well, there are some unsolved mysteries left though I think. Like, what happens to the other characters after the last case.. They should'veadd some scenes about them in the end. Hope that they will make some additional episodes to explain those or Season 2 perhaps? I'll certainly watch them! Love Koba-chin! <3",
            "date": "2017-05-28T01:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 248704,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6276881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Unyil",
                "username": "Unyil"
            },
            "url": "https://myanimelist.net/reviews.php?id=248704"
        },
        {
            "content": "It’s something rating an anime you like with ‘5’ but understand this review reflects a technical standpoint. Where reviewers give 10’s and the average rating appears to be 7/8+ for everything (which may very well mean they’re all very good but let’s balance things) this is a practical grounding. This site gives 5 an ‘average’ meaning of which Trickster largely matches that description, but the key point is that though it’s average on the grand scheme of things, this doesn’t prevent it from being enjoyable, the 10/10 for personal enjoyment at the end is what matters, when all is said and done of the art,sound, story, that’s what ultimately counts.\\n\\n\r\nThis mystery detective drama can be appreciated for its characters. Spoiler alert, Kobayashi does not ‘get better’ this isn’t a “oh Kobayashi meets great people and solves his inner demons.” Well he kind of does, bar the lethal destroy literally anything bubble thing. Presumably the bubble was meant to be imagery for a mental illness of some kind, Kobayashi has essentially been homeless and on his own for some time and it shows. He demonstrates very poor communication skills and is set on achieving his awful end goal no matter what, in terms of his thinking there is a literal bubble, but like most things in this series it isn’t elaborated on. Kobayashi made the wrong choice by deciding not to pursue Hanasaki when he snuck out, and thinking that Hanasaki had left him/was ignoring him but it’s clear there were some issues at hand.\\n\r\nHanasaki is hands down the best character, his liveliness, initiative and effectively using some cool gadgets, taking out thugs, being switched on to solve cases, pursuing a shield murdering machine, Hanasaki’s the one to watch. Though Kobayashi is in no state to be there for others, through no fault of his own (Kobayashi does eventually articulate that he cares, his “you promised to kill me” is his way of keeping Hanasaki near him, his way of showing he values him) Hanasaki demonstrates some of his best and most distinguished traits by not giving up on someone who doesn’t at first reciprocate anything. He is the only one who essentially helps socialise Kobayashi and help him enjoy life, covering for him when the swing broke, arranging a birthday party for him, Hanasaki's one heck of a friend. His upbeat nature and go getter front was really appreciated considering the not really interesting cast and worked as a great foil to Kobayashi. It also turns out Hanasaki is surrounded by unsupportive ‘friends’ who are unable to comprehend his situation and yet Hanasaki is such a machine he bounces back from all that and is better for it, inspirational. After Hanasaki’s gruelling trials he does get his shine back, seen through his interactions with Hide, and his actions later on. Kobayashi does eventually have the intent to make things better, but it is Hanasaki who picks himself up and carries them both, despite what he went though and is going through. The inner power of this amazing person must be recognised. \\n\r\nRegarding the rest of the cast, Akechi is a classic case of unusually and unhelpfully out of touch person, even in this world. He should have been a good adult figure, telling Hanasaki about his brother, socialising a largely feral Kobayashi, just being a responsible adult to the boy's detective club and communicating better could have avoided some huge problems down the line. More so when poor communication skills were an enormous cause of a lot of the problems plot wise for multiple characters. Indeed his very poor choice of not telling Hanasaki about his brother disrupted the entire plot which had a knock on effect on the promising developments between the two leads.  Kobayashi thought Hanasaki had given up on him, when he was just understandably hacked off. Still Akechi does redeem this with the rescue, but disappears right after but whatever. \\n\r\nNoro/shut in girl was great for providing intel, greater for telling Hanasaki to go after Kobayashi to get the better story back on track. Nakamura/police woman was also good, Hide/hooligan leader too. Hide was the only decent friend for Hanasaki and vice versa in the long term with Kobayashi, as for the ‘friends’ at the boys detective club itself, they were lead weights in which it was a requirement for them to change for the better or be cut lose.\\n\r\nThe largest issue with the rest of the cast was that they were essentially poorly socialised, unable to understand things, kids. One ‘friend’ can’t recall who, think his name was ‘I’m not an important person forget about me’ was still holding a petty grudge against Hanasaki for ‘betraying’ them despite Hanasaki being understandably irked with the situation surrounding his missing brother. Hanasaki had no one to back him up, including who should have been his friend Kobayashi (not Kobayashi’s fault mind, considering who he is) Hanasaki done well to get through the grating injustice all around him. Holding a grudge because Hanasaki was kidnapped, not his fault - it was the kidnappers fault, and friends fault for being lousy and unsupportive. He was then drugged by a mind controlling liquid of which his ‘friends’ seemed largely indifferent of, they were basically like \"gosh! that Hanasaki was filled with a mind control agent but still his fault for doing what he did! We also saw him getting (apparently) electrocuted but who cares!\" The culprits got even more cold blooded and rabid donkey like after Hanasaki was rescued then left alone to wallow in unwarranted guilt, including experiencing physical health effects. Katsuta, a member who appeared sporadically also could have been but wasn’t a good friend to Hanasaki, there was just no camaraderie between the members. The ‘friends’ were content with doing menial whatever they were even doing plot wise with each other but failed to do the same for Hanasaki who needed it, later to all of them. The real good news is through his own prowess Hanasaki over came all that and got Kobayashi through as well, because you can be swamped with awful, unsupportive people but they can't diminish you, excellent message. \\n\\n\r\nPlot wise, Trickster stumbles heavily as a result of trying to dabble in several different routes, but follows none of them through. Want to be a detective series? Needs thrilling plots, want to explore character interaction? The side characters need to be decent, did the series want to make a point about mental illness? That would have been great, why didn’t it? Not to mention the potential for psychological horror with Kobayashi’s mind set and the way he has to eat. Also touches upon a great story overcoming hardships? The barrier surrounding Kobayashi should have been addressed by the end, it would be a superior message if it were gone, not learnt to be lived with. Learning to be live with things is fine and all, but not for a lethal shield that does need to go. Learning to live with vaporiser shield is also complicated by the focus on getting rid of it. And why show that was indeed possible to get rid of the destroyer shield, which would have also been the more desirable outcome? \"Oh a great mystery shield that can go which would solve a lot of problems? Na let's just keep it to show the ultimate mystery has not been solved, the poor guy's still hindered by it, make an inferior story\" - pretty much. \\n\r\nAs fine as it is the way it is, a story where Kobayashi overcomes the odds is better for the same reason a cake covered in icing and nice things is better than plain cake, and the latter was what the anime was, likely due to an abrupt “oh were out of time and funding, let’s end it here” response from the studio. Also suggests the anime itself didn’t know what it wanted, or left for a sequel that is unlikely to come (less so when the OVA’s focus on stuff not related to Hanasaki or Kobayashi, both of who were carrying the show). Kobayashi should not have decided to live because a vision of his mother told him to live for her, Kobayashi should have changed of his own will and developed enough to decide to live for Hanasaki and the amazing club members that were there for him and showed him how life was enjoyable. \\n\r\nThe parallel plot of Akechi and twenty faces was just another example of touching on things but not expanding on them. There was some very fine dog whistle stuff going on (and with other characters, watch the later episodes especially and see if you can spot it all) but for the large part twenty faces just wasn’t a good developed villain, and again huge potential for psychological thriller stuff, even action if they crossed over which it should have done more. Having said that this series does appear to be more of a shout out for the authors works rather then trying to develop or take it further for the current time (this Trickster is like a homage, it’s like telling a story about the Batman of the past and missing an opportunity to create the gritty versions like the Dark Knight, Trickster had some grit and other features to embrace and make use of).\\n\r\nLike the characters, the story also ends in lose ends, both Nakamura/police woman and Hide/hooligan leader aren’t heard from again, Kobayashi still has the destroyer bubble, the only hunch is the anime was meant to continue to encompass other books in the series, but no idea if this anime, like the dog friendly bubble is canon or just a studio view of it, and this anime perhaps fails to make people care enough to find out, still Hanasaki pulls through, he’s there for Kobayashi, and he can be trusted to be a needed friend to Hide as well. Hide would be a best member of the detectives club plus it gives him a way to turn his life around, that would be cool, Hide can definitely join Hanasaki and Kobayashi as best people for sure. Hopefully it went well for police woman and pink clothes girl as well, as for the rest, just wanted this series to bring out more of their better quirks, despite what was said above, these qualities were there. Another series would have been great to expand, but based on this that is unlikely to transpire, still.\\n\\n\r\nA side note, the world also has truly odd scenarios occurring, like Kobayashi’s Droideka bubble, that everyone’s rather blasé about what should be something outstanding, an invulnerable person who can destroy anything is unique even in this world with advanced machinery and the like. Surely he would have been the target of all the worlds governments, which could have created a greater plot, of which twenty faces could stake a greater role for himself, especially with his abilities (spoiler, also turns out that the shield was instigated by himself which raises vastly more questions, and no one even thinks of raising and expanding on these questions in the series). \\n\r\nAdditionally people being largely indifferent to Kobayashi and the fact that he was a young guy who wanted nothing but to die was just all rather odd, is that normal here? Did no one think, right we're here for you, not just going to use you? This doesn't apply to Hanasaki who realised that promise was the only way to stop Kobayashi from running away long enough to help him change, very clever, but there were counsellors here, maybe chuck one Kobayashi’s way? Real strange all round, but again no sense reading too much into it, the series didn’t bother, why should the audience. \\n\r\nLargely it’s a “is seriously no one noticing how strange this is? Are people seeing this?!” going down, no one batting an eyelid about a child wanting to die, or living in the freaking park, and people like Hide able to acquire assault grade weapons and have the initiative to launch a hit mission, where he is impressively skilled enough to shoot a gun out of someone’s hand, and use flash grenades effectively (needed lots more Hide) apparently nothing out of the blue here. \\n\r\nAside from the world, more oddness comes from the story, nothing really comes from anything, this series is unlikely to make the audience appreciate the original works, perhaps the fans may like it. They may also like Ranbo Kitan: Game of Laplace: this also has a head in the clouds Kobayashi, presume its book related, or perhaps back then people thought nothing or a truly odd way of thinking for a person. This work has nice art, but it’s apparent the studio received funding to celebrate the legacy of the writer and gave a brief overview of it in these two series, again not a major effort, and not remarkable, but if you like something you appreciate the best qualities. \\n\\n\r\n10/10 for personal enjoyment, remember this, this is important. Yes, give all the animes 10/10 because we love them and we always see the best in everything, but this review gives a realistic grounding, it's real and honours the series more that way. For the purpose of this review site the 5/10 score, even calling Trickster ‘near average’ is being generous considering the plot could be better, the characters spiralled into a trail of lose ends, the overall premise surrounding twenty faces was nothing to write home about. Yet you can give all the breakdown of the scores you want, but it’s whether you like it that counts. At that point you don’t think about ‘average’ animation, the dodgy dichotomous plot, you just see the good, and there’s good here, so have your first impressions end on the 10/10 for personal enjoyment since here it’s all that matters.\\n\r\nTrickster may be described as a plain cake, yes it would be nice to have icing, frosted vanilla, sprinkles in the cake itself, but why think of how things could be better, and miss the niceness in front of you. Despite this mid rating, plain cake is still nice; Tricksters still a nice anime, show it some love, and no matter what ensure that you soak in the key theme you can see from Trickster:\\n\\n\r\nWhat must be remembered was seeing Hanasaki as the ultimate team member, carrying out everything, covering for his friends, and rising when he was surrounded by unsupportive people, that’s impressive. Hanasaki is amazing for recognising the quite severe issues surrounding Kobayashi, who couldn’t do much for him when it counted, but sticking by him nonetheless, that takes maturity. The point about being there for people who are unable, through no fault of their own, to be there for you commands praise, Hanasaki’s a good egg. Who else is gallant enough to be worn down by everything in this plot, and everyone around them, whether it's issues with his father, brother, being unjustly blamed for stuff even after you’ve been kidnapped and threatened at gunpoint? We’re human, these things can happen, but who can remain strong when you come to the bleak realisation that your ‘team’ are devoid of empathy, clueless and unusually petty? To weather these heavy burdens but then overcome them, and then to go even further than what should be possible, whether it was in the final stages of the plot with some astounding bravery and skills, but largely by looking after a essentially special needs Kobayashi who really needed help of his own, Hanasaki must be recognised for the incredible person he is.",
            "date": "2018-05-20T09:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 281001,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7124567.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/an1mnte",
                "username": "an1mnte"
            },
            "url": "https://myanimelist.net/reviews.php?id=281001"
        },
        {
            "content": "I actually liked Trickster quite a bit but there are a lot of flaws to this show. Don't have high hopes when going into it, the show is good but that's as much credit as I'm willing to give it. \r\nThe Story: The show is about these boys who are in a detectives club pretty simple plot, except one of the boys is an immortal due to the strange powers he has. The immortal character is the saving grace for the show's story, as the cases they solve are occasionally boring with only a few I can think of that I really liked. There aresome really good episodes that I personally loved but you're going to be sitting through some boring ones to get to them.\\n\\n\r\nThe Characters: One of the biggest flaws of the show is the characters. There is only one good character of the show and that's Kobayashi as he I find he's the most interesting. The rest of the characters are either boring or seem kind of like jerks especially Hanasaki. The cast of characters was a little too big which results in under development for most of them. \\n\\n\r\nThe Art: I'm not sure if it was just me or what but I felt that the art style seemed to get kind of sloppy in later episodes, especially if you looked at some of the characters in the background. \\n\\n\r\nEnjoyment: Despite how negative my review may seem, I really did enjoy the show, and will probably rewatch it again sometime.  All in all, it's merely a good show not great but not horrible.",
            "date": "2017-03-31T23:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 244203,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5949280.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BrokenCord83",
                "username": "BrokenCord83"
            },
            "url": "https://myanimelist.net/reviews.php?id=244203"
        },
        {
            "content": "The anime had so much potential to be good, yet, it missed it.\r\nIt had a good start with Kobayashi and his super powers etc... detective club sounds interesting hmm but as the story progresses it just became a mess. It was actually fun at the beginning, but after the Hanasaki thing it lost me. The ending was too a let-down. Art wise, faces were distorted in some frames lol \r\nAlso, Twenty and Akechi’s relationship is like ???????? Get a room? Sit down and talk it out? Thrills?? I definitely didn't get any.\r\nOverall, the story just lacked, the character development was also lacking, I probably wouldn'trecommend the show to anyone unless you're so bored and can't find anything else to watch. \\n\\n\r\n(Unrelated: wow Gackt and Akira in the same anime? Gackt’s voice annoyed me so much in this, his voice and singing is fine, idk what happened here)\\n\\n",
            "date": "2017-03-30T13:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 244027,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262865.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Aisukurimu",
                "username": "Aisukurimu"
            },
            "url": "https://myanimelist.net/reviews.php?id=244027"
        },
        {
            "content": "I must say, this Anime must be hard to review, given it's dichotomous nature. Half say it's terrible, worthy of a 1, and the other half say it's perfect and deserves a 10. I'll be among the few to analyze this anime holistically in a fair manner, and put aside non-quantifiable factors. (Ie. Kobayashi is Kawaii! As many would argue)\r\n[BEAR IN MIND, AT THE TIME OF WRITING THIS REVIEW, I HAVE WATCHED 20 EPISODES WITH JAPANESE VA, AND I AM PRETTY SURE THE OTHER 4 EPISODES ARE LESS LIKELY GOING TO AFFECT THE ACCURACY OF THIS REVIEW TOTALLY, THEREFORE THIS REVIEW WILL NOT BE RENDEREDUSELESS AS THE SERIES ENDS.]\\n\\n\r\nSTORY - 7/10\\n\\n\r\nThe crux of any anime would be the quality of the story in terms of how it is written, how it was executed and how it generally made everyone feel. It would be unfair to say this Anime is totally terrible based on the first 7 episodes or so, because I must admit, the plot was developing very slowly at the time and often came to a standstill, making it quite boring at the start, however, as the series progressed, it definitely got better. \\n\\n\r\nThe story mainly revolves around the mysterious Kobayashi, and his journey to solve his existential crisis via suicide. Then comes the Boys Detective Club, and many more. Overall, the initial questions like \"Who is Kobayashi? How did he get his powers? Why does he want to die?\" often motivates anyone to keep watching and as the story develops and the truth starts being uncovered, it gets very interesting and you'll definitely say, \"Man, didn't expect that coming.\" The subplots were far from being boring and often fed to the narratives pretty well, keeping the adventure intriguing and exciting. Sudden plot twists and the use of suspense in the ending of certain episodes will compel you to watch the next episode. I remember staring at the calendar, waiting for the next episode to air. \\n\\n\r\nThe story develops nicely, in a well-mannered pace. There was no signs of a forced conflict or forced resolution, and the pace of the story overall felt natural. It was not far from being simple, and you could never expect what's gonna happen next. It wasn't too complicated to the point that it puts you in a state of confusion either. Each episode kept feeding to the narratives consistently and the progression of the story felt fluid. It wasn't necessarily episodic, nor was it too shallow. Each episode satisfies the watcher with the mystery being solved, at the same time slowly develops the main plot in an unrushed manner.\\n\\n\r\nThe development of the story also didn't felt monopolized by the main character entirely. Subplots regarding other characters (ie. Hanasaki) were also VERY VERY entertaining and sometimes, you would feel more interested in watching the other character's story develop. \\n\\n\r\nThe setting being 2030 also felt realistically coherent with the premise of each mystery and the dependence of the detectives on certain tools were acceptably \"cool\".\\n\\n\r\nAll in all, the story was good in a sense that you are dying to know the secret of Kobayashi, and still enjoy the amazing abilities of the detectives and the villain.\\n\\n\r\nART - 8/10\\n\\n\r\nArt was very good in a sense that it delivered what the Anime needed. A fresh vibrant design that feels youthful, depicting the nature of the Boys Detective Club, and at times, dark and creepy enough to display the vile and conspicuous nature of the villain, fiend with 20 faces.\\n\\n\r\nThere were no fluctuations in quality of the animation panels that were noticeable enough, and each episode delivered the same style consistently as expected, in very good quality.\\n\\n\r\nThe background was memorable enough to make you remember that the setting is in 2030, without you being directly reminded of that fact. The background felt realistic enough for us to buy that this might possibly be what the world looks like in 13 years.\\n\\n\r\nSOUND - 8/10\\n\\n\r\nFirst, lets talk about the themes.  \"Kimi dake no Boku de Iru kara (キミだけのボクでいるから)\" by GACKT which was the opening theme in the first 12 episodes was in my opinion, really good and a little bit better than the second opening theme. It made the series feel exciting and adventurous, which is what you'd expect from the setting and the synopsis. The closing, \"1HOPE SNIPER\" by Azusa Tadokoro was also fairly good, and as I progressed through the series, I have never skipped it. It is not, however, so good to the point that it automatically earns a spot in my Itunes playlist. The second opening and closing themes,  \"Unmei Dilemma (運命ジレンマ)\" by Azusa Tadokoro and Tsumi no Keishou: Original Sin (罪の継承～ORIGINAL SIN～)\" by Gackt were okay I guess, as it didnt necessarily force me to skip or mute the video, which is quite a good sign given that most other anime don't earn this priviledge.\\n\\n\r\nSecond, let's talk about the background music. The sound team really did their job in making sure no scene felt dull, and all the background music help develop the emotions of the scenes without necessarily overpowering it. Besides, no one wants a fight scene with no action music, but no one wants a sad scene where the music is louder than the voices either. The execution of the background music was top-notch and the emotions of each scene was successfully delivered due to this.\\n\\n\r\nThird, and arguably most important, the voice acting. Again, let me remind you I watched the Anime in Japanese Audio. So how was the Japanese Voice Acting? Solid. Each Voice Actor played into their role perfectly and naturally, emulating the intended traits of each character. Easiest example would be the villain, Fiend with 20 faces. His voice actor sounded so creepy and vile, which was good as this made the villain realistic and made me sympathize with the heroes in efforts to stop the villain. Kudos to Gackt! \\n\\n\r\nCHARACTER - 8/10\\n\\n\r\nAs I mentioned before, character development was very good. Each character was given to show their traits and behaviors, without unnaturally forcing it. It felt real, and at what point, I felt so much pity for the protagonist that I wanted to personally help him die.\\n\\n\r\nAlso as mentioned, character development wasn't monopolized by one party, (needless to say, many Anime series only allow the main protagonist to develop) but everyone developed, whether in individual subplots, or in the major plot.\\n\\n\r\nIn a nutshell, the characters are very, very memorable and relatable. You can feel the agony felt by Kobayashi, and understand why he wants to die. You can also feel the pain felt by Hanasaki, so much so that you justify his wrong actions. The characters, as emphasized again and again, great.\\n\\n\r\nENJOYMENT - 7/10\\n\\n\r\nWe have arrived at the place where most would skip to. The discussion of whether \"this anime is worth my time\". Let me say this. YES.\\n\\n\r\nThe series felt enjoyable as at times I felt excited, at other times I felt sad and angry, which is expected from a good Anime. Needless to say, it doesn't matter whether you're into mysteries or not, this anime will definitely not disappoint if you stay till the end. The endeavors of the Boys Detective Club against the notorious Fiend with 20 faces will certainly occupy your time, and keep you at the edges of your seat as you wait for the next upcoming episode, and will make you wish they made more, when the series ends.\\n\\n",
            "date": "2017-03-02T07:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 241725,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6078944.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Izuka-kun",
                "username": "Izuka-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241725"
        },
        {
            "content": "Honestly, it's just mediocre.\r\nI don't mind the characters, the setup, or even the art, but in my opinion it isn't anything special.\r\nFor me, I was just waiting for something interesting to happen.\r\nSomething happened, but it was just confusing. And boring. The story was just.. anticlimatic for me. Overall, it isn't terrible at anything imo. Story is okay, but just not what anyone wanted. Art was mediocre. Sound.. average. Character wasn't terrible, didn't mind one or two of them. Enjoyment.. i just didn't enjoy it at all. Overall, bang average.\r\nHad pretty high hopes, but it didn't live up to anything i expected.\r\nI wanted to carry onwatching, for something slightly interesting to happen. I may still watch it until the end, as something meaningful may actually happen, but as it stands, its dissapointing.",
            "date": "2017-01-15T16:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 238377,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xubuu",
                "username": "xubuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=238377"
        }
    ],
    [
        {
            "content": "I went into this show with a lot of hope. There have been other recent anime influenced by the work of Edogawa Ranpo that have been pretty enjoyable, namely Rampo Kitan: Game of Laplace and my favorite dumb anime from the 90s Kindaichi Shounen no Jikenbo, so I was really pulling for this one to at least be fun. It didn't even have to be good, just in some small way enjoyable and then I would've been IN. \r\nThen I watched the first episode of the show, and at the end I said to myself, \"Well that was kinda boring and lackluster, but I betthe next one will be better.\" Upon the next one being pretty much the same, the writing on the wall was becoming pretty clear. It has, unfortunately, been chugging along at the same level of bland for the past 7 episodes. Until this point, nothing had been unforgivable, I simply couldn't bring myself to care about it. And then episode 8, when I said, \"F this show for REAL.\"\\n\\n\r\nI don't know if they knew they had a stinker on their hands and pulled the entire animation budget, or if they simply didn't give any more of a crap than I did at that point, but all of a sudden what was once simply disappointing suddenly became catastrophic. Without exaggerating in the slightest, it looks like they couldn't even be bothered to finish. There are a few moments that look like they just colored the story boards and skipped everything else. \\n\\n\r\nI would review the characters and story and all the rest, but there are none. They didn't bother. You shouldn't either. If you want something dark and mysterious in the vein of Agatha Christie or Conan Doyle, or more to the point Edogawa Ranpo, watch either Ranpo Kitan for a more direct adaptation or Kindaichi for some dumb fun. Plenty of other mysteries like The Perfect Insider, Erased, Higurashi, or literally anything else with the \"Mystery\" tag will be more entertaining than this. \\n\r\nI'm not mad at this show, it just makes me sad. Which is kind of the worst.",
            "date": "2016-11-21T21:37:00+00:00",
            "helpful_count": 80,
            "mal_id": 234167,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983772.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jRad522",
                "username": "jRad522"
            },
            "url": "https://myanimelist.net/reviews.php?id=234167"
        },
        {
            "content": "Well about the anime Trickster\r\nDon't know what to tell you the anime at the start looked promising but after few episodes it has become boring and stupid nothing interesting happened,it's not worth watching....\r\nThe start was really good I thought gonna be a good anime since Kobayashi appear an immortal guy,and he wanted too die I was excited ,the 1st 7 or 8 episodes were ok really good to be honest,but after that it lost everything the story droped,nothing interesting,just boring conversation and some stupid mission and so it goes to the end....\r\nThe end is absolute crap...\r\nIf you want to waste your time go ahead:D                   \\n\\n\r\n- Story Boring\\n\r\n-Anime Characters nothing special\\n\r\n-Kobayashi immortal dude that wants to die\\n\r\n-Rest bull sh*t\\n\\n\r\nThe story maybe 4/10\\n\r\nArt style 3/10\\n\r\nSound 4/10\\n\r\nCharacters 4/10\\n\r\nEnjoyment 2/10\\n\\n\r\nI gave it a 5 still considering it's maybe to high rated for myself there are many animes with much better stories and fights and rest \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-27T15:43:00+00:00",
            "helpful_count": 38,
            "mal_id": 243726,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4502091.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Akuma_X",
                "username": "Akuma_X"
            },
            "url": "https://myanimelist.net/reviews.php?id=243726"
        },
        {
            "content": "I have never written a review before, but the injustice this show suffers made me want to actually write one.\r\nI binge watched this show in less than two days and it was a roller coaster ride the entire way! I have seen hundreds of anime by this point and I honestly have no idea why so many people hated on this show.\r\nI love any work having to do with the Boys' Detective Club or Edogawa Ranpo, and this series did an excellent joke of drawing the audience in, keeping you interested, and appreciating it right to the very end.\r\nWas it perfect? No, but what isnowadays? Did it have a great, coherent story line, well developed characters, thrills, spills, and chills? Heck yeah!\\n\\n\r\nI've been really disappointment with the reviews of many shows lately. Shows that had amazing reviews turned out to be utter trash, and shows like Trickster, having awful reviews, turned out far beyond my expectations.\\n\\n\r\nIf you aren't sure about watching... Give it a go and see if you like it for yourself!!!",
            "date": "2017-04-16T16:02:00+00:00",
            "helpful_count": 31,
            "mal_id": 245663,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447214.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tasha1313",
                "username": "Tasha1313"
            },
            "url": "https://myanimelist.net/reviews.php?id=245663"
        },
        {
            "content": "Trickster is right!, as in this anime tricked you into watching this borefest.\r\nWell LA will be quite honest here...from the eyesore of Soul Busters, to the utter lull of Bloodivores...Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori was LA WORST anime of Fall 2016 and had rightfully gained that title. So want to know why?...let's dive into it shall we?\r\nBefore getting to the flaws of Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori, let's at least see LA giving \"praise\"...though there's not gonna be much. For what the one-episode mysteries Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori brings out, some are interesting, no not intriguing or anything but the earliestmysteries were pretty weird or the resolution is at least funny enough. Next strength would be Nao Nakamura voiced by Azusa Tadokoro, a police detective. She is LA's favourite character and you'll know why later on when LA covers the flaws section, the only other character LA had an inkling of interest would be Makoto Noro voiced by Ibuki Kido the hacker of the Boys Detective Club. In terms of plotlines, Akechi and Twenty Faces connection was intriguing to LA which later gets wrecked majorly...but that later. Lastly, the anime voice cast is \"ok\" at best but LA does have to say that GACKT as Twenty Faces was sorely wasted potential and he could have been in something better than this.\\n\\n\r\nOk, let's get to this, there's alot of elements within Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori that annoyed LA all throughout the anime, be it sooo bad it's good or just annoyingly horrible. Let's start with the characters. The majority of the characters are god damn emo edgelords, Yoshio Kobayashi voiced by Daiki Yamashita is an immortal with inconsistent powers used to convenience the plot whenever it wants and doesn't care about anything or anyone besides his own death, Kensuke Hanasaki voiced by Ryota Osaka was a hyper-genki and really annoying main protagonist and probably even worse when he gets \"character development\" and turns into a depressing wreck, these two characters are the primarily focus of the anime, let's not even get started on the rest...with Kogorou Akechi voiced by Daisuke Ono the leader of the Boys Detective Club and sure his backstory is interesting, but what he does for the plot is nonsensical or expects Hanasaki and Kobayashi to deal with it....what a nice leader. Twenty Faces voiced by GACKT is a poorer version of Shoko Makeshima from Psycho Pass and his motivations and goals clashes greatly with the entire anime throughout (as LA said...GACKT is wasted potential to this anime but GACKT's theatrical vocals did put a smile on LA's face once in a while). Ryou Inoue voiced by Yuuichirou Umehara and Tasuku Yamane voiced by Yoshitaka Yamaya, Hisa Ootomo voiced by Makoto Furukawa all members of the Boys Detective Club do get an arc or an episode for character development respectively but they ultimately become active spectators or forgotten after their development finishes. As LA said in LA's strength section, both Nao Nakamura and Makoto Noro were LA's favourite characters only because they don't get caught up in Kobayashi, Hanasaki, Twenty Faces and Akechi's stupid mess...though Makoto Noro DOES get caught up in it but through the bridge bunny if anything...as for Nao Nakamura...she's \"was\" a badass that doesn't give a crap and just wants to do her job with the assistance of the Boys Detective Club...until the near final episodes of the anime where they absolutely RUINS her character...way to go Trickster, your stupid cliche writing even could destroy the best character of the anime, good plot twist and all, but her impact is just as eye rollingly annoying just to be thematically \"deep\". With these kind of characters...the interest to this anime wanes...the plot?...makes it even worse. \\n\\n\r\nThe plot in the earliest follows a one-shot-episode each mystery with the underlining goal of Hanasaki promising to kill Kobayashi where the mysteries were ok at best bringing in something of a double-edged side in looking at a mercenary-type detective club and the consequences it might entail...BUT is utterly annoying as soon as the topic of Kobayashi killing starts again and again and again, it's not until Hanasaki's character development or REGRESSION that it starts to \"kick off\" the anime. Hanasaki's character development felt both forced along with Hanasaki acting like a god damn idiot and what with Twenty Faces trying to be like Shoko Makeshima but not as great as him into brainwashing. Then by the half way point essentially Kobayashi and Hanasaki's roles are reversed and we learned more about Akechi and his connection to Twenty Faces, this is the time when the anime tried to redeem itself...then it utterly destroyed it with Kobayashi's backstory arc...and his backstory is as obvious as it gets and the ever annoying as they keep dangling the carrot when you already have it in bulk for. Plot twists DOES like to be theatrical in some sense...but for what they did on theatrics they substitute with common reasoning (partly with characters' denseness as well).\\n\\n\r\nOhh and can we talk about Kobayashi's inconsistent powers, namely his immortality. His immortality is one of the most infuriating and annoying things in the anime. One, is the fact that his immortality powers won't allow him to die to the point of him TOUCHING anything that might kill him will immediately explode...even hot water. Second is that even after his \"important backstory on how he got his powers\" his powers just get even more inconsistent as now his powers allows him to get hurt....wait what?, even little sharp stones can cause him to bleed even though his immortality was suppose to PROTECT him from dying yet he nonchalantly walks off WALKING ROBOT TURRET BULLETS like it's nothing. (To get into LA's headspace for the inconsistency, what would of happened if his immortality stopped like how the little stones managed to touch and caused him to bleed a bit, then shouldn't Kobayashi be A BIT fearful of his life instead of just walking in front of a mecha turret fire. UMM HELLO!?!??!, again Trickster's constant wanting the grand theatrics over common sense.). Finally, LA is gonna say the obvious, but because he's a OP IMMORTAL being, his battle scenes, hell ALL of his battle scenes immediately destroys any battle tension as we KNOW he'll NEVER get killed (post or pre-imporant backstory), again like Tatsuya Shiba from Mahouka Koukou no Rettousei, this is kinda what happens when you have TOO OP main protagonist...only Kobayashi doesn't have any of Tatsuya's badassness and to be replaced with constant angst and annoyance. Yes LA thinks Kobayashi is an emo asshat all throughout the anime, his powers is just a major factor of annoyance to it all.\\n\\n\r\nFor villains sake, Twenty Faces for being such a mysterious figure having a connection to Akechi and even his involvement to Hanasaki...he's a VERY relaxed villain that doesn't actively does anything to the plot unless the plot tells him to, sure he even orchestrated some of the one-shot mysteries at times (as LA said poor vers. of Shoko Makeshima) but it ultimately leads to an anti-climax (though hilariously stupid) what with Hanasaki's regression. The only thing that made LA a bit interested in Akechi's backstory in connection to Twenty Faces but that's about it as he just disappears after that until the final arc.\\n\\n\r\nThe animation done by TMS Entertainment is decent at best, derpy at worst to say the least, the best praise LA can give the animation is the character designs. Due to this being a 24 episode anime, the animation tended to dip by the latter half though with lots of derpy or lower quality scenes from time to time, TMS Entertainment tries to up their game when it came to the battles though slightly janky or worse...physics-defying in the weirdest possible way. The animation for LA is mixed but at the same time LA will say that the animation is one of the anime's worst elements of it, especially when the anime starts getting derpy and low quality when it was trying to be serious and \"awesome\" only to make it look funny when it wasn't suppose to and just lazy for no good reason (this especially during the later half of the anime when it just starts not caring and the quality DEFINITELY lowers even when the anime's plot is \"trying\" to go at all cylinders). TMS Entertainment get a hold of yourself, because this is laughably awful and \"trying too hard\" at best for animation and for an anime with lackluster plot and characters, this is one of the elements that kinda NEEDED to land and it stumbled and broke it legs in the process and limps the rest of the way.\\n\\n\r\nAs LA said in the strengths, the voice cast isn't that bad, if anything, it's the material that couldn't keep up with the voice cast and this was just what the voice cast had going for it so LA won't say the voice cast did horrible...if anything, the most annoying voice actors would easily go to both Daiki Yamashita and Ryota Osaka, LA wanted them to emote (but in Ryota's case...emote a lot less) instead of being wannabe emo edgelords and annoying the crap out of LA in the process. Favourite voice actor easily go to both Asuza Tadokoro and Ibuki Kido as they were the most acceptable and less annoying from the voice cast overall, though Ibuki Kido more for default but Asuza Tadokoro felt like she was giving her all through this dirge *cough* *cough* (YES..even more than GACKT and that's kinda saying something).\\n\\n\r\nThe ending...ohh boy, the ending god damn TRIES to be epic on a grand scale, what with Twenty Faces final showdown as well as Hanasaki's promise in killing Kobayashi annnnnnnnd it leads into an anti-climax with the straw that kept breaking this entire ending for LA was Kobayashi's inconsistent immortality powers...it's like the ending wanted to have it's cake and eat it too concerning his powers and bringing in tension which again failed due to the entire showdown of Twenty Faces, HELL...Nao DISAPPEARS after her major plot twist and has no relevance to the final showdown...-sigh-. The ending as anti-climaxed as it is, it ends in a happy front because of course it does just to annoy LA further!?!??!!\\n\\n\r\nTrickster: Edogawa Ranpo \"Shounen Tanteidan\" yori is without a doubt for LA, has an identity crisis mainly focused on our diametric opposite main protagonists Hanasaki and Kobayashi, to make it worse, the lazy and confused naval gazing character development that either means nothing in the long run or has no impact to the plot at large though not all the time as some of the minor characters development are interesting, LA just wished it could have been injected to Hanasaki and Kobayashi, the animation that is janky at worst, ok at best but ultimately fails in the end making it lazy and inconsistent even when it goes all out. Plot twists that occurs have more focus on theatricals sense than common sense, villains are effectively pawns to a bigger villain who ultimately doesn't actively does anything unless the \"plot says so\" when he could have used his theatrical mood to lighten up the emotional hostaging by Hanasaki and Kobayashi and mysteries by majority coincidentally link to backstories and are framing devices than anything else.\\n\\n\r\nTrickster: Edogawa Ranpo \"Shounen Tanteidan\" yori LA will say this honestly throughout the 24 weeks LA has been watching you...you were effectively a waste of time and quite frankly a chore to get through for LA's Tuesdays and sure you can claim \"why do you watch it if you think it's a waste of time\"...well LA watched Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori so that LA can find a silver of something good in you and LA did, only to ruin that silver of hope with terrible plot and character progression and not to mention not alleviating the utter boredom, character derailments, janky animation and emotional atmospheric mood hostaging to say otherwise for LA. Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori you DESERVE LA's title of the worst anime of Fall 2016 AND LA needing to put an addendum of LA's Worst Anime of 2016 list as the 2nd WORST anime LA watched in 2016.",
            "date": "2017-03-27T17:53:00+00:00",
            "helpful_count": 19,
            "mal_id": 243736,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=243736"
        },
        {
            "content": "I didn't really come in watching this show with a lot of hope. I didn't except it to be much and it wasn't I simplie watched because I had nothing else to watch. I like the dark and action packed kind of anime, don't get be wrong I did start to get a feel of that at first and got a little excited, but soon I just felt like I was torturing myself in order to watch 1 episode, it just got boring and dull and it seemed like they didn't give a crap about the script anymore. They tried to make the anime funnybut failed miserably it just started to get depressing.",
            "date": "2016-11-22T22:25:00+00:00",
            "helpful_count": 22,
            "mal_id": 234220,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569566.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mariel_Everett",
                "username": "Mariel_Everett"
            },
            "url": "https://myanimelist.net/reviews.php?id=234220"
        },
        {
            "content": "Wow did this show take a bad turn quickly. I actually really liked the premise and the characters weren't bad to begin with but around episode nine this show went into a different direction. Without trying to spoil anything, one of the main characters personality totally did a 180. This character was almost too difficult to watch and the hole time I expected things to get better but it all just  led up to a horrible season finally where nothing was sorted out. Very dissapointing since I thought this series had some potential. If anyone does decide to watch this I suggestion endingat episode eight. Sometimes I wonder if the shows creators actually watch the finished products..",
            "date": "2016-12-20T09:23:00+00:00",
            "helpful_count": 21,
            "mal_id": 235922,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4580242.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ecchi-wow-wa",
                "username": "Ecchi-wow-wa"
            },
            "url": "https://myanimelist.net/reviews.php?id=235922"
        },
        {
            "content": "Trickster was actually an alright show, overall.  It could've been a lot better, but it wasn't a bad show.\r\nThe story is about a bunch boys in the Boys Detective club solving cases they take up.  Hanasaki meets Kobayashi in the first episode, who has a power that prevents him from dying, and it goes on from there into cases being solved, character turmoil, and bunch of random stuff.\r\nThe art isn't really special, but it at least captures the tone of the vents properly.\r\nTheir nothing special about the sound.  I do like the second opening theme and ending theme.  The first onesweren't all that good.\\n\\n\r\nThe character department is kind of a mess.  Kobayashi, Hanasaki, Akechi, and the rest didn't really evolve much during the first half of the show.  They got some development in the second half, but a lot of them were kept off screen  most of the time.  Reducing the character numbers by a few would've helped a bit.\\n\\n\r\nI still enjoyed Trickster, but my enjoyment lessened overtime.  I really liked it at first, but it quickly became just an ok anime due to all the different events being thrown at you in kind of a non orderly fashion. It's not something I'd really recommend, but I won't highly discourage someone from watching it either.",
            "date": "2017-03-27T13:21:00+00:00",
            "helpful_count": 13,
            "mal_id": 243708,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5520188.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AobaSuzukaze",
                "username": "AobaSuzukaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=243708"
        },
        {
            "content": "i don't know why people who doesn't like these genres even watched this...if you don't like these kinda anime series then do not watch this...you don't have to :D\r\ni like these kinds of stories so i started watching this anime and i ended up enjoying this anime X)\r\nstory 8/10 : i liked the story...i love detectives working with weird stuff so i liked the story...main story is about a guy who can't die and he desperately wants to die...another cheerful guy finds him and make him wanna live again somehow :)\r\nthe only big problem was that the stories are not stable enough to be perfect...ifthey could have made it more stable and enjoyable it would have been more popular than this :D\\n\\n\\n\r\nart 9/10:art was beautiful to be honest...the reason of giving this 9 is because i saw a little more beautiful art than this :)\\n\\n\r\nsound 8/10 : i enjoyed the soundtracks :) specially the first opening\\n\\n\r\ncharacters 8/10 :i loved the characters in general but some of them needed more explanations to know them better than this.\\n\\n\r\nenjoyment 8/10 : it was enjoyable to watch this anime for me...i watched the whole 24 episodes in two days...i have lots of anime series that i'm currently watching but after 5 or 6 episodes i got bored but i finished this in two days :D \\n\\n\r\n*personal note*: one true fact that you can learn from this anime:nothing happens if you kill yourself...you are the one who loses your chance to live this life :)\\n\r\ni get that...i do really...but i don't care...life is meaningless without others for me XD\\n\r\none thing that Yoshio realized was this...he got attached to Kensuke so he had something to live for :)\\n\\n\r\noverall 8/10 : if you like a weird detective story with a lot of different characters this anime is for you...go on and try this :D\\n\r\notherwise if you like an anime with beautiful art and soundtrack you can give this a try too :D\\n\r\nif you don't like these kinda stories don't watch this anime :)\\n\\n",
            "date": "2018-11-17T11:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 294232,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7245057.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sepid_96",
                "username": "sepid_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=294232"
        },
        {
            "content": "Most people i have noticed say that Kobayashi is the main even tho it kind of revolves around Sensei and Hanasaki because it drifts into Hanasaki's life with his fathers affection and the whole brother side which then created anoter path in the show which lead to Sensei and 20 Faces fighting at Hanasaki's Fathers company. \r\nWhat im saying is the show doesn't just revolve around one character Kobayashi \r\nKobayashi want's to die\r\nHanasaki is supposed to help him die but gets side tracked by sensei refusing to help his brother.\r\nSensei wanting to be a badass and avoids helping and sticks to boring shi* jobs untilhis bitc boy Hanasaki gets taken by 20 Faces.\\n\\n\r\nYou put to much presure for this show to be good GOD IT ONLY HAS ONE GENRE \\n\r\nMYSTERY NOTHING ELSE NOT ACTION OR SOMETHING JUST MYSTERY.\\n\r\nwe don't know about kobayashi or 20 Faces Yet JUST BE PATIENT!!!!!!!!!1",
            "date": "2016-12-20T11:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 235931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5915384.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CGJAnime",
                "username": "CGJAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=235931"
        },
        {
            "content": "I really tried to keep following it by seeing a huge potential in history. Basically as you know a suicidal boy just can not kill himself because of some mysterious power he has that makes him immortal.\r\nThroughout the episodes you know the important characters that will always appear in the story however they are not anything cool and remarkable. They even try a development of each character in some episodes but that simply does not work, in this story development issue and the basis of it, the script is horrible.\r\nThroughout the anime there are few scenes in which they exploit the boy's power and thelimit he has but there really are few scenes, quite sparse, they coil quite a lot with what I would call \"Fillers\" but these so-called fillers are just attempts at Develop the characters and give depth to them.\\n\\n\r\nThe art of the anime is very good, I can not say for sure exactly what it is but the colors and all the rest of the animation is unique and quite beautiful to see. The soundtrack is so bad and boring that I almost did not notice its existence.\\n\\n\r\nWhat really caught me in this anime is all the mystery that is built around the boy, you can get very curious with questions such as \"What is the origin of this power?\" Or \"Is there any weakness?\" But the scripts throughout the episodes are extremely horrible and I decided to drop by the time I went to watch one afternoon and when I realized I had slept so annoying that I was",
            "date": "2017-02-25T23:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 241407,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4470470.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Philipp-Nunes",
                "username": "Philipp-Nunes"
            },
            "url": "https://myanimelist.net/reviews.php?id=241407"
        },
        {
            "content": "I really enjoy this anime but I recommend it to people who are patient. This is not an anime for a person that likes the story to have a sense from the start. It is for people who like to watch and watch to see how everything is changing and how the MC has his moments but also the other characters. I am a bit angry that the MC is kind of forgotten sometimes but when I started to watch the first episode I would never think that the story will be so different from what I thought it will be. Sadly I wish theycould improve the graphics, it's hard to watch it sometimes. If you don't watch it for the plot or graphics, watch it for the music. It is brilliant.",
            "date": "2017-03-05T10:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 241923,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6031917.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hanabi-sama",
                "username": "Hanabi-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=241923"
        },
        {
            "content": "First time reviewing anything on here but i have to do this show justice and its not getting it with the negative reviews. I have watched this  show twice in a row and honestly its now one of my all time favourites.\r\nThe  main story as well as the subplots are both enjoyable and quite emotional at points and makes all of the characters seem important in someway or another. The main characters are all well written and believable and the case of Kobayashi and Hanasake both have great character depth and development from the start. \r\nMy final comments are that this show endswell leaving and opening for a season 2 which i truly hope it gets and i would say this show is perfect for anyone who wants a great story with ups and downs. amazing characters and/or compelling mysteries \\n",
            "date": "2019-03-19T05:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 303841,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5582011.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/NaiMuhinyi619",
                "username": "NaiMuhinyi619"
            },
            "url": "https://myanimelist.net/reviews.php?id=303841"
        },
        {
            "content": "I found this on the \"latest episodes\" list, and watched the first 14 episodes.  Overall, the show simply doesn't seem to go anywhere, and I believe one of the character's attitude mirrors that of the people running the show \"tsk, I don't care\".  The show, as a concept, has potential, but the characters lack depth or even development beyond a very superficial level.  The plot line doesn't seem to exist beyond an episodic nature of solving the case of the day, and getting nowhere closer to actual character development beyond 2-d cookie cutter characters where a swimming pool with no water hasmore depth.\\n\\n\r\n  I'm not sure I'll finish watching the show except out of morbid curiosity to see how they finish this hatchet job of an anime, and while it might not be the worst anime out there, they just don't seem to be trying overly hard to put any depth into the characters or the show for that matter.\\n\\n\r\nOverall I rate it \"tsk, I don't care\".",
            "date": "2017-01-19T21:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 238659,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/deiosa",
                "username": "deiosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=238659"
        },
        {
            "content": "Trickster.. I found the very begining of the anime on social media. From just a minute video I was really interested in whole thing and couldnt wait to watch it.\r\nIf I would have to compare this anime to something.. I would say House MD. How can I compare these two?\r\nBoth are mostly focused on solving the cases. From time to time you get to know about characters.\r\nEven though the anime is focused on so called Boys' Detective Club, you do not have to be interested in detectivistic anime.\r\nI see it more as a mystery hidden behind all the characters. And I took a lot ofinterest in getting to know them.\\n\\n\r\nThe main character - Kobayashi - lost his memories. He dont know who he is, where is he from.. he just knows his name and that he cant control the power he holds. He also dont know the reason why at first place he has this power. \\n\r\nI couldnt wait to see the next episodes. It was definitely worth watching til the very end, because sometimes some actions might be predictable, but the end is totally a surprise to me. Its far different from what I imagined it to be.\\n\\n\r\nI find this anime underrated and not really apreciated enough.\\n\r\nPersonally I wish to see more of Trickster episodes. And after episode 24 I have no idea how to feel about the whole thing. But the one things sure. I definitely enjoyed it.",
            "date": "2017-06-21T08:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 250544,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3941035.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ImmortalShadow",
                "username": "ImmortalShadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=250544"
        },
        {
            "content": "I see that there are many bad reviews about this anime, but really.. Please watch it till the end first.. Sure, there are some boring episodes in there, I didn't expect too much when watching the 1st episode. But I personally love the characters relationship development in this anime. Not because I'm a fujoshi that I love to see the boys interacting with each other, but more to their friendship, I guess? And that Kobayashi finally be able to...*spoiler*... Just watch it. Well, there are some unsolved mysteries left though I think. Like, what happens to the other characters after the last case.. They should'veadd some scenes about them in the end. Hope that they will make some additional episodes to explain those or Season 2 perhaps? I'll certainly watch them! Love Koba-chin! <3",
            "date": "2017-05-28T01:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 248704,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6276881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Unyil",
                "username": "Unyil"
            },
            "url": "https://myanimelist.net/reviews.php?id=248704"
        },
        {
            "content": "It’s something rating an anime you like with ‘5’ but understand this review reflects a technical standpoint. Where reviewers give 10’s and the average rating appears to be 7/8+ for everything (which may very well mean they’re all very good but let’s balance things) this is a practical grounding. This site gives 5 an ‘average’ meaning of which Trickster largely matches that description, but the key point is that though it’s average on the grand scheme of things, this doesn’t prevent it from being enjoyable, the 10/10 for personal enjoyment at the end is what matters, when all is said and done of the art,sound, story, that’s what ultimately counts.\\n\\n\r\nThis mystery detective drama can be appreciated for its characters. Spoiler alert, Kobayashi does not ‘get better’ this isn’t a “oh Kobayashi meets great people and solves his inner demons.” Well he kind of does, bar the lethal destroy literally anything bubble thing. Presumably the bubble was meant to be imagery for a mental illness of some kind, Kobayashi has essentially been homeless and on his own for some time and it shows. He demonstrates very poor communication skills and is set on achieving his awful end goal no matter what, in terms of his thinking there is a literal bubble, but like most things in this series it isn’t elaborated on. Kobayashi made the wrong choice by deciding not to pursue Hanasaki when he snuck out, and thinking that Hanasaki had left him/was ignoring him but it’s clear there were some issues at hand.\\n\r\nHanasaki is hands down the best character, his liveliness, initiative and effectively using some cool gadgets, taking out thugs, being switched on to solve cases, pursuing a shield murdering machine, Hanasaki’s the one to watch. Though Kobayashi is in no state to be there for others, through no fault of his own (Kobayashi does eventually articulate that he cares, his “you promised to kill me” is his way of keeping Hanasaki near him, his way of showing he values him) Hanasaki demonstrates some of his best and most distinguished traits by not giving up on someone who doesn’t at first reciprocate anything. He is the only one who essentially helps socialise Kobayashi and help him enjoy life, covering for him when the swing broke, arranging a birthday party for him, Hanasaki's one heck of a friend. His upbeat nature and go getter front was really appreciated considering the not really interesting cast and worked as a great foil to Kobayashi. It also turns out Hanasaki is surrounded by unsupportive ‘friends’ who are unable to comprehend his situation and yet Hanasaki is such a machine he bounces back from all that and is better for it, inspirational. After Hanasaki’s gruelling trials he does get his shine back, seen through his interactions with Hide, and his actions later on. Kobayashi does eventually have the intent to make things better, but it is Hanasaki who picks himself up and carries them both, despite what he went though and is going through. The inner power of this amazing person must be recognised. \\n\r\nRegarding the rest of the cast, Akechi is a classic case of unusually and unhelpfully out of touch person, even in this world. He should have been a good adult figure, telling Hanasaki about his brother, socialising a largely feral Kobayashi, just being a responsible adult to the boy's detective club and communicating better could have avoided some huge problems down the line. More so when poor communication skills were an enormous cause of a lot of the problems plot wise for multiple characters. Indeed his very poor choice of not telling Hanasaki about his brother disrupted the entire plot which had a knock on effect on the promising developments between the two leads.  Kobayashi thought Hanasaki had given up on him, when he was just understandably hacked off. Still Akechi does redeem this with the rescue, but disappears right after but whatever. \\n\r\nNoro/shut in girl was great for providing intel, greater for telling Hanasaki to go after Kobayashi to get the better story back on track. Nakamura/police woman was also good, Hide/hooligan leader too. Hide was the only decent friend for Hanasaki and vice versa in the long term with Kobayashi, as for the ‘friends’ at the boys detective club itself, they were lead weights in which it was a requirement for them to change for the better or be cut lose.\\n\r\nThe largest issue with the rest of the cast was that they were essentially poorly socialised, unable to understand things, kids. One ‘friend’ can’t recall who, think his name was ‘I’m not an important person forget about me’ was still holding a petty grudge against Hanasaki for ‘betraying’ them despite Hanasaki being understandably irked with the situation surrounding his missing brother. Hanasaki had no one to back him up, including who should have been his friend Kobayashi (not Kobayashi’s fault mind, considering who he is) Hanasaki done well to get through the grating injustice all around him. Holding a grudge because Hanasaki was kidnapped, not his fault - it was the kidnappers fault, and friends fault for being lousy and unsupportive. He was then drugged by a mind controlling liquid of which his ‘friends’ seemed largely indifferent of, they were basically like \"gosh! that Hanasaki was filled with a mind control agent but still his fault for doing what he did! We also saw him getting (apparently) electrocuted but who cares!\" The culprits got even more cold blooded and rabid donkey like after Hanasaki was rescued then left alone to wallow in unwarranted guilt, including experiencing physical health effects. Katsuta, a member who appeared sporadically also could have been but wasn’t a good friend to Hanasaki, there was just no camaraderie between the members. The ‘friends’ were content with doing menial whatever they were even doing plot wise with each other but failed to do the same for Hanasaki who needed it, later to all of them. The real good news is through his own prowess Hanasaki over came all that and got Kobayashi through as well, because you can be swamped with awful, unsupportive people but they can't diminish you, excellent message. \\n\\n\r\nPlot wise, Trickster stumbles heavily as a result of trying to dabble in several different routes, but follows none of them through. Want to be a detective series? Needs thrilling plots, want to explore character interaction? The side characters need to be decent, did the series want to make a point about mental illness? That would have been great, why didn’t it? Not to mention the potential for psychological horror with Kobayashi’s mind set and the way he has to eat. Also touches upon a great story overcoming hardships? The barrier surrounding Kobayashi should have been addressed by the end, it would be a superior message if it were gone, not learnt to be lived with. Learning to be live with things is fine and all, but not for a lethal shield that does need to go. Learning to live with vaporiser shield is also complicated by the focus on getting rid of it. And why show that was indeed possible to get rid of the destroyer shield, which would have also been the more desirable outcome? \"Oh a great mystery shield that can go which would solve a lot of problems? Na let's just keep it to show the ultimate mystery has not been solved, the poor guy's still hindered by it, make an inferior story\" - pretty much. \\n\r\nAs fine as it is the way it is, a story where Kobayashi overcomes the odds is better for the same reason a cake covered in icing and nice things is better than plain cake, and the latter was what the anime was, likely due to an abrupt “oh were out of time and funding, let’s end it here” response from the studio. Also suggests the anime itself didn’t know what it wanted, or left for a sequel that is unlikely to come (less so when the OVA’s focus on stuff not related to Hanasaki or Kobayashi, both of who were carrying the show). Kobayashi should not have decided to live because a vision of his mother told him to live for her, Kobayashi should have changed of his own will and developed enough to decide to live for Hanasaki and the amazing club members that were there for him and showed him how life was enjoyable. \\n\r\nThe parallel plot of Akechi and twenty faces was just another example of touching on things but not expanding on them. There was some very fine dog whistle stuff going on (and with other characters, watch the later episodes especially and see if you can spot it all) but for the large part twenty faces just wasn’t a good developed villain, and again huge potential for psychological thriller stuff, even action if they crossed over which it should have done more. Having said that this series does appear to be more of a shout out for the authors works rather then trying to develop or take it further for the current time (this Trickster is like a homage, it’s like telling a story about the Batman of the past and missing an opportunity to create the gritty versions like the Dark Knight, Trickster had some grit and other features to embrace and make use of).\\n\r\nLike the characters, the story also ends in lose ends, both Nakamura/police woman and Hide/hooligan leader aren’t heard from again, Kobayashi still has the destroyer bubble, the only hunch is the anime was meant to continue to encompass other books in the series, but no idea if this anime, like the dog friendly bubble is canon or just a studio view of it, and this anime perhaps fails to make people care enough to find out, still Hanasaki pulls through, he’s there for Kobayashi, and he can be trusted to be a needed friend to Hide as well. Hide would be a best member of the detectives club plus it gives him a way to turn his life around, that would be cool, Hide can definitely join Hanasaki and Kobayashi as best people for sure. Hopefully it went well for police woman and pink clothes girl as well, as for the rest, just wanted this series to bring out more of their better quirks, despite what was said above, these qualities were there. Another series would have been great to expand, but based on this that is unlikely to transpire, still.\\n\\n\r\nA side note, the world also has truly odd scenarios occurring, like Kobayashi’s Droideka bubble, that everyone’s rather blasé about what should be something outstanding, an invulnerable person who can destroy anything is unique even in this world with advanced machinery and the like. Surely he would have been the target of all the worlds governments, which could have created a greater plot, of which twenty faces could stake a greater role for himself, especially with his abilities (spoiler, also turns out that the shield was instigated by himself which raises vastly more questions, and no one even thinks of raising and expanding on these questions in the series). \\n\r\nAdditionally people being largely indifferent to Kobayashi and the fact that he was a young guy who wanted nothing but to die was just all rather odd, is that normal here? Did no one think, right we're here for you, not just going to use you? This doesn't apply to Hanasaki who realised that promise was the only way to stop Kobayashi from running away long enough to help him change, very clever, but there were counsellors here, maybe chuck one Kobayashi’s way? Real strange all round, but again no sense reading too much into it, the series didn’t bother, why should the audience. \\n\r\nLargely it’s a “is seriously no one noticing how strange this is? Are people seeing this?!” going down, no one batting an eyelid about a child wanting to die, or living in the freaking park, and people like Hide able to acquire assault grade weapons and have the initiative to launch a hit mission, where he is impressively skilled enough to shoot a gun out of someone’s hand, and use flash grenades effectively (needed lots more Hide) apparently nothing out of the blue here. \\n\r\nAside from the world, more oddness comes from the story, nothing really comes from anything, this series is unlikely to make the audience appreciate the original works, perhaps the fans may like it. They may also like Ranbo Kitan: Game of Laplace: this also has a head in the clouds Kobayashi, presume its book related, or perhaps back then people thought nothing or a truly odd way of thinking for a person. This work has nice art, but it’s apparent the studio received funding to celebrate the legacy of the writer and gave a brief overview of it in these two series, again not a major effort, and not remarkable, but if you like something you appreciate the best qualities. \\n\\n\r\n10/10 for personal enjoyment, remember this, this is important. Yes, give all the animes 10/10 because we love them and we always see the best in everything, but this review gives a realistic grounding, it's real and honours the series more that way. For the purpose of this review site the 5/10 score, even calling Trickster ‘near average’ is being generous considering the plot could be better, the characters spiralled into a trail of lose ends, the overall premise surrounding twenty faces was nothing to write home about. Yet you can give all the breakdown of the scores you want, but it’s whether you like it that counts. At that point you don’t think about ‘average’ animation, the dodgy dichotomous plot, you just see the good, and there’s good here, so have your first impressions end on the 10/10 for personal enjoyment since here it’s all that matters.\\n\r\nTrickster may be described as a plain cake, yes it would be nice to have icing, frosted vanilla, sprinkles in the cake itself, but why think of how things could be better, and miss the niceness in front of you. Despite this mid rating, plain cake is still nice; Tricksters still a nice anime, show it some love, and no matter what ensure that you soak in the key theme you can see from Trickster:\\n\\n\r\nWhat must be remembered was seeing Hanasaki as the ultimate team member, carrying out everything, covering for his friends, and rising when he was surrounded by unsupportive people, that’s impressive. Hanasaki is amazing for recognising the quite severe issues surrounding Kobayashi, who couldn’t do much for him when it counted, but sticking by him nonetheless, that takes maturity. The point about being there for people who are unable, through no fault of their own, to be there for you commands praise, Hanasaki’s a good egg. Who else is gallant enough to be worn down by everything in this plot, and everyone around them, whether it's issues with his father, brother, being unjustly blamed for stuff even after you’ve been kidnapped and threatened at gunpoint? We’re human, these things can happen, but who can remain strong when you come to the bleak realisation that your ‘team’ are devoid of empathy, clueless and unusually petty? To weather these heavy burdens but then overcome them, and then to go even further than what should be possible, whether it was in the final stages of the plot with some astounding bravery and skills, but largely by looking after a essentially special needs Kobayashi who really needed help of his own, Hanasaki must be recognised for the incredible person he is.",
            "date": "2018-05-20T09:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 281001,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7124567.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/an1mnte",
                "username": "an1mnte"
            },
            "url": "https://myanimelist.net/reviews.php?id=281001"
        },
        {
            "content": "I actually liked Trickster quite a bit but there are a lot of flaws to this show. Don't have high hopes when going into it, the show is good but that's as much credit as I'm willing to give it. \r\nThe Story: The show is about these boys who are in a detectives club pretty simple plot, except one of the boys is an immortal due to the strange powers he has. The immortal character is the saving grace for the show's story, as the cases they solve are occasionally boring with only a few I can think of that I really liked. There aresome really good episodes that I personally loved but you're going to be sitting through some boring ones to get to them.\\n\\n\r\nThe Characters: One of the biggest flaws of the show is the characters. There is only one good character of the show and that's Kobayashi as he I find he's the most interesting. The rest of the characters are either boring or seem kind of like jerks especially Hanasaki. The cast of characters was a little too big which results in under development for most of them. \\n\\n\r\nThe Art: I'm not sure if it was just me or what but I felt that the art style seemed to get kind of sloppy in later episodes, especially if you looked at some of the characters in the background. \\n\\n\r\nEnjoyment: Despite how negative my review may seem, I really did enjoy the show, and will probably rewatch it again sometime.  All in all, it's merely a good show not great but not horrible.",
            "date": "2017-03-31T23:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 244203,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5949280.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BrokenCord83",
                "username": "BrokenCord83"
            },
            "url": "https://myanimelist.net/reviews.php?id=244203"
        },
        {
            "content": "The anime had so much potential to be good, yet, it missed it.\r\nIt had a good start with Kobayashi and his super powers etc... detective club sounds interesting hmm but as the story progresses it just became a mess. It was actually fun at the beginning, but after the Hanasaki thing it lost me. The ending was too a let-down. Art wise, faces were distorted in some frames lol \r\nAlso, Twenty and Akechi’s relationship is like ???????? Get a room? Sit down and talk it out? Thrills?? I definitely didn't get any.\r\nOverall, the story just lacked, the character development was also lacking, I probably wouldn'trecommend the show to anyone unless you're so bored and can't find anything else to watch. \\n\\n\r\n(Unrelated: wow Gackt and Akira in the same anime? Gackt’s voice annoyed me so much in this, his voice and singing is fine, idk what happened here)\\n\\n",
            "date": "2017-03-30T13:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 244027,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262865.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Aisukurimu",
                "username": "Aisukurimu"
            },
            "url": "https://myanimelist.net/reviews.php?id=244027"
        },
        {
            "content": "I must say, this Anime must be hard to review, given it's dichotomous nature. Half say it's terrible, worthy of a 1, and the other half say it's perfect and deserves a 10. I'll be among the few to analyze this anime holistically in a fair manner, and put aside non-quantifiable factors. (Ie. Kobayashi is Kawaii! As many would argue)\r\n[BEAR IN MIND, AT THE TIME OF WRITING THIS REVIEW, I HAVE WATCHED 20 EPISODES WITH JAPANESE VA, AND I AM PRETTY SURE THE OTHER 4 EPISODES ARE LESS LIKELY GOING TO AFFECT THE ACCURACY OF THIS REVIEW TOTALLY, THEREFORE THIS REVIEW WILL NOT BE RENDEREDUSELESS AS THE SERIES ENDS.]\\n\\n\r\nSTORY - 7/10\\n\\n\r\nThe crux of any anime would be the quality of the story in terms of how it is written, how it was executed and how it generally made everyone feel. It would be unfair to say this Anime is totally terrible based on the first 7 episodes or so, because I must admit, the plot was developing very slowly at the time and often came to a standstill, making it quite boring at the start, however, as the series progressed, it definitely got better. \\n\\n\r\nThe story mainly revolves around the mysterious Kobayashi, and his journey to solve his existential crisis via suicide. Then comes the Boys Detective Club, and many more. Overall, the initial questions like \"Who is Kobayashi? How did he get his powers? Why does he want to die?\" often motivates anyone to keep watching and as the story develops and the truth starts being uncovered, it gets very interesting and you'll definitely say, \"Man, didn't expect that coming.\" The subplots were far from being boring and often fed to the narratives pretty well, keeping the adventure intriguing and exciting. Sudden plot twists and the use of suspense in the ending of certain episodes will compel you to watch the next episode. I remember staring at the calendar, waiting for the next episode to air. \\n\\n\r\nThe story develops nicely, in a well-mannered pace. There was no signs of a forced conflict or forced resolution, and the pace of the story overall felt natural. It was not far from being simple, and you could never expect what's gonna happen next. It wasn't too complicated to the point that it puts you in a state of confusion either. Each episode kept feeding to the narratives consistently and the progression of the story felt fluid. It wasn't necessarily episodic, nor was it too shallow. Each episode satisfies the watcher with the mystery being solved, at the same time slowly develops the main plot in an unrushed manner.\\n\\n\r\nThe development of the story also didn't felt monopolized by the main character entirely. Subplots regarding other characters (ie. Hanasaki) were also VERY VERY entertaining and sometimes, you would feel more interested in watching the other character's story develop. \\n\\n\r\nThe setting being 2030 also felt realistically coherent with the premise of each mystery and the dependence of the detectives on certain tools were acceptably \"cool\".\\n\\n\r\nAll in all, the story was good in a sense that you are dying to know the secret of Kobayashi, and still enjoy the amazing abilities of the detectives and the villain.\\n\\n\r\nART - 8/10\\n\\n\r\nArt was very good in a sense that it delivered what the Anime needed. A fresh vibrant design that feels youthful, depicting the nature of the Boys Detective Club, and at times, dark and creepy enough to display the vile and conspicuous nature of the villain, fiend with 20 faces.\\n\\n\r\nThere were no fluctuations in quality of the animation panels that were noticeable enough, and each episode delivered the same style consistently as expected, in very good quality.\\n\\n\r\nThe background was memorable enough to make you remember that the setting is in 2030, without you being directly reminded of that fact. The background felt realistic enough for us to buy that this might possibly be what the world looks like in 13 years.\\n\\n\r\nSOUND - 8/10\\n\\n\r\nFirst, lets talk about the themes.  \"Kimi dake no Boku de Iru kara (キミだけのボクでいるから)\" by GACKT which was the opening theme in the first 12 episodes was in my opinion, really good and a little bit better than the second opening theme. It made the series feel exciting and adventurous, which is what you'd expect from the setting and the synopsis. The closing, \"1HOPE SNIPER\" by Azusa Tadokoro was also fairly good, and as I progressed through the series, I have never skipped it. It is not, however, so good to the point that it automatically earns a spot in my Itunes playlist. The second opening and closing themes,  \"Unmei Dilemma (運命ジレンマ)\" by Azusa Tadokoro and Tsumi no Keishou: Original Sin (罪の継承～ORIGINAL SIN～)\" by Gackt were okay I guess, as it didnt necessarily force me to skip or mute the video, which is quite a good sign given that most other anime don't earn this priviledge.\\n\\n\r\nSecond, let's talk about the background music. The sound team really did their job in making sure no scene felt dull, and all the background music help develop the emotions of the scenes without necessarily overpowering it. Besides, no one wants a fight scene with no action music, but no one wants a sad scene where the music is louder than the voices either. The execution of the background music was top-notch and the emotions of each scene was successfully delivered due to this.\\n\\n\r\nThird, and arguably most important, the voice acting. Again, let me remind you I watched the Anime in Japanese Audio. So how was the Japanese Voice Acting? Solid. Each Voice Actor played into their role perfectly and naturally, emulating the intended traits of each character. Easiest example would be the villain, Fiend with 20 faces. His voice actor sounded so creepy and vile, which was good as this made the villain realistic and made me sympathize with the heroes in efforts to stop the villain. Kudos to Gackt! \\n\\n\r\nCHARACTER - 8/10\\n\\n\r\nAs I mentioned before, character development was very good. Each character was given to show their traits and behaviors, without unnaturally forcing it. It felt real, and at what point, I felt so much pity for the protagonist that I wanted to personally help him die.\\n\\n\r\nAlso as mentioned, character development wasn't monopolized by one party, (needless to say, many Anime series only allow the main protagonist to develop) but everyone developed, whether in individual subplots, or in the major plot.\\n\\n\r\nIn a nutshell, the characters are very, very memorable and relatable. You can feel the agony felt by Kobayashi, and understand why he wants to die. You can also feel the pain felt by Hanasaki, so much so that you justify his wrong actions. The characters, as emphasized again and again, great.\\n\\n\r\nENJOYMENT - 7/10\\n\\n\r\nWe have arrived at the place where most would skip to. The discussion of whether \"this anime is worth my time\". Let me say this. YES.\\n\\n\r\nThe series felt enjoyable as at times I felt excited, at other times I felt sad and angry, which is expected from a good Anime. Needless to say, it doesn't matter whether you're into mysteries or not, this anime will definitely not disappoint if you stay till the end. The endeavors of the Boys Detective Club against the notorious Fiend with 20 faces will certainly occupy your time, and keep you at the edges of your seat as you wait for the next upcoming episode, and will make you wish they made more, when the series ends.\\n\\n",
            "date": "2017-03-02T07:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 241725,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6078944.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Izuka-kun",
                "username": "Izuka-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241725"
        },
        {
            "content": "Honestly, it's just mediocre.\r\nI don't mind the characters, the setup, or even the art, but in my opinion it isn't anything special.\r\nFor me, I was just waiting for something interesting to happen.\r\nSomething happened, but it was just confusing. And boring. The story was just.. anticlimatic for me. Overall, it isn't terrible at anything imo. Story is okay, but just not what anyone wanted. Art was mediocre. Sound.. average. Character wasn't terrible, didn't mind one or two of them. Enjoyment.. i just didn't enjoy it at all. Overall, bang average.\r\nHad pretty high hopes, but it didn't live up to anything i expected.\r\nI wanted to carry onwatching, for something slightly interesting to happen. I may still watch it until the end, as something meaningful may actually happen, but as it stands, its dissapointing.",
            "date": "2017-01-15T16:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 238377,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/xubuu",
                "username": "xubuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=238377"
        }
    ],
    [
        {
            "content": "Now, I'm not much of a \"reviewer\" and let's just say I've never done this before but... I LOVE this anime so far! Yes, Hanasaki can be a little annoying when it comes to about the ninth episode and so on but my Lord! The story so far has been outstanding! The art is amazing and everyone I've recommended this anime to has loved it! Recently, we've just seen a bit of the main character Kobayashi's past after all this time and things are starting to pick up. So if you really want to review this anime wait till the end when you see whyHanasaki is acting this way and what Kobayashi's past is. Overall this anime is 9/10! Maybe not eeryone will love it and I'm not e professional when it comes to reviews but give this anime a chance!! You'll either hate it or love it to death!!",
            "date": "2017-02-20T11:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 241008,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5741774.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ONEE_CHAN_",
                "username": "ONEE_CHAN_"
            },
            "url": "https://myanimelist.net/reviews.php?id=241008"
        },
        {
            "content": "At the beginning it went all well and I thought it was another great short detective serie with a big story behind it. I really love de MC (especially his personality). The other characters (except for Hanasaki) are also great. The art style is also pleasant to watch, I really like it. Until episode 9, I really enjoyed it and I thought it was all going to be exciting and full of action and emotion. \r\nBut I miss the ,really well explained, backstory of everyone. Also, the story isn't really going well and I don't know where it will go next. \r\nI really hope thatit will and all well as I hope it will. \\n\\n\r\nP.S. This is my first review writing and that's why I may be a little bit exaggerating with all the \"I\" in this review. But I hope that I will make better reviews in the future",
            "date": "2017-02-10T12:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 240309,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3798559.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mljboerman",
                "username": "mljboerman"
            },
            "url": "https://myanimelist.net/reviews.php?id=240309"
        },
        {
            "content": "As many people did when I saw this anime I didn't expect much. The show has too much hate towards it and to be honest, it deserves the hate but during this short review I am going to be fair. While over a third of the episodes are boring and meaningless, I fairly enjoyed some of the episodes. The characters seem obviously a ripoff of other animes even a novice could notice that but I couldn't complain, they seem good except for  Hanasaki who irritates me constantly. If you need me advice, don't watch this unless you run out of good animes to watch.",
            "date": "2017-02-07T19:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 240133,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713178.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/HitaroYuma",
                "username": "HitaroYuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=240133"
        },
        {
            "content": "I won't bother myself from writing an entire essay on this anime, for others have already done so, but I'll share few brief opinions, one of which is the fact that the plot is a totally mediocre.\r\n2. Roughly 85% of the characters are just straight bland and/or don't even bother, which brings down the enjoyment to 7, after all character interactions is one of the most important aspects, which is a complete fail in this anime.\r\n3. Hanasaki's character just keeps on getting annoying as he starts to face problems and develops, which is the reverse purpose of character development which is to create a emotionalconnection. It is as if I'm watching a little kid play hero, who is playing too hard on their character that is becomes straight annoying and cringe. This brought down my enjoyment to 6.\\n\\n\r\n4. The Art - it is average, but flawed in many aspects. The stages and character positions, it all felt awkward many times and just made me think \"wtf\". This is especially true further in the anime. This personally brought my enjoyment down to 5.\\n\\n\r\n5. The music is fairly average compared to many anime out there, though the soundtrack that was often heard when the 20 face fiend and Akechi interacted was fairly good, which brought the score for music to 6.\\n\\n\r\n6. The story has many many many stupid, wtf, and obvious plot holes that were produced due to a fairly poor and lazy story this anime offered, those plot holes also contributed to the annoyance that is Hanasaki, and the lowering of my enjoyment. \\n\\n\r\n7. The only real enjoyment came from Kobayashi, Kaijin, the interactions between kaijin and Akechi, and the psychiatrist dude. The others were just boring and annoying. So many of them were there just for the sake for the plot to progress, which contributed to the lazy plot. By the by the b***h slap Hanasaki received brought me some joy to my heart.\\n\\n\r\nWell, I'm sure not many going to see this, and probably not any going to care. I'm simply content to finally to be free from that annoyance I felt from Hanasaki. Either way, my opinion on this show is here, and anyone is free to read it and think what they will. \\n\\n\r\n-- Out of 10 for recommendation for whether to or not to watch this anime, I'd say 3.",
            "date": "2018-06-30T13:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 282635,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KnownasCato",
                "username": "KnownasCato"
            },
            "url": "https://myanimelist.net/reviews.php?id=282635"
        }
    ]
]