[
    [
        {
            "content": "I have issues with Katsugeki/Touken Ranbu. I honestly have no idea how UFO Table managed to take such a fantastic premise partnered with stunning animation and make it so incredibly dry. \r\nThis is my first (and probably last) experience with the Touken Ranbu franchise. I have never played the game, nor seen the other anime adaption. \r\nIt didn’t take long to get the gist of it. The two dudes with unique designs were fighting baddies to prevent history from changing. Later on, you learn what time period they’re in and that they aren’t human, but famous weapons. And . . . that’s it.\r\nWhy are thebaddies trying to change history? I don’t know. Why is Hijikata’s sword now a pretty man. I don’t know. What are those fox things? Still don’t know. What on earth do the baddies have to do to change history, since killing people, saving people, and burning cites to the ground apparently doesn’t change anything. Will anyone ever get a personality? Answer: not really. Will this plot ever get a direction? Answer: no. \\n\\n\r\nI would’ve given this anime a stupid high score if it just got rid of it’s thin excuse for a plot and bland characters and just left the stunning back drops of historical Japan and beautiful nature scenes. UFO Table has never written a character I’ve cared for, but I always keep coming back for more blandness because of flashy fight scenes and beautiful backdrops (of which Katsugeki has plenty of). \\n\\n\r\nThe problem isn’t the animation (though, I still think UFO Table’s characters tend to look a bit plastic and lack facial emotions), it’s (almost) everything else. \\n\\n\r\nMutsunokami Yoshiyuki was easily the standout character of the main group. His genki personality helped lighten up an anime that otherwise took itself too seriously. His connection to Sakamoto Ryoma (of which I am a major fan), also helped. The episode where he helped Sakamoto survive the assassination attempt at the Teradaya Inn was easily the highlight of the series (but it only really hits you in the gut if you know Sakamoto was assassinated about a year later). The other characters were too briefly introduced (all of Unit 1), too angsty and inconsistent (Izuminokami Kanesada), or too bland (everyone else). \\n\\n\r\nIzuminokami Kanesada was an especially frustrating character. Initially, he insisted that everyone “preserve history,” even if it meant letting someone die. Such a hardline approach would’ve made an interesting character. But he breaks his own rule in episode one, saving someone, and then proceeds to continue to take action that would change history (saving other people, talking to people, etc . . .) all of the while maintaining the angst level of a character that did stick to his rule. He also doesn’t seem to know the rules, telling the viewer that people are sent out in groups of two to stay under the radar, but that’s clearly untrue as far more than two people act as a group for other than the first few minutes of the series. \\n\\n\r\nIf the plot or world-building or even art or tone are interesting enough, it’s easy to overlook bland characters. But Katsugeki doesn’t offer up much. \\n\\n\r\nThe plot has no direction. The characters are given vague orders to “preserve history,” and they follow it. No one even takes any interesting action until the last few episodes and any drama about how to go about preserving history falls flat because people live and die without having any effect on the timeline whatsoever. \\n\\n\r\nThere’s also never an end goal, just beat up on random baddies until (for some unexplained reason) they give up on one time period and jump to another. Why they also just keep attacking Japan instead of a country that might mess history up even more like Rome or China, is also never explained. \\n\\n\r\nThere is also no explanation about the historical significance of the events the main characters are trying to protect. Thankfully, I knew who Katsu Kaishu, Saigo Takamori, and the others were, but if I hadn’t, I would’ve been even more lost about why the characters are protecting these people in the first place. Also, the episode featuring Sakamoto Ryoma packs a far more serious punch knowing he died about a year after the events in the episode took place - something the show hardly alludes too and not until the end.  \\n\\n\r\nThe lack of character depth, world building, plot, and explanation about anything makes it rather clear that Katsugeki isn’t interested in telling a good story. All anime try to make money, but I’d appreciate it if they tried to do so by telling a solid story instead of promoting a video game and pretty-boy sword figures. \\n\\n\\n",
            "date": "2017-09-24T18:03:00+00:00",
            "helpful_count": 41,
            "mal_id": 258596,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4127771.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PaladinAlchemist",
                "username": "PaladinAlchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=258596"
        },
        {
            "content": "Well i don't really know what to say about this Anime, it has been a mixture of feelings and thoughts.\r\nAt this moment I can say that I'm not really enjoying the series, the graphic style is not totally to my liking and what I'm not really enjoying at the moment is the anime sound content I find it quite monotonous.\r\nIn some moments the story is spectacular but some times the story gets a bit confusing.\r\nSo we just need to keep whatching and w8 till the next episode.\r\nAt the end of this season i will edit this review with more details.",
            "date": "2017-07-31T11:08:00+00:00",
            "helpful_count": 41,
            "mal_id": 254331,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6443366.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sTeVe-",
                "username": "sTeVe-"
            },
            "url": "https://myanimelist.net/reviews.php?id=254331"
        },
        {
            "content": "Note: While it's definitely not a ✧spectacular✧ anime, I definitely wouldn't say that it's horrible. For a game adaption, it's actually quite good. The game itself has little story, more or less just grinding to kill the Time Retrograde Army's monsters, so the anime added an interesting backdrop to the game. To really enjoy the anime (and be less confused), it would really help to know the game. However, even if you don't play the game, it can still be an enjoyable watch. It's also almost too early in the season to judge the anime (only 4 eps released when this was written), so Iwould say watch it or keep watching. I mean, what could go wrong, they're pretty sword boys...\\n\r\n//Will edit as the eps are released//\\n\\n\r\nStory: \\n\r\nBadass swords try to prevent the Time Retrograde Army from changing the course of history! Why do they care? Cause their master told them to do it! (more on this later)\\n\r\n6.5/10 - Okay, not too bad\\n\r\nGood for an adaption of a game with very little story. Adds another layer *to the game*. Without playing the game, it's harder to be invested in the anime, as the people the game already are interested in the characters. Even as a stand alone anime, the story isn't bad, it's just not one of those \"wow this is a ground breaking anime\" kind of thing. Honestly, even though I've seen some *quality* time travel anime, I still found the story of this one to be enjoyable and cute. Main guy has potential to push some pretty interesting character development for himself (and maybe the others) as he actually asks questions! (I wonder if my standards have lowered...) Unexpected turns occur later in the story, so keep watching! \\n\\n\r\nCharacters: \\n\r\nCool leader dude, clever trainee, hot headed guy who eventually warms up to leader dude, nice tough guy, calm+collected guy, mysterious white haired badass???\\n\r\n7/10 - Has potential! \\n\r\nThe main characters themselves are actually not as one dimensional as you might expect. Izuminokami (Leader/mentor guy) seems like the causal and jokester ish type at first, but stepped up as leader and had to keep the course of history, even if it meant casualties. I mean you can say that's just cliche, but it's a pretty hard thing to do if you don't particularly enjoy killing people. His foil (Mutsunokami), on the other hand, is very similar to him but would rather save lives, so the two have an interesting relationship. The Leader's trainee (Kunihiro) seems to be the only one that questions their master and asks \"why am I doing this\", so he has potential to become  a v e r y interesting character indeed.\\n\\n\r\nArt:\\n\r\nPRETTY SWORD BOYS \\n\r\n9/10 (nothing can compare with your name's or a silent voice's animation t_t)\\n\r\n*cough* great animation, so pretty, please watch it *-*\\n\\n\r\nEnjoyment:\\n\r\nlike the most bias part of the already bias (kinda lol) review\\n\r\n9/10 - I like this stuff \\n\r\n+I play the game, I like the anime, it makes sense\\n\r\nIt has exciting fighting sequences, funny/cute sequences in between the more significant moments, all the good stuff. It's just not ground breaking, but it does it's job. There's really no other anime like it. It's like bishounen fanservice (where it isn't harem/romance) with enjoyable story so you can really watch it for the plot.\\n\\n\r\nOverall/TLDR:\\n\r\n7/10 - Worth a watch, better than a lot of other anime in the ~6.9 range.\\n\r\n-Anime meant to support + give depth to game, you'll enjoy it more if you played the game, but still enjoyable as a stand alone anime.\\n\r\n-It's really your expectations- it's obviously *not* one of those grand masterpieces (yet? ( ͡° ͜ʖ ͡°)), so don't go in expecting that. It's an enjoyable watch with likeable characters that aren't just generic 1D eye candy. \\n\r\n-It has a lot of potential with the plot/characters, actually if they do it right. \\n\r\n-The story is fast paced with breaks inbetween, so weird pacing? but it doesn't take away from the overall anime.\\n\r\nA good anime is an anime that does it's job, and if this anime's job is to make the game more appealing and to make money, gg (would buy merch again).\\n\\n\r\nCONCLUSION: Give it a watch, just know it's purpose and not to expect something mind blowing and you'll hopefully enjoy it! ^^\\n\r\nThanks for reading! Play the game too, it's oddly satisfying?",
            "date": "2017-07-27T14:20:00+00:00",
            "helpful_count": 26,
            "mal_id": 253977,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6436312.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ariko9",
                "username": "ariko9"
            },
            "url": "https://myanimelist.net/reviews.php?id=253977"
        },
        {
            "content": "I choose to watch this anime on a whim and wasn't disappointed. . At the beginning it was difficult to understand at times because it is based on a game, so the viewer is expected to have previous knowledge of the mechanics of this world. I pieced it together myself, but otherwise I recommend finding a quick summary of this universe, because it can be complicated.\r\nStory: 7/10\r\nThe story itself was pretty good. The concept for the anime was different, and though I had read it was similar to drifters and was intrigued, it was different enough to be interesting. For the first few episodes Ifound the story to be a bit slow and somewhat predictable, but if you can plough through that the story line progresses fairly well. \\n\r\nWhat I really loved was the fact that as a viewer you can see that this anime came from a game. Its great to watch the characters complain about being put on mission after mission, like you would do to characters you control in a game. And I loved the previews for each episode.\\n\\n\r\nArt: 9/10\\n\r\nI loved the art for this anime! I honestly kept getting distracted from the plot and obvious violence by just how pretty it was. Don't get me wrong, the backgrounds at times were a bit iffy, especially compared to the character designs, but when there is blood liberally flying yet I'm still focused on a pretty face I'll say thats impressive. \\n\\n\r\nSound: 7/10\\n\r\nI was a fan of the opening and closing themes, they gave the anime a good vibe. As someone who always watches both, regardless of whether I'm binging the anime (as I did) or am watching it episode by episode, these themes were decent.\\n\r\nAs for the sound during the anime, the effects were good and the 'battle' music was well chosen, adding to the suspense.\\n\\n\r\nCharacter: 8/10\\n\r\nAs I already said, I am in love with this character design. As for the characters themselves, they were well varied and interesting. As someone who hasn't played the game (although I really want to now) or watched the other adaption, I didn't really know what to expect. \\n\r\nThe mix of personalties, while at first a bit cliche, grew on me and I loved the inclusion of a range of other characters, rather than just the main 6. \\n\r\nCharacter development was pretty good too. As I've said, at the beginning this anime is rather cliche, with the two characters (Izuminokami and Mutsunokami in this case) who constantly butt heads etc. But as the story progresses so do the characters, and their backstories, while pretty sad, were also interesting to learn as you could see how their 'owners' (that will make sense) shaped the characters.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI really enjoyed watching this anime! Although it was a bit predictable at times, I was drawn to the characters and their story and had to keep watching (as seen by the binge that ended at 6am). All of the elements worked well together and by the end I was very wrapped up by the characters and their emotional turmoil. \\n\r\nI really want to play the game now, and will find a way... eventually :)\\n\\n\r\nOverall: 8/10\\n\r\nOverall, I really enjoyed this anime. For something I chose to watch offhandedly, it was a surprising success, and I can't wait for the apparent movie adaption in the future(!). While you should probably know some of the backstory behind the story, especially the mechanics of it, if you want a challenge just do what I did and wing it.",
            "date": "2017-09-27T15:00:00+00:00",
            "helpful_count": 17,
            "mal_id": 258887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176496.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Anetheia",
                "username": "Anetheia"
            },
            "url": "https://myanimelist.net/reviews.php?id=258887"
        },
        {
            "content": "If there's one thing I'm grateful, it's that the game got adapted into the anime. I've literally enjoyed this series a lot, and now let's get on with it. \r\nStory: 7\r\nI would say that the theme is basic, preventing time traveling alternating the history in terms of major events. Simple, right?, right. I gave this a 7 because of the characters influencing the plot throughout the series, and their \"background\". Sadly not a lot was the other characters got covered but that's somewhat expected for a 1 cour series if you ask me.\r\nArt: 9\r\nHonestly, usually for any series, I'd give a 7 in terms ofanimations and whatnot because it's decent and I sure as hell can't draw. This time, however, Katsugeki Touken Ranbu was crisp and sharp, heck, frame-by-frame was good too. And the characters' art was very pretty, along with smooth animation throughout the entire time [I know what some of you are thinking about with the animation part especially \"ufotable\", lol]. \\n\\n\r\nSound: 9\\n\r\nSound? OST? Oh yes, definitely. I think the soundtracks were really suitable to the series, especially the \"strings\" and the flute part, befitting for a historical series. The action soundtracks were pretty awesome, fast paced and heavy. [Kept replaying the entire OST, lol] Also the ending song was pretty great done by Kalafina.\\n\\n\r\nCharacter: 7\\n\r\nAlthough there's quite the characters that appears in the series, the main focus is our Second Unit for the entire time.\\n\r\nAs briefly mentioned, only a couple of selected characters' 'past' were covered, but regardless, they stuck to what the story was focused on, which I really thought was a good thing. You could see some of the characters kind of developing (second unit) in the series, or at least towards the ending, somewhat. These pretty much got my 7.  \\n\\n\r\nEnjoyment: 9\\n\r\nPersonal enjoyment is definitely a 9 for me, I haven't played the game yet I kept seeing a lot of the gorgeous characters fanart without knowing anything, so I was always irked. I want to clarify it, the game is still somewhat targeted for the female fanbase so yes, there's some personal attachment to this series. \\n\r\nAs with this factor, being able to watch the anime during the entire time and getting to see the characters and their tidbits made me happy, I felt a bit closer to the franchise(?) now instead of not knowing anything before.\\n\\n\r\nOverall: 7\\n\r\nI think it's a series that's good for anyone to start, with or without playing the game. Now unfortunately, although a lot of the factors were pretty great, I do think the plot lowered it down slightly. But hey, it's still a decent series to watch if you ask me.",
            "date": "2017-09-23T12:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 258397,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5675631.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Polkadottedsky",
                "username": "Polkadottedsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=258397"
        },
        {
            "content": "Recently, Ufotable's production is just not that great, having these very poor/one sided characters and somewhat very linear story making some of their modern shows very predictable. It's just the same for Katsugeki/ Touken Ranbu. I'd rather say that this show was produced just to advertise the original game. I don't blame ufotable that much on this one because they really can't control the content by themselves but I do think the studio can do better than this. Ever since Unlimited Blade Works was produced, ufotable's overall direction went downhill.  Tho I highly praised them with their stellar visuals but it's not the samelike Fate/Zero and Kara no Kyoukai. Katsugeki/ Touken Ranbu's direction is quite generic I would say.\\n\\n\r\nThe show struggled on pacing, developing its characters and this very weird 1st episode. They just throws you right into the action without explaining anything on what's happening. The show is like forcing you to understand and feel bad for the characters without giving you any major knowledge about them. ( Minor Spoiler ) There's also this one episode where someone died but I just don't care because how plain the character was.\\n\\n\r\nAll I can say that the series lacks alot, noticeable flaws making this show generic and plain on the direction part. Although the show is very pretty but I don't know if people would like this show or not. Do I recommend you to watch it? Yeah sure, why not for starters or for you guys who just love action but I won't recommend this for people who takes anime as a serious subject/medium. For my perspective, the show is just an advertisement for the game. ( most likely for additional content ) Games like this often doesn't really work on this medium, the game has its own charm to it that you can't just take and put it on the adaptation. \\n\\n\r\nOverall - 5/10 it's not bad, it's just that ufotable can do better than this, I know they can pull it off.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-09-24T07:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 258497,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5819797.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/riorangel21",
                "username": "riorangel21"
            },
            "url": "https://myanimelist.net/reviews.php?id=258497"
        },
        {
            "content": "For a lot of anime viewers, the name Ufotable conjures up high expectations of quality. With works such as Fate/Zero and Kara no Kyoukai under their belt, it would be difficult not to blindly trust the studio to deliver masterpiece after masterpiece, especially considering how little they release compared to other studios . While many seasoned viewers have already learned this lesson, Katsugeki/Touken Ranbu is the show that really helped me understand that you shouldn’t buy into the hype and excitement simply because of a big name, as even legendary studios can deliver a clunker or two.\r\n\tFor what it’s worth, Ufotable fulfilled their end ofthe bargain. Katsugeki’s art and animation are very much on par with what I expected from this studio after seeing their adaptation of Unlimited Blade Works. The art is crisp and simply beautiful. Though much of the background art is smoke and clouds amidst a night sky, all other scenes are filled with incredible detail. The character designs themselves are beautifully and meticulously detailed and varied. Their facial expressions are vivid and the character movement in battles flows without any awkwardness. On the topic of battles, the choreography felt light in the early episodes, but is well disguised by the flashes and flying particles of the sword clashes. As I have not played the game that acted as the source material for this show, there is little that I can say about faithfulness to the design of the original. It may be because of this that I have a much harder time enjoying anything this show has to offer with its story and characters.\\n\\n\r\n\tFrom what I can gather, the story is about a bunch of historical swords that were collected by some unknown force that breathed life into them and gave them human bodies. These living weapons are now given the task of preserving time and history from the evil Time Retrograde Army that seeks to twist history by killing important historical figures. With a cool premise like that, I was rather shocked with just how boring of a slog it ended up being. The show simply doesn’t frontload enough information to let the audience get invested in its story. After 6 episodes, I still don’t know why the Time Retrograde Army wants to change history, nor do I know anything about its leaders or who the soldiers actually are. They look like shadowy samurai zombies and they are about as effective as villains as zombies typically end up being in modern media. Occasionally they are joined by some CG skeletons, but those do little to make them interesting adversaries.\\n\\n\r\n\tLikewise, little is known about the actual organization that is leading this crusade to keep history intact. Despite their clear goal, the early episodes contain numerous scenes of our characters brushing aside their duty to preserve history by saving people that should have died. Perhaps that will be something explored in later episodes, but so far it seems a little too lax despite being the premise of the show. There is, however, hope for the show. As well as the debate of “savings lives vs preserving history”, the show brings about the question of whether or not the blades are serving the right master. If Katsugeki can stop meandering from one random battle to another, then perhaps it can deliver on some legitimately interesting plot points. It will still need to do something about its characters though.\\n\\n\r\n\tThe most saddening aspect of Katsugeki is that despite its varied cast of beautifully designed characters, not a single one of them is capable of holding my interest. To give a brief rundown of their personalities: Kanesada is the serious, idealistic leader. Kunihiro is the naïve kid with a strong sense of justice. Tonbokiri is the big, papa-bear. Yagen is the strong, silent type. Yoshiyuki is the reckless, annoying goofball. Despite these somewhat varied personalities, the team seems to have no chemistry. Much of the dialogue between them is stiff, serious and devoid of any charm. This is especially disheartening for Kanesada and Kunihiro, as their particular relationship should have at least some sort of personal touch to it. On the flipside, the arguments between Kanesada and Yoshiyuki tend to bring me out of a scene with just how annoying they are, even though they should be building a sense of tension. This is all wrapped together in a bow of some really awkward attempts at humor, especially from Yoshiyuki and the team’s fox mascot Konnosuke. Yammering on and on about food wasn’t funny when Goku did it years ago, and it isn’t funny now.\\n\\n\r\n\tThough the show has a lot of merit seeing as it comes from Ufotable and a lot of promise considering the potential of its blooming plot and characters, there just isn’t enough shown to convince me that it’ll all work out somehow. When as a viewer you watch the shit hit the fan and feel nothing for the struggles of the characters, you know that the show just isn’t working for you. It doesn’t help that Katsugeki immediately follows up this “thrilling” episode with a whole lot of sitting around the Citadel and talking. Though this might be a treat for fans of the game or people who really like pretty anime dudes that occasionally do samurai stuff, I think that Katsugeki/Touken Ranbu will likely end up as one of the disappointments of the Summer 2017 season.\\n",
            "date": "2017-08-10T02:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 255111,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4682676.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dr_Sephiroth",
                "username": "Dr_Sephiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=255111"
        },
        {
            "content": "The infamous Ufotable strikes again, - to ruin another one of my favorite game franchises. This time, Touken Ranbu. \r\nTo give a slight synopsis, Touken Ranbu is an internet browser card-game that's centered around collecting and leveling historical anthromorphopized Japanese swords.\r\nLet's begin now.\r\nUfotable ruined what could've been an amazing adaptation of a game that has little, to no plot. All that is known with this given game is its historical swords, and basic character personalities (that were given a basis by Hanamaru).\r\nCharacter:\r\nMost of the characters were out-of-character, especially Kane-san. He was troped as a typical shounen protagonist, and lacked his own goofy personality.\r\nAlthough I'm awarethat dark times such as those shown in Katsugeki are no place to mess around, he was far too serious and almost lacking emotion. \\n\r\nHe's known for failing here, and there. And, having his own imperfections that were ultimately covered-up by cliches.\\n\r\nWhat angered me the most was Kane-san even raising a blade towards Hori. The two are incredibly close, and despite Hori's intentions, he'd never do such a thing.\\n\\n\r\nHori was another that I found incorrectly adapted. His character was odd in its own way - I understood his reasoning for wanting to protect Hijikata, yet he was acting overly obsessive at some points. His character is more cheerful and supportive than anything. At some points, I wondered if this was actually Hori. Despite his intentions, Hori would listen to Kane-san if he'd ever try to talk sense into him.\\n\r\nHori's character is not of one to be a rebel.\\n\\n\r\nJiji, or Mikazuki's character was far too mysterious than he actually is. Although he is indeed an incredibly strong sword (which, I know for a fact since he is the leader of my team), his part made his personality seem odd. \\n\r\nHe's nothing more than an old grandpa that loves tea. He isn't mysterious, and wouldn't hide anything to make it seem as such. \\n\\n\r\nMutsu's character was the only that was spot-on. His constant hyperactiveness, love for food, and guns; and being a literal dog, was perfect.\\n\\n\r\nStory:\\n\\n\r\nAh, now we get into the horrible plot.\\n\r\nThe climaxes, the climaxes. Must you be so terrible with these, Ufotable?\\n\r\nI decided to mention these first, since they're the key points that lost me whilst I watched Katsugeki. \\n\r\nThere are two major \"climaxes\" that occur throughout the entirety of the show.\\n\r\nThe first begins I believe in episode 10, when Hori encourages Kane-san to raise his blade towards him. This ultimately ends in a predictable drop of an intentional missed hit, and a petty response towards the latter. Neither seemed shocked to the very least, and tensions continue between the two, with the most anti-climatic drop possible.\\n\r\nThe second climax is in episode 12, where Hori joins Hijikata, and the rest of the Shinsengumi. There are many oddities with this. Knowing for a fact that Hijikata was not the one to trust easily, he let an unknown boy join him. His intentions were shown, planning to die in Hijikata's place. Kane-san soon finds out about this, once again not shocked, and proceeds to convince Hijikata to return his second sword to the boy who was to deliver it. Hori, now, not shocked by this, simply sighs and says, \"Ah, all my efforts were for nothing\".\\n\r\nWhat? What? This was a far lower drop than the first climax. They both shake it off as if nothing had happened. What is this? \\n\r\nAnd, ah, let us reach the ending. We're told in episode 12 that 1,000 members of the Retrogade Army were to appear the next day to attack, as said by Konnosuke. \\n\r\n1,000, remember. Yet, the fighting that is shown in episode 13, is nearly effortless. None of the boys take critical injuries, although 1,000 would be quite a feat to fight. But, no. It gets better. They someone how manage to defeat each enemy easily, the ending pans with a group shot. And, an \"everyone's okay, everything's okay\" finale. \\n\r\nExtra slight nit-picking, but game mechanics were thrown out the window here.\\n\r\nYou cannot summon another sword in the midst of a battle.\\n\\n\r\nSound/Art:\\n\\n\r\nI very much liked the opening and ending sequences. The opening had historical easter-eggs regarding each sword's master and their deaths which I found very interesting and a great addition. The song itself is catchy, which I enjoyed a lot.\\n\r\nThe ending's song was good as well, and the animation itself had me and my friend create a theory of a possible ending to the anime (rip).\\n\r\nThe animation itself is great, obviously. It's Ufotable. The effects were outstanding, as well as the fight scenes.\\n\\n\r\nIn conclusion.\\n\\n\r\nStory: 4/10\\n\r\nArt: 9/10\\n\r\nSound: 7/10\\n\r\nCharacter: 4/10\\n\r\nEnjoyment: 3/10\\n\r\nOverall: ??/10\\n\\n\\n\\n\\n\\n",
            "date": "2017-10-14T18:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 260785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6441329.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ari-e-s",
                "username": "ari-e-s"
            },
            "url": "https://myanimelist.net/reviews.php?id=260785"
        },
        {
            "content": "When I saw this anime at first, I didn't really think that I'm gonna like it, since it seems that my fav characters from Touranbu won't be there, but after I watched some episodes, it felt like, I can take a liking to these characters since they unfold the characters' feeling really well in here.\r\nCompared to Hanamaru, this one's is really deep in story and feeling (oh, I do love Hanamaru btw).. And their fighting scene is so cool and pretty! Not only the fighting scene, but every scene is portrayed beautifully and so detailed.. I cried in some episodes.. Their final battle was superb!And the BGMs, OP & ED song are also awesome!\\n\r\nI'm waiting for the movie version! I hope they'll make the 2nd season as well (not only a movie) with the other characters as the main! Love this!",
            "date": "2018-01-07T04:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 267762,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6276881.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Unyil",
                "username": "Unyil"
            },
            "url": "https://myanimelist.net/reviews.php?id=267762"
        },
        {
            "content": "****SPOILER FREE****\r\nBlurb: Katanagatari meets Fate/Stay Night. \r\nThe concept of weapons (especially swords) being presented as sentient beings/characters is hardly the re-invention of the wheel. Katsugeki/Touken Ranbu borrows elements from several Fantasy/Action shows and brings them together in a stunning and beautiful tapestry which only UFOtable can do. \r\nIn terms of story, there's nothing too complicated. Neither are the personalities of the various swords that have been summoned in Human form. You have your typical mixture of goofy, serious, innocent, broody, hot-heads & philosophers who at various times during the show bring up the age old question of ends justifying the means. \r\nSome moments and episodesare genuinely well put together but on the whole, the series offers nothing new or groundbreaking in terms of a story. If anything, there are plot-points that have been simply ignored, and at the end you are left with no clear vision as to exactly who or what the villain/s are. Perhaps they are saving further development for the second season, but there should have been SOME explanation as to why the swords and their master do what they do, and what series of events led them to do this moment. \\n\\n\r\nHands down the one and only reason (for me) to watch this show were the visuals, which are breathtaking. In the end all that can be said about the 'Wild dance of Swords' is that it's worth watching for just that. The dance, the swords and the costumes.",
            "date": "2017-10-01T06:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 259371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006740.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DemonKingRavan",
                "username": "DemonKingRavan"
            },
            "url": "https://myanimelist.net/reviews.php?id=259371"
        },
        {
            "content": "I have very mixed feelings about this show. What started off strong as a feudal era samurai show with stuff from the future kind of like drifters basically just collapsed in on itself, I can't even bring myself to care enough to follow the plot anymore and am probably just going to end up dropping it. The show starts with some very nice artwork but it lacks basically anything else.\r\nThe cast is painfully generic, there are way too many people and not enough actual character development. People get killed or injured or replaced in a lot of the episodes, and the villains are faceless armiesof gun/sword fodder that die in one hit. \\n\\n\r\nThe artwork is typical of Ufotable, looks a lot like any fate show. I think the show's backgrounds don't vary enough though, and end up all looking the same. The sound is about average, although the cat thing's voice gets on my nerves. Songs and music are forgettable.\\n\\n\r\nEnjoyment and overall go hand and hand. I wanted to like this show, but it is is just really, really boring. The enemies are uninteresting, the characters are uninteresting, the background is pretty but fairly uninteresting, the sound is uninteresting and the show as a whole is just uninteresting. \\n\\n\\n\r\nI can't honestly say I actually enjoy this show, and really would suggest skipping this unless you are a diehard Ufotable fan. Fate Apocorypta airing at the same time has similar artwork and has a MUCH better plot and cast of characters.\\n\\n",
            "date": "2017-09-09T18:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 257202,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3443221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/seanm826",
                "username": "seanm826"
            },
            "url": "https://myanimelist.net/reviews.php?id=257202"
        },
        {
            "content": "There are anime you can watch without knowing anything about them beforehand and there are others anime that, sadly, need you to do some more effort before you can actually enjoy them to the fullest. As crazy as that sounds, katsugeki touken ranbu is part of the latest group of anime. Theres no other way to put it: you need to read about the game or at least some summaries about what touken ranbu is before you can watch this series. Otherwise you'll find yourself confused about the swords, their purpose and everything that is going on in the episodes, tho not very much happenedso far. \\n\r\nLike hanamaru, katsugeki was made for people who already know about touken ranbu OR want to know more about it. \\n\\n\r\nSTORY: 7/10\\n\r\nThe story itself is pretty simple: history is getting f*cked up and swords who now have human bodies have the duty to fix it. Some episodes are slower than others, some might feel like being a little dragged on, but so far i feel like its very enjoyable (at least for the people who already know what kind of setting touken ranbu is, like i already said.). The little slice of life moments also make the anime very enjoyable and kinda reminds me of Hanamaru!\\n\\n\r\nART: 8/10\\n\r\nI must say at first i didnt really like it, but after some episodes i kinda grew attached to it. The characters look good and waaaay more better than the previous adaptation. Sometime the backgrounds look kinda... weird, but its not bothering me too much honestly. Overall i'd say the art fits the atmosphere and the characters well.\\n\\n\r\nSOUND 7/10\\n\r\nI saw a huge fuss coming out because of the opening, some people like it, others hated it. Personally i really like it. It kinda gives me those epic-ish vibes i was expecting from this series, same goes for the ED (bless you kalafina, you are literal goddesses.). The ost itself doesnt sound too bad, but i'll need to listen to the full tracks more once it comes out to 100% enjoy it.\\n\\n\r\nCHARACTERS 7/10\\n\r\nHere we go. Okay, so, how the characters are portrayed in katsugeki is totally different from how they were in hanamaru and how they are in-game. So what is the canon? You choose it. Playing the game made me like certain characters, and watching the 2 anime adaptations made me like some minor characters more. Personally, i love Tonbokiri because he's the sweetest guy around but Izuminokami and Mutsunokami (who's my starter in the game ah!) are also faves. Jiji is a reaaaaaally interesting character here in Katsugeki, i really like how they are portraying him. Anyway, theres PLENTY of characters for you to choose from, if you watch the series + read about them on the wikia i'm sure you'll end up loving two or even more. As for people saying the charas and the anime itself is fujoshibait... why don't you cater your attention on something else? Sure there might be some 'shippy' moments here and there, but those arent the main focus here. I can't really say the characters have extra deep personalities, but some of them are indeed interesting. I'd love for people who start the anime to not have their mind already set like 'It's gonna be bad anyway and the characters are just fujobait' because its not like this. Give these touken danshi a chance, c'mon. \\n\\n\r\nENJOYMENT: 7/10\\n\r\nBeing already a fan of touken ranbu sure helped me enjoy more this (and Hanamaru). Maybe sometime its a liiittle bit slow and i wonder how they'll wrap things up, but i'm definitely liking it!\\n\\n\r\nOVERALL 7/10\\n\r\nKatsugeki for me it's a solid 7/10. Not too good but not bad either. Maybe it'd be more of a 7.5 because i have to be honest and admit that there are things i REALLY like about it, but that probably arent enough for me to give it a full 8. Anyway i think a 7 is a fair score for Katsugeki and also well deserved! If the anime ends with too much of an open ending i hope we'll get a 2nd season to complete it. \\n",
            "date": "2017-08-19T14:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 255835,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436096.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/franciu",
                "username": "franciu"
            },
            "url": "https://myanimelist.net/reviews.php?id=255835"
        },
        {
            "content": "Story (3/10):\r\nFor me, the story didn't capture my attention at all. I gave it the good \"watch the first 4 episodes\" test and could barely make it through the 4th one. I know that the origin of this adaptation is from a game, but in my experience, most game to anime adaptations aren't that successful and interesting. I guess it's pretty hard to write an adaptation on something that's supposed to interact with viewers in a different way.\r\nArt (9/10):\r\nUnfortunately, the art style for this series is beautiful. I love the coloring, the style, the animation, and just everything about the art. It made me reallywant to like the show, but I couldn't continue with it just because the art was nice to look at.\\n\\n\r\nSound (5/10):\\n\r\nThe sound didn't do anything in particular for me, but I admit that the op was a good one and I enjoyed it. Everything else wasn't memorable for me and I can't say that it stuck as a set of tracks I'd go desperately looking for to listen to again.\\n\\n\r\nCharacter (7/10):\\n\r\nMost of the characters I really enjoyed! It was another aspect about this anime that made it really unfortunate that the story is so...uninteresting. I liked their dynamics with one another despite being so different and I liked that each and every personality was different from one another. It made the viewers have a variety, not just a big lump of similar people all in one place.\\n\\n\r\nEnjoyment (4/10):\\n\r\nMy official rating for this show was a 4 and I can easily say that my enjoyment level is the same number. I wanted to like this show, especially because I was recommended this one by someone close to me, but I just couldn't get into it. The plot wasn't interesting and I couldn't stick to a show just because the art was nice and the characters interested me.\\n\\n\r\nOverall (4/10):\\n\r\nI wouldn't recommend this one to anyone. If someone likes it, good on them, but it personally was stale and could've been so much better as far as the plot goes. It definitely seems like most of their effort went to the art and the personalities of the characters, but if only the studio has delivered the same for the story. If that were the case, maybe I would be writing a different review right now.",
            "date": "2018-04-13T17:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 277992,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rachachan",
                "username": "rachachan"
            },
            "url": "https://myanimelist.net/reviews.php?id=277992"
        },
        {
            "content": "KATSUGEKI TOUKEN RANBU ANIME REVIEW\r\n(04042018)\r\nWARNING : SPOILER ALERT\r\nOVERALL: 8.2\r\nPLOT: 8/10\r\nIf you have the ability to turn back the time, will you make the wrong decisions right? Will you change and alter the future that awaits you? If you have the power to change every mistakes you've made, every person that perish right in front of your eyes, will you just stand and do nothing? This anime focuses on the history of their country, their hero, the people who fight for it, and the importance of their sword and being a warrior in their life. I love this kind of genre. The history is too interesting.It is kind of intense how they struggle not to alter and only protect the history from those who want to change it eventhough they themselves want it to change also. How loyal the sword is from their master and how they also feel the same pain their master does. This series is not perfect, yes. But it consists of an element perfect enough to make the story interesting and will keep you going.\\n\\n\r\nCHARACTER: 9/10\\n\\n\r\nI love all the characters in this series, not only because they're gorgeous or they have that cute faces or they have that strength, but because they all have that belief they all carrying in their hearts. They're also waving when a certain situation needs them to decide if they will follow their duty or their loyalty. In my opinion, the only thing that all of the characters failed to justify is their strong belief not to change the history which surpasses their loyalty with their previous master.\\n\\n\r\nSOUND AND ANIMATION: 8/10\\n\\n\r\nThere's nothing to comment in the animation of this series. It is definitely a crowd of handsome boys. Whatever the expression of their faces will always be spectacular. But still, I find some of the characters confusing since their voices is quite not compatible with the appearance. Other than that, I think the animation is flawless. The opening and ending song is the same, if I'm not mistaken. Though it's not that catchy for me, it is fine.\\n\\n\r\nENJOYMENT: 9/10\\n\\n\r\nAction based, it is great. I've enjoyed all of the fighting in this series, as well as the history being shown. I also like the comedy added into this one. The disadvantages given to the protagonists which render them awed is also a good watch.\\n\\n\r\nENDING: 7/10\\n\\n\r\nOnce the story come to a close, it is a must to answer all of the loopholes. It is a given to explain every single question in their mind. Though the ending is really heartbreaking, kinda unpredictable and satisfying enough, some of the questions still remain. I guess, the continuation can be found in the game itself since the animation is just an advertisement for it. But I'm still hoping for season 2. :)",
            "date": "2018-04-08T18:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 277465,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6349777.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Castinate",
                "username": "Castinate"
            },
            "url": "https://myanimelist.net/reviews.php?id=277465"
        },
        {
            "content": "There are benefits on watching a show without knowing the source material: you don't create expectation.\r\nI was interested on this anime because the amazing artwork, especially Tsurumaru and Mikazuki. I know nothing of the game, the mechanics, the enemies, or anything else: to me there is only cool looking samurais fighting evil looking enemies (and lots of fujoshi artwork)\r\nSomehow my desire to see a character I personally find amazing, made me break the Three Episode Rule and when he finally appearead I just... continued watching the show with a blank expression on my face.\r\nThis anime is a redundant (pretty looking) shallowness.\r\nAlso... I know from thefirst episode that the sole purpose of the touken danshi is to preserve history... but they tell this to the viewer at least 7 times per episode. If you play a drinking game and take a shot everytime you hear a character saying \"rekishi o mamoru\" you'll be wasted in no time.\\n\\n\r\nUnless you are a fan of the game, skip it\\n",
            "date": "2017-12-16T16:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 265375,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5355740.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JackYagami",
                "username": "JackYagami"
            },
            "url": "https://myanimelist.net/reviews.php?id=265375"
        },
        {
            "content": "From the studio that animated the ultra-popular Fate series, Ufotable brings in another great anime, Katsugeki Touken Ranbu. Quite the underrated anime, it's got many good things going for it and is absolutely worth a try despite the unfortunate unfair low ratings.\r\nStory: 7/10\r\nAlthough a great story, it feels quite rushed. I'll start with the positives, it clearly explains itself at first of what situations the characters are going through until the midpoint. The plot progresses a bit fast from what I'm accustomed to and felt too fast especially towards the end. Sadly 13 episodes weren't enough as it felt things were confusing at times, ifit were even a 24 episode anime it would've done better. But nonetheless, it tried to convey it's meaning by most of the time improving it's characters later on.\\n\\n\r\nArt: 10/10\\n\\n\r\nIt's Ufotable what do you expect? The fairly new studio (compared to most other ones) in the TV anime market has surpassed industry greats like Kadokawa and JC Staff, 2 of the best studios who make some of the best looking animes EVER. And I'm totally not fanboying. The Fate series was also highly praised for it's breathtaking art only seen in some anime movies, and Ufotable has certainly knocked the ball out here once again. The fight scenes were superior if you ask me and the character design was also something Ufotable greatly built upon here. Definitely one of the best looking anime out there.\\n\\n\r\nSound: 9/10\\n\\n\r\nThe sound was brilliant. As a matter of fact, EVERY VA perfectly did their role and did a very very good job. Meanwhile the OST was more memorable then the Fate series' as the Violin powerfully stabbed through my brain. I was terribly addicted to listening to the OST. The OP and ED though were great but we're very similar to the Fate series' too and that may be a problem as it has too many similarities with the aforementioned show. But otherwise excellent.\\n\\n\r\nCharacters: 7/10\\n\\n\r\nThe characters were amazing. Simply said, I loved each and every one of them. But why a 7? It's because there were TOO MANY of them and there was VERY LESS TIME to focus on each one of them. Each character had their own unique personalities that's true, but the issue is that just about 3 or 4 of them actually developed further in 13 episodes. Apart from that though I said their personalities were unique, it felt as if some were exact clones of another and the First unit rarely ever got a proper arc. No effort was done to show anything about them. The Master also was rarely shown and his reasons for his actions were not even talked about... \\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThose who've checked my account might know I'm currently watching Gintama. And there's not much serious action neither are there any frequent fight scenes. Though after a particular arc I craved for such action and stumbled upon Katsugeki Touken Ranbu. I wanted epic action sequences and Ufotable was the go-to studio for that. Known for their brilliance in the Art field I confidently started the series Knowing I'll get what I want and I wasn't wrong. What I got was some teeth gritting action sequences that made you go \"Woah\" in awe. Couple that with a suspenseful storyline and a colorful set of characters (a LOT of them) and you've got yourself one heck of an awesome anime to delve into.\\n\\n\r\nOverall: 8.4\\n\\n\r\nKatsugeki Touken Ranbu is an anime that has it all going for it. If you love action sequences, love a large amount of characters, want the BEST art an anime studio could ever give, Katsugeki Touken Ranbu is the quintessential example of the aforementioned expectations. It hits damn hard to home with those screenshot worthy art everywhere. Sadly it like Aoyama kun was another of the unfortunate examples of great anime that were unfortunately overlooked. It deserved as much attention as the Fate series if not greater. But well, hopefully next year's movie adaptation can hopefully protect the future of the great anime.\\n\\n\r\nP.S: No girls in this anime was something I as a romance fan was like \"MASAKA???\" for but in the end it was fun. There were tons of things here that you wouldn't obviously find in Romance animes and being one of my first big footsteps outside of my Romance/Comedy bubble I can confidently say it was a good one for now ;)",
            "date": "2017-10-13T08:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 260668,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=260668"
        },
        {
            "content": "Katsugeki/Touken Ranbu is an action anime set in 19th century Japan for the most part. I thought the show was alright but it definitely could have been better.\r\nThe story was mediocre in my opinion. It was bland in the beginning up until a point near the halfway point of the series where it then had a 2-3 episode run of great episodes after which it then returned to a bland state.\r\nThe art on the other hand, was outstanding as one can expect from studio ufotable. The animation for the action sequences were also very good. The soundtrack was nicely done and the sound design oncertain effects stood out to me as well.\\n\r\nWhile the show looks and sounds great, the characters suffer from much of the same problems as the story does. It was difficult to get invested into what the characters were going through(the anime managed to do this at one point but it was then done away with soon after) which is unfortunate because I believe that this was a missed opportunity.\\n\r\nIn the end Katsugeki/Touken Ranbu is a beautifully drawn show that has no deep impact or enjoyment to be derived from it.",
            "date": "2017-09-23T20:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 258438,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=258438"
        },
        {
            "content": "Now if you're just perusing through, trying to see if this anime is worth a watch but is a little bit turned off by the overall score it has received (so far) then I would say that you're better off watching something else. \r\nSounds harsh but here's the thing, if you're like me and is part of the \"I know the background story of the characters and overall plot line because I actually play the game\" group then watching these sword boys in ufotable action (they've done a spectacular job so far with this series despite the general consensus of quality drop with the Fateseries) is a total treat. The pacing in this anime is quite fast, so if you're part of the other group who's just watching without any clue about the characters/plot and is trying to hopefully understand as you go..you're gonna have a little bit of a struggle. \\n\\n\r\nThere's a handful of sword boys (all the guys are swords. surprise) so it would take a long series to fully focus and develop each and every single one of their characters. With that said, don't go into this expecting a superb character development and smooth flowing plot because to be honest, even the plot/mechanic of the actual game involves you taking your sword units back and forth multiple timelines to stop the Time Retrograde Army from screwing with historical events. Really wish there's a better prequel to the franchise that could help viewers understand without needing to be a player of the game itself that I could recommend but even Tourabu Hanamaru is more of a fan service \"cute (sword) boys doing cute things\"\\n\\n\r\ntl;dr: based off an online game where you sacrifice your soul to forge sword (boys) and take them to the front line (sorties) back in time to fight bad dudes (Time Retrograde Army). there are many sword (boys) so don't expect to be able to fully understand each of the characters introduced and their background story in a short adaptation. which leads to being able to have a firm grasp on the overall plot line that has realistic historical events/figures who're owners to the sword (boys). watch with an open mind if you're a casual viewer.",
            "date": "2017-08-27T20:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 256388,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1100821.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nekoma",
                "username": "nekoma"
            },
            "url": "https://myanimelist.net/reviews.php?id=256388"
        }
    ],
    [
        {
            "content": "I have issues with Katsugeki/Touken Ranbu. I honestly have no idea how UFO Table managed to take such a fantastic premise partnered with stunning animation and make it so incredibly dry. \r\nThis is my first (and probably last) experience with the Touken Ranbu franchise. I have never played the game, nor seen the other anime adaption. \r\nIt didn’t take long to get the gist of it. The two dudes with unique designs were fighting baddies to prevent history from changing. Later on, you learn what time period they’re in and that they aren’t human, but famous weapons. And . . . that’s it.\r\nWhy are thebaddies trying to change history? I don’t know. Why is Hijikata’s sword now a pretty man. I don’t know. What are those fox things? Still don’t know. What on earth do the baddies have to do to change history, since killing people, saving people, and burning cites to the ground apparently doesn’t change anything. Will anyone ever get a personality? Answer: not really. Will this plot ever get a direction? Answer: no. \\n\\n\r\nI would’ve given this anime a stupid high score if it just got rid of it’s thin excuse for a plot and bland characters and just left the stunning back drops of historical Japan and beautiful nature scenes. UFO Table has never written a character I’ve cared for, but I always keep coming back for more blandness because of flashy fight scenes and beautiful backdrops (of which Katsugeki has plenty of). \\n\\n\r\nThe problem isn’t the animation (though, I still think UFO Table’s characters tend to look a bit plastic and lack facial emotions), it’s (almost) everything else. \\n\\n\r\nMutsunokami Yoshiyuki was easily the standout character of the main group. His genki personality helped lighten up an anime that otherwise took itself too seriously. His connection to Sakamoto Ryoma (of which I am a major fan), also helped. The episode where he helped Sakamoto survive the assassination attempt at the Teradaya Inn was easily the highlight of the series (but it only really hits you in the gut if you know Sakamoto was assassinated about a year later). The other characters were too briefly introduced (all of Unit 1), too angsty and inconsistent (Izuminokami Kanesada), or too bland (everyone else). \\n\\n\r\nIzuminokami Kanesada was an especially frustrating character. Initially, he insisted that everyone “preserve history,” even if it meant letting someone die. Such a hardline approach would’ve made an interesting character. But he breaks his own rule in episode one, saving someone, and then proceeds to continue to take action that would change history (saving other people, talking to people, etc . . .) all of the while maintaining the angst level of a character that did stick to his rule. He also doesn’t seem to know the rules, telling the viewer that people are sent out in groups of two to stay under the radar, but that’s clearly untrue as far more than two people act as a group for other than the first few minutes of the series. \\n\\n\r\nIf the plot or world-building or even art or tone are interesting enough, it’s easy to overlook bland characters. But Katsugeki doesn’t offer up much. \\n\\n\r\nThe plot has no direction. The characters are given vague orders to “preserve history,” and they follow it. No one even takes any interesting action until the last few episodes and any drama about how to go about preserving history falls flat because people live and die without having any effect on the timeline whatsoever. \\n\\n\r\nThere’s also never an end goal, just beat up on random baddies until (for some unexplained reason) they give up on one time period and jump to another. Why they also just keep attacking Japan instead of a country that might mess history up even more like Rome or China, is also never explained. \\n\\n\r\nThere is also no explanation about the historical significance of the events the main characters are trying to protect. Thankfully, I knew who Katsu Kaishu, Saigo Takamori, and the others were, but if I hadn’t, I would’ve been even more lost about why the characters are protecting these people in the first place. Also, the episode featuring Sakamoto Ryoma packs a far more serious punch knowing he died about a year after the events in the episode took place - something the show hardly alludes too and not until the end.  \\n\\n\r\nThe lack of character depth, world building, plot, and explanation about anything makes it rather clear that Katsugeki isn’t interested in telling a good story. All anime try to make money, but I’d appreciate it if they tried to do so by telling a solid story instead of promoting a video game and pretty-boy sword figures. \\n\\n\\n",
            "date": "2017-09-24T18:03:00+00:00",
            "helpful_count": 41,
            "mal_id": 258596,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4127771.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/PaladinAlchemist",
                "username": "PaladinAlchemist"
            },
            "url": "https://myanimelist.net/reviews.php?id=258596"
        },
        {
            "content": "Well i don't really know what to say about this Anime, it has been a mixture of feelings and thoughts.\r\nAt this moment I can say that I'm not really enjoying the series, the graphic style is not totally to my liking and what I'm not really enjoying at the moment is the anime sound content I find it quite monotonous.\r\nIn some moments the story is spectacular but some times the story gets a bit confusing.\r\nSo we just need to keep whatching and w8 till the next episode.\r\nAt the end of this season i will edit this review with more details.",
            "date": "2017-07-31T11:08:00+00:00",
            "helpful_count": 41,
            "mal_id": 254331,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6443366.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sTeVe-",
                "username": "sTeVe-"
            },
            "url": "https://myanimelist.net/reviews.php?id=254331"
        },
        {
            "content": "Note: While it's definitely not a ✧spectacular✧ anime, I definitely wouldn't say that it's horrible. For a game adaption, it's actually quite good. The game itself has little story, more or less just grinding to kill the Time Retrograde Army's monsters, so the anime added an interesting backdrop to the game. To really enjoy the anime (and be less confused), it would really help to know the game. However, even if you don't play the game, it can still be an enjoyable watch. It's also almost too early in the season to judge the anime (only 4 eps released when this was written), so Iwould say watch it or keep watching. I mean, what could go wrong, they're pretty sword boys...\\n\r\n//Will edit as the eps are released//\\n\\n\r\nStory: \\n\r\nBadass swords try to prevent the Time Retrograde Army from changing the course of history! Why do they care? Cause their master told them to do it! (more on this later)\\n\r\n6.5/10 - Okay, not too bad\\n\r\nGood for an adaption of a game with very little story. Adds another layer *to the game*. Without playing the game, it's harder to be invested in the anime, as the people the game already are interested in the characters. Even as a stand alone anime, the story isn't bad, it's just not one of those \"wow this is a ground breaking anime\" kind of thing. Honestly, even though I've seen some *quality* time travel anime, I still found the story of this one to be enjoyable and cute. Main guy has potential to push some pretty interesting character development for himself (and maybe the others) as he actually asks questions! (I wonder if my standards have lowered...) Unexpected turns occur later in the story, so keep watching! \\n\\n\r\nCharacters: \\n\r\nCool leader dude, clever trainee, hot headed guy who eventually warms up to leader dude, nice tough guy, calm+collected guy, mysterious white haired badass???\\n\r\n7/10 - Has potential! \\n\r\nThe main characters themselves are actually not as one dimensional as you might expect. Izuminokami (Leader/mentor guy) seems like the causal and jokester ish type at first, but stepped up as leader and had to keep the course of history, even if it meant casualties. I mean you can say that's just cliche, but it's a pretty hard thing to do if you don't particularly enjoy killing people. His foil (Mutsunokami), on the other hand, is very similar to him but would rather save lives, so the two have an interesting relationship. The Leader's trainee (Kunihiro) seems to be the only one that questions their master and asks \"why am I doing this\", so he has potential to become  a v e r y interesting character indeed.\\n\\n\r\nArt:\\n\r\nPRETTY SWORD BOYS \\n\r\n9/10 (nothing can compare with your name's or a silent voice's animation t_t)\\n\r\n*cough* great animation, so pretty, please watch it *-*\\n\\n\r\nEnjoyment:\\n\r\nlike the most bias part of the already bias (kinda lol) review\\n\r\n9/10 - I like this stuff \\n\r\n+I play the game, I like the anime, it makes sense\\n\r\nIt has exciting fighting sequences, funny/cute sequences in between the more significant moments, all the good stuff. It's just not ground breaking, but it does it's job. There's really no other anime like it. It's like bishounen fanservice (where it isn't harem/romance) with enjoyable story so you can really watch it for the plot.\\n\\n\r\nOverall/TLDR:\\n\r\n7/10 - Worth a watch, better than a lot of other anime in the ~6.9 range.\\n\r\n-Anime meant to support + give depth to game, you'll enjoy it more if you played the game, but still enjoyable as a stand alone anime.\\n\r\n-It's really your expectations- it's obviously *not* one of those grand masterpieces (yet? ( ͡° ͜ʖ ͡°)), so don't go in expecting that. It's an enjoyable watch with likeable characters that aren't just generic 1D eye candy. \\n\r\n-It has a lot of potential with the plot/characters, actually if they do it right. \\n\r\n-The story is fast paced with breaks inbetween, so weird pacing? but it doesn't take away from the overall anime.\\n\r\nA good anime is an anime that does it's job, and if this anime's job is to make the game more appealing and to make money, gg (would buy merch again).\\n\\n\r\nCONCLUSION: Give it a watch, just know it's purpose and not to expect something mind blowing and you'll hopefully enjoy it! ^^\\n\r\nThanks for reading! Play the game too, it's oddly satisfying?",
            "date": "2017-07-27T14:20:00+00:00",
            "helpful_count": 26,
            "mal_id": 253977,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6436312.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ariko9",
                "username": "ariko9"
            },
            "url": "https://myanimelist.net/reviews.php?id=253977"
        },
        {
            "content": "I choose to watch this anime on a whim and wasn't disappointed. . At the beginning it was difficult to understand at times because it is based on a game, so the viewer is expected to have previous knowledge of the mechanics of this world. I pieced it together myself, but otherwise I recommend finding a quick summary of this universe, because it can be complicated.\r\nStory: 7/10\r\nThe story itself was pretty good. The concept for the anime was different, and though I had read it was similar to drifters and was intrigued, it was different enough to be interesting. For the first few episodes Ifound the story to be a bit slow and somewhat predictable, but if you can plough through that the story line progresses fairly well. \\n\r\nWhat I really loved was the fact that as a viewer you can see that this anime came from a game. Its great to watch the characters complain about being put on mission after mission, like you would do to characters you control in a game. And I loved the previews for each episode.\\n\\n\r\nArt: 9/10\\n\r\nI loved the art for this anime! I honestly kept getting distracted from the plot and obvious violence by just how pretty it was. Don't get me wrong, the backgrounds at times were a bit iffy, especially compared to the character designs, but when there is blood liberally flying yet I'm still focused on a pretty face I'll say thats impressive. \\n\\n\r\nSound: 7/10\\n\r\nI was a fan of the opening and closing themes, they gave the anime a good vibe. As someone who always watches both, regardless of whether I'm binging the anime (as I did) or am watching it episode by episode, these themes were decent.\\n\r\nAs for the sound during the anime, the effects were good and the 'battle' music was well chosen, adding to the suspense.\\n\\n\r\nCharacter: 8/10\\n\r\nAs I already said, I am in love with this character design. As for the characters themselves, they were well varied and interesting. As someone who hasn't played the game (although I really want to now) or watched the other adaption, I didn't really know what to expect. \\n\r\nThe mix of personalties, while at first a bit cliche, grew on me and I loved the inclusion of a range of other characters, rather than just the main 6. \\n\r\nCharacter development was pretty good too. As I've said, at the beginning this anime is rather cliche, with the two characters (Izuminokami and Mutsunokami in this case) who constantly butt heads etc. But as the story progresses so do the characters, and their backstories, while pretty sad, were also interesting to learn as you could see how their 'owners' (that will make sense) shaped the characters.\\n\\n\r\nEnjoyment: 9/10\\n\r\nI really enjoyed watching this anime! Although it was a bit predictable at times, I was drawn to the characters and their story and had to keep watching (as seen by the binge that ended at 6am). All of the elements worked well together and by the end I was very wrapped up by the characters and their emotional turmoil. \\n\r\nI really want to play the game now, and will find a way... eventually :)\\n\\n\r\nOverall: 8/10\\n\r\nOverall, I really enjoyed this anime. For something I chose to watch offhandedly, it was a surprising success, and I can't wait for the apparent movie adaption in the future(!). While you should probably know some of the backstory behind the story, especially the mechanics of it, if you want a challenge just do what I did and wing it.",
            "date": "2017-09-27T15:00:00+00:00",
            "helpful_count": 17,
            "mal_id": 258887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176496.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Anetheia",
                "username": "Anetheia"
            },
            "url": "https://myanimelist.net/reviews.php?id=258887"
        },
        {
            "content": "If there's one thing I'm grateful, it's that the game got adapted into the anime. I've literally enjoyed this series a lot, and now let's get on with it. \r\nStory: 7\r\nI would say that the theme is basic, preventing time traveling alternating the history in terms of major events. Simple, right?, right. I gave this a 7 because of the characters influencing the plot throughout the series, and their \"background\". Sadly not a lot was the other characters got covered but that's somewhat expected for a 1 cour series if you ask me.\r\nArt: 9\r\nHonestly, usually for any series, I'd give a 7 in terms ofanimations and whatnot because it's decent and I sure as hell can't draw. This time, however, Katsugeki Touken Ranbu was crisp and sharp, heck, frame-by-frame was good too. And the characters' art was very pretty, along with smooth animation throughout the entire time [I know what some of you are thinking about with the animation part especially \"ufotable\", lol]. \\n\\n\r\nSound: 9\\n\r\nSound? OST? Oh yes, definitely. I think the soundtracks were really suitable to the series, especially the \"strings\" and the flute part, befitting for a historical series. The action soundtracks were pretty awesome, fast paced and heavy. [Kept replaying the entire OST, lol] Also the ending song was pretty great done by Kalafina.\\n\\n\r\nCharacter: 7\\n\r\nAlthough there's quite the characters that appears in the series, the main focus is our Second Unit for the entire time.\\n\r\nAs briefly mentioned, only a couple of selected characters' 'past' were covered, but regardless, they stuck to what the story was focused on, which I really thought was a good thing. You could see some of the characters kind of developing (second unit) in the series, or at least towards the ending, somewhat. These pretty much got my 7.  \\n\\n\r\nEnjoyment: 9\\n\r\nPersonal enjoyment is definitely a 9 for me, I haven't played the game yet I kept seeing a lot of the gorgeous characters fanart without knowing anything, so I was always irked. I want to clarify it, the game is still somewhat targeted for the female fanbase so yes, there's some personal attachment to this series. \\n\r\nAs with this factor, being able to watch the anime during the entire time and getting to see the characters and their tidbits made me happy, I felt a bit closer to the franchise(?) now instead of not knowing anything before.\\n\\n\r\nOverall: 7\\n\r\nI think it's a series that's good for anyone to start, with or without playing the game. Now unfortunately, although a lot of the factors were pretty great, I do think the plot lowered it down slightly. But hey, it's still a decent series to watch if you ask me.",
            "date": "2017-09-23T12:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 258397,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5675631.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Polkadottedsky",
                "username": "Polkadottedsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=258397"
        },
        {
            "content": "Recently, Ufotable's production is just not that great, having these very poor/one sided characters and somewhat very linear story making some of their modern shows very predictable. It's just the same for Katsugeki/ Touken Ranbu. I'd rather say that this show was produced just to advertise the original game. I don't blame ufotable that much on this one because they really can't control the content by themselves but I do think the studio can do better than this. Ever since Unlimited Blade Works was produced, ufotable's overall direction went downhill.  Tho I highly praised them with their stellar visuals but it's not the samelike Fate/Zero and Kara no Kyoukai. Katsugeki/ Touken Ranbu's direction is quite generic I would say.\\n\\n\r\nThe show struggled on pacing, developing its characters and this very weird 1st episode. They just throws you right into the action without explaining anything on what's happening. The show is like forcing you to understand and feel bad for the characters without giving you any major knowledge about them. ( Minor Spoiler ) There's also this one episode where someone died but I just don't care because how plain the character was.\\n\\n\r\nAll I can say that the series lacks alot, noticeable flaws making this show generic and plain on the direction part. Although the show is very pretty but I don't know if people would like this show or not. Do I recommend you to watch it? Yeah sure, why not for starters or for you guys who just love action but I won't recommend this for people who takes anime as a serious subject/medium. For my perspective, the show is just an advertisement for the game. ( most likely for additional content ) Games like this often doesn't really work on this medium, the game has its own charm to it that you can't just take and put it on the adaptation. \\n\\n\r\nOverall - 5/10 it's not bad, it's just that ufotable can do better than this, I know they can pull it off.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-09-24T07:14:00+00:00",
            "helpful_count": 9,
            "mal_id": 258497,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5819797.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/riorangel21",
                "username": "riorangel21"
            },
            "url": "https://myanimelist.net/reviews.php?id=258497"
        },
        {
            "content": "For a lot of anime viewers, the name Ufotable conjures up high expectations of quality. With works such as Fate/Zero and Kara no Kyoukai under their belt, it would be difficult not to blindly trust the studio to deliver masterpiece after masterpiece, especially considering how little they release compared to other studios . While many seasoned viewers have already learned this lesson, Katsugeki/Touken Ranbu is the show that really helped me understand that you shouldn’t buy into the hype and excitement simply because of a big name, as even legendary studios can deliver a clunker or two.\r\n\tFor what it’s worth, Ufotable fulfilled their end ofthe bargain. Katsugeki’s art and animation are very much on par with what I expected from this studio after seeing their adaptation of Unlimited Blade Works. The art is crisp and simply beautiful. Though much of the background art is smoke and clouds amidst a night sky, all other scenes are filled with incredible detail. The character designs themselves are beautifully and meticulously detailed and varied. Their facial expressions are vivid and the character movement in battles flows without any awkwardness. On the topic of battles, the choreography felt light in the early episodes, but is well disguised by the flashes and flying particles of the sword clashes. As I have not played the game that acted as the source material for this show, there is little that I can say about faithfulness to the design of the original. It may be because of this that I have a much harder time enjoying anything this show has to offer with its story and characters.\\n\\n\r\n\tFrom what I can gather, the story is about a bunch of historical swords that were collected by some unknown force that breathed life into them and gave them human bodies. These living weapons are now given the task of preserving time and history from the evil Time Retrograde Army that seeks to twist history by killing important historical figures. With a cool premise like that, I was rather shocked with just how boring of a slog it ended up being. The show simply doesn’t frontload enough information to let the audience get invested in its story. After 6 episodes, I still don’t know why the Time Retrograde Army wants to change history, nor do I know anything about its leaders or who the soldiers actually are. They look like shadowy samurai zombies and they are about as effective as villains as zombies typically end up being in modern media. Occasionally they are joined by some CG skeletons, but those do little to make them interesting adversaries.\\n\\n\r\n\tLikewise, little is known about the actual organization that is leading this crusade to keep history intact. Despite their clear goal, the early episodes contain numerous scenes of our characters brushing aside their duty to preserve history by saving people that should have died. Perhaps that will be something explored in later episodes, but so far it seems a little too lax despite being the premise of the show. There is, however, hope for the show. As well as the debate of “savings lives vs preserving history”, the show brings about the question of whether or not the blades are serving the right master. If Katsugeki can stop meandering from one random battle to another, then perhaps it can deliver on some legitimately interesting plot points. It will still need to do something about its characters though.\\n\\n\r\n\tThe most saddening aspect of Katsugeki is that despite its varied cast of beautifully designed characters, not a single one of them is capable of holding my interest. To give a brief rundown of their personalities: Kanesada is the serious, idealistic leader. Kunihiro is the naïve kid with a strong sense of justice. Tonbokiri is the big, papa-bear. Yagen is the strong, silent type. Yoshiyuki is the reckless, annoying goofball. Despite these somewhat varied personalities, the team seems to have no chemistry. Much of the dialogue between them is stiff, serious and devoid of any charm. This is especially disheartening for Kanesada and Kunihiro, as their particular relationship should have at least some sort of personal touch to it. On the flipside, the arguments between Kanesada and Yoshiyuki tend to bring me out of a scene with just how annoying they are, even though they should be building a sense of tension. This is all wrapped together in a bow of some really awkward attempts at humor, especially from Yoshiyuki and the team’s fox mascot Konnosuke. Yammering on and on about food wasn’t funny when Goku did it years ago, and it isn’t funny now.\\n\\n\r\n\tThough the show has a lot of merit seeing as it comes from Ufotable and a lot of promise considering the potential of its blooming plot and characters, there just isn’t enough shown to convince me that it’ll all work out somehow. When as a viewer you watch the shit hit the fan and feel nothing for the struggles of the characters, you know that the show just isn’t working for you. It doesn’t help that Katsugeki immediately follows up this “thrilling” episode with a whole lot of sitting around the Citadel and talking. Though this might be a treat for fans of the game or people who really like pretty anime dudes that occasionally do samurai stuff, I think that Katsugeki/Touken Ranbu will likely end up as one of the disappointments of the Summer 2017 season.\\n",
            "date": "2017-08-10T02:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 255111,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4682676.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dr_Sephiroth",
                "username": "Dr_Sephiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=255111"
        },
        {
            "content": "The infamous Ufotable strikes again, - to ruin another one of my favorite game franchises. This time, Touken Ranbu. \r\nTo give a slight synopsis, Touken Ranbu is an internet browser card-game that's centered around collecting and leveling historical anthromorphopized Japanese swords.\r\nLet's begin now.\r\nUfotable ruined what could've been an amazing adaptation of a game that has little, to no plot. All that is known with this given game is its historical swords, and basic character personalities (that were given a basis by Hanamaru).\r\nCharacter:\r\nMost of the characters were out-of-character, especially Kane-san. He was troped as a typical shounen protagonist, and lacked his own goofy personality.\r\nAlthough I'm awarethat dark times such as those shown in Katsugeki are no place to mess around, he was far too serious and almost lacking emotion. \\n\r\nHe's known for failing here, and there. And, having his own imperfections that were ultimately covered-up by cliches.\\n\r\nWhat angered me the most was Kane-san even raising a blade towards Hori. The two are incredibly close, and despite Hori's intentions, he'd never do such a thing.\\n\\n\r\nHori was another that I found incorrectly adapted. His character was odd in its own way - I understood his reasoning for wanting to protect Hijikata, yet he was acting overly obsessive at some points. His character is more cheerful and supportive than anything. At some points, I wondered if this was actually Hori. Despite his intentions, Hori would listen to Kane-san if he'd ever try to talk sense into him.\\n\r\nHori's character is not of one to be a rebel.\\n\\n\r\nJiji, or Mikazuki's character was far too mysterious than he actually is. Although he is indeed an incredibly strong sword (which, I know for a fact since he is the leader of my team), his part made his personality seem odd. \\n\r\nHe's nothing more than an old grandpa that loves tea. He isn't mysterious, and wouldn't hide anything to make it seem as such. \\n\\n\r\nMutsu's character was the only that was spot-on. His constant hyperactiveness, love for food, and guns; and being a literal dog, was perfect.\\n\\n\r\nStory:\\n\\n\r\nAh, now we get into the horrible plot.\\n\r\nThe climaxes, the climaxes. Must you be so terrible with these, Ufotable?\\n\r\nI decided to mention these first, since they're the key points that lost me whilst I watched Katsugeki. \\n\r\nThere are two major \"climaxes\" that occur throughout the entirety of the show.\\n\r\nThe first begins I believe in episode 10, when Hori encourages Kane-san to raise his blade towards him. This ultimately ends in a predictable drop of an intentional missed hit, and a petty response towards the latter. Neither seemed shocked to the very least, and tensions continue between the two, with the most anti-climatic drop possible.\\n\r\nThe second climax is in episode 12, where Hori joins Hijikata, and the rest of the Shinsengumi. There are many oddities with this. Knowing for a fact that Hijikata was not the one to trust easily, he let an unknown boy join him. His intentions were shown, planning to die in Hijikata's place. Kane-san soon finds out about this, once again not shocked, and proceeds to convince Hijikata to return his second sword to the boy who was to deliver it. Hori, now, not shocked by this, simply sighs and says, \"Ah, all my efforts were for nothing\".\\n\r\nWhat? What? This was a far lower drop than the first climax. They both shake it off as if nothing had happened. What is this? \\n\r\nAnd, ah, let us reach the ending. We're told in episode 12 that 1,000 members of the Retrogade Army were to appear the next day to attack, as said by Konnosuke. \\n\r\n1,000, remember. Yet, the fighting that is shown in episode 13, is nearly effortless. None of the boys take critical injuries, although 1,000 would be quite a feat to fight. But, no. It gets better. They someone how manage to defeat each enemy easily, the ending pans with a group shot. And, an \"everyone's okay, everything's okay\" finale. \\n\r\nExtra slight nit-picking, but game mechanics were thrown out the window here.\\n\r\nYou cannot summon another sword in the midst of a battle.\\n\\n\r\nSound/Art:\\n\\n\r\nI very much liked the opening and ending sequences. The opening had historical easter-eggs regarding each sword's master and their deaths which I found very interesting and a great addition. The song itself is catchy, which I enjoyed a lot.\\n\r\nThe ending's song was good as well, and the animation itself had me and my friend create a theory of a possible ending to the anime (rip).\\n\r\nThe animation itself is great, obviously. It's Ufotable. The effects were outstanding, as well as the fight scenes.\\n\\n\r\nIn conclusion.\\n\\n\r\nStory: 4/10\\n\r\nArt: 9/10\\n\r\nSound: 7/10\\n\r\nCharacter: 4/10\\n\r\nEnjoyment: 3/10\\n\r\nOverall: ??/10\\n\\n\\n\\n\\n\\n",
            "date": "2017-10-14T18:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 260785,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6441329.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ari-e-s",
                "username": "ari-e-s"
            },
            "url": "https://myanimelist.net/reviews.php?id=260785"
        },
        {
            "content": "When I saw this anime at first, I didn't really think that I'm gonna like it, since it seems that my fav characters from Touranbu won't be there, but after I watched some episodes, it felt like, I can take a liking to these characters since they unfold the characters' feeling really well in here.\r\nCompared to Hanamaru, this one's is really deep in story and feeling (oh, I do love Hanamaru btw).. And their fighting scene is so cool and pretty! Not only the fighting scene, but every scene is portrayed beautifully and so detailed.. I cried in some episodes.. Their final battle was superb!And the BGMs, OP & ED song are also awesome!\\n\r\nI'm waiting for the movie version! I hope they'll make the 2nd season as well (not only a movie) with the other characters as the main! Love this!",
            "date": "2018-01-07T04:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 267762,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6276881.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Unyil",
                "username": "Unyil"
            },
            "url": "https://myanimelist.net/reviews.php?id=267762"
        },
        {
            "content": "****SPOILER FREE****\r\nBlurb: Katanagatari meets Fate/Stay Night. \r\nThe concept of weapons (especially swords) being presented as sentient beings/characters is hardly the re-invention of the wheel. Katsugeki/Touken Ranbu borrows elements from several Fantasy/Action shows and brings them together in a stunning and beautiful tapestry which only UFOtable can do. \r\nIn terms of story, there's nothing too complicated. Neither are the personalities of the various swords that have been summoned in Human form. You have your typical mixture of goofy, serious, innocent, broody, hot-heads & philosophers who at various times during the show bring up the age old question of ends justifying the means. \r\nSome moments and episodesare genuinely well put together but on the whole, the series offers nothing new or groundbreaking in terms of a story. If anything, there are plot-points that have been simply ignored, and at the end you are left with no clear vision as to exactly who or what the villain/s are. Perhaps they are saving further development for the second season, but there should have been SOME explanation as to why the swords and their master do what they do, and what series of events led them to do this moment. \\n\\n\r\nHands down the one and only reason (for me) to watch this show were the visuals, which are breathtaking. In the end all that can be said about the 'Wild dance of Swords' is that it's worth watching for just that. The dance, the swords and the costumes.",
            "date": "2017-10-01T06:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 259371,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006740.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DemonKingRavan",
                "username": "DemonKingRavan"
            },
            "url": "https://myanimelist.net/reviews.php?id=259371"
        },
        {
            "content": "I have very mixed feelings about this show. What started off strong as a feudal era samurai show with stuff from the future kind of like drifters basically just collapsed in on itself, I can't even bring myself to care enough to follow the plot anymore and am probably just going to end up dropping it. The show starts with some very nice artwork but it lacks basically anything else.\r\nThe cast is painfully generic, there are way too many people and not enough actual character development. People get killed or injured or replaced in a lot of the episodes, and the villains are faceless armiesof gun/sword fodder that die in one hit. \\n\\n\r\nThe artwork is typical of Ufotable, looks a lot like any fate show. I think the show's backgrounds don't vary enough though, and end up all looking the same. The sound is about average, although the cat thing's voice gets on my nerves. Songs and music are forgettable.\\n\\n\r\nEnjoyment and overall go hand and hand. I wanted to like this show, but it is is just really, really boring. The enemies are uninteresting, the characters are uninteresting, the background is pretty but fairly uninteresting, the sound is uninteresting and the show as a whole is just uninteresting. \\n\\n\\n\r\nI can't honestly say I actually enjoy this show, and really would suggest skipping this unless you are a diehard Ufotable fan. Fate Apocorypta airing at the same time has similar artwork and has a MUCH better plot and cast of characters.\\n\\n",
            "date": "2017-09-09T18:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 257202,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3443221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/seanm826",
                "username": "seanm826"
            },
            "url": "https://myanimelist.net/reviews.php?id=257202"
        },
        {
            "content": "There are anime you can watch without knowing anything about them beforehand and there are others anime that, sadly, need you to do some more effort before you can actually enjoy them to the fullest. As crazy as that sounds, katsugeki touken ranbu is part of the latest group of anime. Theres no other way to put it: you need to read about the game or at least some summaries about what touken ranbu is before you can watch this series. Otherwise you'll find yourself confused about the swords, their purpose and everything that is going on in the episodes, tho not very much happenedso far. \\n\r\nLike hanamaru, katsugeki was made for people who already know about touken ranbu OR want to know more about it. \\n\\n\r\nSTORY: 7/10\\n\r\nThe story itself is pretty simple: history is getting f*cked up and swords who now have human bodies have the duty to fix it. Some episodes are slower than others, some might feel like being a little dragged on, but so far i feel like its very enjoyable (at least for the people who already know what kind of setting touken ranbu is, like i already said.). The little slice of life moments also make the anime very enjoyable and kinda reminds me of Hanamaru!\\n\\n\r\nART: 8/10\\n\r\nI must say at first i didnt really like it, but after some episodes i kinda grew attached to it. The characters look good and waaaay more better than the previous adaptation. Sometime the backgrounds look kinda... weird, but its not bothering me too much honestly. Overall i'd say the art fits the atmosphere and the characters well.\\n\\n\r\nSOUND 7/10\\n\r\nI saw a huge fuss coming out because of the opening, some people like it, others hated it. Personally i really like it. It kinda gives me those epic-ish vibes i was expecting from this series, same goes for the ED (bless you kalafina, you are literal goddesses.). The ost itself doesnt sound too bad, but i'll need to listen to the full tracks more once it comes out to 100% enjoy it.\\n\\n\r\nCHARACTERS 7/10\\n\r\nHere we go. Okay, so, how the characters are portrayed in katsugeki is totally different from how they were in hanamaru and how they are in-game. So what is the canon? You choose it. Playing the game made me like certain characters, and watching the 2 anime adaptations made me like some minor characters more. Personally, i love Tonbokiri because he's the sweetest guy around but Izuminokami and Mutsunokami (who's my starter in the game ah!) are also faves. Jiji is a reaaaaaally interesting character here in Katsugeki, i really like how they are portraying him. Anyway, theres PLENTY of characters for you to choose from, if you watch the series + read about them on the wikia i'm sure you'll end up loving two or even more. As for people saying the charas and the anime itself is fujoshibait... why don't you cater your attention on something else? Sure there might be some 'shippy' moments here and there, but those arent the main focus here. I can't really say the characters have extra deep personalities, but some of them are indeed interesting. I'd love for people who start the anime to not have their mind already set like 'It's gonna be bad anyway and the characters are just fujobait' because its not like this. Give these touken danshi a chance, c'mon. \\n\\n\r\nENJOYMENT: 7/10\\n\r\nBeing already a fan of touken ranbu sure helped me enjoy more this (and Hanamaru). Maybe sometime its a liiittle bit slow and i wonder how they'll wrap things up, but i'm definitely liking it!\\n\\n\r\nOVERALL 7/10\\n\r\nKatsugeki for me it's a solid 7/10. Not too good but not bad either. Maybe it'd be more of a 7.5 because i have to be honest and admit that there are things i REALLY like about it, but that probably arent enough for me to give it a full 8. Anyway i think a 7 is a fair score for Katsugeki and also well deserved! If the anime ends with too much of an open ending i hope we'll get a 2nd season to complete it. \\n",
            "date": "2017-08-19T14:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 255835,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/436096.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/franciu",
                "username": "franciu"
            },
            "url": "https://myanimelist.net/reviews.php?id=255835"
        },
        {
            "content": "Story (3/10):\r\nFor me, the story didn't capture my attention at all. I gave it the good \"watch the first 4 episodes\" test and could barely make it through the 4th one. I know that the origin of this adaptation is from a game, but in my experience, most game to anime adaptations aren't that successful and interesting. I guess it's pretty hard to write an adaptation on something that's supposed to interact with viewers in a different way.\r\nArt (9/10):\r\nUnfortunately, the art style for this series is beautiful. I love the coloring, the style, the animation, and just everything about the art. It made me reallywant to like the show, but I couldn't continue with it just because the art was nice to look at.\\n\\n\r\nSound (5/10):\\n\r\nThe sound didn't do anything in particular for me, but I admit that the op was a good one and I enjoyed it. Everything else wasn't memorable for me and I can't say that it stuck as a set of tracks I'd go desperately looking for to listen to again.\\n\\n\r\nCharacter (7/10):\\n\r\nMost of the characters I really enjoyed! It was another aspect about this anime that made it really unfortunate that the story is so...uninteresting. I liked their dynamics with one another despite being so different and I liked that each and every personality was different from one another. It made the viewers have a variety, not just a big lump of similar people all in one place.\\n\\n\r\nEnjoyment (4/10):\\n\r\nMy official rating for this show was a 4 and I can easily say that my enjoyment level is the same number. I wanted to like this show, especially because I was recommended this one by someone close to me, but I just couldn't get into it. The plot wasn't interesting and I couldn't stick to a show just because the art was nice and the characters interested me.\\n\\n\r\nOverall (4/10):\\n\r\nI wouldn't recommend this one to anyone. If someone likes it, good on them, but it personally was stale and could've been so much better as far as the plot goes. It definitely seems like most of their effort went to the art and the personalities of the characters, but if only the studio has delivered the same for the story. If that were the case, maybe I would be writing a different review right now.",
            "date": "2018-04-13T17:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 277992,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/rachachan",
                "username": "rachachan"
            },
            "url": "https://myanimelist.net/reviews.php?id=277992"
        },
        {
            "content": "KATSUGEKI TOUKEN RANBU ANIME REVIEW\r\n(04042018)\r\nWARNING : SPOILER ALERT\r\nOVERALL: 8.2\r\nPLOT: 8/10\r\nIf you have the ability to turn back the time, will you make the wrong decisions right? Will you change and alter the future that awaits you? If you have the power to change every mistakes you've made, every person that perish right in front of your eyes, will you just stand and do nothing? This anime focuses on the history of their country, their hero, the people who fight for it, and the importance of their sword and being a warrior in their life. I love this kind of genre. The history is too interesting.It is kind of intense how they struggle not to alter and only protect the history from those who want to change it eventhough they themselves want it to change also. How loyal the sword is from their master and how they also feel the same pain their master does. This series is not perfect, yes. But it consists of an element perfect enough to make the story interesting and will keep you going.\\n\\n\r\nCHARACTER: 9/10\\n\\n\r\nI love all the characters in this series, not only because they're gorgeous or they have that cute faces or they have that strength, but because they all have that belief they all carrying in their hearts. They're also waving when a certain situation needs them to decide if they will follow their duty or their loyalty. In my opinion, the only thing that all of the characters failed to justify is their strong belief not to change the history which surpasses their loyalty with their previous master.\\n\\n\r\nSOUND AND ANIMATION: 8/10\\n\\n\r\nThere's nothing to comment in the animation of this series. It is definitely a crowd of handsome boys. Whatever the expression of their faces will always be spectacular. But still, I find some of the characters confusing since their voices is quite not compatible with the appearance. Other than that, I think the animation is flawless. The opening and ending song is the same, if I'm not mistaken. Though it's not that catchy for me, it is fine.\\n\\n\r\nENJOYMENT: 9/10\\n\\n\r\nAction based, it is great. I've enjoyed all of the fighting in this series, as well as the history being shown. I also like the comedy added into this one. The disadvantages given to the protagonists which render them awed is also a good watch.\\n\\n\r\nENDING: 7/10\\n\\n\r\nOnce the story come to a close, it is a must to answer all of the loopholes. It is a given to explain every single question in their mind. Though the ending is really heartbreaking, kinda unpredictable and satisfying enough, some of the questions still remain. I guess, the continuation can be found in the game itself since the animation is just an advertisement for it. But I'm still hoping for season 2. :)",
            "date": "2018-04-08T18:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 277465,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6349777.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Castinate",
                "username": "Castinate"
            },
            "url": "https://myanimelist.net/reviews.php?id=277465"
        },
        {
            "content": "There are benefits on watching a show without knowing the source material: you don't create expectation.\r\nI was interested on this anime because the amazing artwork, especially Tsurumaru and Mikazuki. I know nothing of the game, the mechanics, the enemies, or anything else: to me there is only cool looking samurais fighting evil looking enemies (and lots of fujoshi artwork)\r\nSomehow my desire to see a character I personally find amazing, made me break the Three Episode Rule and when he finally appearead I just... continued watching the show with a blank expression on my face.\r\nThis anime is a redundant (pretty looking) shallowness.\r\nAlso... I know from thefirst episode that the sole purpose of the touken danshi is to preserve history... but they tell this to the viewer at least 7 times per episode. If you play a drinking game and take a shot everytime you hear a character saying \"rekishi o mamoru\" you'll be wasted in no time.\\n\\n\r\nUnless you are a fan of the game, skip it\\n",
            "date": "2017-12-16T16:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 265375,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5355740.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JackYagami",
                "username": "JackYagami"
            },
            "url": "https://myanimelist.net/reviews.php?id=265375"
        },
        {
            "content": "From the studio that animated the ultra-popular Fate series, Ufotable brings in another great anime, Katsugeki Touken Ranbu. Quite the underrated anime, it's got many good things going for it and is absolutely worth a try despite the unfortunate unfair low ratings.\r\nStory: 7/10\r\nAlthough a great story, it feels quite rushed. I'll start with the positives, it clearly explains itself at first of what situations the characters are going through until the midpoint. The plot progresses a bit fast from what I'm accustomed to and felt too fast especially towards the end. Sadly 13 episodes weren't enough as it felt things were confusing at times, ifit were even a 24 episode anime it would've done better. But nonetheless, it tried to convey it's meaning by most of the time improving it's characters later on.\\n\\n\r\nArt: 10/10\\n\\n\r\nIt's Ufotable what do you expect? The fairly new studio (compared to most other ones) in the TV anime market has surpassed industry greats like Kadokawa and JC Staff, 2 of the best studios who make some of the best looking animes EVER. And I'm totally not fanboying. The Fate series was also highly praised for it's breathtaking art only seen in some anime movies, and Ufotable has certainly knocked the ball out here once again. The fight scenes were superior if you ask me and the character design was also something Ufotable greatly built upon here. Definitely one of the best looking anime out there.\\n\\n\r\nSound: 9/10\\n\\n\r\nThe sound was brilliant. As a matter of fact, EVERY VA perfectly did their role and did a very very good job. Meanwhile the OST was more memorable then the Fate series' as the Violin powerfully stabbed through my brain. I was terribly addicted to listening to the OST. The OP and ED though were great but we're very similar to the Fate series' too and that may be a problem as it has too many similarities with the aforementioned show. But otherwise excellent.\\n\\n\r\nCharacters: 7/10\\n\\n\r\nThe characters were amazing. Simply said, I loved each and every one of them. But why a 7? It's because there were TOO MANY of them and there was VERY LESS TIME to focus on each one of them. Each character had their own unique personalities that's true, but the issue is that just about 3 or 4 of them actually developed further in 13 episodes. Apart from that though I said their personalities were unique, it felt as if some were exact clones of another and the First unit rarely ever got a proper arc. No effort was done to show anything about them. The Master also was rarely shown and his reasons for his actions were not even talked about... \\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThose who've checked my account might know I'm currently watching Gintama. And there's not much serious action neither are there any frequent fight scenes. Though after a particular arc I craved for such action and stumbled upon Katsugeki Touken Ranbu. I wanted epic action sequences and Ufotable was the go-to studio for that. Known for their brilliance in the Art field I confidently started the series Knowing I'll get what I want and I wasn't wrong. What I got was some teeth gritting action sequences that made you go \"Woah\" in awe. Couple that with a suspenseful storyline and a colorful set of characters (a LOT of them) and you've got yourself one heck of an awesome anime to delve into.\\n\\n\r\nOverall: 8.4\\n\\n\r\nKatsugeki Touken Ranbu is an anime that has it all going for it. If you love action sequences, love a large amount of characters, want the BEST art an anime studio could ever give, Katsugeki Touken Ranbu is the quintessential example of the aforementioned expectations. It hits damn hard to home with those screenshot worthy art everywhere. Sadly it like Aoyama kun was another of the unfortunate examples of great anime that were unfortunately overlooked. It deserved as much attention as the Fate series if not greater. But well, hopefully next year's movie adaptation can hopefully protect the future of the great anime.\\n\\n\r\nP.S: No girls in this anime was something I as a romance fan was like \"MASAKA???\" for but in the end it was fun. There were tons of things here that you wouldn't obviously find in Romance animes and being one of my first big footsteps outside of my Romance/Comedy bubble I can confidently say it was a good one for now ;)",
            "date": "2017-10-13T08:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 260668,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=260668"
        },
        {
            "content": "Katsugeki/Touken Ranbu is an action anime set in 19th century Japan for the most part. I thought the show was alright but it definitely could have been better.\r\nThe story was mediocre in my opinion. It was bland in the beginning up until a point near the halfway point of the series where it then had a 2-3 episode run of great episodes after which it then returned to a bland state.\r\nThe art on the other hand, was outstanding as one can expect from studio ufotable. The animation for the action sequences were also very good. The soundtrack was nicely done and the sound design oncertain effects stood out to me as well.\\n\r\nWhile the show looks and sounds great, the characters suffer from much of the same problems as the story does. It was difficult to get invested into what the characters were going through(the anime managed to do this at one point but it was then done away with soon after) which is unfortunate because I believe that this was a missed opportunity.\\n\r\nIn the end Katsugeki/Touken Ranbu is a beautifully drawn show that has no deep impact or enjoyment to be derived from it.",
            "date": "2017-09-23T20:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 258438,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=258438"
        },
        {
            "content": "Now if you're just perusing through, trying to see if this anime is worth a watch but is a little bit turned off by the overall score it has received (so far) then I would say that you're better off watching something else. \r\nSounds harsh but here's the thing, if you're like me and is part of the \"I know the background story of the characters and overall plot line because I actually play the game\" group then watching these sword boys in ufotable action (they've done a spectacular job so far with this series despite the general consensus of quality drop with the Fateseries) is a total treat. The pacing in this anime is quite fast, so if you're part of the other group who's just watching without any clue about the characters/plot and is trying to hopefully understand as you go..you're gonna have a little bit of a struggle. \\n\\n\r\nThere's a handful of sword boys (all the guys are swords. surprise) so it would take a long series to fully focus and develop each and every single one of their characters. With that said, don't go into this expecting a superb character development and smooth flowing plot because to be honest, even the plot/mechanic of the actual game involves you taking your sword units back and forth multiple timelines to stop the Time Retrograde Army from screwing with historical events. Really wish there's a better prequel to the franchise that could help viewers understand without needing to be a player of the game itself that I could recommend but even Tourabu Hanamaru is more of a fan service \"cute (sword) boys doing cute things\"\\n\\n\r\ntl;dr: based off an online game where you sacrifice your soul to forge sword (boys) and take them to the front line (sorties) back in time to fight bad dudes (Time Retrograde Army). there are many sword (boys) so don't expect to be able to fully understand each of the characters introduced and their background story in a short adaptation. which leads to being able to have a firm grasp on the overall plot line that has realistic historical events/figures who're owners to the sword (boys). watch with an open mind if you're a casual viewer.",
            "date": "2017-08-27T20:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 256388,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1100821.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nekoma",
                "username": "nekoma"
            },
            "url": "https://myanimelist.net/reviews.php?id=256388"
        }
    ]
]