[
    [
        {
            "content": "If there is a question about an anime that does their job in entertaining people so well, then Magic Kaito 1412 is one of those best answers. Filled with 24 minutes of excitements & deception makes Magic Kaito 1412 one of the most enjoyable series between Fall 2014 to Winter 2015.\r\nAs we know, an episodic series is like a gamble of life and death, some success while the others are not.  The main concept of Magic Kaito 1412 is very simplistic, they do the same things from episode to episode just like an endless cycle. Almost all episodes do this endless cycle, except forthe early episodes and some others.\\n\\n\r\nNew diamond introduced - Kaito steals the diamond - The police failed - It's not the diamond \\n\r\nthat he was looking for - Kaito returned the diamond to the police\\n\\n\r\nAlthough the concept is rather too simplistic, but the anime fully appealed the individual element of the story itself, especially the comedy and adventure parts. \\n\\n\r\nIf we talk about the animation, Magic Kaito 1412 may not be as good as the other, but the animation is completely different from the others which make it more memorable and unique, like an \"icon\". For the sound settings, the background music is wonderful & quite catchy while the seiyuu done their job decently. I personally adore the 2nd opening of the series \"Ai no Scenario\" sung by Chico with HoneyWorks, it is really good indeed.\\n\\n\r\nThe characters of an episodic anime sometimes criticized by people because of lack of development. Thankfully Magic Kaito managed to run away from the tiger's cage. What we have here is not a character growth but it's ability to refine the story. The main character, Kaito Kuroba himself it's described as an omniscient thief, sometimes he interacts with Aoko in a confusing but unique romance setting. Although the main character often referred as a \"stereotypical\", but the good thing is each single characters plays their roles pretty well. The villains actually appear randomly but the good thing is the villains have their own motive, which is good.\\n\\n\r\nThe elegant & magnificent Kaito Kid really did well in entertaining his audience this night. It is recommended for those who seeks for light anime that simply just entertains the audience with its magic. It is really a magical experience indeed.",
            "date": "2015-04-20T19:59:00+00:00",
            "helpful_count": 74,
            "mal_id": 186100,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=186100"
        },
        {
            "content": "There's a perpetual, particular mindset that one must have in order to appreciate and enjoy magic. It's something innocent. It's something that makes you appreciate the awe and wonder presented in the moment; a beautiful deception. A part of you will want to know the answer, constantly hunting for the secret. But another part of you doesn't mind. It's something that you want to know the answer to, but know you shouldn't. That's because you know the answer doesn't matter. You want to be fooled.\r\nMagic Kaito 1412 is a rather simplistic show, despite magic being its core element. It's an episodic series and, as such,doesn't require much of an obligation to follow intently. Like all episodic series, some episodes will also be better than others. However, this layout works impeccably well for this particular show; I couldn't imagine it being done differently. For the most part, Magic Kaito is broken down into heists that usually span one episode, with the occasional part-two. In each episode Kaito dons the persona of the Kaito Kid, an unconventional, gentlemanly thief, who steals rare jewelry and returns it shortly afterwards. He often performs his heists in a flashy manner, which often becomes something like a free, public magic show. Periodically, characters from Detective Conan make appearances (Shinichi/Conan really being the only relevant figure, of course), which is entertaining in its own right. \\n\\n\r\nDue to the episodic nature of the series, many of the characters who appear in Magic Kaito are not recurring. The only characters who appear in every episode are Kaito and Aoko, who have been friends, and neighbors, since childhood. The dynamic between Kaito and Aoko is very light-hearted and exactly what you would expect from close friends. Their relationship, for the most part, seems fun and realistic, yet also quite childish and pure. They tease one another, but also know when to support each other as well. They share quite a few sweet, romantic moments in the series, which was a more refreshing type of intimacy that you rarely see in many shows nowadays. It's not overbearing, nor is it the main focus, but it offers a warm, cozy feeling nonetheless. Unfortunately, character development is not a strong point of Magic Kaito. There isn't much growth or change in any of the characters, so what you see is what you're going to get from episode one onwards. In addition, many of the characters in the series give off the impression of being fairly dumb, to be quite frank. But, I suppose there's a certain pitiful charm to their stupidity that slowly becomes endearing.\\n\\n\r\nThe art, animation, and sound are easily the weakest points of Magic Kaito, though that is something that's to be completely expected. This is not a show with high production values and it never gave off any impressions of being one. It doesn't have the best visual appeal, nor is the soundtrack anything special. However, production values don't mean everything. Magic Kaito takes a more humble approach to a very pleasant series and it works well enough.\\n\\n\r\nIn spite of its exceedingly lacking popularity, Magic Kaito 1412 was a very delightful, lively watch. The heart of all magic tricks and illusions lies within the enjoyment of the people watching, a point that is well pointed out in this series. In that regard, Magic Kaito 1412 succeeds.",
            "date": "2015-04-05T03:34:00+00:00",
            "helpful_count": 30,
            "mal_id": 184804,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/586079.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Satire",
                "username": "Satire"
            },
            "url": "https://myanimelist.net/reviews.php?id=184804"
        },
        {
            "content": "\"Ladies and gentlemen! I bring you the illusions that sparkle at night\"- Kid the Phantom Thief.\r\nIf you are already a fan of Kid the Phantom Thief or Detective Conan, you should enjoy this series. If you are unfamiliar with either of those names, you can still watch this series and enjoy it. Having information about the characters will definitely inform your viewing experience, but it is not needed.\r\nStory: 7\r\nThis series is episodic in nature, which each story focusing on Kid the Phantom Thief attempting to steal some jewel or valuable object, which brings him into conflict with the police, other thieves, royalty, teen detectives, anda certain child detective. The engaging part of the story is learning the explanation behind the magic tricks performed in the series (most of which are pretty clever). Many scenarios require a great suspension of disbelief, and the stories can be formulaic at times, but still very enjoyable.\\n\\n\r\nArt: 8\\n\r\nThe animation quality is great, recreating the unique art-style from the manga. There are plenty of night shots with beautiful lighting and lots of flowing capes.\\n\\n\r\nSound: 8\\n\r\nThe background music is great, there are a couple really great tracks that range from jazz to techno beats. The OPs and EPs are great tunes and get you excited for the series. The Japanese dub has great voice acting, especially from the main character.\\n\\n\r\nCharacter: 7\\n\r\nI've heard complaints the characters are stereotypical. I can see how characters fit into typical shonen character roles, but they are enjoyable nonetheless. Kaito is a stubborn and prideful guy who has a good heart and Aoko is a sweet girl who just can't seem to be honest with him about her feelings, but she can give him the what for when needed!\\n\\n\r\nEnjoyment: 9\\n\r\nThe idea of having a secret identity is a story-line I enjoy watching and the mission Kaito gives himself at the start of the series provides strong motivation to his actions. Having not watched any Detective Conan prior to viewing this, I was apprehensive about watching a spin off series from a long running show . Magic Kaito proved to be very entertaining and a good adventure series, and the episodes with Conan are some of the best ones! Seeing the magic tricks explained and seeing mysteries solved kept me interested in watching more. Kid the Phantom Thief is so charismatic that you can't help but cheer for him!",
            "date": "2015-04-01T12:58:00+00:00",
            "helpful_count": 29,
            "mal_id": 184401,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445780.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JosChaMur",
                "username": "JosChaMur"
            },
            "url": "https://myanimelist.net/reviews.php?id=184401"
        },
        {
            "content": "Batman:Japan is a relaunch of the classic superhero movie but with a Japanese Bruce Wayne joining the world of crime instead of fighting it in order to find his father's killer. All jokes aside, as someone who loved the 2010 version I just had to pick this up. Although a lot of the episodes are the same with some extremely minor details changed, it does include contents from a couple of the Kaitou Kid specials from the Conan anime which is nice because it gives Kaito fans a way to enjoy a comprehensive collection of all of our favourite phantom thief's adventures without having tosift through 700 episodes of Conan. \\n\\n\r\nFrom an aesthetic perspective, the show looks quite good. The characters look more crisp than the OVA version and the colours are more vibrant. However, it's hard to say if 1412 is strictly better than  the OVA version in terms of art because the OVA had a bit of an old school charm to it. Also some of the CGI looks really out of place in 1412. The soundtrack of this show is honestly amazing. All of the opening and ending these can be contenders for the top 5 opening and endings themes of the season. The BGM ranges from some sappy jazz to quick beat rhythm that makes you want to move along with the action. \\n\\n\r\nNow the problem with Kaito is that the story is quite repetitive. It's akin to the monster of the week shounen but with thefts. Though some of the ways Kaito solves his problems can be considered as bigger asspulls than No Game No Life, a lot of the more thought out ones, especially the ones involving Conan, are quite intriguing and will make you go \"aha\" afterwards. To me, the most important aspect of the show are the characters. Honestly speaking, the main characters Kaito and Aoko are quite stagnant and set in their tropes. However, there's no rule stating that stagnant characters cannot be loveable characters. Though Kaito can sometimes make you cringe with his white knighting neckbeard fedora M'lady act, he and Aoko both have a sort of charisma that makes you love them. They are especially adorable during the romance episodes albeit being a bit cheesy. \\n\\n\r\nI would definitely recommend this anime to people looking to watch something lighthearted and have some fun. And I would definitely recommend it to Conan fans who haven't checked out the OVA version yet as this is the ultimate fanservice.",
            "date": "2015-03-31T01:08:00+00:00",
            "helpful_count": 22,
            "mal_id": 184210,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1260431.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BloodRequiem",
                "username": "BloodRequiem"
            },
            "url": "https://myanimelist.net/reviews.php?id=184210"
        },
        {
            "content": "“Opportunity makes a thief.” – Francis Bacon\r\nFor any thief, lying, stealing, and taking every opportunity is part of their job. What about for a guy like Kaito? He seizes every opportunity and takes granted by the decisions he makes. The end result is usually something desirable in his favor. You know what they say about magic right? It’s like a fantasy wonder and Kaito makes it his own reality. Magic Kaito is like magic because it will leave you in a state of awe for seizing every opportunity to shine with its presentation.\r\nFor starters, the series has some loosely connection with Detective Conan (Case Disclosed),another series by Gosho Aoyama. However, this only starts and stops at cameos from certain characters between the shows. In essence, Magic Kaito operates on his own set of principles with its unique story. And as for this story, we have a young man who takes on a double persona. His name is Kaito Kuroba, who occasionally goes by his infamous alter ego, Kaito Kid. The series also depict a bit about his father, a man that Kaito looks up to. But unfortunately, his father was killed eight years prior to the events of the story. In present time, Magic Kaito 1412 focuses on Kaito with his double life and in a story of magic and mystery origins.\\n\\n\r\nTo call this series a mystery might be an overstatement for some though. At taking a closer glance, it’s immediately obvious who Kaito’s alter ego is. Even with the masterfully disguised transformations, the series takes on a more lighthearted atmosphere with the phantom thief trope. The other side of the story also shows Kaito’s normal life where he lives with a normal family and hanging out with his normal childhood friends, Aoko. So how does this show manage to succeed? Simple. Like a thief, the series seizes every opportunity to show what the franchise is capable of. It captures a well-meaning sense of events as well as sending the right message. Staying honest with its premise, the series adapts events relating to Kaito and his mischievous adventures. It can even feel complex at times when Kaito gets into more trouble than he should be when getting involved with authority figures. But hey, that’s what makes this show stand out so well. It shows a multidimensional portrayal of Kaito’s character that connects with the story. And like any story, the series also adapts a promising cast of characters.\\n\\n\r\nAlthough Kaito is the main star of the show, the other cast members aren’t neglected. Most prominently, we see Kaito’s childhood friend Aoko who he has known since they were kids. The series makes some obvious suggestions that the two are mutually attracted to another but often plays it off with teasing. However, it creates a charming atmosphere when any opportunity comes and goes. There’s chemistry between Kaito and Aoko that extends more than just childhood friends. The events they become a part of manages to beautifully articulate and craft their roles. It also creates a variety of emotions when we see the outcome of these events. There’s also relevance when it comes to every episode when the characters become part of the problem or solution. Because like I mentioned before, all the main cast gets some spotlight whether it’d be Kaito’s rival Saguru, the mischievous witch Akako, or the hotheaded investigator Ginzo Nakamori. Even Kaito’s father has his own set of background episodes despite not being actually being present in the series. This is important because it’s what motivates Kaito to become the person he is during the present storyline. And while he isn’t actually present in the events of the present, the show manages to create a great belief with the man. In retrospect, it’s inspirational and accomplishes what it’s trying to do – seizing the opportunity with a platform of gadgets it has to work with. On the downside, the show’s subtle romance isn’t exactly strong in its standards as the main focus is usually on the phantom thief himself.\\n\\n\r\nDespite titled ‘Magic Kaito 1412’, you won’t be getting cheesy magical battles between characters. Rather, many of the episodes features a cat-and-mouse like game. Some parts of the story will feel repetitive and predictable while others can have unexpected results. Take it as a grain of salt but the series does have some episodes that will be a hit or miss when it comes to expectations. Still, one thing I always give credit for this show is the charming comedy. It doesn’t rely on shock value such as fan service or cliché romance angles. Instead it delivers by its remarkable performance between the characters that connects with the story. Easily understandable yet compelling. Silly at times yet relevant. Simple yet intelligent. This show is like a love child from the great Harry Houdini himself.\\n\\n\r\nA-1 Pictures adapts this series and although not impressive with some of their shounen adaptations, this show is one to admire. Every setting has its props that works well whether it’s the handy gadgets Kaito uses or what he steals. Character designs are also very convincing especially with Kaito and his noticeable outfit. That white tall hat complete with a pair of long cape and eyeglass makes him stand out as the poster boy of the show. Other characters are also fitting with their design such as Akako’s mysterious beauty as her role of the witch and the frustrating yet amusing expressions of inspector Ginzo. However, one feature of the character designs I have to bring up would be the characters’ noses. It shouldn’t be hard to spot but some of the noses are a bit over exaggerated than it should be. While it does not ruin the characters, the design there can be distracting.\\n\\n\r\nFor more or less, music and soundtrack does play some key roles in this show. Starting with the OP and ED songs, the series appeals to its lyrics and highlights moments of Kaito’s mysterious career in short yet catchy scenarios. Every episode’s soundtrack also has this consistency to adapt its various tropes to the point. Without the OST or soundtrack, some scenes may be left without its texture and feelings. But when coordinated like the way it did, the show comes to life thanks to its skillful effort at this adaptation. Finally, voice mannerisms has great expression. I give praise to Kaito and Akako’s VA for portraying their double life characters. It’s not always easy to play a character that portrays different personalities but Kappei Yamaguchi and Eri Kitamura did wonderfully. \\n\\n\r\nThis series may feel a bit underrated at times but overall is a fun take for a shounen adventure. Rather than battling against monsters or saving the world, we have Kaito fighting with his own motivations. The characters that he gets acquainted with all has some connection with the overall tone of the story. And despite some episodes being predictable, it’s overall riveting as it reminds us how fun sometimes life can be. And as a side bonus, some of your favorite characters from Detective Conan may surprise you in this series. So let this show unfold and tell you a story about a man who became the phantom thief.",
            "date": "2015-05-08T23:37:00+00:00",
            "helpful_count": 11,
            "mal_id": 187413,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=187413"
        },
        {
            "content": "Magic Kaito 1412, a place to test your wits!\r\nThe story of Magic Kaito is pretty much about how Kaito steals the famous jewels with fancy tricks different every time. \"A magician never repeats the same trick twice\" -Kaito I guess that's why there's new tricks every time :P Other characters introduced like Akako and Hakuba weren't really always seen which makes us wait for them to actually appear. Both of them altogether probably only appeared around 6 times out of the 24 episode where I'm expecting a bit more since they still are the supporting characters. \r\nI'm glad that there are still a few appearancewhere the Phantom Thief goes against the famous detective which makes it anticipating. Everybody knows that Kaito will win in these showdowns but with a few close calls of where he almost gets caught.\\n\\n\r\nStill this is a battle of wits for Kaito, like man, he has an IQ of over 400. How smart can he actually be. \\n\\n\r\nI'm waiting for the second season for this. I'm still waiting for the illusion to officially end where he gets Pandora :D",
            "date": "2015-04-08T04:15:00+00:00",
            "helpful_count": 10,
            "mal_id": 185129,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4537481.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sugarhoney322",
                "username": "sugarhoney322"
            },
            "url": "https://myanimelist.net/reviews.php?id=185129"
        },
        {
            "content": "This show is a remake of what I would consider an anime classic and it is certainly done right. It contains all the elements a Kaito Kid and Detective Conan fan would be looking for.\r\nThe story is simple, but great. We follow Kaito on his misadventures in thievery and everyday life. It starts off a bit slow, but quickly picks up pace. Kaito's main goal in almost every episode is to steal some kind of jewel, but the story never gets boring. There is something about the Kaito Kid that is captivating and alluring. You'll never be bored and it's incredible to see how hismagic tricks work. \\n\\n\r\nThe art plays off the more modern Detective Conan style with a bit more detail. It is visually very appealing though I do have to question the creators' choices on how they drew the characters' noses. The art is fantastic and anyone looking for a \"nice\" looking anime should be able to easily find one here.\\n\\n\r\nThe music is just as amazing as the rest of the anime. The soundtrack is the perfect accompaniment for a phantom thief. Kaito Kid's theme is a personal favorite, but the music really sets the mood for the entire anime. \\n\\n\r\nHere comes the best part of everything, the characters, Gosho Aoyama's specialty in my opinion. Every character is different and has their own \"something\" that makes them special. They're very lovable and unforgettable. Kaito is a wonderful main character and Aoko is the perfect girl for him. There's the genius detective, Hakuba, and the mysterious witch, Akako. There's even multiple visits from everyone's favorite shrunken detective, Conan. \\n\\n\r\nOverall, this anime is a gem. I highly recommend it to everyone. It doesn't appeal to a specific genre or audience. There's something in it for everyone to love. If you're hesitant, give it a chance. You won't regret it. This is my favorite anime of all time, next to Detective Conan of course.",
            "date": "2016-01-11T17:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 208299,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mitchkat1",
                "username": "mitchkat1"
            },
            "url": "https://myanimelist.net/reviews.php?id=208299"
        },
        {
            "content": "Similar to Berserk, I have no intention of reviewing Detective Conan until it's over, that said, I do kinda need something about it to review, and I haven't seen any of the movies yet as of writing this. So as such, I'm gonna review the adaptation of it's sister series of show, Magic Kaito. Not much else to say here, so let the showtime begin.\r\nStory:\r\nLike with any Gosho Aoyama work, the plot is very episodic. In fact, the actual main plot doesn't even have a proper conclusion, nor even quite a few of the subplots. So really, it's a matter on how much you enjoythese events that will determine how much you end up liking this show.\\n\r\nYou should also take note that more than a few of this show is based on on stories that came out before Aoyama's writing style evolved, so you get stuff that you wouldn't regularly see out of him anymore. For instance, magic! No, I don't mean stage magic like the stuff Kaito does, I mean actual magic with spells and everything. That said, to its core it's still Gosho Aoyama and his stories still carry the same timeless charm they once did.\\n\r\nIf there's one thing I don't like about this show is that, like I said before, it doesn't really have an ending. I can see why they did so (Aoyama only writes more Magic Kaito chapters whenever he feels like doing so) but it ultimately makes the show feel kinda incomplete.\\n\\n\r\nCharacters:\\n\\n\r\nIt wouldn't be Gosho Aoyama without a memorable cast of characters, and this show more than delivers. Kaito is a great character. It's funny, he looks like Shinichi, sounds like Shinichi, yet acts nothing like him. He's a trickster to the very core, yet does it all with the grace and elegance of a true gentleman.\\n\r\nOf course, he also has a supporting cast of equally colorful characters. Aoko serves as the Ran to Kaito's Shinichi, though far more aggressive and hot tempered. Her father Nakamori is basically a modern day Zenigata, a fantastic detective that's sadly been put against an opponent who's clearly out of his league.\\n\r\nThe rest are great too, from the arrogant Hakuba, the solemn and quiet Akako and even Kaito's dead dad Toichi, who manages to have a great deal of presence despite being, well, dead.\\n\\n\r\nAnimation:\\n\\n\r\nYou can tell this show wasn't made by the same guys who made Detective Conan. The animation isn't very good to say the least. In Conan's case this isn't a trouble considering it's mostly a mystery story (And even then it still looks quite good when it wants too), but in the case of the more physically energetic Magic Kaito, this isn't as good a thing.\\n\r\nThe character designs are based on those of the more recent chapters, and they all look quite nice. The show has also undergone a complete setting update, as now, cellphones and tablets are in common use. Hell, Kaito talks to his mum using Skype unlike the phone he had to use before.\\n\\n\r\nSoundtrack:\\n\\n\r\nThe soundtrack is quite good. It fits the lighthearted tone of the show by being very energetic, though multiple classical instruments are used here. The Opening themes, \"Kimi Wo Matsu Sekai\" and \"Ai No Scenario\" are both quite good, and I don't really prefer one or the other. Same goes for the ending themes.\\n\\n\r\nVoice Acting:\\n\\n\r\nIt's great to say the least. Kappei Yamaguchi once again returns to voice Kaito and he does an amazing job as always. It's amazing that despite also voicing Shinichi, he makes the two sound very distinct from each other. The Late Great Unsho Ishizuka also returns to voice Nakamori, and he does a great job as always.\\n\r\nEveryone else has been recast... for the second time (First in Hakuba's case). I don't really know why they did so, but I wish they don't change it anymore from now on as this is easily my preferred voices for these characters. The oh so lovely MAO gives an equally lovely performance as Aoko, though she does make me wish Aoko wore a pirate costume at some point (Damn you Gokaiger!!). The rest is great too. From Eri Kitamura, Mamoru Miyano, Atsumi Tamezaki and even the one and only Shuichi Ikeda.\\n\\n\r\nOverall:\\n\\n\r\nMagic Kaito 1412 is, for lack of a better word, fun. Is it a masterpiece? No. But damn if it cares. It is simply a love letter to this beloved character, and I am glad I watched it.\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-11-21T06:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 294481,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=294481"
        },
        {
            "content": "If you want to see how entertaining theft can get, then this is the anime you are looking for. \r\nMagic Kaito is about how a young magician, Kuroba Kaito who was finding the culprit of his father's death. to achieve this, he needed to infiltrate securities of well protected gems for the hope of finding the truth and dress as the famous phantom thief, Kaito Kid which was previously the title his father owned, much of his surprise. this is where the fun starts... to escape from the police forces, he was using his magic tricks which in turn entertained me the most. despite thefact that Magic Kaito was just recently released, i found it with a classic touch, maybe because of the cross characters, especially Conan Edogawa (from Detective Conan) and the year it was originally made. What I love about this anime is when Conan and Kaito would collide using their own wits and deceits. I was just hoping that there were few more episodes that would feature these 2. Nobody can deny that with their collision, the thrill elicited! \\n\\n\r\nIt is a bit dismaying that this anime was a bit underrated. To be honest, the uniqueness of this anime is great! Just try to watch and see it for yourself.",
            "date": "2017-07-13T09:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 252733,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5385711.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Angel_Apocalypse",
                "username": "Angel_Apocalypse"
            },
            "url": "https://myanimelist.net/reviews.php?id=252733"
        },
        {
            "content": "This series is great, but it might be best for people who are new to the fandom (which I might warn you, that you won't be able to exit) to watch the alternative version \"Magic Kaito\" first.\r\nYou see, Magic Kaito is twelve episodes and contains less spoilers of the main series \"Detective Conan\" (aka. Meitantei Conan/Case Closed). This series still gives you the same amount of fun, and especially for people who are already fond of DC (Detective Conan). This is only a warning, as in some episodes of MK 1412 you get to see cases which appear in DC, just from Kaito's view. Thatwill end in spoilers in DC, as the episodes are mostly about how to solve the notes, tricks and codes from Shinichi (DC's mc) point of view. Both MK and MK 1412 are great animeseries, but in my opinion you will probably have more fun watching MK first if you're only curios about the series, then watch DC, and after you have seen enough episodes you can go on to MK 1412. Some of the stuff in MK and MK 1412 are the same though, as it is the same story, but with some other art and details.\\n\\n\\n\r\nNow, onto MK 1412; The series is great, and a lot of fun. I would say that it totally is comedy, and some action. You also get the mystery part through this series. \\n\\n\\n\r\nThe MC, Kuroba Kaito, is a funny character, alongside his friends. We follow him through the story as Kaito and Kaito Kid. As earlier mentioned we also get to see scenes from DC from Kaito's view, which are hilariously funny, as he goes from \"mysterious-handsome-gentleman-phantom-thief\" to \"Kuroba-Kaito\".\\n\\n\\n\r\nI really don't want to spoil too much, it's just great, so just give it a shot! If you end up liking MK and MK 1412, you can always watch DC, where Kaito Kid appear every now and then. He also appear in some of the DC movies (which are really good, in my opinion).",
            "date": "2018-05-23T09:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 281245,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6324358.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HeadShadow",
                "username": "HeadShadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=281245"
        },
        {
            "content": "The best was to describe Magic Kaito 1412 is \"simple\", too simple actually. The story surrounds around Kaito who realize his father was a great thief and he decides to become one himself to realize the mystery behind his father death. \r\nKaito Kid is supposedly one of Conan ultimate rivals, one who can challenge the great detective and make a run for it, however watching this show doesn't give any such ideas.\r\nKaito tricks are very simple yet he always win in the easiest way because every other character in the show are so naive. With that in mind this 24 episodic anime feels like acollection of cheap fillers while the only decent episodes are those featuring Conan.\\n\\n\r\nWhen I started watching this show I expected some interesting and genius type of heists but no what I got was a high school kid walking into any museum and stealing stuff in front of a whole police squad.\\n\\n\r\nKaito is a terrible character. He treats his best friend who loves him and makes him dinner every day as a total jerk with crude remark about her chest, how she's ugly and how her father -who welcome him in his house every day- is an idiot.\\n\\n\r\nKaito reminds me a lot of Kirito form SAO, the idiot and self-centered douchebag who gets praised form every other character in the show.\\n\\n\r\nThis anime could have benefited a lot from being even a little more serious with better and more fleshed-out characters, deeper plot, interesting heists and a totally different MC persona.",
            "date": "2016-04-16T12:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 216506,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5274749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yatyear",
                "username": "Yatyear"
            },
            "url": "https://myanimelist.net/reviews.php?id=216506"
        },
        {
            "content": "“Ladies and Gentleman! I bring you marvelous illusions that make this town sparkle at night.” – Kaito Kid; Magic Kaito 1412\r\nEver since magic has become a trend genre in 21st century – most likely since the release of the Lord of the Rings/Harry Potter franchise - we have seen many films involving the preternatural, yet wonderful power; and many more will come. And consequently, magic found its way into the “world” of anime. But what about illusions? \r\nTo put it plainly, an illusion is a distortion of the human senses; and though they distort reality, they are generally shared by most people. It describes amisinterpretation of a true sensation – unlike hallucination. So no abracadabra: just a trick…\\n\\n\r\nAnd this is what this show – Magic Kaito 1412 – is mainly about: illusions and tricks, but the feelings are magical. It is the job of an illusionist to keep its audience entertained throughout the show. A job which Magic Kaito 1412 does very conscientiously. \\n\\n\r\nThe magic show is a largely episodic series centered on the adventures of the high school student Kaito Kuroba, who shines as a charismatic gentleman thief - who steals rare jewelry and returns it shortly afterwards - to thwart the people responsible for the death of his father: the original Kid, the Phantom Thief. And yet Kaitos father has his own set of background episodes without being actually present throughout the series. In fact, these episodes are essential to the story because it shows what motivates Kaito to become what he is during the present storyline. \\n\\n\r\nFor the most part of the magic show, however, Kaito Kid does what he has to: he keeps his show moving and the audience entertained. He performs most of his heists in such a flashy manner that it rapidly turns into a free magic show – much to the displeasure of the hotheaded inspector Nakamori and the Japanese police. Besides Kaito Kid, inspector Ginzo Nakamori and his daughter Aoko are the most prominent amongst the cast members during the 24-ep. run; the latter is ironically Kaitos friend who he has known since they were kids. \\n\\n\r\nSome of those who might have expected rather cheesy magical battles between the characters might have been disappointed and have even dropped the show. Instead of this, Magic Kaito 1412 features in most episodes a very nice cat-and-mouse game. It might feel repetitive once you are halfway through the show; and yet, since everyone has his own taste and preference, each episode might be either a hit or a miss. And rather than relying on fan service or cliché romance stories, the magic show delivers a very charming comedy and simple storytelling instead. Simple but clever. \\n\\n\r\nThe character design is nicely done throughout the magic show - especially Kaito Kid is clothed quite noticeable; some of the characters noses, however, look rather bizarre at times. It does not ruin the anime in its entirety but it might be distracting. Nevertheless, Ginzo Nakamoris frustrating, but amusing expressions, Akakos rather mysterious beauty and Hakubas sense for style truly fit each characters design. The settings, on the other side, work very well and do not share similarities with the ones that have already been used in previous episodes. And due to the excellent cuts an edits, the magic show becomes even more suspenseful. \\n\\n\r\nA rather decent, yet well balanced and slightly jazzy soundtrack delivers all the emotions it has to. After all, nothing seemed misplaced in the anime where a few dramatic moments are also captured on screen. But mostly, the soundtrack supports Kaitos actions during the magic show and is worth listening on its own. On the other hand, the voice cast deserve praise for their solid performance; thanks to their skillful effort, it helped the characters (and the show) coming to life. \\n\\n\r\nIs this show a hallucination or an illusion? Well, it is obvious, is it not? Kaito Kid is a good host who keeps his audience entertained throughout his magic show. Whether he appears under the moonlight or is walking through the air, his audience will not get bored. Kaito Kid creates the illusion and fools you - while having a gentle smile on his face...\\n\\n\\n\r\nPersonally, I thought the anime was a real thrill to watch. It might have some flaws here and there but they do not ruin the atmosphere the magic show creates from the very beginning. At the end, it is all about illusions. And illusion is nothing more than a misinterpretation of art in its own true nature. \\n\\n\r\n“See you… next illusion.” – Kaito Kid\\n",
            "date": "2015-09-24T06:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 199415,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269669.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MestariYN",
                "username": "MestariYN"
            },
            "url": "https://myanimelist.net/reviews.php?id=199415"
        },
        {
            "content": "Magic Kaito 1412 is one of those animes that you can expect the outcome of each episode yet still enjoy it overall. If you're a fan of phantom thieves, detectives, or the anime Detective Conan, this spin-off series about Kaito Kid will entertain you.\r\nSTORY\r\nThe story is pretty much repeated throughout every episode: Kaito Kid steals the gem, only to find it's not the one he's looking for. It's pretty much the same throughout. Each antagonist that Kaito Kid encounters is unique, and each of them had their own motives. Of course, a few of villains return to the scene from time-to-time. And of course, DetectiveConan makes an appearance every few episodes. Some things are still left a mystery, such as who runs the evil organization that killed Kaito's father. Despite the repetition, the story was pretty good. One last good point is that there weren't a lot of fillers.\\n\\n\r\nART\\n\\n\r\nThe art is in the same style as Detective Conan, and everything and everyone was well-drawn. The animation was good, as well. \\n\\n\r\nSOUND\\n\\n\r\nThe music in the show was nice, and it fit the mood well. The opening songs were really nice, as were the endings. \\n\\n\r\nCHARACTER\\n\\n\r\nOkay, maybe the characters were a bit stereotypical, even predictable, but they were still pretty fun to watch. I didn't see a whole lot of character development, since all of the characters didn't seem to grow much. Each of the characters' personalities were unique yet stereotypical. Kaito is the typical proud, showoff goofball, but as Kaito Kid, he acts like gentleman, still retaining his pride. Inspector Nakamori is the stubborn, kinda stupid cop who's obsessed with catching Kaito Kid, but he gets a little smarter near the end. His daughter Aoko is the annoying girl who's always teasing Kaito. I could go on, but I won't.\\n\\n\r\nENJOYMENT\\n\\n\r\nAs fan of phantom thief animes, I really enjoyed this. It was fun seeing Kaito use his magic tricks to fool the police and steal those gems. However, it was a shame that Kaito never found the Pandora gem.\\n\\n\r\nOVERALL\\n\\n\r\nOverall, this was a really good anime, despite being extremely repetitive and predictable. Again, if you like phantom thieves, detectives, or Detective Conan, you will probably enjoy this anime. :)",
            "date": "2015-10-28T13:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 202164,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4861967.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Invisible_again",
                "username": "Invisible_again"
            },
            "url": "https://myanimelist.net/reviews.php?id=202164"
        },
        {
            "content": "This is my first review on My Anime List, so I hope it's good!\r\n~~\r\nMagic Kaito 1412. A masterpiece anime, one of the first few animes I ever watched, and I finished it in January 2017. I believe it is the second anime I've completed, behind Sword Art Online. I was bored and had nothing else to do, so I was watching SAO, when a family member came up and suggested some new ones for me, those animes including Magic Kaito 1412, Detective Conan, and also Assassination Classroom, if I remember correctly. Out of all three of those recommendations, MK1412 was the one I enjoyed themost. I watched one episode of each other anime, but for MK1412 I watched until about the middle of Episode 3. \\n\r\nI loved this anime. It's plot was simple, and I loved the interesting characters, beautiful music, and stunning art.\\n\\n\\n\r\nStory: \\n\r\nThe story is rather simplistic. Although the plot remains kind of the same for all of the episodes (Kaito goes somewhere, steals the gem, etc.), the charm behind this simple story line is how it's presented. Each way is unique, and I think everyone will always look forward to the different ways that Kaito is going to steal the gem.\\n\\n\r\nArt/Animation: \\n\r\nI personally feel like the art and animation in this show is beautiful! The openings are absolutely stunning, and the actual episodes are as well, one of my favorite epiosdes in terms of art and animation being Episode 21, where Kid teleports. Even if it's extremely short or small moments, there's always something that stands out to me. MK1412 has absolutely amazing art/animation.\\n\\n\r\nSound: \\n\r\nThe music in this anime is absolutely perfect. The opening and ending songs are perfect (Ai no Scenario=perfect opening), and the OST is stunning. I got the OST as a gift one time, and I listen to it whenever I need some good mood music. (My favorite tracks are \"Magical Flight\" and \"You'll see the KID\"). The right music always plays at the right time, making this anime all the more amazing.\\n\\n\r\nCharacters:\\n\r\nKaito is the definition of a perfect anime character. He's got just the right amount of everything that makes a great anime character.  He's got the humor, good story, etc. Aoko is a perfect love interest for him. She's so adorable, and I ship her and Kaito like tomorrow! Personally, I don't like Hakuba that much, but I'm okay with Akako. I personally wish the two of them got more screen time. Personally, I feel this also for the mysterious evil organization, as they only appear in a total of 4-5 episodes out of all 24. But overall, the characters are great! Characters are always a big part of why animes are great!\\n\\n\r\nEnjoyment: 10/10\\n\r\nI mean, who doesn't love magic? Kaito Kid brings it to the next level! Personal favorites for me have always been his seemingly impossible tricks like walking on air and teleportation. There's something for everyone! There's plenty of comedy packed in between Kid's stunning magic tricks, and although not as frequent, there's a good amount of romance to keep you hooked. (Kaito and Aoko are my OTP!) Although at times I felt like some parts of an episode were a little bit slow, I still loved it.\\n\\n\r\nOverall: 10/10\\n\\n\r\nMK1412 was a masterpiece! I highly recommend it to anyone who is brand new to anime. It's a perfect starting point, as it is easy to understand, and it's highly entertaining as well. Everything about it is amazing, and I so hope that a season 2 will be coming soon.",
            "date": "2018-03-06T08:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 273186,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7032310.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dazel1412",
                "username": "Dazel1412"
            },
            "url": "https://myanimelist.net/reviews.php?id=273186"
        },
        {
            "content": "When I was younger, I was a fan of the original whole detective Conan thing but now I am a little put-off by the artwork of the original film. This spin-off from that show is, for me, surprisingly good. Of course, I can still list several things that are just illogical about the anime, but this anime is pretty amazing and nice, something that I really enjoyed watching.\r\nIf you're looking for a lot of romance, cheesy, sappy and all that stuff, it's really not for you. This anime isn't centered on romance if that's what you're looking for. Personally, I rather like the female MCbecause she is more than your normal high school whiny girl. Of course, she's clueless about what's going on and does act occasionally like one, she isn't all clingy on the MC (Being all clingy and cringy is something I really don't want to see in anime...)\\n\\n\r\nBut if you're looking for shounen, action, mystery, and all that, I believe you should consider this anime. It's not really heavy mystery and detective based but it also involves the MC's everyday life and his detailed preparations for his heists. Even though there are some cliche aspects in the anime and predictable moments, there are also some results that might surprise you. \\n",
            "date": "2017-07-21T13:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 253399,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337921.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kadrian",
                "username": "Kadrian"
            },
            "url": "https://myanimelist.net/reviews.php?id=253399"
        },
        {
            "content": "I think for magic lovers can get a different sensation if watching this anime, better see the specials first and the alternative setting  \" Detective Conan \", but if you want to feel the original story, better you watch this anime first.\r\nIn this anime you can feel the romance and comedy sensation from male student who hides his identity from his childhood friend as well as some of his friends in him school who is also an enemy knows his secret.\r\nAt night the student turned into a reliable thief in playing magic, tricks and also run away from the pursuit of the police. Thethief has a nickname named \"Kaito Kid\" which means criminal code number 1412.\\n\\n\r\nI like this anime because the graphics are pretty good and also the plot of story was interesting.\\n\\n\r\nSory for bad reviews and also for bad translation .",
            "date": "2017-05-07T07:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 247132,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5943247.jpg",
                "scores": {
                    "animation": 8,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ginkamaru",
                "username": "Ginkamaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=247132"
        }
    ],
    [
        {
            "content": "If there is a question about an anime that does their job in entertaining people so well, then Magic Kaito 1412 is one of those best answers. Filled with 24 minutes of excitements & deception makes Magic Kaito 1412 one of the most enjoyable series between Fall 2014 to Winter 2015.\r\nAs we know, an episodic series is like a gamble of life and death, some success while the others are not.  The main concept of Magic Kaito 1412 is very simplistic, they do the same things from episode to episode just like an endless cycle. Almost all episodes do this endless cycle, except forthe early episodes and some others.\\n\\n\r\nNew diamond introduced - Kaito steals the diamond - The police failed - It's not the diamond \\n\r\nthat he was looking for - Kaito returned the diamond to the police\\n\\n\r\nAlthough the concept is rather too simplistic, but the anime fully appealed the individual element of the story itself, especially the comedy and adventure parts. \\n\\n\r\nIf we talk about the animation, Magic Kaito 1412 may not be as good as the other, but the animation is completely different from the others which make it more memorable and unique, like an \"icon\". For the sound settings, the background music is wonderful & quite catchy while the seiyuu done their job decently. I personally adore the 2nd opening of the series \"Ai no Scenario\" sung by Chico with HoneyWorks, it is really good indeed.\\n\\n\r\nThe characters of an episodic anime sometimes criticized by people because of lack of development. Thankfully Magic Kaito managed to run away from the tiger's cage. What we have here is not a character growth but it's ability to refine the story. The main character, Kaito Kuroba himself it's described as an omniscient thief, sometimes he interacts with Aoko in a confusing but unique romance setting. Although the main character often referred as a \"stereotypical\", but the good thing is each single characters plays their roles pretty well. The villains actually appear randomly but the good thing is the villains have their own motive, which is good.\\n\\n\r\nThe elegant & magnificent Kaito Kid really did well in entertaining his audience this night. It is recommended for those who seeks for light anime that simply just entertains the audience with its magic. It is really a magical experience indeed.",
            "date": "2015-04-20T19:59:00+00:00",
            "helpful_count": 74,
            "mal_id": 186100,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3785029.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CecaniahCorabele",
                "username": "CecaniahCorabele"
            },
            "url": "https://myanimelist.net/reviews.php?id=186100"
        },
        {
            "content": "There's a perpetual, particular mindset that one must have in order to appreciate and enjoy magic. It's something innocent. It's something that makes you appreciate the awe and wonder presented in the moment; a beautiful deception. A part of you will want to know the answer, constantly hunting for the secret. But another part of you doesn't mind. It's something that you want to know the answer to, but know you shouldn't. That's because you know the answer doesn't matter. You want to be fooled.\r\nMagic Kaito 1412 is a rather simplistic show, despite magic being its core element. It's an episodic series and, as such,doesn't require much of an obligation to follow intently. Like all episodic series, some episodes will also be better than others. However, this layout works impeccably well for this particular show; I couldn't imagine it being done differently. For the most part, Magic Kaito is broken down into heists that usually span one episode, with the occasional part-two. In each episode Kaito dons the persona of the Kaito Kid, an unconventional, gentlemanly thief, who steals rare jewelry and returns it shortly afterwards. He often performs his heists in a flashy manner, which often becomes something like a free, public magic show. Periodically, characters from Detective Conan make appearances (Shinichi/Conan really being the only relevant figure, of course), which is entertaining in its own right. \\n\\n\r\nDue to the episodic nature of the series, many of the characters who appear in Magic Kaito are not recurring. The only characters who appear in every episode are Kaito and Aoko, who have been friends, and neighbors, since childhood. The dynamic between Kaito and Aoko is very light-hearted and exactly what you would expect from close friends. Their relationship, for the most part, seems fun and realistic, yet also quite childish and pure. They tease one another, but also know when to support each other as well. They share quite a few sweet, romantic moments in the series, which was a more refreshing type of intimacy that you rarely see in many shows nowadays. It's not overbearing, nor is it the main focus, but it offers a warm, cozy feeling nonetheless. Unfortunately, character development is not a strong point of Magic Kaito. There isn't much growth or change in any of the characters, so what you see is what you're going to get from episode one onwards. In addition, many of the characters in the series give off the impression of being fairly dumb, to be quite frank. But, I suppose there's a certain pitiful charm to their stupidity that slowly becomes endearing.\\n\\n\r\nThe art, animation, and sound are easily the weakest points of Magic Kaito, though that is something that's to be completely expected. This is not a show with high production values and it never gave off any impressions of being one. It doesn't have the best visual appeal, nor is the soundtrack anything special. However, production values don't mean everything. Magic Kaito takes a more humble approach to a very pleasant series and it works well enough.\\n\\n\r\nIn spite of its exceedingly lacking popularity, Magic Kaito 1412 was a very delightful, lively watch. The heart of all magic tricks and illusions lies within the enjoyment of the people watching, a point that is well pointed out in this series. In that regard, Magic Kaito 1412 succeeds.",
            "date": "2015-04-05T03:34:00+00:00",
            "helpful_count": 30,
            "mal_id": 184804,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/586079.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Satire",
                "username": "Satire"
            },
            "url": "https://myanimelist.net/reviews.php?id=184804"
        },
        {
            "content": "\"Ladies and gentlemen! I bring you the illusions that sparkle at night\"- Kid the Phantom Thief.\r\nIf you are already a fan of Kid the Phantom Thief or Detective Conan, you should enjoy this series. If you are unfamiliar with either of those names, you can still watch this series and enjoy it. Having information about the characters will definitely inform your viewing experience, but it is not needed.\r\nStory: 7\r\nThis series is episodic in nature, which each story focusing on Kid the Phantom Thief attempting to steal some jewel or valuable object, which brings him into conflict with the police, other thieves, royalty, teen detectives, anda certain child detective. The engaging part of the story is learning the explanation behind the magic tricks performed in the series (most of which are pretty clever). Many scenarios require a great suspension of disbelief, and the stories can be formulaic at times, but still very enjoyable.\\n\\n\r\nArt: 8\\n\r\nThe animation quality is great, recreating the unique art-style from the manga. There are plenty of night shots with beautiful lighting and lots of flowing capes.\\n\\n\r\nSound: 8\\n\r\nThe background music is great, there are a couple really great tracks that range from jazz to techno beats. The OPs and EPs are great tunes and get you excited for the series. The Japanese dub has great voice acting, especially from the main character.\\n\\n\r\nCharacter: 7\\n\r\nI've heard complaints the characters are stereotypical. I can see how characters fit into typical shonen character roles, but they are enjoyable nonetheless. Kaito is a stubborn and prideful guy who has a good heart and Aoko is a sweet girl who just can't seem to be honest with him about her feelings, but she can give him the what for when needed!\\n\\n\r\nEnjoyment: 9\\n\r\nThe idea of having a secret identity is a story-line I enjoy watching and the mission Kaito gives himself at the start of the series provides strong motivation to his actions. Having not watched any Detective Conan prior to viewing this, I was apprehensive about watching a spin off series from a long running show . Magic Kaito proved to be very entertaining and a good adventure series, and the episodes with Conan are some of the best ones! Seeing the magic tricks explained and seeing mysteries solved kept me interested in watching more. Kid the Phantom Thief is so charismatic that you can't help but cheer for him!",
            "date": "2015-04-01T12:58:00+00:00",
            "helpful_count": 29,
            "mal_id": 184401,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4445780.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JosChaMur",
                "username": "JosChaMur"
            },
            "url": "https://myanimelist.net/reviews.php?id=184401"
        },
        {
            "content": "Batman:Japan is a relaunch of the classic superhero movie but with a Japanese Bruce Wayne joining the world of crime instead of fighting it in order to find his father's killer. All jokes aside, as someone who loved the 2010 version I just had to pick this up. Although a lot of the episodes are the same with some extremely minor details changed, it does include contents from a couple of the Kaitou Kid specials from the Conan anime which is nice because it gives Kaito fans a way to enjoy a comprehensive collection of all of our favourite phantom thief's adventures without having tosift through 700 episodes of Conan. \\n\\n\r\nFrom an aesthetic perspective, the show looks quite good. The characters look more crisp than the OVA version and the colours are more vibrant. However, it's hard to say if 1412 is strictly better than  the OVA version in terms of art because the OVA had a bit of an old school charm to it. Also some of the CGI looks really out of place in 1412. The soundtrack of this show is honestly amazing. All of the opening and ending these can be contenders for the top 5 opening and endings themes of the season. The BGM ranges from some sappy jazz to quick beat rhythm that makes you want to move along with the action. \\n\\n\r\nNow the problem with Kaito is that the story is quite repetitive. It's akin to the monster of the week shounen but with thefts. Though some of the ways Kaito solves his problems can be considered as bigger asspulls than No Game No Life, a lot of the more thought out ones, especially the ones involving Conan, are quite intriguing and will make you go \"aha\" afterwards. To me, the most important aspect of the show are the characters. Honestly speaking, the main characters Kaito and Aoko are quite stagnant and set in their tropes. However, there's no rule stating that stagnant characters cannot be loveable characters. Though Kaito can sometimes make you cringe with his white knighting neckbeard fedora M'lady act, he and Aoko both have a sort of charisma that makes you love them. They are especially adorable during the romance episodes albeit being a bit cheesy. \\n\\n\r\nI would definitely recommend this anime to people looking to watch something lighthearted and have some fun. And I would definitely recommend it to Conan fans who haven't checked out the OVA version yet as this is the ultimate fanservice.",
            "date": "2015-03-31T01:08:00+00:00",
            "helpful_count": 22,
            "mal_id": 184210,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1260431.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BloodRequiem",
                "username": "BloodRequiem"
            },
            "url": "https://myanimelist.net/reviews.php?id=184210"
        },
        {
            "content": "“Opportunity makes a thief.” – Francis Bacon\r\nFor any thief, lying, stealing, and taking every opportunity is part of their job. What about for a guy like Kaito? He seizes every opportunity and takes granted by the decisions he makes. The end result is usually something desirable in his favor. You know what they say about magic right? It’s like a fantasy wonder and Kaito makes it his own reality. Magic Kaito is like magic because it will leave you in a state of awe for seizing every opportunity to shine with its presentation.\r\nFor starters, the series has some loosely connection with Detective Conan (Case Disclosed),another series by Gosho Aoyama. However, this only starts and stops at cameos from certain characters between the shows. In essence, Magic Kaito operates on his own set of principles with its unique story. And as for this story, we have a young man who takes on a double persona. His name is Kaito Kuroba, who occasionally goes by his infamous alter ego, Kaito Kid. The series also depict a bit about his father, a man that Kaito looks up to. But unfortunately, his father was killed eight years prior to the events of the story. In present time, Magic Kaito 1412 focuses on Kaito with his double life and in a story of magic and mystery origins.\\n\\n\r\nTo call this series a mystery might be an overstatement for some though. At taking a closer glance, it’s immediately obvious who Kaito’s alter ego is. Even with the masterfully disguised transformations, the series takes on a more lighthearted atmosphere with the phantom thief trope. The other side of the story also shows Kaito’s normal life where he lives with a normal family and hanging out with his normal childhood friends, Aoko. So how does this show manage to succeed? Simple. Like a thief, the series seizes every opportunity to show what the franchise is capable of. It captures a well-meaning sense of events as well as sending the right message. Staying honest with its premise, the series adapts events relating to Kaito and his mischievous adventures. It can even feel complex at times when Kaito gets into more trouble than he should be when getting involved with authority figures. But hey, that’s what makes this show stand out so well. It shows a multidimensional portrayal of Kaito’s character that connects with the story. And like any story, the series also adapts a promising cast of characters.\\n\\n\r\nAlthough Kaito is the main star of the show, the other cast members aren’t neglected. Most prominently, we see Kaito’s childhood friend Aoko who he has known since they were kids. The series makes some obvious suggestions that the two are mutually attracted to another but often plays it off with teasing. However, it creates a charming atmosphere when any opportunity comes and goes. There’s chemistry between Kaito and Aoko that extends more than just childhood friends. The events they become a part of manages to beautifully articulate and craft their roles. It also creates a variety of emotions when we see the outcome of these events. There’s also relevance when it comes to every episode when the characters become part of the problem or solution. Because like I mentioned before, all the main cast gets some spotlight whether it’d be Kaito’s rival Saguru, the mischievous witch Akako, or the hotheaded investigator Ginzo Nakamori. Even Kaito’s father has his own set of background episodes despite not being actually being present in the series. This is important because it’s what motivates Kaito to become the person he is during the present storyline. And while he isn’t actually present in the events of the present, the show manages to create a great belief with the man. In retrospect, it’s inspirational and accomplishes what it’s trying to do – seizing the opportunity with a platform of gadgets it has to work with. On the downside, the show’s subtle romance isn’t exactly strong in its standards as the main focus is usually on the phantom thief himself.\\n\\n\r\nDespite titled ‘Magic Kaito 1412’, you won’t be getting cheesy magical battles between characters. Rather, many of the episodes features a cat-and-mouse like game. Some parts of the story will feel repetitive and predictable while others can have unexpected results. Take it as a grain of salt but the series does have some episodes that will be a hit or miss when it comes to expectations. Still, one thing I always give credit for this show is the charming comedy. It doesn’t rely on shock value such as fan service or cliché romance angles. Instead it delivers by its remarkable performance between the characters that connects with the story. Easily understandable yet compelling. Silly at times yet relevant. Simple yet intelligent. This show is like a love child from the great Harry Houdini himself.\\n\\n\r\nA-1 Pictures adapts this series and although not impressive with some of their shounen adaptations, this show is one to admire. Every setting has its props that works well whether it’s the handy gadgets Kaito uses or what he steals. Character designs are also very convincing especially with Kaito and his noticeable outfit. That white tall hat complete with a pair of long cape and eyeglass makes him stand out as the poster boy of the show. Other characters are also fitting with their design such as Akako’s mysterious beauty as her role of the witch and the frustrating yet amusing expressions of inspector Ginzo. However, one feature of the character designs I have to bring up would be the characters’ noses. It shouldn’t be hard to spot but some of the noses are a bit over exaggerated than it should be. While it does not ruin the characters, the design there can be distracting.\\n\\n\r\nFor more or less, music and soundtrack does play some key roles in this show. Starting with the OP and ED songs, the series appeals to its lyrics and highlights moments of Kaito’s mysterious career in short yet catchy scenarios. Every episode’s soundtrack also has this consistency to adapt its various tropes to the point. Without the OST or soundtrack, some scenes may be left without its texture and feelings. But when coordinated like the way it did, the show comes to life thanks to its skillful effort at this adaptation. Finally, voice mannerisms has great expression. I give praise to Kaito and Akako’s VA for portraying their double life characters. It’s not always easy to play a character that portrays different personalities but Kappei Yamaguchi and Eri Kitamura did wonderfully. \\n\\n\r\nThis series may feel a bit underrated at times but overall is a fun take for a shounen adventure. Rather than battling against monsters or saving the world, we have Kaito fighting with his own motivations. The characters that he gets acquainted with all has some connection with the overall tone of the story. And despite some episodes being predictable, it’s overall riveting as it reminds us how fun sometimes life can be. And as a side bonus, some of your favorite characters from Detective Conan may surprise you in this series. So let this show unfold and tell you a story about a man who became the phantom thief.",
            "date": "2015-05-08T23:37:00+00:00",
            "helpful_count": 11,
            "mal_id": 187413,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=187413"
        },
        {
            "content": "Magic Kaito 1412, a place to test your wits!\r\nThe story of Magic Kaito is pretty much about how Kaito steals the famous jewels with fancy tricks different every time. \"A magician never repeats the same trick twice\" -Kaito I guess that's why there's new tricks every time :P Other characters introduced like Akako and Hakuba weren't really always seen which makes us wait for them to actually appear. Both of them altogether probably only appeared around 6 times out of the 24 episode where I'm expecting a bit more since they still are the supporting characters. \r\nI'm glad that there are still a few appearancewhere the Phantom Thief goes against the famous detective which makes it anticipating. Everybody knows that Kaito will win in these showdowns but with a few close calls of where he almost gets caught.\\n\\n\r\nStill this is a battle of wits for Kaito, like man, he has an IQ of over 400. How smart can he actually be. \\n\\n\r\nI'm waiting for the second season for this. I'm still waiting for the illusion to officially end where he gets Pandora :D",
            "date": "2015-04-08T04:15:00+00:00",
            "helpful_count": 10,
            "mal_id": 185129,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4537481.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sugarhoney322",
                "username": "sugarhoney322"
            },
            "url": "https://myanimelist.net/reviews.php?id=185129"
        },
        {
            "content": "This show is a remake of what I would consider an anime classic and it is certainly done right. It contains all the elements a Kaito Kid and Detective Conan fan would be looking for.\r\nThe story is simple, but great. We follow Kaito on his misadventures in thievery and everyday life. It starts off a bit slow, but quickly picks up pace. Kaito's main goal in almost every episode is to steal some kind of jewel, but the story never gets boring. There is something about the Kaito Kid that is captivating and alluring. You'll never be bored and it's incredible to see how hismagic tricks work. \\n\\n\r\nThe art plays off the more modern Detective Conan style with a bit more detail. It is visually very appealing though I do have to question the creators' choices on how they drew the characters' noses. The art is fantastic and anyone looking for a \"nice\" looking anime should be able to easily find one here.\\n\\n\r\nThe music is just as amazing as the rest of the anime. The soundtrack is the perfect accompaniment for a phantom thief. Kaito Kid's theme is a personal favorite, but the music really sets the mood for the entire anime. \\n\\n\r\nHere comes the best part of everything, the characters, Gosho Aoyama's specialty in my opinion. Every character is different and has their own \"something\" that makes them special. They're very lovable and unforgettable. Kaito is a wonderful main character and Aoko is the perfect girl for him. There's the genius detective, Hakuba, and the mysterious witch, Akako. There's even multiple visits from everyone's favorite shrunken detective, Conan. \\n\\n\r\nOverall, this anime is a gem. I highly recommend it to everyone. It doesn't appeal to a specific genre or audience. There's something in it for everyone to love. If you're hesitant, give it a chance. You won't regret it. This is my favorite anime of all time, next to Detective Conan of course.",
            "date": "2016-01-11T17:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 208299,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mitchkat1",
                "username": "mitchkat1"
            },
            "url": "https://myanimelist.net/reviews.php?id=208299"
        },
        {
            "content": "Similar to Berserk, I have no intention of reviewing Detective Conan until it's over, that said, I do kinda need something about it to review, and I haven't seen any of the movies yet as of writing this. So as such, I'm gonna review the adaptation of it's sister series of show, Magic Kaito. Not much else to say here, so let the showtime begin.\r\nStory:\r\nLike with any Gosho Aoyama work, the plot is very episodic. In fact, the actual main plot doesn't even have a proper conclusion, nor even quite a few of the subplots. So really, it's a matter on how much you enjoythese events that will determine how much you end up liking this show.\\n\r\nYou should also take note that more than a few of this show is based on on stories that came out before Aoyama's writing style evolved, so you get stuff that you wouldn't regularly see out of him anymore. For instance, magic! No, I don't mean stage magic like the stuff Kaito does, I mean actual magic with spells and everything. That said, to its core it's still Gosho Aoyama and his stories still carry the same timeless charm they once did.\\n\r\nIf there's one thing I don't like about this show is that, like I said before, it doesn't really have an ending. I can see why they did so (Aoyama only writes more Magic Kaito chapters whenever he feels like doing so) but it ultimately makes the show feel kinda incomplete.\\n\\n\r\nCharacters:\\n\\n\r\nIt wouldn't be Gosho Aoyama without a memorable cast of characters, and this show more than delivers. Kaito is a great character. It's funny, he looks like Shinichi, sounds like Shinichi, yet acts nothing like him. He's a trickster to the very core, yet does it all with the grace and elegance of a true gentleman.\\n\r\nOf course, he also has a supporting cast of equally colorful characters. Aoko serves as the Ran to Kaito's Shinichi, though far more aggressive and hot tempered. Her father Nakamori is basically a modern day Zenigata, a fantastic detective that's sadly been put against an opponent who's clearly out of his league.\\n\r\nThe rest are great too, from the arrogant Hakuba, the solemn and quiet Akako and even Kaito's dead dad Toichi, who manages to have a great deal of presence despite being, well, dead.\\n\\n\r\nAnimation:\\n\\n\r\nYou can tell this show wasn't made by the same guys who made Detective Conan. The animation isn't very good to say the least. In Conan's case this isn't a trouble considering it's mostly a mystery story (And even then it still looks quite good when it wants too), but in the case of the more physically energetic Magic Kaito, this isn't as good a thing.\\n\r\nThe character designs are based on those of the more recent chapters, and they all look quite nice. The show has also undergone a complete setting update, as now, cellphones and tablets are in common use. Hell, Kaito talks to his mum using Skype unlike the phone he had to use before.\\n\\n\r\nSoundtrack:\\n\\n\r\nThe soundtrack is quite good. It fits the lighthearted tone of the show by being very energetic, though multiple classical instruments are used here. The Opening themes, \"Kimi Wo Matsu Sekai\" and \"Ai No Scenario\" are both quite good, and I don't really prefer one or the other. Same goes for the ending themes.\\n\\n\r\nVoice Acting:\\n\\n\r\nIt's great to say the least. Kappei Yamaguchi once again returns to voice Kaito and he does an amazing job as always. It's amazing that despite also voicing Shinichi, he makes the two sound very distinct from each other. The Late Great Unsho Ishizuka also returns to voice Nakamori, and he does a great job as always.\\n\r\nEveryone else has been recast... for the second time (First in Hakuba's case). I don't really know why they did so, but I wish they don't change it anymore from now on as this is easily my preferred voices for these characters. The oh so lovely MAO gives an equally lovely performance as Aoko, though she does make me wish Aoko wore a pirate costume at some point (Damn you Gokaiger!!). The rest is great too. From Eri Kitamura, Mamoru Miyano, Atsumi Tamezaki and even the one and only Shuichi Ikeda.\\n\\n\r\nOverall:\\n\\n\r\nMagic Kaito 1412 is, for lack of a better word, fun. Is it a masterpiece? No. But damn if it cares. It is simply a love letter to this beloved character, and I am glad I watched it.\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-11-21T06:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 294481,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=294481"
        },
        {
            "content": "If you want to see how entertaining theft can get, then this is the anime you are looking for. \r\nMagic Kaito is about how a young magician, Kuroba Kaito who was finding the culprit of his father's death. to achieve this, he needed to infiltrate securities of well protected gems for the hope of finding the truth and dress as the famous phantom thief, Kaito Kid which was previously the title his father owned, much of his surprise. this is where the fun starts... to escape from the police forces, he was using his magic tricks which in turn entertained me the most. despite thefact that Magic Kaito was just recently released, i found it with a classic touch, maybe because of the cross characters, especially Conan Edogawa (from Detective Conan) and the year it was originally made. What I love about this anime is when Conan and Kaito would collide using their own wits and deceits. I was just hoping that there were few more episodes that would feature these 2. Nobody can deny that with their collision, the thrill elicited! \\n\\n\r\nIt is a bit dismaying that this anime was a bit underrated. To be honest, the uniqueness of this anime is great! Just try to watch and see it for yourself.",
            "date": "2017-07-13T09:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 252733,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5385711.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Angel_Apocalypse",
                "username": "Angel_Apocalypse"
            },
            "url": "https://myanimelist.net/reviews.php?id=252733"
        },
        {
            "content": "This series is great, but it might be best for people who are new to the fandom (which I might warn you, that you won't be able to exit) to watch the alternative version \"Magic Kaito\" first.\r\nYou see, Magic Kaito is twelve episodes and contains less spoilers of the main series \"Detective Conan\" (aka. Meitantei Conan/Case Closed). This series still gives you the same amount of fun, and especially for people who are already fond of DC (Detective Conan). This is only a warning, as in some episodes of MK 1412 you get to see cases which appear in DC, just from Kaito's view. Thatwill end in spoilers in DC, as the episodes are mostly about how to solve the notes, tricks and codes from Shinichi (DC's mc) point of view. Both MK and MK 1412 are great animeseries, but in my opinion you will probably have more fun watching MK first if you're only curios about the series, then watch DC, and after you have seen enough episodes you can go on to MK 1412. Some of the stuff in MK and MK 1412 are the same though, as it is the same story, but with some other art and details.\\n\\n\\n\r\nNow, onto MK 1412; The series is great, and a lot of fun. I would say that it totally is comedy, and some action. You also get the mystery part through this series. \\n\\n\\n\r\nThe MC, Kuroba Kaito, is a funny character, alongside his friends. We follow him through the story as Kaito and Kaito Kid. As earlier mentioned we also get to see scenes from DC from Kaito's view, which are hilariously funny, as he goes from \"mysterious-handsome-gentleman-phantom-thief\" to \"Kuroba-Kaito\".\\n\\n\\n\r\nI really don't want to spoil too much, it's just great, so just give it a shot! If you end up liking MK and MK 1412, you can always watch DC, where Kaito Kid appear every now and then. He also appear in some of the DC movies (which are really good, in my opinion).",
            "date": "2018-05-23T09:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 281245,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6324358.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HeadShadow",
                "username": "HeadShadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=281245"
        },
        {
            "content": "The best was to describe Magic Kaito 1412 is \"simple\", too simple actually. The story surrounds around Kaito who realize his father was a great thief and he decides to become one himself to realize the mystery behind his father death. \r\nKaito Kid is supposedly one of Conan ultimate rivals, one who can challenge the great detective and make a run for it, however watching this show doesn't give any such ideas.\r\nKaito tricks are very simple yet he always win in the easiest way because every other character in the show are so naive. With that in mind this 24 episodic anime feels like acollection of cheap fillers while the only decent episodes are those featuring Conan.\\n\\n\r\nWhen I started watching this show I expected some interesting and genius type of heists but no what I got was a high school kid walking into any museum and stealing stuff in front of a whole police squad.\\n\\n\r\nKaito is a terrible character. He treats his best friend who loves him and makes him dinner every day as a total jerk with crude remark about her chest, how she's ugly and how her father -who welcome him in his house every day- is an idiot.\\n\\n\r\nKaito reminds me a lot of Kirito form SAO, the idiot and self-centered douchebag who gets praised form every other character in the show.\\n\\n\r\nThis anime could have benefited a lot from being even a little more serious with better and more fleshed-out characters, deeper plot, interesting heists and a totally different MC persona.",
            "date": "2016-04-16T12:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 216506,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5274749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Yatyear",
                "username": "Yatyear"
            },
            "url": "https://myanimelist.net/reviews.php?id=216506"
        },
        {
            "content": "“Ladies and Gentleman! I bring you marvelous illusions that make this town sparkle at night.” – Kaito Kid; Magic Kaito 1412\r\nEver since magic has become a trend genre in 21st century – most likely since the release of the Lord of the Rings/Harry Potter franchise - we have seen many films involving the preternatural, yet wonderful power; and many more will come. And consequently, magic found its way into the “world” of anime. But what about illusions? \r\nTo put it plainly, an illusion is a distortion of the human senses; and though they distort reality, they are generally shared by most people. It describes amisinterpretation of a true sensation – unlike hallucination. So no abracadabra: just a trick…\\n\\n\r\nAnd this is what this show – Magic Kaito 1412 – is mainly about: illusions and tricks, but the feelings are magical. It is the job of an illusionist to keep its audience entertained throughout the show. A job which Magic Kaito 1412 does very conscientiously. \\n\\n\r\nThe magic show is a largely episodic series centered on the adventures of the high school student Kaito Kuroba, who shines as a charismatic gentleman thief - who steals rare jewelry and returns it shortly afterwards - to thwart the people responsible for the death of his father: the original Kid, the Phantom Thief. And yet Kaitos father has his own set of background episodes without being actually present throughout the series. In fact, these episodes are essential to the story because it shows what motivates Kaito to become what he is during the present storyline. \\n\\n\r\nFor the most part of the magic show, however, Kaito Kid does what he has to: he keeps his show moving and the audience entertained. He performs most of his heists in such a flashy manner that it rapidly turns into a free magic show – much to the displeasure of the hotheaded inspector Nakamori and the Japanese police. Besides Kaito Kid, inspector Ginzo Nakamori and his daughter Aoko are the most prominent amongst the cast members during the 24-ep. run; the latter is ironically Kaitos friend who he has known since they were kids. \\n\\n\r\nSome of those who might have expected rather cheesy magical battles between the characters might have been disappointed and have even dropped the show. Instead of this, Magic Kaito 1412 features in most episodes a very nice cat-and-mouse game. It might feel repetitive once you are halfway through the show; and yet, since everyone has his own taste and preference, each episode might be either a hit or a miss. And rather than relying on fan service or cliché romance stories, the magic show delivers a very charming comedy and simple storytelling instead. Simple but clever. \\n\\n\r\nThe character design is nicely done throughout the magic show - especially Kaito Kid is clothed quite noticeable; some of the characters noses, however, look rather bizarre at times. It does not ruin the anime in its entirety but it might be distracting. Nevertheless, Ginzo Nakamoris frustrating, but amusing expressions, Akakos rather mysterious beauty and Hakubas sense for style truly fit each characters design. The settings, on the other side, work very well and do not share similarities with the ones that have already been used in previous episodes. And due to the excellent cuts an edits, the magic show becomes even more suspenseful. \\n\\n\r\nA rather decent, yet well balanced and slightly jazzy soundtrack delivers all the emotions it has to. After all, nothing seemed misplaced in the anime where a few dramatic moments are also captured on screen. But mostly, the soundtrack supports Kaitos actions during the magic show and is worth listening on its own. On the other hand, the voice cast deserve praise for their solid performance; thanks to their skillful effort, it helped the characters (and the show) coming to life. \\n\\n\r\nIs this show a hallucination or an illusion? Well, it is obvious, is it not? Kaito Kid is a good host who keeps his audience entertained throughout his magic show. Whether he appears under the moonlight or is walking through the air, his audience will not get bored. Kaito Kid creates the illusion and fools you - while having a gentle smile on his face...\\n\\n\\n\r\nPersonally, I thought the anime was a real thrill to watch. It might have some flaws here and there but they do not ruin the atmosphere the magic show creates from the very beginning. At the end, it is all about illusions. And illusion is nothing more than a misinterpretation of art in its own true nature. \\n\\n\r\n“See you… next illusion.” – Kaito Kid\\n",
            "date": "2015-09-24T06:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 199415,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269669.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MestariYN",
                "username": "MestariYN"
            },
            "url": "https://myanimelist.net/reviews.php?id=199415"
        },
        {
            "content": "Magic Kaito 1412 is one of those animes that you can expect the outcome of each episode yet still enjoy it overall. If you're a fan of phantom thieves, detectives, or the anime Detective Conan, this spin-off series about Kaito Kid will entertain you.\r\nSTORY\r\nThe story is pretty much repeated throughout every episode: Kaito Kid steals the gem, only to find it's not the one he's looking for. It's pretty much the same throughout. Each antagonist that Kaito Kid encounters is unique, and each of them had their own motives. Of course, a few of villains return to the scene from time-to-time. And of course, DetectiveConan makes an appearance every few episodes. Some things are still left a mystery, such as who runs the evil organization that killed Kaito's father. Despite the repetition, the story was pretty good. One last good point is that there weren't a lot of fillers.\\n\\n\r\nART\\n\\n\r\nThe art is in the same style as Detective Conan, and everything and everyone was well-drawn. The animation was good, as well. \\n\\n\r\nSOUND\\n\\n\r\nThe music in the show was nice, and it fit the mood well. The opening songs were really nice, as were the endings. \\n\\n\r\nCHARACTER\\n\\n\r\nOkay, maybe the characters were a bit stereotypical, even predictable, but they were still pretty fun to watch. I didn't see a whole lot of character development, since all of the characters didn't seem to grow much. Each of the characters' personalities were unique yet stereotypical. Kaito is the typical proud, showoff goofball, but as Kaito Kid, he acts like gentleman, still retaining his pride. Inspector Nakamori is the stubborn, kinda stupid cop who's obsessed with catching Kaito Kid, but he gets a little smarter near the end. His daughter Aoko is the annoying girl who's always teasing Kaito. I could go on, but I won't.\\n\\n\r\nENJOYMENT\\n\\n\r\nAs fan of phantom thief animes, I really enjoyed this. It was fun seeing Kaito use his magic tricks to fool the police and steal those gems. However, it was a shame that Kaito never found the Pandora gem.\\n\\n\r\nOVERALL\\n\\n\r\nOverall, this was a really good anime, despite being extremely repetitive and predictable. Again, if you like phantom thieves, detectives, or Detective Conan, you will probably enjoy this anime. :)",
            "date": "2015-10-28T13:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 202164,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4861967.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Invisible_again",
                "username": "Invisible_again"
            },
            "url": "https://myanimelist.net/reviews.php?id=202164"
        },
        {
            "content": "This is my first review on My Anime List, so I hope it's good!\r\n~~\r\nMagic Kaito 1412. A masterpiece anime, one of the first few animes I ever watched, and I finished it in January 2017. I believe it is the second anime I've completed, behind Sword Art Online. I was bored and had nothing else to do, so I was watching SAO, when a family member came up and suggested some new ones for me, those animes including Magic Kaito 1412, Detective Conan, and also Assassination Classroom, if I remember correctly. Out of all three of those recommendations, MK1412 was the one I enjoyed themost. I watched one episode of each other anime, but for MK1412 I watched until about the middle of Episode 3. \\n\r\nI loved this anime. It's plot was simple, and I loved the interesting characters, beautiful music, and stunning art.\\n\\n\\n\r\nStory: \\n\r\nThe story is rather simplistic. Although the plot remains kind of the same for all of the episodes (Kaito goes somewhere, steals the gem, etc.), the charm behind this simple story line is how it's presented. Each way is unique, and I think everyone will always look forward to the different ways that Kaito is going to steal the gem.\\n\\n\r\nArt/Animation: \\n\r\nI personally feel like the art and animation in this show is beautiful! The openings are absolutely stunning, and the actual episodes are as well, one of my favorite epiosdes in terms of art and animation being Episode 21, where Kid teleports. Even if it's extremely short or small moments, there's always something that stands out to me. MK1412 has absolutely amazing art/animation.\\n\\n\r\nSound: \\n\r\nThe music in this anime is absolutely perfect. The opening and ending songs are perfect (Ai no Scenario=perfect opening), and the OST is stunning. I got the OST as a gift one time, and I listen to it whenever I need some good mood music. (My favorite tracks are \"Magical Flight\" and \"You'll see the KID\"). The right music always plays at the right time, making this anime all the more amazing.\\n\\n\r\nCharacters:\\n\r\nKaito is the definition of a perfect anime character. He's got just the right amount of everything that makes a great anime character.  He's got the humor, good story, etc. Aoko is a perfect love interest for him. She's so adorable, and I ship her and Kaito like tomorrow! Personally, I don't like Hakuba that much, but I'm okay with Akako. I personally wish the two of them got more screen time. Personally, I feel this also for the mysterious evil organization, as they only appear in a total of 4-5 episodes out of all 24. But overall, the characters are great! Characters are always a big part of why animes are great!\\n\\n\r\nEnjoyment: 10/10\\n\r\nI mean, who doesn't love magic? Kaito Kid brings it to the next level! Personal favorites for me have always been his seemingly impossible tricks like walking on air and teleportation. There's something for everyone! There's plenty of comedy packed in between Kid's stunning magic tricks, and although not as frequent, there's a good amount of romance to keep you hooked. (Kaito and Aoko are my OTP!) Although at times I felt like some parts of an episode were a little bit slow, I still loved it.\\n\\n\r\nOverall: 10/10\\n\\n\r\nMK1412 was a masterpiece! I highly recommend it to anyone who is brand new to anime. It's a perfect starting point, as it is easy to understand, and it's highly entertaining as well. Everything about it is amazing, and I so hope that a season 2 will be coming soon.",
            "date": "2018-03-06T08:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 273186,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7032310.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dazel1412",
                "username": "Dazel1412"
            },
            "url": "https://myanimelist.net/reviews.php?id=273186"
        },
        {
            "content": "When I was younger, I was a fan of the original whole detective Conan thing but now I am a little put-off by the artwork of the original film. This spin-off from that show is, for me, surprisingly good. Of course, I can still list several things that are just illogical about the anime, but this anime is pretty amazing and nice, something that I really enjoyed watching.\r\nIf you're looking for a lot of romance, cheesy, sappy and all that stuff, it's really not for you. This anime isn't centered on romance if that's what you're looking for. Personally, I rather like the female MCbecause she is more than your normal high school whiny girl. Of course, she's clueless about what's going on and does act occasionally like one, she isn't all clingy on the MC (Being all clingy and cringy is something I really don't want to see in anime...)\\n\\n\r\nBut if you're looking for shounen, action, mystery, and all that, I believe you should consider this anime. It's not really heavy mystery and detective based but it also involves the MC's everyday life and his detailed preparations for his heists. Even though there are some cliche aspects in the anime and predictable moments, there are also some results that might surprise you. \\n",
            "date": "2017-07-21T13:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 253399,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337921.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kadrian",
                "username": "Kadrian"
            },
            "url": "https://myanimelist.net/reviews.php?id=253399"
        },
        {
            "content": "I think for magic lovers can get a different sensation if watching this anime, better see the specials first and the alternative setting  \" Detective Conan \", but if you want to feel the original story, better you watch this anime first.\r\nIn this anime you can feel the romance and comedy sensation from male student who hides his identity from his childhood friend as well as some of his friends in him school who is also an enemy knows his secret.\r\nAt night the student turned into a reliable thief in playing magic, tricks and also run away from the pursuit of the police. Thethief has a nickname named \"Kaito Kid\" which means criminal code number 1412.\\n\\n\r\nI like this anime because the graphics are pretty good and also the plot of story was interesting.\\n\\n\r\nSory for bad reviews and also for bad translation .",
            "date": "2017-05-07T07:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 247132,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5943247.jpg",
                "scores": {
                    "animation": 8,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ginkamaru",
                "username": "Ginkamaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=247132"
        }
    ]
]