[
    [
        {
            "content": "Sequels are always a bit of a problem when it comes to matters of continuity, depth of story, character development, and sometimes even the look and feel of a show. All too often will the viewing public find the first season of a given franchise to be very good, only to be served a huge helping of mediocrity when the sequel comes around.\r\nThere is hope though, as while there are plenty of shows that let the viewer down in this way, there are a growing number that actually manage to equal, if not better, the original series, and one such example is Nodame Cantabile: ParisChapter.\\n\\n\r\nNow as fans of the franchise will already know, the story is about the eccentric (or slightly mad, whichever takes your fancy), and thoroughly otaku musical genius known as Noda Megumi (Nodame is her nickname), and her reluctant, long suffering love interest Chiaki Shinichi. As the title of the series suggests, this time the pair have moved to Paris to continue their studies. Nodame will attend the music conservatory under the tutelage of the reknowned Charles Auclair, while Chiaki will continue to his apprenticeship under the erstwhile maestro Franz von Stresseman.\\n\\n\r\nUnlike the original series, the plot is far less derived in Paris Chapter. The main reason for this is because a good portion of the original was spent setting the scene and introducing the characters, so by the time Paris Chapter came around much of the hard work had already been done. The story is thus able to continue from where it left off at the end of Nodame Cantabile, however the second series is also reliant on firsthand knowledge of the original as there is very little time spent on pointless flashbacks scenes. While there is a degree of scene setting and character introduction, this is handled in an expedient manner that helps to maintain the flow of the plot.\\n\\n\r\nAs far as looks go, Paris Chapter is actually a little better than the original series. While both retain the same atmosphere, the second series has a far more continental look due to the location, which is also reflected in style of clothing. Both Nodame and Chiaki look much the same as they did at the end of the original anime, while the new characters (Tanya, Frank, Yunlong, etc), follow the style of the series to a tee (i.e. highly expressive yet slightly \"cartoony\" features). The animation is a step up from Nodame Cantabile in that the strange CG used during the musical set pieces is actually smoother and more fluid than before. That said, much of the remaining character animation is pretty much what one would expect from the franchise, and many of the visual gags are well timed and choreographed.\\n\\n\r\nOnce again though, the areas where the series really excels are with the sound and music. The voice acting is as good as before (if not better), especially in the roles that continue on from the first series. The newcomers manage to fit in to the cast rather well, and while their performances are loaded with expression, they manage to capture that quirky, eccentric atmosphere that is a hallmark of the franchise.\\n\\n\r\nIn terms of music, Paris Chapter is far more focused on delivering set pieces than the original series, and the difference is palpable. This show literally oozes classical music from every pore, so much so in fact, the variety of tracks on offer in Paris Chapter easily rivals that of the first season.\\n\\n\r\nAs before though, this is very much a character driven show, and while season one managed a good degree of development for both Nodame and Chiaki, Paris Chapter takes it to a whole new level. In addition to this, the show spends a fair amount of time developing the supporting characters in much the same way as the original. The downside though, is that where the first series had 23 episodes to play with, Paris Chapter only has 11. Now one would think that there is no way to provide any meaningful growth to new characters in such a short time, however this is not the case as the nature of series two is to follow directly on from the original. The benefit of this is that both leads only need to build on their development from the first season, so more time can be spent refining the characters and strengthening their presence in the story, as well as focusing more on the supporting cast. Ironically, this is also the main reason why it is essential to have watched the first season beforehand as much of Nodame and Chiaki's characterisation in Paris Chapter is dependent on the viewer knowing their history.\\n\\n\r\nNow it should be fairly obvious that I enjoyed Paris Chapter, and to be honest I found it to be as good as the original series. While the show continues to develop the plot and characters, it also manages to retain the eccentric charm of the original without miring itself in melodrama. The new characters are a boon to the series as they complement the story in some novel ways that may not be obvious at first. One example of this is Frank, a music student and European \"otaku\", who learns firsthand what otaku power is really capable of (thanks to Nodame and an episode of PuriGorota).\\n\\n\r\nWhat I've always liked about the Nodame Cantabile franchise are the lengths the anime goes to in order to stay true to the manga, and Paris Chapter only serves to reinforce this. The plot is literally taken straight from the pages its paper based counterpart, and while there are some differences due to time constraints (amongst other things), anyone who has read the manga should find themselves on very familiar ground.\\n\\n\r\nAs far as sequels go, Nodame Cantabile: Paris Chapter is pretty much everything fans of the original could hope for.",
            "date": "2010-05-24T18:25:00+00:00",
            "helpful_count": 157,
            "mal_id": 26372,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=26372"
        },
        {
            "content": "Story and Character\r\nParis Chapter is a direct sequel to Nodame Cantabile and picks up where the previous anime left off - with Nodame and Chiaki journeying to Paris to continue their musical education. Besides our two main protagonists a whole slew of new secondary characters are introduced.\r\nYou'd have to have a heart of stone not to enjoy the development of the relationship between Nodame and Chiaki. Parts were truly hilarious (episode 5-6), some bits were sad and others were \"aah\" moments that let you reflect on just how much both of them have grown as people. Their music has also evolved throughout this arc.\r\nThat beingsaid, there are several weaknesses in the Paris Chapter. First of all, the series is TOO short to fully tell the story in all its glory. Paris Chapter could have been 24 episodes and still we would have wanted more. Because of the shortened length a lot of stuff felt compressed and there wasn't nearly enough plot, or music (we need MORE music) to satisfy me or most Nodame fans. *sigh*\\n\\n\r\nSecondly, none of the secondary characters (fun though they are) quite GRABS you the way the secondary characters did in the original Nodame Cantabile. For example, there is no comic relief that comes even close to Timpanist Masumi Okuyama - I miss him so much! Also the developing romances between any secondary characters in Paris Chapter pales in comparison to the Mine - Kiyora Miki Violin Romance. As for Rui Son - what a wasted opportunity, another plot thread started that just seemed to fizzle into ???\\n\\n\r\nBasically with a little more running time I believe the plot and character development would have been perfect. It only scores as high as it does because Nodame/Chiaki are a truly brilliant pairing.\\n\\n\r\nArt/Animation\\n\\n\r\nThe art was very much in the style of Nodame Cantabile Season 1 so there is no incongruity. Paris is lovingly depicted - watching this anime brings me back to when I visited Paris, I could see some of the places I had been and it was easily recognizable. The animators got the \"feel\" of Paris close to perfect - I guess nothing can compare with the romance of actually being at the river side at night.\\n\\n\r\nSound\\n\\n\r\nGreat soundtrack and sound effects fitting with the anime - I doubt I'll be the only one wishing for more music. Episode 10 is definately the highlight music showcase wise. OP quite ordinary (disappointing really) but the ED is fantastic, one of the more catchy ones I've heard.\\n\\n\r\nEnjoyment\\n\\n\r\nLoved loved loved it. I laughed, cried and anxiously awaited every new episode. Would have been a masterpiece if it were just a little bit longer, enough to make up for some of the \"hanging\" developments. Still, this did a great job of whetting my appetite for Season 3, I need more Nodame!",
            "date": "2008-12-27T16:41:00+00:00",
            "helpful_count": 39,
            "mal_id": 10695,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stormy_77",
                "username": "Stormy_77"
            },
            "url": "https://myanimelist.net/reviews.php?id=10695"
        },
        {
            "content": "I usually don't expect much out of sequels, but slice-of-life stories seem like they should have an advantage in that department, don't they?\r\nSTORY - This Paris Chapter picks up pretty much right where the first season leaves off. Chiaki is still working to advance towards his goal of being a renowned conductor, and even Nodame seems to have something more concrete in mind for an end result. The general idea of the story is more or less the same, but unfortunately, I think a lot of the charm is lost in the overseas transition -- mostly because their dreams don't seem quite so distant anymore.Chiaki is already fairly well known and well connected; as such, the things that stand between him and what he wants don't seem to be that big a deal anymore. We all know he's capable. This second season gives a little more spotlight to Nodame and her development, but even she seems to have made peace with herself for the most part, so the progression just doesn't seem as interesting.\\n\\n\r\nEpisode-to-episode, since it remains quite slice-of-life, the series is still pretty fun and entertaining, but the depth and relevance of the over-arching plot isn't nearly what it was in the first season. It feels more like a continuation of antics because the story had already matured to its height and there's no where else to go. I suppose that's a little disappointing, but at least it doesn't take away from the original series.\\n\\n\r\nCHARACTER - Like the story, I feel like both Chiaki and Nodame had finished all their significant growth and development in the first season and that there wasn't much else to address in the second season. Despite having become an official couple somewhere along the way, there were only small differences in the way they interacted with each other. It was still ridiculously adorable for sure, and it could be said that we do gain some insight on Chiaki's regard of Nodame and their relationship, but I don't really feel much was explored beyond what we could have already figured out on our own. I suppose slow and gradual progression was part of what made their relationship so appealing in the first place though.\\n\\n\r\nSadly, most of the secondary cast from the first season stays in Japan, and we're greeted with a mostly fresh assortment of support characters in Paris (Kuroki the Oboeist is the only character that reappears). And they aren't nearly as interesting or entertaining as their predecessors. I don't really think there's a specific reason though, honestly; I just had a much harder time caring about them...maybe because they weren't featured as prominently and because none of them really seemed motivated? If they don't care about themselves, then why should I care about them? It also bugged me a little that almost all of them were pianists; variety is good!\\n\\n\r\nARTSTYLE &amp; ANIMATION - At first glance, Paris-hen seems to have gotten a step-up in budget as far as animation goes. Where season one had still frame after still frame for musical performances, season two has none of that whatsoever. Instead, we're met with a lot of computer-generated music-playing that's fitted in rather awkwardly with the cel animation. Every single performance is animated in the Paris Chapter. Violins move! Fingers glide over piano keys! Chiaki's arms actually wave around when he's conducting! It's pretty neat; I was excited to see instruments move, but after a while, you really start to notice how awkward it looks.\\n\\n\r\nThe difference between the CG animation and everything else is too obvious. Chiaki's arms are too stiff. The pianists' fingers are look strange when they move; they're robotic. It isn't terrible, but it's noticeable, and it becomes a little distracting. I think the general character animation took a hit because of it, even in scenes that didn't involve performances. More proportions were off than usual, etc. The animation was never amazing to begin with, so those small things stand out. I'm not really sure whether the still frame panning is better or worse than the awkward CG, but at least they're trying.\\n\\n\r\nMUSIC - You know, for a music anime, Nodame Cantabile Paris Chapter has a pretty terrible opening theme. The animation is uninspired, and the song is just... not good. Thankfully, the ending theme is much cuter, and I really enjoyed the multilingualism of it all. We don't see as much variety in musical selections throughout this season as in the first, but that's probably because it's half the length. Almost all of the performance scenes are also markedly shorter, which may bode well for those that got a little bored before, but I was actually kind of disappointed. Even though most of them had been still pans, it took these shortened pieces to make me realize I did really enjoy all those long performances in the first season. I think there's just something cool about seeing characters perform. It's inspiring. In all though, there really isn't much to complain about. \\n\\n\r\nVOICE ACTING - Tomokazu and Kawasumi are still doing a great job with their leads. Chiaki's noise of disbelief is just priceless every time, as is Nodame's &quot;gyabo!&quot; It really impresses me that they manage to find that perfect middle where she says it just enough times to be endearing, but not enough times to be annoying. The rest of the cast's voice acting was pretty average.\\n\\n\r\nOne thing I really wish they addressed better was the bilingual nature of the story though. Sure, they're Japanese characters and thus speak Japanese, and obviously, a show airing in Japan will be in Japanese, but still. The way the series starts off is actually really neat as far as this goes -- Nodame is learning French through dubbed anime and it's really hilarious. There are captions indicating when conversations are actually taking place in French but are being &quot;dubbed&quot; in Japanese. But after a while, these indications disappear, and I get confused, especially when random sniplets of French get woven in to the spoken Japanese. Especially when French characters speaking in Japanese weave French into their Japanese!\\n\\n\r\nI have to admit that it was pretty fun hearing the Japanese butcher another language besides English though. XD\\n\\n\r\nOVERALL - Nodame Cantabile Paris-hen was enjoyable. It didn't quite live up to the standards set by the first season, but it was far from being a straight-up failure. As I haven't read the manga or seen the drama, I'm not quite sure how all this matches up with the events there, but it is a smooth follow-up to the original anime. The story doesn't move much, but the characters are still fun and their interactions cute. The visual aspects could stand a bit more improvement, but the sound is still pretty damn solid (excepting the opening theme). \\n\\n\r\nI'm pretty excited for the third season, anyway. Slice-of-life could conceivably go on forever, and I know I said that both the story and characters feel like they've matured to some kind of climax... but despite that, I'm still having fun with them. There's always room to grow. Maybe there wasn't much movement in this season, but who knows what the third season could bring? I have faith. For sequels, that's a pretty rare thing.",
            "date": "2008-12-27T11:34:00+00:00",
            "helpful_count": 29,
            "mal_id": 10685,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66273.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kiriska",
                "username": "kiriska"
            },
            "url": "https://myanimelist.net/reviews.php?id=10685"
        },
        {
            "content": "An Introduction \r\nI remember being very hesitant to dip my toes into the josei genre due to a silly chemical called testosterone. This all changed when I watched H&C. Finally, I could watch romantic comedies where moe, fanservice, unrealistic sexual situations, and cliches were absent. By the end of H&C I was thoroughly convinced that I would never find another josei of a similar caliber. This is where Nodame Cantabile comes in. Nodame Cantabile has far exceeded my expectations and has captivated me from episode 1.\r\nI will to the best of my abilities review the Paris Chapter in a way that will hopefully prove helpfulto any interested readers.\\n\\n\r\n Note: Many References to Season 1 will be made. If you haven’t watched it… well why are you watching Paris Chapter? >.>\\n\\n\r\nStory~ N/A  Pacing~ 7.5\\n\r\nThe story takes place right after episode 23 of season 1. As the title of the anime may suggest our two beloved MCs will explore the extravagant land of Paris as they struggle with their musical careers ... and quite honestly there's really nothing more to it than that, its simply a slice of life. I don't believe in judging a slice of life anime on story, especially when we're considering a sequel that has already had a majority of its core development taken care of in the previous season so I will now talk about the pacing.\\n\r\nNow from multiple perspectives the pacing was good and bad. Good in the sense that they fit a surprising amount of character development into a mere 11 episodes and bad in the sense that the season was … well 11 episodes. The runtime does not do the sequel justice and it just does not feel the same as season 1. Characters are very abruptly introduced, months go by within minutes, and so on. It is good to mention that for the little time the producers did have they displayed a very good amount of development between Chiaki and Nodame. In the end the producers did the best they could with what they were given and the short run time is only one of the sequel’s few flaws.\\n\\n\r\nArt~8\\n\r\nThe art is more or less the same as season 1. JC Staff still provides the very warm, plain, simple animations that drew me into the first season. Something great about the art in this season is the difference in setting. The Paris backgrounds look beautiful through the Nodame Cantabile art style. It makes the watcher truly feel that Chiaki and Nodame are far from home, in a distant fairy-tale. The one major difference I saw between the seasons is the usage of CGI animation. Having well rendered CGI animations would have been a huge step up from the still shots of orchestras playing but unfortunately the CGI was very stiff and poorly executed. Rather than enhancing the experience of watching the orchestra perform the CGI made the performers seem very robotic and unnatural and ultimately became a distraction rather than an improvement. Other than the CGI flaw, the art of Paris Chapter stays true to its roots and is well done and strong throughout the whole show.\\n\\n\r\nSound~8.5\\n\r\nNow how did an anime so heavily based on classical music not receive a 10 in sound? Don't get me wrong the pieces chosen for Paris Chapter were beautiful and an absolute joy to listen to but I felt like the time devoted to music paled in comparison to season 1. I kept in mind that this is most likely accountable due to the air time being less than half of season 1. The producers were likely trying to keep the music feel of the show while having enough time for character development. Unfortunately, the lack of devotion to the musical segments do hamper the joy when Chiaki and Nodame perform. Putting aside the fact that the pieces are played for short time segments, Paris Chapter’s choice of classical pieces is still very varied and diverse. Being a complete stranger to classical music, Nodame Cantabile gave me a new appreciation for this genre of music and Paris Chapter did it again.\\n\\n\r\nThe voice acting is still very strong. The trademark “Gyabo!” and “Myuka!”s are well timed and done in a hilarious fashion. Chiaki and Nodame still stay true to their personalities in season 1. A large amount of new supporting characters were introduced but each of their voice actors did a very good job. None of them seemed out of place and the warm, cozy, Nodame Cantabile atmosphere was left undisturbed. All in all, the voice acting was great with the flaws being largely unnoticeable.\\n\\n\r\nNow for the OP. The OP for the whole season is Sky High by The Gospellers. To be frank, I didn’t really care for the OP. The song was average and the animations were a bit boring. I found myself skipping it almost every single time. The ED (Tokyo et Paris by Solita and Emiri Miyamoto) on the other hand was great. A gorgeous violin piece was played with the soft touching voice of Solita. The whole song is in French and so it just adds to the overall Paris feel of the anime. Listening to it after every episode was joy as you saw the credits rolling accompanied by still shots of our beloved characters.\\n\\n\r\nCharacter~9.5\\n\r\nNow THIS is where a slice of life truly shines. Chiaki and Nodame’s relationship take a very sudden change in direction from the first season. Gone are the subtle developments and the ever so slow realization of love that were present in the first season. Chiaki and Nodame’s relationship is no longer one sided and is portrayed in a way that convinces the audience the long 23+ episode wait was more than worth it. Although this change in approach to their relationship is great I felt as if sometimes certain things were rushed and just completely out of no where due to the short air time. Other then that, the romantic scenes in Paris Chapter are well done and numerous. A huge step with Nodame is her increasing independency. She no longer clings to Chiaki as he mercilessly whacks her away. This in turn causes both individuals to become jealous, uncertain, and worried about each other. In other words, finally being an acknowledged couple, we get to see development in ways that could never be addressed in the first season. This only greater strengthens their bonds with each other and the audience.\\n\\n\r\nNow a huge minus to Paris Chapter was the complete disappearance of the supporting cast from the first season. The only characters that were still around were Kuroki and Stresemann although Kuroki was one of the more boring characters while Stresemann appeared very infrequently. This results in most of the screen time for supporting characters being directed at the new cast. In no way is this bad, but like almost everything else in the show, the new supporting cast suffers greatly due to the short air time. No real development really happens with any of them which is completely fine because most of the emphasis is put on Chiaki and Nodame anyways. The new supporting cast does a great job in providing an authentic college atmosphere but don’t get expected to feel attached to any of them.\\n\\n\r\nEnjoyment/Overall~8.5\\n\r\nIn the end, Nodame Cantabile Paris Chapter was a great watch. Although it did pale in comparison to the first season in many fields, it also had its strengths. A relatively short run time causes the anime to suffer as a whole but should not be a reason Nodame Cantabile lovers shouldn’t give it a try. We get to see a new side of Chiaki and Nodame as they explore the musical wonderland called Paris. Each episode was filled to the brim with events, sometimes too much. But it keeps the audience busy and the absence of pointless fillers is always a plus.\\n\r\nAs far as sequels go, Paris Chapter did a great job. Honestly, if there’s 11 more episodes where I get to experience Chiaki and Nodame I’m going to watch it regardless.\\n\\n\r\nThe humour was great.\\n\r\nThe characters were great.\\n\r\nThe romance was great.\\n\r\nA well done sequel to Nodame Cantabile.       Now onto the finale~\\n\\n",
            "date": "2014-01-03T13:56:00+00:00",
            "helpful_count": 28,
            "mal_id": 127023,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3171955.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/DeusAnima",
                "username": "DeusAnima"
            },
            "url": "https://myanimelist.net/reviews.php?id=127023"
        },
        {
            "content": "Note: Will Update every 6 episodes\r\nParis Chapter is a faithful sequel to the original Nodame Cantabile. If you loved the original, then this sequel comes highly recommended. If you haven't see the original, three's not too much sense starting with this. So the review will mostly deal with whether the sequel lives up to the quality of the original.\r\nThe first three episodes were genuinely excellent, filled with the quirky humor, hilarious characters, all mixed with a tinge of emotion... In short, it filled like watching a worthy sequel of the original... almost.\r\nThe one drawback is Paris chapter is that events appear rushed. Where's an importantconcert competition Nodame Cantabile filled an arc of 2-3 episodes, such competitions are covered in a single chapter in Paris Chapter. This results in far less emotional build-up, and makes it difficult to appreciate the significance of these events. This is also reflected by the less spectacular music, given that there is no time to play a piece in full.\\n\\n\r\nAlas, perhaps something like this can't be helped, given that Paris chapter has only 11 episodes, less than half of the original season.\\n\\n\r\nOther than this gripe, most other aspects of Paris chapter are on par to that of the first season. While the water color designs were never my favorite, they do suit the show.  Most the supporting characters in Season are new, save from Chiaki, Nodame, and that lewd German Milch. Fortunately the new characters introduced are just as memorable as the one's that they replaced. The OP theme, however, was a little lacking,\\n\\n\r\nOverall, Paris Chapter is still an excellent show, but one can't help but feel that if the creators could have had 24 episodes to work with rather than 11, it'd would be a lot better.\\n\\n\\n\\n\\n",
            "date": "2008-10-27T04:11:00+00:00",
            "helpful_count": 16,
            "mal_id": 9011,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=9011"
        },
        {
            "content": "(A score of seven which is good in my book, but not enough to warrant a 10 of its predecessor.)\r\nShort: Worth a watch, but is a disappointment. Short length hurts flow and character development. \r\nFull Review\r\nWhen the first season of Nodame Cantabile ended, I was one of the many who had fallen in love with the story and craving for more, migrated to the manga. I was absorbed by the Paris Arc, which took the series into new horizons. So when the second season arrived, I was very excited. \r\nDid it deliver? To the anime only fans yes, but for those who experienced Paris inthe manga, this season was more of a disappointment.\\n\\n\r\n More than anything else, the short length of the season hurt it a lot more than one would think.\\n\\n\\n\r\nStory: Taking place in Europe, the second season focuses on the new hopes and dreams that opened up for Nodame and Chiaki. Chiaki can finally work to achieve his life long dream, and Nodame's love and real motivation for music that had sprouted in the first season starts to grow and grow. \\n\\n\r\nDue to the 11 episode length, many things had been cut, and this makes it a lot more centered on Nodame and Chiaki.\\n\\n\r\nAnime only viewers will still be able to get to see the most important parts and the development of the most important couple. While some might like this, side characters have been majorly hurt by this, and many agree the new friends of Nodame and Chiaki just are not the same. \\n\\n\\n\r\nArt: The art style in the second season keeps the same pastel feeling I have come to love in the first season and the characters resemble the manga more. This is nice, and I am grateful for that. \\n\\n\r\nThere's a lot less still shots and many orchestra scenes have been animated. However, it looks more awkward than it is pleasing. Chiaki and co. seem to look more like robots than people.\\n\\n\r\n First season rarely had this even if they had way less movements. I sometimes wished they just went with the still shots instead.\\n\\n\\n\r\nSound: The OP takes time getting used to, compared to the first season which I instantly loved. The ED on the other hand is excellent and nice to listen to while waiting for the previews. \\n\\n\r\nThe song being in french is a nice touch I say. Music inside is wonderful of course, I just wished I was able to listen to it without feeling like I'm being rushed to the next key scene and the next.\\n\\n\\n\r\nCharacter: They took care as to not butcher Nodame and Chiaki's relationship and handled some of the best scenes very well. However we can't feel the sadness of Nodame if she is separated from Chiaki if he comes back again later in the episode or in the next one. In the manga that time was used to acquaint us to the new characters while Chiaki was out of Nodame's scene. \\n\\n\r\nHowever the anime does not, and as a result they end up paper-thin, only shadows of their Japanese counterparts. They don't feel likable and bland. Mini stories are mentioned in one sentence in the anime, and the artist who allowed for insight into characters' skills was barely introduced. \\n\\n\r\nWhat was hurt the most was the new couple of the series to fill in for the secondary couple of Japan was paced wrongly and changed. What happened slowly and hilariously happened awkwardly that just feels weird.\\n\\n\\n\r\nEnjoyment: Despite how disappointed I was from the series' most butchered arc, it was surprising fun. It didn't have the heart and charm of the first series, but it wasn't horrible. However, everything felt rushed and I could not shake off the feeling of someone grabbing and pulling me to one thing to another. \\n\\n\\n\r\nOverall: Don't get me wrong, it's enjoyable and some people will enjoy it just as much as the first season. However, if you've been exposed to another form of Nodame, there's a bitter taste that can't be washed. It's recommended to watch this season right after the first one so you can keep some of the spirit from the first. It wasn't really the anime's fault but the length that ruined it. \\n\\n\r\nDespite all this though, I have high hopes for the 3rd season. You should still watch this, but I highly recommend the manga afterwards.\\n",
            "date": "2009-01-24T11:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 11802,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22214.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CookieBun",
                "username": "CookieBun"
            },
            "url": "https://myanimelist.net/reviews.php?id=11802"
        },
        {
            "content": "You will need to watch the 1st season of Nodame Cantabile before you watch the Paris chapter. But trust me, it's worth the time.\r\nThis is one of the best anime I have ever watched in terms of fun!\r\nStory (7/10): The story isn't really that amazing, but it is not bad either. A simple music-based comedy which has an initial setting in Japan, but then this season contains the Paris part of the anime. Imo, this is the funniest of the 3 seasons.\r\nArt (9/10): The art is good. \r\nSound (10/10): Well, this is, after all, a musical comedy. So, of course, the music is supposed tobe amazing. Though, I might be a little biased here because I just love Piano music. But apart from that also, the sound effects have been really well timed to bring out the humor of a scene.\\n\\n\r\nCharacter (10/10): The character development which started from the first season was amazing. And not only that, the two protagonists, Chiaki and Nodame are absolutely hilarious. The combination of these two will surely take for a laughter ride.\\n\\n\r\nEnjoyment (10/10): This is the main aspect of this anime. You just can't have any criticism in this part. It will be a wonderful, hilarious, and spontaneous journey through the musical world of Chiaki-senpai and Nodame.\\n\\n\r\nAll in all, a MUST watch!!\\n",
            "date": "2019-02-19T07:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 301991,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5265689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/killerCult",
                "username": "killerCult"
            },
            "url": "https://myanimelist.net/reviews.php?id=301991"
        },
        {
            "content": "Could have been much better, but it is held back by poor directing and ends up being a comparatively subpar sequel to the original brilliant series. Still pretty decent.\r\nSTORY:\r\nOne wonders what could have been with more consistent directing. The story is paced rather slow, and sometimes one gets the impression that this is more a \"Life of Chiaki and Nodame in Paris\" slice-of-life than an actual story about their obstacles and maturing of character. Indeed, it seems that JC Staff couldn't decide whether to make the anime around the plot or just showcase their daily lives.\r\nAnd what was with that ultra-rushed ending?\r\nART:\r\nSimple, clean, flawless, functionaland delightfully faithful to the manga's lively expressions.\\n\r\nThe CG was, on the other hand, absolutely horrible. The orchestra's playing of the instruments looked more like well-carved stick figures with Flash-like animation than a normal hand-drawn animation. They should have stuck with the default of the original series.\\n\\n\r\nSOUND:\\n\r\nThe OP was horrendous.\\n\r\nOther than that, no complaint from this department. The music is significantly better (no doubt due to the improvement of the characters in the story), and would make an excellent OST.....if they'd put it in that.\\n\\n\r\nCHARACTER\\n\r\nWhile Nodame and Chiaki's well-developed personalities carry the show, the dullness with which character development is made is in general disappointing. Whenever characters in the story are supposed to significantly change in attitude and mental strength, it goes limping by such that one hardly realises it at all. Many times I went &quot;Oh wait, why'd they change so much from something that was put across in such a mundane manner?&quot; It was jarring, and once again I blame the directing.\\n\\n\r\nENJOYMENT\\n\r\nIt is an adaptation that's undecided about what genre it wants to be. Happily, I'm a sucker for slice of life, and what scattered pieces they have tried to direct in whichever genre, they've done it quite well. When it wants to be slice-of-life, it does it well.\\n\\n\r\nOVERALL\\n\r\nPoor directing, and a few decisions which turned out to be big mistakes (looking at the CG and the ending's pace), but thankfully it still turns out to be unmistakeably a decent Nodame adaptation.",
            "date": "2008-12-27T11:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 10686,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19199.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrimaH",
                "username": "GrimaH"
            },
            "url": "https://myanimelist.net/reviews.php?id=10686"
        },
        {
            "content": "Story 9/10\r\nMukyaa!\r\nA great series as usual! \r\nBut Paris chapter seems to be concentrating more on Chiaki. Nodame seems to be always schooling. What i really dun understand is that their relationship seems to have skipped a big step. They suddenly became a couple with no focus in it. At least said \"I like you\" to Nodame from Chiaki. That was the part i was really expecting and also a disappointing one too. A lack of romance.\r\nArt 7/10\r\nThe original art from the previous series was really not bad. And i admit that the art was not as oustanding than i think. But what irritated me wasthe 3D scene ONLY at performing scenes on stage changing from the original art to 3D again and again...That's the only disappointment in my opinion.\\n\\n\r\nSound 9/10\\n\r\nSound was great as usual! It suits the characters. And the classical musics, Opening song & Ending songs are awesome.\\n\\n\r\nCharacters 10/10\\n\r\nNothing much to say. It's awesome! I love how the art design suits the character and in their every action. But only Nodame is personality was still a bit weird. As in what i expected was Nodame to be more grown up in her relationship with Chiaki. At least show more expression and obvious action in her relationship. She seems no care than how she does in previous series. (In my opinion.)\\n\\n\r\nEnjoyment 9/10\\n\r\nI enjoyed the series very much. It has more than enough comdey but only lack in romance. I expect more in the next series! >",
            "date": "2011-05-20T08:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 37151,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/395376.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MiuMiu_Alice",
                "username": "MiuMiu_Alice"
            },
            "url": "https://myanimelist.net/reviews.php?id=37151"
        },
        {
            "content": "The anime did a good work on maintaining the main characters. The sequel will give you satisfaction in terms of (romance and dreams) the left off story in the first season. I like how Nodame as the pianist developed. The art and scenery are still classic and simple, the 3D has improved. The extra characters are also interesting and have a proper screen time. The sound fits well the anime, especially the ending song I really like it. The classical music is more about Mozart. In the end, I still enjoyed watching it. For those who watch the first season, I would still recommend itsince if anyone enjoys the first season surely will badly want to know the second season",
            "date": "2016-08-14T18:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 226755,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5578695.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/atKatlin",
                "username": "atKatlin"
            },
            "url": "https://myanimelist.net/reviews.php?id=226755"
        },
        {
            "content": "I don't know how the Nodame Cantabile manga became so popular because there was no way the reader could hear and imagine the sounds and music that were reproduced in the anime. The drama, though featuring real humans, seemed more exaggerated than the anime, and somehow not as realistic in my opinion. The anime, is however, masterfully balanced. With real orchestral music, realistic character development, yet still maintains a light and comedic anime feel. Paris chapter definitely has a lot more to offer than the original TV series, especially in terms of music and development. After all, they are in the real land of classicalmusic.\\n\\n\r\nThis will be a combined review of both Paris and Finale. You just can't separate them.\\n\\n\r\nStory:\\n\\n\r\nI like how the story is sort of divided into two parts. Chiaki's story and Nodame's story. Not like they are separate but both of them are taking very different routes in achieving their goals, and how they affect and maintain their relationship. The anime also zooms in a lot into each person's approach and values about music and life. \\n\\n\r\nLots of musical theory is incorporated, like how each piece of music came about. It helps to appreciate Classical pieces, for musicians and non-musicians alike.\\n\\n\r\nArt:\\n\\n\r\nThe character design is quite plain, but I've grown to like it. It takes away the focus of admiring how the character looks, and causes you to like the character for their character and their music. Of course, I still liked the faces of the characters, but it's only after being in love with their character that they start looking better and better. \\n\\n\r\nThe backgrounds are very beautiful, like impressionist paintings. Throughout the anime, pastel-like colours are used which suits the environments. The feel of Paris and Europe is really captured in the rendered artworks. I loved it.\\n\\n\r\nSound:\\n\\n\r\nThe crux of the anime, and the strongest feature of the anime as well. There are plenty of musical pieces that are used, mostly from Classical and Contemporary period composers. There's quite an emphasis on Ravel's pieces, but generally there's a variety of music that is being played on the anime, both Orchestral and solos of different instruments. The background music is also blended in very well, taking a more subtle role in creating the tempo of the whole show.\\n\\n\r\nThe opening and ending songs (both Paris and Finale) are also quite addictive to listen to. I find them stuck in my head for a while.  \\n\\n\r\nCharacter:\\n\\n\r\nI really like the character casting in Paris/Finale compared to TV. A wide array of nationalities and personalities, but still pretty realistic. The most eccentric still being Nodame. As I watched more, I find myself finding Nodame more and more charismatic, and...normal. Her reactions in her relationship with Chiaki is very real and complex (when she's not fooling around). It shocked me at some points, and I could empathise with Chiaki. There's a lot of development of their relationship and feelings in the anime. It's innocent, but at the same time mature. I think it is really hard to pull it off, especially where most anime will try to end it off in a sexual tone, the romance in Nodame is very pure and engaging. It's more like watching a married couple rather than girlfriend/boyfriend relationship. And the little things they do and how they think of each other in their absence, is very touching. \\n\\n\r\nEnjoyment/Overall:\\n\\n\r\nI had the constant urge to keep watching continuously even when I had work early the next day. That was how engaging it was. Couldn't wait for the next performance, or what happens next. As a person who likes classical music, I also enjoyed the music thoroughly, especially with commentary by Chiaki. The ending was a bit unfinished though, but not so badly done. \\n\\n\r\nExcellent anime. Thinking of placing it somewhere in my top 10. Really inspired by Nodame Cantabile, artistically and spiritually. The spirit of excellence is really apparent in the show and now I just want to cling onto my dreams and not give up. And keep listening to classical music too.\\n\\n",
            "date": "2011-08-27T19:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 42273,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147724.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Relon",
                "username": "Relon"
            },
            "url": "https://myanimelist.net/reviews.php?id=42273"
        },
        {
            "content": "To honest, this season is even better from the previous one. Funnier, more romantic, more about the characters’ life, and of course, more of beautiful music.\r\nNodame Cantabile: Paris Chapter brings us at the home of classical music, Europe. Chiaki can finally ride a plane with the help of Nodame though he still has a trauma. They’re life together in Paris starts with exciting new characters and new problems with regards to music. In this season, the romance between the two finally flourishes. They are finally dating. \r\nWith a new season comes new characters. The arrival of new friends and new associates makes the new seasoneven more amazing. After finally coming to Europe, Chiaki starts his goal to be one of the most amazing conductor like his mentors Viera and Stresseman. Also, here we see how Chiaki finally realizes his feelings for Nodame. Though there are times that he denies it so bad but still can’t help but shows it. Action is louder than words. Nodame on the other hand, struggles in the new environment and new obstacles with music. In the end, she finally realizes what she really wants and not just to have a concerto with Chiaki. Both of them shows their amazing talents but personally I think Nodame is way even better from Chiaki. In fact, even Chiaki admits that sometimes Nodame can be out of his league but as long as he does not lose sight of her then it’s alright. Despite being so arrogant and think of himself so great that Nodame should be the one wanting to see him, Chiaki realizes how much he himself wanted to see Nodame. Despite having so different personalities, Chiaki and Nodame are so good together because they complement each other.\\n\\n\r\nI believe the animation is a little bit greater from the previous one. The music is absolutely wonderful and even better.\\n\\n\r\nI definitely love the series much more. I am so looking forward to the next season.\\n",
            "date": "2012-12-09T07:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 79604,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79604"
        },
        {
            "content": "Chiaki and Nodame arrive in Paris where Chiaki begins his music career and Nodame studies at the Conservatoire music school. The couple continue as normal and make new friends such as the outrageous Russian Tanya, the stressed out Yun and the otaku Frank and meet some old ones as they make, Stresemann and Kuroki their first steps in the real world.\r\nOnce again Chiaki gets carried away with his music and travelling around the world putting his career before Nodame. However, he learns how to deal with a real professional orchestra and the politics involved. Nodame makes some real progress with her music and manages toget her first concert.\\n\\n\r\nTheir romance also faces challenges mainly from the former child prodigy Son Rui who joins the Conservatoire to escape her overbearing mother and the pressure of the music world. Rui develops more than a crush on Chiaki and is determined to get him. \\n\\n\r\nAt last we actually see some romance from Chiaki from Nodame as he finally shows his feelings towards Nodame.\\n\\n\r\nWe also see the first steps of a chalk and cheese romance.\\n\\n\r\nThe music again is outstanding by the Nodame Orchestra and again explained so we can enjoy it.\\n\\n\r\nFor me this is the weakest of the 3 Nodame Contabile series as there is very little subplot and I found it a little slow without much character development. However, it is still a good watch.\\n\\n",
            "date": "2012-06-06T01:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 62769,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=62769"
        },
        {
            "content": "Ok, so in my thoughts, yes this middle part of the series is similar in terms of musical foreshadowing, and uses of characters. This series was particularly enjoyable as it introduces a new cast of characters, while retaining and re-introducing prequel characters (e.g. oboe guy). Sadly, however, the connections character-wise to the prequel were limited, bit was wisely chosen. \r\nI enjoyed again the musical choices and integration of a music into the plot. And of course the romance aspect sent shivers down my spine. All I can say is that, as a guy, this series made me soft. As a musician, this series re-inspired me.As an anime-lover, this series was like a refreshing touch of idealistic reality in a sea of fantasy and sci-fi. Again a great watch.\\n\\n\r\nWatching the PREQUEL is recommended, but not needed.",
            "date": "2012-02-15T12:24:00+00:00",
            "helpful_count": 0,
            "mal_id": 53949,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1117201.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ryantang",
                "username": "ryantang"
            },
            "url": "https://myanimelist.net/reviews.php?id=53949"
        }
    ],
    [
        {
            "content": "Sequels are always a bit of a problem when it comes to matters of continuity, depth of story, character development, and sometimes even the look and feel of a show. All too often will the viewing public find the first season of a given franchise to be very good, only to be served a huge helping of mediocrity when the sequel comes around.\r\nThere is hope though, as while there are plenty of shows that let the viewer down in this way, there are a growing number that actually manage to equal, if not better, the original series, and one such example is Nodame Cantabile: ParisChapter.\\n\\n\r\nNow as fans of the franchise will already know, the story is about the eccentric (or slightly mad, whichever takes your fancy), and thoroughly otaku musical genius known as Noda Megumi (Nodame is her nickname), and her reluctant, long suffering love interest Chiaki Shinichi. As the title of the series suggests, this time the pair have moved to Paris to continue their studies. Nodame will attend the music conservatory under the tutelage of the reknowned Charles Auclair, while Chiaki will continue to his apprenticeship under the erstwhile maestro Franz von Stresseman.\\n\\n\r\nUnlike the original series, the plot is far less derived in Paris Chapter. The main reason for this is because a good portion of the original was spent setting the scene and introducing the characters, so by the time Paris Chapter came around much of the hard work had already been done. The story is thus able to continue from where it left off at the end of Nodame Cantabile, however the second series is also reliant on firsthand knowledge of the original as there is very little time spent on pointless flashbacks scenes. While there is a degree of scene setting and character introduction, this is handled in an expedient manner that helps to maintain the flow of the plot.\\n\\n\r\nAs far as looks go, Paris Chapter is actually a little better than the original series. While both retain the same atmosphere, the second series has a far more continental look due to the location, which is also reflected in style of clothing. Both Nodame and Chiaki look much the same as they did at the end of the original anime, while the new characters (Tanya, Frank, Yunlong, etc), follow the style of the series to a tee (i.e. highly expressive yet slightly \"cartoony\" features). The animation is a step up from Nodame Cantabile in that the strange CG used during the musical set pieces is actually smoother and more fluid than before. That said, much of the remaining character animation is pretty much what one would expect from the franchise, and many of the visual gags are well timed and choreographed.\\n\\n\r\nOnce again though, the areas where the series really excels are with the sound and music. The voice acting is as good as before (if not better), especially in the roles that continue on from the first series. The newcomers manage to fit in to the cast rather well, and while their performances are loaded with expression, they manage to capture that quirky, eccentric atmosphere that is a hallmark of the franchise.\\n\\n\r\nIn terms of music, Paris Chapter is far more focused on delivering set pieces than the original series, and the difference is palpable. This show literally oozes classical music from every pore, so much so in fact, the variety of tracks on offer in Paris Chapter easily rivals that of the first season.\\n\\n\r\nAs before though, this is very much a character driven show, and while season one managed a good degree of development for both Nodame and Chiaki, Paris Chapter takes it to a whole new level. In addition to this, the show spends a fair amount of time developing the supporting characters in much the same way as the original. The downside though, is that where the first series had 23 episodes to play with, Paris Chapter only has 11. Now one would think that there is no way to provide any meaningful growth to new characters in such a short time, however this is not the case as the nature of series two is to follow directly on from the original. The benefit of this is that both leads only need to build on their development from the first season, so more time can be spent refining the characters and strengthening their presence in the story, as well as focusing more on the supporting cast. Ironically, this is also the main reason why it is essential to have watched the first season beforehand as much of Nodame and Chiaki's characterisation in Paris Chapter is dependent on the viewer knowing their history.\\n\\n\r\nNow it should be fairly obvious that I enjoyed Paris Chapter, and to be honest I found it to be as good as the original series. While the show continues to develop the plot and characters, it also manages to retain the eccentric charm of the original without miring itself in melodrama. The new characters are a boon to the series as they complement the story in some novel ways that may not be obvious at first. One example of this is Frank, a music student and European \"otaku\", who learns firsthand what otaku power is really capable of (thanks to Nodame and an episode of PuriGorota).\\n\\n\r\nWhat I've always liked about the Nodame Cantabile franchise are the lengths the anime goes to in order to stay true to the manga, and Paris Chapter only serves to reinforce this. The plot is literally taken straight from the pages its paper based counterpart, and while there are some differences due to time constraints (amongst other things), anyone who has read the manga should find themselves on very familiar ground.\\n\\n\r\nAs far as sequels go, Nodame Cantabile: Paris Chapter is pretty much everything fans of the original could hope for.",
            "date": "2010-05-24T18:25:00+00:00",
            "helpful_count": 157,
            "mal_id": 26372,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=26372"
        },
        {
            "content": "Story and Character\r\nParis Chapter is a direct sequel to Nodame Cantabile and picks up where the previous anime left off - with Nodame and Chiaki journeying to Paris to continue their musical education. Besides our two main protagonists a whole slew of new secondary characters are introduced.\r\nYou'd have to have a heart of stone not to enjoy the development of the relationship between Nodame and Chiaki. Parts were truly hilarious (episode 5-6), some bits were sad and others were \"aah\" moments that let you reflect on just how much both of them have grown as people. Their music has also evolved throughout this arc.\r\nThat beingsaid, there are several weaknesses in the Paris Chapter. First of all, the series is TOO short to fully tell the story in all its glory. Paris Chapter could have been 24 episodes and still we would have wanted more. Because of the shortened length a lot of stuff felt compressed and there wasn't nearly enough plot, or music (we need MORE music) to satisfy me or most Nodame fans. *sigh*\\n\\n\r\nSecondly, none of the secondary characters (fun though they are) quite GRABS you the way the secondary characters did in the original Nodame Cantabile. For example, there is no comic relief that comes even close to Timpanist Masumi Okuyama - I miss him so much! Also the developing romances between any secondary characters in Paris Chapter pales in comparison to the Mine - Kiyora Miki Violin Romance. As for Rui Son - what a wasted opportunity, another plot thread started that just seemed to fizzle into ???\\n\\n\r\nBasically with a little more running time I believe the plot and character development would have been perfect. It only scores as high as it does because Nodame/Chiaki are a truly brilliant pairing.\\n\\n\r\nArt/Animation\\n\\n\r\nThe art was very much in the style of Nodame Cantabile Season 1 so there is no incongruity. Paris is lovingly depicted - watching this anime brings me back to when I visited Paris, I could see some of the places I had been and it was easily recognizable. The animators got the \"feel\" of Paris close to perfect - I guess nothing can compare with the romance of actually being at the river side at night.\\n\\n\r\nSound\\n\\n\r\nGreat soundtrack and sound effects fitting with the anime - I doubt I'll be the only one wishing for more music. Episode 10 is definately the highlight music showcase wise. OP quite ordinary (disappointing really) but the ED is fantastic, one of the more catchy ones I've heard.\\n\\n\r\nEnjoyment\\n\\n\r\nLoved loved loved it. I laughed, cried and anxiously awaited every new episode. Would have been a masterpiece if it were just a little bit longer, enough to make up for some of the \"hanging\" developments. Still, this did a great job of whetting my appetite for Season 3, I need more Nodame!",
            "date": "2008-12-27T16:41:00+00:00",
            "helpful_count": 39,
            "mal_id": 10695,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stormy_77",
                "username": "Stormy_77"
            },
            "url": "https://myanimelist.net/reviews.php?id=10695"
        },
        {
            "content": "I usually don't expect much out of sequels, but slice-of-life stories seem like they should have an advantage in that department, don't they?\r\nSTORY - This Paris Chapter picks up pretty much right where the first season leaves off. Chiaki is still working to advance towards his goal of being a renowned conductor, and even Nodame seems to have something more concrete in mind for an end result. The general idea of the story is more or less the same, but unfortunately, I think a lot of the charm is lost in the overseas transition -- mostly because their dreams don't seem quite so distant anymore.Chiaki is already fairly well known and well connected; as such, the things that stand between him and what he wants don't seem to be that big a deal anymore. We all know he's capable. This second season gives a little more spotlight to Nodame and her development, but even she seems to have made peace with herself for the most part, so the progression just doesn't seem as interesting.\\n\\n\r\nEpisode-to-episode, since it remains quite slice-of-life, the series is still pretty fun and entertaining, but the depth and relevance of the over-arching plot isn't nearly what it was in the first season. It feels more like a continuation of antics because the story had already matured to its height and there's no where else to go. I suppose that's a little disappointing, but at least it doesn't take away from the original series.\\n\\n\r\nCHARACTER - Like the story, I feel like both Chiaki and Nodame had finished all their significant growth and development in the first season and that there wasn't much else to address in the second season. Despite having become an official couple somewhere along the way, there were only small differences in the way they interacted with each other. It was still ridiculously adorable for sure, and it could be said that we do gain some insight on Chiaki's regard of Nodame and their relationship, but I don't really feel much was explored beyond what we could have already figured out on our own. I suppose slow and gradual progression was part of what made their relationship so appealing in the first place though.\\n\\n\r\nSadly, most of the secondary cast from the first season stays in Japan, and we're greeted with a mostly fresh assortment of support characters in Paris (Kuroki the Oboeist is the only character that reappears). And they aren't nearly as interesting or entertaining as their predecessors. I don't really think there's a specific reason though, honestly; I just had a much harder time caring about them...maybe because they weren't featured as prominently and because none of them really seemed motivated? If they don't care about themselves, then why should I care about them? It also bugged me a little that almost all of them were pianists; variety is good!\\n\\n\r\nARTSTYLE &amp; ANIMATION - At first glance, Paris-hen seems to have gotten a step-up in budget as far as animation goes. Where season one had still frame after still frame for musical performances, season two has none of that whatsoever. Instead, we're met with a lot of computer-generated music-playing that's fitted in rather awkwardly with the cel animation. Every single performance is animated in the Paris Chapter. Violins move! Fingers glide over piano keys! Chiaki's arms actually wave around when he's conducting! It's pretty neat; I was excited to see instruments move, but after a while, you really start to notice how awkward it looks.\\n\\n\r\nThe difference between the CG animation and everything else is too obvious. Chiaki's arms are too stiff. The pianists' fingers are look strange when they move; they're robotic. It isn't terrible, but it's noticeable, and it becomes a little distracting. I think the general character animation took a hit because of it, even in scenes that didn't involve performances. More proportions were off than usual, etc. The animation was never amazing to begin with, so those small things stand out. I'm not really sure whether the still frame panning is better or worse than the awkward CG, but at least they're trying.\\n\\n\r\nMUSIC - You know, for a music anime, Nodame Cantabile Paris Chapter has a pretty terrible opening theme. The animation is uninspired, and the song is just... not good. Thankfully, the ending theme is much cuter, and I really enjoyed the multilingualism of it all. We don't see as much variety in musical selections throughout this season as in the first, but that's probably because it's half the length. Almost all of the performance scenes are also markedly shorter, which may bode well for those that got a little bored before, but I was actually kind of disappointed. Even though most of them had been still pans, it took these shortened pieces to make me realize I did really enjoy all those long performances in the first season. I think there's just something cool about seeing characters perform. It's inspiring. In all though, there really isn't much to complain about. \\n\\n\r\nVOICE ACTING - Tomokazu and Kawasumi are still doing a great job with their leads. Chiaki's noise of disbelief is just priceless every time, as is Nodame's &quot;gyabo!&quot; It really impresses me that they manage to find that perfect middle where she says it just enough times to be endearing, but not enough times to be annoying. The rest of the cast's voice acting was pretty average.\\n\\n\r\nOne thing I really wish they addressed better was the bilingual nature of the story though. Sure, they're Japanese characters and thus speak Japanese, and obviously, a show airing in Japan will be in Japanese, but still. The way the series starts off is actually really neat as far as this goes -- Nodame is learning French through dubbed anime and it's really hilarious. There are captions indicating when conversations are actually taking place in French but are being &quot;dubbed&quot; in Japanese. But after a while, these indications disappear, and I get confused, especially when random sniplets of French get woven in to the spoken Japanese. Especially when French characters speaking in Japanese weave French into their Japanese!\\n\\n\r\nI have to admit that it was pretty fun hearing the Japanese butcher another language besides English though. XD\\n\\n\r\nOVERALL - Nodame Cantabile Paris-hen was enjoyable. It didn't quite live up to the standards set by the first season, but it was far from being a straight-up failure. As I haven't read the manga or seen the drama, I'm not quite sure how all this matches up with the events there, but it is a smooth follow-up to the original anime. The story doesn't move much, but the characters are still fun and their interactions cute. The visual aspects could stand a bit more improvement, but the sound is still pretty damn solid (excepting the opening theme). \\n\\n\r\nI'm pretty excited for the third season, anyway. Slice-of-life could conceivably go on forever, and I know I said that both the story and characters feel like they've matured to some kind of climax... but despite that, I'm still having fun with them. There's always room to grow. Maybe there wasn't much movement in this season, but who knows what the third season could bring? I have faith. For sequels, that's a pretty rare thing.",
            "date": "2008-12-27T11:34:00+00:00",
            "helpful_count": 29,
            "mal_id": 10685,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66273.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kiriska",
                "username": "kiriska"
            },
            "url": "https://myanimelist.net/reviews.php?id=10685"
        },
        {
            "content": "An Introduction \r\nI remember being very hesitant to dip my toes into the josei genre due to a silly chemical called testosterone. This all changed when I watched H&C. Finally, I could watch romantic comedies where moe, fanservice, unrealistic sexual situations, and cliches were absent. By the end of H&C I was thoroughly convinced that I would never find another josei of a similar caliber. This is where Nodame Cantabile comes in. Nodame Cantabile has far exceeded my expectations and has captivated me from episode 1.\r\nI will to the best of my abilities review the Paris Chapter in a way that will hopefully prove helpfulto any interested readers.\\n\\n\r\n Note: Many References to Season 1 will be made. If you haven’t watched it… well why are you watching Paris Chapter? >.>\\n\\n\r\nStory~ N/A  Pacing~ 7.5\\n\r\nThe story takes place right after episode 23 of season 1. As the title of the anime may suggest our two beloved MCs will explore the extravagant land of Paris as they struggle with their musical careers ... and quite honestly there's really nothing more to it than that, its simply a slice of life. I don't believe in judging a slice of life anime on story, especially when we're considering a sequel that has already had a majority of its core development taken care of in the previous season so I will now talk about the pacing.\\n\r\nNow from multiple perspectives the pacing was good and bad. Good in the sense that they fit a surprising amount of character development into a mere 11 episodes and bad in the sense that the season was … well 11 episodes. The runtime does not do the sequel justice and it just does not feel the same as season 1. Characters are very abruptly introduced, months go by within minutes, and so on. It is good to mention that for the little time the producers did have they displayed a very good amount of development between Chiaki and Nodame. In the end the producers did the best they could with what they were given and the short run time is only one of the sequel’s few flaws.\\n\\n\r\nArt~8\\n\r\nThe art is more or less the same as season 1. JC Staff still provides the very warm, plain, simple animations that drew me into the first season. Something great about the art in this season is the difference in setting. The Paris backgrounds look beautiful through the Nodame Cantabile art style. It makes the watcher truly feel that Chiaki and Nodame are far from home, in a distant fairy-tale. The one major difference I saw between the seasons is the usage of CGI animation. Having well rendered CGI animations would have been a huge step up from the still shots of orchestras playing but unfortunately the CGI was very stiff and poorly executed. Rather than enhancing the experience of watching the orchestra perform the CGI made the performers seem very robotic and unnatural and ultimately became a distraction rather than an improvement. Other than the CGI flaw, the art of Paris Chapter stays true to its roots and is well done and strong throughout the whole show.\\n\\n\r\nSound~8.5\\n\r\nNow how did an anime so heavily based on classical music not receive a 10 in sound? Don't get me wrong the pieces chosen for Paris Chapter were beautiful and an absolute joy to listen to but I felt like the time devoted to music paled in comparison to season 1. I kept in mind that this is most likely accountable due to the air time being less than half of season 1. The producers were likely trying to keep the music feel of the show while having enough time for character development. Unfortunately, the lack of devotion to the musical segments do hamper the joy when Chiaki and Nodame perform. Putting aside the fact that the pieces are played for short time segments, Paris Chapter’s choice of classical pieces is still very varied and diverse. Being a complete stranger to classical music, Nodame Cantabile gave me a new appreciation for this genre of music and Paris Chapter did it again.\\n\\n\r\nThe voice acting is still very strong. The trademark “Gyabo!” and “Myuka!”s are well timed and done in a hilarious fashion. Chiaki and Nodame still stay true to their personalities in season 1. A large amount of new supporting characters were introduced but each of their voice actors did a very good job. None of them seemed out of place and the warm, cozy, Nodame Cantabile atmosphere was left undisturbed. All in all, the voice acting was great with the flaws being largely unnoticeable.\\n\\n\r\nNow for the OP. The OP for the whole season is Sky High by The Gospellers. To be frank, I didn’t really care for the OP. The song was average and the animations were a bit boring. I found myself skipping it almost every single time. The ED (Tokyo et Paris by Solita and Emiri Miyamoto) on the other hand was great. A gorgeous violin piece was played with the soft touching voice of Solita. The whole song is in French and so it just adds to the overall Paris feel of the anime. Listening to it after every episode was joy as you saw the credits rolling accompanied by still shots of our beloved characters.\\n\\n\r\nCharacter~9.5\\n\r\nNow THIS is where a slice of life truly shines. Chiaki and Nodame’s relationship take a very sudden change in direction from the first season. Gone are the subtle developments and the ever so slow realization of love that were present in the first season. Chiaki and Nodame’s relationship is no longer one sided and is portrayed in a way that convinces the audience the long 23+ episode wait was more than worth it. Although this change in approach to their relationship is great I felt as if sometimes certain things were rushed and just completely out of no where due to the short air time. Other then that, the romantic scenes in Paris Chapter are well done and numerous. A huge step with Nodame is her increasing independency. She no longer clings to Chiaki as he mercilessly whacks her away. This in turn causes both individuals to become jealous, uncertain, and worried about each other. In other words, finally being an acknowledged couple, we get to see development in ways that could never be addressed in the first season. This only greater strengthens their bonds with each other and the audience.\\n\\n\r\nNow a huge minus to Paris Chapter was the complete disappearance of the supporting cast from the first season. The only characters that were still around were Kuroki and Stresemann although Kuroki was one of the more boring characters while Stresemann appeared very infrequently. This results in most of the screen time for supporting characters being directed at the new cast. In no way is this bad, but like almost everything else in the show, the new supporting cast suffers greatly due to the short air time. No real development really happens with any of them which is completely fine because most of the emphasis is put on Chiaki and Nodame anyways. The new supporting cast does a great job in providing an authentic college atmosphere but don’t get expected to feel attached to any of them.\\n\\n\r\nEnjoyment/Overall~8.5\\n\r\nIn the end, Nodame Cantabile Paris Chapter was a great watch. Although it did pale in comparison to the first season in many fields, it also had its strengths. A relatively short run time causes the anime to suffer as a whole but should not be a reason Nodame Cantabile lovers shouldn’t give it a try. We get to see a new side of Chiaki and Nodame as they explore the musical wonderland called Paris. Each episode was filled to the brim with events, sometimes too much. But it keeps the audience busy and the absence of pointless fillers is always a plus.\\n\r\nAs far as sequels go, Paris Chapter did a great job. Honestly, if there’s 11 more episodes where I get to experience Chiaki and Nodame I’m going to watch it regardless.\\n\\n\r\nThe humour was great.\\n\r\nThe characters were great.\\n\r\nThe romance was great.\\n\r\nA well done sequel to Nodame Cantabile.       Now onto the finale~\\n\\n",
            "date": "2014-01-03T13:56:00+00:00",
            "helpful_count": 28,
            "mal_id": 127023,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3171955.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/DeusAnima",
                "username": "DeusAnima"
            },
            "url": "https://myanimelist.net/reviews.php?id=127023"
        },
        {
            "content": "Note: Will Update every 6 episodes\r\nParis Chapter is a faithful sequel to the original Nodame Cantabile. If you loved the original, then this sequel comes highly recommended. If you haven't see the original, three's not too much sense starting with this. So the review will mostly deal with whether the sequel lives up to the quality of the original.\r\nThe first three episodes were genuinely excellent, filled with the quirky humor, hilarious characters, all mixed with a tinge of emotion... In short, it filled like watching a worthy sequel of the original... almost.\r\nThe one drawback is Paris chapter is that events appear rushed. Where's an importantconcert competition Nodame Cantabile filled an arc of 2-3 episodes, such competitions are covered in a single chapter in Paris Chapter. This results in far less emotional build-up, and makes it difficult to appreciate the significance of these events. This is also reflected by the less spectacular music, given that there is no time to play a piece in full.\\n\\n\r\nAlas, perhaps something like this can't be helped, given that Paris chapter has only 11 episodes, less than half of the original season.\\n\\n\r\nOther than this gripe, most other aspects of Paris chapter are on par to that of the first season. While the water color designs were never my favorite, they do suit the show.  Most the supporting characters in Season are new, save from Chiaki, Nodame, and that lewd German Milch. Fortunately the new characters introduced are just as memorable as the one's that they replaced. The OP theme, however, was a little lacking,\\n\\n\r\nOverall, Paris Chapter is still an excellent show, but one can't help but feel that if the creators could have had 24 episodes to work with rather than 11, it'd would be a lot better.\\n\\n\\n\\n\\n",
            "date": "2008-10-27T04:11:00+00:00",
            "helpful_count": 16,
            "mal_id": 9011,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/101649.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ceptryn",
                "username": "Ceptryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=9011"
        },
        {
            "content": "(A score of seven which is good in my book, but not enough to warrant a 10 of its predecessor.)\r\nShort: Worth a watch, but is a disappointment. Short length hurts flow and character development. \r\nFull Review\r\nWhen the first season of Nodame Cantabile ended, I was one of the many who had fallen in love with the story and craving for more, migrated to the manga. I was absorbed by the Paris Arc, which took the series into new horizons. So when the second season arrived, I was very excited. \r\nDid it deliver? To the anime only fans yes, but for those who experienced Paris inthe manga, this season was more of a disappointment.\\n\\n\r\n More than anything else, the short length of the season hurt it a lot more than one would think.\\n\\n\\n\r\nStory: Taking place in Europe, the second season focuses on the new hopes and dreams that opened up for Nodame and Chiaki. Chiaki can finally work to achieve his life long dream, and Nodame's love and real motivation for music that had sprouted in the first season starts to grow and grow. \\n\\n\r\nDue to the 11 episode length, many things had been cut, and this makes it a lot more centered on Nodame and Chiaki.\\n\\n\r\nAnime only viewers will still be able to get to see the most important parts and the development of the most important couple. While some might like this, side characters have been majorly hurt by this, and many agree the new friends of Nodame and Chiaki just are not the same. \\n\\n\\n\r\nArt: The art style in the second season keeps the same pastel feeling I have come to love in the first season and the characters resemble the manga more. This is nice, and I am grateful for that. \\n\\n\r\nThere's a lot less still shots and many orchestra scenes have been animated. However, it looks more awkward than it is pleasing. Chiaki and co. seem to look more like robots than people.\\n\\n\r\n First season rarely had this even if they had way less movements. I sometimes wished they just went with the still shots instead.\\n\\n\\n\r\nSound: The OP takes time getting used to, compared to the first season which I instantly loved. The ED on the other hand is excellent and nice to listen to while waiting for the previews. \\n\\n\r\nThe song being in french is a nice touch I say. Music inside is wonderful of course, I just wished I was able to listen to it without feeling like I'm being rushed to the next key scene and the next.\\n\\n\\n\r\nCharacter: They took care as to not butcher Nodame and Chiaki's relationship and handled some of the best scenes very well. However we can't feel the sadness of Nodame if she is separated from Chiaki if he comes back again later in the episode or in the next one. In the manga that time was used to acquaint us to the new characters while Chiaki was out of Nodame's scene. \\n\\n\r\nHowever the anime does not, and as a result they end up paper-thin, only shadows of their Japanese counterparts. They don't feel likable and bland. Mini stories are mentioned in one sentence in the anime, and the artist who allowed for insight into characters' skills was barely introduced. \\n\\n\r\nWhat was hurt the most was the new couple of the series to fill in for the secondary couple of Japan was paced wrongly and changed. What happened slowly and hilariously happened awkwardly that just feels weird.\\n\\n\\n\r\nEnjoyment: Despite how disappointed I was from the series' most butchered arc, it was surprising fun. It didn't have the heart and charm of the first series, but it wasn't horrible. However, everything felt rushed and I could not shake off the feeling of someone grabbing and pulling me to one thing to another. \\n\\n\\n\r\nOverall: Don't get me wrong, it's enjoyable and some people will enjoy it just as much as the first season. However, if you've been exposed to another form of Nodame, there's a bitter taste that can't be washed. It's recommended to watch this season right after the first one so you can keep some of the spirit from the first. It wasn't really the anime's fault but the length that ruined it. \\n\\n\r\nDespite all this though, I have high hopes for the 3rd season. You should still watch this, but I highly recommend the manga afterwards.\\n",
            "date": "2009-01-24T11:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 11802,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22214.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CookieBun",
                "username": "CookieBun"
            },
            "url": "https://myanimelist.net/reviews.php?id=11802"
        },
        {
            "content": "You will need to watch the 1st season of Nodame Cantabile before you watch the Paris chapter. But trust me, it's worth the time.\r\nThis is one of the best anime I have ever watched in terms of fun!\r\nStory (7/10): The story isn't really that amazing, but it is not bad either. A simple music-based comedy which has an initial setting in Japan, but then this season contains the Paris part of the anime. Imo, this is the funniest of the 3 seasons.\r\nArt (9/10): The art is good. \r\nSound (10/10): Well, this is, after all, a musical comedy. So, of course, the music is supposed tobe amazing. Though, I might be a little biased here because I just love Piano music. But apart from that also, the sound effects have been really well timed to bring out the humor of a scene.\\n\\n\r\nCharacter (10/10): The character development which started from the first season was amazing. And not only that, the two protagonists, Chiaki and Nodame are absolutely hilarious. The combination of these two will surely take for a laughter ride.\\n\\n\r\nEnjoyment (10/10): This is the main aspect of this anime. You just can't have any criticism in this part. It will be a wonderful, hilarious, and spontaneous journey through the musical world of Chiaki-senpai and Nodame.\\n\\n\r\nAll in all, a MUST watch!!\\n",
            "date": "2019-02-19T07:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 301991,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5265689.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/killerCult",
                "username": "killerCult"
            },
            "url": "https://myanimelist.net/reviews.php?id=301991"
        },
        {
            "content": "Could have been much better, but it is held back by poor directing and ends up being a comparatively subpar sequel to the original brilliant series. Still pretty decent.\r\nSTORY:\r\nOne wonders what could have been with more consistent directing. The story is paced rather slow, and sometimes one gets the impression that this is more a \"Life of Chiaki and Nodame in Paris\" slice-of-life than an actual story about their obstacles and maturing of character. Indeed, it seems that JC Staff couldn't decide whether to make the anime around the plot or just showcase their daily lives.\r\nAnd what was with that ultra-rushed ending?\r\nART:\r\nSimple, clean, flawless, functionaland delightfully faithful to the manga's lively expressions.\\n\r\nThe CG was, on the other hand, absolutely horrible. The orchestra's playing of the instruments looked more like well-carved stick figures with Flash-like animation than a normal hand-drawn animation. They should have stuck with the default of the original series.\\n\\n\r\nSOUND:\\n\r\nThe OP was horrendous.\\n\r\nOther than that, no complaint from this department. The music is significantly better (no doubt due to the improvement of the characters in the story), and would make an excellent OST.....if they'd put it in that.\\n\\n\r\nCHARACTER\\n\r\nWhile Nodame and Chiaki's well-developed personalities carry the show, the dullness with which character development is made is in general disappointing. Whenever characters in the story are supposed to significantly change in attitude and mental strength, it goes limping by such that one hardly realises it at all. Many times I went &quot;Oh wait, why'd they change so much from something that was put across in such a mundane manner?&quot; It was jarring, and once again I blame the directing.\\n\\n\r\nENJOYMENT\\n\r\nIt is an adaptation that's undecided about what genre it wants to be. Happily, I'm a sucker for slice of life, and what scattered pieces they have tried to direct in whichever genre, they've done it quite well. When it wants to be slice-of-life, it does it well.\\n\\n\r\nOVERALL\\n\r\nPoor directing, and a few decisions which turned out to be big mistakes (looking at the CG and the ending's pace), but thankfully it still turns out to be unmistakeably a decent Nodame adaptation.",
            "date": "2008-12-27T11:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 10686,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19199.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrimaH",
                "username": "GrimaH"
            },
            "url": "https://myanimelist.net/reviews.php?id=10686"
        },
        {
            "content": "Story 9/10\r\nMukyaa!\r\nA great series as usual! \r\nBut Paris chapter seems to be concentrating more on Chiaki. Nodame seems to be always schooling. What i really dun understand is that their relationship seems to have skipped a big step. They suddenly became a couple with no focus in it. At least said \"I like you\" to Nodame from Chiaki. That was the part i was really expecting and also a disappointing one too. A lack of romance.\r\nArt 7/10\r\nThe original art from the previous series was really not bad. And i admit that the art was not as oustanding than i think. But what irritated me wasthe 3D scene ONLY at performing scenes on stage changing from the original art to 3D again and again...That's the only disappointment in my opinion.\\n\\n\r\nSound 9/10\\n\r\nSound was great as usual! It suits the characters. And the classical musics, Opening song & Ending songs are awesome.\\n\\n\r\nCharacters 10/10\\n\r\nNothing much to say. It's awesome! I love how the art design suits the character and in their every action. But only Nodame is personality was still a bit weird. As in what i expected was Nodame to be more grown up in her relationship with Chiaki. At least show more expression and obvious action in her relationship. She seems no care than how she does in previous series. (In my opinion.)\\n\\n\r\nEnjoyment 9/10\\n\r\nI enjoyed the series very much. It has more than enough comdey but only lack in romance. I expect more in the next series! >",
            "date": "2011-05-20T08:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 37151,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/395376.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MiuMiu_Alice",
                "username": "MiuMiu_Alice"
            },
            "url": "https://myanimelist.net/reviews.php?id=37151"
        },
        {
            "content": "The anime did a good work on maintaining the main characters. The sequel will give you satisfaction in terms of (romance and dreams) the left off story in the first season. I like how Nodame as the pianist developed. The art and scenery are still classic and simple, the 3D has improved. The extra characters are also interesting and have a proper screen time. The sound fits well the anime, especially the ending song I really like it. The classical music is more about Mozart. In the end, I still enjoyed watching it. For those who watch the first season, I would still recommend itsince if anyone enjoys the first season surely will badly want to know the second season",
            "date": "2016-08-14T18:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 226755,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5578695.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/atKatlin",
                "username": "atKatlin"
            },
            "url": "https://myanimelist.net/reviews.php?id=226755"
        },
        {
            "content": "I don't know how the Nodame Cantabile manga became so popular because there was no way the reader could hear and imagine the sounds and music that were reproduced in the anime. The drama, though featuring real humans, seemed more exaggerated than the anime, and somehow not as realistic in my opinion. The anime, is however, masterfully balanced. With real orchestral music, realistic character development, yet still maintains a light and comedic anime feel. Paris chapter definitely has a lot more to offer than the original TV series, especially in terms of music and development. After all, they are in the real land of classicalmusic.\\n\\n\r\nThis will be a combined review of both Paris and Finale. You just can't separate them.\\n\\n\r\nStory:\\n\\n\r\nI like how the story is sort of divided into two parts. Chiaki's story and Nodame's story. Not like they are separate but both of them are taking very different routes in achieving their goals, and how they affect and maintain their relationship. The anime also zooms in a lot into each person's approach and values about music and life. \\n\\n\r\nLots of musical theory is incorporated, like how each piece of music came about. It helps to appreciate Classical pieces, for musicians and non-musicians alike.\\n\\n\r\nArt:\\n\\n\r\nThe character design is quite plain, but I've grown to like it. It takes away the focus of admiring how the character looks, and causes you to like the character for their character and their music. Of course, I still liked the faces of the characters, but it's only after being in love with their character that they start looking better and better. \\n\\n\r\nThe backgrounds are very beautiful, like impressionist paintings. Throughout the anime, pastel-like colours are used which suits the environments. The feel of Paris and Europe is really captured in the rendered artworks. I loved it.\\n\\n\r\nSound:\\n\\n\r\nThe crux of the anime, and the strongest feature of the anime as well. There are plenty of musical pieces that are used, mostly from Classical and Contemporary period composers. There's quite an emphasis on Ravel's pieces, but generally there's a variety of music that is being played on the anime, both Orchestral and solos of different instruments. The background music is also blended in very well, taking a more subtle role in creating the tempo of the whole show.\\n\\n\r\nThe opening and ending songs (both Paris and Finale) are also quite addictive to listen to. I find them stuck in my head for a while.  \\n\\n\r\nCharacter:\\n\\n\r\nI really like the character casting in Paris/Finale compared to TV. A wide array of nationalities and personalities, but still pretty realistic. The most eccentric still being Nodame. As I watched more, I find myself finding Nodame more and more charismatic, and...normal. Her reactions in her relationship with Chiaki is very real and complex (when she's not fooling around). It shocked me at some points, and I could empathise with Chiaki. There's a lot of development of their relationship and feelings in the anime. It's innocent, but at the same time mature. I think it is really hard to pull it off, especially where most anime will try to end it off in a sexual tone, the romance in Nodame is very pure and engaging. It's more like watching a married couple rather than girlfriend/boyfriend relationship. And the little things they do and how they think of each other in their absence, is very touching. \\n\\n\r\nEnjoyment/Overall:\\n\\n\r\nI had the constant urge to keep watching continuously even when I had work early the next day. That was how engaging it was. Couldn't wait for the next performance, or what happens next. As a person who likes classical music, I also enjoyed the music thoroughly, especially with commentary by Chiaki. The ending was a bit unfinished though, but not so badly done. \\n\\n\r\nExcellent anime. Thinking of placing it somewhere in my top 10. Really inspired by Nodame Cantabile, artistically and spiritually. The spirit of excellence is really apparent in the show and now I just want to cling onto my dreams and not give up. And keep listening to classical music too.\\n\\n",
            "date": "2011-08-27T19:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 42273,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147724.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Relon",
                "username": "Relon"
            },
            "url": "https://myanimelist.net/reviews.php?id=42273"
        },
        {
            "content": "To honest, this season is even better from the previous one. Funnier, more romantic, more about the characters’ life, and of course, more of beautiful music.\r\nNodame Cantabile: Paris Chapter brings us at the home of classical music, Europe. Chiaki can finally ride a plane with the help of Nodame though he still has a trauma. They’re life together in Paris starts with exciting new characters and new problems with regards to music. In this season, the romance between the two finally flourishes. They are finally dating. \r\nWith a new season comes new characters. The arrival of new friends and new associates makes the new seasoneven more amazing. After finally coming to Europe, Chiaki starts his goal to be one of the most amazing conductor like his mentors Viera and Stresseman. Also, here we see how Chiaki finally realizes his feelings for Nodame. Though there are times that he denies it so bad but still can’t help but shows it. Action is louder than words. Nodame on the other hand, struggles in the new environment and new obstacles with music. In the end, she finally realizes what she really wants and not just to have a concerto with Chiaki. Both of them shows their amazing talents but personally I think Nodame is way even better from Chiaki. In fact, even Chiaki admits that sometimes Nodame can be out of his league but as long as he does not lose sight of her then it’s alright. Despite being so arrogant and think of himself so great that Nodame should be the one wanting to see him, Chiaki realizes how much he himself wanted to see Nodame. Despite having so different personalities, Chiaki and Nodame are so good together because they complement each other.\\n\\n\r\nI believe the animation is a little bit greater from the previous one. The music is absolutely wonderful and even better.\\n\\n\r\nI definitely love the series much more. I am so looking forward to the next season.\\n",
            "date": "2012-12-09T07:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 79604,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79604"
        },
        {
            "content": "Chiaki and Nodame arrive in Paris where Chiaki begins his music career and Nodame studies at the Conservatoire music school. The couple continue as normal and make new friends such as the outrageous Russian Tanya, the stressed out Yun and the otaku Frank and meet some old ones as they make, Stresemann and Kuroki their first steps in the real world.\r\nOnce again Chiaki gets carried away with his music and travelling around the world putting his career before Nodame. However, he learns how to deal with a real professional orchestra and the politics involved. Nodame makes some real progress with her music and manages toget her first concert.\\n\\n\r\nTheir romance also faces challenges mainly from the former child prodigy Son Rui who joins the Conservatoire to escape her overbearing mother and the pressure of the music world. Rui develops more than a crush on Chiaki and is determined to get him. \\n\\n\r\nAt last we actually see some romance from Chiaki from Nodame as he finally shows his feelings towards Nodame.\\n\\n\r\nWe also see the first steps of a chalk and cheese romance.\\n\\n\r\nThe music again is outstanding by the Nodame Orchestra and again explained so we can enjoy it.\\n\\n\r\nFor me this is the weakest of the 3 Nodame Contabile series as there is very little subplot and I found it a little slow without much character development. However, it is still a good watch.\\n\\n",
            "date": "2012-06-06T01:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 62769,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=62769"
        },
        {
            "content": "Ok, so in my thoughts, yes this middle part of the series is similar in terms of musical foreshadowing, and uses of characters. This series was particularly enjoyable as it introduces a new cast of characters, while retaining and re-introducing prequel characters (e.g. oboe guy). Sadly, however, the connections character-wise to the prequel were limited, bit was wisely chosen. \r\nI enjoyed again the musical choices and integration of a music into the plot. And of course the romance aspect sent shivers down my spine. All I can say is that, as a guy, this series made me soft. As a musician, this series re-inspired me.As an anime-lover, this series was like a refreshing touch of idealistic reality in a sea of fantasy and sci-fi. Again a great watch.\\n\\n\r\nWatching the PREQUEL is recommended, but not needed.",
            "date": "2012-02-15T12:24:00+00:00",
            "helpful_count": 0,
            "mal_id": 53949,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1117201.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ryantang",
                "username": "ryantang"
            },
            "url": "https://myanimelist.net/reviews.php?id=53949"
        }
    ]
]