[
    [
        {
            "content": "\"If you love twintails in your heart, anything is possible!\" - TailRed\r\nWelcome to the anime of the season. No, of ALL the seasons.\r\nFrom start to finish, Ore, Twintails ni Narimasu provides perhaps the most deep and thought-provoking story I've ever come across in my anime career. It blows just about all the cult classics out of the water with its originality. The plot revolves around a typical high-school boy named Souji. Or rather he's typical with the exception that he's a diehard fetishist for twintails. Already here we can see that the anime is starting to go down a direction you don't see particularly often.\r\nOneday, Souji happens to run into a perverted scientist from outer space who gives him a mission. A mission to protect planet Earth from the EVIL HORNY SPACE LIZARDS threatening to steal all the twintails from our beloved homeworld for themselves. Therefore, the girl provides Souji with an epic space-tech gadget which channels his love for twintails into a power capable of transforming him into a mecha-suit-clad red-twintailed loli named TailRed, wielding super powers strong enough to thwart the evil space lizards' immoral assault on the planet. This plot twist was mindboggling to me and left me in awe due to how incredibly unique and well thought-out it was.\\n\\n\r\nOf course a super heroine freedom fighter of justice wouldn't be complete without her band of epic sidekicks present as well, but fear not because Ore, Twintails ni Narimasu delivers absolutely flawlessly in this category as well. You see, as philosophical and interesting as TailRed is as a character, she is not the only masterful heroine this anime has to offer, no sir. Because there is also her loyal compatriot super heroines TailBlue and TailYellow fighting by her side as well! And as shocking as it may sound, they're even appropriately named since their nicknames *also* match the colour of their respective hair! The difference being that TailBlue and TailYellow are actually blessed with being twintailed young women in their natural human form as well, and we all know by now that twintails by default implies that anything is awesome. By adding these two additional super heroines to the main cast, the quality of the show is automatically multiplied by a factor of three, meaning that if the anime wasn't mindblowingly amazing enough as it was, then with this taken into account it suddenly shatters all sorts of records.\\n\\n\r\nBut the joyride doesn't stop even there. After all, heroines of justice can only fulfill their roles as long as there is an enemy to fight, and the villains of Ore, Twintails ni Narimasu are of a scale unlike anything you've ever laid your eyes upon before. Since it's common knowledge that twintails are the answer to everything, have you ever heard of a plot so malicious and figuratively dripping with ulterior motives as one where the evil space lizards are literally trying to steal away all the twintails of planet Earth from mankind? And then once the lizards have done so, surely they will be spending their retirement years doing both this and that with their legendary captured hairstyles? The shock and horror this notion fills me with upon merely considering it is on a level entirely of its own. As a result, the conflict between the twintailed warriors and the space lizards feels disturbingly real and manages to captivate the viewers completely during each and every second of the anime's progression.\\n\\n\r\nThe production value is no less staggering either. Every time you begin a new episode of this anime and get to hear the opening theme kick in, your heart and soul will get filled with a kind of euphoric tranquility upon being exposed to the beautiful lyrics dedicated to everyone's passion and love for twintails. It is an entirely different level of affection and dedication compared to what you'd ever find in any other anime, and as a result you'll always be right there in the twintail mindset whenever you watch this anime. It is truly a work of art in its own right.\\n\\n\r\nAnd regarding the visuals, all that needs to be emphasized is the breathtaking character design of our three super heroines, especially TailRed herself. Just one glance at them and your mind, heart and... *other regions* are all going to be virtually bursting with happiness and satisfaction. If you're the type who gets jealous easily however then you might want to take caution as finding yourself being unable to huggle and cuddle with TailRed in person due to the pesky boundaries between fiction and reality can be a heartbreaking experience. What you can do however is tie up your hair into twintails yourself and you can have the peace of mind of knowing that she'll love you like nothing else because of that alone. If only everyone else had a heart as open as hers, there would be so much less malice in this world.\\n\\n\r\nAs a whole, Ore, Twintails ni Narimasu is a masterpiece unlike any other and does a massive job at saving the currently declining anime industry. It takes everything you thought you could take for granted in this day and age and flips it up-side-down with a fresh and unique storyline and the most likable heroine cast in anime history. We can only hope that the rest of the anime industry will give this show the attention it well and truly deserves and tries to learn from it, because if they do then Ore, Twintails ni Narimasu might very well be the gateway anime paving the way for what the future of multimedia will look like.\\n\\n\r\nA revolution in the anime industry. Add this to your must-watch-before-you-die list right now and come feel the love. You will not regret it.",
            "date": "2014-12-25T13:07:00+00:00",
            "helpful_count": 359,
            "mal_id": 174275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=174275"
        },
        {
            "content": "\"Gonna be the twintails!\" is a show created by otakus, for otakus, that makes fun of otakus. \r\nFrom the get-go, it revolves around an invasion of otaku aliens from another planet who feed off the positive energy humans give through their love. Essentially they are a bunch of perverted losers who leech off of others and ruin people's lives, sound familiar? \r\nOur heroes, a group of twintailed heroines must use their love of twintails to fuel their magical girl powers in order to defeat these monsters, thus saving the human race. Along the way, it's a hilarious journey with perverted humor, (Like gender bending, tentaclesand ecchi scenes) and then just about anything else that you will see in a typical high school comedy anime.\\n\\n\r\nThe aliens are COMPLETELY hilarious, the cast is great (Especially Twoearle), and pretty much everyone in the show is necessary, you don't have 50 different characters that are completely irrelevant popping up for 30 seconds just to fill screen time. The voice acting is solid, the theme song is catchy (\"LES-CUE!\"), and I have no real qualms about the sound. Likewise, the artwork is great and pretty typical of a modern show. (The boobs are exaggerated as hell on tail yellow for comedic effect)\\n\\n\r\nMy only qualm with this show was the fact that the story, like any magical girl show bar madoka, was the sheer predictability. While it was entertaining as hell, and did a great job of satirizing anime similar to something like gintama, like gintama the story is kind of lacking, since the point of the show isn't the plot. \\n\\n\r\nWhile it may not be quite a masterpiece, it's an absolute blast to watch, and I highly recommend it if you're into this sort of show. Anyway, there's two types of people who rate this show poorly, people who either-\\n\r\nA: Don't like this kind of humor.\\n\r\nB: Just don't get the satire.\\n\r\nIf you don't enjoy perverted jokes and constant porn references, like Sekotai Yakuindomo, this is not your show. This is a show created to mock the present state of anime, especially the magical girl genre, and it heavily exaggerates perverted scenes in order to make a point. Try not to take this show too seriously.",
            "date": "2015-06-30T08:23:00+00:00",
            "helpful_count": 79,
            "mal_id": 191798,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3443221.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/seanm826",
                "username": "seanm826"
            },
            "url": "https://myanimelist.net/reviews.php?id=191798"
        },
        {
            "content": "Ever see power rangers, imagine that with a gender bender premise on which instead of masked hero you get a loli-girl from a student\r\nTo be honest there are 3 big points of this anime that it does well the rest are about average.\r\n 1. the idea is simple kill the baddies, and it doesn't waste time trying to gather sympathy for the enemy like naruto or bleach or any other thing, the bad guys don't have SOB stories but instead are wacky, perverted monsters and end of the day they get sliced up by girls  with weapons and we feel happy about it bythe end.\\n\r\n2. There are no serious issues in this anime, it doesn't talk about global warming, get too deeply psychological, or attack some societal flaw it just is about a guy with a god-tier obsession with twin tails trying to protect twin tails and the world but mostly twintails.\\n\r\n3. The fight scenes well it is debatable the animation drops off at some point but you know I think they spent most their budget on this so I do recommend watching up to Drag Guildy then it just flops and flounders.\\n\r\nSide good points include cause they are always pluses for the comedy and just mash up anime.\\n\r\n- Horny mad scientist\\n\r\n- Masochist, Exhibitionist Student President\\n\r\n- A Tsundere who beats other women and not the MC\\n\r\n- A Chuunibyou Mom\\n\r\n- Maid\\n\r\n- A loli-character wielding a flaming sword (most characters just get a sword)\\n\r\nThe Sound is good, the plot could be equivalent to power rangers where it is just monster of the week, and there is fan service coming out by the buckets, it's a harem.\\n\r\nI think I hit most of the points but whatever, take it or leave it, to be honest I had no expectations going into this anime and I was surprised that it is solid and I enjoyed watching the antics of the enemies and the main character.",
            "date": "2014-12-25T22:41:00+00:00",
            "helpful_count": 56,
            "mal_id": 174325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447572.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dim100",
                "username": "dim100"
            },
            "url": "https://myanimelist.net/reviews.php?id=174325"
        },
        {
            "content": "What if your favorite hairstyle?\r\nOre, Twintails ni Narimasu is an anime  that you'll either love or absolutely hate, it's about a boy in love with the twintails hairstyle and becoming a hero because of that love.  I found myself enjoying this series quite much by not questioning the characters' logic too much and viewing this anime as more of a comedy rather than something serious, because there are many things that occur that don't make much sense in the real world. \r\nStory\r\nI have to say that the story was quite generic up until episode 7, it consisted mainly of very cliche things. Thecharacters just gained superpowers and rids the world of evil every day, there weren't any particularly interesting things in their fighting style either, just the same old scream out the name of the attack/power and wreck shop. After episode 7 the story suddenly takes a turn and becomes much more interesting. \\n\\n\r\nArt\\n\r\nI liked the artstyle in Ore, Twintails ni Narimasu quite a lot, the girls were all very cute and would always put a smile on my face. Unfortunately the quality of the art was a bit lacking. What I noticed was that the close ups become slobby in certain situations, either the facial structure was a bit weird or the eyes become very 'intriguing'. With that being said I want to clarify that the art quality was still far from being horrible and still pretty good despite its flaws.\\n\\n\r\nSound\\n\r\nThe only song that I took a liking to is the opening song, I would often find myself not skipping the OP to listen to it another time and that's a good sign.\\n\r\nThe background music in the anime however was nothing special and neglectable, it did set the mood well and complete it's duty.\\n\\n\r\nCharacters\\n\r\nThis was the weak part of the anime, the characters were all quite flat and didn't develop that much aside from the main character Souji. Souji start off as someone who undeniably loves twintails until his doubt of his love kicked in, that's when things took a twist and when his character started to shine.\\n\\n\r\nEnjoyment\\n\r\nComedy is one of my favorite genres and Ore, Twintails ni Narimasu was a great work of that genre. There were definitely some lame jokes that left me speechless but that's also what makes this anime so great. But again enjoyment lies on your own mind and there are a lot of people that would undoubtedly hate this anime to its core. But nevertheless you should give this anime a try and see for yourself! \\n\\n\r\nAfter watching this anime I think I want to touch some twintails myself.",
            "date": "2014-12-30T19:31:00+00:00",
            "helpful_count": 41,
            "mal_id": 175289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4222183.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nailbeast",
                "username": "Nailbeast"
            },
            "url": "https://myanimelist.net/reviews.php?id=175289"
        },
        {
            "content": "This anime gave me more than I came for... but in a bad way.\r\nEven with a medium like anime -- which is well built for things like this -- there comes a limit. An anime like this should not have plot if it's going to be this bad. Did I really come to watch how hard it was to maintain twin-tails? Did I come for horny lizards? Did I come for a lesson on a separation between fetishes and people? I didn't ask for it, but the anime gave all of those things.\r\nFor most, the show is mostly due for its fan-service. It's understandable, alot of shows have peculiar themes meant for this type of stuff. Unfortunately, it's subdued by pretty much everything else it decides to mix into the hodgepodge. The plot itself is about as strong as Team Rocket's failed attempts in Pokemon. It's completely predictable, thrown in with a little fan-service and hardships. About half of every episode is devoted to the comedic situation between the characters, and the other half devoted to slaying horny lizards. I don't care much for the latter, but only because I had given hope for a good plot upon the first episode. There's also the possibility that the show itself is satire on male-aimed magical girl/mecha anime. Even if it is, its goals aren't met.\\n\\n\r\nIn consideration, perhaps we could ignore all these bad plot points and enjoy the anime for what it is. It certainly delivers (to some extent) few enjoyable scenes -- awkward situations worth a little giggle. I think that's exactly what this anime should have delivered on, and yet instead we cue to awkward tentacle scenes, short-lived remorse and doubt. The show itself succeeds in only particular scenes. Most might find its charm through particular highlights of the show. Watching an entire episode is quite different.\\n\\n\r\nAside from (debatably) the main cast, the enemies are unlikable. Perhaps they represent the audience the show was aimed for, but as obscene as their fetishes are, all they receive is a cruel and meaningless punishment of death. In attempt to analyze the show on a deeper level, perhaps the monsters are symbolic. Perhaps these monsters give off a message that the fetishes they seem to have are disgusting and unjustified. As much as I could go into this, it's simply just false. The show itself isn't anything more than a cock-tease most of the time.\\n\\n\r\nThe battle scenes in particular are atrocious, and are better off skipped. The opening and ending songs with their respective scenes give all the action you'll need to see in the entire series. It's pretty much all the same aside from the enemy looking a bit different each time. The peculiar thing about this anime's battle scenes is that they seem to make the quality of the anime seem a lot worse than it actually is. As much as I want to see a generic shounen fight where the characters yell out the names of their moves... It's completely unneeded for this type of show. The charm of the show is due to its peculiar and awkward situation, not the fact that the protagonists are fighting horny lizards. However, the plot begs for it, so the scenes are structured towards it. It would be acceptable if they were even mildly entertaining. The funny thing is the fact that the novel's illustrations actually make it seem like the battle scenes are cool. Perhaps they had potential with this, but potential means absolutely nothing if never brought out.\\n\\n\r\nIn the end, this is one of those shows you wouldn't want to be caught watching. The concept itself isn't terrible (I for one love twin-tails), but its application is questionable. Whatever you may come for, it'll give you something else in combination. Nothing in particular stands out, and it definitely goes for more than what its capable of.",
            "date": "2014-12-29T23:50:00+00:00",
            "helpful_count": 23,
            "mal_id": 175159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/501532.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Keeby",
                "username": "Keeby"
            },
            "url": "https://myanimelist.net/reviews.php?id=175159"
        },
        {
            "content": "\"Put our dreams and wishes into these twintails\"\r\nHave you ever loved someone or something so much that it literally consumed you? Has that love swallowed you whole, allowing little to no breathing and forcing you into the darkest depths of your heart's inner-workings as you grasp for air and fight to regain control of your life? Or have you accepted that and started the trek toward a downward spiral in which everyone you know questions your fixations and starts to lose hope for you?\r\nSouji Mitsuka is obsessed with twintails, a hairstyle only possible and acceptable within the world of anime. And even though this hairstyleis undeniably the greatest there is, there is a line that must be drawn. Because when a group of humanoid animal creatures invade your world with affinities of their own, your fetishes will not save humanity. Unless you are Souji Mitsuka. He loves twintails so much that he is given the power to transform his affection into a physical manifestation and annihilate monsters in order to save the world.\\n\\n\r\nStill reading? Cool. I should also mention that this power transforms him into a girl -- and a cute one at that. And even though the entire thing is overly-spontaneous and silly, it really isn't all that bad. It's something you can just throw yourself into and have a good time with, which isn't all that easy anymore.\\n\\n\r\nNow, I know that we've already come so far over the past couple paragraphs, but we need to go deeper in order to figure out just what this show is. So I'm going to break it up into a few key components in order to further this review.\\n\\n\r\nMusic: 8/10\\n\r\nI think this might be the first time I've reviewed a show where the music outshines the rest of the aspects. Gonna Be The Twin-Tails! brings you in-your-face and extremely catchy rock music for both the opening and closing of the show, being somewhat reminiscent of how the Power Rangers was many years ago. It's both a good and bad sign when you are waiting the entire episode for the ending song to play. And with lyrics like, \"Put our dreams and wishes into these twintails,\" you really can't go wrong. However, despite how awesome the music is, it does quickly get repetitive having to hear the same songs every time a new fight breaks out (Which is at least once every episode). It does a great job and really pumps you up, but it honestly just gets boring after a while. Except for the ending song. I will listen to that all goddamn day.\\n\\n\r\nCharacters: 5/10\\n\r\nAs far as the characters go, there isn't really much to be invested in. Each one is slightly interesting and completely different from the others, but there really isn't much to them when you break them apart. It's a harem, so each girl has a thing for Souji, but only one of them really has a reason to (That being the childhood friend and best-girl, Tsube). It's nice having three characters able to transform into different versions of themselves as soon as they yell \"Tail-on!\" but considering they are almost identical to the way they are when they aren't transformed, there just really isn't much of a point to it apart from gaining superpowers. The characters definitely had potential, but didn't develop as the story progressed. They were all just too static and not interesting enough to be considered good.\\n\\n\r\nArt: 6/10\\n\r\nCharacter design is well-done and relatively intriguing in Gonna Be The Twil-Tails! But boring landscapes and art that grows weaker as the series moves on really depreciates the overall quality. It was clearly evident that the studio was either running out of money or just getting lazy in the later episodes. But consistent design of the humanoid monsters (Or guildies as they are called in the show) stay pretty decent overall. Fight scenes are disguised by flashing lights and magic pillars, so focus is taken away from what's on screen and is instead directed toward background music or the lame dialogue the characters have to yell at that point. The color schemes are solid and appear interesting at first glance, but quickly become dull and boring, just like the characters do.\\n\\n\r\nStory: 6/10\\n\r\nI'm going to be direct here and say that story isn't all that important in comedic anime. Gonna Be The Twin-Tails! relies on its script to succeed -- and the script is actually pretty good. But the story feels like there is something missing. It works like this: Tailred and friends take on a lizard-man or insect-man, completely destroy it, and then move onto the next one. It's just recycled action over and over again. The series attempts to get more interesting with the introduction of Dark Grasper, a human that is idolized by and in control of the Guildies, but she is just another boring character essentially trying via reverse-psychology to get Souji's mentor to love her. It's not something you can't find anywhere else, but it is fairly decent and watchable.\\n\\n\r\nI've always liked uniqueness in visual media -- creativity is what I look for more than anything else when I review something. But there is a right way to do it and a wrong way to do it. Gonna Be The Twin-Tails! approaches entertainment from a non-serious standpoint, and so it can't be graded the same way a serious anime is. It is watchable, but it isn't by any means great or groundbreaking. Approach this anime the same way that you would approach a stand-up comedy routine. If you go in with high-hopes, you will come out disappointed. But if you go in expecting it to just be okay, you might wind up enjoying yourself.",
            "date": "2014-12-30T10:24:00+00:00",
            "helpful_count": 21,
            "mal_id": 175215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229337.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DJNOSTYLE",
                "username": "DJNOSTYLE"
            },
            "url": "https://myanimelist.net/reviews.php?id=175215"
        },
        {
            "content": "What would you do if the one, uh, I mean, two things you hold most dearly are threatened to be taken away? This is no question for our protagonist and fellow twintails connoisseur Mitsuka Souji: of course you defend it with all your might! Plz stop deleting my reviews ok it makes me platinum mad.\r\nSouji has just begun his first day in high school. Unmatched in his passion for twintails, he can only revel in the grandeur of all the damsels sporting his favorite hairstyle, much to the dismay of Tsube Aika whose affection for him goes beyond that of an ordinary childhood friend. Theirpeaceful days, however, comes to an end as the world faces unprecedented danger in an invasion from an alien species that lives off the power of passion, love, twintails, and fetishes. Souji won’t allow none of that, mind you; after being approached by the mysterious big-bust Twoearle he was granted the power to transform into cutiegirl Tailred with the best twintails in town if not literally the universe. Incidentally, his cutie form possesses power overwhelming enough to fend off the invaders and defend the world from these twintails-eating abominations. \\n\\n\r\nSome may recall Kenzen Robo Daimidaler from earlier 2014 which plays on a similarly ridiculous premise but with mecha instead of mahou shoujo and sex drive instead of twintails power. Whereas Daimidaler abuses its premise for blatant fanservice and a few repetitive gags, Twintails employs comparably minimal fanservice and focuses on being consistently entertaining through creative jokes and sound plot progression. While intentionally absurd, it is not altogether void of essence as it may seem at a glance.\\n\\n\r\nI Want to be the Twintails is a story about identity. It’s about standing up for who you are and what you love in the face of your worst adversaries. The protagonists and antagonists alike proudly parade their dubious interests in the heat of battle, for therein lies the source of their might. With zeal far beyond ridicule and shame, it is during these moments of peril they engrave their ephemeral existence into eternity. Souji fends off not only the alien invaders, he needs to constantly resist Twoearle’s and Aika’s attempts at wooing him as well as Mother’s insistence on his concession to sexual desires. But not once did Souji falter as he embraces a more refined pleasure by locking herself up and fingering herself in the twintails. This review is a ruse; I just really like Tailred. In contrast, student council president Shindou Erina finds strength through the release of her repressed sexuality. Twintails is about being honest with yourself and freeing your real you that is repressed in fear going against social expectations. The theme is a common one, but Twintails handles it with a touch of novelty and never strays from its original intent of entertainment.\\n\\n\r\nIncidentally, there are two sides to all coins of the dual-faceted type. Even Souji is capable of viewing his love for twintails through a lens of irony. He acknowledges it as an irrational infatuation because such is the nature of passion. As much as it is a bliss for him, he realizes that it is not an ideal to be forced upon others. In her own words, “Twintails can only come to be on the hair on either side of the head that supports them!”. Despite this, he never rejects this infatuation even when his life is being threatened, not because he is senseless but because next to his love for twintails is his will to protect the world and battle alongside his friends. \\n\\n\r\nI Want to be the Twintails is not about a hairstyle as much as it’s about being conscious of who you are and daring to be different. You know this show does. I think I’ll also grow a pair and play with them in the bathroom.",
            "date": "2015-01-02T18:05:00+00:00",
            "helpful_count": 18,
            "mal_id": 175819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1616425.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/eririri",
                "username": "eririri"
            },
            "url": "https://myanimelist.net/reviews.php?id=175819"
        },
        {
            "content": "(This has been adapted from reddit thread)\r\nIt protects one's scalp from the sun, it comes in all shapes and sizes, and it has regenerative capabilities; of course, I am talking about hair. Whether we like it or not, hair is an essential part of who we are and how we live. There are products devoted to it and establishments entirely about removing it in a cleanly fashion. For those that have it, it is resting peacefully atop our heads. Sometimes, people do their hair up in fancy designs. One of these styles is known as the \"twin-tail.\" In Ore, Twintails ni Narimasu, \"twin-tails\" isn't justa hair-do; it's a way of life and a source of unimaginable power.\\n\\n\r\nSTORY\\n\\n\r\nTwintails stars Souji, a high school boy with an incredible fascination with \"twin-tails,\" a type of hair style. One day, he is visited by the mysterious Twoearle. After receiving a bracelet from her, Souji becomes the famous TailRed, a fighter of evil and champion of \"twin-tails.\"\\n\\n\r\nIt is impossible to argue the utter ridiculousness of the premise. It's an adventure not just about twin-tails, but about all strange fetishes. To this end, everything contained within is a massive parody. The enemies, the battles, the drama, the characters; all of it is taken lightly, and subsequently looked at in a comedic manner. Enemies are almost always defeated in a single move, archetypes are pounded into the ground, and the abilities of the girls are extremely silly. The parody works because it casts its net wide. In fact, one could interpret what goes on as Twintails presenting an elaborate take on the current state of the medium. That it is filled with an overabundance of sexual preferences that infect and detract from what anime truly has to offer, but the only way to be rid of them is to inject yet another fetish, perpetuating the cycle, and thus causing it to never end. Or it could all be for fun.\\n\\n\r\nWhile Twintails may contain some actual literary merit, it does suffer a terrible fate. Mired in repetition, many of the events are the exact same in nature. New bad guy shows up, TailRed battles, ideals clash, and TailRed wins. That is the extent of the anime. It seems as if the strong parody that the show demonstrates would be lost among such boring writing...but once again, there's a catch. The repetition is prevalent and blatant not because there was nothing else to do, but is instead another statement about the anime industry. Season after season, similar stories are pumped out, with the exact same types of characters, settings, and plot devices. Nowadays, there is a large lack of innovation or risk that is taken, simply because \"don't change what isn't broken.\" Then, when something does come along that tries to shake up the formula (say, Twintails), it goes down in a blaze of glory, signified as being trash, and subsequently being trodden underfoot by the \"new\" wave of anime it attempted to thwart. Or it could just be directionless and misguided.\\n\\n\r\nDisregarding the warranted or unwarranted extrapolation, the anime does do something for sure: tackling the idea of having a passion. Ultimaguildy are the villains, but only when they attempt to place their beliefs upon others. Going further, the victor in every battle is the one with the strongest passion. Therefore, Twintails is attempting to relay the message that one can believe fervently in anything (religion, hobbies, etc.) as long as such beliefs do not impose or bring harm to others. At the same time, such a passion shouldn't consume oneself; there exist other parts of life that are worth investigating or having. This is bolstered by the final deus ex machina, and wraps up the show's message in a concise manner befitting of its previously established parody.\\n\\n\r\nANIMATION\\n\\n\r\nWhile the analysis of Twintails's story is debatable, the quality of its art and animation is not.\\n\\n\r\nThe art for the show is largely uninspired. The world is often bland and devoid of life, mostly sticking to common backgrounds such as outside of school or on a rocky cliff. Lighting effects are nearly nonexistent, and many times the art itself dips so low in detail that it appears unfinished.\\n\\n\r\nThe character designs suffer the same fate. Boring regular outfits, plain faces, and the same missing detail as the art make them unappealing. Their only saving grace is in their twin-tails and their transformations, and the varying amount of baddies.\\n\\n\r\nThe final nail in the coffin arises from the animation. With minimal character movements at all times, with dialogue being spoken with mouths only, it doesn't look pretty. Coupled with the fact that the battles reuse the same scenes and that the choreography involved is stale, it makes the entire experience a slow but deteriorating death.\\n\\n\r\nBut is this really not debatable? The analysis in the previous section demonstrates that Twintails may be smarter than it is perceived to be. Is there some deeper meaning to the show's descent into terrible quality? The short answer is, no. It's just not done well in the slightest. The pretentious answer is, maybe. Twintails's devolution from an okay looking anime into a complete mess could be a depiction of the anime industry's downward spiral towards mediocre and generic looking shows, where uniqueness and innovation can never emerge. A big \"maybe,\" but more food for thought.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Twintails are mostly stereotypes, which at this point, should be obvious. However, that inkling feeling rises again....\\n\\n\r\nSouji is the main character, and the boy with a passion. His love for twin-tails knows no bounds, thinking of them first and his person second. He embodies the spirit of TailRed, holding the same fiery and burning desire that she is known for having. The only character to experience any semblance of growth, he is still the typical good guy, being the love of everyone's life. Souji represents the idea that it's okay to question your convictions, that there are moments where one needs to take a step back and look at the bigger picture.\\n\\n\r\nAs Souji's childhood friend, Aika has a lot to overcome. Violent yet caring, beautiful yet ashamed of her body, she very regularly clashes with Twoearle in her pursuit of Souji. As TailBlue, she utilizes water. With calming waves and tumultuous torrents, her personality shines through her fighting style. What's interesting is her constant inability to take teasing about her bust size, despite Souji not caring about that when it comes to women. It's seems like an unnecessary insecurity, but this characterization follows the same motif; water always wants to conform to its surroundings. Even so, she serves as an example that it's best to be comfortable in your own skin, and not worry about what others may think of you.\\n\\n\r\nTwoearle not only has a strange name but is also a strange character, too. Seemingly from another planet, her silver hair, large boobs, and invasive personality make her a standout person. She actually provides a lot of the comedy with her playful behavior and sexuality. Having lost her Attribute, she relies on Souji, Aika, and Erina to do what she could not. If anything, she signifies that despite not having intense dedication towards an aspect of life, one is still able to find joy and happiness in other ways.\\n\\n\r\nMy personal favorite from the anime, Erina is the student council president. Proper and unquestionably kind, she seems like a normal, everyday young woman. But she actually harbors a secret; she's a huge masochist. Her transformation into TailYellow demonstrates this clearly: growing slightly taller, gaining larger breasts, and developing wider hips, she becomes an incredibly sexy figure. Her abilities incorporate both exhibitionism and electricity, allowing her to go through the torture she desperately wants to give her the power she needs. Erina serves as a reminder that it's okay to indulge (within reason!) the passions we have, because we all need a little pick-me-up from time to time.\\n\\n\r\nAs always, there is a need to see more to this part of the anime. What do the characters mean behind the archetypes they exemplify? How are they used as a satirical outlet? It's harder to see but the answer is there: each of the characters has to be something they wish they weren't. Souji turns into a girl, Aika has a flat chest, Twoearle lost her twin-tails, and Erina acts elegant. Even Dark Grasper maintains a cool and evil persona that masks her reserved and awkward self. The purpose of the characters, then, is to bring to light the idea that anime is currently in a state of self-denial. It's in a predicament where it doesn't fully know what it wants to be: forced \"moe,\" extravagant fan-service, and generic adaptations have become the norm, not because anime necessarily wants it to be that way but because it can't be any other way. It may want to escape from the corner it has backed itself into, but such radical changes require extraordinary happenings.\\n\\n\r\nSOUND\\n\\n\r\nThe OP starts very light and jumpy, with guitar and piano playing in harmony. The song picks up half-way, with the vocalist singing along well with the beat presented. It contains a strange break where the song loses tempo, but ends on a nice guitar solo.\\n\\n\r\nThe ED is actually pretty good. It's quite catchy, with the vocalists singing individually and in unison. The beat and guitar pick up halfway through once again, with the guitar and drums working together to make it a nice little jam. Again, the song ends on a fun little guitar riff.\\n\\n\r\nThe soundtrack contains typical pieces: triumphant arrangements, happy-go-lucky beats, and violin, choir-singing tracks for those tense moments. Nothing original, but they work well in their respective moments.\\n\\n\r\nVoice-acting sees average to above average work across the board. A special shout-out to Maaya Uchida as Twoearle, Sumire Uesaka as TailRed, and Chinatsu Akasaki as Erina.\\n\\n\r\nOne last time, we need to put on our \"read between the lines\" glasses. Does the sound-work follow the same trends as everything before it? Of note are the opening and ending songs: both are generic, both contain nonsensical lyrics, and both follow the same song pattern. Twintails, then, is aiming to show that music within anime has become a breeding ground for ridiculousness and unoriginality. Just trying to be catchy, with the slow build-up followed by the song picking up in the middle, is easy; it's a cheap trick that many shows employ, because it works.\\n\\n\r\nENJOYMENT\\n\\n\r\nAt this point, I need to present a question I brought up in one of my earlier works: at what point do my analyses go from being interpretations of what the anime was doing to trying to justify and look for answers? I'd like to think that the show was more than just a bunch of twin-tailed girls flying around. I want to believe that some of what I've said is correct. After all, there is evidence for a lot of it. Sure, the \"Animation\" and \"Sound\" ones are rather weak (I fully admit that), but there is logic behind those from \"Story\" and \"Characters.\"\\n\\n\r\nIt's a difficult dilemma, because where does one put his or her foot down, where does one draw that line in the sand that says, \"Up to here is what they meant, and no more.\" Does that line exist right from the get-go, or does it appear somewhere in the middle? I'd hope that it's the latter.\\n\\n\r\nFor something like Ore, Twintails ni Narimasu, it will be seen by many as just another random show that only anime can pull off. But behind the twin-tails lies a satirical work that challenges what anime currently offers, even if the execution isn't fully apparent.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, parody, repetition with purpose, thematic\\n\\n\r\nAnimation: Bad, bland art style, okay character designs, low actual animation\\n\\n\r\nCharacters: Good, TailRed, TailBlue, TailYellow, and Twoearle represent more literally and figuratively\\n\\n\r\nSound: Fine, okay OP, good ED, okay soundtrack, average VA work\\n\\n\r\nEnjoyment: Good, a hidden satire\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-12-30T12:11:00+00:00",
            "helpful_count": 18,
            "mal_id": 175229,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=175229"
        },
        {
            "content": "I may have marked my list for this pathetic anime, but in really I just skimmed it.\r\nSO DON'T EVEN GET ME STARTED!!!!!!\r\nStory: Pathetic 1.\r\nTbh, as I've started watching this anime up to episode 7, from with all the boring battle where the result is obvious, I've started to skimmed it up to episode 12, So Why the FUCK! Ok, first of all it uses an already overused plot of inter-dimensional beings out to invade earth, second, it has FETISH!!!!!!!!!!!!Written all over it and those so called \"Twintail Attributes\" was obviously a euphemism for \"PIG TAIL FETISH!!!!!!!!!!!\"And that is why   Kenzen Robo Daimidaler isa top recommendation for this anime since they were both based on sexual innuendo except the latter was very brazen about it ,while this anime was more like making something look innocent. But seriously why did studio \"FUNnimation\" even thought of making such anime that has a compensates it's FETISH based theme with a lot of monologues ? Fuck, if I can go to Japan right now, I'd be going over studio   FUNimation  and punch the Executive Producer Fukunaga Gen in the face for not picking other manga with sense for an anime adaptation.\\n\\n\\n\r\nArt:  Very Good 8.\\n\\n\r\nThe rating is for Shindo Erina in her Tail Yellow suit, Twoearle since she is my kind of eye candy in this anime and Dark Grasper since I do have a thing for bikini girls in glasses.\\n\\n\r\nSound: Mediocre 5.\\n\\n\r\nCo'z I just have no comment in this part, but I do like the opening theme.\\n\\n\\n\r\nCharacter: Dreadful 2.\\n\\n\r\nYou, know, this is one of those anime where, the bad guys are more lovable than the good guys, thought I would have rate this part a 7, well, the fact is that them bad guys just come and go, also their monologue just infuriates me. So so what about the other characters? Reason number 1 for my score.\\n\\n\r\n Mitsuka Souji- In this anime/manga he....or she embody's a typical gender bender in this anime, where he's kinda of a metaphor for  every closet gay's desire kinda thing. I mean, where can you find such character who can be a girl in an instant? Only in this anime, basically he was just a typical harem gay who- as usual was oblivious of his childhood friend's feelings for him.  What makes me hater his/her character very much was his love for twintails, or let's cut the crap FETISH for twintails where at time I'm begging to think that because he can transform into \"Tail Red\" that he is a narcissist who is in love with his alter ego as a Tail Red a girl. IMAO, his defense for twin tail attributes makes me wanna kill him.  Reason number 2 for my score.\\n\\n\r\nShindo Erina- As tail yellow, she is another girl with a fetish for wanting to make love to a hero, where just like Souji, has the capability of loving herself in a sexual manner, since she is tail yellow anyways. Reason number 3 for my score.\\n\\n\r\nTsube Aika- Ok, frankly she was the only normal character around here, and as always no harem is complete without a childhood friend. Then again, whether we like to admit it or not she is the sadist in this anime, only, story writer, Mizusawa, Yume, had her toned down. She is reason number 4 for my score.\\n\\n\r\n Twoearle- What can I say, she is the quintessential bimbo in Souji's harem, however, she is a toned downed MILF.  \\n\\n\r\n Anko \"Dark Grasper\" Iisuna- I kinda hate that she wasn't made to follow through with her goal of eliminating those twin tail trios. And just like everyone else, she has a glasses fetish and she is the  last nail in the coffin where I gave this part a low score. \\n\\n\\n\r\nEnjoyment: Dreadful 2.\\n\\n\r\nJust don't ask and don't even get me started.\\n\\n\\n\r\nOverall: Pathetic 1.\\n\\n\r\nDefinitely an anime for people with fetish and a certified PTW.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-12-26T12:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 174391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=174391"
        },
        {
            "content": "Twin Tails is an anime about embracing all the things in the world that you love with all your heart and soul no matter how random or strange they might be to other people. \r\nYes the over all idea behind it is to embrace twin tails and at first I did not really get into the anime because even though I do like twin tails on girls I'm not super obsessed with them but the idea is not so much the twin tails but its more so about embracing something that's different from the norm. \r\nAside from the twin tail girls themselves this anime presentsthese perverted Otaku like lizards who express there own fetishes for certain things they love and these fetishes tend to be really out there and strange like one lizard is like me and embraces the idea of legs and getting stepped on by girls. Another lizard might be obsessed with gender bender guy girls or something just really random or strange. \\n\\n\r\nIn all honestly all the villains though portrayed as evil are really noting more than just obsessive Otaku goof balls that just have strange fetishes that there very passionate about and want to express to others.\\n\\n\r\nIts no different than being a real life Otaku being obsessed with anime and buying all the merchandise you can on it or having a strange sexual fetish that while strange is still something you love and want to embrace with all your heart and also tell people about.\\n\\n\r\nJust think of something you yourself love that most view as strange and think about how much you love it anyway and want to express that love with all your heart that's what this anime is about\\n\\n\r\nThis is also a story that was created to look like a magical girl action anime but if you go into not understanding the true purpose and intent behind it you will not enjoy it and this is why many people who watch this anime come out of it not thinking its any good because they totally miss the point that's why I'm taking the time to express all this to guys so you can hopefully watch this anime with an open mind.\\n\\n\r\nThis anime is meant to take a bunch of strange hobbies and fetishes to the absolute extreme and using this concept the creator also made a really fun story out of it that's not meant to be taken to seriously. \\n\\n\r\nSo even if it looks like its meant to be a magical girl action series with transformations and evil villains don't let yourself be fooled.\\n\\n\r\nIt can honestly be soooo much fun to watch going into it with the proper mind set.\\n\\n\r\nLike for me one thing I really like about this anime is I imagine the person who created it had an obsessive love for twin tails on girls mainly from like anime or video game type girls and despite some people looking down on this fetish thinking its stupid or that there's no point to it he was able to turn this random passion of his into something creative in the form of a light novel that then turned into his job that then became an anime that is most likely entertaining tons of people world wide and inspiring them to embrace there weroid fetishes without shame despite what the others say about what they like. \\n\\n\r\nHe's taking a strange passion in his love of twin tails along with other random fetishes and crafting a story in a way where its all about embracing what you love in the mostly overly obsessed way possible \\n\\n\r\n loving twin tails themselves is not the point nor it that required to love this anime.\\n\\n\r\nJust understanding the intent behind it is enough which is embracing something that is out there and weroid not the twin tails themselves\\n\\n\r\nI can totally feel the authors passion for something he loves and admire that he was able to make a story centered around what his passion is cause plenty of people have a passion for something but don't show it for fear of getting judged.\\n\\n\r\nI also think this mans example and intent with the story is to say no matter what type of passion a person has in the world you can make something constructive with it regardless of what other people say you just have to have the confidence to embrace it and express it with all your heart and something great could come of it like this man and his random story about twin tails and other fetishes. \\n\\n\r\nSo if you do watch this anime hopefully your able to take in all the things I mentioned and hopfully this can also inspire you to embrace the things you love and express them without shame and do something with that passion like create a book or draw pictures of it or make videos regarding it and it could turn into a job or just some amazing creative art that has your signature on it.\\n\\n\r\nI imagine if this guy talked about his love of twin tails to people in his real life and everyone looked at him thinking that is such a stupid thing to be obsessed over just like how someone can say anime is stupid to be obsessed over cause there just cartoons but you and I know differently \\n\\n\r\nHe totally ignored any possible criticism he might have gotten and took what he loved which was twin tails and as randomly as it was he created a world for it to be appreciated and expressed and made it into his job and shared that same passion with people all over the world to be entertained by it and also to be inspired to embrace there own fetishes because as I mentioned its not just about twin tails but tons of other fetishes are explored and embraced by other characters so if you have a strange fetish there is a chance it will be highlighted and embraced by one of the characters in the show cause this anime is about embracing what you love no matter how random, strange or weroid not about twin tails even though that happens to be the authors fetishes but its more about embracing something you love with all your heart despite everything.\\n\\n\r\nAnother thing I love about this anime is the way they introduce the whole harem concept. cause Its done in a way that's more realistic than most.\\n\\n\r\nLike the mother is obsessed and open to the idea of her son actually getting teoghter with other women and the friend I mentioned watching the anime with connected this to the idea of japan's declining birth rate that's going on in real life.\\n\\n\r\nSo if you take that perspective into account it would make since for a Japanese mother to push for her son to be with be with another women and want to get him married off as soon as possible because for the sake of japan's decline birth rate and lack of people getting teoghter.\\n\\n\r\nI'm assuming you know the story behind this btw if you don't then I suppose I'm explaining this part for noting but if your aware of japan's issue when it comes to people getting married and having children the if you watch the anime and see the overly nice mother pushing her son to get married to other women just think about it from that perspective and the harem becomes realistic and fun.\\n\\n\r\nAnyways I hope this reviewed helped to want to get you into twintails and also helps you to follow your passion in life and embrace it with all your heart no matter what\\n",
            "date": "2018-01-10T07:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 268110,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3605505.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mami-Sexual",
                "username": "Mami-Sexual"
            },
            "url": "https://myanimelist.net/reviews.php?id=268110"
        },
        {
            "content": "I’m glad this exists, but I’m not sure if it’s as good as it should’ve been. I do agree with the main character about twintails. It’s a beautiful hairstyle. Sadly, the anime connected to it is less than stellar. What is this? A celebration of fetishes? A satire of it? Is it making fun, laughing with me or all of the above? Why are last episodes so generic?\r\nYou’d think that a genre as overflowing as Harem would lead to tighly-focused anime. You have so many shows to learn from and yet the anime is still a confused mess. If it were just cliched, fine. Haganaiwas also cliche but at least it had focus. Twintails is too busy being confused over its genre to settle for a direction.\\n\\n\r\nThe obvious point of comparison is Date A Live. That underrated anime, while not amazing, was still a unique harem. It had a weird premise that turned the Action on its head and gave a new context for the Harem aspects.\\n\\n\r\nThe premise of Twintails doesn’t actually add anything. Our hero transforms into a girl and the enemies give big speeches about their favorite fetish. Every episode concludes with a lightshow and characters giving their attacks pet names. Thankfully we never get insight into how the battle system actually works – it wouldn’t make the lightshow any less dull.\\n\\n\r\nBeyond the speeches and the fact our heroes all have twintails, the story is derivative and common. The creators clearly didn’t want just another story, but their attempts at turning the fetishes into plot points fail. Most of the time it’s just creepy fetishism. Borrowing the Hero’s Honor bullshit from JoJo doesn’t make your anime more diverse. It only highlights how confused the creators were. What does macho bullshit have to with twintails and harems?\\n\\n\r\nIt all ends with a big fight draped in red and black. The hero is full of doubts, about to lose the fight because they don’t have faith. Then suddenly he has an encounter outside of time. A figure speaks to him in a vision and he regains his love, screams the attack name and defeats the enemy. After that we see everyone going to school like nothing happened, with tsundere beating up the big-breasted girl as always.\\n\\n\r\nAgain, what does this has to do with, well, anything?\\n\\n\r\nThe whole structure is a mess, and it can’t be saved. None of the ingridients are worthwhile unless you focus on them. Heroic stories are a common template and fetish stories often sexually harass the audience. The anime at least doesn’t go too far in what in subjects the audience. Anyone looking for juicy screenshots will be disappointed. Still, even a messy plot can survive if the characters are good enough.\\n\\n\r\nEven there the series fails, despite trying hard. Everyone is exaggerated and our main character, for a chance, has a personality. Although it’s not much, being an obsessive over something is definitely progress over typical heroism. In fact, there’s a specific moment where the MC reveals he’s driven more by his selfish obsession than saving the world. For a change, our Harem MC isn’t just a convenient moral compass.\\n\\n\r\nToo bad everyone around him is an exagerrated archetype. If the creators could imagine funny situations in which these archetypes are effective, fine. How many times can the flat-chested childhood friend beat up the big-breasted new girl? There’s no difference between each time it happens. Twoearle makes something sexual and Aika beats her up.\\n\\n\r\nThe line between failures like these and successes like Neptunia are blurry. Both rely on silly archetypes, but Neptunia has wilder situations. Its archetypes are more well-thought out. They don’t govern just the funny situations but every aspect of the character lives. Here the quirks only rear their heads when it’s time to beat up the perverted girl. At some point, it becomes characters abuse. When your Harem comedy resembles Saw in its treatment of characters, something is wrong.\\n\\n\r\nEven the visual design doesn’t rescue it. Shows like this are an example why sexy character design is a positive thing. Although all the girls are meant to be pretty, nothing about their design is interesting. Twoearle is closest thing to a good visual idea. Although twintails are an awesome hairstyle, the show does nothing with it. Generic big eyes are all you have left. The battle suits are also typical pieces of metal stuck on bodies. The enemies are equally just blobs of metal, a macho mess inspired by an animal but no different than a Transformer\\n\\n\r\nThe series starts off being some fun and the concept is ridiculous enough. This is another case where a Harem anime doesn’t take advantage of its silly premise. What’s disappointing in these anime is that they’re never as outlandish as they promise. In the end, this isn’t a story about how glorious twintails are. It’s just another anime with heroes in dull outfits who shout attack names and beats blobs of metal.\\n\\n\r\n2 twintails out of 5",
            "date": "2016-07-08T13:22:00+00:00",
            "helpful_count": 8,
            "mal_id": 223503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4632480.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheBrainintheJar",
                "username": "TheBrainintheJar"
            },
            "url": "https://myanimelist.net/reviews.php?id=223503"
        },
        {
            "content": "Haha, this review is a little late. I kept up with this show all the way through til the end. Screw Christmas, the finale of this show coming out was better. \r\nStory: 8/10\r\nThis is either something you really love or really hate. The mistake people make is taking this show seriously. THIS SHOW IS A PARODY. It's just a little something to make people laugh and see all the flaws in anime. \r\nHowever, the story in itself is original and intriguing. I see it as a \"magical girl meets superhero\" type of show, with much better villains. I also love all the twintails! Who doesn't?I think that the plot was thought out pretty well and wasn't ever ruined. I never found myself thinking \"Hey, where did the plot go?\". \\n\\n\r\nArt: 9/10\\n\r\nIt is very cute and pretty. I quite like the style and how each character is drawn to match their personality. The animation is pretty good too, with few flaws that I noticed. TailRed is especially cute! \\n\\n\r\nSound: 7/10\\n\r\nIt isn't bad at all, but it's just not anything special or memorable. The opening and ending themes were great, but I barely remember anything about the VAs or the BGM, which proves my point. It's been only around four and a half months and I don't remember anything, but even after two years or so I can remember the music that goes to \"Fruits Basket\". \\n\\n\r\nCharacters: 5/10 \\n\r\nThe characters are the weak part of this show. Perverted scientist, tsundere childhood friend, masochist student council president, not too special but also perverted protagonist...sound familiar? Of course it does. They're all so cliché, and that kind of killed it for me. I really liked the side characters, though. Souji's mom, Dark Grasper, and all the other villains were great. \\n\\n\r\nEnjoyment: 8/10\\n\r\nYeah, I found this show quite entertaining! It was fun to watch and made me laugh a few times.\\n\\n\r\nOverall: 7.4, rounding down to 7/10\\n\\n\r\nSorry for such a short review! If you like parody anime, twintails, or both, you should watch this show!\\n\\n\\n",
            "date": "2015-05-07T12:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 187320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4475792.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lowlifeloveliver",
                "username": "lowlifeloveliver"
            },
            "url": "https://myanimelist.net/reviews.php?id=187320"
        },
        {
            "content": "Ore, Twintails ni Narimasu ~6~ \r\nSo ~ the end of this anime season is approaching and I find myself, once again, trying to come up with reasonable ratings for the various anime which I followed over the past months.\r\n~ Unsafeman121 Dec 2014\r\n~Plot~\r\n~6~\r\nThough weak, I have to give this anime credit for having a plot and following through on it for the entirety of the anime as opposed to dropping it half-way through as I have seen some others do. Though not too impressive, the plot does improve slightly as the anime progresses. Although not brilliant, the plot did change my view of the anime makingit slightly positive as opposed to slightly negative. The last few episodes really up it a little bit and it does intrigue you a little bit more due to a barrier which needs to be overcome.\\n\\n\r\n~Sound~\\n\r\n~7~\\n\\n\r\nI enjoyed the OP and ED of this anime ~ the ED I would even consider possibly downloading. The character voices suited their respective characters and so I believe the voice actors were well suited to the roles which they each played.\\n\\n\r\n~Visuals~\\n\r\n~6~\\n\\n\r\nI found the graphical style of this anime to be pleasing, though possible slightly below that of many others I have seen ~ that being said it is still enough for it to gain a positive rating of 6. There wasn't anything in particular which I disliked about it, but there are areas where I feel it could have been cleaned up slightly. The action scenes were well drawn.\\n\\n\r\n~Character~\\n\r\n~5~\\n\\n\r\nI feel that the characters are one of the weaker points in the anime. I did not feel like I was able to get to know any of them particularly well (to the extent which is achievable in a single series anime). I did not dislike the character design, though there wasn't anything which made me specifically like them.\\n\\n\r\n~Enjoyment~\\n\r\n~5~\\n\r\nI didn't not enjoy the first episode very much, and I have to say that I'm pleased I started to enjoy the anime more as I went along. That being said, I do not believe it is one that has particularly shone for me, and there wasn't too much excitement when I saw that the next episode had been released.\\n\\n\r\n~Overall~\\n\r\n~6~\\n\\n\r\n\"Though still enjoyable to watch, it was sub-par in my opinion.\"\\n\\n\r\nIt is safe to say that many people will criticize this anime on some of its \"questionable\" natures, however this is not something that bothers me at all, there are many different anime with questionable themes, and lots of them i have still enjoyed thoroughly. Sadly I do not find that is the case with this anime. That is not to say I didn't enjoy watching that anime, but I felt the of the anime which I have given a positive rating to, this is definitely on the lower end of the scale.\\n\\n\r\nFor those who are interested ~ Ranking Progression:\\n\r\nThis is where I show the changes (if any) in my overall rating as the anime progressed, I review my ratings every 4 episodes ~ though if one does stand out for me I will also mention it.\\n\\n\r\nE01: 4\\n\r\nE04: 5 (Rated up 1)\\n\r\nE08: 6 (Rated up 1)\\n\r\nE12: 6",
            "date": "2015-01-02T10:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 175759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2904965.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Unsafeman121",
                "username": "Unsafeman121"
            },
            "url": "https://myanimelist.net/reviews.php?id=175759"
        },
        {
            "content": "You either die the comedian or you ride the joke long enough to be the reason everyone cringes. This show unfortunately become the latter.\r\nThe story is best under stood when explained by the loony tunes Tasmanian Devil while on acid during a roller coast ride that breaks down half way through. While its reasoning to be a super hero anime, is beyond mind comprehending other than having a reason to put in as many obscure fetishes into a show as possible, it does however at least keep the basis of a 'superhero' type anime. Good guy is winning, bad guy gets stronger, good guy startsto doubt, divine intervention and back to ass kicking, etc\\n\\n\r\nWhen you start to give more attention to detail on the shows fanservice suits and insane amount of fetishes, it becomes something a little difficult to watch. While bearable at first, it gets very noticeable about half way through of how little care they put into the actual faces of both the MC's and secondary characters alike. The colors are similar to that of a childrens superhero show in that all the good guys are bright colored while the villains are almost always dark, gloomy and obsessed with stealing/destroying something on the earth\\n\\n\r\nMusic holds a rather high point about this anime though as not one is it a dull or misused moment with sound effects or BGM. The sound is the one thing that makes the action scenes somewhat captivating and not making you turn off your computer and burning your eyes for the fact of it seems more entertaining at the time.\\n\\n\r\nCharacter development does happen, however... odd it is. Every new development is another strange addition to the characters profile. Most villains never last more than one episode and the process is rinsed and repeated every new installment. Apart from that one lesbian character that was relevant for all of 3 episodes. That was a record secondary character introduction for this anime.\\n\\n\r\nEnjoyment and humor was super high from the get go. The sheer \"wtf\" of this keeps you laughing enough to want to see how stupider it can get. Until however by about episode 9 or 10 it gets old and boring when they harp on about the same jokes expecting more laughs and you just want it over with. When you think something enjoyable or close to normal is happening, it takes a turn and leaves you back in the corner of shame for even thinking it would do such a thing.",
            "date": "2015-01-28T18:05:00+00:00",
            "helpful_count": 7,
            "mal_id": 179150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=179150"
        },
        {
            "content": "Ore, Twintail ni Narimasu. Simply to say, super sentai (origin of power rangers). No, I'm serious. Maybe. Maybe not.\r\nBut the style of having three super powered girls reminded me of it. Not to mention, they're able to merge their weapons together. (Sorry for the semi-spoiler.) Now here's a bit of a twist. One of the girls is a twin-tail lover whose a guy. One thing I didn't like about this fact is that one guy (aka Souji) with a bunch of girls equals harem (a small one but nonetheless a harem). \r\nOne more twist is, the anime is not about protecting humanity. It's about protectinghumanity's love of twin-tails. It was something new to me, something I haven't seen before. An anime revolved around the power of twin-tails. \\n\\n\r\nThe story-line is very straightforward and generic. If you have watched Super Sentai/Power Rangers, the story-line goes about the same. Defeating one enemy every episode till you reach the final boss. However, the comedy I received was enough to make up for its lack of original plot.\\n\\n\r\nThe art is very much mediocre for its generation, meaning it is still very appealing for people to watch.\\n\\n\r\nThe music, I must say, is fantastic. The OP and ED are great to listen to, especially the ED. The music within the episodes are mind-blowing to me. Probably because one of Fairy Tail's composer, Takanashi Yasaharu composed much of the music for Ore, Twintail ni Narimasu. (I am not sure how much he actually composed though.)\\n\\n\r\nCharacter development is okay. The anime builds up their character from the present story-line, rather than give backstory. However, this does not take any enjoyment from this anime away from me.\\n\\n\r\nWhile not exactly at the top of its season, it is still a phenomenal anime to watch. Also, I don't recommend the anime to people who shy away from sexual parts. Ore, Twintail ni Narimasu hints at sexual references and shows sexual scenes.\\n\\n",
            "date": "2016-02-11T08:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 210664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1855092.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Meyneth",
                "username": "Meyneth"
            },
            "url": "https://myanimelist.net/reviews.php?id=210664"
        },
        {
            "content": "Here's a lesson/warning to all my fellow otakus.  Don't ever listen to what your friends tell you to watch.  Cause when you do, you end up watching stuff like this.\r\nFetishes.  Things that appeal to one's preference in a sort of sensual matter.  We all have our tastes and things that pertain to us, in which we find attractive and pleasing.  But when you make an anime surrounded by that idea...yeah, it can get pretty weird.  Here's Ore, Twintails ni Narimasu, or, in accordance to Funimation's dubbing, \"Gonna be a Twintails!\"  (Oh god, why.)\r\nStory (6.00/10): To be honest, theshow's story is quite bland.  Mitsuki Souji, our main protagonist loves the twintail hairstyle.  When I mean loves the style, I mean LOVES the style.  It's to the point that he devotes his time to admiring them and even made his tsundere totally not in love with him childhood friend wear them as her natural hairstyle.  One day, a mysterious woman by the name of Twoearle drops down and tells him that the fate of twintails is in danger, leading him to become a twintail himself and protect twintails with his very life!\\n\\n\r\nI don't think I really need to go into just how absurd this story is, because it really sorta speaks for itself.  What really makes the story bland is the way that it's structured.  From episode to episode, you basically get the same cookie-cutter style of storytelling that the Mighty Morphin Power rangers have done for the last 20 years.  A single bad guy and maybe a hoard of disposable minions descends onto the planet with powers unique only to them, the good guys come in to stop them from spreading their evil power over the land to stop terrorizing people, they fight hand-to-hand, usually ending in failure, before bringing out their big guns, before destroying their enemy the exact same way every time.  (This show is basically Power rangers with skimpier clothing, and all the villains have anime-related fetishes.)  With a story like this, the show really becomes nothing more than a snoozefest because there's really not much variation from episode to episode.\\n\\n\r\nThat being said though, the show does diverge a little bit in its story by adding some background to the mysterious Twoearle, as well as making a new focus for its plotline for the second half of the show.  While these attempts to make the show interesting were admirable, it still follows its \"Oh!  A bad guy!  *fights*  Doesn't work!  *Uses ultimate attack*  Yeah! We beat him!\" style of storytelling for basically every epiosde.  \\n\\n\r\nThe comedy for the show is subjective at best, trying very hard to be funny with its use of sexual innuendo mostly thanks to Twoearle being the horny girl she is.  You may get a couple laughs out of this show in addition to the many regrets you may tally when watching this, but there's really nothing memorable I would say about this.  That being said, make sure you watch this show ALONE with the door closed.  You do not want anyone stepping in when you watch this.\\n\\n\r\nOverall, Twintails was...interesting for a storyline to say the least.  The actual way that they delivered the plot was boring to all hell, with the same technique being used over and over and over again like a broken record.  But because this show did have a unique story concept of which is obvious why it was never done before, I guess it gets a good mark for it?\\n\\n\r\nOverview:\\n\r\n+/-  Interesting story idea?\\n\r\n+/-  Subjective comedy  (It's mostly just over the top sexual innuendos)\\n\r\n-      Stale storytelling\\n\r\n-     It's honestly kinda awkward to watch.\\n\\n\r\nCharacters (5.44/10):  Can...can you even call these characters?  The cast of Twintails is...interesting, and I use that word very questionably.\\n\\n\r\nFirst we have Mitsuki Souji.  This guy loves twintails.  Yep, that's it.  That's all of his character traits.  In the series, Souji is our main protagonist, aka TailRed, as he is known.  Above liking twintails, there's not really much to know about him other than the fact that he cares solely for twintails and the many variations that they come in, even going to the extent of proposing for a twintails club at school because reasons. \\n\\n\r\nAnd then we have Tsube Aika, aka TailBlue, aka the \"tsundere childhood friend who has a bust complex\" because we totally haven't seen that before.  (Reference 75% of Rei Kugumiya's work here)  Similar to Souji, that's pretty much all you get for her aside from the fact that she's the violent type who can beat the shit out of a gorilla, and still win.  She's not a bad character per say, similar to all the others, but there's not really much to them since you don't really get to know these characters on account of the show saying the word \"Twintails\" every 10 seconds.\\n\\n\r\nThen, Twoearle.  Oh, twoearle, twoearle.  Twoearle is the only character that really gets any sort of backstory or semi-focus in this series because of her past and all this jazz that the series pulls.  Apart from maybe like two or three moments in the series, Twoearle is that busty girl character who's so horny that she will not hesitate to rape you in your sleep.  Five times.  Again, not really much to her since this show doesn't really give a crap about its characters.\\n\\n\r\nAnd finally, we have Erina, aka TailYellow, who is that sweet little rich girl without any common sense as to what things are on account of being raised without knowledge of certain things.  Oh yeah, and she's also a masochist.  Go figure.  You get one episode to know about her, and that's it.  \\n\\n\r\nAnd now the real characters that I wanted to talk about, the Utilmagil, aka the fetish aliens.  These lot are a real piece of work.  Every one of these antagonists is focused on one thing, which is defeating the twintails.  In addition, every single one of them has a personal fetish that they hold dear like it's their lives, which honestly is kinda true on account of the fact that these guys last like 20 minutes tops per episode.\\n\\n\r\nOverall, the characters, all of them, ranging from major to minor, all have one thing in common.  They all have a fetish to strive for, and desires that some would say is best to keep to themselves.  There is really no development from character to character as the moment you get to know what their tastes in hairstyle/body shape/obscure features like the back of the neck, you'll know their entire character 100%.\\n\\n\r\nOverview:\\n\r\n+/-  They're easy to understand?\\n\\n\r\nArt and Sound (7.44/10 and 6.44/10): The art for the series is pretty standard.  There isn't really too much standout at face value, and the art really just does its job at being a pretty picture to look at with its bright colors.\\n\\n\r\nThat being said though, the character designs are actually relatively well-detailed.  The characters both good and bad have a good chunk of detail to them and would make an otherwise ordinary show, look a bit better.  However, it's also important to keep in mind that the show also uses subjective imagery, and make certain situations a little bit more perverted than they actually are.\\n\\n\r\nThe soundtrack is generic and ordinary.  Not bad, but not fantastic.  It's skippable.  Trust me, it's honestly not even worth your time.  \\n\\n\r\nOverview:\\n\r\n+  Good detail on characters\\n\r\n+/-  Meh artwork\\n\r\n+/-  Meh soundtrack\\n\\n\r\nOverall Enjoyment (6.66/10):  Twintails...well...I guess you could say the feeling of this show is sorta unexplainable for me.  While watching the show, I honestly despised it cause every minute I spent watching it was every minute of regret adding to my life, but after finishing the episode, I wasn't hesitant to continue watching it more, even going to the extent of finishing the series.  To say I hate this show is a stretch, but then again, saying I like it is also a stretch too.\\n\\n\r\nDid I like this show?\\n\\n\r\nUm...Well...I'm not really sure.  I watched it, even becoming somewhat addicted to it by watching five episodes in one go when I said I was only going to watch one, but I don't like the storyline.  It's...weird to describe it.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nFrom a technical standpoint, the show has bland pretty much everything, all except its core story idea of twintails (since the way this idea was handled made the show almost unexplainable as to what the hell it actually was).  As a personal standpoint, I'm not really sure what to hate because I'm honestly stunned as to what I should say about this.  (I legitimately cannot find words to accurately describe my feelings for this show.)\\n\\n\r\nWould I recommend this to anyone?\\n\\n\r\nI personally wouldn't recommend it on account of just how weird and strange this show is, as well as the effect that it had on me.  But honestly, this show is, to put in simple terms, an experience.  So, if you want an \"experience\", I'd put this near FLCL, as it has a similar feeling of \"What the fuck did I just watch\" like this show.  Never have I thought in my life that I would watch Super Slutty Power rangers, and I'm not really sure how to react.\\n\\n\r\nAuthor's note:  I don't get how this show isn't tagged as gender-bender.  The only guy in the show spends more screentime as a fucking girl than he does his own gender.\\n\\n\r\nOverall Score: 6.00/10",
            "date": "2014-12-27T19:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 174655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=174655"
        },
        {
            "content": "We are in a day and age where anime is getting better since it's been around since the '60s, and I think anime has gotten better. This is one of those animes. I discovered this anime after watching two terrible anime and wanted something good to watch. The first episode was free on iTunes and so I was like hey, why the hell not? After the first few minutes, I was hooked. This anime is extremely underrated, but don't let that stop you. It's a genius, original piece of work that is the greatest anime of all time.\r\nSoji is new to high school and realizesthat he loves it because a lot of the girls have twintail, which is his obsession/fetish. He even goes as far to try to make a club about twintails. When walking home with his friend, they come across a girl named Twoearle who claims that twintails are in danger from Emilians, evil lizards obsessed with finding the perfect twintail. In order to save all twintails, he must put on a transformation bracelet to turn into a twintailed hero to destroy the emilians. Only one problem, he turns into a girl. \\n\\n\r\nThe story evolves smoothly, the characters brilliantly hilarious and the art and soundtrack are gorgeous. It's only 12 episodes, but its worth your time and might even be one of the greatest things you have ever watched ever",
            "date": "2016-10-20T22:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 232220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4978604.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/yuriinsomnia",
                "username": "yuriinsomnia"
            },
            "url": "https://myanimelist.net/reviews.php?id=232220"
        },
        {
            "content": "It started great but later on tailred just kept getting subdued and the other two twin tails had to do all the work. plus there wasn’t much consistency. like when enemies appeared in the first episodes, they had the follower guys. then in later episodes it was just the bad guy. overall, don't put much time into it, although it is worth watching once. it had some nice aspects of the ecchi but overall wasnt too much of a focus. in the beginning it was heavily focused on the exposition, which is like, ok we get it, but it's a lot like saban's power rangers.Except this one is cartoon and for older audiences",
            "date": "2017-12-03T14:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 264453,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6778031.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/magicshadow818",
                "username": "magicshadow818"
            },
            "url": "https://myanimelist.net/reviews.php?id=264453"
        },
        {
            "content": "\"Gonna be the Twin Tail!\" \r\nTwintails is a quirky harem/slice of life/magical girl/fan service anime about a boy who super loves girls who wear their hair in twin tails. When earth comes under attack, he is granted the power to transform into Tail-red, a red armored girl with super long twintails.\r\nAs they defend earth from monsters with a strange range of questionable (but never outright sexual or rated r) fetishes, such as pictures of girls with dolls, bathing suits, or girls in glasses, the show becomes amusingly absurd in how serious it takes the subject matter of believing in the power of your hairstyle. \r\nItruly enjoyed this series. It's difficult, relying on the subtitles and wondering if the authors intent has been skewed, but I feel like it's got a Monty-Python-esque level of self-respect for it's own ridiculousness.\\n\\n\r\nThe animation, especially near the end of the series, is as good as any I've seen. The color-explosion is extreme, the animation is incredibly smooth, and the music is great. There's only a few times where an animation is recycled, but it looks good enough it's worth seeing again. \\n\\n\r\nThe characters are good too. Tail-blue is a good enough tsundere / comic relief, and the sexual deviance of their strange mentor is pretty funny. Tail-reds moms encouragement of these different girls to seduce her boy is a nice touch, and not commonly seen. \\n\\n\r\nIn the end, you could substitute hairstyles for any number of things, and the message is the same. Whether you are obsessed with girls with twintails, playing nerd games, or doing algebra, it's about accepting that you are you and your proud of your skills, even if it's something silly.\\n\\n\r\nI liked the message, the animation is great, and the show is generally funny and filled with some great anime tropes. I recommend watching it, it's free on Hulu. (Don't need +!)\\n",
            "date": "2016-06-06T14:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 220140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5458503.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thunderfrog",
                "username": "Thunderfrog"
            },
            "url": "https://myanimelist.net/reviews.php?id=220140"
        },
        {
            "content": "I sometimes wonder if an anime that falls just short of being a masterpiece is worse than a true stinker.  Ore, Twintail ni Narimasu is one missed opportunity short of greatness.  While the production values are not particularly high, it has the rare courage to take an outrageous idea and just go for it.  It starts out with great setup but a rather routine monster-of-the-week plot.  But then the story takes progressive turns into ever more daringly deviant territory.  And then it misses the mark in the last two episodes.  I thought it would zig but instead it zagged.Despite this, if you are a fan of gender-bender anime, this one is worth the watch, if only to spark your imagination regarding what could have been.\\n\\n\r\nSpeaking of what could have been, when I was a kid, I experimented with cross-dressing a couple of times and I was surprised at how gorgeous I looked in the mirror.  For most people, their gender is a huge part of their identity but for me it's just a shell we take on to interact with others.  Since I'm probably unusually detached to gender roles, naturally I was curious about what women's lives were like.\\n\\n\r\nOn an even further side note, I have a tiny daughter now, and she looks just  like I did when I was little.  People literally stop to stare at how cute she is.  She causes a stir everywhere she goes with strangers fawning over her.  So maybe from a genetic perspective that question is answered.\\n\\n\r\nHow is this relevant to \"Gonna be Twin Tails\"?  Well, this is a gender-bender anime, and the target audience is probably kind of small.  It's significant for anyone who has ever wanted to be able to change gender, even if only on a temporary basis, just to see what it would be like.  It even has a scene where our main character, Soji, sequesters himself in the bathroom so he can transform into his girl self and... examine himself (herself?) more closely.  It's got a hilarious twist exactly appropriate for the theme of the show.  As an example of great dialogue, his childhood friend is watching from a hidden camera and asks, \"I can't watch, but I kind of want to.\"\\n\\n\r\nSoji, the main character, is a guy in high school who REALLY loves pig tails, or \"Twin Tails\" as the Japanese apparently refer to the hair style.  An alien comes to Earth to save us from a third invading alien race out to get our \"Twin Tail\" attribute.  The anime knows how silly this is, and uses it only to set up increasingly deviant fetishes of aliens who seek something very specific, such as having little girls hold dolls.  This anime doesn't hold back; a number of popular and embarrassing fetishes are paraded before the audience, and this anime plays them to the hilt.\\n\\n\r\nYou see, the nice alien lady offers Soji a bracelet that gives him the power to battle the bad aliens on even terms.  Except it also turns him into a loli girl with fabulous twin tails.  Brilliant.\\n\\n\r\nYes, this anime is a harem, and there are multiple girls after Soji.  Yes, it has gobs of over-the-top fan service.  But curiously, it takes the time to explore the psychology of why these girls might actually like the main character instead of just blindly acting as the story requires them to.  These girls have their own hang-ups and some closet deviant fetishes themselves, and aren't particularly shy about exhibiting them for comedic effect.\\n\\n\r\nThe fight scenes are clearly a parody of both mahou shoujo anime and shonen battle anime.  Our team of heroines transform into their battle forms in racy style.  The outfits are skimpy and double entendres are common in the dialogue.  Don't tune in for great action scenes.  Watch for the the unabashed way the show just tries really hard to get a smile out of you.  Of course some jokes fall flat but I laughed out loud more often than I really should admit.\\n\\n\r\nThen comes episode 11, when Soji wakes up one morning and things take a curious turn.  I was really hoping the show would go there and it does... sort of.  But instead of allowing us to see what social situations this would create, it sticks to its focus on the invading aliens.  It was at this point I thought an opportunity for both outrageous comedy and daring adventure was missed.  \\n\\n\r\nIf an anime is going to be a racy comedy, I prefer the funny, witty kind to the juvenile, embarrassing version.  If someone falls on top of somebody else, by god it should be full-on and not some nerdy accidental breast grope.  At one point our alien lady friend develops a version of the battle bracelet that makes the wearer's breasts larger.  Soji's flat-chested childhood friend doesn't dance around the issue; she begs the alien to allow her to wear this bracelet instead of the one she's been given.  Ore, Twintail ni Narimasu even delves into the practical difficulty regarding the proper care and maintenance of the twin tail hairstyle, using this as the pivotal character development turning point for Soji.  \"I wonder if I ever really understood twin tails.\"  Brilliant.\\n\\n\r\nI can imagine that many people would not like this show.  If you think overly explicit sexual subject matter is childish, you won't like it.  If the idea of fetishes turns you off, you probably won't like it.  It's easy to dismiss this as yet another harem-mahou shoujo-shonen battle anime where a team gets together to save the world while exploring their burgeoning sexuality.  On the other hand, if you are willing to just go with the show's brazen attitude, you might enjoy a fetish-filled alien invasion or two.",
            "date": "2018-12-19T00:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 296132,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Qichar",
                "username": "Qichar"
            },
            "url": "https://myanimelist.net/reviews.php?id=296132"
        }
    ],
    [
        {
            "content": "\"If you love twintails in your heart, anything is possible!\" - TailRed\r\nWelcome to the anime of the season. No, of ALL the seasons.\r\nFrom start to finish, Ore, Twintails ni Narimasu provides perhaps the most deep and thought-provoking story I've ever come across in my anime career. It blows just about all the cult classics out of the water with its originality. The plot revolves around a typical high-school boy named Souji. Or rather he's typical with the exception that he's a diehard fetishist for twintails. Already here we can see that the anime is starting to go down a direction you don't see particularly often.\r\nOneday, Souji happens to run into a perverted scientist from outer space who gives him a mission. A mission to protect planet Earth from the EVIL HORNY SPACE LIZARDS threatening to steal all the twintails from our beloved homeworld for themselves. Therefore, the girl provides Souji with an epic space-tech gadget which channels his love for twintails into a power capable of transforming him into a mecha-suit-clad red-twintailed loli named TailRed, wielding super powers strong enough to thwart the evil space lizards' immoral assault on the planet. This plot twist was mindboggling to me and left me in awe due to how incredibly unique and well thought-out it was.\\n\\n\r\nOf course a super heroine freedom fighter of justice wouldn't be complete without her band of epic sidekicks present as well, but fear not because Ore, Twintails ni Narimasu delivers absolutely flawlessly in this category as well. You see, as philosophical and interesting as TailRed is as a character, she is not the only masterful heroine this anime has to offer, no sir. Because there is also her loyal compatriot super heroines TailBlue and TailYellow fighting by her side as well! And as shocking as it may sound, they're even appropriately named since their nicknames *also* match the colour of their respective hair! The difference being that TailBlue and TailYellow are actually blessed with being twintailed young women in their natural human form as well, and we all know by now that twintails by default implies that anything is awesome. By adding these two additional super heroines to the main cast, the quality of the show is automatically multiplied by a factor of three, meaning that if the anime wasn't mindblowingly amazing enough as it was, then with this taken into account it suddenly shatters all sorts of records.\\n\\n\r\nBut the joyride doesn't stop even there. After all, heroines of justice can only fulfill their roles as long as there is an enemy to fight, and the villains of Ore, Twintails ni Narimasu are of a scale unlike anything you've ever laid your eyes upon before. Since it's common knowledge that twintails are the answer to everything, have you ever heard of a plot so malicious and figuratively dripping with ulterior motives as one where the evil space lizards are literally trying to steal away all the twintails of planet Earth from mankind? And then once the lizards have done so, surely they will be spending their retirement years doing both this and that with their legendary captured hairstyles? The shock and horror this notion fills me with upon merely considering it is on a level entirely of its own. As a result, the conflict between the twintailed warriors and the space lizards feels disturbingly real and manages to captivate the viewers completely during each and every second of the anime's progression.\\n\\n\r\nThe production value is no less staggering either. Every time you begin a new episode of this anime and get to hear the opening theme kick in, your heart and soul will get filled with a kind of euphoric tranquility upon being exposed to the beautiful lyrics dedicated to everyone's passion and love for twintails. It is an entirely different level of affection and dedication compared to what you'd ever find in any other anime, and as a result you'll always be right there in the twintail mindset whenever you watch this anime. It is truly a work of art in its own right.\\n\\n\r\nAnd regarding the visuals, all that needs to be emphasized is the breathtaking character design of our three super heroines, especially TailRed herself. Just one glance at them and your mind, heart and... *other regions* are all going to be virtually bursting with happiness and satisfaction. If you're the type who gets jealous easily however then you might want to take caution as finding yourself being unable to huggle and cuddle with TailRed in person due to the pesky boundaries between fiction and reality can be a heartbreaking experience. What you can do however is tie up your hair into twintails yourself and you can have the peace of mind of knowing that she'll love you like nothing else because of that alone. If only everyone else had a heart as open as hers, there would be so much less malice in this world.\\n\\n\r\nAs a whole, Ore, Twintails ni Narimasu is a masterpiece unlike any other and does a massive job at saving the currently declining anime industry. It takes everything you thought you could take for granted in this day and age and flips it up-side-down with a fresh and unique storyline and the most likable heroine cast in anime history. We can only hope that the rest of the anime industry will give this show the attention it well and truly deserves and tries to learn from it, because if they do then Ore, Twintails ni Narimasu might very well be the gateway anime paving the way for what the future of multimedia will look like.\\n\\n\r\nA revolution in the anime industry. Add this to your must-watch-before-you-die list right now and come feel the love. You will not regret it.",
            "date": "2014-12-25T13:07:00+00:00",
            "helpful_count": 359,
            "mal_id": 174275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=174275"
        },
        {
            "content": "\"Gonna be the twintails!\" is a show created by otakus, for otakus, that makes fun of otakus. \r\nFrom the get-go, it revolves around an invasion of otaku aliens from another planet who feed off the positive energy humans give through their love. Essentially they are a bunch of perverted losers who leech off of others and ruin people's lives, sound familiar? \r\nOur heroes, a group of twintailed heroines must use their love of twintails to fuel their magical girl powers in order to defeat these monsters, thus saving the human race. Along the way, it's a hilarious journey with perverted humor, (Like gender bending, tentaclesand ecchi scenes) and then just about anything else that you will see in a typical high school comedy anime.\\n\\n\r\nThe aliens are COMPLETELY hilarious, the cast is great (Especially Twoearle), and pretty much everyone in the show is necessary, you don't have 50 different characters that are completely irrelevant popping up for 30 seconds just to fill screen time. The voice acting is solid, the theme song is catchy (\"LES-CUE!\"), and I have no real qualms about the sound. Likewise, the artwork is great and pretty typical of a modern show. (The boobs are exaggerated as hell on tail yellow for comedic effect)\\n\\n\r\nMy only qualm with this show was the fact that the story, like any magical girl show bar madoka, was the sheer predictability. While it was entertaining as hell, and did a great job of satirizing anime similar to something like gintama, like gintama the story is kind of lacking, since the point of the show isn't the plot. \\n\\n\r\nWhile it may not be quite a masterpiece, it's an absolute blast to watch, and I highly recommend it if you're into this sort of show. Anyway, there's two types of people who rate this show poorly, people who either-\\n\r\nA: Don't like this kind of humor.\\n\r\nB: Just don't get the satire.\\n\r\nIf you don't enjoy perverted jokes and constant porn references, like Sekotai Yakuindomo, this is not your show. This is a show created to mock the present state of anime, especially the magical girl genre, and it heavily exaggerates perverted scenes in order to make a point. Try not to take this show too seriously.",
            "date": "2015-06-30T08:23:00+00:00",
            "helpful_count": 79,
            "mal_id": 191798,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3443221.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/seanm826",
                "username": "seanm826"
            },
            "url": "https://myanimelist.net/reviews.php?id=191798"
        },
        {
            "content": "Ever see power rangers, imagine that with a gender bender premise on which instead of masked hero you get a loli-girl from a student\r\nTo be honest there are 3 big points of this anime that it does well the rest are about average.\r\n 1. the idea is simple kill the baddies, and it doesn't waste time trying to gather sympathy for the enemy like naruto or bleach or any other thing, the bad guys don't have SOB stories but instead are wacky, perverted monsters and end of the day they get sliced up by girls  with weapons and we feel happy about it bythe end.\\n\r\n2. There are no serious issues in this anime, it doesn't talk about global warming, get too deeply psychological, or attack some societal flaw it just is about a guy with a god-tier obsession with twin tails trying to protect twin tails and the world but mostly twintails.\\n\r\n3. The fight scenes well it is debatable the animation drops off at some point but you know I think they spent most their budget on this so I do recommend watching up to Drag Guildy then it just flops and flounders.\\n\r\nSide good points include cause they are always pluses for the comedy and just mash up anime.\\n\r\n- Horny mad scientist\\n\r\n- Masochist, Exhibitionist Student President\\n\r\n- A Tsundere who beats other women and not the MC\\n\r\n- A Chuunibyou Mom\\n\r\n- Maid\\n\r\n- A loli-character wielding a flaming sword (most characters just get a sword)\\n\r\nThe Sound is good, the plot could be equivalent to power rangers where it is just monster of the week, and there is fan service coming out by the buckets, it's a harem.\\n\r\nI think I hit most of the points but whatever, take it or leave it, to be honest I had no expectations going into this anime and I was surprised that it is solid and I enjoyed watching the antics of the enemies and the main character.",
            "date": "2014-12-25T22:41:00+00:00",
            "helpful_count": 56,
            "mal_id": 174325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/447572.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dim100",
                "username": "dim100"
            },
            "url": "https://myanimelist.net/reviews.php?id=174325"
        },
        {
            "content": "What if your favorite hairstyle?\r\nOre, Twintails ni Narimasu is an anime  that you'll either love or absolutely hate, it's about a boy in love with the twintails hairstyle and becoming a hero because of that love.  I found myself enjoying this series quite much by not questioning the characters' logic too much and viewing this anime as more of a comedy rather than something serious, because there are many things that occur that don't make much sense in the real world. \r\nStory\r\nI have to say that the story was quite generic up until episode 7, it consisted mainly of very cliche things. Thecharacters just gained superpowers and rids the world of evil every day, there weren't any particularly interesting things in their fighting style either, just the same old scream out the name of the attack/power and wreck shop. After episode 7 the story suddenly takes a turn and becomes much more interesting. \\n\\n\r\nArt\\n\r\nI liked the artstyle in Ore, Twintails ni Narimasu quite a lot, the girls were all very cute and would always put a smile on my face. Unfortunately the quality of the art was a bit lacking. What I noticed was that the close ups become slobby in certain situations, either the facial structure was a bit weird or the eyes become very 'intriguing'. With that being said I want to clarify that the art quality was still far from being horrible and still pretty good despite its flaws.\\n\\n\r\nSound\\n\r\nThe only song that I took a liking to is the opening song, I would often find myself not skipping the OP to listen to it another time and that's a good sign.\\n\r\nThe background music in the anime however was nothing special and neglectable, it did set the mood well and complete it's duty.\\n\\n\r\nCharacters\\n\r\nThis was the weak part of the anime, the characters were all quite flat and didn't develop that much aside from the main character Souji. Souji start off as someone who undeniably loves twintails until his doubt of his love kicked in, that's when things took a twist and when his character started to shine.\\n\\n\r\nEnjoyment\\n\r\nComedy is one of my favorite genres and Ore, Twintails ni Narimasu was a great work of that genre. There were definitely some lame jokes that left me speechless but that's also what makes this anime so great. But again enjoyment lies on your own mind and there are a lot of people that would undoubtedly hate this anime to its core. But nevertheless you should give this anime a try and see for yourself! \\n\\n\r\nAfter watching this anime I think I want to touch some twintails myself.",
            "date": "2014-12-30T19:31:00+00:00",
            "helpful_count": 41,
            "mal_id": 175289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4222183.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nailbeast",
                "username": "Nailbeast"
            },
            "url": "https://myanimelist.net/reviews.php?id=175289"
        },
        {
            "content": "This anime gave me more than I came for... but in a bad way.\r\nEven with a medium like anime -- which is well built for things like this -- there comes a limit. An anime like this should not have plot if it's going to be this bad. Did I really come to watch how hard it was to maintain twin-tails? Did I come for horny lizards? Did I come for a lesson on a separation between fetishes and people? I didn't ask for it, but the anime gave all of those things.\r\nFor most, the show is mostly due for its fan-service. It's understandable, alot of shows have peculiar themes meant for this type of stuff. Unfortunately, it's subdued by pretty much everything else it decides to mix into the hodgepodge. The plot itself is about as strong as Team Rocket's failed attempts in Pokemon. It's completely predictable, thrown in with a little fan-service and hardships. About half of every episode is devoted to the comedic situation between the characters, and the other half devoted to slaying horny lizards. I don't care much for the latter, but only because I had given hope for a good plot upon the first episode. There's also the possibility that the show itself is satire on male-aimed magical girl/mecha anime. Even if it is, its goals aren't met.\\n\\n\r\nIn consideration, perhaps we could ignore all these bad plot points and enjoy the anime for what it is. It certainly delivers (to some extent) few enjoyable scenes -- awkward situations worth a little giggle. I think that's exactly what this anime should have delivered on, and yet instead we cue to awkward tentacle scenes, short-lived remorse and doubt. The show itself succeeds in only particular scenes. Most might find its charm through particular highlights of the show. Watching an entire episode is quite different.\\n\\n\r\nAside from (debatably) the main cast, the enemies are unlikable. Perhaps they represent the audience the show was aimed for, but as obscene as their fetishes are, all they receive is a cruel and meaningless punishment of death. In attempt to analyze the show on a deeper level, perhaps the monsters are symbolic. Perhaps these monsters give off a message that the fetishes they seem to have are disgusting and unjustified. As much as I could go into this, it's simply just false. The show itself isn't anything more than a cock-tease most of the time.\\n\\n\r\nThe battle scenes in particular are atrocious, and are better off skipped. The opening and ending songs with their respective scenes give all the action you'll need to see in the entire series. It's pretty much all the same aside from the enemy looking a bit different each time. The peculiar thing about this anime's battle scenes is that they seem to make the quality of the anime seem a lot worse than it actually is. As much as I want to see a generic shounen fight where the characters yell out the names of their moves... It's completely unneeded for this type of show. The charm of the show is due to its peculiar and awkward situation, not the fact that the protagonists are fighting horny lizards. However, the plot begs for it, so the scenes are structured towards it. It would be acceptable if they were even mildly entertaining. The funny thing is the fact that the novel's illustrations actually make it seem like the battle scenes are cool. Perhaps they had potential with this, but potential means absolutely nothing if never brought out.\\n\\n\r\nIn the end, this is one of those shows you wouldn't want to be caught watching. The concept itself isn't terrible (I for one love twin-tails), but its application is questionable. Whatever you may come for, it'll give you something else in combination. Nothing in particular stands out, and it definitely goes for more than what its capable of.",
            "date": "2014-12-29T23:50:00+00:00",
            "helpful_count": 23,
            "mal_id": 175159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/501532.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Keeby",
                "username": "Keeby"
            },
            "url": "https://myanimelist.net/reviews.php?id=175159"
        },
        {
            "content": "\"Put our dreams and wishes into these twintails\"\r\nHave you ever loved someone or something so much that it literally consumed you? Has that love swallowed you whole, allowing little to no breathing and forcing you into the darkest depths of your heart's inner-workings as you grasp for air and fight to regain control of your life? Or have you accepted that and started the trek toward a downward spiral in which everyone you know questions your fixations and starts to lose hope for you?\r\nSouji Mitsuka is obsessed with twintails, a hairstyle only possible and acceptable within the world of anime. And even though this hairstyleis undeniably the greatest there is, there is a line that must be drawn. Because when a group of humanoid animal creatures invade your world with affinities of their own, your fetishes will not save humanity. Unless you are Souji Mitsuka. He loves twintails so much that he is given the power to transform his affection into a physical manifestation and annihilate monsters in order to save the world.\\n\\n\r\nStill reading? Cool. I should also mention that this power transforms him into a girl -- and a cute one at that. And even though the entire thing is overly-spontaneous and silly, it really isn't all that bad. It's something you can just throw yourself into and have a good time with, which isn't all that easy anymore.\\n\\n\r\nNow, I know that we've already come so far over the past couple paragraphs, but we need to go deeper in order to figure out just what this show is. So I'm going to break it up into a few key components in order to further this review.\\n\\n\r\nMusic: 8/10\\n\r\nI think this might be the first time I've reviewed a show where the music outshines the rest of the aspects. Gonna Be The Twin-Tails! brings you in-your-face and extremely catchy rock music for both the opening and closing of the show, being somewhat reminiscent of how the Power Rangers was many years ago. It's both a good and bad sign when you are waiting the entire episode for the ending song to play. And with lyrics like, \"Put our dreams and wishes into these twintails,\" you really can't go wrong. However, despite how awesome the music is, it does quickly get repetitive having to hear the same songs every time a new fight breaks out (Which is at least once every episode). It does a great job and really pumps you up, but it honestly just gets boring after a while. Except for the ending song. I will listen to that all goddamn day.\\n\\n\r\nCharacters: 5/10\\n\r\nAs far as the characters go, there isn't really much to be invested in. Each one is slightly interesting and completely different from the others, but there really isn't much to them when you break them apart. It's a harem, so each girl has a thing for Souji, but only one of them really has a reason to (That being the childhood friend and best-girl, Tsube). It's nice having three characters able to transform into different versions of themselves as soon as they yell \"Tail-on!\" but considering they are almost identical to the way they are when they aren't transformed, there just really isn't much of a point to it apart from gaining superpowers. The characters definitely had potential, but didn't develop as the story progressed. They were all just too static and not interesting enough to be considered good.\\n\\n\r\nArt: 6/10\\n\r\nCharacter design is well-done and relatively intriguing in Gonna Be The Twil-Tails! But boring landscapes and art that grows weaker as the series moves on really depreciates the overall quality. It was clearly evident that the studio was either running out of money or just getting lazy in the later episodes. But consistent design of the humanoid monsters (Or guildies as they are called in the show) stay pretty decent overall. Fight scenes are disguised by flashing lights and magic pillars, so focus is taken away from what's on screen and is instead directed toward background music or the lame dialogue the characters have to yell at that point. The color schemes are solid and appear interesting at first glance, but quickly become dull and boring, just like the characters do.\\n\\n\r\nStory: 6/10\\n\r\nI'm going to be direct here and say that story isn't all that important in comedic anime. Gonna Be The Twin-Tails! relies on its script to succeed -- and the script is actually pretty good. But the story feels like there is something missing. It works like this: Tailred and friends take on a lizard-man or insect-man, completely destroy it, and then move onto the next one. It's just recycled action over and over again. The series attempts to get more interesting with the introduction of Dark Grasper, a human that is idolized by and in control of the Guildies, but she is just another boring character essentially trying via reverse-psychology to get Souji's mentor to love her. It's not something you can't find anywhere else, but it is fairly decent and watchable.\\n\\n\r\nI've always liked uniqueness in visual media -- creativity is what I look for more than anything else when I review something. But there is a right way to do it and a wrong way to do it. Gonna Be The Twin-Tails! approaches entertainment from a non-serious standpoint, and so it can't be graded the same way a serious anime is. It is watchable, but it isn't by any means great or groundbreaking. Approach this anime the same way that you would approach a stand-up comedy routine. If you go in with high-hopes, you will come out disappointed. But if you go in expecting it to just be okay, you might wind up enjoying yourself.",
            "date": "2014-12-30T10:24:00+00:00",
            "helpful_count": 21,
            "mal_id": 175215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229337.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DJNOSTYLE",
                "username": "DJNOSTYLE"
            },
            "url": "https://myanimelist.net/reviews.php?id=175215"
        },
        {
            "content": "What would you do if the one, uh, I mean, two things you hold most dearly are threatened to be taken away? This is no question for our protagonist and fellow twintails connoisseur Mitsuka Souji: of course you defend it with all your might! Plz stop deleting my reviews ok it makes me platinum mad.\r\nSouji has just begun his first day in high school. Unmatched in his passion for twintails, he can only revel in the grandeur of all the damsels sporting his favorite hairstyle, much to the dismay of Tsube Aika whose affection for him goes beyond that of an ordinary childhood friend. Theirpeaceful days, however, comes to an end as the world faces unprecedented danger in an invasion from an alien species that lives off the power of passion, love, twintails, and fetishes. Souji won’t allow none of that, mind you; after being approached by the mysterious big-bust Twoearle he was granted the power to transform into cutiegirl Tailred with the best twintails in town if not literally the universe. Incidentally, his cutie form possesses power overwhelming enough to fend off the invaders and defend the world from these twintails-eating abominations. \\n\\n\r\nSome may recall Kenzen Robo Daimidaler from earlier 2014 which plays on a similarly ridiculous premise but with mecha instead of mahou shoujo and sex drive instead of twintails power. Whereas Daimidaler abuses its premise for blatant fanservice and a few repetitive gags, Twintails employs comparably minimal fanservice and focuses on being consistently entertaining through creative jokes and sound plot progression. While intentionally absurd, it is not altogether void of essence as it may seem at a glance.\\n\\n\r\nI Want to be the Twintails is a story about identity. It’s about standing up for who you are and what you love in the face of your worst adversaries. The protagonists and antagonists alike proudly parade their dubious interests in the heat of battle, for therein lies the source of their might. With zeal far beyond ridicule and shame, it is during these moments of peril they engrave their ephemeral existence into eternity. Souji fends off not only the alien invaders, he needs to constantly resist Twoearle’s and Aika’s attempts at wooing him as well as Mother’s insistence on his concession to sexual desires. But not once did Souji falter as he embraces a more refined pleasure by locking herself up and fingering herself in the twintails. This review is a ruse; I just really like Tailred. In contrast, student council president Shindou Erina finds strength through the release of her repressed sexuality. Twintails is about being honest with yourself and freeing your real you that is repressed in fear going against social expectations. The theme is a common one, but Twintails handles it with a touch of novelty and never strays from its original intent of entertainment.\\n\\n\r\nIncidentally, there are two sides to all coins of the dual-faceted type. Even Souji is capable of viewing his love for twintails through a lens of irony. He acknowledges it as an irrational infatuation because such is the nature of passion. As much as it is a bliss for him, he realizes that it is not an ideal to be forced upon others. In her own words, “Twintails can only come to be on the hair on either side of the head that supports them!”. Despite this, he never rejects this infatuation even when his life is being threatened, not because he is senseless but because next to his love for twintails is his will to protect the world and battle alongside his friends. \\n\\n\r\nI Want to be the Twintails is not about a hairstyle as much as it’s about being conscious of who you are and daring to be different. You know this show does. I think I’ll also grow a pair and play with them in the bathroom.",
            "date": "2015-01-02T18:05:00+00:00",
            "helpful_count": 18,
            "mal_id": 175819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1616425.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/eririri",
                "username": "eririri"
            },
            "url": "https://myanimelist.net/reviews.php?id=175819"
        },
        {
            "content": "(This has been adapted from reddit thread)\r\nIt protects one's scalp from the sun, it comes in all shapes and sizes, and it has regenerative capabilities; of course, I am talking about hair. Whether we like it or not, hair is an essential part of who we are and how we live. There are products devoted to it and establishments entirely about removing it in a cleanly fashion. For those that have it, it is resting peacefully atop our heads. Sometimes, people do their hair up in fancy designs. One of these styles is known as the \"twin-tail.\" In Ore, Twintails ni Narimasu, \"twin-tails\" isn't justa hair-do; it's a way of life and a source of unimaginable power.\\n\\n\r\nSTORY\\n\\n\r\nTwintails stars Souji, a high school boy with an incredible fascination with \"twin-tails,\" a type of hair style. One day, he is visited by the mysterious Twoearle. After receiving a bracelet from her, Souji becomes the famous TailRed, a fighter of evil and champion of \"twin-tails.\"\\n\\n\r\nIt is impossible to argue the utter ridiculousness of the premise. It's an adventure not just about twin-tails, but about all strange fetishes. To this end, everything contained within is a massive parody. The enemies, the battles, the drama, the characters; all of it is taken lightly, and subsequently looked at in a comedic manner. Enemies are almost always defeated in a single move, archetypes are pounded into the ground, and the abilities of the girls are extremely silly. The parody works because it casts its net wide. In fact, one could interpret what goes on as Twintails presenting an elaborate take on the current state of the medium. That it is filled with an overabundance of sexual preferences that infect and detract from what anime truly has to offer, but the only way to be rid of them is to inject yet another fetish, perpetuating the cycle, and thus causing it to never end. Or it could all be for fun.\\n\\n\r\nWhile Twintails may contain some actual literary merit, it does suffer a terrible fate. Mired in repetition, many of the events are the exact same in nature. New bad guy shows up, TailRed battles, ideals clash, and TailRed wins. That is the extent of the anime. It seems as if the strong parody that the show demonstrates would be lost among such boring writing...but once again, there's a catch. The repetition is prevalent and blatant not because there was nothing else to do, but is instead another statement about the anime industry. Season after season, similar stories are pumped out, with the exact same types of characters, settings, and plot devices. Nowadays, there is a large lack of innovation or risk that is taken, simply because \"don't change what isn't broken.\" Then, when something does come along that tries to shake up the formula (say, Twintails), it goes down in a blaze of glory, signified as being trash, and subsequently being trodden underfoot by the \"new\" wave of anime it attempted to thwart. Or it could just be directionless and misguided.\\n\\n\r\nDisregarding the warranted or unwarranted extrapolation, the anime does do something for sure: tackling the idea of having a passion. Ultimaguildy are the villains, but only when they attempt to place their beliefs upon others. Going further, the victor in every battle is the one with the strongest passion. Therefore, Twintails is attempting to relay the message that one can believe fervently in anything (religion, hobbies, etc.) as long as such beliefs do not impose or bring harm to others. At the same time, such a passion shouldn't consume oneself; there exist other parts of life that are worth investigating or having. This is bolstered by the final deus ex machina, and wraps up the show's message in a concise manner befitting of its previously established parody.\\n\\n\r\nANIMATION\\n\\n\r\nWhile the analysis of Twintails's story is debatable, the quality of its art and animation is not.\\n\\n\r\nThe art for the show is largely uninspired. The world is often bland and devoid of life, mostly sticking to common backgrounds such as outside of school or on a rocky cliff. Lighting effects are nearly nonexistent, and many times the art itself dips so low in detail that it appears unfinished.\\n\\n\r\nThe character designs suffer the same fate. Boring regular outfits, plain faces, and the same missing detail as the art make them unappealing. Their only saving grace is in their twin-tails and their transformations, and the varying amount of baddies.\\n\\n\r\nThe final nail in the coffin arises from the animation. With minimal character movements at all times, with dialogue being spoken with mouths only, it doesn't look pretty. Coupled with the fact that the battles reuse the same scenes and that the choreography involved is stale, it makes the entire experience a slow but deteriorating death.\\n\\n\r\nBut is this really not debatable? The analysis in the previous section demonstrates that Twintails may be smarter than it is perceived to be. Is there some deeper meaning to the show's descent into terrible quality? The short answer is, no. It's just not done well in the slightest. The pretentious answer is, maybe. Twintails's devolution from an okay looking anime into a complete mess could be a depiction of the anime industry's downward spiral towards mediocre and generic looking shows, where uniqueness and innovation can never emerge. A big \"maybe,\" but more food for thought.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Twintails are mostly stereotypes, which at this point, should be obvious. However, that inkling feeling rises again....\\n\\n\r\nSouji is the main character, and the boy with a passion. His love for twin-tails knows no bounds, thinking of them first and his person second. He embodies the spirit of TailRed, holding the same fiery and burning desire that she is known for having. The only character to experience any semblance of growth, he is still the typical good guy, being the love of everyone's life. Souji represents the idea that it's okay to question your convictions, that there are moments where one needs to take a step back and look at the bigger picture.\\n\\n\r\nAs Souji's childhood friend, Aika has a lot to overcome. Violent yet caring, beautiful yet ashamed of her body, she very regularly clashes with Twoearle in her pursuit of Souji. As TailBlue, she utilizes water. With calming waves and tumultuous torrents, her personality shines through her fighting style. What's interesting is her constant inability to take teasing about her bust size, despite Souji not caring about that when it comes to women. It's seems like an unnecessary insecurity, but this characterization follows the same motif; water always wants to conform to its surroundings. Even so, she serves as an example that it's best to be comfortable in your own skin, and not worry about what others may think of you.\\n\\n\r\nTwoearle not only has a strange name but is also a strange character, too. Seemingly from another planet, her silver hair, large boobs, and invasive personality make her a standout person. She actually provides a lot of the comedy with her playful behavior and sexuality. Having lost her Attribute, she relies on Souji, Aika, and Erina to do what she could not. If anything, she signifies that despite not having intense dedication towards an aspect of life, one is still able to find joy and happiness in other ways.\\n\\n\r\nMy personal favorite from the anime, Erina is the student council president. Proper and unquestionably kind, she seems like a normal, everyday young woman. But she actually harbors a secret; she's a huge masochist. Her transformation into TailYellow demonstrates this clearly: growing slightly taller, gaining larger breasts, and developing wider hips, she becomes an incredibly sexy figure. Her abilities incorporate both exhibitionism and electricity, allowing her to go through the torture she desperately wants to give her the power she needs. Erina serves as a reminder that it's okay to indulge (within reason!) the passions we have, because we all need a little pick-me-up from time to time.\\n\\n\r\nAs always, there is a need to see more to this part of the anime. What do the characters mean behind the archetypes they exemplify? How are they used as a satirical outlet? It's harder to see but the answer is there: each of the characters has to be something they wish they weren't. Souji turns into a girl, Aika has a flat chest, Twoearle lost her twin-tails, and Erina acts elegant. Even Dark Grasper maintains a cool and evil persona that masks her reserved and awkward self. The purpose of the characters, then, is to bring to light the idea that anime is currently in a state of self-denial. It's in a predicament where it doesn't fully know what it wants to be: forced \"moe,\" extravagant fan-service, and generic adaptations have become the norm, not because anime necessarily wants it to be that way but because it can't be any other way. It may want to escape from the corner it has backed itself into, but such radical changes require extraordinary happenings.\\n\\n\r\nSOUND\\n\\n\r\nThe OP starts very light and jumpy, with guitar and piano playing in harmony. The song picks up half-way, with the vocalist singing along well with the beat presented. It contains a strange break where the song loses tempo, but ends on a nice guitar solo.\\n\\n\r\nThe ED is actually pretty good. It's quite catchy, with the vocalists singing individually and in unison. The beat and guitar pick up halfway through once again, with the guitar and drums working together to make it a nice little jam. Again, the song ends on a fun little guitar riff.\\n\\n\r\nThe soundtrack contains typical pieces: triumphant arrangements, happy-go-lucky beats, and violin, choir-singing tracks for those tense moments. Nothing original, but they work well in their respective moments.\\n\\n\r\nVoice-acting sees average to above average work across the board. A special shout-out to Maaya Uchida as Twoearle, Sumire Uesaka as TailRed, and Chinatsu Akasaki as Erina.\\n\\n\r\nOne last time, we need to put on our \"read between the lines\" glasses. Does the sound-work follow the same trends as everything before it? Of note are the opening and ending songs: both are generic, both contain nonsensical lyrics, and both follow the same song pattern. Twintails, then, is aiming to show that music within anime has become a breeding ground for ridiculousness and unoriginality. Just trying to be catchy, with the slow build-up followed by the song picking up in the middle, is easy; it's a cheap trick that many shows employ, because it works.\\n\\n\r\nENJOYMENT\\n\\n\r\nAt this point, I need to present a question I brought up in one of my earlier works: at what point do my analyses go from being interpretations of what the anime was doing to trying to justify and look for answers? I'd like to think that the show was more than just a bunch of twin-tailed girls flying around. I want to believe that some of what I've said is correct. After all, there is evidence for a lot of it. Sure, the \"Animation\" and \"Sound\" ones are rather weak (I fully admit that), but there is logic behind those from \"Story\" and \"Characters.\"\\n\\n\r\nIt's a difficult dilemma, because where does one put his or her foot down, where does one draw that line in the sand that says, \"Up to here is what they meant, and no more.\" Does that line exist right from the get-go, or does it appear somewhere in the middle? I'd hope that it's the latter.\\n\\n\r\nFor something like Ore, Twintails ni Narimasu, it will be seen by many as just another random show that only anime can pull off. But behind the twin-tails lies a satirical work that challenges what anime currently offers, even if the execution isn't fully apparent.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, parody, repetition with purpose, thematic\\n\\n\r\nAnimation: Bad, bland art style, okay character designs, low actual animation\\n\\n\r\nCharacters: Good, TailRed, TailBlue, TailYellow, and Twoearle represent more literally and figuratively\\n\\n\r\nSound: Fine, okay OP, good ED, okay soundtrack, average VA work\\n\\n\r\nEnjoyment: Good, a hidden satire\\n\\n\r\nFinal Score: 5/10",
            "date": "2014-12-30T12:11:00+00:00",
            "helpful_count": 18,
            "mal_id": 175229,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=175229"
        },
        {
            "content": "I may have marked my list for this pathetic anime, but in really I just skimmed it.\r\nSO DON'T EVEN GET ME STARTED!!!!!!\r\nStory: Pathetic 1.\r\nTbh, as I've started watching this anime up to episode 7, from with all the boring battle where the result is obvious, I've started to skimmed it up to episode 12, So Why the FUCK! Ok, first of all it uses an already overused plot of inter-dimensional beings out to invade earth, second, it has FETISH!!!!!!!!!!!!Written all over it and those so called \"Twintail Attributes\" was obviously a euphemism for \"PIG TAIL FETISH!!!!!!!!!!!\"And that is why   Kenzen Robo Daimidaler isa top recommendation for this anime since they were both based on sexual innuendo except the latter was very brazen about it ,while this anime was more like making something look innocent. But seriously why did studio \"FUNnimation\" even thought of making such anime that has a compensates it's FETISH based theme with a lot of monologues ? Fuck, if I can go to Japan right now, I'd be going over studio   FUNimation  and punch the Executive Producer Fukunaga Gen in the face for not picking other manga with sense for an anime adaptation.\\n\\n\\n\r\nArt:  Very Good 8.\\n\\n\r\nThe rating is for Shindo Erina in her Tail Yellow suit, Twoearle since she is my kind of eye candy in this anime and Dark Grasper since I do have a thing for bikini girls in glasses.\\n\\n\r\nSound: Mediocre 5.\\n\\n\r\nCo'z I just have no comment in this part, but I do like the opening theme.\\n\\n\\n\r\nCharacter: Dreadful 2.\\n\\n\r\nYou, know, this is one of those anime where, the bad guys are more lovable than the good guys, thought I would have rate this part a 7, well, the fact is that them bad guys just come and go, also their monologue just infuriates me. So so what about the other characters? Reason number 1 for my score.\\n\\n\r\n Mitsuka Souji- In this anime/manga he....or she embody's a typical gender bender in this anime, where he's kinda of a metaphor for  every closet gay's desire kinda thing. I mean, where can you find such character who can be a girl in an instant? Only in this anime, basically he was just a typical harem gay who- as usual was oblivious of his childhood friend's feelings for him.  What makes me hater his/her character very much was his love for twintails, or let's cut the crap FETISH for twintails where at time I'm begging to think that because he can transform into \"Tail Red\" that he is a narcissist who is in love with his alter ego as a Tail Red a girl. IMAO, his defense for twin tail attributes makes me wanna kill him.  Reason number 2 for my score.\\n\\n\r\nShindo Erina- As tail yellow, she is another girl with a fetish for wanting to make love to a hero, where just like Souji, has the capability of loving herself in a sexual manner, since she is tail yellow anyways. Reason number 3 for my score.\\n\\n\r\nTsube Aika- Ok, frankly she was the only normal character around here, and as always no harem is complete without a childhood friend. Then again, whether we like to admit it or not she is the sadist in this anime, only, story writer, Mizusawa, Yume, had her toned down. She is reason number 4 for my score.\\n\\n\r\n Twoearle- What can I say, she is the quintessential bimbo in Souji's harem, however, she is a toned downed MILF.  \\n\\n\r\n Anko \"Dark Grasper\" Iisuna- I kinda hate that she wasn't made to follow through with her goal of eliminating those twin tail trios. And just like everyone else, she has a glasses fetish and she is the  last nail in the coffin where I gave this part a low score. \\n\\n\\n\r\nEnjoyment: Dreadful 2.\\n\\n\r\nJust don't ask and don't even get me started.\\n\\n\\n\r\nOverall: Pathetic 1.\\n\\n\r\nDefinitely an anime for people with fetish and a certified PTW.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-12-26T12:19:00+00:00",
            "helpful_count": 14,
            "mal_id": 174391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=174391"
        },
        {
            "content": "Twin Tails is an anime about embracing all the things in the world that you love with all your heart and soul no matter how random or strange they might be to other people. \r\nYes the over all idea behind it is to embrace twin tails and at first I did not really get into the anime because even though I do like twin tails on girls I'm not super obsessed with them but the idea is not so much the twin tails but its more so about embracing something that's different from the norm. \r\nAside from the twin tail girls themselves this anime presentsthese perverted Otaku like lizards who express there own fetishes for certain things they love and these fetishes tend to be really out there and strange like one lizard is like me and embraces the idea of legs and getting stepped on by girls. Another lizard might be obsessed with gender bender guy girls or something just really random or strange. \\n\\n\r\nIn all honestly all the villains though portrayed as evil are really noting more than just obsessive Otaku goof balls that just have strange fetishes that there very passionate about and want to express to others.\\n\\n\r\nIts no different than being a real life Otaku being obsessed with anime and buying all the merchandise you can on it or having a strange sexual fetish that while strange is still something you love and want to embrace with all your heart and also tell people about.\\n\\n\r\nJust think of something you yourself love that most view as strange and think about how much you love it anyway and want to express that love with all your heart that's what this anime is about\\n\\n\r\nThis is also a story that was created to look like a magical girl action anime but if you go into not understanding the true purpose and intent behind it you will not enjoy it and this is why many people who watch this anime come out of it not thinking its any good because they totally miss the point that's why I'm taking the time to express all this to guys so you can hopefully watch this anime with an open mind.\\n\\n\r\nThis anime is meant to take a bunch of strange hobbies and fetishes to the absolute extreme and using this concept the creator also made a really fun story out of it that's not meant to be taken to seriously. \\n\\n\r\nSo even if it looks like its meant to be a magical girl action series with transformations and evil villains don't let yourself be fooled.\\n\\n\r\nIt can honestly be soooo much fun to watch going into it with the proper mind set.\\n\\n\r\nLike for me one thing I really like about this anime is I imagine the person who created it had an obsessive love for twin tails on girls mainly from like anime or video game type girls and despite some people looking down on this fetish thinking its stupid or that there's no point to it he was able to turn this random passion of his into something creative in the form of a light novel that then turned into his job that then became an anime that is most likely entertaining tons of people world wide and inspiring them to embrace there weroid fetishes without shame despite what the others say about what they like. \\n\\n\r\nHe's taking a strange passion in his love of twin tails along with other random fetishes and crafting a story in a way where its all about embracing what you love in the mostly overly obsessed way possible \\n\\n\r\n loving twin tails themselves is not the point nor it that required to love this anime.\\n\\n\r\nJust understanding the intent behind it is enough which is embracing something that is out there and weroid not the twin tails themselves\\n\\n\r\nI can totally feel the authors passion for something he loves and admire that he was able to make a story centered around what his passion is cause plenty of people have a passion for something but don't show it for fear of getting judged.\\n\\n\r\nI also think this mans example and intent with the story is to say no matter what type of passion a person has in the world you can make something constructive with it regardless of what other people say you just have to have the confidence to embrace it and express it with all your heart and something great could come of it like this man and his random story about twin tails and other fetishes. \\n\\n\r\nSo if you do watch this anime hopefully your able to take in all the things I mentioned and hopfully this can also inspire you to embrace the things you love and express them without shame and do something with that passion like create a book or draw pictures of it or make videos regarding it and it could turn into a job or just some amazing creative art that has your signature on it.\\n\\n\r\nI imagine if this guy talked about his love of twin tails to people in his real life and everyone looked at him thinking that is such a stupid thing to be obsessed over just like how someone can say anime is stupid to be obsessed over cause there just cartoons but you and I know differently \\n\\n\r\nHe totally ignored any possible criticism he might have gotten and took what he loved which was twin tails and as randomly as it was he created a world for it to be appreciated and expressed and made it into his job and shared that same passion with people all over the world to be entertained by it and also to be inspired to embrace there own fetishes because as I mentioned its not just about twin tails but tons of other fetishes are explored and embraced by other characters so if you have a strange fetish there is a chance it will be highlighted and embraced by one of the characters in the show cause this anime is about embracing what you love no matter how random, strange or weroid not about twin tails even though that happens to be the authors fetishes but its more about embracing something you love with all your heart despite everything.\\n\\n\r\nAnother thing I love about this anime is the way they introduce the whole harem concept. cause Its done in a way that's more realistic than most.\\n\\n\r\nLike the mother is obsessed and open to the idea of her son actually getting teoghter with other women and the friend I mentioned watching the anime with connected this to the idea of japan's declining birth rate that's going on in real life.\\n\\n\r\nSo if you take that perspective into account it would make since for a Japanese mother to push for her son to be with be with another women and want to get him married off as soon as possible because for the sake of japan's decline birth rate and lack of people getting teoghter.\\n\\n\r\nI'm assuming you know the story behind this btw if you don't then I suppose I'm explaining this part for noting but if your aware of japan's issue when it comes to people getting married and having children the if you watch the anime and see the overly nice mother pushing her son to get married to other women just think about it from that perspective and the harem becomes realistic and fun.\\n\\n\r\nAnyways I hope this reviewed helped to want to get you into twintails and also helps you to follow your passion in life and embrace it with all your heart no matter what\\n",
            "date": "2018-01-10T07:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 268110,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3605505.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mami-Sexual",
                "username": "Mami-Sexual"
            },
            "url": "https://myanimelist.net/reviews.php?id=268110"
        },
        {
            "content": "I’m glad this exists, but I’m not sure if it’s as good as it should’ve been. I do agree with the main character about twintails. It’s a beautiful hairstyle. Sadly, the anime connected to it is less than stellar. What is this? A celebration of fetishes? A satire of it? Is it making fun, laughing with me or all of the above? Why are last episodes so generic?\r\nYou’d think that a genre as overflowing as Harem would lead to tighly-focused anime. You have so many shows to learn from and yet the anime is still a confused mess. If it were just cliched, fine. Haganaiwas also cliche but at least it had focus. Twintails is too busy being confused over its genre to settle for a direction.\\n\\n\r\nThe obvious point of comparison is Date A Live. That underrated anime, while not amazing, was still a unique harem. It had a weird premise that turned the Action on its head and gave a new context for the Harem aspects.\\n\\n\r\nThe premise of Twintails doesn’t actually add anything. Our hero transforms into a girl and the enemies give big speeches about their favorite fetish. Every episode concludes with a lightshow and characters giving their attacks pet names. Thankfully we never get insight into how the battle system actually works – it wouldn’t make the lightshow any less dull.\\n\\n\r\nBeyond the speeches and the fact our heroes all have twintails, the story is derivative and common. The creators clearly didn’t want just another story, but their attempts at turning the fetishes into plot points fail. Most of the time it’s just creepy fetishism. Borrowing the Hero’s Honor bullshit from JoJo doesn’t make your anime more diverse. It only highlights how confused the creators were. What does macho bullshit have to with twintails and harems?\\n\\n\r\nIt all ends with a big fight draped in red and black. The hero is full of doubts, about to lose the fight because they don’t have faith. Then suddenly he has an encounter outside of time. A figure speaks to him in a vision and he regains his love, screams the attack name and defeats the enemy. After that we see everyone going to school like nothing happened, with tsundere beating up the big-breasted girl as always.\\n\\n\r\nAgain, what does this has to do with, well, anything?\\n\\n\r\nThe whole structure is a mess, and it can’t be saved. None of the ingridients are worthwhile unless you focus on them. Heroic stories are a common template and fetish stories often sexually harass the audience. The anime at least doesn’t go too far in what in subjects the audience. Anyone looking for juicy screenshots will be disappointed. Still, even a messy plot can survive if the characters are good enough.\\n\\n\r\nEven there the series fails, despite trying hard. Everyone is exaggerated and our main character, for a chance, has a personality. Although it’s not much, being an obsessive over something is definitely progress over typical heroism. In fact, there’s a specific moment where the MC reveals he’s driven more by his selfish obsession than saving the world. For a change, our Harem MC isn’t just a convenient moral compass.\\n\\n\r\nToo bad everyone around him is an exagerrated archetype. If the creators could imagine funny situations in which these archetypes are effective, fine. How many times can the flat-chested childhood friend beat up the big-breasted new girl? There’s no difference between each time it happens. Twoearle makes something sexual and Aika beats her up.\\n\\n\r\nThe line between failures like these and successes like Neptunia are blurry. Both rely on silly archetypes, but Neptunia has wilder situations. Its archetypes are more well-thought out. They don’t govern just the funny situations but every aspect of the character lives. Here the quirks only rear their heads when it’s time to beat up the perverted girl. At some point, it becomes characters abuse. When your Harem comedy resembles Saw in its treatment of characters, something is wrong.\\n\\n\r\nEven the visual design doesn’t rescue it. Shows like this are an example why sexy character design is a positive thing. Although all the girls are meant to be pretty, nothing about their design is interesting. Twoearle is closest thing to a good visual idea. Although twintails are an awesome hairstyle, the show does nothing with it. Generic big eyes are all you have left. The battle suits are also typical pieces of metal stuck on bodies. The enemies are equally just blobs of metal, a macho mess inspired by an animal but no different than a Transformer\\n\\n\r\nThe series starts off being some fun and the concept is ridiculous enough. This is another case where a Harem anime doesn’t take advantage of its silly premise. What’s disappointing in these anime is that they’re never as outlandish as they promise. In the end, this isn’t a story about how glorious twintails are. It’s just another anime with heroes in dull outfits who shout attack names and beats blobs of metal.\\n\\n\r\n2 twintails out of 5",
            "date": "2016-07-08T13:22:00+00:00",
            "helpful_count": 8,
            "mal_id": 223503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4632480.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheBrainintheJar",
                "username": "TheBrainintheJar"
            },
            "url": "https://myanimelist.net/reviews.php?id=223503"
        },
        {
            "content": "Haha, this review is a little late. I kept up with this show all the way through til the end. Screw Christmas, the finale of this show coming out was better. \r\nStory: 8/10\r\nThis is either something you really love or really hate. The mistake people make is taking this show seriously. THIS SHOW IS A PARODY. It's just a little something to make people laugh and see all the flaws in anime. \r\nHowever, the story in itself is original and intriguing. I see it as a \"magical girl meets superhero\" type of show, with much better villains. I also love all the twintails! Who doesn't?I think that the plot was thought out pretty well and wasn't ever ruined. I never found myself thinking \"Hey, where did the plot go?\". \\n\\n\r\nArt: 9/10\\n\r\nIt is very cute and pretty. I quite like the style and how each character is drawn to match their personality. The animation is pretty good too, with few flaws that I noticed. TailRed is especially cute! \\n\\n\r\nSound: 7/10\\n\r\nIt isn't bad at all, but it's just not anything special or memorable. The opening and ending themes were great, but I barely remember anything about the VAs or the BGM, which proves my point. It's been only around four and a half months and I don't remember anything, but even after two years or so I can remember the music that goes to \"Fruits Basket\". \\n\\n\r\nCharacters: 5/10 \\n\r\nThe characters are the weak part of this show. Perverted scientist, tsundere childhood friend, masochist student council president, not too special but also perverted protagonist...sound familiar? Of course it does. They're all so cliché, and that kind of killed it for me. I really liked the side characters, though. Souji's mom, Dark Grasper, and all the other villains were great. \\n\\n\r\nEnjoyment: 8/10\\n\r\nYeah, I found this show quite entertaining! It was fun to watch and made me laugh a few times.\\n\\n\r\nOverall: 7.4, rounding down to 7/10\\n\\n\r\nSorry for such a short review! If you like parody anime, twintails, or both, you should watch this show!\\n\\n\\n",
            "date": "2015-05-07T12:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 187320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4475792.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lowlifeloveliver",
                "username": "lowlifeloveliver"
            },
            "url": "https://myanimelist.net/reviews.php?id=187320"
        },
        {
            "content": "Ore, Twintails ni Narimasu ~6~ \r\nSo ~ the end of this anime season is approaching and I find myself, once again, trying to come up with reasonable ratings for the various anime which I followed over the past months.\r\n~ Unsafeman121 Dec 2014\r\n~Plot~\r\n~6~\r\nThough weak, I have to give this anime credit for having a plot and following through on it for the entirety of the anime as opposed to dropping it half-way through as I have seen some others do. Though not too impressive, the plot does improve slightly as the anime progresses. Although not brilliant, the plot did change my view of the anime makingit slightly positive as opposed to slightly negative. The last few episodes really up it a little bit and it does intrigue you a little bit more due to a barrier which needs to be overcome.\\n\\n\r\n~Sound~\\n\r\n~7~\\n\\n\r\nI enjoyed the OP and ED of this anime ~ the ED I would even consider possibly downloading. The character voices suited their respective characters and so I believe the voice actors were well suited to the roles which they each played.\\n\\n\r\n~Visuals~\\n\r\n~6~\\n\\n\r\nI found the graphical style of this anime to be pleasing, though possible slightly below that of many others I have seen ~ that being said it is still enough for it to gain a positive rating of 6. There wasn't anything in particular which I disliked about it, but there are areas where I feel it could have been cleaned up slightly. The action scenes were well drawn.\\n\\n\r\n~Character~\\n\r\n~5~\\n\\n\r\nI feel that the characters are one of the weaker points in the anime. I did not feel like I was able to get to know any of them particularly well (to the extent which is achievable in a single series anime). I did not dislike the character design, though there wasn't anything which made me specifically like them.\\n\\n\r\n~Enjoyment~\\n\r\n~5~\\n\r\nI didn't not enjoy the first episode very much, and I have to say that I'm pleased I started to enjoy the anime more as I went along. That being said, I do not believe it is one that has particularly shone for me, and there wasn't too much excitement when I saw that the next episode had been released.\\n\\n\r\n~Overall~\\n\r\n~6~\\n\\n\r\n\"Though still enjoyable to watch, it was sub-par in my opinion.\"\\n\\n\r\nIt is safe to say that many people will criticize this anime on some of its \"questionable\" natures, however this is not something that bothers me at all, there are many different anime with questionable themes, and lots of them i have still enjoyed thoroughly. Sadly I do not find that is the case with this anime. That is not to say I didn't enjoy watching that anime, but I felt the of the anime which I have given a positive rating to, this is definitely on the lower end of the scale.\\n\\n\r\nFor those who are interested ~ Ranking Progression:\\n\r\nThis is where I show the changes (if any) in my overall rating as the anime progressed, I review my ratings every 4 episodes ~ though if one does stand out for me I will also mention it.\\n\\n\r\nE01: 4\\n\r\nE04: 5 (Rated up 1)\\n\r\nE08: 6 (Rated up 1)\\n\r\nE12: 6",
            "date": "2015-01-02T10:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 175759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2904965.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Unsafeman121",
                "username": "Unsafeman121"
            },
            "url": "https://myanimelist.net/reviews.php?id=175759"
        },
        {
            "content": "You either die the comedian or you ride the joke long enough to be the reason everyone cringes. This show unfortunately become the latter.\r\nThe story is best under stood when explained by the loony tunes Tasmanian Devil while on acid during a roller coast ride that breaks down half way through. While its reasoning to be a super hero anime, is beyond mind comprehending other than having a reason to put in as many obscure fetishes into a show as possible, it does however at least keep the basis of a 'superhero' type anime. Good guy is winning, bad guy gets stronger, good guy startsto doubt, divine intervention and back to ass kicking, etc\\n\\n\r\nWhen you start to give more attention to detail on the shows fanservice suits and insane amount of fetishes, it becomes something a little difficult to watch. While bearable at first, it gets very noticeable about half way through of how little care they put into the actual faces of both the MC's and secondary characters alike. The colors are similar to that of a childrens superhero show in that all the good guys are bright colored while the villains are almost always dark, gloomy and obsessed with stealing/destroying something on the earth\\n\\n\r\nMusic holds a rather high point about this anime though as not one is it a dull or misused moment with sound effects or BGM. The sound is the one thing that makes the action scenes somewhat captivating and not making you turn off your computer and burning your eyes for the fact of it seems more entertaining at the time.\\n\\n\r\nCharacter development does happen, however... odd it is. Every new development is another strange addition to the characters profile. Most villains never last more than one episode and the process is rinsed and repeated every new installment. Apart from that one lesbian character that was relevant for all of 3 episodes. That was a record secondary character introduction for this anime.\\n\\n\r\nEnjoyment and humor was super high from the get go. The sheer \"wtf\" of this keeps you laughing enough to want to see how stupider it can get. Until however by about episode 9 or 10 it gets old and boring when they harp on about the same jokes expecting more laughs and you just want it over with. When you think something enjoyable or close to normal is happening, it takes a turn and leaves you back in the corner of shame for even thinking it would do such a thing.",
            "date": "2015-01-28T18:05:00+00:00",
            "helpful_count": 7,
            "mal_id": 179150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=179150"
        },
        {
            "content": "Ore, Twintail ni Narimasu. Simply to say, super sentai (origin of power rangers). No, I'm serious. Maybe. Maybe not.\r\nBut the style of having three super powered girls reminded me of it. Not to mention, they're able to merge their weapons together. (Sorry for the semi-spoiler.) Now here's a bit of a twist. One of the girls is a twin-tail lover whose a guy. One thing I didn't like about this fact is that one guy (aka Souji) with a bunch of girls equals harem (a small one but nonetheless a harem). \r\nOne more twist is, the anime is not about protecting humanity. It's about protectinghumanity's love of twin-tails. It was something new to me, something I haven't seen before. An anime revolved around the power of twin-tails. \\n\\n\r\nThe story-line is very straightforward and generic. If you have watched Super Sentai/Power Rangers, the story-line goes about the same. Defeating one enemy every episode till you reach the final boss. However, the comedy I received was enough to make up for its lack of original plot.\\n\\n\r\nThe art is very much mediocre for its generation, meaning it is still very appealing for people to watch.\\n\\n\r\nThe music, I must say, is fantastic. The OP and ED are great to listen to, especially the ED. The music within the episodes are mind-blowing to me. Probably because one of Fairy Tail's composer, Takanashi Yasaharu composed much of the music for Ore, Twintail ni Narimasu. (I am not sure how much he actually composed though.)\\n\\n\r\nCharacter development is okay. The anime builds up their character from the present story-line, rather than give backstory. However, this does not take any enjoyment from this anime away from me.\\n\\n\r\nWhile not exactly at the top of its season, it is still a phenomenal anime to watch. Also, I don't recommend the anime to people who shy away from sexual parts. Ore, Twintail ni Narimasu hints at sexual references and shows sexual scenes.\\n\\n",
            "date": "2016-02-11T08:45:00+00:00",
            "helpful_count": 7,
            "mal_id": 210664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1855092.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Meyneth",
                "username": "Meyneth"
            },
            "url": "https://myanimelist.net/reviews.php?id=210664"
        },
        {
            "content": "Here's a lesson/warning to all my fellow otakus.  Don't ever listen to what your friends tell you to watch.  Cause when you do, you end up watching stuff like this.\r\nFetishes.  Things that appeal to one's preference in a sort of sensual matter.  We all have our tastes and things that pertain to us, in which we find attractive and pleasing.  But when you make an anime surrounded by that idea...yeah, it can get pretty weird.  Here's Ore, Twintails ni Narimasu, or, in accordance to Funimation's dubbing, \"Gonna be a Twintails!\"  (Oh god, why.)\r\nStory (6.00/10): To be honest, theshow's story is quite bland.  Mitsuki Souji, our main protagonist loves the twintail hairstyle.  When I mean loves the style, I mean LOVES the style.  It's to the point that he devotes his time to admiring them and even made his tsundere totally not in love with him childhood friend wear them as her natural hairstyle.  One day, a mysterious woman by the name of Twoearle drops down and tells him that the fate of twintails is in danger, leading him to become a twintail himself and protect twintails with his very life!\\n\\n\r\nI don't think I really need to go into just how absurd this story is, because it really sorta speaks for itself.  What really makes the story bland is the way that it's structured.  From episode to episode, you basically get the same cookie-cutter style of storytelling that the Mighty Morphin Power rangers have done for the last 20 years.  A single bad guy and maybe a hoard of disposable minions descends onto the planet with powers unique only to them, the good guys come in to stop them from spreading their evil power over the land to stop terrorizing people, they fight hand-to-hand, usually ending in failure, before bringing out their big guns, before destroying their enemy the exact same way every time.  (This show is basically Power rangers with skimpier clothing, and all the villains have anime-related fetishes.)  With a story like this, the show really becomes nothing more than a snoozefest because there's really not much variation from episode to episode.\\n\\n\r\nThat being said though, the show does diverge a little bit in its story by adding some background to the mysterious Twoearle, as well as making a new focus for its plotline for the second half of the show.  While these attempts to make the show interesting were admirable, it still follows its \"Oh!  A bad guy!  *fights*  Doesn't work!  *Uses ultimate attack*  Yeah! We beat him!\" style of storytelling for basically every epiosde.  \\n\\n\r\nThe comedy for the show is subjective at best, trying very hard to be funny with its use of sexual innuendo mostly thanks to Twoearle being the horny girl she is.  You may get a couple laughs out of this show in addition to the many regrets you may tally when watching this, but there's really nothing memorable I would say about this.  That being said, make sure you watch this show ALONE with the door closed.  You do not want anyone stepping in when you watch this.\\n\\n\r\nOverall, Twintails was...interesting for a storyline to say the least.  The actual way that they delivered the plot was boring to all hell, with the same technique being used over and over and over again like a broken record.  But because this show did have a unique story concept of which is obvious why it was never done before, I guess it gets a good mark for it?\\n\\n\r\nOverview:\\n\r\n+/-  Interesting story idea?\\n\r\n+/-  Subjective comedy  (It's mostly just over the top sexual innuendos)\\n\r\n-      Stale storytelling\\n\r\n-     It's honestly kinda awkward to watch.\\n\\n\r\nCharacters (5.44/10):  Can...can you even call these characters?  The cast of Twintails is...interesting, and I use that word very questionably.\\n\\n\r\nFirst we have Mitsuki Souji.  This guy loves twintails.  Yep, that's it.  That's all of his character traits.  In the series, Souji is our main protagonist, aka TailRed, as he is known.  Above liking twintails, there's not really much to know about him other than the fact that he cares solely for twintails and the many variations that they come in, even going to the extent of proposing for a twintails club at school because reasons. \\n\\n\r\nAnd then we have Tsube Aika, aka TailBlue, aka the \"tsundere childhood friend who has a bust complex\" because we totally haven't seen that before.  (Reference 75% of Rei Kugumiya's work here)  Similar to Souji, that's pretty much all you get for her aside from the fact that she's the violent type who can beat the shit out of a gorilla, and still win.  She's not a bad character per say, similar to all the others, but there's not really much to them since you don't really get to know these characters on account of the show saying the word \"Twintails\" every 10 seconds.\\n\\n\r\nThen, Twoearle.  Oh, twoearle, twoearle.  Twoearle is the only character that really gets any sort of backstory or semi-focus in this series because of her past and all this jazz that the series pulls.  Apart from maybe like two or three moments in the series, Twoearle is that busty girl character who's so horny that she will not hesitate to rape you in your sleep.  Five times.  Again, not really much to her since this show doesn't really give a crap about its characters.\\n\\n\r\nAnd finally, we have Erina, aka TailYellow, who is that sweet little rich girl without any common sense as to what things are on account of being raised without knowledge of certain things.  Oh yeah, and she's also a masochist.  Go figure.  You get one episode to know about her, and that's it.  \\n\\n\r\nAnd now the real characters that I wanted to talk about, the Utilmagil, aka the fetish aliens.  These lot are a real piece of work.  Every one of these antagonists is focused on one thing, which is defeating the twintails.  In addition, every single one of them has a personal fetish that they hold dear like it's their lives, which honestly is kinda true on account of the fact that these guys last like 20 minutes tops per episode.\\n\\n\r\nOverall, the characters, all of them, ranging from major to minor, all have one thing in common.  They all have a fetish to strive for, and desires that some would say is best to keep to themselves.  There is really no development from character to character as the moment you get to know what their tastes in hairstyle/body shape/obscure features like the back of the neck, you'll know their entire character 100%.\\n\\n\r\nOverview:\\n\r\n+/-  They're easy to understand?\\n\\n\r\nArt and Sound (7.44/10 and 6.44/10): The art for the series is pretty standard.  There isn't really too much standout at face value, and the art really just does its job at being a pretty picture to look at with its bright colors.\\n\\n\r\nThat being said though, the character designs are actually relatively well-detailed.  The characters both good and bad have a good chunk of detail to them and would make an otherwise ordinary show, look a bit better.  However, it's also important to keep in mind that the show also uses subjective imagery, and make certain situations a little bit more perverted than they actually are.\\n\\n\r\nThe soundtrack is generic and ordinary.  Not bad, but not fantastic.  It's skippable.  Trust me, it's honestly not even worth your time.  \\n\\n\r\nOverview:\\n\r\n+  Good detail on characters\\n\r\n+/-  Meh artwork\\n\r\n+/-  Meh soundtrack\\n\\n\r\nOverall Enjoyment (6.66/10):  Twintails...well...I guess you could say the feeling of this show is sorta unexplainable for me.  While watching the show, I honestly despised it cause every minute I spent watching it was every minute of regret adding to my life, but after finishing the episode, I wasn't hesitant to continue watching it more, even going to the extent of finishing the series.  To say I hate this show is a stretch, but then again, saying I like it is also a stretch too.\\n\\n\r\nDid I like this show?\\n\\n\r\nUm...Well...I'm not really sure.  I watched it, even becoming somewhat addicted to it by watching five episodes in one go when I said I was only going to watch one, but I don't like the storyline.  It's...weird to describe it.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nFrom a technical standpoint, the show has bland pretty much everything, all except its core story idea of twintails (since the way this idea was handled made the show almost unexplainable as to what the hell it actually was).  As a personal standpoint, I'm not really sure what to hate because I'm honestly stunned as to what I should say about this.  (I legitimately cannot find words to accurately describe my feelings for this show.)\\n\\n\r\nWould I recommend this to anyone?\\n\\n\r\nI personally wouldn't recommend it on account of just how weird and strange this show is, as well as the effect that it had on me.  But honestly, this show is, to put in simple terms, an experience.  So, if you want an \"experience\", I'd put this near FLCL, as it has a similar feeling of \"What the fuck did I just watch\" like this show.  Never have I thought in my life that I would watch Super Slutty Power rangers, and I'm not really sure how to react.\\n\\n\r\nAuthor's note:  I don't get how this show isn't tagged as gender-bender.  The only guy in the show spends more screentime as a fucking girl than he does his own gender.\\n\\n\r\nOverall Score: 6.00/10",
            "date": "2014-12-27T19:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 174655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=174655"
        },
        {
            "content": "We are in a day and age where anime is getting better since it's been around since the '60s, and I think anime has gotten better. This is one of those animes. I discovered this anime after watching two terrible anime and wanted something good to watch. The first episode was free on iTunes and so I was like hey, why the hell not? After the first few minutes, I was hooked. This anime is extremely underrated, but don't let that stop you. It's a genius, original piece of work that is the greatest anime of all time.\r\nSoji is new to high school and realizesthat he loves it because a lot of the girls have twintail, which is his obsession/fetish. He even goes as far to try to make a club about twintails. When walking home with his friend, they come across a girl named Twoearle who claims that twintails are in danger from Emilians, evil lizards obsessed with finding the perfect twintail. In order to save all twintails, he must put on a transformation bracelet to turn into a twintailed hero to destroy the emilians. Only one problem, he turns into a girl. \\n\\n\r\nThe story evolves smoothly, the characters brilliantly hilarious and the art and soundtrack are gorgeous. It's only 12 episodes, but its worth your time and might even be one of the greatest things you have ever watched ever",
            "date": "2016-10-20T22:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 232220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4978604.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/yuriinsomnia",
                "username": "yuriinsomnia"
            },
            "url": "https://myanimelist.net/reviews.php?id=232220"
        },
        {
            "content": "It started great but later on tailred just kept getting subdued and the other two twin tails had to do all the work. plus there wasn’t much consistency. like when enemies appeared in the first episodes, they had the follower guys. then in later episodes it was just the bad guy. overall, don't put much time into it, although it is worth watching once. it had some nice aspects of the ecchi but overall wasnt too much of a focus. in the beginning it was heavily focused on the exposition, which is like, ok we get it, but it's a lot like saban's power rangers.Except this one is cartoon and for older audiences",
            "date": "2017-12-03T14:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 264453,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6778031.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/magicshadow818",
                "username": "magicshadow818"
            },
            "url": "https://myanimelist.net/reviews.php?id=264453"
        },
        {
            "content": "\"Gonna be the Twin Tail!\" \r\nTwintails is a quirky harem/slice of life/magical girl/fan service anime about a boy who super loves girls who wear their hair in twin tails. When earth comes under attack, he is granted the power to transform into Tail-red, a red armored girl with super long twintails.\r\nAs they defend earth from monsters with a strange range of questionable (but never outright sexual or rated r) fetishes, such as pictures of girls with dolls, bathing suits, or girls in glasses, the show becomes amusingly absurd in how serious it takes the subject matter of believing in the power of your hairstyle. \r\nItruly enjoyed this series. It's difficult, relying on the subtitles and wondering if the authors intent has been skewed, but I feel like it's got a Monty-Python-esque level of self-respect for it's own ridiculousness.\\n\\n\r\nThe animation, especially near the end of the series, is as good as any I've seen. The color-explosion is extreme, the animation is incredibly smooth, and the music is great. There's only a few times where an animation is recycled, but it looks good enough it's worth seeing again. \\n\\n\r\nThe characters are good too. Tail-blue is a good enough tsundere / comic relief, and the sexual deviance of their strange mentor is pretty funny. Tail-reds moms encouragement of these different girls to seduce her boy is a nice touch, and not commonly seen. \\n\\n\r\nIn the end, you could substitute hairstyles for any number of things, and the message is the same. Whether you are obsessed with girls with twintails, playing nerd games, or doing algebra, it's about accepting that you are you and your proud of your skills, even if it's something silly.\\n\\n\r\nI liked the message, the animation is great, and the show is generally funny and filled with some great anime tropes. I recommend watching it, it's free on Hulu. (Don't need +!)\\n",
            "date": "2016-06-06T14:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 220140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5458503.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Thunderfrog",
                "username": "Thunderfrog"
            },
            "url": "https://myanimelist.net/reviews.php?id=220140"
        },
        {
            "content": "I sometimes wonder if an anime that falls just short of being a masterpiece is worse than a true stinker.  Ore, Twintail ni Narimasu is one missed opportunity short of greatness.  While the production values are not particularly high, it has the rare courage to take an outrageous idea and just go for it.  It starts out with great setup but a rather routine monster-of-the-week plot.  But then the story takes progressive turns into ever more daringly deviant territory.  And then it misses the mark in the last two episodes.  I thought it would zig but instead it zagged.Despite this, if you are a fan of gender-bender anime, this one is worth the watch, if only to spark your imagination regarding what could have been.\\n\\n\r\nSpeaking of what could have been, when I was a kid, I experimented with cross-dressing a couple of times and I was surprised at how gorgeous I looked in the mirror.  For most people, their gender is a huge part of their identity but for me it's just a shell we take on to interact with others.  Since I'm probably unusually detached to gender roles, naturally I was curious about what women's lives were like.\\n\\n\r\nOn an even further side note, I have a tiny daughter now, and she looks just  like I did when I was little.  People literally stop to stare at how cute she is.  She causes a stir everywhere she goes with strangers fawning over her.  So maybe from a genetic perspective that question is answered.\\n\\n\r\nHow is this relevant to \"Gonna be Twin Tails\"?  Well, this is a gender-bender anime, and the target audience is probably kind of small.  It's significant for anyone who has ever wanted to be able to change gender, even if only on a temporary basis, just to see what it would be like.  It even has a scene where our main character, Soji, sequesters himself in the bathroom so he can transform into his girl self and... examine himself (herself?) more closely.  It's got a hilarious twist exactly appropriate for the theme of the show.  As an example of great dialogue, his childhood friend is watching from a hidden camera and asks, \"I can't watch, but I kind of want to.\"\\n\\n\r\nSoji, the main character, is a guy in high school who REALLY loves pig tails, or \"Twin Tails\" as the Japanese apparently refer to the hair style.  An alien comes to Earth to save us from a third invading alien race out to get our \"Twin Tail\" attribute.  The anime knows how silly this is, and uses it only to set up increasingly deviant fetishes of aliens who seek something very specific, such as having little girls hold dolls.  This anime doesn't hold back; a number of popular and embarrassing fetishes are paraded before the audience, and this anime plays them to the hilt.\\n\\n\r\nYou see, the nice alien lady offers Soji a bracelet that gives him the power to battle the bad aliens on even terms.  Except it also turns him into a loli girl with fabulous twin tails.  Brilliant.\\n\\n\r\nYes, this anime is a harem, and there are multiple girls after Soji.  Yes, it has gobs of over-the-top fan service.  But curiously, it takes the time to explore the psychology of why these girls might actually like the main character instead of just blindly acting as the story requires them to.  These girls have their own hang-ups and some closet deviant fetishes themselves, and aren't particularly shy about exhibiting them for comedic effect.\\n\\n\r\nThe fight scenes are clearly a parody of both mahou shoujo anime and shonen battle anime.  Our team of heroines transform into their battle forms in racy style.  The outfits are skimpy and double entendres are common in the dialogue.  Don't tune in for great action scenes.  Watch for the the unabashed way the show just tries really hard to get a smile out of you.  Of course some jokes fall flat but I laughed out loud more often than I really should admit.\\n\\n\r\nThen comes episode 11, when Soji wakes up one morning and things take a curious turn.  I was really hoping the show would go there and it does... sort of.  But instead of allowing us to see what social situations this would create, it sticks to its focus on the invading aliens.  It was at this point I thought an opportunity for both outrageous comedy and daring adventure was missed.  \\n\\n\r\nIf an anime is going to be a racy comedy, I prefer the funny, witty kind to the juvenile, embarrassing version.  If someone falls on top of somebody else, by god it should be full-on and not some nerdy accidental breast grope.  At one point our alien lady friend develops a version of the battle bracelet that makes the wearer's breasts larger.  Soji's flat-chested childhood friend doesn't dance around the issue; she begs the alien to allow her to wear this bracelet instead of the one she's been given.  Ore, Twintail ni Narimasu even delves into the practical difficulty regarding the proper care and maintenance of the twin tail hairstyle, using this as the pivotal character development turning point for Soji.  \"I wonder if I ever really understood twin tails.\"  Brilliant.\\n\\n\r\nI can imagine that many people would not like this show.  If you think overly explicit sexual subject matter is childish, you won't like it.  If the idea of fetishes turns you off, you probably won't like it.  It's easy to dismiss this as yet another harem-mahou shoujo-shonen battle anime where a team gets together to save the world while exploring their burgeoning sexuality.  On the other hand, if you are willing to just go with the show's brazen attitude, you might enjoy a fetish-filled alien invasion or two.",
            "date": "2018-12-19T00:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 296132,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Qichar",
                "username": "Qichar"
            },
            "url": "https://myanimelist.net/reviews.php?id=296132"
        }
    ],
    [
        {
            "content": "This anime is basically a war of the best anime fetish presented through cute girls and awesome aliens.\r\ntl;dr: retatable, funny, passionate characters and epic battles\r\nThis anime is very funny and very well written for what the anime wants to be. It is very funny because it is relatable and because all of the characters take their fetishes or \"attribute power\" very seriously. \r\nThe dialogue from all the characters really show how much they love what they love and really makes it relatable to people who have the same and/or similar kind of *ahem* \"attribute power\".\r\nThe animation and soundtrack are both amazing and although it's notthe best animation ever it really shined in their transformations, characters and battles. \\n\\n\r\nThe best of the soundtrack is the ED \"Twintail Dreamer\", because the song is most fitting in the anime. The lyrics of the song and of course the title really tell about their love for twintails which makes it fit really well and the melody is just epic together with the lyrics because it sounds lighthearted yet passionate.\\n\\n\\n\\n\\n",
            "date": "2015-12-31T13:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 207406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4854251.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RuriBellcraft",
                "username": "RuriBellcraft"
            },
            "url": "https://myanimelist.net/reviews.php?id=207406"
        },
        {
            "content": "\"With red courage,\r\nAnd blue love,\r\nAnd yellow hope, all to draw strength from\" - Ending Song (Twintail Dreamer!)\r\n(PLEASE READ EVERYTHING BEFORE FINDING OUT THAT THIS REVIEW IS UNHELPFUL, IT'S PRETTY HALF-ASSED AND SHORT.)\r\nTHIS IS THE BEST ANIMU IN ALL OF ANIMU INDUSTRY.\r\nThat is, if you are a pervert just like me.\r\nStory: 10/10\r\n\"Gonna be the Twintail!\" has the most original story line, ever. And I mean, ever. This anime is just flowing with originality. Sure, there may be some other animu with flying loli heroes but this one... This one has a flying loli-GENDER bender hero. Not to mention a harem. The basic story is that, SoujiMitsuka turns into a red haired loli in order to fight.... And kill.. (Well, they just explode) \\n\r\nHORNY ASS ALIENS  WITH ALL TYPES OF FETISHES, YES, FETISHES. THEY HAVE ALL TYPES OF FETISHES. They are, and aren't limited to: Bloomer fetishes, doll holding girl fetishes, and of course LEG FETISHES. I can't explain all the fetishes in detail as that would ruin the story... Find it out yourself!\\n\\n\r\nArt: 10/10 would bang- I mean, the art is great.\\n\r\nThe way the lolis fly in the air... The way their twintails flow, absolute perfection. There may be some art mistakes here and there, but who cares?!\\n\r\nI'm not the type of person that's big on art, so let's move on.\\n\\n\r\nSound: 10/10\\n\r\nThe sound is of course, perfect as this is a modern anime that just ended a while ago. The OP and ED is just amazing... It's so amazing, that I absolutely have no words to describe it. JUST FIND OUT FOR YOURSELF! (I'm actually too lazy to write the review for the sound.)\\n\\n\r\nCharacter: 10/10 would bang redta- I mean, the characters are really original, don't mind me.\\n\\n\r\nThe characters are original... They may seem like your ordinary TSUNDERE-ASS childhood friend or MASOCHISTIC student council president that is flat as a board but has perfect twintails. However, when you look closely.... THEY STILL ARE! JUST THE WAY I LIKE THEM, IF YOU DON'T THEN WHY ARE YOU EVEN READING THIS REVIEW. Moving onto the main character. Souji Mitsuka just isn't your ordinary good-guy main character. He's the gender-bending loli non-ordinary good-guy main character. His personality is simply great... Just like mine... Twintail fetish.. I mean, what? Moving on.\\n\\n\r\nEnjoyment: 420/69 (10/10)\\n\r\nI enjoyed this series so much, that I just fell in love with the series in the first episode. It is just simply great and I recommend you watch plus enjoy it too!\\n\\n\r\nOverall: 10/10\\n\r\nDo I even need to say the things for overall? It's just perfect.\\n\\n\r\nTHANK YOU FOR READING THIS FIRST TIME TERRIBLE REVIEW.",
            "date": "2015-02-21T20:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 180952,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4000063.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kaaazukiii",
                "username": "Kaaazukiii"
            },
            "url": "https://myanimelist.net/reviews.php?id=180952"
        },
        {
            "content": "Though when you look at an anime like this you must think.... shit its bad. That is only until you find out the true power of twin tails. In this anime the comedy is hilarious with the amount of people looking towards this anime it isn't getting enough notice. But think about it... Twin tails. You can't replace such a brilliant idea like that with anything other then the famous twin tails you see on women today. As an anime lover I recommend this anime as a Great comedy and decent story line to follow.",
            "date": "2015-01-08T22:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 176945,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4371207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KlutzKazu",
                "username": "KlutzKazu"
            },
            "url": "https://myanimelist.net/reviews.php?id=176945"
        },
        {
            "content": "The fall of 2014 was marked by a release of the parody series Ore, Twintails ni Narimasu (When will Gonna Be the Twin-Tail). Anime characters often have some sort of fetish, but the creators of this particular anime series decided to build the whole storyline on fetishism, made it into a cult and amassed an unusual team to protect the fetishes.\r\nA 15-year-old Shoji Mitsuka is obsessed with a hairstyle \"two tails!\" He loves it when girls wear this particular style on their heads, and at the same time he does not notice that his childhood girlfriend is walking around with two tails. And that isall because the hairstyle for Shoji is a fetish, and he is in love with an unattainable ideal and not a mandate reality. So his new female friend took advantage of this inviting him to defend fetishes from monsters. She suggested defending them as a red-haired girl with two tails on her head. Why monsters need fetishes? Well, because monsters sincerely believe that without fetishes humanity will wither away.\\n\\n\r\nGonna Be the Twin-Tail parodies all anime clichés, but does it rather cleverly – each warrior gets armor according to her fetish. Aa! According to the rules, a team of monster fighters consists only of females, and so Soji will have transform into a girl.\\n\\n\r\nThe graphics if the series is rather ordinary and the storyline is limited to the opposition between girls and monsters; but here it does not play a big role. The most important thing in such anime series is fighting, hitting, punching, vulgar humor and beautiful female characters. Nevertheless, the series is quite dynamic and, if you like simple but energetic things with fighting and hot girls, you will definitely enjoy this one.\\n\\n\r\n6/10",
            "date": "2015-11-18T05:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 203635,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4436380.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Konte",
                "username": "Konte"
            },
            "url": "https://myanimelist.net/reviews.php?id=203635"
        },
        {
            "content": "I feel this anime had so much potential to be something so much better the characters are great the story is silly but I liked it the art was all right sound good and thats just it with this anime it just ok.. I cant help but compare it to Kampfer as i just finished that before getting into this and I have to say this anime could have been so much better if it amped up the Ecchi and harem and took on a R+ rating it would have been so much better so all around im gunna have to go with a 6total if its a rainy day and your looking for something to watch and just zone out I say go for it but dont expect anything amazing..",
            "date": "2018-03-25T20:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 275100,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7090993.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Magical_Girl_X_O",
                "username": "Magical_Girl_X_O"
            },
            "url": "https://myanimelist.net/reviews.php?id=275100"
        },
        {
            "content": "\"What.\" - How I can best describe my experience with this series.\r\nTranslating the name \"Ore, Twintails ni Narimasu\" it means \"I will become a twintails!\". I was of the opinion that this was a very interesting (if somewhat strange) title, which for that very reason made me start watching it. \r\nStory: 6\r\nI can only say that I was shocked at the start. I had no idea what to expect and I just found the entire setting absurd and hilarious. I also didn't feel like this series had any true story to it at all - Just that a guy with a fetish seems to justhave scored a 20 on his latest dice roll. But something was off. I couldn't place my finger on it. \\n\\n\r\nAnd then it hit me like a truck. The basic story was, in essence, a Super Sentai (Power Rangers) parody! But because of that I felt that the story was sacrificed to explore more upon characters. And in all fairness, I believe that was for the best.\\n\\n\r\nArt: 9\\n\r\nIt's simply well animated and there are good effects. I'm impressed with them, really.\\n\\n\r\nSound: 8\\n\r\nI think the only nitpick I have is the opening of the series; I am of the opinion that the ending is much better and, in all honesty, fits better as the opening than the actual opening. Otherwise there are good sound effects, good music to set the mood and good voice actors.\\n\\n\r\nCharacter: 9\\n\r\nHere's what makes the series. As stated above, the story really feels like a parody, which in turn allows it to make characters quite a bit more enjoyable than otherwise. The Monster of the Day enemies are hilarious, and I find myself laughing (and even sympathizing) with the antagonists.\\n\r\nAs for the main cast, Souji is very interesting. The others are there to fill the main Sentai tropes but the main character is the one who feels like he's breaking the mold. And the way they parody the story and the harem genre (somewhat) at the same time does wonders. This series would have been extremely boring had everything been taken 100% seriously, and luckily it's not.\\n\\n\r\nEnjoyment: 10\\n\r\nIt's hilarious. I can't look at this as a 100% serious series, it's just got too many parallels with the Sentai genre that I know so well and it makes fun of it all too well. But because I can't take it seriously, it becomes better. There are those few serious moments that still don't feel entirely unnecessary (heck, alot of them are serious because it makes it more fun), and the show knows when and when not to joke around.\\n\\n\r\nOverall: 8\\n\r\nIn the end, I think if you've watched any Sentai/Power Rangers series as a kid or in your later days, you'll find that this series is very funny to watch. If you've watched alot of harem series as well, you'll find it even more hilarious. If you haven't seen alot from any of these genres you might interpret the show differently, in a way I sadly cannot shed any light on. But you might still enjoy it!",
            "date": "2014-12-27T10:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 174551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3081635.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shpjokk",
                "username": "Shpjokk"
            },
            "url": "https://myanimelist.net/reviews.php?id=174551"
        },
        {
            "content": "Ore, Twintails ni Narimasu – The anime of all the fetishes, there is no doubting that Twintails is one of the weirdest shows to come out this year. Many cringe worthy moments of absolute stupidity that will turn away people with a sound mind. Yet because of its “originality” it was one of the most fun watches of the season.\r\n\tStory – 7/10\r\n\tDespite being utterly ridiculous the story is still good. There are no obvious plot holes and progression and development flow so smoothly, truly never a dull moment. But that does not mean it is spectacular, it’s actually pretty cliché. New enemy pops up everyepisode and they defeat it while getting just a bit stronger all the time. It’s really in the amazing characters that this anime succeeds.\\n\r\n\tCharacters – 10/10\\n\r\n\tEveryone is fantastic. Firstly, just because a characters is over-the-top strange does not make it a bad character. Actually for this anime if we met a normal person, they would be the weird one.  Now let’s start looking at the TwinTails. Red/Souji is your typical weird high school guy with a strange fetish and a childhood friend who loves him but is too dense to notice it. Soji is always fighting for a cause and defends it to the end, even if said cause is a hairstyle. Blue/Aika is the cliché childhood friend in the beginning, but after joining up and becoming TailBlue becomes her own character entirely. Initially she acts normal enough, going along with Souji because she likes him. It’s only when she meets Tweorle that her personality of being quick to anger comes into light. Special note: Sure fire way of getting killed is to call her flat chested. Yellow/Erina, no weird fetish anime would be complete without a seemingly innocent character actually becoming a lecherous beast who would do anything her master commands now would it?  Tweorle is the team leader of sorts as she gave them the ability to become the TwinTails and leads from her hidden HQs that are built overnight. Despite being a constant thorn into Aika’s side she cares about all the TwinTails and does her best to help from afar. \\n\r\n\tThis is one of the anime that I will give special notice to the once an episode enemies. As not only do they do a fantastic job of being weird, special shout-out to guy with a back of neck fetish and Spider/Aracnhe guildy for his girlyman fetish, but most of the character progression is caused by their dying words.\\n\r\n\tArt/Animation – 8/10\\n\r\nVery beautifully done. The fight scenes were actually very intensive, instead of just seeing the usual of one character moving round and fighting we get to the huge battle and only close in on special dialogue is being used.\\n\r\nSound – 10/10\\n\r\nPerfect voice actors for the parts, and an even added bonus for most of the dialogue being so weird and yet the actors being all too serious sounding. The music is very powerful and very good. Most of the tracks are in perfectly accompany the scene they were used in. \\n\r\nEnjoyment – 10/10 \\n\r\nCompletely loved this anime and its ungodly levels of weirdness. Even when I became too busy studying during school and skipped other shows I made sure to watch this the moment it came out. Easily one of my top 3 of the season, as it’s just the perfect anime to just watch and laugh.\\n\r\nTotal Score: 9.21\\n",
            "date": "2014-12-30T12:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 175227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3552353.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zperson5",
                "username": "zperson5"
            },
            "url": "https://myanimelist.net/reviews.php?id=175227"
        },
        {
            "content": "This anime can be described with multiple words, but I chose just one. Masterpiece.\r\nThis man/ loli/ genius basically made the new standard for top tier character development. We get to watch as this man develops his fetish throughout the entire series, be warned. This anime will make you cry, it will make you laugh, and it will make you experience other emotions. But most importantly, it will kickstart your love for twintails. The sheer love of twintails that Souji has inspires the same in us, that is the true masterpiece that I talk about when I talk about this anime, of course, there isalso the pervy lizardmen who are, may I add, the perfect antagonist to the incarnation of their fetishes which naturally adds layers to this anime. The comedy is also expertly done with a perfect combination of comedy and comedy, this mixed in with the epic and tense sound effects that present themselves after the third watch of this anime. From a review standpoint I give the anime:\\n\\n\r\nStory: 10\\n\r\nArt: 10\\n\r\nSound: 10\\n\r\nCharacter: 10\\n\r\nEnjoyment: 10\\n\r\nOverall: 10\\n\\n\r\nThis Anime is truly amazing, and I implore you to give it a try (WARNING: This anime isn't for you if you are sensitive to crossdressing, mass perversion or anything else that might disgust you).",
            "date": "2019-01-10T07:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 298631,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7710268.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HappyNewb",
                "username": "HappyNewb"
            },
            "url": "https://myanimelist.net/reviews.php?id=298631"
        },
        {
            "content": "Twintails is a special breed of show, you go into it saying \"Yeah this is gonna be shit\"; but come out saying \"Shit that turned out to be fun enough that I want more\". Twintails has a stupid plot but it is driven by the crazy characters.\r\nEarth has been invaded by the Ultimegil a race of fetishistic creatures who all seek attributes to feed their desires but serve greater masters, the greatest of which enjoys Twintails (really long pigtails Miku Hatsune style). A hero rises up to face them with his equal, if not greater, obsession with this hair style:\r\nSōji Mitsuka\r\nThis guy is so obssessedthat im pretty sure he is in a padded room imagining all of this. He is a cardboard cutout like every character in this show and honestly is the least funny character in the show as his lines can be summed up with \"Twintails are awesome, fuck you aliens, my passion is greater, i have the biggest dick even when I am a girl because hair is amazing\"\\n\\n\\n\r\nHe spends his fighting time (and a few episodes) as a girl simply called Red (real original guys)\\n\\n\\n\r\nThis girl is young looking and draws people who enjoy lolis (this show is full of them). She ends up garnering the attention of just about every person on earth and leaves her allies behind in popularity, proving that the world is a bunch of pedos and that flat is justice.\\n\\n\r\n Speaking of; remember the fetish freaks from earlier? Well they attempted to answer the question of flat or plot and both died horrible deaths, but at least the flat lover was a tentacle monster.\\n\\n\\n\\n\\n\\n\\n\r\nNext in our main cast is Aika Tsube, a wonderful tall loli who has many cute moments in the show that mainly have to do with insecurities about her breast size and the many beatings of Twoearle.\\n\\n\r\nThis girl becomes Blue when she transforms, her outfit manages to be the most revealing of the trio and she manages to be the strongest physically. She is the ideal tomboy character and appeals to those who want a girl that can kick the ass of all the bullies at school because you don't feel like it (unless you are stronk like me and do 500 pushups a day at a minimum).\\n\\n\\n\r\nFinally we have a loli that actually is contending for a spot in my favorite characters because she peaks a meter deep in my heart. Erina Shindō, the class president with a submissive side and makes Kanbaru look tame.\\n\\n\\n\r\nShe looks like serious jail bait and ends up needing to be saved for half the series. However, when she is given a chance, she proves to be a force to be reckoned with and is the only Tail to have a bust. She is Tail Yellow and will strip off her armor in a heartbeat only to become stronger.\\n\\n\r\nHer biggest dream is to be Soji's pet, this is something that propelled this character so high in my esteem for her. This is because even if one can look objectively at something, they will inevitably enjoy something that brings them happiness and this is one of them. She is hilarious to watch and makes the show for me.\\n\\n\\n\\n\\n\r\nThe Ultimegil are too numerous to count, but I guarantee that one of them has your fetish, go on, look on the wiki and find one.\\n\\n\\n\r\nThe story is like a magical girl show (which I classify this as magical girl in every aspect, even down to the loli fan service) and thus is not too great.  The Ultimegil are taken down in troves and the girls occasionally have to get over some self issue in order to take one down. The show just kind of ends with the big boss character being called back on a mission from her boss.\\n\\n\\n\r\nThe appeal of the show is the fetishes you have and the comedy, because the characters are one dimensional and only have fetishistic value to drive them.\\n\\n\\n\r\nRatings:\\n\\n\r\nStory: 5 Really not a story at all\\n\\n\r\nAnimation: 7 Good animation all around, no real good moments except the ending theme which has great hair movement at points\\n\\n\r\nCharacters: 8 Again one dimensional but will appeal to each on a fetishistic and humorous level\\n\\n\r\nSound: 8 This show actually has a great sound track, with the opening and ending really standing out\\n\\n\r\nEnjoyment: 8 I enjoyed this show because of the previously stated reasons, with Erina being the shining star for me\\n\\n\r\n------------\\n\\n\r\nOverall:  7.2 Feed those fetishes my friends, and stay strong.\\n\\n\\n",
            "date": "2015-10-17T10:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 201423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4163393.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/rednekdashie",
                "username": "rednekdashie"
            },
            "url": "https://myanimelist.net/reviews.php?id=201423"
        },
        {
            "content": "It’s difficult to write a review when other users already have written wonderful reviews who explain many of my thoughts perfectly. But here it is anyway:\r\nIs this show a plain parody, or a parody of parodies?  Maybe plain satire, or a satire of satires? It’s so many levels, and that’s wonderful! If you are going to watch it, first you really need to understand that this is a satire show that not only makes fun of a bunch not only of a bunch of other anime, but also otakus. Don’t take anything in this show seriously. Ever.\r\nThe symbolism is very easy to understand. Theugly invading aliens with their different fetishes, represents us: The consumers of anime. The otakus. The main characters aren’t badly written either. I especially like Tsube Aika (Tail Blue) in her role as “the MC:s childhood friend”. Even though this is a parody (almost at a Leslie Nielsen-level) she feels like a more realistic character than many other characters in other “serious” anime shows.",
            "date": "2016-02-28T00:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 211856,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5200872.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Teisatsu",
                "username": "Teisatsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=211856"
        },
        {
            "content": "Visual animenya looks pretty neat for anime mahou shoujo genderbender. Do you also expect intense action sequences and pretty good stories like me for this anime? Although I'm sure if I expect something serious I will be disappointed, I can not stop hoping. Either way, Flat is justice.ini.\r\nSeen above is the first visual key for this anime, with the original look of TailRed the twintail hero with her figure as the man we do not want, coupled with her figure into a cute TailRed and moe.\r\nThe character design of the 3 main characters is also finally shown. This is the original character before these heroestransform into TailRed and TailBlue. Seen Shoji Mitsuka, Aika Tsube and Erina Shindou",
            "date": "2018-01-02T08:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 267188,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6420871.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_Liggar_Saputra",
                "username": "_Liggar_Saputra"
            },
            "url": "https://myanimelist.net/reviews.php?id=267188"
        },
        {
            "content": "Do you like twintails? Then you'll love this anime! Oh, you don't like twintails? Then don't bother watching because this show is intended to those who like twintails. Why do I say this? Well, there are several reasons.\r\nFirst, The story revolves around twintails. Powers come from twintails, love comes from twintails, everything revolves around twintails! At first, I thought it was hilarious how everyone in the show took it seriously, but it got boring overtime. There was nothing else in the show but public confession of fetishes. Though I must admit, there was a stable plot and also cliffhangers that kept me anticipating for more.\r\nAsfor the characters... they're not that bad. The MC wasn't really your typical anime schoolboy. He was passionate about twintails, so much that he became one himself. Also, he's not timid and unafraid to show the whole world of his love for it. Let's not forget Twoearle, whom I anticipated to see in twintails. It's this mystery of how she looked like in twintails that really got me interested in her. Other than these two, the other characters don't really stand out.\\n\\n\r\nThe art and animation could've been better. There were some fails here and there. It wasn't exactly a fluid animation. Maybe the production company didn't have the budget or the luxury of time...? The point is, it could've gone better.\\n\\n\r\nAll in all, It's a fairly good anime. If you're into twintails, then I recommend you watch it. If you don't, then just watch your favorite fetishes get beaten up. There is only one true fetish, and it's... I said it 11 times and I'll say it again: twintails!\\n",
            "date": "2016-06-23T19:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 221664,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=221664"
        },
        {
            "content": "Pros\r\n- You can see different kind of twintail\r\n- You can see different kind of fetish\r\n- Funny bad guys. I even want them to win against the protagonist out of pity\r\n- Simple storyline for people who want to enjoy something mild instead of something with a lot of mystery\r\n- Some characters personality are different with their appearance, which is unexpected and fun\r\n- Opening and ending song really fit the theme. It makes you feel energetic\r\n- Good character design. It connects with the jokes smoothly\r\nCons\r\n- Almost no characters growth\r\n- Some characters need more background story so people can understand them more\r\n- The battle scene seems quite repetitive",
            "date": "2017-10-09T09:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 260288,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6576809.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Syrene_Windsor",
                "username": "Syrene_Windsor"
            },
            "url": "https://myanimelist.net/reviews.php?id=260288"
        },
        {
            "content": "You will be confused as !@$#. It's confusing when to laugh when to cry, when to be offended. Because of idiotic twintails being a source of material that alien's can't fight with? \r\nSERIOUSLY WTF?!?\r\nAnyway i don't have anything to say is too confusing. So i dropped this anime.",
            "date": "2015-08-20T02:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 196599,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4823418.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Palivarck",
                "username": "Palivarck"
            },
            "url": "https://myanimelist.net/reviews.php?id=196599"
        },
        {
            "content": "FULL DISCLOSURE: I have not read the manga/light novel. \r\nSTORY: \r\nOre, Twintail ni Narimasu’s story is an exaggerated personification of internet fights about waifus.\r\nThe story itself is about a guy who love twin-tails – the ever popular anime hairstyle. One day he and his childhood friend and neighbor – how original! – meet a strange woman who gives him a bracelet and telling him there isn’t much time to explain. After some time-wasting, she teleports everyone to another location where aliens are attacking girls with twin-tails in order to drain their ‘attributes’. Souji – the hero, uses his bracelet to transform into a little girlwith crazy strength and twin-tails in order to defeat the aliens. Later on, more girls become heroes as well.\\n\\n\r\nYes, it sounds extremely ridiculous, and it is, but the best part is how all the aliens are obviously parodies of otakus / weeaboos. The entertainment value lives on all the crazy stereotypes. Considering the nature of the show, I was expecting it to be heavily ecchi, but it has pretty low amounts of it, which is somewhat refreshing – not that I dislike ecchi or anything...\\n\\n\r\nThe majority of the storyline is following the girls around the world battling the aliens. Each time they gain a new member or some kind of power that helps them to fight off increasingly tougher and weirder aliens. Towards the end, things take a slightly more serious turn, with some power justifications.\\n\\n\r\nThere is so much BS flying around and the characters are all too accepting of what is going on, but this clearly isn’t meant to be a serious show. It’s trying to be a comedic parody with all of the reasoning and ridiculous battle scenes. For example, the only thing the heroes stand to gain from defeating the bad guys is to avoid having all the twin-tails taken from their world.\\n\\n\r\nThere are plenty of discontinuities.  \\n\\n\r\nART+ANIMATION+MUSIC: \\n\r\nI really like the art style, but the quality is inconsistent. \\n\\n\r\nThe battle animations are good, while the rest of the show animations range from fine to poor. The exploding bad guys are quite well done for whatever reason.\\n\\n\r\nMusic is average. \\n\\n\r\nSound effects are mostly overused stock sounds ranging from average to bad.\\n\\n\r\nCHARACTERS:\\n\r\nNot much depth of characters, but each has their own distinguishing, yet overused, personality traits. \\n\\n\r\nThe main character, Souji, transforms into a little girl he names “Tailred”. He is a standard fare male lead in most regards. He loves twin-tails to the point of being unable to defeat anything with twin tails.\\n\\n\r\nTwoearle is a woman from another planet who is intending to stop the spread of the aliens. She is always trying to seduce Souji, but with the show lacking the ecchi element, it is a lot less annoying than in some other anime.\\n\\n\r\nSouji’s childhood friend, Aika, has a crush on him and is constantly fighting off Twoearle. She eventually becomes a hero as well. She is overly self-conscious about her small chest and most of her additions to the show revolve around that and her violent tendencies.\\n\\n\r\nErina is the class president, a cute rich girl who collects hero figures and has an obedience fetish.\\n\\n\r\nAll the support characters exist to perpetuate the ridiculousness, especially Souji’s mom, who is immediately 100% okay with everything that is going on, and even invites Twoearle into her house knowing full well that she is trying to seduce Souji – even supporting her in that regard – despite Aika’s resistance. On multiple occasions she even accompanies everyone into the secret base that Twoearle built under their house anytime the heroes are called into action.\\n\\n\r\nThe bad guys are all reptilian/insectoid/etc. personifications of the various sub-focuses of otaku/weeb culture and have unnecessary character development in the style of One Punch Man, where you learn all this backstory only for them to last maybe a portion of the episode. Here it is not nearly as well done for the OP comedic aspect that OPM has, but it’s entertaining nonetheless. Their backstories are essentially just what their favorite ‘attributes’ are, such as “little girls hugging dolls,” “back of the neck showing,” and the more typical “big boobs” and “small boobs” war. \\n\\n\r\nThe aliens are not inherently evil, as they feed off of these traits and enjoy them similar to the people that they are parodying. Many of their interactions with each other and the heroes is hilariously mundane. My favorite example is where they have a jenga battle in order to determine who will attack Tailred.\\n\\n\r\nThe character design is reminiscent of other girls-in-battle-suits anime but manages to be less ecchi than average. The exception being Tailyellow, who always receives the more compromising camera angles.\\n\\n\r\nENJOYMENT:\\n\r\nIt’s so ridiculous that it is funny. Having the various mundane anime fetishisms explicitly mentioned and personified is something new to me. \\n\\n\r\nTwoearle’s pushiness, Aika’s chest envy, and Erina’s innocent puppy delusions are nothing super original but they are entertaining.\\n\\n\r\nA lot of the jokes are intentionally made to seem sexual but are actually referring to twin-tails. Other jokes actually are sexual. \\n\\n\r\nOne bad guy complains about the death of true literature as opposed to what anime today has become. This is one of the few shows I have seen that gets (a little bit) political with its jokes, something I miss from American adult cartoons.\\n\\n\r\nAnd of course the gender-bending plays a strong part in the show. I found it entertaining at least. Souji seems to brush it off without much thought, unlike other shows where they immediately start groping all their new parts. It happens eventually, but in a more entertaining scene.\\n\\n\r\nOVERALL:\\n\r\nAnime-culture mocking parody, with over the top battle animations, but bad story – it wasn’t the focus anyways. If you can take yourself less seriously and enjoy the childish humor, it will be enjoyable.\\n",
            "date": "2016-12-16T06:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 235539,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5863535.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/bossmann-dan",
                "username": "bossmann-dan"
            },
            "url": "https://myanimelist.net/reviews.php?id=235539"
        }
    ]
]