[
    [
        {
            "content": "Kimi to Boku... You and me. In Japanese, this is a rather informal and comfortable way of saying the English equivalent, and it is a fitting title for the series. Though certainly not the most \"exciting\" show to air on Japanese television, it becomes strangely alluring in its own way, and leaves viewers wanting more.\r\nStory: 9\r\nThe story is rather laid back, not too complex. It doesn't focus on about saving the world, helping a friend in dire distress, or even falling in love (that's not to say that there aren't any sweet dilemmas present). It's a slice of life that revolves around the theme ofgrowing up and friendships that grow along with one's stature. Yes, the story revolves around 4 (then 5) males. At first, one feels like this could NEVER be anything but yaoi (male on male anime/manga), but it is anything but that. Instead, Kimi to Boku brings a new light on a what could be an \"over-done\" subject. Poetic prose seasons the the memories of the various protagonists who wistfully (and sometimes regretfully) reminisce the past, their experiences more than 10 years ago still having strong influences and ties to what is happening at the \"now\" of their life. As for romance, you'll have to see for yourself.\\n\\n\r\nArt: 9\\n\r\nThe art is also not of the \"spectacular, melts the eyes and makes them bleed\" type. Those who are looking for sophisticated backdrops and blinding visual effects should look elsewhere. However, as with many anime of this genre, the art compliments the story (indeed nearly every aspect of the anime) with its simplistic and relaxing tones and hues. Simple though it may be, some of the ending credit \"snapshots\" are sure to curve even the most stubborn of lips. It did mine.\\n\\n\r\nSound: 9\\n\r\nThe sound was what stood out to me at first. I understand it isn't for everyone, but with the reviews out now that say that its \"okay\" leave me confused. The opening (\"Bye Bye\" by the artist \"7!!\") and ending (\"Nakumushi\" by the artist \"Miku Sawai\") are perfectly in sync with the series, and are totally worth hearing in their full versions (you guys do this too, right?). Personally, I find these artists' other songs worthwhile as well. As for the rest of the music, it isn't perfect, but it is certainly well-matched and well-placed in each episode, and at times you can find yourself tapping your foot or even rocking your head to that catchy guitar.\\n\\n\r\nCharacter: 10\\n\r\nThe other outstanding aspect of this anime are the characters. At first glance, they are flat and uninteresting. Four (then five, you'll understand what I mean) high school boys: A very feminine, long-haired Matsuoka Shun, two rather good-looking yet otherwise un-noteworthy twins (Yuuki and Yuuta) who only speak in monotone voices, and a seemingly stereotypical, steady-type nerd (Kaname -> Megane). The fifth guy is something of a wild card. You'll see.\\n\\n\r\nBut, as the story progresses, it's like watching a flower bloom. (Spare me your spit and jeers for saying it in such a way, but I won't take it back.) The artist really pay attention to little details, and create such depth in these characters that you'll find yourself wondering why you ever believed in Santa Claus. Each episode, viewers learn just a little bit more about these boys: what they were like when they were little and how they acted as opposed to how they are now - insignificant little details, things that seem unimportant yet hold some strange and precious place in their hearts. To these characters, the world is changed through these little details, and their bonds, it feels, are irreplaceable.\\n\\n\r\nEnjoyment: 10\\n\r\nIf it was meant to be exciting, this anime is not that great. It would deserve those careless sixes and sevens and be overshadowed by better shows. But it seems the artist wants to do something else. What else is there to life besides head-pounding, heart-rushing battle? Simple, sweet, everyday life. A cup of tea with friends. Fretting over school and girls. It's these overlooked yet precious, precious things that one can only miss once they are over and naught but memories. Kimi to Boku brings wistfulness in a curious way, and stokes the fires of the heart. If anything, it's real art.\\n\\n\r\nOverall: 10.",
            "date": "2011-11-28T13:51:00+00:00",
            "helpful_count": 274,
            "mal_id": 48231,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480810.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ichigo2979",
                "username": "ichigo2979"
            },
            "url": "https://myanimelist.net/reviews.php?id=48231"
        },
        {
            "content": "I HATE SCHOOL COMEIDES and sentimental twaddle and will not watch \"cute girls doing cute things.\"  -- BUT I LOVED KIMI TO BOKU. --  It 's as easy to watch and as mesmerizing as a trout stream in the sunshine.  It just flows along, easy, and happy, with the occasional surprise.  Like potato chips I kept consuming one episode after another and was surprised when I hit ep 12.  With only one ep to go I was glad to know that a second season is slated for Spring 2012.\r\nIt is a simple slice of life about four boys who havebeen together since kindergarten plus one radical misfit that gets dropped in to the mix.  Sounds tedious, boring and trite, right?  It isn't.  It is funny without being silly and endearing without being sappy.  It's about a lot of little things we overlook or take for granted that make life good.  \\n\\n\r\nThere is no action or adventure, no high drama, no random wacky silliness, no ecchi, no sci-fi or horror and IT IS NOT SHOUNEN-AI.  It is funny but not in an over the top guffawing kind of way but you will smile a lot, chuckle, and occasionally laugh out loud.  KtB is true slice of life about a few charming characters you'd like to know personally.  \\n\\n\r\nSome say it has no plot.  I'm not sure that is an accurate statement because each consecutive episode does build a bit on previous episodes as more and more is revealed about the character and characteristics of each player.  Some say it is a \"show about nothing\" and that I openly disagree with.  It is about love and acceptance, seeing someone's foibles and loving them just the same.  Yes I said love but I mean universal love and and not the romantic sort.  KtB is about friendship, reflection, and personal growth.  How is that \"about nothing.\"\\n\\n\r\nI could care less about the opening and ending songs and found the sound track in no way annoying, jarring or distracting so it must have done its job well.  I found the voice actors very well suited to the characters.\\n\\n\r\nThe art is nice.  It is as mellow as the overall tone of the show. Then there are the cats.  CATS?  Brilliant, beautifully executed and illustrated vignettes of cats mirroring the actions and attitudes of the human characters -- ored cats.  playful, mischievous cats, annoyed cats.  Each character has a signature cat that reflects his personality and character traits.  These aren't overly round, stylized cats but very realistic and richly detailed cats.  Ah, the Japanese do seem to appreciate and understand cats.  The \"cat mirrors\" is likely the most brilliant aspect of KtB.  Hope they continue it in the 2012.",
            "date": "2012-01-09T10:07:00+00:00",
            "helpful_count": 140,
            "mal_id": 51367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/163064.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lisnoire",
                "username": "lisnoire"
            },
            "url": "https://myanimelist.net/reviews.php?id=51367"
        },
        {
            "content": "This is my first time writing a review, so please be gentle, but Kimi to Boku more than deserves something nice being said about it for once. I'm a huge fan of the manga, so I'm a little biased, but, I'll keep focused on what my thoughts are for the anime only.\r\n-Story-\r\nThe plot of this series revolves around five high school boys who have known each other since childhood. Kimi to Boku falls under the 'slice of life' category, because that's exactly what it is. If you're expecting something that's action packed or has a fast pace, this anime will likely disappoint you, because it'sneither. But, this is one of the reasons that this series is so great; it's simple. It deals with the every day lives of these five boys (Kaname, Shun, Yuuta, Yuuki, and Chizuru) and the people they interact with. Each episode they are faced with new life challenges that are easy for the viewer to relate to. Though, this series also focuses on the boys' pasts, showing little segments to explain traits that they continue to show in present time or to reflect on a previous relationship with each other or one of the other characters. \\n\\n\r\nDrama hardly exists in Kimi to Boku, other than adorable, friendly squabbles or the occasional love interest dilemma. This, can either come across as boring to a viewer or as something that's soothing compared to the other anime that they might watch. To me, Kimi to Boku is a breath of fresh air. While other animes may be nerve-wrecking or stressful to watch, this anime is so enjoyable to me. Every time I sit down to watch it, I can just feel myself melt into the world of these characters and I find myself helplessly falling in love with their situations. \\n\\n\r\nPersonally, I enjoy the slow pace of this anime. It's slow enough to simply enjoy watching it, but fast enough to where I'm never bored watching it. \\n\\n\r\n-Art-\\n\\n\r\nThe art of this anime is very similar to Hotta's art in the manga. Both are drawn simplistically, which fits perfectly with the series' simplistic plot. The characters are drawn with detail that is just enough, not messy, but not overwhelmingly complex. Each character get's his or her own unique look and features, making them easy to distinguish between them and easy for someone who's new to the series catch on and remember their names. Although, something that I really enjoy with the anime is the beautiful pallet of colors. The anime has very soft, warm colors. The scenery of the backgrounds often involving cherry blossoms or beautiful sky images. The colors and the atmosphere of this anime only add to the beauty of this series' complicated-simplicity.\\n\\n\r\n-Sound- \\n\\n\r\nThe music is alright. The background music is not overwhelming and doesn't seem to distract the viewer from the character interactions, instead, it seems to just perfectly fit with the rest of the atmosphere. The opening and ending themes are cute, although, the music all together is not very memorable. It just fits.\\n\\n\r\nRather than talking about the music in the series, I'd like to stress how perfectly cast the VAs are for these characters. I'm a fan of the drama CDs, so I didn't really know what I was expecting by being introduced to a new cast of VAs for the characters. I was a bit hesitant about it, to be honest. But, after watching the first episode, I was more than pleased. I actually had butterflies, because I think the cast did an incredible job portraying these characters exactly how they were meant to be shown. Shun is soft and meek, Kaname comes off being overwhelmed and aggravated, Chizuru is obnoxious and loud, the twins are smooth and perfectly quiet. These aspects of their personalities are easily shown in the VAs' voices. They are easy to decipher from one another, which is especially important with the twins. \\n\\n\r\n-Character-\\n\\n\r\nI've been stating over and over how delightfully simplistic this series is, but the characters are anything but simple. Each character is something special, each character feels like a main character, and each character is able to blend with the rest of the cast. Focusing on our main five boys, each of them have a special relationship with one another and interact with each other in different ways. Though, one criticism that this series has gotten is the 'BL' aspects that the show gives off. It's all about perception, if you want to see a deeper relationship between any of these characters, then you can easily see one, if you chose to view them as just being a set of close friends, then the BL elements are hardly overwhelming. These characters are for everyone who wants to enjoy them, this series is NOT just eye candy for fangirls. \\n\\n\r\nI won't go into the detail of each of the boys, to avoid spoilers, but, I think their different personalities and the different ways that they react to each other is something that's very special. Each character is incredibly likeable and each one is someone that the viewer could relate to someone they know in real life, or even themselves. \\n\\n\r\nI have nothing bad to say about any character in this entire series (even the ones that have not made their appearances yet) and that's something really miraculous for me. I generally like only a few characters from each series, but, I can honestly say that I love every single character very dearly and have related to each of them in some situation or another. This is by far my favorite part of this series. \\n\\n\r\n-Enjoyment-\\n\\n\r\nWhat's not to enjoy about Kimi to Boku? Nothing is unlikable about adorable characters interacting with each other in adorable ways. There's heart, there's humor, there's tiny bits of drama, and just a lot of love between the cast. I fully enjoy this series and find myself laughing at various times, although, it seems like every time I watch a new episode, the smile won't disappear from my face. It's impossible for me not to enjoy watching these character's bonds grow and change, and watch the events that lead up to these changes. \\n\\n\r\n-Overall-\\n\\n\r\nThis anime gets high marks from me, especially because it's an adaptation. Usually, adaptions are done poorly, and viewers often get the wrong idea about the series by the lame anime adaption that an amazing manga got; though with Kimi to Boku, I love both the anime in the manga. I highly recommend anyone who's falling in love with these characters, or even enjoying themselves in the slightest, to read the manga. The manga is even more incredible than the anime, although, the anime is very close to being perfection. There are, of course, changes that have been made in the adaption, but, this series has a very nice flow, and I am ecstatically awaiting seeing the rest of this season's episodes, as well as the second season.",
            "date": "2011-11-10T18:37:00+00:00",
            "helpful_count": 56,
            "mal_id": 47239,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400600.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nightrays",
                "username": "nightrays"
            },
            "url": "https://myanimelist.net/reviews.php?id=47239"
        },
        {
            "content": "I myself think that Kimi to Boku is a must watch show. I personally think that it doesn't matter when and how often you watch it either. Kimi to Boku is one of those anime's where you can come home from a rough day of work and watch. For me, I thoroughly enjoyed Kimi to Boku and I hope that after reading this review, you will too.\r\nStory: 9\r\nI really liked the story in Kimi to Boku. I like it's simple school life style and I myself believe that the way the way they went about making this genre work, and not get boring, was reallywell done.\\n\r\nNormally in a lot of slice of life, school life anime it's very easy to get bored. I'm sure well all know this well. But with Kimi to Boku the story hooked me at the start. The story in Kimi to Boku was simple, yet effective. At the end of the anime I didn't feel the 'void of emptiness' after watching it. Instead, I smiled to myself thinking, \"I really enjoyed that.\" \\n\r\nTrust me on the fact that you'll laugh at the stupid things that happen and the giggles between characters.\\n\\n\r\nArt: 9\\n\r\nFor these kind of anime's I always think that it needs to be simple; and that's what Kimi to Boku did. It kept it's art simple and so, it wasn't sore on the eyes. After coming home from a hard day of work you don't particularly want to see vivid colors. The art style in Kimi to Boku was smooth, and I myself had no problems with it.\\n\r\nIt's very pretty.\\n\\n\r\nSound: 8\\n\r\nWhile watching Kimi to Boku I thought to myself every time  I heard a soundtrack play, \"I've heard this before...\" The soundtracks in Kimi to Boku are very repetitive and so, it at times may not be ear candy. In the first half of the first episode of Kimi to Boku not much music played at all. Though, I believe myself that it was made like that to make the pacing seem slower and to make it seem more realistic. Towards the end of the anime, they play more soundtracks and for me, that's ok. I would've put sound at a seven if it wasn't for the fact that even if the soundtrack is repeated more than a few times, they were good soundtracks. Kimi to Boku used the right soundtracks at the right time and that's not something every anime can do.\\n\r\nThe sound effects in Kimi to Boku weren't much to talk about but they were there. They made me laugh too. :)\\n\\n\r\nCharacter: 10\\n\r\nWow. This anime made me love every character. There was not one character I hated. The character development in this anime was very good and I became attached to them. What I was in awe about was the fact that even if a character only had one episode, you could still call them a character. They seemed just as important as the main characters and had an amazing amount of character development for such short time that they had. \\n\\n\r\nEnjoyment: 10\\n\r\nThere's not much I can say here since I've pretty much already stated above my opinion and enjoyment out of Kimi to Boku. Every end to every episode left me wanting more. It was a very enjoyable anime and if you decide to watch it then I hope you enjoy it too. I remember not being able to wait until I got home to watch this anime. I hope you feel that way also.\\n\\n\r\nOverall: 10\\n\r\nKimi to Boku is a hit or miss honestly. It's like marmite; you either love it or you hate it. The slice of life genre isn't something for everyone but, even if you dislike slice of life, give the first few episodes a try. I myself don't particularly watch slice of life unless it's striking, and this was. It seems simple yet the comedy and the characters in it will make you smile. The sound is good, the art is cute and smooth and the story is just what a normal highschooler may want their life to be like.\\n\r\nGive Kimi to Boku a try, I really enjoyed it.",
            "date": "2015-03-24T13:58:00+00:00",
            "helpful_count": 49,
            "mal_id": 183259,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4514625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jebbika",
                "username": "Jebbika"
            },
            "url": "https://myanimelist.net/reviews.php?id=183259"
        },
        {
            "content": "Kimi to Boku is a series about a group of four (later five) teenage boys and them finding things to do in their everyday lives. And...that's it, really.\r\nKtB is truly a slice-of-life show, but I am of the opinion that even SOL series deserve actual plots and in this way, KtB falters. There isn't much plot to speak of. Most of the time, the \"plot\" deals with the boys doing ho-hum everyday things, like reliving childhood memories, drawing manga, or even contemplating what to do because they're bored (I kid you not). Every now and then, things get somewhere interesting - for example, the culturalfestival episodes were fun, as was the venture to the boys' former middle school, where they meet Shun's younger brother. Other episodes were downright boring and entirely forgettable; these mostly dealt with the boys sitting around and talking about things (I can't even tell you what of because I don't remember and frankly don't care). Indeed, I nearly fell asleep during the first episode because all the characters did was talk and relive flashbacks that weren't that interesting.\\n\\n\r\nNow, a lacklustre plot can be somewhat forgivable if the series had great characters. For the first few episodes, our main cast of boys numbered four - Shun (the soft-spoken, effeminate one), Kaname (the straight man and the glasses guy), and Yuuki and Yuuta (the twins). However, they're all either so quiet or deadpan that they don't make for a very entertaining group to watch. Like I said, the first episodes deals entirely with them talking about things. Even the introduction of the stereotypical tsundere in the second episode doesn't help spice up what little plot there is. In fact, the tsundere, Masaki, is one of the more annoying characters, who is more \"tsun\" than \"dere\" and gets upset at the tiniest offer of help. For the record, she doesn't get much better by the end of the series.\\n\\n\r\nThe group only really livens up when the fifth member, Chizuru, is added. His boundless energy and enthusiasm adds a different dynamic to the main cast - he contrasts well with the deadpan twins and the quieter Shun and gives the straight man Kaname a better character to work off of for comedic effect. At the same time, he adds a bit of a love triangle with Masaki (the tsundere). Still, Chizuru alone isn't enough to save the plot from its own blandness. Nevertheless, the show does become less boring with him around because at least when they sit around and talk, there's some energy in it.\\n\\n\r\nAlso, in later episodes, the group comes across other characters who, through their own plots or development, give the main cast some depth that we would otherwise not see. For example, when Yuuta goes on a date with a shy classmate, we get a glimpse of his personality underneath his emotionless exterior. Unfortunately, such instances seem to occur only when they meet people outside their group rather than when the main cast is together. I would have liked to see the main guys develop within their group as well as without, like in the case of Ouran High School Host Club.\\n\\n\r\nAnimation-wise, there isn't much to see. That's not to say it's bad; it's just simple because that's all the show requires. Basically, there's nothing notable about it, good or bad.\\n\\n\r\nIn terms of sound, the music, like the animation, isn't very notable or memorable for anything. I'll admit, though, I have a fondness for the OP \"Bye Bye\" by 7!!, which has cute melody and a catchy opening beat. I have no complaints about the voice actors/actresses, who I guess had to work within their given characterizations.\\n\\n\r\nSo, really, is there anything truly notable about Kimi to Boku? Well, no. Is it a bad show? Well...that depends on how you see it. Frankly, I don't think of it as bad but it's far from memorable. Other slice-of-life series I've seen had something to distinguish them - Aria had a beautiful utopian society with a dash of fantasy; K-ON! had catchy music and \"moe\" girls; Azumanga Daioh had off-beat humour and even more off-beat characters. Kimi to Boku has...cats? Look, I don't know, I'm trying.\\n\\n\r\nIf you like action, drama, and fast-pace plots, then Kimi to Boku is not for you. If you like slice-of-life, give it a try but if you don't like it by the third or fourth episode, it's probably not for you, either.\\n\\n\r\nEDIT: It's been about 2 years since I finished this series and wrote this review. Suffice it to say, I can barely remember a single thing about this series. It was simply that forgettable for me.",
            "date": "2012-01-02T09:50:00+00:00",
            "helpful_count": 46,
            "mal_id": 50741,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/122361.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Aeterna",
                "username": "Aeterna"
            },
            "url": "https://myanimelist.net/reviews.php?id=50741"
        },
        {
            "content": "Kimi to boku...\r\n... well of course one of my all time favourites!\r\nMale or female, old or young; it's an anime for everyone!\r\nLet us begin with the Story:\r\nIt's simple, not too complex - but that's why it's so wonderful watching it! Because everything that happens, happens so naturally, without any kind of pressure. It's such a pleasant story! And as the story goes on, you might begin to care about these guys!\r\nThat's the next strong point; the characters! When I started watching it, I liked them all form the very first minute, the very first episode! They've got all their own personality, filled with their ownskills and weakness, like in the real world! They get along, more or less, with each other in a quite lovely way, even tough at first they don't seem so close to each other. But as soon as Chizuru appears... ou well, just watch it ;) \\n\\n\r\nThe Art & Sound of the anime, well, one word: beautiful!\\n\r\nEven the silent, sometimes seemingly unimportant background music add so much emotions and life to the anime, that, when you're later listening only to the Music you might ask yourself; have I heard this? Was it in the anime?\\n\\n\r\nI felt so happy watching it and I always wanted more, more, more!\\n\r\nSo if you haven't yet watched it; do it!\\n\r\nIf you haven't had the time; take it!\\n\r\nIt's worth watching it!",
            "date": "2014-11-25T01:48:00+00:00",
            "helpful_count": 27,
            "mal_id": 169859,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269669.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MestariYN",
                "username": "MestariYN"
            },
            "url": "https://myanimelist.net/reviews.php?id=169859"
        },
        {
            "content": "It's really hard reviewing a series after it first came out, so please bare with me. (Note: this review will be updated throughout the course of the released episodes)\r\nKimi to Boku (You and Me) is an anime that revolves around 5 childhood male friends who have started their second year of high school.\r\nStory\r\n--------\r\nThe story is pretty fair so far. Since it is a slice-of-life anime, the pacing might be a little too slow for some people, whereas others can find it to be calming. I personally think that this anime could develop into something bigger and more entertaining as the episodes progress. There is somuch potential for a slice-of-life revolving around an entire male cast and their daily lives, unlike the typical 'moe girl' one. This might be one of those few rare findings where the entire main cast consists of boys, but it does not belong to a shounen-ai category, which is a good thing for those who are not a fan of that genre, although shounen-ai lovers can enjoy Kimi to Boku the same.\\n\\n\r\nArt\\n\r\n--------\\n\\n\r\nThe art is 'ok'. I have not much to comment about it. It isn't very detailed or very plain, but somewhat in the 'neutral' zone. One thing I immediately noticed upon watching this series is the character's 'eyes'. Even though there is not much to complain about them (they ARE rather unique in terms of style), but in the end you get used to this art type and go along with it. The colors are pretty calming and soothing.\\n\\n\r\nSound\\n\r\n---------\\n\\n\r\nNot much to say about the sound. It's pretty decent, and flows along with the plot line. The slow scores and cheerful ones fill in the gaps of the 'everyday life' feel.\\n\\n\r\nCharacter\\n\r\n---------\\n\\n\r\nThe characters are pretty likable, and since this series has just started, we don't know much about their background. They all fit into the typical stereotypes, although some produce a good fair amount of uniqueness in them. In the end, the viewer is able to relate to and enjoy the character's actions.\\n\\n\r\nShun -> Many complain that he looks like a girl, but because of promotional art, we know that he'll soon cut his hair (maybe that will bring all the 'complaints' down). He's a pretty likable character and is the 'optimistic' one out of the group.\\n\\n\r\nYuki -> Likes manga, the younger of the twin brothers. Is quiet.\\n\\n\r\nYuta -> The older twin, talks a bit more. Not much is known about him, till now.\\n\\n\r\nKaname -> The strict one who keeps all the friends in order. Despite the fact that I don't really relate characters from different series, Kaname gave me the 'Kyouya' feeling (Kyouya from Ouran High School Host Club).\\n\\n\r\nChizuru -> Still did not make his appearance.\\n\\n\r\nEnjoyment\\n\r\n--------------\\n\\n\r\nThe pace is slow, but mellow. This might change after more episodes are released though. overall, I think one can enjoy Kimi to Boku pretty well. If you hate slow every-day-life ongoings, then I don't recommend this series, although, as I mentioned before, this is an 'early series' review, so this might change with the introduction of more characters, and possibly a 'plot'.\\n\\n\r\nOverall\\n\r\n---------------\\n\\n\r\n7/10\\n\r\nDecent anime with quirky characters and a stable storyline. As I mentioned (countless of times) this might change soon (my rating might either rise or drop). If you're a fan of slice of life and would like an anime that focuses on the everyday life of male students, then Kimi to Boku is your anime.\\n\\n",
            "date": "2011-10-11T05:59:00+00:00",
            "helpful_count": 19,
            "mal_id": 45305,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/280922.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kurimu-chan",
                "username": "Kurimu-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=45305"
        },
        {
            "content": "What? An anime with 5 male characters as leads? That's gotta be BL and bet its nothing more than bait for fangirls, right? WRONG! Kimi to Boku has nothing of the sort. Its simply a very pleasant anime to watch for both guys and girls. I'm a straight guy myself and I had no trouble watching this so lets get that misconception out of your mind.\r\nSo the anime's about a group of friends. Four childhood friends and a blondie who happened to get intertwined with them. There's no plot, so to say coz the anime just shows you incidents from their high-school years but that'smore than enough to tell you that this anime is only for those who truly enjoy Slice of Life themes and love simplicity amalgamated with humor. For those who don't... Best move along, find something more mature.\\n\\n\r\nLike I mentioned, the anime is simple. Its art is simple. The music is simple. The jokes are simple. And then there are the characters who seem simple enough but are so much more than that. Again, each of the 5 characters behave uniquely and they're all opposites of each other, in a way. Even the twins are distinguishable by actions, clearly. As the story builds on, throwing anecdote after anecdote of their lives, these instances only get funnier by the episode. The characters are drawn to look very adorable, though some of the female characters are hard to distinguish from each other. The pace is kinda laid back and slow but still engaging with all the moments that can either make you laugh or urge you to recollect instances from your past. With the first season, it has also ventured into mildly romantic themes though it'd really take the next season to tell you where they lead. All in all, the focus is solely friendship and they've nailed that through, perfectly. They've also got cats. A lot of 'em.\\n\\n\r\nI was blown away by both, the opening theme as well the ending song, especially the ending where they've applied the beautiful effect of cross-fading the start of the song with the last few seconds of the anime which makes the episode all the more special. The rest of the music that is featured is also pleasant and fitting for the setting of the anime. Not much to criticize since the anime has accomplished all it had aimed for. The only thing might be the lack of an evident storyline but it makes up by delivering in everything in a non-cliche, non-cheesy manner. It starts off rocky but peaks quickly and stays there. So do persevere the initial 2~4 episodes, at least. Did I mention they have a lot of cats? :3\\n\\n\r\nSo what is Kimi to Boku?\\n\r\nIt is the perfect episodic anime to add to a tough day at work since it calms you down perfectly without provoking the least complex of thoughts. I recommend this to everyone looking for something light to watch while following something rather heavy. In my opinion, unexpectedly, the best anime of the Winter 2011 releases from amongst those I've watched.\\n\\n\r\nMy Evaluation: 9/10",
            "date": "2011-12-30T07:16:00+00:00",
            "helpful_count": 19,
            "mal_id": 50485,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/708577.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZedSaint",
                "username": "ZedSaint"
            },
            "url": "https://myanimelist.net/reviews.php?id=50485"
        },
        {
            "content": "It's not a Boy's Love so what's the point in watching this?\r\nI love slice of life animes, I try to look for them whenever I can, and when I say Slice of Life i mean true Slice of life, not Slice of life in space or slice of life with magical powers. What I love about slice of life animes is the realism with the stories in characters, I love watching things that could possibly happen in real life. Sadly there are too many supernatural stories listed as Slice of life. So when I read the description for Kimi to Boku I was really happy,a true slice of life story FINALLY! I was eager to sit down and watch.\\n\\n\r\nThe first episode introduce us to the characters who had been friends for many years blah blah. I won't go into the details because you should know the story by now from reading the description.\\n\\n\r\nThe first episode wasn't that exciting, but I forgave its lack of excitement because it was the first episode and we were just getting to know the characters and at first I thought the random cat shots were odd, but they grew on me and actually it is the only thing about this show that is interesting.\\n\\n\r\nDon't get me wrong, the show had some good episodes, such as the one with Yuki playing with a foreign boy when they were young. It was cute and just shows that even if kids can't speak each other's languages they will find ways to get around that and have fun.\\n\\n\r\nHowever, the good is not enough to keep me glued to the story..why? Because there is no story. So far each episode is more like a \"this happens in this episode\" type of deal. Such as Episode five can be wrapped up as \"Girl loses key chain\" The fourth episode was \"Kaname gets sick\" this is really a nothing happens show. I guess it wouldn't be so bad if the characters were interesting, but they aren't. They are all stereotypes you can find in other animes like Ouran Host Club, except Ouran host club characters were actually fun to watch.\\n\\n\r\nNot only are the characters uninteresting but the overuse of flashbacks really weigh the show down because they have nothing to do with anything that is happening in the episode, but then again since nothing is happening in the episode the flashbacks seem even more pointless. Flashbacks should enhance the story while giving the audience important info. Do we really need to know for the one millionth time that Kaname had a crush on his Kindergarten teacher? I think we have had four flashbacks on that alone. yep four on just that and we are only on episode five. (Although, thankfully there were none in the fifth) this show relies heavily on flashback storytelling, but the flashbacks leads to nowhere. i found myself not really looking forward to the next episode and I only watched the fifth episode to give it a decent chance.\\n\\n\r\nHere are my pet peeves that really makes me not want to continue:\\n\\n\r\nThat little girl is annoying. What is up with animes that either have the super sweet boring girl or the annoying brat b**ch? Like girls are all one extreme or the other. Why can't they just have a cool girl to hang out with, who is regular and likes to play around too?\\n\\n\r\nShun, the pink haired boy is the male version of the super sweet boring chick. Now look, I don't mind girly boys but don't throw a girly boy into the mix and then not give me some sort of a gay storyline. at least attempt a coming out story (although I'm sick of those at least it is something) and no he doesn't have to fall for one of his friends (although at least there would be an actual story here). seriously, this kid is just gay, so gay his pillow was pink and had ruffles on it when they were kids. If they try to make him straight by giving him a female love interest (and no that annoying little brat is not a love interest) then I would just laugh cause he obviously does not like Va***as and neither does Yuki(one of the twins) for that matter. But he just stands around as the sickeningly sweet mother figure of the group.\\n\\n\r\nChizuru Tachibana. Soooo he was a German (I had to correct this, I thought Russian at first) boy who could not speak Japanese, yet not he is the most Japanese like out of all of them. And his name irks me more than anything. Why couldn't the writer look online or something and find a name suitable to his nationality?? I didn't know he was half Japanese until i read the synopsis here but it still irks me because why does he have to be half Japanese? Oh yeah so they wouldn't have to waste time looking up foreign names. \\n\\n\r\nOkay I've said enough. But this all leads back to my first sentence. I'm not some yaoi maniac that NEEDS yaoi in every story, but since there is no plot going on here they might as well give us some BL to make this worth looking at.",
            "date": "2011-11-04T18:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 46849,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=46849"
        },
        {
            "content": "Heartwarming and funny moments passed between friends. This show has to be one of the sweetest ones I seen so far. At first I didn't think I would like it due to the fact there were no main female characters. How could I simply relate? But after watching it I realized male or female, young or old, this show will touch your heart. \r\nStory: 10/10\r\nNow, usually I don't like stories that don't really progress. But in Kimi to Boku I thought it was a plus. It one of those show that are just so fun to watch and leave you feeling bubbly inside. \r\nArt: 10/10\r\nTheart actually added to the bubbly feeling effect. Every episode or so they would stop at a sweet momment and show the picture in painted form. I don't know why, but in doing so they really made me look at the artistic parts of the show. \\n\\n\r\nSound: 10/10\\n\\n\r\nCan I just say I haven't heard one song on this show that I didn't like. Each of the songs are now downloaded to my computer. I'm serious, it all surrounds that good time feeling. The songs make the show that much sweeter. Even the seemingly unimportant background music add so much life to the show. \\n\\n\r\nCharacters: 10/10\\n\\n\r\nAt first the characters seemed pretty bland, and not so friendly. Seriously the only nice one out of the group was Shun. And I couldn't really see them as childhood friends. Even in the summary it says they are neither good nor bad friends. Which is pretty sad.\\n\\n\r\nBut then the transfer student comes into the picture.\\n\\n\r\nI really think that the transfer student,  Chizuru, is the ribbon that \\n\r\nties the group of friends together, because the first few episodes I was wondering why they didn't seem that close. But after Chizuru comes into the picture. It seems they all get along like they should have in the beginning. \\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nThe main thing was Enjoyment with this. I actually felt happy watching this, It has a real calming effect for some reason.\\n\\n\r\nThen after I finished it and got back to real life I realized how lonely I was. But the point is, the captures you're attention in a real subtle way.\\n\\n\r\nOverall: 10/10\\n\\n\r\nReally, this is going to be one of my new favorites. I say you should drop all the suspicions or doubts you may have and just watch it. You won't regret it!",
            "date": "2013-06-02T14:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 99505,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650533.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SecretAnimeLover",
                "username": "SecretAnimeLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=99505"
        },
        {
            "content": "Extremes can fail, even in anime, but Kimi to Boku pulls it off.  This is a show based on the manga of the same name, that in a phrase is the Seinfeld of highschool anime shows.\r\nNo, I'm not referring to its popularity or critical reception, but to the fact that while most other shows have a gimmick, Kimi to Boku is essentially a show about nothing.  This is slice of life anime taken to its extremes, and as someone who enjoys the genre (guilty pleasure), it's sort of fun. \r\nEarly reviews of the series berated it for its predictability  \"oh there's thetsundere, we know how that will turn out!\" but the show takes those expectations and turn them on its head.  The character is quickly relegated to a supporting role and exits the narrative until much later, and ultimately doesn't affect the narrative in any meaningful way.\\n\\n\r\nAlthough there is the faintest character and narrative arc, each of season 1's 13 episodes are essentially self-contained vignettes on the life of a group of high school kids (mainly focusing on the boys).   Call it gender preference, but in a way, the focus just on the male shenanigans sort of reminds me of my own high school experience with my clique of friends.  The romantic melodrama is relegated to the side.\\n\\n\r\nIf, after all this, you're still undecided on whether to take the plunge,  I can also mention Cats.  Yes, this show cuts away to shots of Cats and kittens as a kind of narrative punctuation, ending a scene, splitting a scene of exclaiming a scene.  \\n\\n\r\nOh, the watercolor look that seems to be in vogue of late also works brilliantly in this show and features one heck of an opening song.  I've  drifted away from JPOP since graduating from university but Bye Bye! is one catchy tune that I can't stop playing.\\n\\n\r\nKimi to Boku isn't going to win any awards or top anyone's lists, but it is genuine, and just a lot fun to watch.",
            "date": "2012-01-03T00:51:00+00:00",
            "helpful_count": 12,
            "mal_id": 50801,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/721723.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wuster",
                "username": "Wuster"
            },
            "url": "https://myanimelist.net/reviews.php?id=50801"
        },
        {
            "content": "Kimi to Boku has a simple plot which tells the everyday life experiences of 5 highschool boys and reminiscing their childhood memories together. Though the story isn't complex, it isn't boring to watch and it has a natural comedy in it. If you are a teenager, you can somehow relate on their experiences...\r\nwhen i first found this anime, I thought it was boring because of the drawing and simplicity of plot. But, as I watched it, it is rather enjoyable and fun to watch. I became fond of each of the characters because of their personalities and the way they relate and care for eachother.\\n\\n\r\nIt really made me laugh and smile. :)\\n\\n\r\nalso! I liked it because there are a lot of cats [which sometimes represents the characters of the story] which are really adorable. X3\\n\\n\r\n[looking forward for Kimi to Boku season 2!]",
            "date": "2011-12-28T23:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 50365,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/401654.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chiisaihimawari",
                "username": "chiisaihimawari"
            },
            "url": "https://myanimelist.net/reviews.php?id=50365"
        },
        {
            "content": "-my first review, be gentle! I just wanted to tell everyone what i feel about this anime, that i feel very close to me-\r\nHave you ever had a group of friends you care a lot? Kimi To Boku is a story about the everyday life of five teens, bound together by the most beautiful relationship that can be established between people: friendship. Representing quite normal situations, Kimi To Boku can warm the heart of the spectator, through the use of beautiful phrases, moving soundtracks, and the feeling of closeness with the situations that happen to the protagonists. If you have special friends in your life,you would understand that Kimi To Boku is a much more deep and moving anime than it seems. But if you don't, you'll maybe just enjoy a normal slice-of-life anime, without knowing how much fantastic this anime is.\\n\\n\r\nStory: 9\\n\r\nKimi to Boku has no particular plot, so it's not fair to give full marks to it. However, the simplicity represented by this anime succeeds in every way to involve the viewer, making it enjoyable until the end of each episode. I found great the use of past scenes of the protagonists, which outline a simple but also stable plot. Also, some scenes will make you laugh out loud, but other scenes are very touching. It's impossible to be bored watching this anime.\\n\\n\r\nArt: 10\\n\r\nThe art of Kimi to Boku is very simple, yet so beautiful. First, it is almost totally devoid of the stereotype of the \"unnatural colored hair\" typical of Japanese cartoons (except for Shun, who has red hair, but hey, even I have natural red hair, so it's okay!). The style vaguely reminds me of other animes as Usagi Drop, that I've always praised for its exquisite designs and vibrant colors. Another thing to praise are the drawings of cats in Kimi to Boku, almost perfect, they look so real.\\n\\n\r\nSound: 10\\n\r\nProbably, the soundtrack to Boku Kimi is the best thing of all the anime. Starting from the opening, which I believe is one of the best among all the anime ever made, until the ending, which is also wonderful, all the soundtracks in it are very well made, and that's especially thanks to them that the whole anime creates an atmosphere of happiness mixed with a nostalgic feeling. It gives the spectator the sensation of good memories, remembered with nostalgia and melancholy, which is perfect in the anime context.\\n\\n\r\nCharacter: 10\\n\r\nThe 5 main characters are different from the typical anime chracter stereotype.\\n\r\nShun is feminine, tender and altruist, the typical \"good person\" that can hardly be found as a main character in an anime.\\n\r\nYuta, Yuki and Kaname have kinda the same cool attitude, but they're nothing like the typical cool characters which not comunicate with anyone and are closed in themselves.\\n\r\nChizuru is the classical genki boy, maybe the only stereotype in the serie, but also a good character that i've appreciated a lot.\\n\r\nI also love the other characters: they are more attached to the classical stereotypes, but their presence in the anime is very important for the plot develop.\\n\\n\r\nEnjoyment: 10\\n\r\nI love this anime. As I said, the fantastic soundtrack, the funny situations, the never boring characters, the good art and the heart-warming situations make this anime very enjoyable and watchable by everyone.\\n\\n\r\nOverall: 10\\n\\n",
            "date": "2011-12-26T14:10:00+00:00",
            "helpful_count": 11,
            "mal_id": 50203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/300100.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SanzuNoKawa",
                "username": "SanzuNoKawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=50203"
        },
        {
            "content": "I don't really know how to explain this anime, since I've only watched the first episode. However, the first episode so far, in my opinion, as for as a slice of life genre, is really enjoyable. I find Kimi to Boku really cute. \r\nIt's a bit slow, then again it is the first episode only. I love the adorable flashbacks. \r\nMaybe I'm just being biased at the same time because I just have this huge attraction to pretty boys, and Shun is such a pretty boy; He's way too cute.\r\nThe art is really really nice though. I think I will end up really liking thisanime despite the first episode being a bit slow. (:",
            "date": "2011-10-09T04:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 45153,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/604819.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kuporru",
                "username": "kuporru"
            },
            "url": "https://myanimelist.net/reviews.php?id=45153"
        },
        {
            "content": "I'm a fan of slice of life animes, and Kimi to Boku just gives that to such fan.\r\nIt is very slice of life, there's no plot and every episode has different events. \r\nStory:\r\nThere's really no plot and it is what slice of life is great for, you don't really need one. You can just have fun on watching the happenings of five high school students and their funny relationships with other characters. There's a bit of romantic story in each episode tackling all of the characters. \r\nArt:\r\nThey say that this anime's art isn't noteworthy but I don't think so. The art is very expressive andevery time they give off a joke or just doing stuff they have this kawaii expression that would make you burst to laughing.\\n\\n\r\nSound:\\n\\n\r\nThis anime got all you need for awesome JPOP music, this has a wonderful opening courtesy of both 7 Oops and Tomohisa Sako... just wonderful and very wonderful ending themes and background music in climatic scenes it just captures the moment and would make you watch more. \\n\\n\r\nThe voice acting in this anime is so great. Shun's voice delivers what the character is all about, feminine and kawaii, it just awesome, I love his voice. Chizuru also has a wonderful voice, energetic and fun that truly makes him lovable. All the other characters have good voice actors.\\n\\n\r\nCharacter:\\n\\n\r\nThis anime has outstanding characters. Even though you would see Kaname, as the four eyed character, there's something that would make you care for him and love him. Shun is very likable and beats the moe characters in other shows (and he doesn't even try being cutesy). Yuuki is awesome so does his twin Yuuta and their tag team are very much awaited in every episode. We also can't have this show without Chizuru that brightens every episode with amazing punch lines. Surprisingly Masaki goes a great character development.\\n\\n\r\nEnjoyment:\\n\\n\r\nI ENJOYED IT A LOT!!!!!!!!! AND I MEAN A LOT!!!!!!!!\\n\\n\r\nOverall, this is a must watch anime that would hook you from beginning to end.",
            "date": "2015-02-01T04:53:00+00:00",
            "helpful_count": 10,
            "mal_id": 179415,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3825147.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NoonebutMark",
                "username": "NoonebutMark"
            },
            "url": "https://myanimelist.net/reviews.php?id=179415"
        },
        {
            "content": "Re Review  : ) I love Slice of life anime. Kimi to boku or( You and Me)  is about 4 childhood friends who are now in their High School year.  They meet another new  friend Chizuru who quickly becomes one of their best friends. He makes their daily lives entertaining and interesting. The story of Kimi to boku deals with every day life which everyone who watches this anime can relate too- whether it be love life  friendship, etc.  I love the Op and ED song as it fits this anime perfectly : )  Kimi to Boku hastisi relaxing feeling every time i watch this show. I would recommend this anime to anyone who loves Slice of Life genre : ) Score 10/10 \\n\\n\r\nRe edit(after completing the series).I've enjoyed the 13 episode ride of Kimi to Boku. I feel i am a closer to them now : ).  Our lovable 5 main characters have learned something new about themselves and from each other as they continue to be closer friends. I wonder what will happen in Season 2 ( which starts in April)?? Will they still be friends till the end after High School??College??Married??ETC    I still give this series 10/10.",
            "date": "2011-11-18T15:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 47655,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/834209.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeFan500",
                "username": "AnimeFan500"
            },
            "url": "https://myanimelist.net/reviews.php?id=47655"
        },
        {
            "content": "At first when I started seeing this show really thought he would be more or even get to see the first episode and then leave it a little sideways, but one day I decided to see him again until the end and I confess that surprised me time and regretted not seeing him until the end from the beginning.\r\n(Update: I just saw the anime, very good!)\r\nKimi to Boku, this show is really fantastic. He can do a very good connection between the characters, story and comedy, something few shows of this genre can do.\r\nHe tells the story of four boys during childhood friends from highschool live in situations where ordinary life of a student, Yuuki, Yuuta (they are brothers), Shun and Kaname give life to this show and are responsible for the success of this true work while Shun is more delicate and at times looks like a woman and is more fanciful, like cooking, Kaname makes the style more serious, studious and learned (but do not think that it is not funny!) and finally Yukki and Yuuta twin brothers where each one has its own personality and the same time you like surprises and confuses dois.No wait until a show with adventure, drama, action, he has nothing but it is a nice anime to watch and very fluid and clean.\\n\\n\r\nHis comedy is not forced in any way and is really fun is natural, loose, makes you laugh in every episode you watched, linked to good music that combines with past scenes, great graphics are extremely detailed and engaging characters that you can identify the voice acting is particularly good and is the highlight of this show dubbing combine comedy with an amazing way and that the brightness of the show, I think the show just becomes funny because of dubbing done extremely well and I believe anime genre for those who really his strong point but this has to be is meaningless and lifeless, each genre needs a strong point such as suspense, mystery songs have happy and funny ends the show as well as an anime adventure can not only obscure songs, but continued to speak well of the show, it's really amazing how well the producers chose the songs for each scene, and how each character has their own life and still the place for a bit of romance but do not expect the anime to focus on it after his main genre that is not (as much as an anime has always various genres will focus on one of them and Kimi to Boku is comedy! romance not) the novel appears in a few episodes I believe in a 4 but is well it feito.Each episode has a different story which makes everything funnier and more Slice of Lifes animes that may seem a bit monotonous this genre is on the rise lately and is constantly evolving and this show is proof he's no little boring and monotonous and really stands out from others in the same genre, it takes real life situations and turn them into a really fun comedy.\\n\\n\r\n================================================== ========\\n\\n\r\nStory: 8\\n\r\nSince this is an anime comedy is difficult to give a note to his story as each episode it is one different story with a beginning middle and end their focus is not on it but I will try an average of each episode and give an overall score.\\n\\n\r\nArt: 8\\n\r\nThe anime has 3 strengths, and art is one of them (next to the sound and the comedy and the characters) really his art is extremely detailed and well done, you do not notice major flaws and scenarios are well defined and you get to itself felt in the scene as the character.\\n\\n\r\nCharacters: 8\\n\r\nAnother strong point of the anime, the characters are not fully worked in front psychological, sentimental, but somehow they captivate you and you begin to get involved in the story with them, you start to like them and identify with them, is Funny how each character had his personality well developed and has its special peculiarities such as the twins Yuuki and Yuuta while the other one loves mangoes does not support this and do not even have a special taste, particular attention to the character Shun that in some moments recalls a woman is really funny how it looks like one, another highlight for the character I most identified myself Tachibana and the silly boy group that does everything becomes still best to watch each scene it really is incredible funny!\\n\\n\r\nSound: 9\\n\r\nOne of the high points of the anime really your sound is excellent since the opening song to the closing and the songs used in each scene and how producers had amazing care of this detail seems so irrelevant but that's life when the anime is as well used if this show really fantastic!\\n\\n\r\nEnjoyment: 9\\n\r\nFUN!! so you will not miss seeing this show, it is easy to watch, is not complex does not have those dramas and complicated things to understand he is totally straight, fluid and extremely funny! I believe that everything that purports to show he can do at a high level.\\n\\n\r\nOverall Rating: 8",
            "date": "2012-08-30T03:00:00+00:00",
            "helpful_count": 9,
            "mal_id": 71171,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/slyffer",
                "username": "slyffer"
            },
            "url": "https://myanimelist.net/reviews.php?id=71171"
        },
        {
            "content": "Dull Synopsis, you would think at first. You'd think the anime will be just a cliche. But I promise you, you'll be surprised. \r\nIt's true, the story is not one in a million. Yet, it's strangely warmer than all the other anime I've watched. It's not just about highschool or friendship, it's about intimacy between male characters you never see in other anime. Not that it's a shonen ai. It's what I would call a true yet enjoyable slice of life story. \r\nThe Characters are my favorite part. Distinct, yet believable. They are funny, but not outrageous. By the end of the first episode, Ifell in love with them. The interactions between each character and another is amusing. \\n\\n\r\nOverall, this anime is not Gintama. It's not Naruto or death note. It has a completely different feel to it. Yet, in it's own category, I would say it's one of the best. In fact, when I noticed that it was only rated 7, I looked through all my old emails to find the password to myanimelist, just to sign in and vote. \\n\\n\\n",
            "date": "2011-11-14T15:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 47471,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bellabambina248",
                "username": "bellabambina248"
            },
            "url": "https://myanimelist.net/reviews.php?id=47471"
        },
        {
            "content": "THIS IS MY SECOND TIME WATCHING THIS SERIES AND I'VE ALREADY GOT THE FEELS FROM WATCHING THE FIRST EPISODE!\r\nLike I said, this is my second time watching the series so I've really missed Kimi to Boku (KB for short). I absolutely regret not re watching this anime anytime sooner! At first when the anime came out I'd always get exited every week after school to watch the anime- though I haven't felt much anticipation since so I've always thought KB was a delightful series.\r\nKimi to Boku would be your typical cute and wonderful slice of life shoujo anime, revolving around four childhood friends (basically bestfriends)Tsukahara Kaname, Matsuoka Shun, Asaba twins Yuuki and Yuuta, that have known each other since preschool and now are second year high schoolers. The group starts having new adventures like meeting new friends such as Chizuru and Masaki, also bearing several sentimental moments along the way. Though this might be the case, I felt that the boys (Masaki isn't a main) really had a firm, crisp, bond, being   much better than the usual slice of life anime- with the fact of being super adorable!\\n\\n\r\nBecause of the anime being called You and me in English, (after being such a slowpoke) when I watched the anime again this gave me a thought of what ever affects you in the group affects everyone else too, giving me the idea of  that whatever moments you go through, all of them will embrace the happiness and pain with you. This gave me the reason of thinking that KB really is a lovely heartwarming show that any human being could watch anytime, making you laugh or cry you'll be feel merry at any moment you watch the anime. I couldn't help but realize that I smiled at every episode, also resulting in  a few tears of happiness too. I could re watch Kimi to Boku almost anytime, being a favorite that won't be scraped off my list anytime soon!\\n\\n\r\nKimi to Boku really is a beautiful yet simple story, with a better friendship like nothing else. These passionate moments could make you feel fluffy  in the inside often. Could this be captivation? Joy? Or just being emotional?\\n\\n\r\nAll I know is that Kimi to Boku really makes me feel happy.",
            "date": "2013-07-11T10:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 104849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1492591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tegaruheii",
                "username": "tegaruheii"
            },
            "url": "https://myanimelist.net/reviews.php?id=104849"
        },
        {
            "content": "This is a strangely addictive overdose of easy-going saccharine slice of life sweetness. I mean, I thought the first episode was totally bleh and yet I kept watching and in the end I became addicted. I hear cocaine works like that. Oh, wait, I wasn't supposed to say that out loud.  Ahem, anyway, on we go…\r\nStory:\r\nThe story is about the everyday lives of five friends. And when I mean everyday I mean hardcore everyday. There are exciting occurrences like buying stuff from vending machines, eating lunch and making photocopies (I'm not shitting you, this really happens). And yet, despite the uneventful storyline, this showbecomes strangely addictive. Perhaps it is the innocence and sweetness it exudes, perhaps it's the nostalgia of the happy schooldays you never had or even the ideal picture of friendship it presents. Whatever the reason, it is a very captivating story despite the detail that NOTHING HAPPENS! There is no conflict, no angst, no drama just a series of sweet little nothings. Sometimes, that is just what you need. \\n\\n\r\nCharacters:\\n\r\nTwins Yuuta & Yuuki: are a pair of lazy deadpan overachievers who love trolling people. At first, I did not much take to them because they were strictly reactive and passive characters. Yet, in the end they prove to be the source of some extremely snarky comedy moments. \\n\r\nKaname: is the exemplary, rigid student with a fetish for older women. His function is to be the straight man in many of the funny moments. \\n\r\nShun: is a totally girly boy who is gentle, kind, sensitive and loves baking and the colour pink. He provides the group with emotional support and he's also my ideal wifey…oh, wait, I wasn't supposed to say that out loud. Ahem…moving on. \\n\r\nChizuru: is the outsider that eventually becomes a part of the group. Many think he is an annoying, hyperactive brat but if you think about it his character is really necessary. He is the epitome of an energetic, active character. This is a quality none of the other characters possess, hence he is needed to balance things out. \\n\r\nSo, there you have it. At first glance the characters appear overly simplistic yet as you continue watching you see a wonderful fleshing out process. In the end you feel as if you actually know them and would really like spending time with them.\\n\\n\r\nAnimation:\\n\r\nNothing stellar and often sub-par. Yet this is not a show that requires flashy visuals so it makes no difference really. There is a lot of empty space, pastel colours and soft movements. Very soothing to the eye; it's like eating cotton candy actually. \\n\\n\r\nSound:\\n\r\nThe sound was so discreet I don't even remember it being there. I mean, there must have been some sound but for the life of me I can't recall any of it. Well, maybe I was just so focused on wanting Shun for my pet. Oh, wait, I wasn't supposed to say that out loud…\\n\r\nOP: A sequence of small moments to introduce the characters matched by a simple, bubbly little ditty. \\n\r\nED: A sequence of static pictures (stills: the budget anime's best friend) matched by a simple, cute little ballad. \\n\\n\r\nOverview:\\n\r\nThis anime is basically worth a 7 but I am giving it +1 for the frequent, random shots of freaky cats. \\n\r\nWill this show appeal to most people? No. It is too slow and uneventful. But if, on the other hand, you are fond of slice of life, sweet innocence and soothing lassitude you will like this. I certainly find myself looking back on it fondly and might actually want to re-watch it someday.\\n",
            "date": "2011-12-26T12:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 50199,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56329.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jigoku-n3ko",
                "username": "Jigoku-n3ko"
            },
            "url": "https://myanimelist.net/reviews.php?id=50199"
        }
    ],
    [
        {
            "content": "Kimi to Boku... You and me. In Japanese, this is a rather informal and comfortable way of saying the English equivalent, and it is a fitting title for the series. Though certainly not the most \"exciting\" show to air on Japanese television, it becomes strangely alluring in its own way, and leaves viewers wanting more.\r\nStory: 9\r\nThe story is rather laid back, not too complex. It doesn't focus on about saving the world, helping a friend in dire distress, or even falling in love (that's not to say that there aren't any sweet dilemmas present). It's a slice of life that revolves around the theme ofgrowing up and friendships that grow along with one's stature. Yes, the story revolves around 4 (then 5) males. At first, one feels like this could NEVER be anything but yaoi (male on male anime/manga), but it is anything but that. Instead, Kimi to Boku brings a new light on a what could be an \"over-done\" subject. Poetic prose seasons the the memories of the various protagonists who wistfully (and sometimes regretfully) reminisce the past, their experiences more than 10 years ago still having strong influences and ties to what is happening at the \"now\" of their life. As for romance, you'll have to see for yourself.\\n\\n\r\nArt: 9\\n\r\nThe art is also not of the \"spectacular, melts the eyes and makes them bleed\" type. Those who are looking for sophisticated backdrops and blinding visual effects should look elsewhere. However, as with many anime of this genre, the art compliments the story (indeed nearly every aspect of the anime) with its simplistic and relaxing tones and hues. Simple though it may be, some of the ending credit \"snapshots\" are sure to curve even the most stubborn of lips. It did mine.\\n\\n\r\nSound: 9\\n\r\nThe sound was what stood out to me at first. I understand it isn't for everyone, but with the reviews out now that say that its \"okay\" leave me confused. The opening (\"Bye Bye\" by the artist \"7!!\") and ending (\"Nakumushi\" by the artist \"Miku Sawai\") are perfectly in sync with the series, and are totally worth hearing in their full versions (you guys do this too, right?). Personally, I find these artists' other songs worthwhile as well. As for the rest of the music, it isn't perfect, but it is certainly well-matched and well-placed in each episode, and at times you can find yourself tapping your foot or even rocking your head to that catchy guitar.\\n\\n\r\nCharacter: 10\\n\r\nThe other outstanding aspect of this anime are the characters. At first glance, they are flat and uninteresting. Four (then five, you'll understand what I mean) high school boys: A very feminine, long-haired Matsuoka Shun, two rather good-looking yet otherwise un-noteworthy twins (Yuuki and Yuuta) who only speak in monotone voices, and a seemingly stereotypical, steady-type nerd (Kaname -> Megane). The fifth guy is something of a wild card. You'll see.\\n\\n\r\nBut, as the story progresses, it's like watching a flower bloom. (Spare me your spit and jeers for saying it in such a way, but I won't take it back.) The artist really pay attention to little details, and create such depth in these characters that you'll find yourself wondering why you ever believed in Santa Claus. Each episode, viewers learn just a little bit more about these boys: what they were like when they were little and how they acted as opposed to how they are now - insignificant little details, things that seem unimportant yet hold some strange and precious place in their hearts. To these characters, the world is changed through these little details, and their bonds, it feels, are irreplaceable.\\n\\n\r\nEnjoyment: 10\\n\r\nIf it was meant to be exciting, this anime is not that great. It would deserve those careless sixes and sevens and be overshadowed by better shows. But it seems the artist wants to do something else. What else is there to life besides head-pounding, heart-rushing battle? Simple, sweet, everyday life. A cup of tea with friends. Fretting over school and girls. It's these overlooked yet precious, precious things that one can only miss once they are over and naught but memories. Kimi to Boku brings wistfulness in a curious way, and stokes the fires of the heart. If anything, it's real art.\\n\\n\r\nOverall: 10.",
            "date": "2011-11-28T13:51:00+00:00",
            "helpful_count": 274,
            "mal_id": 48231,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480810.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ichigo2979",
                "username": "ichigo2979"
            },
            "url": "https://myanimelist.net/reviews.php?id=48231"
        },
        {
            "content": "I HATE SCHOOL COMEIDES and sentimental twaddle and will not watch \"cute girls doing cute things.\"  -- BUT I LOVED KIMI TO BOKU. --  It 's as easy to watch and as mesmerizing as a trout stream in the sunshine.  It just flows along, easy, and happy, with the occasional surprise.  Like potato chips I kept consuming one episode after another and was surprised when I hit ep 12.  With only one ep to go I was glad to know that a second season is slated for Spring 2012.\r\nIt is a simple slice of life about four boys who havebeen together since kindergarten plus one radical misfit that gets dropped in to the mix.  Sounds tedious, boring and trite, right?  It isn't.  It is funny without being silly and endearing without being sappy.  It's about a lot of little things we overlook or take for granted that make life good.  \\n\\n\r\nThere is no action or adventure, no high drama, no random wacky silliness, no ecchi, no sci-fi or horror and IT IS NOT SHOUNEN-AI.  It is funny but not in an over the top guffawing kind of way but you will smile a lot, chuckle, and occasionally laugh out loud.  KtB is true slice of life about a few charming characters you'd like to know personally.  \\n\\n\r\nSome say it has no plot.  I'm not sure that is an accurate statement because each consecutive episode does build a bit on previous episodes as more and more is revealed about the character and characteristics of each player.  Some say it is a \"show about nothing\" and that I openly disagree with.  It is about love and acceptance, seeing someone's foibles and loving them just the same.  Yes I said love but I mean universal love and and not the romantic sort.  KtB is about friendship, reflection, and personal growth.  How is that \"about nothing.\"\\n\\n\r\nI could care less about the opening and ending songs and found the sound track in no way annoying, jarring or distracting so it must have done its job well.  I found the voice actors very well suited to the characters.\\n\\n\r\nThe art is nice.  It is as mellow as the overall tone of the show. Then there are the cats.  CATS?  Brilliant, beautifully executed and illustrated vignettes of cats mirroring the actions and attitudes of the human characters -- ored cats.  playful, mischievous cats, annoyed cats.  Each character has a signature cat that reflects his personality and character traits.  These aren't overly round, stylized cats but very realistic and richly detailed cats.  Ah, the Japanese do seem to appreciate and understand cats.  The \"cat mirrors\" is likely the most brilliant aspect of KtB.  Hope they continue it in the 2012.",
            "date": "2012-01-09T10:07:00+00:00",
            "helpful_count": 140,
            "mal_id": 51367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/163064.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lisnoire",
                "username": "lisnoire"
            },
            "url": "https://myanimelist.net/reviews.php?id=51367"
        },
        {
            "content": "This is my first time writing a review, so please be gentle, but Kimi to Boku more than deserves something nice being said about it for once. I'm a huge fan of the manga, so I'm a little biased, but, I'll keep focused on what my thoughts are for the anime only.\r\n-Story-\r\nThe plot of this series revolves around five high school boys who have known each other since childhood. Kimi to Boku falls under the 'slice of life' category, because that's exactly what it is. If you're expecting something that's action packed or has a fast pace, this anime will likely disappoint you, because it'sneither. But, this is one of the reasons that this series is so great; it's simple. It deals with the every day lives of these five boys (Kaname, Shun, Yuuta, Yuuki, and Chizuru) and the people they interact with. Each episode they are faced with new life challenges that are easy for the viewer to relate to. Though, this series also focuses on the boys' pasts, showing little segments to explain traits that they continue to show in present time or to reflect on a previous relationship with each other or one of the other characters. \\n\\n\r\nDrama hardly exists in Kimi to Boku, other than adorable, friendly squabbles or the occasional love interest dilemma. This, can either come across as boring to a viewer or as something that's soothing compared to the other anime that they might watch. To me, Kimi to Boku is a breath of fresh air. While other animes may be nerve-wrecking or stressful to watch, this anime is so enjoyable to me. Every time I sit down to watch it, I can just feel myself melt into the world of these characters and I find myself helplessly falling in love with their situations. \\n\\n\r\nPersonally, I enjoy the slow pace of this anime. It's slow enough to simply enjoy watching it, but fast enough to where I'm never bored watching it. \\n\\n\r\n-Art-\\n\\n\r\nThe art of this anime is very similar to Hotta's art in the manga. Both are drawn simplistically, which fits perfectly with the series' simplistic plot. The characters are drawn with detail that is just enough, not messy, but not overwhelmingly complex. Each character get's his or her own unique look and features, making them easy to distinguish between them and easy for someone who's new to the series catch on and remember their names. Although, something that I really enjoy with the anime is the beautiful pallet of colors. The anime has very soft, warm colors. The scenery of the backgrounds often involving cherry blossoms or beautiful sky images. The colors and the atmosphere of this anime only add to the beauty of this series' complicated-simplicity.\\n\\n\r\n-Sound- \\n\\n\r\nThe music is alright. The background music is not overwhelming and doesn't seem to distract the viewer from the character interactions, instead, it seems to just perfectly fit with the rest of the atmosphere. The opening and ending themes are cute, although, the music all together is not very memorable. It just fits.\\n\\n\r\nRather than talking about the music in the series, I'd like to stress how perfectly cast the VAs are for these characters. I'm a fan of the drama CDs, so I didn't really know what I was expecting by being introduced to a new cast of VAs for the characters. I was a bit hesitant about it, to be honest. But, after watching the first episode, I was more than pleased. I actually had butterflies, because I think the cast did an incredible job portraying these characters exactly how they were meant to be shown. Shun is soft and meek, Kaname comes off being overwhelmed and aggravated, Chizuru is obnoxious and loud, the twins are smooth and perfectly quiet. These aspects of their personalities are easily shown in the VAs' voices. They are easy to decipher from one another, which is especially important with the twins. \\n\\n\r\n-Character-\\n\\n\r\nI've been stating over and over how delightfully simplistic this series is, but the characters are anything but simple. Each character is something special, each character feels like a main character, and each character is able to blend with the rest of the cast. Focusing on our main five boys, each of them have a special relationship with one another and interact with each other in different ways. Though, one criticism that this series has gotten is the 'BL' aspects that the show gives off. It's all about perception, if you want to see a deeper relationship between any of these characters, then you can easily see one, if you chose to view them as just being a set of close friends, then the BL elements are hardly overwhelming. These characters are for everyone who wants to enjoy them, this series is NOT just eye candy for fangirls. \\n\\n\r\nI won't go into the detail of each of the boys, to avoid spoilers, but, I think their different personalities and the different ways that they react to each other is something that's very special. Each character is incredibly likeable and each one is someone that the viewer could relate to someone they know in real life, or even themselves. \\n\\n\r\nI have nothing bad to say about any character in this entire series (even the ones that have not made their appearances yet) and that's something really miraculous for me. I generally like only a few characters from each series, but, I can honestly say that I love every single character very dearly and have related to each of them in some situation or another. This is by far my favorite part of this series. \\n\\n\r\n-Enjoyment-\\n\\n\r\nWhat's not to enjoy about Kimi to Boku? Nothing is unlikable about adorable characters interacting with each other in adorable ways. There's heart, there's humor, there's tiny bits of drama, and just a lot of love between the cast. I fully enjoy this series and find myself laughing at various times, although, it seems like every time I watch a new episode, the smile won't disappear from my face. It's impossible for me not to enjoy watching these character's bonds grow and change, and watch the events that lead up to these changes. \\n\\n\r\n-Overall-\\n\\n\r\nThis anime gets high marks from me, especially because it's an adaptation. Usually, adaptions are done poorly, and viewers often get the wrong idea about the series by the lame anime adaption that an amazing manga got; though with Kimi to Boku, I love both the anime in the manga. I highly recommend anyone who's falling in love with these characters, or even enjoying themselves in the slightest, to read the manga. The manga is even more incredible than the anime, although, the anime is very close to being perfection. There are, of course, changes that have been made in the adaption, but, this series has a very nice flow, and I am ecstatically awaiting seeing the rest of this season's episodes, as well as the second season.",
            "date": "2011-11-10T18:37:00+00:00",
            "helpful_count": 56,
            "mal_id": 47239,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400600.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nightrays",
                "username": "nightrays"
            },
            "url": "https://myanimelist.net/reviews.php?id=47239"
        },
        {
            "content": "I myself think that Kimi to Boku is a must watch show. I personally think that it doesn't matter when and how often you watch it either. Kimi to Boku is one of those anime's where you can come home from a rough day of work and watch. For me, I thoroughly enjoyed Kimi to Boku and I hope that after reading this review, you will too.\r\nStory: 9\r\nI really liked the story in Kimi to Boku. I like it's simple school life style and I myself believe that the way the way they went about making this genre work, and not get boring, was reallywell done.\\n\r\nNormally in a lot of slice of life, school life anime it's very easy to get bored. I'm sure well all know this well. But with Kimi to Boku the story hooked me at the start. The story in Kimi to Boku was simple, yet effective. At the end of the anime I didn't feel the 'void of emptiness' after watching it. Instead, I smiled to myself thinking, \"I really enjoyed that.\" \\n\r\nTrust me on the fact that you'll laugh at the stupid things that happen and the giggles between characters.\\n\\n\r\nArt: 9\\n\r\nFor these kind of anime's I always think that it needs to be simple; and that's what Kimi to Boku did. It kept it's art simple and so, it wasn't sore on the eyes. After coming home from a hard day of work you don't particularly want to see vivid colors. The art style in Kimi to Boku was smooth, and I myself had no problems with it.\\n\r\nIt's very pretty.\\n\\n\r\nSound: 8\\n\r\nWhile watching Kimi to Boku I thought to myself every time  I heard a soundtrack play, \"I've heard this before...\" The soundtracks in Kimi to Boku are very repetitive and so, it at times may not be ear candy. In the first half of the first episode of Kimi to Boku not much music played at all. Though, I believe myself that it was made like that to make the pacing seem slower and to make it seem more realistic. Towards the end of the anime, they play more soundtracks and for me, that's ok. I would've put sound at a seven if it wasn't for the fact that even if the soundtrack is repeated more than a few times, they were good soundtracks. Kimi to Boku used the right soundtracks at the right time and that's not something every anime can do.\\n\r\nThe sound effects in Kimi to Boku weren't much to talk about but they were there. They made me laugh too. :)\\n\\n\r\nCharacter: 10\\n\r\nWow. This anime made me love every character. There was not one character I hated. The character development in this anime was very good and I became attached to them. What I was in awe about was the fact that even if a character only had one episode, you could still call them a character. They seemed just as important as the main characters and had an amazing amount of character development for such short time that they had. \\n\\n\r\nEnjoyment: 10\\n\r\nThere's not much I can say here since I've pretty much already stated above my opinion and enjoyment out of Kimi to Boku. Every end to every episode left me wanting more. It was a very enjoyable anime and if you decide to watch it then I hope you enjoy it too. I remember not being able to wait until I got home to watch this anime. I hope you feel that way also.\\n\\n\r\nOverall: 10\\n\r\nKimi to Boku is a hit or miss honestly. It's like marmite; you either love it or you hate it. The slice of life genre isn't something for everyone but, even if you dislike slice of life, give the first few episodes a try. I myself don't particularly watch slice of life unless it's striking, and this was. It seems simple yet the comedy and the characters in it will make you smile. The sound is good, the art is cute and smooth and the story is just what a normal highschooler may want their life to be like.\\n\r\nGive Kimi to Boku a try, I really enjoyed it.",
            "date": "2015-03-24T13:58:00+00:00",
            "helpful_count": 49,
            "mal_id": 183259,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4514625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jebbika",
                "username": "Jebbika"
            },
            "url": "https://myanimelist.net/reviews.php?id=183259"
        },
        {
            "content": "Kimi to Boku is a series about a group of four (later five) teenage boys and them finding things to do in their everyday lives. And...that's it, really.\r\nKtB is truly a slice-of-life show, but I am of the opinion that even SOL series deserve actual plots and in this way, KtB falters. There isn't much plot to speak of. Most of the time, the \"plot\" deals with the boys doing ho-hum everyday things, like reliving childhood memories, drawing manga, or even contemplating what to do because they're bored (I kid you not). Every now and then, things get somewhere interesting - for example, the culturalfestival episodes were fun, as was the venture to the boys' former middle school, where they meet Shun's younger brother. Other episodes were downright boring and entirely forgettable; these mostly dealt with the boys sitting around and talking about things (I can't even tell you what of because I don't remember and frankly don't care). Indeed, I nearly fell asleep during the first episode because all the characters did was talk and relive flashbacks that weren't that interesting.\\n\\n\r\nNow, a lacklustre plot can be somewhat forgivable if the series had great characters. For the first few episodes, our main cast of boys numbered four - Shun (the soft-spoken, effeminate one), Kaname (the straight man and the glasses guy), and Yuuki and Yuuta (the twins). However, they're all either so quiet or deadpan that they don't make for a very entertaining group to watch. Like I said, the first episodes deals entirely with them talking about things. Even the introduction of the stereotypical tsundere in the second episode doesn't help spice up what little plot there is. In fact, the tsundere, Masaki, is one of the more annoying characters, who is more \"tsun\" than \"dere\" and gets upset at the tiniest offer of help. For the record, she doesn't get much better by the end of the series.\\n\\n\r\nThe group only really livens up when the fifth member, Chizuru, is added. His boundless energy and enthusiasm adds a different dynamic to the main cast - he contrasts well with the deadpan twins and the quieter Shun and gives the straight man Kaname a better character to work off of for comedic effect. At the same time, he adds a bit of a love triangle with Masaki (the tsundere). Still, Chizuru alone isn't enough to save the plot from its own blandness. Nevertheless, the show does become less boring with him around because at least when they sit around and talk, there's some energy in it.\\n\\n\r\nAlso, in later episodes, the group comes across other characters who, through their own plots or development, give the main cast some depth that we would otherwise not see. For example, when Yuuta goes on a date with a shy classmate, we get a glimpse of his personality underneath his emotionless exterior. Unfortunately, such instances seem to occur only when they meet people outside their group rather than when the main cast is together. I would have liked to see the main guys develop within their group as well as without, like in the case of Ouran High School Host Club.\\n\\n\r\nAnimation-wise, there isn't much to see. That's not to say it's bad; it's just simple because that's all the show requires. Basically, there's nothing notable about it, good or bad.\\n\\n\r\nIn terms of sound, the music, like the animation, isn't very notable or memorable for anything. I'll admit, though, I have a fondness for the OP \"Bye Bye\" by 7!!, which has cute melody and a catchy opening beat. I have no complaints about the voice actors/actresses, who I guess had to work within their given characterizations.\\n\\n\r\nSo, really, is there anything truly notable about Kimi to Boku? Well, no. Is it a bad show? Well...that depends on how you see it. Frankly, I don't think of it as bad but it's far from memorable. Other slice-of-life series I've seen had something to distinguish them - Aria had a beautiful utopian society with a dash of fantasy; K-ON! had catchy music and \"moe\" girls; Azumanga Daioh had off-beat humour and even more off-beat characters. Kimi to Boku has...cats? Look, I don't know, I'm trying.\\n\\n\r\nIf you like action, drama, and fast-pace plots, then Kimi to Boku is not for you. If you like slice-of-life, give it a try but if you don't like it by the third or fourth episode, it's probably not for you, either.\\n\\n\r\nEDIT: It's been about 2 years since I finished this series and wrote this review. Suffice it to say, I can barely remember a single thing about this series. It was simply that forgettable for me.",
            "date": "2012-01-02T09:50:00+00:00",
            "helpful_count": 46,
            "mal_id": 50741,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/122361.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Aeterna",
                "username": "Aeterna"
            },
            "url": "https://myanimelist.net/reviews.php?id=50741"
        },
        {
            "content": "Kimi to boku...\r\n... well of course one of my all time favourites!\r\nMale or female, old or young; it's an anime for everyone!\r\nLet us begin with the Story:\r\nIt's simple, not too complex - but that's why it's so wonderful watching it! Because everything that happens, happens so naturally, without any kind of pressure. It's such a pleasant story! And as the story goes on, you might begin to care about these guys!\r\nThat's the next strong point; the characters! When I started watching it, I liked them all form the very first minute, the very first episode! They've got all their own personality, filled with their ownskills and weakness, like in the real world! They get along, more or less, with each other in a quite lovely way, even tough at first they don't seem so close to each other. But as soon as Chizuru appears... ou well, just watch it ;) \\n\\n\r\nThe Art & Sound of the anime, well, one word: beautiful!\\n\r\nEven the silent, sometimes seemingly unimportant background music add so much emotions and life to the anime, that, when you're later listening only to the Music you might ask yourself; have I heard this? Was it in the anime?\\n\\n\r\nI felt so happy watching it and I always wanted more, more, more!\\n\r\nSo if you haven't yet watched it; do it!\\n\r\nIf you haven't had the time; take it!\\n\r\nIt's worth watching it!",
            "date": "2014-11-25T01:48:00+00:00",
            "helpful_count": 27,
            "mal_id": 169859,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4269669.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MestariYN",
                "username": "MestariYN"
            },
            "url": "https://myanimelist.net/reviews.php?id=169859"
        },
        {
            "content": "It's really hard reviewing a series after it first came out, so please bare with me. (Note: this review will be updated throughout the course of the released episodes)\r\nKimi to Boku (You and Me) is an anime that revolves around 5 childhood male friends who have started their second year of high school.\r\nStory\r\n--------\r\nThe story is pretty fair so far. Since it is a slice-of-life anime, the pacing might be a little too slow for some people, whereas others can find it to be calming. I personally think that this anime could develop into something bigger and more entertaining as the episodes progress. There is somuch potential for a slice-of-life revolving around an entire male cast and their daily lives, unlike the typical 'moe girl' one. This might be one of those few rare findings where the entire main cast consists of boys, but it does not belong to a shounen-ai category, which is a good thing for those who are not a fan of that genre, although shounen-ai lovers can enjoy Kimi to Boku the same.\\n\\n\r\nArt\\n\r\n--------\\n\\n\r\nThe art is 'ok'. I have not much to comment about it. It isn't very detailed or very plain, but somewhat in the 'neutral' zone. One thing I immediately noticed upon watching this series is the character's 'eyes'. Even though there is not much to complain about them (they ARE rather unique in terms of style), but in the end you get used to this art type and go along with it. The colors are pretty calming and soothing.\\n\\n\r\nSound\\n\r\n---------\\n\\n\r\nNot much to say about the sound. It's pretty decent, and flows along with the plot line. The slow scores and cheerful ones fill in the gaps of the 'everyday life' feel.\\n\\n\r\nCharacter\\n\r\n---------\\n\\n\r\nThe characters are pretty likable, and since this series has just started, we don't know much about their background. They all fit into the typical stereotypes, although some produce a good fair amount of uniqueness in them. In the end, the viewer is able to relate to and enjoy the character's actions.\\n\\n\r\nShun -> Many complain that he looks like a girl, but because of promotional art, we know that he'll soon cut his hair (maybe that will bring all the 'complaints' down). He's a pretty likable character and is the 'optimistic' one out of the group.\\n\\n\r\nYuki -> Likes manga, the younger of the twin brothers. Is quiet.\\n\\n\r\nYuta -> The older twin, talks a bit more. Not much is known about him, till now.\\n\\n\r\nKaname -> The strict one who keeps all the friends in order. Despite the fact that I don't really relate characters from different series, Kaname gave me the 'Kyouya' feeling (Kyouya from Ouran High School Host Club).\\n\\n\r\nChizuru -> Still did not make his appearance.\\n\\n\r\nEnjoyment\\n\r\n--------------\\n\\n\r\nThe pace is slow, but mellow. This might change after more episodes are released though. overall, I think one can enjoy Kimi to Boku pretty well. If you hate slow every-day-life ongoings, then I don't recommend this series, although, as I mentioned before, this is an 'early series' review, so this might change with the introduction of more characters, and possibly a 'plot'.\\n\\n\r\nOverall\\n\r\n---------------\\n\\n\r\n7/10\\n\r\nDecent anime with quirky characters and a stable storyline. As I mentioned (countless of times) this might change soon (my rating might either rise or drop). If you're a fan of slice of life and would like an anime that focuses on the everyday life of male students, then Kimi to Boku is your anime.\\n\\n",
            "date": "2011-10-11T05:59:00+00:00",
            "helpful_count": 19,
            "mal_id": 45305,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/280922.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kurimu-chan",
                "username": "Kurimu-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=45305"
        },
        {
            "content": "What? An anime with 5 male characters as leads? That's gotta be BL and bet its nothing more than bait for fangirls, right? WRONG! Kimi to Boku has nothing of the sort. Its simply a very pleasant anime to watch for both guys and girls. I'm a straight guy myself and I had no trouble watching this so lets get that misconception out of your mind.\r\nSo the anime's about a group of friends. Four childhood friends and a blondie who happened to get intertwined with them. There's no plot, so to say coz the anime just shows you incidents from their high-school years but that'smore than enough to tell you that this anime is only for those who truly enjoy Slice of Life themes and love simplicity amalgamated with humor. For those who don't... Best move along, find something more mature.\\n\\n\r\nLike I mentioned, the anime is simple. Its art is simple. The music is simple. The jokes are simple. And then there are the characters who seem simple enough but are so much more than that. Again, each of the 5 characters behave uniquely and they're all opposites of each other, in a way. Even the twins are distinguishable by actions, clearly. As the story builds on, throwing anecdote after anecdote of their lives, these instances only get funnier by the episode. The characters are drawn to look very adorable, though some of the female characters are hard to distinguish from each other. The pace is kinda laid back and slow but still engaging with all the moments that can either make you laugh or urge you to recollect instances from your past. With the first season, it has also ventured into mildly romantic themes though it'd really take the next season to tell you where they lead. All in all, the focus is solely friendship and they've nailed that through, perfectly. They've also got cats. A lot of 'em.\\n\\n\r\nI was blown away by both, the opening theme as well the ending song, especially the ending where they've applied the beautiful effect of cross-fading the start of the song with the last few seconds of the anime which makes the episode all the more special. The rest of the music that is featured is also pleasant and fitting for the setting of the anime. Not much to criticize since the anime has accomplished all it had aimed for. The only thing might be the lack of an evident storyline but it makes up by delivering in everything in a non-cliche, non-cheesy manner. It starts off rocky but peaks quickly and stays there. So do persevere the initial 2~4 episodes, at least. Did I mention they have a lot of cats? :3\\n\\n\r\nSo what is Kimi to Boku?\\n\r\nIt is the perfect episodic anime to add to a tough day at work since it calms you down perfectly without provoking the least complex of thoughts. I recommend this to everyone looking for something light to watch while following something rather heavy. In my opinion, unexpectedly, the best anime of the Winter 2011 releases from amongst those I've watched.\\n\\n\r\nMy Evaluation: 9/10",
            "date": "2011-12-30T07:16:00+00:00",
            "helpful_count": 19,
            "mal_id": 50485,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/708577.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZedSaint",
                "username": "ZedSaint"
            },
            "url": "https://myanimelist.net/reviews.php?id=50485"
        },
        {
            "content": "It's not a Boy's Love so what's the point in watching this?\r\nI love slice of life animes, I try to look for them whenever I can, and when I say Slice of Life i mean true Slice of life, not Slice of life in space or slice of life with magical powers. What I love about slice of life animes is the realism with the stories in characters, I love watching things that could possibly happen in real life. Sadly there are too many supernatural stories listed as Slice of life. So when I read the description for Kimi to Boku I was really happy,a true slice of life story FINALLY! I was eager to sit down and watch.\\n\\n\r\nThe first episode introduce us to the characters who had been friends for many years blah blah. I won't go into the details because you should know the story by now from reading the description.\\n\\n\r\nThe first episode wasn't that exciting, but I forgave its lack of excitement because it was the first episode and we were just getting to know the characters and at first I thought the random cat shots were odd, but they grew on me and actually it is the only thing about this show that is interesting.\\n\\n\r\nDon't get me wrong, the show had some good episodes, such as the one with Yuki playing with a foreign boy when they were young. It was cute and just shows that even if kids can't speak each other's languages they will find ways to get around that and have fun.\\n\\n\r\nHowever, the good is not enough to keep me glued to the story..why? Because there is no story. So far each episode is more like a \"this happens in this episode\" type of deal. Such as Episode five can be wrapped up as \"Girl loses key chain\" The fourth episode was \"Kaname gets sick\" this is really a nothing happens show. I guess it wouldn't be so bad if the characters were interesting, but they aren't. They are all stereotypes you can find in other animes like Ouran Host Club, except Ouran host club characters were actually fun to watch.\\n\\n\r\nNot only are the characters uninteresting but the overuse of flashbacks really weigh the show down because they have nothing to do with anything that is happening in the episode, but then again since nothing is happening in the episode the flashbacks seem even more pointless. Flashbacks should enhance the story while giving the audience important info. Do we really need to know for the one millionth time that Kaname had a crush on his Kindergarten teacher? I think we have had four flashbacks on that alone. yep four on just that and we are only on episode five. (Although, thankfully there were none in the fifth) this show relies heavily on flashback storytelling, but the flashbacks leads to nowhere. i found myself not really looking forward to the next episode and I only watched the fifth episode to give it a decent chance.\\n\\n\r\nHere are my pet peeves that really makes me not want to continue:\\n\\n\r\nThat little girl is annoying. What is up with animes that either have the super sweet boring girl or the annoying brat b**ch? Like girls are all one extreme or the other. Why can't they just have a cool girl to hang out with, who is regular and likes to play around too?\\n\\n\r\nShun, the pink haired boy is the male version of the super sweet boring chick. Now look, I don't mind girly boys but don't throw a girly boy into the mix and then not give me some sort of a gay storyline. at least attempt a coming out story (although I'm sick of those at least it is something) and no he doesn't have to fall for one of his friends (although at least there would be an actual story here). seriously, this kid is just gay, so gay his pillow was pink and had ruffles on it when they were kids. If they try to make him straight by giving him a female love interest (and no that annoying little brat is not a love interest) then I would just laugh cause he obviously does not like Va***as and neither does Yuki(one of the twins) for that matter. But he just stands around as the sickeningly sweet mother figure of the group.\\n\\n\r\nChizuru Tachibana. Soooo he was a German (I had to correct this, I thought Russian at first) boy who could not speak Japanese, yet not he is the most Japanese like out of all of them. And his name irks me more than anything. Why couldn't the writer look online or something and find a name suitable to his nationality?? I didn't know he was half Japanese until i read the synopsis here but it still irks me because why does he have to be half Japanese? Oh yeah so they wouldn't have to waste time looking up foreign names. \\n\\n\r\nOkay I've said enough. But this all leads back to my first sentence. I'm not some yaoi maniac that NEEDS yaoi in every story, but since there is no plot going on here they might as well give us some BL to make this worth looking at.",
            "date": "2011-11-04T18:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 46849,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/846605.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Hazegurl",
                "username": "Hazegurl"
            },
            "url": "https://myanimelist.net/reviews.php?id=46849"
        },
        {
            "content": "Heartwarming and funny moments passed between friends. This show has to be one of the sweetest ones I seen so far. At first I didn't think I would like it due to the fact there were no main female characters. How could I simply relate? But after watching it I realized male or female, young or old, this show will touch your heart. \r\nStory: 10/10\r\nNow, usually I don't like stories that don't really progress. But in Kimi to Boku I thought it was a plus. It one of those show that are just so fun to watch and leave you feeling bubbly inside. \r\nArt: 10/10\r\nTheart actually added to the bubbly feeling effect. Every episode or so they would stop at a sweet momment and show the picture in painted form. I don't know why, but in doing so they really made me look at the artistic parts of the show. \\n\\n\r\nSound: 10/10\\n\\n\r\nCan I just say I haven't heard one song on this show that I didn't like. Each of the songs are now downloaded to my computer. I'm serious, it all surrounds that good time feeling. The songs make the show that much sweeter. Even the seemingly unimportant background music add so much life to the show. \\n\\n\r\nCharacters: 10/10\\n\\n\r\nAt first the characters seemed pretty bland, and not so friendly. Seriously the only nice one out of the group was Shun. And I couldn't really see them as childhood friends. Even in the summary it says they are neither good nor bad friends. Which is pretty sad.\\n\\n\r\nBut then the transfer student comes into the picture.\\n\\n\r\nI really think that the transfer student,  Chizuru, is the ribbon that \\n\r\nties the group of friends together, because the first few episodes I was wondering why they didn't seem that close. But after Chizuru comes into the picture. It seems they all get along like they should have in the beginning. \\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nThe main thing was Enjoyment with this. I actually felt happy watching this, It has a real calming effect for some reason.\\n\\n\r\nThen after I finished it and got back to real life I realized how lonely I was. But the point is, the captures you're attention in a real subtle way.\\n\\n\r\nOverall: 10/10\\n\\n\r\nReally, this is going to be one of my new favorites. I say you should drop all the suspicions or doubts you may have and just watch it. You won't regret it!",
            "date": "2013-06-02T14:15:00+00:00",
            "helpful_count": 12,
            "mal_id": 99505,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2650533.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SecretAnimeLover",
                "username": "SecretAnimeLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=99505"
        },
        {
            "content": "Extremes can fail, even in anime, but Kimi to Boku pulls it off.  This is a show based on the manga of the same name, that in a phrase is the Seinfeld of highschool anime shows.\r\nNo, I'm not referring to its popularity or critical reception, but to the fact that while most other shows have a gimmick, Kimi to Boku is essentially a show about nothing.  This is slice of life anime taken to its extremes, and as someone who enjoys the genre (guilty pleasure), it's sort of fun. \r\nEarly reviews of the series berated it for its predictability  \"oh there's thetsundere, we know how that will turn out!\" but the show takes those expectations and turn them on its head.  The character is quickly relegated to a supporting role and exits the narrative until much later, and ultimately doesn't affect the narrative in any meaningful way.\\n\\n\r\nAlthough there is the faintest character and narrative arc, each of season 1's 13 episodes are essentially self-contained vignettes on the life of a group of high school kids (mainly focusing on the boys).   Call it gender preference, but in a way, the focus just on the male shenanigans sort of reminds me of my own high school experience with my clique of friends.  The romantic melodrama is relegated to the side.\\n\\n\r\nIf, after all this, you're still undecided on whether to take the plunge,  I can also mention Cats.  Yes, this show cuts away to shots of Cats and kittens as a kind of narrative punctuation, ending a scene, splitting a scene of exclaiming a scene.  \\n\\n\r\nOh, the watercolor look that seems to be in vogue of late also works brilliantly in this show and features one heck of an opening song.  I've  drifted away from JPOP since graduating from university but Bye Bye! is one catchy tune that I can't stop playing.\\n\\n\r\nKimi to Boku isn't going to win any awards or top anyone's lists, but it is genuine, and just a lot fun to watch.",
            "date": "2012-01-03T00:51:00+00:00",
            "helpful_count": 12,
            "mal_id": 50801,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/721723.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wuster",
                "username": "Wuster"
            },
            "url": "https://myanimelist.net/reviews.php?id=50801"
        },
        {
            "content": "Kimi to Boku has a simple plot which tells the everyday life experiences of 5 highschool boys and reminiscing their childhood memories together. Though the story isn't complex, it isn't boring to watch and it has a natural comedy in it. If you are a teenager, you can somehow relate on their experiences...\r\nwhen i first found this anime, I thought it was boring because of the drawing and simplicity of plot. But, as I watched it, it is rather enjoyable and fun to watch. I became fond of each of the characters because of their personalities and the way they relate and care for eachother.\\n\\n\r\nIt really made me laugh and smile. :)\\n\\n\r\nalso! I liked it because there are a lot of cats [which sometimes represents the characters of the story] which are really adorable. X3\\n\\n\r\n[looking forward for Kimi to Boku season 2!]",
            "date": "2011-12-28T23:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 50365,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/401654.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/chiisaihimawari",
                "username": "chiisaihimawari"
            },
            "url": "https://myanimelist.net/reviews.php?id=50365"
        },
        {
            "content": "-my first review, be gentle! I just wanted to tell everyone what i feel about this anime, that i feel very close to me-\r\nHave you ever had a group of friends you care a lot? Kimi To Boku is a story about the everyday life of five teens, bound together by the most beautiful relationship that can be established between people: friendship. Representing quite normal situations, Kimi To Boku can warm the heart of the spectator, through the use of beautiful phrases, moving soundtracks, and the feeling of closeness with the situations that happen to the protagonists. If you have special friends in your life,you would understand that Kimi To Boku is a much more deep and moving anime than it seems. But if you don't, you'll maybe just enjoy a normal slice-of-life anime, without knowing how much fantastic this anime is.\\n\\n\r\nStory: 9\\n\r\nKimi to Boku has no particular plot, so it's not fair to give full marks to it. However, the simplicity represented by this anime succeeds in every way to involve the viewer, making it enjoyable until the end of each episode. I found great the use of past scenes of the protagonists, which outline a simple but also stable plot. Also, some scenes will make you laugh out loud, but other scenes are very touching. It's impossible to be bored watching this anime.\\n\\n\r\nArt: 10\\n\r\nThe art of Kimi to Boku is very simple, yet so beautiful. First, it is almost totally devoid of the stereotype of the \"unnatural colored hair\" typical of Japanese cartoons (except for Shun, who has red hair, but hey, even I have natural red hair, so it's okay!). The style vaguely reminds me of other animes as Usagi Drop, that I've always praised for its exquisite designs and vibrant colors. Another thing to praise are the drawings of cats in Kimi to Boku, almost perfect, they look so real.\\n\\n\r\nSound: 10\\n\r\nProbably, the soundtrack to Boku Kimi is the best thing of all the anime. Starting from the opening, which I believe is one of the best among all the anime ever made, until the ending, which is also wonderful, all the soundtracks in it are very well made, and that's especially thanks to them that the whole anime creates an atmosphere of happiness mixed with a nostalgic feeling. It gives the spectator the sensation of good memories, remembered with nostalgia and melancholy, which is perfect in the anime context.\\n\\n\r\nCharacter: 10\\n\r\nThe 5 main characters are different from the typical anime chracter stereotype.\\n\r\nShun is feminine, tender and altruist, the typical \"good person\" that can hardly be found as a main character in an anime.\\n\r\nYuta, Yuki and Kaname have kinda the same cool attitude, but they're nothing like the typical cool characters which not comunicate with anyone and are closed in themselves.\\n\r\nChizuru is the classical genki boy, maybe the only stereotype in the serie, but also a good character that i've appreciated a lot.\\n\r\nI also love the other characters: they are more attached to the classical stereotypes, but their presence in the anime is very important for the plot develop.\\n\\n\r\nEnjoyment: 10\\n\r\nI love this anime. As I said, the fantastic soundtrack, the funny situations, the never boring characters, the good art and the heart-warming situations make this anime very enjoyable and watchable by everyone.\\n\\n\r\nOverall: 10\\n\\n",
            "date": "2011-12-26T14:10:00+00:00",
            "helpful_count": 11,
            "mal_id": 50203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/300100.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SanzuNoKawa",
                "username": "SanzuNoKawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=50203"
        },
        {
            "content": "I don't really know how to explain this anime, since I've only watched the first episode. However, the first episode so far, in my opinion, as for as a slice of life genre, is really enjoyable. I find Kimi to Boku really cute. \r\nIt's a bit slow, then again it is the first episode only. I love the adorable flashbacks. \r\nMaybe I'm just being biased at the same time because I just have this huge attraction to pretty boys, and Shun is such a pretty boy; He's way too cute.\r\nThe art is really really nice though. I think I will end up really liking thisanime despite the first episode being a bit slow. (:",
            "date": "2011-10-09T04:48:00+00:00",
            "helpful_count": 10,
            "mal_id": 45153,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/604819.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kuporru",
                "username": "kuporru"
            },
            "url": "https://myanimelist.net/reviews.php?id=45153"
        },
        {
            "content": "I'm a fan of slice of life animes, and Kimi to Boku just gives that to such fan.\r\nIt is very slice of life, there's no plot and every episode has different events. \r\nStory:\r\nThere's really no plot and it is what slice of life is great for, you don't really need one. You can just have fun on watching the happenings of five high school students and their funny relationships with other characters. There's a bit of romantic story in each episode tackling all of the characters. \r\nArt:\r\nThey say that this anime's art isn't noteworthy but I don't think so. The art is very expressive andevery time they give off a joke or just doing stuff they have this kawaii expression that would make you burst to laughing.\\n\\n\r\nSound:\\n\\n\r\nThis anime got all you need for awesome JPOP music, this has a wonderful opening courtesy of both 7 Oops and Tomohisa Sako... just wonderful and very wonderful ending themes and background music in climatic scenes it just captures the moment and would make you watch more. \\n\\n\r\nThe voice acting in this anime is so great. Shun's voice delivers what the character is all about, feminine and kawaii, it just awesome, I love his voice. Chizuru also has a wonderful voice, energetic and fun that truly makes him lovable. All the other characters have good voice actors.\\n\\n\r\nCharacter:\\n\\n\r\nThis anime has outstanding characters. Even though you would see Kaname, as the four eyed character, there's something that would make you care for him and love him. Shun is very likable and beats the moe characters in other shows (and he doesn't even try being cutesy). Yuuki is awesome so does his twin Yuuta and their tag team are very much awaited in every episode. We also can't have this show without Chizuru that brightens every episode with amazing punch lines. Surprisingly Masaki goes a great character development.\\n\\n\r\nEnjoyment:\\n\\n\r\nI ENJOYED IT A LOT!!!!!!!!! AND I MEAN A LOT!!!!!!!!\\n\\n\r\nOverall, this is a must watch anime that would hook you from beginning to end.",
            "date": "2015-02-01T04:53:00+00:00",
            "helpful_count": 10,
            "mal_id": 179415,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3825147.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NoonebutMark",
                "username": "NoonebutMark"
            },
            "url": "https://myanimelist.net/reviews.php?id=179415"
        },
        {
            "content": "Re Review  : ) I love Slice of life anime. Kimi to boku or( You and Me)  is about 4 childhood friends who are now in their High School year.  They meet another new  friend Chizuru who quickly becomes one of their best friends. He makes their daily lives entertaining and interesting. The story of Kimi to boku deals with every day life which everyone who watches this anime can relate too- whether it be love life  friendship, etc.  I love the Op and ED song as it fits this anime perfectly : )  Kimi to Boku hastisi relaxing feeling every time i watch this show. I would recommend this anime to anyone who loves Slice of Life genre : ) Score 10/10 \\n\\n\r\nRe edit(after completing the series).I've enjoyed the 13 episode ride of Kimi to Boku. I feel i am a closer to them now : ).  Our lovable 5 main characters have learned something new about themselves and from each other as they continue to be closer friends. I wonder what will happen in Season 2 ( which starts in April)?? Will they still be friends till the end after High School??College??Married??ETC    I still give this series 10/10.",
            "date": "2011-11-18T15:26:00+00:00",
            "helpful_count": 10,
            "mal_id": 47655,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/834209.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnimeFan500",
                "username": "AnimeFan500"
            },
            "url": "https://myanimelist.net/reviews.php?id=47655"
        },
        {
            "content": "At first when I started seeing this show really thought he would be more or even get to see the first episode and then leave it a little sideways, but one day I decided to see him again until the end and I confess that surprised me time and regretted not seeing him until the end from the beginning.\r\n(Update: I just saw the anime, very good!)\r\nKimi to Boku, this show is really fantastic. He can do a very good connection between the characters, story and comedy, something few shows of this genre can do.\r\nHe tells the story of four boys during childhood friends from highschool live in situations where ordinary life of a student, Yuuki, Yuuta (they are brothers), Shun and Kaname give life to this show and are responsible for the success of this true work while Shun is more delicate and at times looks like a woman and is more fanciful, like cooking, Kaname makes the style more serious, studious and learned (but do not think that it is not funny!) and finally Yukki and Yuuta twin brothers where each one has its own personality and the same time you like surprises and confuses dois.No wait until a show with adventure, drama, action, he has nothing but it is a nice anime to watch and very fluid and clean.\\n\\n\r\nHis comedy is not forced in any way and is really fun is natural, loose, makes you laugh in every episode you watched, linked to good music that combines with past scenes, great graphics are extremely detailed and engaging characters that you can identify the voice acting is particularly good and is the highlight of this show dubbing combine comedy with an amazing way and that the brightness of the show, I think the show just becomes funny because of dubbing done extremely well and I believe anime genre for those who really his strong point but this has to be is meaningless and lifeless, each genre needs a strong point such as suspense, mystery songs have happy and funny ends the show as well as an anime adventure can not only obscure songs, but continued to speak well of the show, it's really amazing how well the producers chose the songs for each scene, and how each character has their own life and still the place for a bit of romance but do not expect the anime to focus on it after his main genre that is not (as much as an anime has always various genres will focus on one of them and Kimi to Boku is comedy! romance not) the novel appears in a few episodes I believe in a 4 but is well it feito.Each episode has a different story which makes everything funnier and more Slice of Lifes animes that may seem a bit monotonous this genre is on the rise lately and is constantly evolving and this show is proof he's no little boring and monotonous and really stands out from others in the same genre, it takes real life situations and turn them into a really fun comedy.\\n\\n\r\n================================================== ========\\n\\n\r\nStory: 8\\n\r\nSince this is an anime comedy is difficult to give a note to his story as each episode it is one different story with a beginning middle and end their focus is not on it but I will try an average of each episode and give an overall score.\\n\\n\r\nArt: 8\\n\r\nThe anime has 3 strengths, and art is one of them (next to the sound and the comedy and the characters) really his art is extremely detailed and well done, you do not notice major flaws and scenarios are well defined and you get to itself felt in the scene as the character.\\n\\n\r\nCharacters: 8\\n\r\nAnother strong point of the anime, the characters are not fully worked in front psychological, sentimental, but somehow they captivate you and you begin to get involved in the story with them, you start to like them and identify with them, is Funny how each character had his personality well developed and has its special peculiarities such as the twins Yuuki and Yuuta while the other one loves mangoes does not support this and do not even have a special taste, particular attention to the character Shun that in some moments recalls a woman is really funny how it looks like one, another highlight for the character I most identified myself Tachibana and the silly boy group that does everything becomes still best to watch each scene it really is incredible funny!\\n\\n\r\nSound: 9\\n\r\nOne of the high points of the anime really your sound is excellent since the opening song to the closing and the songs used in each scene and how producers had amazing care of this detail seems so irrelevant but that's life when the anime is as well used if this show really fantastic!\\n\\n\r\nEnjoyment: 9\\n\r\nFUN!! so you will not miss seeing this show, it is easy to watch, is not complex does not have those dramas and complicated things to understand he is totally straight, fluid and extremely funny! I believe that everything that purports to show he can do at a high level.\\n\\n\r\nOverall Rating: 8",
            "date": "2012-08-30T03:00:00+00:00",
            "helpful_count": 9,
            "mal_id": 71171,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/slyffer",
                "username": "slyffer"
            },
            "url": "https://myanimelist.net/reviews.php?id=71171"
        },
        {
            "content": "Dull Synopsis, you would think at first. You'd think the anime will be just a cliche. But I promise you, you'll be surprised. \r\nIt's true, the story is not one in a million. Yet, it's strangely warmer than all the other anime I've watched. It's not just about highschool or friendship, it's about intimacy between male characters you never see in other anime. Not that it's a shonen ai. It's what I would call a true yet enjoyable slice of life story. \r\nThe Characters are my favorite part. Distinct, yet believable. They are funny, but not outrageous. By the end of the first episode, Ifell in love with them. The interactions between each character and another is amusing. \\n\\n\r\nOverall, this anime is not Gintama. It's not Naruto or death note. It has a completely different feel to it. Yet, in it's own category, I would say it's one of the best. In fact, when I noticed that it was only rated 7, I looked through all my old emails to find the password to myanimelist, just to sign in and vote. \\n\\n\\n",
            "date": "2011-11-14T15:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 47471,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bellabambina248",
                "username": "bellabambina248"
            },
            "url": "https://myanimelist.net/reviews.php?id=47471"
        },
        {
            "content": "THIS IS MY SECOND TIME WATCHING THIS SERIES AND I'VE ALREADY GOT THE FEELS FROM WATCHING THE FIRST EPISODE!\r\nLike I said, this is my second time watching the series so I've really missed Kimi to Boku (KB for short). I absolutely regret not re watching this anime anytime sooner! At first when the anime came out I'd always get exited every week after school to watch the anime- though I haven't felt much anticipation since so I've always thought KB was a delightful series.\r\nKimi to Boku would be your typical cute and wonderful slice of life shoujo anime, revolving around four childhood friends (basically bestfriends)Tsukahara Kaname, Matsuoka Shun, Asaba twins Yuuki and Yuuta, that have known each other since preschool and now are second year high schoolers. The group starts having new adventures like meeting new friends such as Chizuru and Masaki, also bearing several sentimental moments along the way. Though this might be the case, I felt that the boys (Masaki isn't a main) really had a firm, crisp, bond, being   much better than the usual slice of life anime- with the fact of being super adorable!\\n\\n\r\nBecause of the anime being called You and me in English, (after being such a slowpoke) when I watched the anime again this gave me a thought of what ever affects you in the group affects everyone else too, giving me the idea of  that whatever moments you go through, all of them will embrace the happiness and pain with you. This gave me the reason of thinking that KB really is a lovely heartwarming show that any human being could watch anytime, making you laugh or cry you'll be feel merry at any moment you watch the anime. I couldn't help but realize that I smiled at every episode, also resulting in  a few tears of happiness too. I could re watch Kimi to Boku almost anytime, being a favorite that won't be scraped off my list anytime soon!\\n\\n\r\nKimi to Boku really is a beautiful yet simple story, with a better friendship like nothing else. These passionate moments could make you feel fluffy  in the inside often. Could this be captivation? Joy? Or just being emotional?\\n\\n\r\nAll I know is that Kimi to Boku really makes me feel happy.",
            "date": "2013-07-11T10:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 104849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1492591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tegaruheii",
                "username": "tegaruheii"
            },
            "url": "https://myanimelist.net/reviews.php?id=104849"
        },
        {
            "content": "This is a strangely addictive overdose of easy-going saccharine slice of life sweetness. I mean, I thought the first episode was totally bleh and yet I kept watching and in the end I became addicted. I hear cocaine works like that. Oh, wait, I wasn't supposed to say that out loud.  Ahem, anyway, on we go…\r\nStory:\r\nThe story is about the everyday lives of five friends. And when I mean everyday I mean hardcore everyday. There are exciting occurrences like buying stuff from vending machines, eating lunch and making photocopies (I'm not shitting you, this really happens). And yet, despite the uneventful storyline, this showbecomes strangely addictive. Perhaps it is the innocence and sweetness it exudes, perhaps it's the nostalgia of the happy schooldays you never had or even the ideal picture of friendship it presents. Whatever the reason, it is a very captivating story despite the detail that NOTHING HAPPENS! There is no conflict, no angst, no drama just a series of sweet little nothings. Sometimes, that is just what you need. \\n\\n\r\nCharacters:\\n\r\nTwins Yuuta & Yuuki: are a pair of lazy deadpan overachievers who love trolling people. At first, I did not much take to them because they were strictly reactive and passive characters. Yet, in the end they prove to be the source of some extremely snarky comedy moments. \\n\r\nKaname: is the exemplary, rigid student with a fetish for older women. His function is to be the straight man in many of the funny moments. \\n\r\nShun: is a totally girly boy who is gentle, kind, sensitive and loves baking and the colour pink. He provides the group with emotional support and he's also my ideal wifey…oh, wait, I wasn't supposed to say that out loud. Ahem…moving on. \\n\r\nChizuru: is the outsider that eventually becomes a part of the group. Many think he is an annoying, hyperactive brat but if you think about it his character is really necessary. He is the epitome of an energetic, active character. This is a quality none of the other characters possess, hence he is needed to balance things out. \\n\r\nSo, there you have it. At first glance the characters appear overly simplistic yet as you continue watching you see a wonderful fleshing out process. In the end you feel as if you actually know them and would really like spending time with them.\\n\\n\r\nAnimation:\\n\r\nNothing stellar and often sub-par. Yet this is not a show that requires flashy visuals so it makes no difference really. There is a lot of empty space, pastel colours and soft movements. Very soothing to the eye; it's like eating cotton candy actually. \\n\\n\r\nSound:\\n\r\nThe sound was so discreet I don't even remember it being there. I mean, there must have been some sound but for the life of me I can't recall any of it. Well, maybe I was just so focused on wanting Shun for my pet. Oh, wait, I wasn't supposed to say that out loud…\\n\r\nOP: A sequence of small moments to introduce the characters matched by a simple, bubbly little ditty. \\n\r\nED: A sequence of static pictures (stills: the budget anime's best friend) matched by a simple, cute little ballad. \\n\\n\r\nOverview:\\n\r\nThis anime is basically worth a 7 but I am giving it +1 for the frequent, random shots of freaky cats. \\n\r\nWill this show appeal to most people? No. It is too slow and uneventful. But if, on the other hand, you are fond of slice of life, sweet innocence and soothing lassitude you will like this. I certainly find myself looking back on it fondly and might actually want to re-watch it someday.\\n",
            "date": "2011-12-26T12:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 50199,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56329.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jigoku-n3ko",
                "username": "Jigoku-n3ko"
            },
            "url": "https://myanimelist.net/reviews.php?id=50199"
        }
    ],
    [
        {
            "content": "Edited from my previous review, with a few additions.\r\nWhat show doesn’t start off slow nowadays only for it to actually become better overtime? Unfortunately many anime viewers are impatient and if they don’t like what they see on episode 1 it’s dropped from their viewing schedule.  A good example for this would be the Fall 2011 series “Kimi to Boku”. It had to deal with the consistent comments of “OMG TEH GAY DO NOT WANT (an exaggeration but still..) and “It’s boring”. Now i can talk in depth about the latter criticism. As a hard-core slice of life fan, even i had the urgeto call KtB “boring” after the first two episodes. It was almost too realistic: a group of high school boys doing what high school boys usually do. No mechas, no ecchi, no outlandish premise but an everyday look at a regular group of friends. For most people this is just too mundane to give a watch but if you’re open to a slice of life series or this series is your first slice of life experience then watch till episode 3 and then you can drop this series if it still bores you. The hero who saves the show from total boredom and who also breaths life into these group of mundane characters is the boy with the straw-colored hair: Chizuru Tachibana. Chizuru brings more energy to the show than the entire cast combined and it takes a bit to get used to his personality especially in contrast to the more easy-going twins Yuuta and Yuuki, effeminate Shun, and Kaname the typical megane character. But after a while, the show becomes so much better: the cast really works well together, the stories are more heart-warming and the music works really well at times. At times i want to call Chizuru a walking plot device but his own personality gives the show life which spreads to the other main characters in due time. The stories are very heart-warming and you may think “Oh, wow i did that too!”. It’s a series about high schoolers, so expect to relate to one of more of the stories presented in this series.\\n\\n\r\nWhat really surprised me had nothing to do with the anime itself but the company involved with the production of it. If you were to tell me a year ago that J.C. Staff was going to animate a slice of life series with an all male-cast, i’d laugh at you. J.C. Staff is the biggest abuser of the tsundere anime character and the mascot promoting such characters (Rie Kugimiya) and most of their works are criticized for being unfaithful to the original source, bad pacing or sub-par animation.  Most of their series are about tsunderes or moe characters with little or no originality (tell me Hidan no Aria doesn’t resemble Shakugan no Shana?) and i was really fearing for the worst with news of this adaptation. \\n\\n\r\nLuckily it seems that my fears were quickly dashed and i commend J.C. Staff for doing a great job with this series even if it’s obvious they didn’t really put a lot of effort into it: the production values aren't anything special, the occasional CG sakura petals notwithstanding, and the character designs take a bit to get use to but it's nothing horrendous of the sort.\\n\\n\r\nI really love the voice acting in this series. Yuuta and Yuuki’s voices are so scary similar you actually think they are voiced by actual twins but in reality kudos goes to Kouki Uchiyama (Yuuta) and Ryohei Kimura (Yuuki) for doing a splendid job. Of course the real star is Miyu Irino as the spunky Chizuru, balancing a tight line from being too dull and too annoying. Other notables are Toshiyuki Toyonaga (Shun, also Flit from Gundam AGE and Mikado from Durarara!!) and Yuuki Ono (Kaname, many minor roles).  The insert songs used in the series are also timed perfectly in most cases, and surprisingly the singer of those songs is a guy! But the real treat for me is the OP/ED: I really liked the cheerfulness of the OP with contrast with the more reminiscent feel of the ED.\\n\\n\r\nTo wrap it up, Kimi to Boku was a sweet surprise that managed to pull itself out of the weak first two episodes to become a great watch for us slice of life fans and a good watch to anyone willing to give this show a chance.\\n\\n\r\n2011 was the year to not judge a book by its cover, and Kimi to Boku is one of the many examples of that rule.",
            "date": "2012-01-05T20:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 51031,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=51031"
        },
        {
            "content": "Good good, only a few people had written their reviews . Well maybe not, I didn′t check all; Ok so let′s start now!\r\nEven though Kimi to Boku is tagged under ‵Shounen′, doesn′t mean that it is only for Boys? Is it . If I were to choose between super girly themed anime; I′d rather choose one like Kimi to Boku. In this time of the year, you rarely find an anime like Kimi to Boku, surely you can find some anime whose story are about childhood friends, but most of them are about a boy - girl childhood friendship who becomes a couple afterwards—those kindof anime are rather common to us now.\\n\r\nYou could say that Kimi to Boku doesn′t have a plot or storyline; My conclusion is that the writer, wants us not to focus on a certain story, but on how they will develop their friendship and relationship to each other—how they strengthen their bonds and how they spend their spare times.\\n\\n\r\nStory;;\\n\r\n4 males, Kaname, Yuki, Yuta and Shun, who were friends since their early childhood, are still friends until now that they′re in their Highschool year. You rarely see a relationship and bond between males to be that strong. Mostly, women are the ones who are like that; but as I said, the 4 males are like that. They do what normal friends would do—eat together and go home together. One day, a new half Japanese transfer student was sent in their class; what trouble would this transfer student give them? Not realizing it, he became one of them, Tachibana Chizuru.\\n\\n\r\nArt;;\\n\r\nThough the art is not much what you can say much of an awesome art, it′s still acknowledge-able; surely it would, otherwise, her art wouldn′t be turned animated, would it?\\n\\n\r\nSound;;\\n\r\nNothing much to say about the BGM′s, OP′s and ED′s. But yes, it still needs to be criticized. There′s nothing wrong or unpleasant about the sounds and musics in the anime. Every scene that is strong has some sounds that are matched and you can really feel what it is. Felling at ease by the warm melodic sounds.\\n\\n\r\nCharacter;;\\n\r\nI′d say that all the characters are great the way they are now; nothing needs to changed. Their looks are accurate and matched from their traits and personalities. Like Shun, he is a bit of a shy type, she is like a girl, so she is a little petite. To much more look like a girl.\\n\\n\r\nEnjoyment;;\\n\r\nI′ve really enjoyed the Kimi to Boku, although I haven′t finished it yet. But I will surely be delighted to watch it till the end, and also I′m looking forward to the sequel (Kimi to Boku 2nd Season.). If you try to watch Kimi to Boku, I′m sure that you′ll like it the way I liked it much more. I encourage you to watch this Comedy - Shounen anime.",
            "date": "2011-12-08T09:30:00+00:00",
            "helpful_count": 7,
            "mal_id": 48765,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/334452.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Hengao",
                "username": "Hengao"
            },
            "url": "https://myanimelist.net/reviews.php?id=48765"
        },
        {
            "content": "¨You and Me¨. I think that explains a lot when you hear about this anime.\r\nThere are a lot of shounen series out there that seems to not be able to survive without an strange adventure or some  out-of-this-dimenssion kind of development. Kimi to Boku breaks with all that.\r\nIs  a slice-of-life series  where you can be sure that´s  what you´re going to see. There are no super powers, nor beings for another galaxy nor mythical creatures: it´s about high-school boys and  their every-day lifes. It´s so beautifully refreshing that you can´t help but smile with every chapter.\r\nThe main characters are fourboys whom are friends since kindergarden, but that doesn´t mean they are super best friends, and a new guy that adds  to the pack. The general archetypes for shounen-series personalities are thrown away and you´re left with people  more real than what you can see generally.  Also, there´s a peaceful pace, with that beautiful aura of times that you can only live once. \\n\\n\r\nA characteristic of this series is that every chapter is narrated by one of the boys, without afecting the pace. Is as if each one is telling you their teenage stories, in a speech that can´t be classified as past or present, a beautiful narrative that gives you the chance to know each one as they really are, with their thoughts, ideas and feelings exposed, while you can enjoy what happens as it happens. \\n\\n\r\nThe art is also great: there aren´t those general bishies that go back and fort in any anime out there, it´s more like normal people you see everywhere. The music is gorgeus and every chapter is finished as if it where the last one, showing a new side of everyone and of the narrator itself.\\n\\n\r\nThe things you hold precious, the chance of being real with yourself or keeping an appearance, unrequitted love, and much more beatiful and real things awaits in this story.It´s a series that you must see one at a time, so you can enjoy it as it deserves.\\n\\n\r\nWhat are you waiting for? Give you the chance of enjoy this joyfully refreshing series. I´m sure that you will be left with the itching feeling of seeing it twice.",
            "date": "2011-12-15T08:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 49241,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/899123.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yui_Haruna",
                "username": "Yui_Haruna"
            },
            "url": "https://myanimelist.net/reviews.php?id=49241"
        },
        {
            "content": "Honestly, my method for finding anime to watch right now is to look at seiyuus that I love and finding anime that have at least a couple of them in it. I lucked out with this anime because the five main characters were all seiyuus that I love, so I have nothing but praise for the voice acting. \r\nThe art was a simplistic style that also wasn't too far off from the average anime style you'll see today. It isn't my absolute favorite art style, but it is familiar enough that it didn't bother me to watch this. The music in this anime was verylovely. It had a nice atmosphere that made me feel like I was watching a nice, mundane movie. \\n\\n\r\nSpeaking of mundane, the story isn't something that you're gonna cry over or get super excited about, but it is a very comfortable anime to watch. The characters make that possible by being as unique as they are. I think all of them were written extremely well despite not having much development put into them. They had personality. \\n\\n\r\nProbably the absolute best thing about this anime is the humor. Because of the seiyuus and the characters' relationships to each other, pretty much every interaction is absolutely hilarious. That's the main appeal to this story, I think. This is a really nice anime if you just want to hang out with some cool characters and have a good time. It's an easy, laid-back experience, and yet, I can't wait to watch more.",
            "date": "2019-01-02T18:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 297864,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=297864"
        },
        {
            "content": "Personally I don't really like slice of life in fact I could say I actively hate it and try to avoid it, but recently because of this anime I started watching slice of life. I first started watching this anime because my friend showed it to me. It was funny and you couldn't really feel the slice of life element in it. The producers love throwing in random scenes of just cats in the middle of everything. They'll be talking and then it's just a cat stretching. This anime is light-hearted and something you can laugh with your friends about. It's not the usual darkand gloomy ending of the female mc dying or leaving. \\n\\n\r\nStory- It doesn't really have that much of a story line. You have to watch it all the way though to understand some things but usually it's just Yukki and Yuta annoying Kaname and Shun trying to calm him down and Chizuru just acting like an idiot.\\n\\n\r\nArt- It's pretty good I feel like they put lots of thought into the cats lol\\n\\n\r\nSound- They have nice soundtracks especially when they try to add in the slice of life element to it. \\n\\n\r\nCharacter- I love the characters. Yukki and Yuta are my favorite because of the nonchalant attitude and how when it's just them two together you can really see the contrast between them. There's little to no character development it's almost the same the whole way through. \\n\\n\r\nOverall- I liked it. There were times where they got sappy and it kinda made me cringe but overall the humor was good and I got pretty attached to the characters\\n\r\nThat's all thanks for reading ^~^",
            "date": "2016-03-28T12:37:00+00:00",
            "helpful_count": 6,
            "mal_id": 214564,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5292091.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kittycats468",
                "username": "kittycats468"
            },
            "url": "https://myanimelist.net/reviews.php?id=214564"
        },
        {
            "content": "[Kinda spoiler free, but it's describe the story progression]\r\nIt's like a poem of childhood. The story isn't much of anything, but it feels warm and refreshing while making me want to go back and just hang out with my friends.\r\nThe way they show us that friendship and how it was related through alot of verses full of meaning it's so beautifull that I've added this one as a must watch, even not having a \"progression\" and end, but, this is the way it should be.\r\nThanks for reading and if you didn't watch this show yet, you really should to consider it.",
            "date": "2018-05-12T01:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 280342,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5269802.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/anjossm",
                "username": "anjossm"
            },
            "url": "https://myanimelist.net/reviews.php?id=280342"
        },
        {
            "content": "Kimi to boku is beautiful in its special and one of a kind way. I don't know if it would speak to anybody, maybe some people wouldn't like it even if they gave it a fair chance, but the charm isn't obvious, it doesn't jump at you as soon as you start watching it - you find the charm as you connect to it. For me that happened in episode 2, but I would understand if for others that would be different.\r\nI don't like dividing my review to story, art, blah blah, I'll just explain.\r\nThe story, characters, and directory, are magically down to earth andsoft. If you watch it expecting it to be good in the manners most anime go by, it'd be slow and boring, but these turn out to be beautiful in this anime when you just go with it. I always love anime where things are very down to earth and minimal, because then the anime feels alive, it feels like it's breathing, and when a beautiful moment comes, it truly speaks loud even though it's conveyed quietly. It feels more like real life and that's really beautiful, it makes it so I get actually surprised when things happen, I get much more connected to things because they speak to me directly, which doesn't happen a lot with other anime because there I expect to find some twist or surprise - and this quiet way is beautiful. The characters seem basic, but seeing them experience more and more things makes you start to understand them more and they start being important to you - and they're also not at all basic types lie they seemed at first sight. The comedy is hilarious, absolutely brilliant, and again, special and down to earth, which makes it a lot funnier to me. I laughed out loud a lot, I have a lot of pictures and recorded moment from the anime because they made me laugh so much, the comedy is very original and clever, and it's super funny. The little senimental stories they tell through the anime always really touch my heart, as they just feel so real, and they end up both making me adore the characters, and get a beauiful modest vibe, which I'm happy to be reminded of, I forget that modest things can bring me the most happiness a lot. I also think the author is very smart, this anime gave me insights to all sorts of things, for example the way Shun's caring and soft attitude often gets people who are precieved as angry and mean by others to open up to him. It's true that mean people are usually people who are having a hard time, and it's also true that we all often don't act like Shun but more like what we always do when somebody is being mean to us, and I'm happy to be reminded of this insight this way, I hope I could be more like Shun.\\n\\n\r\nThe music is 12/10, it's incredible, I don't know if I've seen an anime that nailed their music managment this well before. Every soundtrack is true quality content, each song is beautiful and stylish and brings a nuanced mood with it. Whoever was responsible for the music has an amazing ear. The OST tracks end up feeling really sentimental as they're played over more and more sentimental moments in the show.\\n\\n\r\nTo be honest, I don't know what made this show so beautiful - but I didn't want it to be over (I'm talking about season 2 as well) and I'm super thankful that I happened to stumble upon it so many years after its release. I hope by this review I could maybe spread it even to one more person. It conveyed beautiful slice of life messages and feelings to me, it was both a 20/10 experience getting to love this cast of characters and know about more of their experiences, and to get the message of the author, to understand how I shouldn't forget that making my life simple can be the best thing sometimes.",
            "date": "2018-04-18T08:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 278377,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4911276.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Eyal_Oged",
                "username": "Eyal_Oged"
            },
            "url": "https://myanimelist.net/reviews.php?id=278377"
        },
        {
            "content": "If you like slife of life, then this anime is for you. i am a big fan of slice of life and just fell in love with this anime. The first episode was ok, but at the 2nd episode, i just fell in love. Not to mention the calm opening and ending songs as well. Some comedy is mixed in too so don't worry. I would say this anime is not for everyone, only the ones who enjoy watching slice of life and the peaceful enviornments where good endings occurs.",
            "date": "2012-01-03T21:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 50901,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/430499.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mepiggy",
                "username": "mepiggy"
            },
            "url": "https://myanimelist.net/reviews.php?id=50901"
        },
        {
            "content": "PS: This is my first review so please be gentle.\r\nI decided to write this review to tell everyone how much I appreciate Kimi To Boku. Since the first episode I was hooked on this anime because of the simplicity of the image. Kimi To Boku for me is like a breeze from the sea very calm and quiet.\r\nStory: 9\r\nThe story involves four friends, two twins (Yuuki and Yuuto), Shun that looks like a girl (usually there are a lot of jokes about it) and Kaname who has a passion for older women. There are some romance between new characters. And later Chizuru (the blond) joinsthe group.There isnt  difficult to follow and has an addictive storyline. Perhaps I have become a junkie for poetry and for moments that depict friendship in this group that comes from childhood.\\n\\n\r\nArt: 8\\n\r\nArt is not anything fancy, I think what makes it special is its peaceful landscapes.\\n\\n\r\nSound: 8\\n\r\nThe song is really calm and everytime I hear the opening (Bye Bye「バイバイ」 by 7!!) and the finishing(Miku Sawai- Nakimushi) I started to dream  and thing in the little suprises that anime brings.\\n\\n\r\nCharacter: 9\\n\r\nThe drawings are not very strict. I think their personalities complement each other on the group. \\n\\n\r\nEnjoyment: 10\\n\r\nI see this anime in a couple of days. Everytime that I want to laugh or maybe do yoga( yes because this anime tranquilize me) I see it and feel better. Kimi to boku have everything humor, drama, romance and friendship.\\n\\n\r\nOverall:9\\n\r\nIf you have a group of friends maybe you will now what I am talking about Kimi to boku gives us how much we appreciate our friends and the power that friendship can have. I should mention that this is awesome!\\n",
            "date": "2012-01-03T12:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 50841,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/393627.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Delivra",
                "username": "Delivra"
            },
            "url": "https://myanimelist.net/reviews.php?id=50841"
        },
        {
            "content": "Usually unless it's some like, \"We aim to be an awesome band!\"\r\n\"We love cheerleading!\" or some serious drama is going then I can't really stomach plain slice of life animes...but this it the first time that I myself have seen one based entirely around a group of guy's, from a teenage boys point of view on friendship, love, and life.\r\nAnd while they have their perverse moments(none bad at all) I think it shows the true meaning of brother hood. I have laughed a lot with this anime and I am looking forward to season 2.\r\nIt's very interesting and I do recommend this to people, howeverif you have a strong dislike for cats, I suggest you do not watch this anime. :)\\n\r\n....I wonder if the creator has a cat girl fetish...?",
            "date": "2012-10-06T10:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 74235,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1388753.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/qichiro",
                "username": "qichiro"
            },
            "url": "https://myanimelist.net/reviews.php?id=74235"
        },
        {
            "content": "first review. here it goes:\r\nLike many others, I find it hard to describe this show. It's neither happy nor sad, comedic nor serious. There is only one genre that fits this. Slice Of Life.\r\nStory:10\r\nIt is about a group of guys who have known each other since elementary school who... don't do much. They eat lunch, do ordinary things that guys do (except maybe Shun), and reminisce about their childhood. there is a theme to each episode though that attracts the ear to listen to. \r\nArt: 9\r\nThe art is a bit plain, but it fits the atmosphere. I especially like how the cats represent the characters.nothing too special, but its right for this show.\\n\\n\\n\r\nSound: 9\\n\\n\r\nI like all the voices. Shun's bugged me on the first episode, but i got used to it. there isn't much sound apart from that, which, again, fits the show.\\n\\n\\n\r\nCharacter: 10\\n\\n\r\nSince the show is centered around the characters, they are naturally well developed. it's only the third episode and we already know so much about them. \\n\\n\\n\r\nEnjoyment: 10 \\n\\n\r\nIt's... hard to explain why I enjoy it. it is funny and serious, happy and sad, and there is a bit of romance without over doing it.\\n\\n\\n\r\nOverall: 10\\n\\n\r\nGreat story line, Outstanding character development, well executed. just watch it and you'll see why.\\n\\n\r\nNot your run of the mill Slice-of-Life. More realistic, yet interesting to watch.",
            "date": "2011-10-22T21:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 46059,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/757981.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/otakuintraining",
                "username": "otakuintraining"
            },
            "url": "https://myanimelist.net/reviews.php?id=46059"
        },
        {
            "content": "I'm a huge sucker for character development and designs and that's why I instantly got hooked on this anime. It's so relatable and all the characters are lovable. It's a comedy and I was laughing so much at least every episode. Some episodes get very deep in the characters and their feelings. As I said though, it's very relatable and light-hearted and fun. Please watch this anime, it's so amazing and the characters are phenomenal. The only complaint I have is that there isn't more seasons!!!",
            "date": "2015-05-30T21:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 189222,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/maru-magus",
                "username": "maru-magus"
            },
            "url": "https://myanimelist.net/reviews.php?id=189222"
        },
        {
            "content": "Kimi to Boku. A story about five friends who have a heck of a fun time (maybe not for Kaname) and we see their relationships and everyday life pan out. At first I didn't really know how good or bad this anime was going to be, but after watching the first few episodes, I was hooked and wanted to watch more.\r\nStory: 9\r\nThe story follows the life of the five main characters, and with it the usual and unusual events that unfold. This show doesn't have too much of a deep plot, as it is a slice of life, but we get to see many differentthings happen and it is a joy to watch if you like that. There was more comedy than I originally expected, which was great as I particularly like the way it is done in this show. It is a very 'light' show and is very relaxing, and for me is certainly a 'feel good' anime.\\n\\n\r\nArt: 8\\n\r\nI found the art in this show was nothing spectacular, but it was that which made it great. The simplistic design complements the general feel of the show, and it's very easy on the eyes. A very enjoyable feature in this anime that you art lovers will like is that occasionally at certain scenes (usually near the end of the episode) the screen will pause and fade into a watercolour version of that frame. These pictures are also used in the ending, which is a pleasure to watch. One thing though, what's with all the random cats?! I found it strange how cats are shown as some kind of transition between a lot of the scenes. Otherwise, fantastic art.\\n\\n\r\nSound: 9\\n\r\nKimi to Boku. has some of the best background tracks I've ever heard in anime. There's sweet melodies for flashbacks, funky music for comedic moments and much more. These are all played at just the right moment to create a very 'alive' show that keeps you mesmerised. The opening and ending have great music, and special mention goes to the intro at the start of each episode, which I'm sure many people jump in glee to when they hear it. Each of the voice actors have very unique voices, which both contrast and complement each other. We have the Asaba twins and their monotonic (and often synchronised) speech, Shun and his quite feminine voice, Kaname who's quite brash and loud, and of course Chizuru who is very lively and childish.\\n\\n\r\nCharacter: 9\\n\r\nEvery one of the characters have a unique personality which, like their voices, contrast each other and complement each other to make a great show. The show takes turns to focus on each of the characters' lives, with quite a few flashbacks and this generates a deep background and depth for each of them. We get to see relationships develop and how their personality changes, and I think this gives the show has a massive amount of depth to each of the main characters.\\n\\n\r\nEnjoyment: 10\\n\r\nWhen watching this anime, I really enjoyed myself and found myself smiling and laughing along with the characters. I can really relate to some of them, and just the general easy going theme in this show makes it really great to watch. I'd recommend watching this if you're looking for something relaxing, funny, and all in all very enjoyable to watch. This is definitely a 'feel good' anime, and if you are feeling a bit down, just watch some of this and I can guarantee that you will feel better in no time.\\n\\n\r\nOverall: 9\\n\r\nKimi to Boku. is maybe not the show for everyone, but if you like your slice of life, this is a must watch. It is a great show to escape to, if you just want to get away from reality for 24 minutes and indulge in the antics of the five friends.\\n\\n\r\nThanks for reading, and if you have chosen to watch this I hope you enjoy it! It made me feel really happy, and I hope it does for you too!",
            "date": "2013-08-03T12:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 108059,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2909869.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KatakuriMojo",
                "username": "KatakuriMojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=108059"
        },
        {
            "content": "You and Me is an anime that I really enjoyed. It was hilarious and had me laughing throughout. For me, it's one of those anime's that I want to watch again and again. It had a simple premise that was executed well. Really well.\r\nStory\r\nThe story for You and Me is simplistic. Why? Because it's a coming of age story about 4 (5 later on) friends who have known each other since kindergarten. I feel that the story is told well because it shows us how they went from being really young and naive to old (not really old, only when they're teens) and mature. Thestory was not unique, but predictable. I do not find this a flaw for the story since I really enjoyed it nonetheless. You might find this a major flaw, but I personally don't. The comedy in the anime was really well done. I thought the bond between the characters helped with the comedy aspect of the story because it shows how close they really are. However, I have one flaw with the story. Well, not really focusing on the story overall but with the first episode. The first episode did not set good first impressions for me. I thought it was slow, dull, and boring. I thought that it would be an anime I would just forget and never watch ever again. I didn't even think I would complete the anime. Luckily, the episodes after episode 1 made up for that, so that's a really good thing. Overall, I really enjoyed the story of this anime. It had a rocky start, but it makes up with the future episodes.\\n\\n\r\nCharacters\\n\\n\r\nI am not going to go over every single character and give my opinion on them. Instead, I'm going to go over the characters as a whole. All the characters in the anime were well-rounded. All of them have their strengths and weaknesses. For me, it's your typical group of five guys: the smart one, the joyful one, the popular (or semi-popular in this case) one, the hyper one, and the silent yet funny one. This group to me is in no way a flaw for the characters. All of these characters are relatable in some way, which is a really huge plus for me. The supporting characters were great because they all helped the group in one way or another. I don't think there is an antagonist of any kind in the story. Then again, it's not that type of anime where you'll find a bad guy since it mainly focuses on our main five. Overall, the characters, both main and supporting, were great. All of them were well-rounded and really great characters.\\n\\n\r\nArt\\n\\n\r\nThe style of this anime is realistic. Obviously, because it's slice of life. The art and animation in this anime were fantastic. But, then again, all of the anime I've watched so far had really great art and animation. That applies to this anime. There is not a moment in this anime where I thought that the art and animation was bad. This type of art style really fit the story because, well, what other kind of art style would it be? Well, actually a couple, but the realistic style fits it perfectly. There were no moments where I thought that the animation was breathtaking or remarkable. This is not a flaw because it isn't that type of anime. It just isn't, in my eyes. I am not sure if this is really a flaw for the anime, but I'm having a hard time trying to find the difference between the twins in the story. Yeah, that might sound really stupid, but it just was. It's understandable though because, well, they're twins. Clothing color was the only way they can get a difference between the two. Overall, I like the art and animation for this anime. There were no breathtaking moments in art and animation, but for me, it's okay for an anime like this.\\n\\n\r\nSound\\n\\n\r\nI felt that the sound for the characters were very good. All of them sounded appropriate for the character presented. The background music for this anime helped make a scene enjoyable if it's happy and gloomy when it's sad. Not really really sad, just sad. I really liked the intro and ending songs, but it's not something I'll remember forever. Don't get me wrong, I really liked it, but it's just something that you won't remember for the rest of your life. It's not that memorable. Overall, I thought that the sound for this anime was very good.\\n\\n\r\nEnjoyment/Conclusion\\n\\n\r\nDid I enjoy this anime? Yes. A lot. Like, a lot a lot. This anime had me laughing throughout. I think that other people will like this anime unless you're not into this type of anime. If you do not like comedy or coming of age stories, then I think this anime is not for you. If I showed this to a person that does not like anime, I honestly think they'll have mixed feelings about it at first because of the first episode. However, once they watch the other episodes, I think they'll really like it. I would re-watch this anime just because it was really funny. Not only specific episodes, but the entire series. Even the first episode. I personally do not like bad starts, but that's just me. You'll probably like the first episode. I didn't, so, yeah. Overall, I really enjoyed this anime and I'll recommend it to anyone, fan of anime or not a fan of anime. This is a really memorable anime that I will remember for quite a while.",
            "date": "2014-01-27T15:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 130487,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3507545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nekishi",
                "username": "Nekishi"
            },
            "url": "https://myanimelist.net/reviews.php?id=130487"
        },
        {
            "content": "This review is meant to be short, and spoiler-free for those who are asking themselves, \"Should I bother myself watching this Anime?\"\r\nSTORY - 8/10\r\nWell you see, most Slice Of Life Anime would have you snoring and saying to yourself, \"What? There's more episodes for me to watch? Mendoukusaii!!\" but Kimi To Boku is definitely NOT one of those.\r\nSimply said, the story is not too complex that it becomes a turn off, but not too simple that would make you wonder, \"what the hell were the producers thinking?\"\r\nThe climax might not be about Alien Invasions or such, but it's quite interesting. We follow the development of5 best friends as they journey through High School, which has it's ups and downs. What's particularly interesting is Chizuru, who only joined the group whereas the other 4 have been the best of friends since kindergarten. In this adventure through adolescence, they experience everything. Funny moments, love, dating, conflict, confusion, etc. What's more, these 5 friends are very cheerful and have personalities of their own, making the exchange between the 5 very refreshing and entertaining. I AM NOT LYING WHEN I SAY, THIS ANIME IS ENTERTAINING. Whether you watch it at night or during daytime, you'll probably end up smiling and say, \"I need to watch the next episode!\" \\n\\n\r\nWith many things that keeps you on the edge of the seat, like the question, who will Masaki AKA Mary-chan, end up with? Chizuru or Shun? Will Yuuki ever get interested in anything? Will Yuuta seal his relationship? Will Kaname's interest in older women turn into a possibility? Question that can only be answered by watching the series.\\n\\n\r\nART - 10/10\\n\\n\r\nNot much to say, other than the fact that the way the characters and overall the anime is drawn to perfectly suit with the theme. \\n\\n\r\nA quote from the series, said by Azuma-sensei, \"I thought growing older would turn me into an adult. I believed I'd find work, get married, and become an adult. But none of those things have happened. Even though I've grown older, I feel like nothing's changed.\"\\n\\n\r\nThe art in this anime completely depicts youth and shows the innocence and happiness of the 5 friends as they journey through high school. The colours are refreshing and cool, making the anime feel calm, but not at all dull. Even from the first scene where Shun was seen under a Sakura tree, the beauty of the scene just highlights his innocence and gives the anime the first impression that it is probably gonna revolve around the same premise. The character designs are not too forcefully drawn, making the teen-aura resonate throughout the whole series.\\n\\n\r\nSOUND - 10/10\\n\\n\r\nThe background music, the sound effects like the rustling of the leaves being slowly blown by the breeze, the indistinct chatter in the background resembling a high school in reality, it's all just too perfect to describe.\\n\\n\r\nAgain, I'm talking based on context. Obviously the sound and music isn't as high-end as anime like Your lie in April, but it suits the Anime's desire to keep the setting calm and soothing.\\n\\n\r\nThe opening and closing themes are definitely one of the favourite things in this anime, as it is so rejuvenating and brings back your personal memories in your high school, and also hints the strong bond between the 5 friends. \\n\\n\r\nOverall, it suits the anime very well, kudos to the people in charge.\\n\\n\r\nCHARACTER - 10/10\\n\\n\r\nPERFECT, MEMORABLE, INTERESTING, AND REALISTIC.\\n\\n\r\nThere are 4 words to sum up the character development. Overall, it was nice to see that the character development wasn't too forced or rushed, and whenever it was necessary, some backstory and exposition through flashbacks showed how the 4 friends (excluding chizuru, since he's new) have been close all these years, and also showed natural development that made us say, \"wow, they're really close.\"\\n\\n\r\nIt didnt feel too forced through unnecessary emphasis and obvious statements, but the development was good enough for anyone watching to buy the fact that these friends were close to the point that they would do anything together. To describe how the main characters are;\\n\\n\r\nCHIZURU - PLAYFUL, THE \"BAKA\" OF THE GROUP, FRIENDLY and LOYAL, his main trait is his carefree attitude that only wants to have fun, making him earn the nickname, \"monkey\"\\n\\n\r\nSHUN - KAWAII, INNOCENT, LOVES THE GROUP A LOT, and CARING, his main trait is that he is very polite and to certain degree quite feminine, making him confused as being a girl by many.\\n\\n\r\nYUUKI - OTAKU, TALENTED, PLAYFUL, LAZY, his main trait that he doesn't bother himself with anything that doesnt make him happy. That's why he can be very irresponsible and only cares about hanging out with the group or reading manga, eventhough he is VERY talented in sports like basketball. This is what makes him known as the \"lazy younger twin\".\\n\\n\r\nYUUTA - RESPONSIBLE, KIND, WELL MANNERED, TALENTED, his main trait is that he will always carry out what is required of him to his fullest extent, and his main priority in life is to make his younger twin, yuuki, be able to live happily, all while being happy himself. This is what makes him known as the \"responsible older twin\"\\n\\n\r\nKANAME - SMART, WELL DRESSED, WELL MANNERED, SHY, his main trait is that he always tries to maintain the \"matured\" look eventhough deep inside, the kid in him is still alive. This is why he is always picked on by Yuuki and Chizuru, because his anger is amusing and funny to watch.\\n\\n\r\nENJOYMENT - 9/10\\n\\n\r\nI am positive that even if you are not a fan of the slice of life genre, you will still enjoy this anime, even if it's not definitely your favourite anime. \\n\\n\r\nThis Anime has so much to offer. Laughs, smiles, and occasionally some cringes (due to Chizuru's funny antics) and you will not realize as time flies by, you're already done with the whole series and you kinda wish you were among the 5 friends because their adventure was just so amusing.\\n\\n\r\nOVERALL - 9/10\\n\\n\r\nIn a nutshell, you will find that this anime has quite a lot to offer and you will not get bored. Maybe some scenes are quite cliche, but overall, this is compensated by the thrilling adventure that these 5 teens go through, and you'll definitely laugh, smile and cry along with them!\\n\\n\r\nGo on! Give this Anime a try and add it to your watchlist now!",
            "date": "2017-03-02T00:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 241711,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6078944.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Izuka-kun",
                "username": "Izuka-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241711"
        },
        {
            "content": "Hey! This is my first review so forgive me if it is a bit lacking or too wordy. \r\nA bit of a side note: I am not a huge fan of this genre but I tried to write this in a way that I feel and didn't want to sugarcoat anything in fear it'll lose a touch of being \"me\"\r\nStarting with the story: 6\r\nThe story in Kimi to Boku is fairly average with nothing to really make it stand out from all the other slice of life high school comedies. However, despite being a genre that's been seen a million times over, still managed tokeep itself from coming off as stale. Despite being nothing exceptional, I can't help but feel the execution was still done well enough to keep it if not enjoyable, very slightly above average.\\n\\n\r\nThe art: 7\\n\\n\r\nIn my opinion, it doesn't have the greatest art but it does have an art style that I very much enjoy with a very bright and mellow color palette that reflects the feel and theme of the show. I felt it was well done.\\n\\n\r\nSound: 6\\n\\n\r\nThe op in wasn't the most memorable op and neither was the ending but despite that, I did enjoy it and also felt it matched the tone of the anime very well. Not very bombastic and rather mellow compared to other animes. The soundtrack used in the anime was not very exceptional but followed all the right ques to keep it from clashing with the story telling which makes me feel kind of said there wasn't a much more fleshed out story to led the soundtrack shine more...\\n\\n\r\nCharacters: 5\\n\\n\r\nMany of the characters laid out in the anime were very... unexceptional. Most of them had nothing to really keep them memorable or make me \"fall in love (no homo)\" with them. The cast felt rather bland with your typical blonde transfer student that also happens to be a childhood friend of one of the cast members, Megane-kun who is that smart class president type who is engrossed in his books and adds a sense of reason and stability in a group of seemingly misfits. The lazy character who is actually fairly observant and keen when he wants to be but in the end, is very lazy.. etc etc. The characters felt rather bland which makes \"sense\" for a slice of life high school comedy show but I felt there could have been a bit more to define the characters from falling into tropes.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nThe show, in my opinion, was without a doubt enjoyable with a slightly above average story, good art, a fairly good soundtrack and direction that felt a bit wasted with the average story, characters that didn't seem too special but in many respects, average. I didn't find myself craving the next episode as I listened to the ED but I also did not find myself wanting to take a break or drop it while watching so I would rate it as \"alright\"\\n\\n\r\nOverall: 6\\n\\n\r\nA bit of a note, these types of shows (Slice of life high school comedy shows) often do not seem special to me and often get rated a 4 or a 5 depending on how bland and generic it can seem but I felt this Kimi to Boku was still very much enjoyable with a good art, average story w/ sound, and a very average cast. It is a show I would definitely recommend to someone who is a fan of this genre.",
            "date": "2017-01-15T01:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 238338,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3304015.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/misaka",
                "username": "misaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=238338"
        },
        {
            "content": "I'll be the first to admit that I'm not a huge Slice of Life fan. Perhaps I'm missing some subtle art, but they usually just seem so boring to me. But I try to give everything a fair try.\r\nIn a lot of ways, Kimi To Boku was exactly what I expected it to be. The characters were unoriginal tropes who didn't defy their blueprint very often, if at all. I watched both seasons, but it was slow going. The animation budget seemed to be lacking. The character designs were kind of bland, and though there was a ton of dialogue in this show, they oftenfocused on things that were much cheaper to animate while the speaking character was offscreen. \\n\\n\r\nThat said, there were a few things I did really enjoy. I wasn't too caught up with most of the side characters, but there were some really sweet moments, and there was something in every single episode that made me laugh. This show had a really subtle, dry sense of humor that I loved. The music was nice also, but it wasn't anything that really stuck out. \\n\\n\r\nThough the characters were all shameless stereotypes, I did enjoy how they were portrayed. I love their portrayal of Yuki and Yuta. Though they're identical, I never had any trouble telling them apart, and they made a point of showcasing differences in their personalities from the very first episode, which just isn't something I usually see with identical twins. It was nice to see the writers thinking outisde the box a little. Yuki and Yuta clearly aren't used to being mistaken for each other. The childhood friends aspect of this show was done very subtly as well. Little things like how well they knew each other's personality quirks and how comfortable the boys were in each other's homes went a long way. I appreciate that they didn't have to make it loud or forced. It was refreshing. \\n\\n\r\nSo if you're a Slice of Life fan, I'd definitely recommend this show. I personally feel one viewing was enough for me.",
            "date": "2016-02-16T09:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 211030,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5131864.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Duckielover151",
                "username": "Duckielover151"
            },
            "url": "https://myanimelist.net/reviews.php?id=211030"
        },
        {
            "content": "I do not watch many anime unless it is shounen-ai or yaoi, but while searching for something new to watch, I stumbled upon Kimi to Boku.. I read the first few chapters of the manga, to see if I should bother even watching the anime, and after a while, I decided to give it a go..\r\nI was pleasantly surprised when I did, for as soon as I began watching the first episode, I fell in love! (anime has a very different feel compared to manga, ofc) I fell in love with all the characters instantly, and even the simple and cute art of the anime,too. \\n\\n\r\nI was glad the story wasn't complicated or hard to get into, with cute and funny shows every week making it very enjoyable.\\n\\n\r\nNothing bad to say about this anime other than I loved it and found it cute. :)",
            "date": "2012-08-05T21:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 68825,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1440775.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/shotashota_",
                "username": "shotashota_"
            },
            "url": "https://myanimelist.net/reviews.php?id=68825"
        },
        {
            "content": "If you've ever heard someone say that Beauty is in Simplicity, Kimi to Boku is a perfect example of that.\r\nThe story is barely a story but in fact just every day life for 4... i mean 5 high school boys. Any romances are left in the background of the show and if there are any conflicts, they are dealt with swiftly. Kimi to Boku is a light hearted show about their interactions with each other, both in the present and the past.\r\nwhen watching this on many occasions i related to each of the characters thinking, \"i've done that,\" or, \"hey i've thought about that too!\"Kimi to boku brings out nostalgia, and that is the hook in this show. Everything is ordinary and only brings out fond memories of your past with a few laughs in between. Each character is realistic and well rounded. They are introduced as particular stereotypes but quickly develop past those boundaries. This is a show where I simply could not be bored watching even when what is going on is so boring.\\n\\n\r\nAlthough this was an outstanding anime, for the same reason why it is great i am stuck giving it an 8 out of 10. There was no real plot and despite it being able to take a special place in my heart, it self was not particularly special.",
            "date": "2012-01-21T01:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 52217,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269391.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bringerof_D",
                "username": "Bringerof_D"
            },
            "url": "https://myanimelist.net/reviews.php?id=52217"
        },
        {
            "content": "Hello everyone! \r\nSo i started visiting this site not to long ago and found some very helpful reviews when it came to choosing what anime to watch and what not... so i decided to write a review to help too.\r\nSooo Kimi to Boku is essentially about 4 male friends who have known each other since kindergarten and are now in high school. A 5th member is added to the group (or forces his way into the group, really funny!!!!!) and is now an important part of the crew.\r\nAnyway, the anime has just started recently so the plot hasn't really wrapped around one idea as ofyet. However, this is not a bad thing as each character is given a lot of focus and we are able to understand them quite well. Also hints are  being dropped of future relationship prospects and maybe even a love triangle! yay! Ill have to say though, the introduction of each character has been really well done, and very funny. Also there's a lot of flashbacks, where they talk about past events that helps us understand why each character is how they are now (not sad i promise!). \\n\\n\r\nThe voice actors for this anime are really good in my opinion. They get all the emotions off very well and make each scene very believable. The music is good too, really helps the flow of the episodes and sets the mood quite nicely. \\n\\n\r\nThe art isn't anything spectacular, but ill have to say it serves its purpose for this anime. Any more detail or darker colors would really effect the anime negatively in my opinion. So i was fine with it. The flashback characters look really cute... just saying\\n\\n\r\nOverall i really enjoyed the episodes that i watched and cant wait for the rest. It'll be interesting to see where the anime goes. \\n\\n\r\nAlso if you were hoping for more detail about the characters, im sorry, any detail about them would be a spoiler.... So watch it! its really good. \\n\\n\\n\\n",
            "date": "2011-11-10T12:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 47213,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/919691.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rar467",
                "username": "Rar467"
            },
            "url": "https://myanimelist.net/reviews.php?id=47213"
        }
    ],
    [
        {
            "content": "Kimi to Boku is a School Drama/Slice Of Life centered around 5 Main Characters, Following their daily lives during High School.\r\nThey have a set of Twins (Yuuki & Yuuta Asaba) Both very similar on the outside, but personality wise they have a few differences which this series does show over the course of the 13 Episodes.\r\nShun Matsuoka, Who i would say is the core focus in the story, Is a guy who has very feminine ways, Long hair which some people get confused with and think he is a she.\r\nChizuru Tachibana who is 50% Japanese 50% German, Has Blonde hair and really sticks out fromthe crowd, He wants to be the centre of attention all the time, which can get annoying to others.\\n\r\nKaname Tsukahara \"4 Eyes\" as some people call him, A typical \"Nerd\" type who seems very cold and brash to others, Normally the mean or boring one of the group.\\n\\n\r\nEach Character is varied and brings their own personality to the table which was fun to see, Not much Character development, You mainly just get to know the \"Main\" characters, There older school (s) and things that make them who they are today, You quickly find out their quirks which is typical of a Slice Of Life aspect.\\n\\n\r\nHumour is very subjective, But i feel it's very subtly put across in Kimi to Boku, I liked the Humour aspects, Didn't play on one gag for the whole series, Kept it fresh and made the humour blend perfectly with the Story/Slice Of Life parts.\\n\\n\r\nThey even have a \"Few\" love interests pushed into the story, Which was really nice to see, it didn't overtake the series, Just shown enough for you to gauge \"Who likes who\" etc... Something they will expand in more detail with in S2.\\n\\n\r\nKimi to Boku just has this \"Feel Good\" factor about it, Top that off with great visual style, characters, And even a really good OP and a superb ED theme this series is the complete package for any fans of School Drama/Slice Of Life, Kimi to Boku does everything right and is a perfect example how a series like this should be executed.\\n\\n\r\nWhich brings me to my 2 Negative views for Kimi to Boku. Firstly i sensed a S2 even before i checked there was one, During the whole series at points things felt left back or untouched which without a S2 They would of expanded a bit, At times this shows and you do feel parts are a big dragged out or the heavy reliance on the Character interactions to keep some episodes progressing without much in the story.\\n\r\nLast negative is about one character, Chizuru, He is the new guy to the group, And thus not knowing any of them in their past as the other 4 have known each other since Kindergarden, He acts at parts as the viewer, Asking questions and being filled in with information of their past. That part i enjoyed, But his whole personality and the way he conducts himself in this series is quite annoying, I know that part of wanting to be the \"centre of attention\" is being loud, obnoxious and someone who wants to always been heard or seen on screen, which is the case for Chizuru, but  i just didn't seeing that side and at points it just got on my nervers.\\n\\n\r\nOverall, A fantastic series which i hope as i have pointed out, expand some of the parts and storylines they left hanging from S1, This series is the benchmark for a good and well balanced Slice Of Life, I would highly recommend this series.",
            "date": "2013-04-01T18:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 92003,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=92003"
        },
        {
            "content": "ok so this was an anime that i dropped after the first 6 episodes, so please if you read my review, know that im only basing my opinion off of that. to start, i was really looking forward to this anime and in the first few episodes i was happy with just getting to know the characters. the characters are the one thing i gave a 10/10 i LOVED them, so cute and each with their own personalities and quirkiness, im a fan. the story was good, imean 4 highschool boys best friends since kindergarden, adorable right? loved the art, it was well drawn andthe sound matched well to. but then nothing. no i mean literally NOTHING. the last couple episodes i watched they clued you in on a secret crush and a new love triangle. and thats it. if you ask me \"whats the story in the first 6 episodes? what happened?\" not one thing. it shows them at school, at a festival, at a house, and seriously nothing but character development and filler for 6 straight episodes. anyway, thats my opinion on this anime, like i said though i dropped it halfway through so i could be mistaken...",
            "date": "2012-08-02T08:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 68449,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1396607.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/melonpanfan",
                "username": "melonpanfan"
            },
            "url": "https://myanimelist.net/reviews.php?id=68449"
        },
        {
            "content": "Kimi to boku a simple and not complex anime about a group of five friends about their school life and their friendship. The plot is not something excellent but is decent enough to make each week wait the new episode and enjoy\r\nThe art is decent and calmly same like how is Natsume. Gives warmth to the viewer and relaxing. Same goes with a sound which is one of the things that made me watch this anime. Both ending and opening are soft, same goes with the all soundtrack.\r\nThe characters personality is unique from each of them, we have shun which is more feminine and wastaken once by being a girl and on the opposite is chizusu, very energetic and sometime taken by idiot because of how he is. And not forget the twins. \\n\\n\r\nOverall was a very nice anime and first season\\n\\n\r\nI enjoyed it and i recommend to all which like a simple anime with no action, blood or ecchi stuff, and like a bit of comedy between 5 different characters . \\n",
            "date": "2011-12-26T11:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 50195,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/88746.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dany_elle1908",
                "username": "dany_elle1908"
            },
            "url": "https://myanimelist.net/reviews.php?id=50195"
        },
        {
            "content": "(This review is for both seasons)\r\nIf you like animes like Honey and Clover, Kimi ni Todoke, and Natsume Yuujinchou, you'd like this. Its a slice of life type of anime about 5 guys and their friendship and their daily lives in high school. Nothing dramatic happens, no villains or sudden twists, but somehow the story still manages to draw you in with every episode. If you need a break at the end of a long day, this anime is just the thing to put a smile on your face and make you feel all fuzzy inside.\r\nStory: Very laidback pace, with every episode either being toldfrom a certain character's perspective (so you can hear his thoughts) or just general third-person perspective. The overarching theme is about friendship, as 4 of the guys have been friends since kindergarten, while the 5th guy just transferred and joins them. The story deals with their daily lives, the small conflicts and events that happen in everyday high school life (clubs, sibling fights, relationship stuff, admiration for a senior etc). The charm of this anime is how it is subtly it manages to make you think and reflect on your own life (if you're out of high school, this is gonna make you miss those days a lot!), and make every moment seem special :)\\n\\n\r\nArt: Simple and clean, lots of pastels. Similar in style to Natsume Yuujinchou, which makes me love it even more. My favourite thing is how they have lots of CATS! The cats are sort of a representation of the 5 guys (and occasionally other characters) and are completely adorable and hilarious! \\n\\n\r\nSound: Love the ending songs of both seasons, and the background tracks, especially in season 1, are really good. Very chilled laidback songs, a bit like Corinne Bailey Rae songs (look her up on Youtube, she's great), that make you feel like you're lying in the warm sunlight on a spring day with a gentle breeze.\\n\\n\r\nCharacter: Absolutely loved the boys, each with their own unique personality.  Kaname as the typical smart aleck with glasses and is in the Student Council, but surprisingly hot tempered and gets bullied by the twins a lot. The good looking twins, both have different personalities, and are charming in different ways. They always crack me up with their jokes! Shun is always mistaken as a girl, and is always kind and gentle. Chizuru is the loudest and most childish one, but is a sweetie when it comes to love :) each character are given their moments to shine, and every episode peels a layer off to reveal more about the characters, and keeps you coming back for more.\\n\\n\r\nOverall, you'll be smiling a lot, and occasionally laughing out loud, while watching this anime. Like a slice of hot chocolate brownie, its sweet and yummy, and makes you feel all warm inside.",
            "date": "2014-04-21T14:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 140791,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3702425.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bessimajamal",
                "username": "bessimajamal"
            },
            "url": "https://myanimelist.net/reviews.php?id=140791"
        },
        {
            "content": "Kimi to Boku is the kind of anime you want to watch after having a bad day. After watching any and every episode it'll leave you with a happy, warm feeling. It really suprised me. At first I passed this and thought to myself, an anime about all highschool boys? Sounds borring, how can they even pull that off? I was very wrong. Although this anime apears plotless, every episode has it's purpose. Each character's personality, unlike other anime, is being not over killed with how they act. If not done right, your characters would be set to be awfully borring but this wasn't thecase. I enjoyed watching every character. I think",
            "date": "2012-06-10T00:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 63051,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332867.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Wuddupashley",
                "username": "Wuddupashley"
            },
            "url": "https://myanimelist.net/reviews.php?id=63051"
        },
        {
            "content": "This is my first time writing a review,,,,,,\r\ni think this will be more like my comment and opinion tho ._. \r\ni finished this anime since last year but i couldn't get it off my mind.\r\ni fell in love with this anime since the first episode. the arts, opening song,the way they gather awkward or funny moments with friend together in this anime, how different the character is, and how it gives out soft and fluffy warm feelings \r\nthis is really enjoyable for me to watch since i like to see each character's personality, and those funny momentsl ....  \r\nBut this might be boring tosome of you because theres not much story going on rather laid back? \\n\r\nstory adapted to  a hidden love, one sided love,etc. but theres no boys love in this anime  !!!!! i dare you to watch the first episode first before skipping this anime",
            "date": "2012-08-11T07:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 69413,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1159977.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lilRaspberry",
                "username": "lilRaspberry"
            },
            "url": "https://myanimelist.net/reviews.php?id=69413"
        },
        {
            "content": "This is an awesome anime to watch if you have had a bad day, want a laugh, or are just simply bored. This anime doesn't have a plot which I think is just awesome. It focuses on just small first world problems in life which makes it even more hilarious. I would recommend this to people 13 and up because they would understand it more clearly in that sort of age.\r\nI just laughed at the small things that they joked about. It felt like I wanted them to be my friends. I wish I had more friends like them. I loved every single character especiallyKaname's mom. She was so adorable but I wish she didn't cry as much.\\n\\n\r\nWATCH THIS!\\n\\n\r\nTHEN WATCH THE SEQUEL THAT JUST CAME OUT!\\n",
            "date": "2012-04-08T14:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 58309,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sakura-icecream",
                "username": "sakura-icecream"
            },
            "url": "https://myanimelist.net/reviews.php?id=58309"
        },
        {
            "content": "The most crazy reason why I've watched this series is because the seiyuu of Yuuta Asaba is Uchiyama Kouki which I really love that seiyuu.\r\nBut sometimes when you watch an anime you would find new things that'll surely make you feel happy about it.\r\nThe funny thing about this Anime Series is that it has a lot of characters that each have different stories and personalities.\r\nFor me the story is 10. Because it's not that boring unlike all the High School Shoujo, shounen and Slice of life anime. The thing is they make people watch this anime because of the characters! They make them cute andhave various behavior and complex to their lives. Their stories are very much like our lives right now. It kind of reflects each individual who watch this anime. This will make them understand themselves. Each human being have the personality of Kaname, Asaba Twins, Chizuru, Shun and etc.\\n\\n\\n\r\nArt wasn't that bad and wasn't that a \"WOW\" factor because the art is really common in animes. But because the story is too damn amazing!! well,, I didn't really mind.\\n\\n\r\nSound wasn't that good it was a little off but for me it reflects the whole series. XD but then it's the story and the character that matters in this anime.\\n\\n\r\nCharacter... well it's a ten because each character has their own way of showing their emotions. Watching 5 guys fooling around and talking about random stuff makes my day!! They absolutely made me laugh but I was touched as well.\\n\\n\r\nEnjoyment is a ten too because when you watch this anime it gives you random emotions and countless laughs! EVerytime a character makes a fool of himself the other also makes a fool of himself. Which is very interesting. \\n\\n\\n\r\nOverall it is a nice anime and I hope for a good ending!",
            "date": "2012-04-28T22:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 59913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/342065.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/connielas",
                "username": "connielas"
            },
            "url": "https://myanimelist.net/reviews.php?id=59913"
        },
        {
            "content": "I made a video: you can find it at my YouTube channel \"BasementOtaku\"\r\nVideo Script:\r\nYou and Me Season 1 (1/10): I know this rating might piss some people off so I would direct them to the video description on how to better understand my rating system. Now it is time to spiral headlong into this spoiler filled review. \r\nYou and Me was a show that I discovered while going back through all of the seasonal anime on Crunchyroll and placing shows with high ratings and premises that interested me in my que. After Kokoro Connect blew my expectations of the water when I chose to giveit a watch, as I wasn’t expecting the show to feel that real or get that dark I had hoped to find another comparable show in You and Me. So when I saw “Together we will watch as they laugh, dance, cry and share the memories of growing up together in everyday life” referring to the group of friends pictured I figured that a show with three hundred and twenty nine five star ratings had to be SPECTACULAR and hit some really powerful character beats! Little did I know that the show was attempting to cash in on the ‘’cute boys do ABSOLUTELY NOTHING’ crowd. \\n\\n\r\nNow the main reason You and Me season one is a one and not a four or five is because it keep leading me on and then smacking me on the head when I hoped for decent character development. The show even says multiple times throughout its run that the characters haven’t changed at all since they knew each other back in kindergarten. Which could have been a great setup to subvert character's expectations as they all begin to grow apart or change as people and struggle to come to terms with those changes. Sadly the show seems more content with setting up those hooks only for us to learn that the characters are about as deep as their initial tropes that were established in episode one. \\n\\n\r\nThat isn’t to say that the first season doesn’t have any redeeming qualities as the third episode, while slow, is still an interesting look at one of the twins and how they held some deep seeded self resentment around from their childhood. Then it is addressed at the end of the episode and it turns out it was no big deal but he still feels a little sad about it. It is a nice message about the importance of communication and that circumstances aren’t always what they seem, but then it NEVER ADDRESSES THAT AGAIN. The rest of the season is littered with unresolved or poorly resolved plot points. \\n\\n\r\nEpisode one, we find out that glasses guy was into his kindergarten teacher and kind of still is but this never develops past a side gag. Episode two we meet the small angry girl character who does a complete 180 and falls in love with the effeminate group member who is oblivious to her interest and never goes past a running gag that she likes him and he doesn't notice or she is too afraid to tell him. Episode five little blond guy starts to show interest in small angry girl but that goes unaddressed until episode two of season two. Episode seven has a very interesting premise about one of the twins saying yes to a girl who asks him out, this is where I really got my hopes up that the show would start to break down the established tropes and start to develop the characters, but all it turns into is the twin talking about missing his brother and the girl having crappy friends. Then it goes a step further and has the twin tell the girl to stick with her awful backstabbing friends because reasons. I was really hoping this would later come back and show how truly toxic the main group's relationships with one another are but nothing ever develops and it is just an episode about staying in your lane even if it sucks. Episode eleven sets up the lunchlady arc and episode twelve introduces effeminate guys younger brother, both of which go unaddressed until season two. The rest of the episodes are gag episodes that do nothing to develop the characters or further any subplot. \\n\\n\r\nNow you might be wondering why I gave season one and season two separate scores when they obviously share story ties and I would ask Crunchyroll the same question. Because as of writing this review Crunchyroll has them listed as separate shows. The only reason I found there was a season two is because I couldn’t believe season one was that awful and inconclusive so I looked it up and discovered there was a season two. If you are interested on my thoughts, you can check out my season two video. As for my season one thoughts I’m fairly certain it is clear, this is the worst show I have ever finished, hence the one out of ten rating. \\n\\n\r\nAlso I forgot to mention the show is incredibly boring!",
            "date": "2016-08-17T10:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 226946,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971297.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 1,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BasementOtaku",
                "username": "BasementOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=226946"
        },
        {
            "content": "Kimi to Boku – or You and Me, in English – is a slice of life anime touted as a very realistic glimpse into the daily lives of five high school boys.  Praised for its lack of melodrama and absence of overdone cutesy-ness, this anime promises viewers a blend of comedy, everyday drama and a touch of romance, delivered in a laid-back, down-to-earth way.  A refreshing concept in a genre riddled with tired tropes and rehashed storylines, but does it work?  Well, not quite.\r\nAfter reading a large number of positive reviews for this show, I was expecting to enjoy a realistic representationof high school life, albeit without too much drama.  I was also looking forward to meeting a cast of characters complete with well-rounded personalities, depth and some direction to their lives.  Unfortunately, I was let down on all fronts.\\n\\n\r\nThe first issue that is readily apparent in Kimi to Boku is the characters, who are little more than one-dimensional clichés – the girly boy, the uptight glasses-wearing guy, the cool and good-looking twins, the energetic and annoying kid…  Although it steers clear of many of the biggest pitfalls of ‘factory-farmed’ slice of life anime, unfortunately Kimi to Boku still forsakes originality for total familiarity. \\n\\n\r\nThe second problem is that the show’s strict no-melodrama approach works against it, as there are never any obstacles presented to our one-dimensional characters to help them gain any new dimensions.  As a result, all of our five boys seem to have the same personalities throughout the series, never even evolving from who they were in their elementary school flashbacks. \\n\\n\r\nThe plot is debatably realistic in the sense that nothing extraordinary happens.  On the other hand, I would argue that it is too plain and boring to be realistic.  Watch as our main characters engage in thumb wars, walk around to various places, do homework, talk about putting salt on watermelon, cut each other’s hair and bicker a lot.  I found myself literally dozing off in several episodes, thinking that instead of watching Shun, Kaname et al do nothing I could actually be doing something – anything – more interesting than watching Kimi to Boku.  \\n\\n\r\nIn defence of the show, once in a while it does have moments of brilliance. The art, sound and direction in episode five made me feel immersed in the height of summer, even though it was winter outside.  Yuuta wiping away a girl’s tears in episode seven is surprisingly tender.  These magical moments, however, are frustratingly few and far between, and proof of Kimi to Boku’s inability to create anything consistently engaging and solid from its basic premise.\\n\\n\r\nNo noteworthy events, no conflict, no character development, no discernible plot – that is Kimi to Boku.  Unfortunately its attempt to do slice of life differently is misguided – life does have its noteworthy events, conflict, character development and drama, and that’s what makes it fun, entertaining and challenging.  For the most part, Kimi to Boku is not fun, entertaining or challenging.  \\n\\n\r\nYou may like Kimi to Boku if you enjoy watching ‘cute’ high school boys do mundane, typical slice of life stuff to the detriment of all else – and there is absolutely nothing wrong with that.  If that is not your cup of tea, however, switch off your computer, go outside and do something interesting with your own life, instead of watching these 2D cartoon characters do nothing with theirs.",
            "date": "2016-01-04T16:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 207749,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4947282.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JolieJoli",
                "username": "JolieJoli"
            },
            "url": "https://myanimelist.net/reviews.php?id=207749"
        },
        {
            "content": "Kimi to boku..now, first off, if you dont like school comedies or things close to that nature, i would still still suggest you watch this. I cant even remember why i watched it but i'm glad i did. It was actually hilarious, and heart warming. Like I liked it all the way through. It was a feel good anime, and the second season is the same. The twins in the show are hilarious, and every character in the show is funny and you instantly like all the characters. There is an amazing back and forth between all the characters that just makes you laugh andsmile. I mean i have never seen a school comedy, or let alone a comedy that has made me smile and laugh this much. (maybe gintama) but this anime is worth watching.",
            "date": "2013-05-03T13:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 95849,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=95849"
        },
        {
            "content": "I'm personally not a fan of shows that have no plot whatsoever; but I really feel like Kimi to Boku changed that. I was impressed within the first episode, and after that, I simply fell in love.\r\nThe first season did take me a little longer to finish, I was entertained throughout my time watching it. There were times where I was sometimes bored with the episodes, but overall, I was in love. \r\nWhen I found out that the second season was coming out in the spring of 2012, I was very excited because I had just recently finished the first season around that time; andnow that I'm almost completed with the second season (which has taken me so long to watch as I've been busy with other anime), I'm still impressed.\\n\\n\r\nThe art was beautiful, the characters (especially the twins), had their own personalities that you could easily enjoy; and I think the best part was that their personalities easily went with each other's. There will be times where the episodes feel so long, but there are also times where the episodes get so interesting that they just fly by and you don't even notice it's over until the ending theme! \\n\\n\r\nAnyway, rating time!\\n\\n\r\nSTORY: Overall, the story would have to be a 6. The anime itself really has no plot; as it's about five high school boys who are growing up, and not only are they growing up, but their friendship is growing also. It shows the daily lives of what some high school students do and the fun adventures that they all get to have. Either way; if you're one of those people who are interested in anime that are just about life in general; then you should definitely watch this show.\\n\\n\r\nART: The art, I would have to give a 6 as well. When I first started watching this series, I was not used to the art at all. I have to admit though, after watching a couple of episodes, I loved the art. It's unique, it's beautiful, it's wonderful, and I just enjoyed it! I think the art really goes with the anime, and I feel like maybe you would agree if you watched it yourself (if you haven't, that is). \\n\\n\r\nSOUND: Usually, I skip the opening theme and the ending themes, but wow, I was amazed by how well the songs fit with the anime itself. I felt like it really described it, and it definitely made me happy to hear it. I never skipped the opening/ending songs, and I'm so happy I did. They were catchy, and I just love how soft and cheery it all sounds! For other sounds; they were great!\\n\\n\r\nCHARACTERS: As mentioned before, all of the characters have different personalities (though most characters have different personalities, correct?). As the anime progresses, it explains how they have been going to school together since kindergarten, and now they're in high school. Yuki and Yuta, the twins, may look alike, but they're personalities were sort of different. Shun's personality, I felt really made their friendship grow better, and I'm sure without Shun, things would be way different. Kaname, on the other hand, was definitely a character that I did not like at first, but as I continued to watch, I fell in love with his character. He may be harsh and rude to his friends, but it shows that he really does care for all of them, and even though it may show a little, you can tell that he would do anything for his friends. Chizuru comes in later and joins the group of friends in an unexpected way; and even though it was surprising, the group gladly accepted him. That's what I loved about it, they gladly accepted Chizuru and all five of them became best friends. The minor characters, such as Masaki (also known as Mary), Azuma-sensei, etc., all have their own little stories; and the best part was that they were all different from each other's and not sound the same like how most anime/manga do it. So for characters? My rate would definitely be a 7.\\n\\n\r\nENJOYMENT: 7! I enjoyed this anime from episode 1 to episode 13. If you enjoy anime that's about high school boys going through life, or anything about the daily lives of someone, then this anime is just for you.\\n\\n\r\nOVERALL: 7. I have rewatched this anime three times, and let me tell you, it does not get old. Each time I watched it, I felt all cheery and happy inside, and it reminded me of my friends and how we acted and it reminded me how I need to keep my friendship with my friends strong so we can keep going like how the boys do in Kimi to Boku. I highly recommend this anime, especially if you want to laugh and smile!",
            "date": "2012-08-23T23:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 70717,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/516931.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/makotokikuchi",
                "username": "makotokikuchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=70717"
        }
    ]
]