[
    [
        {
            "content": "Edited this entire review. I'm watching this subbed and I recommend you do the same. I've seen a few episodes of the dub and they've completely butchered it. \r\nIt's that time again: when one Yugioh series comes to an end and we get a fresh start with new characters. Comparing to it's past series, 5D's definitely takes on a more mature feeling. Not just because the characters are older and more serious, but not everything is a ray of sunshine for our protagonist this time around if you catch my drift. ;]\r\nStory - Well, the story was a bit different. It is set many yearsinto the future so we can't expect any recurring appearances from any GX or DM characters. So far the story has had three major arcs. The early episodes really introduce the characters and the new way of dueling which is called a \"Riding Duel\". However, when the second arc (the Dark Signer arc) begins, the show gets much more dark and much more exciting. The third arc is still underway so I can't comment on it thus far.  \\n\\n\r\nWe still have this obsession with Dragons in the Yugioh franchise for some odd reason, this time being the \"Crimson Dragon\". You've got your general bad guy who plans on using some ancient power by using special people known as \"Signers\". Weird, eh? It takes a little while for the plot to begin, but we do get to see some background on our main character, Yusei, and his relationship with our so-called \"Kaiba\" of this Yugioh series, Jack Atlas, in the meantime. Like I said, it takes on a more mature plot, but it still is a kid's show.\\n\\n\r\nSound - The sound isn't that bad. The sound of a bike motor revving can get annoying, but I guess that's something you'll have to get used to when watching 5Ds. The OP and ED themes aren't that bad either.\\n\\n\r\nArt/Animation - I'd say the art was pretty good this time. Technology is a wonderful thing, isn't it? \\n\\n\r\nEnjoyment - To be completely honest, I hated this show at first. My initial thoughts were somewhere along the lines of \"What the hell?!\" When you watched the original DM, you loved it (if you didn't, you probably wouldn't be reading this review and if you haven't watched the original series but would like to watch this one, you should check out the prequels first [you don't need to, though]). When you watched GX, you were a little taken back by the new characters, but in the end it still was decent (give or take). But this...this new concept they came up with...it's just insane (at first). DM focused on tribute summons, GX on Fusions, and this time we get Synchro monsters. Initially, it's just a no, but you get used to it and it really fleshes out as a show and the rules changes (more like additional rules) are great! They don't ride bikes for every duel I might add! The one thing that I'd have to complain about is how they always make the main character (this time around his name is Yusei) duel soooo much while other awesome characters (coughAKIcough) don't get to duel as much, and if they do they don't do as well as Yusei. But it's still very enjoyable. \\n\\n\r\nOverall, 5Ds isn't that bad after adjusting to it. Just get ready for a bunch of bikes, new rules, and an interesting bunch of characters. Keep an open mind and enjoy. :P",
            "date": "2008-09-14T18:24:00+00:00",
            "helpful_count": 133,
            "mal_id": 7942,
            "reviewer": {
                "episodes_seen": 100,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56544.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Grimmm",
                "username": "Grimmm"
            },
            "url": "https://myanimelist.net/reviews.php?id=7942"
        },
        {
            "content": "When Yu-Gi-Oh! Duel Monsters GX began airing, I thought that it was going to follow in the footsteps of Yu-Gi-Oh! Duel Monsters.  That was not the case.  However, I feel that Yu-Gi-Oh! 5D's brings back what everyone loved about the Yu-Gi-Oh! Duel Monsters, and a few extra things along with it.\r\nStory:\r\nThe story of this series is far more fast-paced and exciting that either of it's two predecessors.  If even one episode is missed, it feels as though you've missed a lot.  Almost every, if not, every episode ends with a cliffhanger.  The plot is amazing.  It still has theancient-themed story, just like the original Yu-Gi-Oh!, but it intertwines with the present-day atmosphere of Neo Domino City.  The story is no longer Duel Monsters-centered as Yu-Gi-Oh! Duel Monsters GX was.  The name \"Duel Monsters\" is barely even mentioned.  The story and dealings of the characters are once again the main point of the anime.  Duels are like gun combat or swordfights are in other anime series.  It is merely a way of combat in the series.  The story is one of Yu-Gi-Oh! 5D's greatest assets.\\n\\n\r\nAnimation:\\n\r\nThe art in this show is amazing.  Every character has their own look and style reflecting their personality.  The D-Wheels (called Duel Runners in the dub) are always something to look forward to seeing.  There is also a lot of CG animation, especially when it comes to Riding Duels (called Turbo Duels in the dub) and monsters, especially Stardust and Red Demon's dragons.  \\n\\n\r\nSound:\\n\r\nThe music in this series fits it so nicely.  The music sets up the atmosphere for every scene so accurately.  The opening and ending themes are among my favorite songs.  The noises for the D-Wheels does not sound like a conventional motorbike, or a motorbike at all.  All the D-Wheel sounds are completely brand new and sound nothing like real motorcycles.  Even Security sirens sound nothing like their real-world counterparts.\\n\\n\r\nCharacter:\\n\r\nThe characters in this series are phenomenal.  Yusei is completely different from both Yugi and Judai.  His life is not like theirs as he grew-up in the ghetto known as Satellite in poverty along with his friends.  Jack is like Seto Kaiba in terms of personality and pride.  However, he is not as cold-hearted as Kaiba as he quickly has a change of heart towards Yusei and his friends.  The supporting characters are not annoying at all and viewers will quickly warm-up to them.  All the characters are well developed.\\n\\n\r\nEnjoyment:\\n\r\nThis show is far more enjoyable than it's two predecessors.  As I said before, every episode ends on a cliffhanger.  The plot is great and intriguing.  There are many things to look forward to every episode.\\n\\n\r\nOverall:\\n\r\nThis is the best Yu-Gi-Oh! series yet, and one of the best television series I have ever seen.  Everything about it is so great.  If it wasn't evident in it's two predecessors, then it sure is in Yu-Gi-Oh! 5D's that the Yu-Gi-Oh! series is not meant for children like it's American dub.  The plot is so much darker and the characters are rarely happy, unless they are about to cause pain to their adversaries.  Mr. Takahashi makes his target audience, teens and young adults, clear in this series.  It is this tone that makes this show great.  I'm sure that it will only get better as the plot expands.  This is definately a must-watch series.",
            "date": "2008-12-03T17:52:00+00:00",
            "helpful_count": 131,
            "mal_id": 10072,
            "reviewer": {
                "episodes_seen": 98,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FlashFlare11",
                "username": "FlashFlare11"
            },
            "url": "https://myanimelist.net/reviews.php?id=10072"
        },
        {
            "content": "take the scenario from Terminator + tons of mindless violence + card games on motorcycles (that are surprisingly good) + a badass protagonist: Welcome to 5ds!\r\n5ds revitalized the game when it needed it most. Konami created new types of cards (synchros) and introduced them through an anime so good that people actually got over the fact that Konami was creating new rules again (The same tactic was repeated quite successfully with Arc V and completely failed with Zexal). The duels suddenly became A LOT faster and more enjoyable and the game that was going downhill until then suddenly stepped up.\r\nFor starters FINALLY we're through with\"school children protagonists\". Yusei was already 18 when the show started, had already trouble with cops and was basically living in a giant scrapyard/post-apocalyptic city. Literally from the first minutes of the anime all you can say is \"wow, is this really yugioh?!\". Obviously the super-added levels of violence meant that 4kids butchered the anime even more than usual in the dub, making it utterly unwatchable, but that's hardly the original's fault.\\n\\n\r\nAnd staying on the \"violence makes good\" theme, lets talk about emotional violence as well. Aki, the show's female lead is quite clearly a girl with a LOT of problems and torn between her loyalties, from the start to the end. On the one hand she wants to go with the protagonist... Mostly because she just fancies him, on the other she wants to stay with her boss, who she also fancies (kinda, and also kinda sees him as a fatherly figure, honestly it's a pretty interesting subplot). And the main reason she can't choose is that in 5ds, there is no clearly evil character. Obviously the protagonist is good, but there is no character you can clearly call an \"one-sided villain\", including her boss. On one hand that makes for a much more mature plot, on other it doesn't allow for the sheer evil badassness that Vector was (read my zexal II review).  In fact even the last main villain of the anime, the big bad behind it all, STILL isn't evil. Misguided maybe, yes, but he only had the best of intentions (you know, unlike the motherfu%$ing Vector and the others).\\n\\n\r\nThe protagonist, Yusei, best of all, never jokes, almost never smiles and is in fact from start to finish dead serious about everything. The fact that he can outrun security (constantly), beat the crap out of everyone (no, I don't mean in a card game, I mean literally, beat the crap out of people), build 2 whole motorcycles from scrap and understand physics (without ever going to school mind you) makes him a total boss. After him comes Jack Atlas, the second male lead, who gets almost equal screentime, and is a fan-favourite due to his dueling style and unparalleled ego. He makes for an amazing antagonist and surprisingly well-written character (and is in fact the only character in the anime to get more chicks than Yusei). Lets be honest here, EVERYONE who has seen 5ds was hyped every time that \"Red Demon's Dragon\" was summoned. (Come on, you can even recite the summoning chant)\\n\\n\r\nThe plot starts from post-apocalyptic future, goes to \"suck my Aztec d$%^\" and ends up Terminator (down to the last detail). While pretty light on twists there are a few that really make for interesting story (for example who the final opponents of the second and final Arcs were). Most of the anime is delightfully dark, with purple and dark blue being the primarly used colors. (As far as I can remember you almost never see the sun in the first Arcs).\\n\\n\r\nWhen it comes to animation and OSTes 5ds was way above the antagonism. In fact when it came out, I quite honestly thought it had the best OST in anime after Bleach (Fairy Tail hadn't come out yet). The animation has a unique dark style to it that really makes the anime enjoyable and you asking for more.\\n\\n\r\nIt doesn't matter if you didn't like yugioh in general, at least the first 8-9 episodes of this one are a must-watch.",
            "date": "2015-02-04T11:22:00+00:00",
            "helpful_count": 60,
            "mal_id": 179666,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=179666"
        },
        {
            "content": "When looking at a series, is it better to start strong but end weak or start weak but end strong? I believe a strong finish is better than a strong start because while it won't hook people immediately, it will allow for people to have something to look forward to while watching. The problem with 5D's is that it follows the latter, being a disappointment after the first season, which ends at the end of the dark signer arc. The unfortunate truth behind this is that the director for the fortune cup arc left to work on Symphogear, leaving behind notes for the dark signerarc. The new director followed these notes, but once the dark signer arc finished, he unfortunately screwed up a lot of things. If I could rate the seasons seperately, I'd give the first season a 9 and the second season a 5. So let's delve into some of the best and worst yugioh has to offer.\\n\\n\r\nThe story for the first season is structured pretty well. There is little to no filler and you can feel the progression. At the start, Yusei just wants to get back the card that symbolizes his bonds, Stardust Dragon, but then he gets stuck in Godwin's plan and becomes a signer. While the plot doesn't stand out, it also doesn't falter, allowing for strong character development. The second season has a convoluted plot where all the problems are solved because of Yusei suddenly becoming overpowered. It just sucks when the solution to every plot related problem winds up being Yusei. Another major issue is how there are 6 signer dragons when the original plot wanted 5. It felt like they wanted to give a character signer status just so he could stay with the main cast instead of a legitimate reason. It all just felt like so much of the original intent spiraled down into a cesspool of absurdity.\\n\\n\r\nThe art and sound are pretty spot on, with the soundtrack containing some of the best vocal pieces in the yugioh franchise with songs like CROSS GAME and Clear Mind. The structural and artistic design of each D-wheel definitely shows each character's personality. The duel disks are designed to look like their respective D-wheels, as the motorcycles are a hybrid of transportation and a dueling machine.\\n\\n\r\nThe biggest divide between the seasons is how the characters are handled. The first season had some of the best character development, delving deep into what makes each character and how they all overcome their mental and physical barriers to become stronger and better people. Overcoming the darkness in your heart is a prevalent theme within the dark signer arc, and it made the development even better. Unfortunately, the second season throws much of the development out the window and streamlines every character's personalities and emotions.  There could have been so much more done with the characters introduced in the second season to make them meaningful and not just a bland sideshow.\\n\\n\r\nI heavily enjoyed the first season, and it became one of my favorite parts of yugioh. It's a engrossing and fulfilling experience that you should experience. The second season, however I didn't enjoy so much. I did manage to watch through it all, and it was about the same as Zexal 1. I recommend only watching the first season while completely ignoring the second season, unless if you want to laugh at the problems it has. Remember kids, you can turn off the monitor whenever you want.",
            "date": "2015-04-06T13:40:00+00:00",
            "helpful_count": 26,
            "mal_id": 184963,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515784.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/We_EGAO_now",
                "username": "We_EGAO_now"
            },
            "url": "https://myanimelist.net/reviews.php?id=184963"
        },
        {
            "content": "5D's, my favorite show of all time. This show is a beautiful work of art, with some of the most real characters I have ever experienced. However, between Dark Signers and Pre-WRPG there is a huge shift, however I personally adore season 2 for there depiction of the main threat of the series, Yliaster. \r\n-Art-\r\nThe art is beautiful, and the monsters are some of the most beautiful we've gotten yet. The Signer Dragon's complexity could make them hard to look at if your use to the original, but once adjusted they are some of the best designed monsters in the franchise. The Earthbound Immortals couldbe considered simple, and they are simplified black versions of the Nazca Line the represent with a different color line vairty across them, but they somehow manage to still look amazingly badass. The Machine Emperors are just sheer eye candy to anyone a fan of machines in general, and the characters still have gravity-defying hair, making certain characters(ESPICALLY APORIA) a pain to draw.\\n\\n\r\n-Sound-\\n\r\nThe Voice Acting is sheer beautiful, from the sexy voices of Yusei Fudo and Aporia to just the plain awesome voice work that is given to Lucciano. However the music is where it really shines. Almost all OSTs are amazing, including Yusei's theme, Lucciano/Skiel's theme, Light and Dark, Placido's theme and many MANY others. However the openings, endings and inserts are where they just BOMB IT. 5D's and GX are the only shows were I love every single opening and ending, and my god, do they not disappoint. Future Colors, Cross Game, Start, Last Train, Going my Way!!, Believe in Nexus, Freedom, -OZONE-, Close to You and Kizuna are the best songs in the entire franchise by far, and we have the all holy insert song sung by freaking Masaaki Endoh known as Clear Mind.\\n\\n\r\n-Characters-\\n\r\nI will admit I have a crush on Placido to the point where it's kinda scary and sad, but the characters feel so real. Yusei and Jack are by far the best Yugi/Kaiba duo yet, and the entire major rest of the list excluding the characters from Secruity and Satellite are amazing. Rua, Ruka, and Lucciano are by far the best children characters in this franchise along with Arc-V's Sora, and damn does Z-One troll everyone. There's even a character exclusive to the spinoff Bonds Beyond Time who gets mentioned, and well, just watch the freaking show.\\n\\n\r\n-Enjoyment-\\n\r\nI have never enjoyed a show this much. Every episode, even the filler, was good in some way. My personal favorite episodes are 105-110(the Placido VS Yusei mini-arc as I like to call it). But just, watch it.\\n\\n\r\n-Overall-\\n\r\nThis franchise is amazing, and this series is a treat from beyond heaven. If you like anime in general, WATCH YU-GI-OH! 5D'S RIGHT NOW.",
            "date": "2015-07-28T10:58:00+00:00",
            "helpful_count": 22,
            "mal_id": 194551,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4776207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ShadowSkiel",
                "username": "ShadowSkiel"
            },
            "url": "https://myanimelist.net/reviews.php?id=194551"
        },
        {
            "content": "Well, now is time for another exciting sequel to the ever popular Yu-Gi-Oh! franchise. \r\nStory:\r\nI immediately connected to the plot, a whole new twist on the card game: D-Wheelers. I have to say, they did a better job with 5D's then GX (GX felt like Emo school drama :P). \r\nArt:\r\nThe designs are top-notch, IMO. Especially the fact that it's being aired in HD. Aki's appearance reminds me of another character i love, but other than that, i give the Art a 9/10.\r\nSound:\r\nThe OP/ED themes really give 5D's its edge. It's not too annoying, not to bland, just perfect. The dueling music has also improved fromit's predecessor. Even more darker scenes have better background music.\\n\\n\r\nCharacter:\\n\r\nThe characters are excellent. You have the quiet, hardy type (Yusei), the &quot;i'm better than you&quot; with a (Slight) good side (Jack), the comic-relief characters (Yanagi, Akutsu) and the loyal servants (MIkage, Tetsu) and the mysterious bad guy (Godwin). \\n\\n\r\nEnjoyment/Overall:\\n\r\n5D's is probably one of the few anime's i watch nowadays, not alot of shows interest me (believe me i'm really picky :P) but 5D's is just a wonderful show. Even if you didn't watch the previous Yu-Gi-Oh shows, you'll feel right at home.",
            "date": "2008-11-08T14:27:00+00:00",
            "helpful_count": 15,
            "mal_id": 9339,
            "reviewer": {
                "episodes_seen": 31,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=9339"
        },
        {
            "content": "One of the strongest written series in yugioh franchise history, has flaws, but still strong.With all the hype around the series I can tell it was at it's best even when it got screwd over by midway ending strong regardless of it's writing problems and fake fans.\r\nBefore I start off, I highly advise to not listen to the reviews that complain about something as if they’re expecting lots of 5d's being poor and having no fanbase to support it. Trust me, those are not very helpful if you’re one that actually likes other equally important aspects of a series that focus more on the settings,story, and even development of supporting characters. This is toward Zexal's pathetic and stupid fanbase and hope this messeage goes comes true. 5d's was Ygo's hope even if bad writing hit it hard cause of a movie in making after a major arc coming to an end and beginning of a filer arc i'd say. I hard soo menny good things with this show back then and 10 years later still amazing to watch, in fact this show is 10 years as of 2018 and major hope it get's a movie with a better Director and having more other Ygo characters like: Yuya and Atem or the othter 3.... It's dubbed version was butched around episode 111 to 122 and most of it was skipped cause of a lawsuid filled by NAC and Tv Tokyo is i recall. Also episode 130 was also skipped since it was nothing more than a recap and then came the worst butching of all it. Aporia is actually the final villan/enemy in the dub, while missing most of Z-One's arc and the closer arc in the end makes me sad that this series never will come back. Plus it was the last good dub Ygo on CW4KIDS back in 2011.The English dub stopped after combining episodes 135-137 into one full one-hour special so now that the entire series is up please take a chance and watch the rest! \\n\\n\r\nThe head Director is Ono Katsumi (Arc-V and Senki Zesshou Symphogear look it up on MAL) Plus he is the supervisor in BBT (Bounds Beyond Time 2010). The takes double shifts and hardly giving a care how much pressure Arc-V got him i can say 5d's was better in story, so far... In Arc-V he was busy was with another anime at the time, and Arc-V was stuck in DSOD hell budget. The can do better, if only someone was a sub-director and that's imo.\\n\\n\r\nAt one point the show was in filler hell because of a movie i mention above and made 5d's suffer baddly, but still had an amazing ending. I don't even know when Yoshida took over as a writer and what made people hate this, it aint' neither one's fault. Imo, 5d's was still the best ygo in terms of plot. Hell, I've bean told menny lies about Zexal and Vrains being good and i still think they're on drugs. After 5d's, the show and comminuty whent downhill. I was never a part of the 5d's fandom or ever bother to check. I hardly watched Zexal and never gave it a chance till 2016. I was busy rewatching the first 3 gens. Menny people hated Arc-V and Zexal because they think only adualts matter and not carring about how good the animation has grown in the last 10 years. \\n\\n\r\nWhere Season 1 was an introduction into the world of the Turbo Duel and into the darkness with the Dark Signers, Season 2 delves into a dystopian future and reveals the origin of Paradox and what his mission was really about. All the time maintaining the bonds of friendship and never losing hope. It and BBT have a connection. Also, 5d's has the most darkest behind-the-scenes making with one the Voice Actress being in a cult. That's Carly's voice actress, see Dark Singer arc was more a like cult arc with kids thinking this show is about joining one of those nasty cult in real life, so at point they changed all history in the show about it to make it more futureristic and being time travelers. This is something i look up on reddit, but never cared to believe what they said.\\n\\n\r\nAnimation/Key Visuals: The animation is by Studio Gallop, and it is really good.Other animes conisite of: Rurouni Kenshin: Meiji Kenkaku Romantan, Eyeshield 21, Transformers: Car Robots, Meitantei Holmes. It get's kinda wied during WRGP, because they seemed to enter Zeal's era (no wonder zexal's animation was trash at first). It got less 3d/CGI, but still awesome to watch. The art is beautiful, and the monsters are some of the most beautiful we've gotten yet. They've seemed to make better animation than Gx who previously was the worst series with animation budget.\\n\\n\r\nSound/Music/Opening and Ending: The Voice Acting is sheer beautiful, the music is by Hiramitsu, Takuya (Transformers: Car Robots, Yu-Gi-Oh Gx) , and it’s really good - it’s kind of typical for what you would expect from a Yugioh series, but it’s on the better side. The openings were all catchy and incredibly fun to listen to - they did take a while to get used to, but once I did...I was VERY CLOSE to singing along with them. I did the same thing with Arc-V back in 2014. It's soundtrack is the best outta the first gen.\\n\\n\r\nStory: It's all about post-delves into a dystopian future and reveals the origin an disater years ago made by a company who crated a device in producing ''ENDERDY''. The world building is divide by law and order or chaos and order. The place called Satelight was rune be poor like people making the have all the chaos and misary, while the other order is New Dimineo City (the same city we're Gx and Dm took place), it's actully better paced in the first 14 episode than Vrain's, first 13-15 episodes. The real plot was a form a Drago named Crimison who gave five birthmarks to chosen people in order to fight the evil sent the shadows. First 26 are character indroduction and build-up for 27 to 64 aka the Dark Singer arc. The show is dark,mature and has the best mechanic titled ''Synchro Summon'' even the head director decide to ad a new mechanic named ''Speed Spells'' with dueling on Motercycles. Or, how Yu-Gi-Oh Abridged fans say ''CARD GAMES ON MOTERCYCLES!'' it has alot of memes too. Second half is all about the Yliaster and the dystopian future that takes place near the end of the series. I whoud advice to check out wiki on the filer arcs. See, after Dark Singer came to an end. They made the MC into a total outta character personality and claiming him the Mary sue name or Goat.  The last 25 episode have to of bean the best episode outta any ygo series and you can fell the pain and emotion coming from them. Oh yeah. They had a late suprise way at the end of episode i want you guys to watch for your self ;)\\n\\n\r\nCharacter: All of them are amazing, but I'll mostly cover the 6 main ones with some villain and filer characters. Even tho they changed alot of the writing in Season 2/3 i still enjoy each and everyone of them. \\n\\n\r\nYusei is clearly the most mature and well headded MC in ygo hystory ever. Him being a god? He actually saved lives and still had fun. Never have i seen people complained about someone i adore as an Idol. He says in believing in the cards can make you wanna have hope and never give into despair. Even after his sudden change of character from a later arc made him a much better person than ever. He achived Clear Mind and was able to beat Major enemy's such as Goodwin and Z-One. Him being sexy is all the fan girls even want xD. \\n\\n\r\nJack Atlas: BEST CHARACTER EVER WRITEN. HE WAS MY CHILDHOOD ICON TILL HE RE-APPEARD IN ARC-V SEVERAL YEARS LATER (5 years later) Never have such a badass character at all. He is changed from this cold-heardter person who a likeable caring character. He is bassicly ''Stone Cold'' Steve Austin and Chuck Norris of the show. He got into in love with a reporter who made him see the light of reality and not his old past. He got Burning Souls and pesonality wise make......badass,funny, relatable and 4 dimensional if that's a world even xD He saved the show for me even for the most time ever. My favorite episode about him dueling a load-shark with trying to find the job that's desicent.\\n\\n\r\nAkiza Izinski/Izayoi Aki: Her voice actress in DekaYellow form Dekaranger and also played KyoryuCyan in Kyoryuger. Reapared in Gokaiger and menny more. Prety girl with a personality of a witch and daddy issuies. Her power had problems controling at first and overtime became her own to control. A deck about plants. Overall, she is the best female girl even, despite her change of role in later half.\\n\\n\r\nCrow Hogan: BUY BLACKWING! Origanilly being a final Dark Singer villan, is now an ally to the team, all because his cards did so well and made the change to him by writing. Started of funny and really a well developed character. He cares about the children and protecting them.Something that touch my heart ;-;\\n\\n\r\nLuna/Leo/Luca/Lua/Ruka/Rua: The twins are easlily my favorite due in 5d's from day 1. Both of them have personality and care for each other and not end up being plot motivate fuel in a later arc. Adualt Luca looking kinda hot when fanart happens to go bye.\\n\\n\r\nBruno/Visor: He saved the show during the Yliaster coming from the future. I'd say he is like a brother to Yusei.\\n\\n\r\nThe Villians: All of them make an impact real strong towards every appearances they make. \\n\\n\r\nThe Filer cast ain't all that much, but still cares for Team 5D's in the very last arc. The we're able to evacuate a full city in under 5-9 episodes dueing Yusei vs Bruno\\n\\n\r\nAporia(Jose,Placido,Lucciano or in the dub; Jakob, Primo, Lester): BEST VILLAINS EVER. Aporia is the most tragic one to day, while his 3 forms are with differnt personality's and have thier own motiv into diving a huge temple on the city. While at first he felt despiar, they manage to make him believe in hope join the wining team's side.\\n\\n\r\nZ-One: Easlliy the best final villan in ygo histoy ever > Unlike the first two series, Z-One is more of a wise and sad figure with an apporache having no darkness in his heart. He actually thought humans could of changed from learning of thier own action(s) and at first that was true, but made me sad. He runs a Time Lord Deck with his ace being a best over 4k easliy going to 20k with an effect just like Armatile from Gx Season 3.\\n\\n\r\nAction/Dueling: The dynamics for this show are great and the best paced duels ever. Having most the duel take place on a motercycles in once of a life time chance. The only problem with that is solid-vission system being used to attack bystanders,I've even took some time to check out the duels my self. First turn the player who whent doesn't gain a speed counter in what is the main gimmick with this show's createvity.\\n\\n\r\nOVERALL: WATCH IT RIGHT NOW\\n\r\nI've actually decide to make this one my favorite aloung with Arc-V and making them my favorites. I can easily point out the show's flaws from top to botton and vise versa. The show's motiv is believe in your own team and never losing hope, while going for a better tommorow. Lots of moments with cool excutions were actually kinda exciting, especially when Yusei first invoked Shotting Start Dragon or Majestic Star Dragon and lastly Shotting Quasser Dragon to turn the tides of that battle. Or how he gave the speachies about the enemy being wrong and doing something good/bad will only make it look bad. Even Jack summonng Red Nova Dragon in his final fight with Yusei made this show for me all the love and respect. ^_^\\n\r\nFinal Score for it is.....SOLID 10/10 and even if had sad bad moments, i still love it after it's final moment.\\n\\n\r\nRIDING DUEL ACCELARATION!!!\\n\r\nLET'S TURBO DUEL!!!\\n\\n\r\nBtw, Happy 10 Year Birthday 5d's!!! <3 <3 <3 <3 <3\\n\\n\\n",
            "date": "2018-02-24T13:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 272357,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5435146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Helios92",
                "username": "Helios92"
            },
            "url": "https://myanimelist.net/reviews.php?id=272357"
        },
        {
            "content": "Well, what is there to say about an Anime about trading cards....hmmmm. Nothing, that's really it. It's a bunch of prepubescent kids, battling out with cards. We all know that this series is a sequel to the Original Series, we've seen some different reviews of people who hated it or those who simply love it. It's now my turn to throw down....a face down.\r\nThe story of the series is supposed to take place in a distant future of Yugi's home town, Domino City. There have been some freaky things going on that made Domino split into two parts; an Island called Satellite, and the mainland Neo Domino City. Those who live on Satellite are dirt poor and mostly criminals and ex cons live there. This  makes them processable to Neo Domino City. In summary there is Rich land and there is Poor land, a YuGiOh spin off of Robin Hood. Our cast of heroes come from different parts of Satellite and Neo Domino City, but though they have different aspirations they're destiny is fated to ban together and fight an evil force that has been hidden for a millennium that desires to concur the world....Well this sounds a lot like X 1999, and how I hated that movies so much. \\n\\n\r\nStory wise, it was made for kids. What do you really expect? Though watching the Japanese version is always better then the 4Kids TV version, I wasn't expecting anything exciting besides a few cliff hangers (with an obvious result). The characters in the series (Yusei, Jack, Aki, Rua, and Ruka) don't have many desirable development. They have the same tracked mind and always fight till the very end *Yawn*. Also the story is very screwy too; dueling on Motorcycles. Some one at Konami was really desperate to think of a new marketing idea. Riding 40-50 mph on a motorcycle down a stretch of high way while dueling is not my idea of super thrilling action; just plain stupid. Though this is such an idiotic course of action, they had to find one way to make the series keep existing. Another thing I'd like to point is they the changed the theme from Egyptian Mythology, to Aztec and Inca Mythology. Wasn't YuGiOh supposed to be about Egypt? I guess Kazuki Takahashi was impressed when he went on a trip to Peru or Mexico so he had to make a story based on that.\\n\\n\r\nIn the end I've watched a total of 50 episodes of this series, that a lot compared to the people who've given up on the series but watch it time to time. Probably reached the quarter make of it (my guess 160 episodes). At first I hated it but I had to give the series a chance since I like the Original YuGiOh series to begin with (Not the Duel Monsters one). The theme songs are pretty catchy and you find yourself looking for them online to put into your MP3. If you're a big player of YuGiOh TCG like I am, you might want to watch an episode or two but not dedicate to it. For those who like the series, you're probably a Narutard or some hopeless DBZ fan dope who can't differentiate between good Anime or something you saw in your monthly Newtype or Shonen Jump magazine. In the end of this I don't hate the series, but it's not a good series. You're probably better just playing the game and pretend this series doesn't exists.\\n\\n\r\nYours truly\\n\r\nOtakufreak\\n\\n\r\nPS. I activate a Trap Card, take evasive action!!",
            "date": "2009-03-19T18:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 13311,
            "reviewer": {
                "episodes_seen": 50,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1722.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/OtakuFreak",
                "username": "OtakuFreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=13311"
        },
        {
            "content": "CHILDREN’S CARD GAMES ON MOTORCYCLES!!!!\r\nOk, now that everyone has gotten that out of their system we can enter the world of high speed action that is Yugioh 5d’s\r\nThe third series of the Yugioh Franchise is marked by breaking away from many of the tropes that had plagued the other two, in particular the previous series Yugioh Gx. Rather than being built upon a tournament or school structure system, 5d’s manages to create its own almost post futuristic world.  The setting of this world is the best developed in all of Yugioh history. \r\nOur cast for this series is slightly different from the usual Yugiohcast. Yusei is not our average Yugioh protagonist. Not only is he older, but his maturity is shown to us time and time again. This is a shounen protagonist who is smart, cool and collected. He forges his own destiny, building his own motorcycle out of the scraps available to him. Jack Atlas takes the rival slot for the series. He starts off as the basic Kaiba clone for the series, arrogant and prideful. In a wise move they manage to develop him in such a way that makes him one of the more beloved characters of the series. Akiza becomes one of the most developed female characters in Yugioh history. Not only does she have a tragic past but she also is a strong duelist capable of putting Yusei and the like in their place. The uneasy bonds that these three share make up the core of Yugioh 5d’s.  \\n\\n\r\nThe plot still follows the regular card game format. Expect a couple tournament arcs with one time characters. Expect highly situational random dues ex machina card draws at the last minute that will never see print. Expect people to not stay dead for long. This is what the Yugioh franchise is about, and for what it’s worth, 5d’s manages to pull it off for the most part. Villains have personal connections to their opponents to make them more than just fights to save the world but also character battles. The Synchro mechanic introduced in 5d’s proves to be interesting and fun (Synchro Chants are addictive)  but in general the card designs in 5d’s are some of the best in all Yugioh history which make for some very entertaining duels. There is also a lot less random opponent of the week, and more plot oriented episodes. There are some really genuinely shocking moments in this series. \\n\\n\r\nIf this was all there was to 5d’s (up to episode 64) I probably would be able to give it an 8/10. A good reinvention of the Yugioh franchise. Unfortunately Yugioh 5d’s continued past the first season for almost 100 episodes. They start the second season with near 20 episodes of filler. Once they start engaging the actual plot of the second season, you realize that maybe the filler was the more humanitarian option. Character assassination doesn’t begin to describe what occurs in Season 2 of Yugioh 5d’s. The number of editorial changes and plot holes quickly begins to pile up, leaving no doubt that the writers are making this up as they go along. Towards the end of Season 2 they manage to recover a bit with some rather epic duels, but the damage has already been done.\\n\\n\r\nThe animation is what you would expect of an ongoing series with more than 150 episodes under its belt. There are some episodes that kick it out of the park with stellar animation. There are some few rather rare moments where the animation completely backfires and a dramatic moment is defused. It should be noted that I am not a fan of the 3D animation used in anime, especially inserted in regular animation. It interrupts the flow of the series at best. At worst it looks totally silly. Luckily 5d’s manages to keep the 3D animation to a minimum, not over using it. It is easy to overlook these few random moments.\\n\\n\r\nThe soundtrack of the series is one of the most enjoyable elements of Yugioh 5d’s.  A lot of the character theme’s are so intense and gripping that they can make even the most simple of duels seem like the world cup. Every moment is dripping with drama because of the awesome soundtrack. This is one part of the series that never takes a dip. Later in the series they add insert songs by Masaaki Endoh who also does a couple of opening themes, all of which are filled with so much energy and charge. \\n\\n\r\nIn total, Yugioh 5d’s can be inconsistent. It started off strong, and when it wants to be good the series can been very enjoyable, but when it is weak it can be disastrous and the last half of the series is filled with weak plot elements. If you are a Yugioh fan than this is something you must watch, but for everyone else there is better series to watch.\\n\\n\r\nRiding Duel Acceleration!!!",
            "date": "2011-03-30T19:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 35503,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257270.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lilyvess",
                "username": "Lilyvess"
            },
            "url": "https://myanimelist.net/reviews.php?id=35503"
        },
        {
            "content": "The first time I heard about the issuance of a new series of Yu-Gi-Oh! i was Happy even though I did not like Yu-Gi-Oh! GX and I did not watch it\r\nbut I was happy because I generally like the series Yu-Gi-Oh!\r\nAnd when I saw the Yu-Gi-Oh!5D' I found it very interesting\r\nmaybe one of the reasons is that I love the series Yu-Gi-Oh!\r\nbut the idea here is new and there are different way duels, on the motorcycle or without it.\r\nStory\r\nVery wonderful and mysterious in the beginning, I liked the distinction that made between Satellite and the city's peopleand how Yusei managed to emerge from the Satellite's group and took the title of the king.\\n\\n\r\nI liked also The idea of selectors and the Scarlet Dragon.\\n\\n\r\nAs usual there are Attention in friendship and confidence with playing cards and their impact on the duels.\\n\\n\\n\r\nCharacter\\n\\n\r\nYusei is very cool, Quiet, strong and gentle with everyone\\n\r\nOf coures he always think about his friends.\\n\\n\r\nBut he is different from the rest of the series characters of Yu-Gi-Oh in the age and his look.\\n\\n\\n\r\nArt\\n\\n\r\nDevelopment from the past, but there is still some negative aspects\\n\r\nSuch as the high intensity in the formulation of hair and clothing\\n\r\nI do not like it in some of the characters.\\n\r\n[the clothes dosen't move at all ^^\" ]\\n\\n\\n\r\nIn general I advise Anime lovers, especially lovers of the series Yu-Gi-Oh to watch it, they will find it very cool and will enjoy it ^_^.\\n\\n",
            "date": "2010-03-21T13:34:00+00:00",
            "helpful_count": 11,
            "mal_id": 24168,
            "reviewer": {
                "episodes_seen": 53,
                "image_url": "https://cdn.myanimelist.net/images/userimages/86993.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ran_chan",
                "username": "Ran_chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=24168"
        },
        {
            "content": "It's my first review 55+ It's a bit strange and not good english but I'll try the best.(I repair my score because It's awesome enough for 10 now ^_^)\r\nStory\r\nIt's the best point of this show.You didn't hear wrong. It's true.\r\nWithin 20 episodes I think the plot is awesome. Many secret of dragon marker and signer concern with the past and development of main character.\r\nThat's enough for me. But This show make me surpised ! \r\nIt's built many great event include with plot-driving every episode. Most of event I didn't expect. It's make this show exiciting more and more!\r\nArt\r\nthe Animation is okay for me.But I thinkAnimators can make better animation quality for this show...Some of episode if it's have better animation It's more enjoyable.But Sometimes I think to riding duel....It's make animator working hard.It want high quality animation(and i LIKE it)...since I have think to this. I understand everything...And says so..so..try the best animator-san!\\n\r\nand CG WOW! it's so coooool.\\n\\n\r\nSound\\n\r\nthey fit with this show.OP/ED is great. OST of this show is make me concern. It's pop-rocks tecno like theme of this show.\\n\\n\r\nCharacters\\n\r\nThe Characters in this show, I like The most is Yusei.He is smart,cool and smexy!(haha) but Aki, Ruka, Rua and Jack make me enjoyable too.Everyone have the past, character developmentand and nice habit.It's interesting and likable to watch. and.. \\n\r\nSupport character is useful!(Make me suprised again.) they have some development to driving a plot.and they have the past too(Wow...) \\n\\n\r\nEnjoyment\\n\r\nSure! It's very enjoyment for me! both of them(Duel and plot) are awesome.The main(Yusei) encounter with many trouble.It's exciting to see him find a way to against those trouble. and Hey! villians are work very well for me.they look smart.Oh Don't forget riding duel. It's entertaining for me than normal duel soooo much.\\n\\n\r\nOverall\\n\r\nIt's not like another series of Yu-gi-oh not like suck GX and original Yu-gi-oh. It HAVE plot and excitng story.Sometimes they have talk but hey! That talk for plot(Ep 14) It's new and follow me to watch this series to end.\\n\r\nI didn't want to see this make filler more and more like GX(I give up at five episodes) I wish director of this series don't betray me. \\n\\n\r\nYou should try this series at least five episodes!(Like I do with GX) but in times you won't find suck series ! You will find awesome series! Yu-gi-oh 5D's!\\n\\n",
            "date": "2008-08-16T08:25:00+00:00",
            "helpful_count": 11,
            "mal_id": 7180,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/86294.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/inkphoenix",
                "username": "inkphoenix"
            },
            "url": "https://myanimelist.net/reviews.php?id=7180"
        },
        {
            "content": "This anime is seriously one of the best I've ever watched. I love it to pieces. And by this, I am referring to the Japanese version, because the dub is just plain terrible. -_- It's a lot more mature than it's predecessors, DM and DMGX, so it's characters are older. The main character, Yusei Fudo, is an 18-year-old who lives in the slums of the Satellite, a poor city which only exists to serve the rich, upperclass residents of Neo Domino City. Much darker, no?  I love this anime because the story, the art, the characters-they're all outstanding. Wow, that doesn't really say anything.Here's what I mean:\\n\\n\r\nStory (10): The story for 5D's is simple, but complicated at the same time. In the beginning, it's pretty simple: the MC is going after his old friend who betrayed him and wants revenge. Though the story turns much more tangled and sophisticated. There is the dueling aspect of it too, where if you didn't see either of the first two series, you'd be totally confused. So if you haven't, it'd be a good idea to watch a few episodes or to look up the rules.\\n\\n\r\nArt (9): The art in this anime is, for the most part, amazing. Why do I say for the most part? For some odd reason, some of the art in some episodes are top-notch, and some of the episode's art are terrible. For example, episode 40 had pretty terrible graphics, but 41's art was astounding. Don't let that drive you away though-the art changes get better as the series goes on.\\n\\n\r\nSound (10): The musical score is just amazing. The perfect music for the perfect times. The sound effects are great. The openings and ending songs are really cool too.\\n\\n\r\nCharacter (10): The characters are all very likeable and admirable. They have backstories you can really empathize with. You even end up loving the villains, too! \\n\\n\r\nEnjoyment (10): I enjoyed 5D's very much. It has a lot of twists and turns. The only reason I don't recommend this to everyone is just because of the dueling aspect, and how odd it might be for people to just play card games randomly. If you do get over this fact, though, you can really lose yourself to 5D's.\\n\\n\r\nOverall (10): I think this was the best series in the Yu-Gi-Oh! franchise. Everything about 5D's is astounding. A must-watch for all Yu-Gi-Oh! DM and DMGX lovers-and everyone else!\\n\\n",
            "date": "2011-01-28T13:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 34095,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/433115.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BloodyRoseWitch",
                "username": "BloodyRoseWitch"
            },
            "url": "https://myanimelist.net/reviews.php?id=34095"
        },
        {
            "content": "This is my personal favorite entry into the yugioh franchise of the 3 that I have watched (Duel Monsters, GX, and 5Ds). This brings us a fairly different take on some duels in the form of riding duels while still keeping the heart of the yugioh franchise alive.\r\nStory (8/10):\r\nAs with any yugioh series, the story follows a series of adventures our heroes must take on against antagonists to save the world. How do they do it? In a series of card games, of course. However, I feel like the in-depth plot development of these arcs were very well-done. The audience was given a chance tounderstand the viewpoints of both the antagonists and our protagonists. The overall theme of the show is something along the lines of 'the importance of bonds between friends'. The show demonstrated this theme several times through the character's actions as well as through monologues and speeches made.\\n\\n\r\nThis show introduces the concept of dueling while riding a D Wheeler, basically a motorcycle. At first this idea seems silly, but the atmosphere of riding duels was very exciting. The characters and monsters were constantly in motion so there was a lot more going on than just finger pointing and monsters just chilling in front of our duelists.\\n\\n\r\nWe are also introduced to a new summoning technique, synchro summoning, to bring out new synchro monsters. This is what is used to bring out most of the new powerful monster, but it did not feel overpowered and was not the absolute single summoning technique in the show either. It brought a new update to the game that only served to make the duels more interesting to watch.\\n\\n\r\nArt (7/10):\\n\r\nThe character designs were on-point with yugioh's crazy hairstyles while managing to keep the overall deign of characters balanced. The background design of the different settings were distinct and unique. My main issue is that the quality of animation was somewhat inconsistent. Some episodes, we had breathtaking animation with fluid motion with excellent layout designs. Other episodes, the characters would look out of proportion even during closeups. The 3D models used worked very well for the most part even though it was fairly obvious that the characters/monsters were not drawn. There were a few times where the 3D just didn't work very well.\\n\\n\r\nSound (10/10):\\n\r\n5Ds knew exactly where it was going with its sound. The openings were all fantastic in terms of both music and animation while keeping with the overall theme of 'bonds'. The battle music helped several duels go from exciting to on-the-edge-of-my-seat exciting.\\n\\n\r\nCharacters (8/10):\\n\r\nYusei is our first and only yugioh protagonist to start out at the age of 18. Not only that, he has had to deal with issues such as poverty and being an orphan as a child which made him grow up to be a strong adult. The rest of the cast each get the spotlight for their character development when necessary and are fleshed out very well. There were a few characters who had a lot of potential for better development and a larger role in the story that were slowly left out of the plot.\\n\\n\r\nEnjoyment (10/10):\\n\r\nI laughed, I cried, and there were whole scenes that I re-watched at least 5 times because of how amazing they were. It was great seeing an older cast and the slight darker tomes the show had. \\n\\n\r\nI would recommend this to anyone trying to get into the yugioh franchise and even if they weren't. You do not need to have watched any of the other yugioh shows to jump into this one, but be warned that the show does not hand-hold the audience through the rules of duel monsters that other yugioh shows might do.",
            "date": "2015-05-29T12:09:00+00:00",
            "helpful_count": 10,
            "mal_id": 189104,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431857.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/funland",
                "username": "funland"
            },
            "url": "https://myanimelist.net/reviews.php?id=189104"
        },
        {
            "content": "Yu-Gi-Oh! 5DS is the most favorable Yu-Gi-Oh! series and one of the most wonderful anime from all aspects. The design and development of the protagonist Yusei Fudo, the formation of the 5DS team through the bonds with the nakama, the epic storyline and antagonists in every arc, the amazing Stardust Dragon which is the signature monster of 5DS together with its upgrade Shooting Star Dragon, the breathtaking ending and the overall aspects of the setting are so perfectly combined and laid out that give a wonderful feeling. This series have marked themselves in history and almost definately achieved the peak of Yu-Gi-Oh! and brought thebest out of the franchise.",
            "date": "2018-09-12T06:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 288832,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4819140.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Elfezen",
                "username": "Elfezen"
            },
            "url": "https://myanimelist.net/reviews.php?id=288832"
        },
        {
            "content": "Around the time GX was ending, Konami introduced a new set of Monsters into the game: Synchro Monsters, which I presume were made so that kids would get better in math (Okay, I’m kidding, but I just had to make that joke). As a result, a new series was a no brainer.\r\nWhat Konami probably didn’t expect, however, is that said series, Yu-Gi-Oh! 5D’s (5D’s standing for 5 Dragons), would be the single darkest Yu-Gi-Oh! Anime to date. However, does being dark equal being good? Let’s find out:\r\n1st Arc: Fortune Cup Arc (Episodes 1-26):\r\nMuch like GX, the show establishes its tone right off the bat. UnlikeGX however, it’s the plot that comes first, not the characters. I don’t mind this myself so long as the plot is good, and in 5D’s case, that’s mostly the case.\\n\\n\r\nLike said before, this show is pretty dark, the first two and the last arc in particular. The whole mood is sorta depressing all around, with Yusei suffering all kinds of abuse in the first 10 or so episodes. This is all helped by a very much cyberpunk-inspired esthetic, and this show very clearly has a style of its own. I love it.\\n\\n\r\nThat said, even though the first arc is tournament arc, I just love the way the cast gets dragged into it. Yusei’s all like “I have no interest in this fucking tournament” and then his friends are taken hostages. As far as the actual tournament goes, it’s great, and it helps that it works as a way to develop/introduce characters.\\n\\n\r\nSpeaking of characters, we have a lot to go through.\\n\\n\r\nFirst is Fudo Yusei, and he’s… perfectly fine. Yeah, I’m nowhere near as enamored with his character as the rest of the fanbase seems to be, but I do like him. He’s definitely different from all other protagonists before him. He’s basically Judai in the final arc of GX, only with the stoicness taken up to eleven. Oh, and he also has a guilt complex the size of Russia. As I said, I do like him, but he doesn’t get enough development for me to care that much for him.\\n\\n\r\nThe rest is better. Jack Atlas is probably one of my favorite rivals in the franchise. He’s prideful and arrogant, yet he does eventually soften up, with his redemption arc being extremely well done. Izayoi Aki is also probably my favorite female lead in the franchise. At first, she’s unstable and kinda insane, but then she becomes a total cinnamon roll. Also there’s the fact that she’s played by my sorta childhood crush (DAMN YOU DEKARANGER!!).\\n\\n\r\nFinally are the twins Lua and Luca… or maybe it’s Rua and Ruka… I have no idea. Anyhow, they’re perfectly fine, but I don’t care that much about them.\\n\\n\r\nFinally are the villains. Rex Godwin is a complete magnificent bastard, and a total genius to say the least. It’s amazing how, by the end of the arc, he has everyone right where he wants them to be. There’s also Yeager, who doesn’t get much to do in these first two arcs, but does get a surprising amount of focus in the last three arcs. Same goes for Ushio. Yes, they actually brought back the bully from the first chapter of the Manga and made him a recurring character. Which just never fails to crack me up.\\n\\n\r\nThe rest are D-List characters, but I will mention that this show has the single greatest combat commentator EVER. That guy is badass.\\n\\n\r\n2nd Arc: Dark Signers Arc (Episodes 27-64):\\n\\n\r\nThis is definitely the best arc of the show. To start off with, it very cleverly builds on what was established in the last arc, with everyone getting a decent bit of development… or at least, as much development as they could get considering all the behind the scenes baggage this show had. Joy.\\n\\n\r\nAs far as said development goes, Aki and Jack get the most. Aki is forced to ultimately confront her past and all of the atrocities she’s done, however she’s so emotionally and mentally unstable that she just ends up being easily manipulated by the antagonists. As for Jack, he’s also forced to humble himself, coming to terms with all of the crap he pulled before the show started, and his relationship with Carly is really well done, and you can bet I was pissed when they didn’t follow up on it in the following arcs.\\n\r\nAs far as new characters go, let’s talk about the one everyone wants me to talk about: Crow Hogan. I… really don’t care about him. He’s somewhat generic, a bit of a creator’s pet (Which is especially notable in Arc-V) but overall, I don’t hate him or anything. At least his Deck is cool. Also, no, it wasn’t Konami’s fault that he didn’t become the last Dark Signer, if that was the case, then Kiryu should’ve become a part of the main cast due to how many people used Infernities. \\n\\n\r\nAs far as the titular Dark Signers, I like them… well, with the exception of Demak, he sucks. All of them are a new spin on the whole idea of people being turned evil by some sort of influence from the Doma arc, and turn it up to eleven. My favorite was Kiryu Kyosuke, who had the good luck of getting some extra development after the end of this arc.\\n\\n\r\nOverall, a pretty damn good arc if I may say so myself. Dare I say, it’s probably one of my favorites in all of Yu-Gi-Oh! right behind the Dimension World arc of GX and the Barian Emperor Onslaught Arc from ZeXal.\\n\\n\r\n3rd Arc: Pre-World Riding Duel Grand Prix Arc (Episodes 65-98)\\n\\n\r\nWhich is then immediately followed by the worst arc in the show. Because of course it would.\\n\\n\r\nTo be fair, there was a lot of behind the scenes baggage around this time, but even so, this arc is just boring. It tries to be similar to the Seven Stars Arc of GX. However, while that Arc’s structure worked well in GX due to its character driven nature, the more plot driven 5D’s does not work as well with that structure. As a result, most of the stuff here is nothing but set-up for the next arc.\\n\\n\r\nMind you, not everything is bad. I do like the small mini-arc set in Crash Town, which finishes off Kiryu’s character arc. Not only is the show stylized in a completely different fashion from the rest of the show (Going more for an Old West look) but it also has legitimate stakes and some impressive use of music all around. It’s definitely the highlight of this arc.\\n\\n\r\nAs far as characters introduced, I’ll save the villains for a bit later. As for the heroes, two new characters are added to the cast. The first is Bruno. I actually like this guy, he’s rather meek and adorkable, and his bromance with Yusei is just glorious. Then there’s Sherry LeBlanc. I like her fine enough, but really she’s just a worse Mai.\\n\\n\r\nOverall, not the worst arc ever, just so generic that it blends in with the rest.\\n\\n\r\n4th Arc: World Riding Duel Grand Prix Arc (Episodes 98-129):\\n\\n\r\nThis is just as middle of the road as Tournament Arcs get. I mean, it’s fine, but nothing about it sticks out whatsoever. We do get a few new moments here and there, and Yusei and Jack’s new Aces (Scar Red Nova Dragon and Shooting Star Dragon) are just plain badass, and so is the way that they’re obtained, but nothing else sticks out about this arc.\\n\\n\r\nI mean, let’s just look at the Teams our heroes fight. The first is Team Unicorn, a team that’s supposed to have excellent teamwork… yet their strategies have nothing in common and the way they’re defeated reeks of Deus Ex Machina. Then there’s Team Catastrophe, who are so pathetic they only last about 2 episodes. Then there’s Team Taiyou, the only one of the bunch I would consider good, as they’re all a bunch of Adorkable guys and I’m just a fan of underdogs in general. Finally is Team Ragnarok, who’s not the worst, but they’re just kinda generic.\\n\\n\r\nHell, I’d say the best part about this Arc was when Jack and Yusei suddenly left Japan so that Jack could make a demon his bitch. Now THAT was awesome.\\n\\n\r\nLet’s finally talk about the villains, the three Emperors of Iliaster. They’re fine, I guess, but honestly they’re not the most threatening bunch. Overall, while this Arc isn’t bad, I wouldn’t dare call it good either.\\n\\n\r\nFinal Arc: Ark Cradle Arc (Episodes 130-154):\\n\\n\r\nThankfully, the show does get back on track in its final stretch. For starters, it actually felt as if there were stakes this time around. I don’t just mean that in the whole “Oh no! The world’s gonna be destroyed” way, but also in the way that the characters actually have a reason to be personally involved in all of this.\\n\\n\r\nAlso, while I don’t care much about the three Emperors individually, I do love Arporia. Putting aside the fact that half his damn dialogue sounds as if it came out of Danganronpa, the guy is imposing and has a very relatable backstory. Much of the same can be said about his two allies, Antinomy and Z-ONE, who’s quite possibly the best main villain in the whole franchise.\\n\\n\r\nFinally, the arc does legitimately feel like the climax to an epic story, with everyone getting their own little moment to shine. And of course, despite how ridiculously long it is, the Yusei vs. Z-ONE Duel is amazing, definitely the best defeat of a big bad in the whole franchise.\\n\\n\r\nIn general, this was a pretty good end to the show, and while it doesn’t entirely redeem all of the post-Dark Signer stuff, it does make it somewhat more bearable.\\n\\n\r\nAnimation:\\n\\n\r\nYou know how GX’s animation as average but at least it was consistent? Well, this show is the exact opposite. At times, the show looks borderline amazing, but other times, it looks like absolute crap. I should also note that this is the show that marked the point in which some Monsters would be CGI, and thankfully it’s only reserved for the more simplistic designs, with most of the more complex ones being traditionally animated.\\n\\n\r\nSound:\\n\\n\r\nThe soundtrack is fantastic. As always, traditional instruments are used often, however in contrast to GX’s use of the electric guitar, this show seems to be more fond of techno beats. That is, outside of the Openings, all of whom are straight up rock. As for said Openings, I didn’t really care for “Kizuna” or “FREEDOM”, but I really liked “BELIEVE IN NEXUS” and absolutely adored both “LAST TRAIN” and “Going My Way”. Also, the first Insert song in the franchise: “Clear Mind”, which is AWESOME! Same goes for the endings, with my favorite being the fourth one “Close To You”.\\n\\n\r\nVoice Acting:\\n\\n\r\nOnce again, the cast is somewhat Amateurish. Thankfully, there isn’t any performance that was particularly bad this time around. I already mentioned Kinoshita Ayumi as Aki, and she did a fantastic job, even if she did sometimes sound like discount Koshimizu Ami (In fact, is it just me or does Aki kinda look like Kallen from Code Geass?). Same goes for Miyashita Yuya as Yusei, who, like Kazama Shunsuke before him, is not even a Seiyuu but rather a singer, yet he had one of the best performances in the show.\\n\\n\r\nThe rest of the Cast is pretty good too. Just mantioning some of the more recognizable Seiyuus, we have Ono Yuki, Terasaki Yuka, Hoshino Takanori, Minagawa Junko, Okomura Akemi and (Most surprisingly for me) Ishikawa Hideo.\\n\\n\r\nOverall:\\n\\n\r\nSo no, 5D’s isn’t the best Yu-Gi-Oh! series. That said, I wouldn’t mind considering it either the second or third best. The middle is what brings it down, as the show does start and end on a high note. Overall, it’s a fun show brought down by a few too many issues.\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-12-20T06:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 296247,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=296247"
        },
        {
            "content": "I wouldn't recommend this to any people that aren't familiar with Yu Gi Oh because they would struggle to follow the duels that make up far more than who wins. Lots of character development is tied into the dueling and play styles reflect characters.\r\nFor people that can follow the dueling, the start of all these Yu Gi Oh animies tend to start slowly with bad duels but they duels themselves get much better later in.\r\nThe character development is superb and arcs well throughout.\r\nMy main complaint would be the dubbing US company cut out around 20 episodes at the end and literally changed the ending. Thedubbed ending is basically just bad and cuts out crucial development and story features, so even if you prefer watching dubs, switch over to subs over Season 4 because the dub cuts out there.",
            "date": "2014-10-25T06:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 166097,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4203427.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Skeletonxf",
                "username": "Skeletonxf"
            },
            "url": "https://myanimelist.net/reviews.php?id=166097"
        },
        {
            "content": "Yu-Gi-Oh 5D's, while certainly not without its flaws, is the third addition to the Yu-Gi-Oh anime franchise (not counting the one by Toei) and is quite possibly the most intriguing of the bunch. As you should know by now, in this series the card games are played on motorcycles, or \"D-Wheels\" (Duel Runners if you're watching the dub, but really, the dub is so bad it's laughable, so the Japanese version is recommended in this case).   I'm sure everyone had the initial \"Card Games on Motorcycles?!?!\" reaction upon coming across this show, myself included.  But really once you think about it, GXhad an school that teaches kids how to play card games for a living, so motorcycles can't be that much more ridiculous. \\n\\n\r\nStory (7/10): The story is more outlandish and interesting than its predecessors, being set in the future (though exactly how much in the future compared to GX and DM is never said), and it is also a bit darker since it's set in a dystopian society. Synchro monsters are heavily used by characters here much like how fusions were used a lot in GX. The \"Card Games on  Motorcycles\" concept is executed quite well; it has its own system of dueling with \"Speed World\", and regular ground duels still occur often. On the other hand, it is a bit annoying that an explanation is never given for how card games on motorcycles originated or why the characters even bother with the trouble. \\n\r\nThe overarching plot is based in Incan culture which was nice, but there's not really anything that's particularly deep or though-provoking in the plot, and card games and friendship (KIZUNA!!!!) are still used to save the world, though more believably than the other two series. The main characters are the Signers who are chosen by the Crimson Dragon, a Yu-Gi-Oh god, to save the world from the Dark Signers. There are a fair share of twists and turns and a good amount of foreshadowing (though sometimes it's not that subtle), but there are also a few deus ex machinas, so be warned. There are a few places where the story slows down a bit for duels, but overall the plot moves along quite nicely. The first arc was probably the most consistently good, but the second arc really made you like the characters despite some speed bumps near the end.\\n\\n\r\nArt (7/10): The art is quite a mish mash, ranging from really good (though still not with a lot of moving) to mediocre, and it's obvious that the animation team changes with each episode. The CGI for certain monsters can be really bad as well, but it thankfully doesn't use it that often. Overall, the art is okay and usually doesn't detract from the viewing experience.\\n\\n\r\nSound (8/10): This series is known among fans for having a great soundtrack that really helps support the mood of the scene. It probably won't make anyone's Top Anime Soundtracks of All Time, but the music is still consistently good. \\n\\n\r\nCharacters (8/10): This show is better at not making the focus on only one character and having them duel all the time than the previous two (I'm looking at you, GX). It also has some of the best character development the franchise has to offer. Since there aren't too many main characters, I'll just go through them one by one. \\n\\n\r\nYusei Fudo- Yusei, the main character, is a serious and cool Signer instead of a standard shonen idiot hero. He is also unfairly looked down upon by society due to his background.  Both of these things are a fresh breath of air from Judai from GX, and it was really cool to seem him win duels in clever ways and make people change the way they view him. He's a static character, but he also is quite round in his personality; though initially he's just a kind stoic who really cares about his friends but otherwise doesn't let much bother him, later he's shown to have insecurities and is quite distraught whenever someone he cares dies. But like I said previously, he's a static character so he doesn't go through much character development at all (this is not necessarily a bad thing). Overall, he's probably one of the most likable characters in the series, and I'm glad they didn't decide to make him invincible, win every duel through cards that he never had before and will never use again, and steal all the screen time. *coughs* \\n\\n\r\nJack Atlus: Jack is the rival of this series, coming from the same background as Yusei, and is the main antagonist of the first arc despite also being a Signer. I know that a lot of people think he's a cheap rip-off of Kaiba, and he really seems like that at first, being a jerk who betrayed his friends so that he could become the King of Riding Duels. Later, however, I think Jack's really more like Silver from the Pokemon games, and by that, I mean WAY BETTER THAN KAIBA. Jack is a dynamic round character so he goes through a lot a character development (probably the best next to Ushio's, who isn't really a main character and thus I won't spend much time talking about him) and later you find out that he's really not as much of a jerk as Kaiba (and is over 9000 times better than said CEO), and is also insecure and most of all HUMAN. I could gush on and on about how awesome it was to see Jack change from a knock-off of Kaiba (who is just a plain jerk whose only redeeming factor is his relationship with Mokuba) to a man who is trying to improve himself. He also has ATLAS PUNCH which is just plain awesome. Definitely my personal favorite character, and he's pretty well-received by others as well. It's just a good thing that they didn't make him a total noob at card games later and be mostly for comic relief than an actual rival. \\n\r\n*coughs loudly*\\n\\n\r\nAki Izayoi-  Aki is a Signer who happens to have psychic powers that make any card she plays come to life. Although this may seem cool at first, this also means that any damage she inflicts is actually painful and destructive, which leads her to be prejudiced against by society.  Aki is probably best described as misunderstood. She is initially a violent, destructive, but skilled duelist who everyone hates (I think this is the Aki that most people like), but it is later revealed that the unstableness of her personality stems mostly from her parents. While the way this is presented mostly makes Aki come off as a brat who takes things too seriously, it also shows that she is not genuinely a bad person, but just has somewhat understandable issues. I think Aki's character development from a violent witch to a stable, well-meaning individual made people think her character got derailed, but I don't think that \"violent witch\" was really part of her personality in the first place; it was just a mask. But no matter how you look at it, Aki was a good character with a design that many men I know are happy with. I'm just glad they didn't make her a bench warmer whose is totally dependent on Yusei for everything. \\n\r\n*nearly chokes on the mucus in her throat*\\n\\n\r\nRuka and Rua- Ruka and Rua are \"identical\" twins, so they look alike despite the fact that one of them is a girl and the other is a boy. They are younger than the rest of the cast, being around 11 while everyone else is in their late teens. Ruka is the younger yet more mature Signer twin, and is also a dueling prodigy who can talk to duel spirits like Judai and Manjoume from GX. Rua is the immature older twin who is not a Signer and probably fits the idiot hero bill better than anyone else. He's reckless, and he cries if he loses a duel. But he truly cares about his sister and wants to protect her, and his character is developed quite a bit. Ruka, while nice and insightful, is a bit of a disappointment. She actually gets to duel less than Rua despite the fact that she's a Signer and Rua's not. She's not weak in a dueling sense, but she gets to duel so rarely that it's hard to tell that she's really a prodigy.\\n\\n\r\nCrow Hogan- Crow is a guy who comes from the same background as Yusei and Jack and yet is introduced 30 whole episodes after they were introduced. He's probably the worst character of the main cast because of this. While his personality of being essentially a loud-mouthed Robin Hood figure for children is okay (though still not very interesting), him suddenly getting introduced in the second arc and being old buddies with Jack and Yusei, despite never being mentioned or even foreshadowed  makes him creep into Gary Stu territory. He also has a deck that is very good in real life and thus, Crow almost never loses a duel.  I personally don't hate Crow as much as many others do, but it's impossible to deny that he stole screen time from more interesting characters who were established before him solely to promote his deck. That, and his D-Wheel can fly. \\n\\n\r\nEnjoyment (9/10): In my opinion, this is the most enjoyable Yu-Gi-Oh series to date, with interesting characters who all actually do stuff and a plot that actually goes somewhere. Seeing Yusei be prejudiced against by society yet still kick butt was awesome, as well. \\n\\n\r\nOverall (8/10): Being 64 episodes long and with virtually no filler, Yu-Gi-Oh 5D's is a must-see for any Yu-Gi-Oh fan even with its ridiculous concept. I'm just glad they didn't make the series 90 episodes of crud longer and totally derail virtually every character's personality. *falls out of her chair in a coughing fit* Wow, I think I might be coming down with something.",
            "date": "2011-06-11T15:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 37761,
            "reviewer": {
                "episodes_seen": 64,
                "image_url": "https://cdn.myanimelist.net/images/userimages/219839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rainbow67737",
                "username": "Rainbow67737"
            },
            "url": "https://myanimelist.net/reviews.php?id=37761"
        },
        {
            "content": "Yuugiou 5D's is, honestly, the best Yuugiou series out of Generation Next and Duel Monsters. I know we all got irratated with Yuugiou thanks to GX, but after watching the first episode, 5D's, like DM, even though it may look sort've weird and outlandish, it manages to suck you into watching it.\r\nStory: 10/10\r\nAt first, the storyline may seem a little weird. Well, due to the fact the story line actually varies, yes. It does seem weird. But you'll grow to like it and love it even. \r\nArt: 8/10\r\nHonestly, if the animation wasn't so weird at random intervals, I could have given this a 10/10 also.The art is enjoyable and colorful. And it's not hurting to your eyes, especially later on. \\n\\n\r\nSound: 10/10\\n\r\nThat is, if you watch good quality videos. But in all seriousness, the sound is good too.\\n\\n\r\nCharacter: 10/10\\n\r\nWell, they're not cheap rip-offs of the other characters in Yuugiou and that's always a good thing. But, each character has their own personality and while you might think at times, \"This character is oddly like so-and-so\", the truth is, they're not. Characters are just that good.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI just enjoy it. Through the sad moments to happy to funny.\\n\\n\r\nOverall: 10/10\\n\r\nIn conclusion, if you've been a Yuugiou fan for years, you'll love this series. ;3",
            "date": "2009-02-19T14:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 12566,
            "reviewer": {
                "episodes_seen": 46,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99346.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChibiCrow",
                "username": "ChibiCrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=12566"
        },
        {
            "content": "I'd like to start off by saying that I've been a huge fan of Yu-Gi-Oh! since I was a grade schooler. However, I'm not talking about all the terrible 4Kids dubs. The Japanese versions have such great writing and storytelling, you'd be doing yourself a huge disservice by watching this in the censored and butchered English dub. 4Kids decided not to even dub and air the last 10 episodes.\r\nI will be reviewing this series as a whole and not each individual arc. Now with that out of the way, here are my thoughts on what I believe to be the best Yu-Gi-Oh! has to offer:Yu-Gi-Oh! 5D's\\n\\n\\n\r\nStory: 10\\n\r\nWhat I hear a lot from people in both the avid and non-avid community is that the whole idea of card games on motorcycles sound incredibly silly. At first, I felt the same way. But hear me out, it's really badass.\\n\\n\r\nThe act of dueling on motorcycles known as D-Wheels (or Duel Runners in the dub) is called Riding Duels (or Turbo Duels in the dub). Think of this as this world's equivalent of circuit racing and illegal street racing. Of course, when there's illegal street racing, there will be police chases. The Public Security Maintenance Bureau (or Sector Security in the dub) is the authority that forces illegal D-Wheelers into a duel, in which the loser's bike shuts down.\\n\\n\r\nThe setting takes place some time waaay after the events of Duel Monsters and GX in Neo Domino City. A highly maintained and advanced city that feels so much more alive than just a city that glorifies a card game. Away from the main city is a slum area known as the Satellite. This place is basically the ghetto. This is also where laborers are forced to separate trash and recyclables. Security keeps heavy watch over Satellite, arresting anyone they possibly can. People living in the city treats people from the Satellite with heavy discrimination. A theme of this show is overcoming that discrimination and unifying those in the city and those in the Satellite.\\n\\n\r\nThe show also tackle themes of regarding revenge, death, and mass genocide. Just wanted to put that out there.\\n\\n\\n\r\nCharacters: 9\\n\r\n5D's has my favorite protagonist in all of the Yu-Gi-Oh! series. Yusei Fudo. An 18 year-old duelist and mechanic living in the Satellite slums. He has a more mature and collected personality than the previous protagonists, adding to that, he's an incredibly good duelist. Rather than defeating his opponents with powerful cards, he uses a collection of what is thought to be weak and useless cards to achieve massive victories. He represents the weak but many lives of those living in the Satellite.\\n\\n\r\nAs for the rest of the cast, I would rather not spoil it, but I will say that they are the most developed and complex characters in Yu-Gi-Oh!\\n\\n\r\nI do, however, want to mention Aki Izayoi. She is the female protagonist of 5D's and is only one in all the Yu-Gi-Oh! series that was not tossed aside as a cheerleader or damsel in distress for the main character. She received one hell of her own story arc and was written to be one of the best duelists and characters in the show.\\n\\n\\n\r\nArt: 7\\n\r\nIt's pretty decent. Definitely a huge step up from Duel Monsters and GX. I'm very fond of the CG used in the show, as it makes for VERY eye-catching summon animations.\\n\\n\\n\r\nSound: 10\\n\r\nMy god, am I in love with the OST for this series. Yutaka Minobe did a fantastic job for 5D's. The OSTs from Duel Monsters and GX were only okay, but this one was just soooo good. It was such a shame that not even this was left in the English dub, 4Kids replaced it with their own crappy music.\\n\\n\r\nAn insert song was written by Masaaki Endoh called \"Clear Mind.\" And let me just say that the scene where it played was hype as f**k.\\n\\n\r\nAs for sound effects, also great. A huge step up from the previous series.\\n\\n\\n\r\nEnjoyment: 10\\n\r\nThere is a huge bias here, as I am still a very active Yu-Gi-Oh! player in college. There was no barrier of entry here, as I already play the game myself at a competitive level. So I was able to enjoy the story to its fullest extent.\\n\\n\\n\r\nOverall: 10\\n\r\nYu-Gi-Oh! 5D's has a special place in my heart and I cannot fairly rank it on my favorites list. Yusei is my favorite character in any form of fiction of all times. He's such a heroic and righteous figure. There really were times where the show brought tears to my eyes. Yu-Gi-Oh! 5D's wasn't meant to be the children's show/advertising campaign that 4Kids made it out to be. It has a deep and compelling story and a large cast of lovable characters that I can never forget.",
            "date": "2016-07-11T15:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 223769,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5124040.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KapnTemple",
                "username": "KapnTemple"
            },
            "url": "https://myanimelist.net/reviews.php?id=223769"
        },
        {
            "content": "When I first heard of the series, I thought it would be a lame attempt to try to get people to continue buying the merchandise. I got bored after watching the first few episodes and put the series on hold for many months. After a while, I decided to get the series off my list and decided to watch it.\r\nBoy, was I glad I did.\r\nPlot:\r\nPersonally, I found that this plot was a lot better than the plots of the previous two series. It wasn't just people wanting revenge for random reasons, it was people trying to change the world for the better, albeit using thewrong techniques. It also focused on a lot of real-life issues such as discrimination and how the under-classed people have hopes and dreams too.\\n\\n\r\nI liked the second season storyline better than the first. \\n\\n\r\nArt:\\n\r\nFor a Yuugiou series, the art is pretty good. I find that animators focused their art skills more on the monsters than the characters. The characters are pretty simple, but they look good. However, I think animators should pay more attention to details when characters are zoomed out; usually the characters don't look great from far away.\\n\\n\r\nSound:\\n\r\nSound effects are realistic. I love the theme and insert music; I think they are the best out of all the Yuugiou series. Soundtrack fits with the mood - mysterious, dark - , but I feel that Yusei's theme was overused - it played just about every episode...\\n\\n\r\nCharacter:\\n\r\nOverall, characters were great; they weren't flat. Development is good too. I just found Yusei to be the same in the first 40 episodes or so; he kept talking about bonds and the speech every time was kind of annoying, but other than that, it was good.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this series very much. I'm sad it's the shortest series.\\n\\n\r\n-Sigh, my first review ^^-",
            "date": "2011-08-19T09:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 41765,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CabernetRose",
                "username": "CabernetRose"
            },
            "url": "https://myanimelist.net/reviews.php?id=41765"
        }
    ],
    [
        {
            "content": "Edited this entire review. I'm watching this subbed and I recommend you do the same. I've seen a few episodes of the dub and they've completely butchered it. \r\nIt's that time again: when one Yugioh series comes to an end and we get a fresh start with new characters. Comparing to it's past series, 5D's definitely takes on a more mature feeling. Not just because the characters are older and more serious, but not everything is a ray of sunshine for our protagonist this time around if you catch my drift. ;]\r\nStory - Well, the story was a bit different. It is set many yearsinto the future so we can't expect any recurring appearances from any GX or DM characters. So far the story has had three major arcs. The early episodes really introduce the characters and the new way of dueling which is called a \"Riding Duel\". However, when the second arc (the Dark Signer arc) begins, the show gets much more dark and much more exciting. The third arc is still underway so I can't comment on it thus far.  \\n\\n\r\nWe still have this obsession with Dragons in the Yugioh franchise for some odd reason, this time being the \"Crimson Dragon\". You've got your general bad guy who plans on using some ancient power by using special people known as \"Signers\". Weird, eh? It takes a little while for the plot to begin, but we do get to see some background on our main character, Yusei, and his relationship with our so-called \"Kaiba\" of this Yugioh series, Jack Atlas, in the meantime. Like I said, it takes on a more mature plot, but it still is a kid's show.\\n\\n\r\nSound - The sound isn't that bad. The sound of a bike motor revving can get annoying, but I guess that's something you'll have to get used to when watching 5Ds. The OP and ED themes aren't that bad either.\\n\\n\r\nArt/Animation - I'd say the art was pretty good this time. Technology is a wonderful thing, isn't it? \\n\\n\r\nEnjoyment - To be completely honest, I hated this show at first. My initial thoughts were somewhere along the lines of \"What the hell?!\" When you watched the original DM, you loved it (if you didn't, you probably wouldn't be reading this review and if you haven't watched the original series but would like to watch this one, you should check out the prequels first [you don't need to, though]). When you watched GX, you were a little taken back by the new characters, but in the end it still was decent (give or take). But this...this new concept they came up with...it's just insane (at first). DM focused on tribute summons, GX on Fusions, and this time we get Synchro monsters. Initially, it's just a no, but you get used to it and it really fleshes out as a show and the rules changes (more like additional rules) are great! They don't ride bikes for every duel I might add! The one thing that I'd have to complain about is how they always make the main character (this time around his name is Yusei) duel soooo much while other awesome characters (coughAKIcough) don't get to duel as much, and if they do they don't do as well as Yusei. But it's still very enjoyable. \\n\\n\r\nOverall, 5Ds isn't that bad after adjusting to it. Just get ready for a bunch of bikes, new rules, and an interesting bunch of characters. Keep an open mind and enjoy. :P",
            "date": "2008-09-14T18:24:00+00:00",
            "helpful_count": 133,
            "mal_id": 7942,
            "reviewer": {
                "episodes_seen": 100,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56544.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Grimmm",
                "username": "Grimmm"
            },
            "url": "https://myanimelist.net/reviews.php?id=7942"
        },
        {
            "content": "When Yu-Gi-Oh! Duel Monsters GX began airing, I thought that it was going to follow in the footsteps of Yu-Gi-Oh! Duel Monsters.  That was not the case.  However, I feel that Yu-Gi-Oh! 5D's brings back what everyone loved about the Yu-Gi-Oh! Duel Monsters, and a few extra things along with it.\r\nStory:\r\nThe story of this series is far more fast-paced and exciting that either of it's two predecessors.  If even one episode is missed, it feels as though you've missed a lot.  Almost every, if not, every episode ends with a cliffhanger.  The plot is amazing.  It still has theancient-themed story, just like the original Yu-Gi-Oh!, but it intertwines with the present-day atmosphere of Neo Domino City.  The story is no longer Duel Monsters-centered as Yu-Gi-Oh! Duel Monsters GX was.  The name \"Duel Monsters\" is barely even mentioned.  The story and dealings of the characters are once again the main point of the anime.  Duels are like gun combat or swordfights are in other anime series.  It is merely a way of combat in the series.  The story is one of Yu-Gi-Oh! 5D's greatest assets.\\n\\n\r\nAnimation:\\n\r\nThe art in this show is amazing.  Every character has their own look and style reflecting their personality.  The D-Wheels (called Duel Runners in the dub) are always something to look forward to seeing.  There is also a lot of CG animation, especially when it comes to Riding Duels (called Turbo Duels in the dub) and monsters, especially Stardust and Red Demon's dragons.  \\n\\n\r\nSound:\\n\r\nThe music in this series fits it so nicely.  The music sets up the atmosphere for every scene so accurately.  The opening and ending themes are among my favorite songs.  The noises for the D-Wheels does not sound like a conventional motorbike, or a motorbike at all.  All the D-Wheel sounds are completely brand new and sound nothing like real motorcycles.  Even Security sirens sound nothing like their real-world counterparts.\\n\\n\r\nCharacter:\\n\r\nThe characters in this series are phenomenal.  Yusei is completely different from both Yugi and Judai.  His life is not like theirs as he grew-up in the ghetto known as Satellite in poverty along with his friends.  Jack is like Seto Kaiba in terms of personality and pride.  However, he is not as cold-hearted as Kaiba as he quickly has a change of heart towards Yusei and his friends.  The supporting characters are not annoying at all and viewers will quickly warm-up to them.  All the characters are well developed.\\n\\n\r\nEnjoyment:\\n\r\nThis show is far more enjoyable than it's two predecessors.  As I said before, every episode ends on a cliffhanger.  The plot is great and intriguing.  There are many things to look forward to every episode.\\n\\n\r\nOverall:\\n\r\nThis is the best Yu-Gi-Oh! series yet, and one of the best television series I have ever seen.  Everything about it is so great.  If it wasn't evident in it's two predecessors, then it sure is in Yu-Gi-Oh! 5D's that the Yu-Gi-Oh! series is not meant for children like it's American dub.  The plot is so much darker and the characters are rarely happy, unless they are about to cause pain to their adversaries.  Mr. Takahashi makes his target audience, teens and young adults, clear in this series.  It is this tone that makes this show great.  I'm sure that it will only get better as the plot expands.  This is definately a must-watch series.",
            "date": "2008-12-03T17:52:00+00:00",
            "helpful_count": 131,
            "mal_id": 10072,
            "reviewer": {
                "episodes_seen": 98,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FlashFlare11",
                "username": "FlashFlare11"
            },
            "url": "https://myanimelist.net/reviews.php?id=10072"
        },
        {
            "content": "take the scenario from Terminator + tons of mindless violence + card games on motorcycles (that are surprisingly good) + a badass protagonist: Welcome to 5ds!\r\n5ds revitalized the game when it needed it most. Konami created new types of cards (synchros) and introduced them through an anime so good that people actually got over the fact that Konami was creating new rules again (The same tactic was repeated quite successfully with Arc V and completely failed with Zexal). The duels suddenly became A LOT faster and more enjoyable and the game that was going downhill until then suddenly stepped up.\r\nFor starters FINALLY we're through with\"school children protagonists\". Yusei was already 18 when the show started, had already trouble with cops and was basically living in a giant scrapyard/post-apocalyptic city. Literally from the first minutes of the anime all you can say is \"wow, is this really yugioh?!\". Obviously the super-added levels of violence meant that 4kids butchered the anime even more than usual in the dub, making it utterly unwatchable, but that's hardly the original's fault.\\n\\n\r\nAnd staying on the \"violence makes good\" theme, lets talk about emotional violence as well. Aki, the show's female lead is quite clearly a girl with a LOT of problems and torn between her loyalties, from the start to the end. On the one hand she wants to go with the protagonist... Mostly because she just fancies him, on the other she wants to stay with her boss, who she also fancies (kinda, and also kinda sees him as a fatherly figure, honestly it's a pretty interesting subplot). And the main reason she can't choose is that in 5ds, there is no clearly evil character. Obviously the protagonist is good, but there is no character you can clearly call an \"one-sided villain\", including her boss. On one hand that makes for a much more mature plot, on other it doesn't allow for the sheer evil badassness that Vector was (read my zexal II review).  In fact even the last main villain of the anime, the big bad behind it all, STILL isn't evil. Misguided maybe, yes, but he only had the best of intentions (you know, unlike the motherfu%$ing Vector and the others).\\n\\n\r\nThe protagonist, Yusei, best of all, never jokes, almost never smiles and is in fact from start to finish dead serious about everything. The fact that he can outrun security (constantly), beat the crap out of everyone (no, I don't mean in a card game, I mean literally, beat the crap out of people), build 2 whole motorcycles from scrap and understand physics (without ever going to school mind you) makes him a total boss. After him comes Jack Atlas, the second male lead, who gets almost equal screentime, and is a fan-favourite due to his dueling style and unparalleled ego. He makes for an amazing antagonist and surprisingly well-written character (and is in fact the only character in the anime to get more chicks than Yusei). Lets be honest here, EVERYONE who has seen 5ds was hyped every time that \"Red Demon's Dragon\" was summoned. (Come on, you can even recite the summoning chant)\\n\\n\r\nThe plot starts from post-apocalyptic future, goes to \"suck my Aztec d$%^\" and ends up Terminator (down to the last detail). While pretty light on twists there are a few that really make for interesting story (for example who the final opponents of the second and final Arcs were). Most of the anime is delightfully dark, with purple and dark blue being the primarly used colors. (As far as I can remember you almost never see the sun in the first Arcs).\\n\\n\r\nWhen it comes to animation and OSTes 5ds was way above the antagonism. In fact when it came out, I quite honestly thought it had the best OST in anime after Bleach (Fairy Tail hadn't come out yet). The animation has a unique dark style to it that really makes the anime enjoyable and you asking for more.\\n\\n\r\nIt doesn't matter if you didn't like yugioh in general, at least the first 8-9 episodes of this one are a must-watch.",
            "date": "2015-02-04T11:22:00+00:00",
            "helpful_count": 60,
            "mal_id": 179666,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=179666"
        },
        {
            "content": "When looking at a series, is it better to start strong but end weak or start weak but end strong? I believe a strong finish is better than a strong start because while it won't hook people immediately, it will allow for people to have something to look forward to while watching. The problem with 5D's is that it follows the latter, being a disappointment after the first season, which ends at the end of the dark signer arc. The unfortunate truth behind this is that the director for the fortune cup arc left to work on Symphogear, leaving behind notes for the dark signerarc. The new director followed these notes, but once the dark signer arc finished, he unfortunately screwed up a lot of things. If I could rate the seasons seperately, I'd give the first season a 9 and the second season a 5. So let's delve into some of the best and worst yugioh has to offer.\\n\\n\r\nThe story for the first season is structured pretty well. There is little to no filler and you can feel the progression. At the start, Yusei just wants to get back the card that symbolizes his bonds, Stardust Dragon, but then he gets stuck in Godwin's plan and becomes a signer. While the plot doesn't stand out, it also doesn't falter, allowing for strong character development. The second season has a convoluted plot where all the problems are solved because of Yusei suddenly becoming overpowered. It just sucks when the solution to every plot related problem winds up being Yusei. Another major issue is how there are 6 signer dragons when the original plot wanted 5. It felt like they wanted to give a character signer status just so he could stay with the main cast instead of a legitimate reason. It all just felt like so much of the original intent spiraled down into a cesspool of absurdity.\\n\\n\r\nThe art and sound are pretty spot on, with the soundtrack containing some of the best vocal pieces in the yugioh franchise with songs like CROSS GAME and Clear Mind. The structural and artistic design of each D-wheel definitely shows each character's personality. The duel disks are designed to look like their respective D-wheels, as the motorcycles are a hybrid of transportation and a dueling machine.\\n\\n\r\nThe biggest divide between the seasons is how the characters are handled. The first season had some of the best character development, delving deep into what makes each character and how they all overcome their mental and physical barriers to become stronger and better people. Overcoming the darkness in your heart is a prevalent theme within the dark signer arc, and it made the development even better. Unfortunately, the second season throws much of the development out the window and streamlines every character's personalities and emotions.  There could have been so much more done with the characters introduced in the second season to make them meaningful and not just a bland sideshow.\\n\\n\r\nI heavily enjoyed the first season, and it became one of my favorite parts of yugioh. It's a engrossing and fulfilling experience that you should experience. The second season, however I didn't enjoy so much. I did manage to watch through it all, and it was about the same as Zexal 1. I recommend only watching the first season while completely ignoring the second season, unless if you want to laugh at the problems it has. Remember kids, you can turn off the monitor whenever you want.",
            "date": "2015-04-06T13:40:00+00:00",
            "helpful_count": 26,
            "mal_id": 184963,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4515784.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/We_EGAO_now",
                "username": "We_EGAO_now"
            },
            "url": "https://myanimelist.net/reviews.php?id=184963"
        },
        {
            "content": "5D's, my favorite show of all time. This show is a beautiful work of art, with some of the most real characters I have ever experienced. However, between Dark Signers and Pre-WRPG there is a huge shift, however I personally adore season 2 for there depiction of the main threat of the series, Yliaster. \r\n-Art-\r\nThe art is beautiful, and the monsters are some of the most beautiful we've gotten yet. The Signer Dragon's complexity could make them hard to look at if your use to the original, but once adjusted they are some of the best designed monsters in the franchise. The Earthbound Immortals couldbe considered simple, and they are simplified black versions of the Nazca Line the represent with a different color line vairty across them, but they somehow manage to still look amazingly badass. The Machine Emperors are just sheer eye candy to anyone a fan of machines in general, and the characters still have gravity-defying hair, making certain characters(ESPICALLY APORIA) a pain to draw.\\n\\n\r\n-Sound-\\n\r\nThe Voice Acting is sheer beautiful, from the sexy voices of Yusei Fudo and Aporia to just the plain awesome voice work that is given to Lucciano. However the music is where it really shines. Almost all OSTs are amazing, including Yusei's theme, Lucciano/Skiel's theme, Light and Dark, Placido's theme and many MANY others. However the openings, endings and inserts are where they just BOMB IT. 5D's and GX are the only shows were I love every single opening and ending, and my god, do they not disappoint. Future Colors, Cross Game, Start, Last Train, Going my Way!!, Believe in Nexus, Freedom, -OZONE-, Close to You and Kizuna are the best songs in the entire franchise by far, and we have the all holy insert song sung by freaking Masaaki Endoh known as Clear Mind.\\n\\n\r\n-Characters-\\n\r\nI will admit I have a crush on Placido to the point where it's kinda scary and sad, but the characters feel so real. Yusei and Jack are by far the best Yugi/Kaiba duo yet, and the entire major rest of the list excluding the characters from Secruity and Satellite are amazing. Rua, Ruka, and Lucciano are by far the best children characters in this franchise along with Arc-V's Sora, and damn does Z-One troll everyone. There's even a character exclusive to the spinoff Bonds Beyond Time who gets mentioned, and well, just watch the freaking show.\\n\\n\r\n-Enjoyment-\\n\r\nI have never enjoyed a show this much. Every episode, even the filler, was good in some way. My personal favorite episodes are 105-110(the Placido VS Yusei mini-arc as I like to call it). But just, watch it.\\n\\n\r\n-Overall-\\n\r\nThis franchise is amazing, and this series is a treat from beyond heaven. If you like anime in general, WATCH YU-GI-OH! 5D'S RIGHT NOW.",
            "date": "2015-07-28T10:58:00+00:00",
            "helpful_count": 22,
            "mal_id": 194551,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4776207.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ShadowSkiel",
                "username": "ShadowSkiel"
            },
            "url": "https://myanimelist.net/reviews.php?id=194551"
        },
        {
            "content": "Well, now is time for another exciting sequel to the ever popular Yu-Gi-Oh! franchise. \r\nStory:\r\nI immediately connected to the plot, a whole new twist on the card game: D-Wheelers. I have to say, they did a better job with 5D's then GX (GX felt like Emo school drama :P). \r\nArt:\r\nThe designs are top-notch, IMO. Especially the fact that it's being aired in HD. Aki's appearance reminds me of another character i love, but other than that, i give the Art a 9/10.\r\nSound:\r\nThe OP/ED themes really give 5D's its edge. It's not too annoying, not to bland, just perfect. The dueling music has also improved fromit's predecessor. Even more darker scenes have better background music.\\n\\n\r\nCharacter:\\n\r\nThe characters are excellent. You have the quiet, hardy type (Yusei), the &quot;i'm better than you&quot; with a (Slight) good side (Jack), the comic-relief characters (Yanagi, Akutsu) and the loyal servants (MIkage, Tetsu) and the mysterious bad guy (Godwin). \\n\\n\r\nEnjoyment/Overall:\\n\r\n5D's is probably one of the few anime's i watch nowadays, not alot of shows interest me (believe me i'm really picky :P) but 5D's is just a wonderful show. Even if you didn't watch the previous Yu-Gi-Oh shows, you'll feel right at home.",
            "date": "2008-11-08T14:27:00+00:00",
            "helpful_count": 15,
            "mal_id": 9339,
            "reviewer": {
                "episodes_seen": 31,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=9339"
        },
        {
            "content": "One of the strongest written series in yugioh franchise history, has flaws, but still strong.With all the hype around the series I can tell it was at it's best even when it got screwd over by midway ending strong regardless of it's writing problems and fake fans.\r\nBefore I start off, I highly advise to not listen to the reviews that complain about something as if they’re expecting lots of 5d's being poor and having no fanbase to support it. Trust me, those are not very helpful if you’re one that actually likes other equally important aspects of a series that focus more on the settings,story, and even development of supporting characters. This is toward Zexal's pathetic and stupid fanbase and hope this messeage goes comes true. 5d's was Ygo's hope even if bad writing hit it hard cause of a movie in making after a major arc coming to an end and beginning of a filer arc i'd say. I hard soo menny good things with this show back then and 10 years later still amazing to watch, in fact this show is 10 years as of 2018 and major hope it get's a movie with a better Director and having more other Ygo characters like: Yuya and Atem or the othter 3.... It's dubbed version was butched around episode 111 to 122 and most of it was skipped cause of a lawsuid filled by NAC and Tv Tokyo is i recall. Also episode 130 was also skipped since it was nothing more than a recap and then came the worst butching of all it. Aporia is actually the final villan/enemy in the dub, while missing most of Z-One's arc and the closer arc in the end makes me sad that this series never will come back. Plus it was the last good dub Ygo on CW4KIDS back in 2011.The English dub stopped after combining episodes 135-137 into one full one-hour special so now that the entire series is up please take a chance and watch the rest! \\n\\n\r\nThe head Director is Ono Katsumi (Arc-V and Senki Zesshou Symphogear look it up on MAL) Plus he is the supervisor in BBT (Bounds Beyond Time 2010). The takes double shifts and hardly giving a care how much pressure Arc-V got him i can say 5d's was better in story, so far... In Arc-V he was busy was with another anime at the time, and Arc-V was stuck in DSOD hell budget. The can do better, if only someone was a sub-director and that's imo.\\n\\n\r\nAt one point the show was in filler hell because of a movie i mention above and made 5d's suffer baddly, but still had an amazing ending. I don't even know when Yoshida took over as a writer and what made people hate this, it aint' neither one's fault. Imo, 5d's was still the best ygo in terms of plot. Hell, I've bean told menny lies about Zexal and Vrains being good and i still think they're on drugs. After 5d's, the show and comminuty whent downhill. I was never a part of the 5d's fandom or ever bother to check. I hardly watched Zexal and never gave it a chance till 2016. I was busy rewatching the first 3 gens. Menny people hated Arc-V and Zexal because they think only adualts matter and not carring about how good the animation has grown in the last 10 years. \\n\\n\r\nWhere Season 1 was an introduction into the world of the Turbo Duel and into the darkness with the Dark Signers, Season 2 delves into a dystopian future and reveals the origin of Paradox and what his mission was really about. All the time maintaining the bonds of friendship and never losing hope. It and BBT have a connection. Also, 5d's has the most darkest behind-the-scenes making with one the Voice Actress being in a cult. That's Carly's voice actress, see Dark Singer arc was more a like cult arc with kids thinking this show is about joining one of those nasty cult in real life, so at point they changed all history in the show about it to make it more futureristic and being time travelers. This is something i look up on reddit, but never cared to believe what they said.\\n\\n\r\nAnimation/Key Visuals: The animation is by Studio Gallop, and it is really good.Other animes conisite of: Rurouni Kenshin: Meiji Kenkaku Romantan, Eyeshield 21, Transformers: Car Robots, Meitantei Holmes. It get's kinda wied during WRGP, because they seemed to enter Zeal's era (no wonder zexal's animation was trash at first). It got less 3d/CGI, but still awesome to watch. The art is beautiful, and the monsters are some of the most beautiful we've gotten yet. They've seemed to make better animation than Gx who previously was the worst series with animation budget.\\n\\n\r\nSound/Music/Opening and Ending: The Voice Acting is sheer beautiful, the music is by Hiramitsu, Takuya (Transformers: Car Robots, Yu-Gi-Oh Gx) , and it’s really good - it’s kind of typical for what you would expect from a Yugioh series, but it’s on the better side. The openings were all catchy and incredibly fun to listen to - they did take a while to get used to, but once I did...I was VERY CLOSE to singing along with them. I did the same thing with Arc-V back in 2014. It's soundtrack is the best outta the first gen.\\n\\n\r\nStory: It's all about post-delves into a dystopian future and reveals the origin an disater years ago made by a company who crated a device in producing ''ENDERDY''. The world building is divide by law and order or chaos and order. The place called Satelight was rune be poor like people making the have all the chaos and misary, while the other order is New Dimineo City (the same city we're Gx and Dm took place), it's actully better paced in the first 14 episode than Vrain's, first 13-15 episodes. The real plot was a form a Drago named Crimison who gave five birthmarks to chosen people in order to fight the evil sent the shadows. First 26 are character indroduction and build-up for 27 to 64 aka the Dark Singer arc. The show is dark,mature and has the best mechanic titled ''Synchro Summon'' even the head director decide to ad a new mechanic named ''Speed Spells'' with dueling on Motercycles. Or, how Yu-Gi-Oh Abridged fans say ''CARD GAMES ON MOTERCYCLES!'' it has alot of memes too. Second half is all about the Yliaster and the dystopian future that takes place near the end of the series. I whoud advice to check out wiki on the filer arcs. See, after Dark Singer came to an end. They made the MC into a total outta character personality and claiming him the Mary sue name or Goat.  The last 25 episode have to of bean the best episode outta any ygo series and you can fell the pain and emotion coming from them. Oh yeah. They had a late suprise way at the end of episode i want you guys to watch for your self ;)\\n\\n\r\nCharacter: All of them are amazing, but I'll mostly cover the 6 main ones with some villain and filer characters. Even tho they changed alot of the writing in Season 2/3 i still enjoy each and everyone of them. \\n\\n\r\nYusei is clearly the most mature and well headded MC in ygo hystory ever. Him being a god? He actually saved lives and still had fun. Never have i seen people complained about someone i adore as an Idol. He says in believing in the cards can make you wanna have hope and never give into despair. Even after his sudden change of character from a later arc made him a much better person than ever. He achived Clear Mind and was able to beat Major enemy's such as Goodwin and Z-One. Him being sexy is all the fan girls even want xD. \\n\\n\r\nJack Atlas: BEST CHARACTER EVER WRITEN. HE WAS MY CHILDHOOD ICON TILL HE RE-APPEARD IN ARC-V SEVERAL YEARS LATER (5 years later) Never have such a badass character at all. He is changed from this cold-heardter person who a likeable caring character. He is bassicly ''Stone Cold'' Steve Austin and Chuck Norris of the show. He got into in love with a reporter who made him see the light of reality and not his old past. He got Burning Souls and pesonality wise make......badass,funny, relatable and 4 dimensional if that's a world even xD He saved the show for me even for the most time ever. My favorite episode about him dueling a load-shark with trying to find the job that's desicent.\\n\\n\r\nAkiza Izinski/Izayoi Aki: Her voice actress in DekaYellow form Dekaranger and also played KyoryuCyan in Kyoryuger. Reapared in Gokaiger and menny more. Prety girl with a personality of a witch and daddy issuies. Her power had problems controling at first and overtime became her own to control. A deck about plants. Overall, she is the best female girl even, despite her change of role in later half.\\n\\n\r\nCrow Hogan: BUY BLACKWING! Origanilly being a final Dark Singer villan, is now an ally to the team, all because his cards did so well and made the change to him by writing. Started of funny and really a well developed character. He cares about the children and protecting them.Something that touch my heart ;-;\\n\\n\r\nLuna/Leo/Luca/Lua/Ruka/Rua: The twins are easlily my favorite due in 5d's from day 1. Both of them have personality and care for each other and not end up being plot motivate fuel in a later arc. Adualt Luca looking kinda hot when fanart happens to go bye.\\n\\n\r\nBruno/Visor: He saved the show during the Yliaster coming from the future. I'd say he is like a brother to Yusei.\\n\\n\r\nThe Villians: All of them make an impact real strong towards every appearances they make. \\n\\n\r\nThe Filer cast ain't all that much, but still cares for Team 5D's in the very last arc. The we're able to evacuate a full city in under 5-9 episodes dueing Yusei vs Bruno\\n\\n\r\nAporia(Jose,Placido,Lucciano or in the dub; Jakob, Primo, Lester): BEST VILLAINS EVER. Aporia is the most tragic one to day, while his 3 forms are with differnt personality's and have thier own motiv into diving a huge temple on the city. While at first he felt despiar, they manage to make him believe in hope join the wining team's side.\\n\\n\r\nZ-One: Easlliy the best final villan in ygo histoy ever > Unlike the first two series, Z-One is more of a wise and sad figure with an apporache having no darkness in his heart. He actually thought humans could of changed from learning of thier own action(s) and at first that was true, but made me sad. He runs a Time Lord Deck with his ace being a best over 4k easliy going to 20k with an effect just like Armatile from Gx Season 3.\\n\\n\r\nAction/Dueling: The dynamics for this show are great and the best paced duels ever. Having most the duel take place on a motercycles in once of a life time chance. The only problem with that is solid-vission system being used to attack bystanders,I've even took some time to check out the duels my self. First turn the player who whent doesn't gain a speed counter in what is the main gimmick with this show's createvity.\\n\\n\r\nOVERALL: WATCH IT RIGHT NOW\\n\r\nI've actually decide to make this one my favorite aloung with Arc-V and making them my favorites. I can easily point out the show's flaws from top to botton and vise versa. The show's motiv is believe in your own team and never losing hope, while going for a better tommorow. Lots of moments with cool excutions were actually kinda exciting, especially when Yusei first invoked Shotting Start Dragon or Majestic Star Dragon and lastly Shotting Quasser Dragon to turn the tides of that battle. Or how he gave the speachies about the enemy being wrong and doing something good/bad will only make it look bad. Even Jack summonng Red Nova Dragon in his final fight with Yusei made this show for me all the love and respect. ^_^\\n\r\nFinal Score for it is.....SOLID 10/10 and even if had sad bad moments, i still love it after it's final moment.\\n\\n\r\nRIDING DUEL ACCELARATION!!!\\n\r\nLET'S TURBO DUEL!!!\\n\\n\r\nBtw, Happy 10 Year Birthday 5d's!!! <3 <3 <3 <3 <3\\n\\n\\n",
            "date": "2018-02-24T13:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 272357,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5435146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Helios92",
                "username": "Helios92"
            },
            "url": "https://myanimelist.net/reviews.php?id=272357"
        },
        {
            "content": "Well, what is there to say about an Anime about trading cards....hmmmm. Nothing, that's really it. It's a bunch of prepubescent kids, battling out with cards. We all know that this series is a sequel to the Original Series, we've seen some different reviews of people who hated it or those who simply love it. It's now my turn to throw down....a face down.\r\nThe story of the series is supposed to take place in a distant future of Yugi's home town, Domino City. There have been some freaky things going on that made Domino split into two parts; an Island called Satellite, and the mainland Neo Domino City. Those who live on Satellite are dirt poor and mostly criminals and ex cons live there. This  makes them processable to Neo Domino City. In summary there is Rich land and there is Poor land, a YuGiOh spin off of Robin Hood. Our cast of heroes come from different parts of Satellite and Neo Domino City, but though they have different aspirations they're destiny is fated to ban together and fight an evil force that has been hidden for a millennium that desires to concur the world....Well this sounds a lot like X 1999, and how I hated that movies so much. \\n\\n\r\nStory wise, it was made for kids. What do you really expect? Though watching the Japanese version is always better then the 4Kids TV version, I wasn't expecting anything exciting besides a few cliff hangers (with an obvious result). The characters in the series (Yusei, Jack, Aki, Rua, and Ruka) don't have many desirable development. They have the same tracked mind and always fight till the very end *Yawn*. Also the story is very screwy too; dueling on Motorcycles. Some one at Konami was really desperate to think of a new marketing idea. Riding 40-50 mph on a motorcycle down a stretch of high way while dueling is not my idea of super thrilling action; just plain stupid. Though this is such an idiotic course of action, they had to find one way to make the series keep existing. Another thing I'd like to point is they the changed the theme from Egyptian Mythology, to Aztec and Inca Mythology. Wasn't YuGiOh supposed to be about Egypt? I guess Kazuki Takahashi was impressed when he went on a trip to Peru or Mexico so he had to make a story based on that.\\n\\n\r\nIn the end I've watched a total of 50 episodes of this series, that a lot compared to the people who've given up on the series but watch it time to time. Probably reached the quarter make of it (my guess 160 episodes). At first I hated it but I had to give the series a chance since I like the Original YuGiOh series to begin with (Not the Duel Monsters one). The theme songs are pretty catchy and you find yourself looking for them online to put into your MP3. If you're a big player of YuGiOh TCG like I am, you might want to watch an episode or two but not dedicate to it. For those who like the series, you're probably a Narutard or some hopeless DBZ fan dope who can't differentiate between good Anime or something you saw in your monthly Newtype or Shonen Jump magazine. In the end of this I don't hate the series, but it's not a good series. You're probably better just playing the game and pretend this series doesn't exists.\\n\\n\r\nYours truly\\n\r\nOtakufreak\\n\\n\r\nPS. I activate a Trap Card, take evasive action!!",
            "date": "2009-03-19T18:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 13311,
            "reviewer": {
                "episodes_seen": 50,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1722.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/OtakuFreak",
                "username": "OtakuFreak"
            },
            "url": "https://myanimelist.net/reviews.php?id=13311"
        },
        {
            "content": "CHILDREN’S CARD GAMES ON MOTORCYCLES!!!!\r\nOk, now that everyone has gotten that out of their system we can enter the world of high speed action that is Yugioh 5d’s\r\nThe third series of the Yugioh Franchise is marked by breaking away from many of the tropes that had plagued the other two, in particular the previous series Yugioh Gx. Rather than being built upon a tournament or school structure system, 5d’s manages to create its own almost post futuristic world.  The setting of this world is the best developed in all of Yugioh history. \r\nOur cast for this series is slightly different from the usual Yugiohcast. Yusei is not our average Yugioh protagonist. Not only is he older, but his maturity is shown to us time and time again. This is a shounen protagonist who is smart, cool and collected. He forges his own destiny, building his own motorcycle out of the scraps available to him. Jack Atlas takes the rival slot for the series. He starts off as the basic Kaiba clone for the series, arrogant and prideful. In a wise move they manage to develop him in such a way that makes him one of the more beloved characters of the series. Akiza becomes one of the most developed female characters in Yugioh history. Not only does she have a tragic past but she also is a strong duelist capable of putting Yusei and the like in their place. The uneasy bonds that these three share make up the core of Yugioh 5d’s.  \\n\\n\r\nThe plot still follows the regular card game format. Expect a couple tournament arcs with one time characters. Expect highly situational random dues ex machina card draws at the last minute that will never see print. Expect people to not stay dead for long. This is what the Yugioh franchise is about, and for what it’s worth, 5d’s manages to pull it off for the most part. Villains have personal connections to their opponents to make them more than just fights to save the world but also character battles. The Synchro mechanic introduced in 5d’s proves to be interesting and fun (Synchro Chants are addictive)  but in general the card designs in 5d’s are some of the best in all Yugioh history which make for some very entertaining duels. There is also a lot less random opponent of the week, and more plot oriented episodes. There are some really genuinely shocking moments in this series. \\n\\n\r\nIf this was all there was to 5d’s (up to episode 64) I probably would be able to give it an 8/10. A good reinvention of the Yugioh franchise. Unfortunately Yugioh 5d’s continued past the first season for almost 100 episodes. They start the second season with near 20 episodes of filler. Once they start engaging the actual plot of the second season, you realize that maybe the filler was the more humanitarian option. Character assassination doesn’t begin to describe what occurs in Season 2 of Yugioh 5d’s. The number of editorial changes and plot holes quickly begins to pile up, leaving no doubt that the writers are making this up as they go along. Towards the end of Season 2 they manage to recover a bit with some rather epic duels, but the damage has already been done.\\n\\n\r\nThe animation is what you would expect of an ongoing series with more than 150 episodes under its belt. There are some episodes that kick it out of the park with stellar animation. There are some few rather rare moments where the animation completely backfires and a dramatic moment is defused. It should be noted that I am not a fan of the 3D animation used in anime, especially inserted in regular animation. It interrupts the flow of the series at best. At worst it looks totally silly. Luckily 5d’s manages to keep the 3D animation to a minimum, not over using it. It is easy to overlook these few random moments.\\n\\n\r\nThe soundtrack of the series is one of the most enjoyable elements of Yugioh 5d’s.  A lot of the character theme’s are so intense and gripping that they can make even the most simple of duels seem like the world cup. Every moment is dripping with drama because of the awesome soundtrack. This is one part of the series that never takes a dip. Later in the series they add insert songs by Masaaki Endoh who also does a couple of opening themes, all of which are filled with so much energy and charge. \\n\\n\r\nIn total, Yugioh 5d’s can be inconsistent. It started off strong, and when it wants to be good the series can been very enjoyable, but when it is weak it can be disastrous and the last half of the series is filled with weak plot elements. If you are a Yugioh fan than this is something you must watch, but for everyone else there is better series to watch.\\n\\n\r\nRiding Duel Acceleration!!!",
            "date": "2011-03-30T19:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 35503,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257270.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lilyvess",
                "username": "Lilyvess"
            },
            "url": "https://myanimelist.net/reviews.php?id=35503"
        },
        {
            "content": "The first time I heard about the issuance of a new series of Yu-Gi-Oh! i was Happy even though I did not like Yu-Gi-Oh! GX and I did not watch it\r\nbut I was happy because I generally like the series Yu-Gi-Oh!\r\nAnd when I saw the Yu-Gi-Oh!5D' I found it very interesting\r\nmaybe one of the reasons is that I love the series Yu-Gi-Oh!\r\nbut the idea here is new and there are different way duels, on the motorcycle or without it.\r\nStory\r\nVery wonderful and mysterious in the beginning, I liked the distinction that made between Satellite and the city's peopleand how Yusei managed to emerge from the Satellite's group and took the title of the king.\\n\\n\r\nI liked also The idea of selectors and the Scarlet Dragon.\\n\\n\r\nAs usual there are Attention in friendship and confidence with playing cards and their impact on the duels.\\n\\n\\n\r\nCharacter\\n\\n\r\nYusei is very cool, Quiet, strong and gentle with everyone\\n\r\nOf coures he always think about his friends.\\n\\n\r\nBut he is different from the rest of the series characters of Yu-Gi-Oh in the age and his look.\\n\\n\\n\r\nArt\\n\\n\r\nDevelopment from the past, but there is still some negative aspects\\n\r\nSuch as the high intensity in the formulation of hair and clothing\\n\r\nI do not like it in some of the characters.\\n\r\n[the clothes dosen't move at all ^^\" ]\\n\\n\\n\r\nIn general I advise Anime lovers, especially lovers of the series Yu-Gi-Oh to watch it, they will find it very cool and will enjoy it ^_^.\\n\\n",
            "date": "2010-03-21T13:34:00+00:00",
            "helpful_count": 11,
            "mal_id": 24168,
            "reviewer": {
                "episodes_seen": 53,
                "image_url": "https://cdn.myanimelist.net/images/userimages/86993.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Ran_chan",
                "username": "Ran_chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=24168"
        },
        {
            "content": "It's my first review 55+ It's a bit strange and not good english but I'll try the best.(I repair my score because It's awesome enough for 10 now ^_^)\r\nStory\r\nIt's the best point of this show.You didn't hear wrong. It's true.\r\nWithin 20 episodes I think the plot is awesome. Many secret of dragon marker and signer concern with the past and development of main character.\r\nThat's enough for me. But This show make me surpised ! \r\nIt's built many great event include with plot-driving every episode. Most of event I didn't expect. It's make this show exiciting more and more!\r\nArt\r\nthe Animation is okay for me.But I thinkAnimators can make better animation quality for this show...Some of episode if it's have better animation It's more enjoyable.But Sometimes I think to riding duel....It's make animator working hard.It want high quality animation(and i LIKE it)...since I have think to this. I understand everything...And says so..so..try the best animator-san!\\n\r\nand CG WOW! it's so coooool.\\n\\n\r\nSound\\n\r\nthey fit with this show.OP/ED is great. OST of this show is make me concern. It's pop-rocks tecno like theme of this show.\\n\\n\r\nCharacters\\n\r\nThe Characters in this show, I like The most is Yusei.He is smart,cool and smexy!(haha) but Aki, Ruka, Rua and Jack make me enjoyable too.Everyone have the past, character developmentand and nice habit.It's interesting and likable to watch. and.. \\n\r\nSupport character is useful!(Make me suprised again.) they have some development to driving a plot.and they have the past too(Wow...) \\n\\n\r\nEnjoyment\\n\r\nSure! It's very enjoyment for me! both of them(Duel and plot) are awesome.The main(Yusei) encounter with many trouble.It's exciting to see him find a way to against those trouble. and Hey! villians are work very well for me.they look smart.Oh Don't forget riding duel. It's entertaining for me than normal duel soooo much.\\n\\n\r\nOverall\\n\r\nIt's not like another series of Yu-gi-oh not like suck GX and original Yu-gi-oh. It HAVE plot and excitng story.Sometimes they have talk but hey! That talk for plot(Ep 14) It's new and follow me to watch this series to end.\\n\r\nI didn't want to see this make filler more and more like GX(I give up at five episodes) I wish director of this series don't betray me. \\n\\n\r\nYou should try this series at least five episodes!(Like I do with GX) but in times you won't find suck series ! You will find awesome series! Yu-gi-oh 5D's!\\n\\n",
            "date": "2008-08-16T08:25:00+00:00",
            "helpful_count": 11,
            "mal_id": 7180,
            "reviewer": {
                "episodes_seen": 20,
                "image_url": "https://cdn.myanimelist.net/images/userimages/86294.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/inkphoenix",
                "username": "inkphoenix"
            },
            "url": "https://myanimelist.net/reviews.php?id=7180"
        },
        {
            "content": "This anime is seriously one of the best I've ever watched. I love it to pieces. And by this, I am referring to the Japanese version, because the dub is just plain terrible. -_- It's a lot more mature than it's predecessors, DM and DMGX, so it's characters are older. The main character, Yusei Fudo, is an 18-year-old who lives in the slums of the Satellite, a poor city which only exists to serve the rich, upperclass residents of Neo Domino City. Much darker, no?  I love this anime because the story, the art, the characters-they're all outstanding. Wow, that doesn't really say anything.Here's what I mean:\\n\\n\r\nStory (10): The story for 5D's is simple, but complicated at the same time. In the beginning, it's pretty simple: the MC is going after his old friend who betrayed him and wants revenge. Though the story turns much more tangled and sophisticated. There is the dueling aspect of it too, where if you didn't see either of the first two series, you'd be totally confused. So if you haven't, it'd be a good idea to watch a few episodes or to look up the rules.\\n\\n\r\nArt (9): The art in this anime is, for the most part, amazing. Why do I say for the most part? For some odd reason, some of the art in some episodes are top-notch, and some of the episode's art are terrible. For example, episode 40 had pretty terrible graphics, but 41's art was astounding. Don't let that drive you away though-the art changes get better as the series goes on.\\n\\n\r\nSound (10): The musical score is just amazing. The perfect music for the perfect times. The sound effects are great. The openings and ending songs are really cool too.\\n\\n\r\nCharacter (10): The characters are all very likeable and admirable. They have backstories you can really empathize with. You even end up loving the villains, too! \\n\\n\r\nEnjoyment (10): I enjoyed 5D's very much. It has a lot of twists and turns. The only reason I don't recommend this to everyone is just because of the dueling aspect, and how odd it might be for people to just play card games randomly. If you do get over this fact, though, you can really lose yourself to 5D's.\\n\\n\r\nOverall (10): I think this was the best series in the Yu-Gi-Oh! franchise. Everything about 5D's is astounding. A must-watch for all Yu-Gi-Oh! DM and DMGX lovers-and everyone else!\\n\\n",
            "date": "2011-01-28T13:20:00+00:00",
            "helpful_count": 10,
            "mal_id": 34095,
            "reviewer": {
                "episodes_seen": 145,
                "image_url": "https://cdn.myanimelist.net/images/userimages/433115.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BloodyRoseWitch",
                "username": "BloodyRoseWitch"
            },
            "url": "https://myanimelist.net/reviews.php?id=34095"
        },
        {
            "content": "This is my personal favorite entry into the yugioh franchise of the 3 that I have watched (Duel Monsters, GX, and 5Ds). This brings us a fairly different take on some duels in the form of riding duels while still keeping the heart of the yugioh franchise alive.\r\nStory (8/10):\r\nAs with any yugioh series, the story follows a series of adventures our heroes must take on against antagonists to save the world. How do they do it? In a series of card games, of course. However, I feel like the in-depth plot development of these arcs were very well-done. The audience was given a chance tounderstand the viewpoints of both the antagonists and our protagonists. The overall theme of the show is something along the lines of 'the importance of bonds between friends'. The show demonstrated this theme several times through the character's actions as well as through monologues and speeches made.\\n\\n\r\nThis show introduces the concept of dueling while riding a D Wheeler, basically a motorcycle. At first this idea seems silly, but the atmosphere of riding duels was very exciting. The characters and monsters were constantly in motion so there was a lot more going on than just finger pointing and monsters just chilling in front of our duelists.\\n\\n\r\nWe are also introduced to a new summoning technique, synchro summoning, to bring out new synchro monsters. This is what is used to bring out most of the new powerful monster, but it did not feel overpowered and was not the absolute single summoning technique in the show either. It brought a new update to the game that only served to make the duels more interesting to watch.\\n\\n\r\nArt (7/10):\\n\r\nThe character designs were on-point with yugioh's crazy hairstyles while managing to keep the overall deign of characters balanced. The background design of the different settings were distinct and unique. My main issue is that the quality of animation was somewhat inconsistent. Some episodes, we had breathtaking animation with fluid motion with excellent layout designs. Other episodes, the characters would look out of proportion even during closeups. The 3D models used worked very well for the most part even though it was fairly obvious that the characters/monsters were not drawn. There were a few times where the 3D just didn't work very well.\\n\\n\r\nSound (10/10):\\n\r\n5Ds knew exactly where it was going with its sound. The openings were all fantastic in terms of both music and animation while keeping with the overall theme of 'bonds'. The battle music helped several duels go from exciting to on-the-edge-of-my-seat exciting.\\n\\n\r\nCharacters (8/10):\\n\r\nYusei is our first and only yugioh protagonist to start out at the age of 18. Not only that, he has had to deal with issues such as poverty and being an orphan as a child which made him grow up to be a strong adult. The rest of the cast each get the spotlight for their character development when necessary and are fleshed out very well. There were a few characters who had a lot of potential for better development and a larger role in the story that were slowly left out of the plot.\\n\\n\r\nEnjoyment (10/10):\\n\r\nI laughed, I cried, and there were whole scenes that I re-watched at least 5 times because of how amazing they were. It was great seeing an older cast and the slight darker tomes the show had. \\n\\n\r\nI would recommend this to anyone trying to get into the yugioh franchise and even if they weren't. You do not need to have watched any of the other yugioh shows to jump into this one, but be warned that the show does not hand-hold the audience through the rules of duel monsters that other yugioh shows might do.",
            "date": "2015-05-29T12:09:00+00:00",
            "helpful_count": 10,
            "mal_id": 189104,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431857.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/funland",
                "username": "funland"
            },
            "url": "https://myanimelist.net/reviews.php?id=189104"
        },
        {
            "content": "Yu-Gi-Oh! 5DS is the most favorable Yu-Gi-Oh! series and one of the most wonderful anime from all aspects. The design and development of the protagonist Yusei Fudo, the formation of the 5DS team through the bonds with the nakama, the epic storyline and antagonists in every arc, the amazing Stardust Dragon which is the signature monster of 5DS together with its upgrade Shooting Star Dragon, the breathtaking ending and the overall aspects of the setting are so perfectly combined and laid out that give a wonderful feeling. This series have marked themselves in history and almost definately achieved the peak of Yu-Gi-Oh! and brought thebest out of the franchise.",
            "date": "2018-09-12T06:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 288832,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4819140.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Elfezen",
                "username": "Elfezen"
            },
            "url": "https://myanimelist.net/reviews.php?id=288832"
        },
        {
            "content": "Around the time GX was ending, Konami introduced a new set of Monsters into the game: Synchro Monsters, which I presume were made so that kids would get better in math (Okay, I’m kidding, but I just had to make that joke). As a result, a new series was a no brainer.\r\nWhat Konami probably didn’t expect, however, is that said series, Yu-Gi-Oh! 5D’s (5D’s standing for 5 Dragons), would be the single darkest Yu-Gi-Oh! Anime to date. However, does being dark equal being good? Let’s find out:\r\n1st Arc: Fortune Cup Arc (Episodes 1-26):\r\nMuch like GX, the show establishes its tone right off the bat. UnlikeGX however, it’s the plot that comes first, not the characters. I don’t mind this myself so long as the plot is good, and in 5D’s case, that’s mostly the case.\\n\\n\r\nLike said before, this show is pretty dark, the first two and the last arc in particular. The whole mood is sorta depressing all around, with Yusei suffering all kinds of abuse in the first 10 or so episodes. This is all helped by a very much cyberpunk-inspired esthetic, and this show very clearly has a style of its own. I love it.\\n\\n\r\nThat said, even though the first arc is tournament arc, I just love the way the cast gets dragged into it. Yusei’s all like “I have no interest in this fucking tournament” and then his friends are taken hostages. As far as the actual tournament goes, it’s great, and it helps that it works as a way to develop/introduce characters.\\n\\n\r\nSpeaking of characters, we have a lot to go through.\\n\\n\r\nFirst is Fudo Yusei, and he’s… perfectly fine. Yeah, I’m nowhere near as enamored with his character as the rest of the fanbase seems to be, but I do like him. He’s definitely different from all other protagonists before him. He’s basically Judai in the final arc of GX, only with the stoicness taken up to eleven. Oh, and he also has a guilt complex the size of Russia. As I said, I do like him, but he doesn’t get enough development for me to care that much for him.\\n\\n\r\nThe rest is better. Jack Atlas is probably one of my favorite rivals in the franchise. He’s prideful and arrogant, yet he does eventually soften up, with his redemption arc being extremely well done. Izayoi Aki is also probably my favorite female lead in the franchise. At first, she’s unstable and kinda insane, but then she becomes a total cinnamon roll. Also there’s the fact that she’s played by my sorta childhood crush (DAMN YOU DEKARANGER!!).\\n\\n\r\nFinally are the twins Lua and Luca… or maybe it’s Rua and Ruka… I have no idea. Anyhow, they’re perfectly fine, but I don’t care that much about them.\\n\\n\r\nFinally are the villains. Rex Godwin is a complete magnificent bastard, and a total genius to say the least. It’s amazing how, by the end of the arc, he has everyone right where he wants them to be. There’s also Yeager, who doesn’t get much to do in these first two arcs, but does get a surprising amount of focus in the last three arcs. Same goes for Ushio. Yes, they actually brought back the bully from the first chapter of the Manga and made him a recurring character. Which just never fails to crack me up.\\n\\n\r\nThe rest are D-List characters, but I will mention that this show has the single greatest combat commentator EVER. That guy is badass.\\n\\n\r\n2nd Arc: Dark Signers Arc (Episodes 27-64):\\n\\n\r\nThis is definitely the best arc of the show. To start off with, it very cleverly builds on what was established in the last arc, with everyone getting a decent bit of development… or at least, as much development as they could get considering all the behind the scenes baggage this show had. Joy.\\n\\n\r\nAs far as said development goes, Aki and Jack get the most. Aki is forced to ultimately confront her past and all of the atrocities she’s done, however she’s so emotionally and mentally unstable that she just ends up being easily manipulated by the antagonists. As for Jack, he’s also forced to humble himself, coming to terms with all of the crap he pulled before the show started, and his relationship with Carly is really well done, and you can bet I was pissed when they didn’t follow up on it in the following arcs.\\n\r\nAs far as new characters go, let’s talk about the one everyone wants me to talk about: Crow Hogan. I… really don’t care about him. He’s somewhat generic, a bit of a creator’s pet (Which is especially notable in Arc-V) but overall, I don’t hate him or anything. At least his Deck is cool. Also, no, it wasn’t Konami’s fault that he didn’t become the last Dark Signer, if that was the case, then Kiryu should’ve become a part of the main cast due to how many people used Infernities. \\n\\n\r\nAs far as the titular Dark Signers, I like them… well, with the exception of Demak, he sucks. All of them are a new spin on the whole idea of people being turned evil by some sort of influence from the Doma arc, and turn it up to eleven. My favorite was Kiryu Kyosuke, who had the good luck of getting some extra development after the end of this arc.\\n\\n\r\nOverall, a pretty damn good arc if I may say so myself. Dare I say, it’s probably one of my favorites in all of Yu-Gi-Oh! right behind the Dimension World arc of GX and the Barian Emperor Onslaught Arc from ZeXal.\\n\\n\r\n3rd Arc: Pre-World Riding Duel Grand Prix Arc (Episodes 65-98)\\n\\n\r\nWhich is then immediately followed by the worst arc in the show. Because of course it would.\\n\\n\r\nTo be fair, there was a lot of behind the scenes baggage around this time, but even so, this arc is just boring. It tries to be similar to the Seven Stars Arc of GX. However, while that Arc’s structure worked well in GX due to its character driven nature, the more plot driven 5D’s does not work as well with that structure. As a result, most of the stuff here is nothing but set-up for the next arc.\\n\\n\r\nMind you, not everything is bad. I do like the small mini-arc set in Crash Town, which finishes off Kiryu’s character arc. Not only is the show stylized in a completely different fashion from the rest of the show (Going more for an Old West look) but it also has legitimate stakes and some impressive use of music all around. It’s definitely the highlight of this arc.\\n\\n\r\nAs far as characters introduced, I’ll save the villains for a bit later. As for the heroes, two new characters are added to the cast. The first is Bruno. I actually like this guy, he’s rather meek and adorkable, and his bromance with Yusei is just glorious. Then there’s Sherry LeBlanc. I like her fine enough, but really she’s just a worse Mai.\\n\\n\r\nOverall, not the worst arc ever, just so generic that it blends in with the rest.\\n\\n\r\n4th Arc: World Riding Duel Grand Prix Arc (Episodes 98-129):\\n\\n\r\nThis is just as middle of the road as Tournament Arcs get. I mean, it’s fine, but nothing about it sticks out whatsoever. We do get a few new moments here and there, and Yusei and Jack’s new Aces (Scar Red Nova Dragon and Shooting Star Dragon) are just plain badass, and so is the way that they’re obtained, but nothing else sticks out about this arc.\\n\\n\r\nI mean, let’s just look at the Teams our heroes fight. The first is Team Unicorn, a team that’s supposed to have excellent teamwork… yet their strategies have nothing in common and the way they’re defeated reeks of Deus Ex Machina. Then there’s Team Catastrophe, who are so pathetic they only last about 2 episodes. Then there’s Team Taiyou, the only one of the bunch I would consider good, as they’re all a bunch of Adorkable guys and I’m just a fan of underdogs in general. Finally is Team Ragnarok, who’s not the worst, but they’re just kinda generic.\\n\\n\r\nHell, I’d say the best part about this Arc was when Jack and Yusei suddenly left Japan so that Jack could make a demon his bitch. Now THAT was awesome.\\n\\n\r\nLet’s finally talk about the villains, the three Emperors of Iliaster. They’re fine, I guess, but honestly they’re not the most threatening bunch. Overall, while this Arc isn’t bad, I wouldn’t dare call it good either.\\n\\n\r\nFinal Arc: Ark Cradle Arc (Episodes 130-154):\\n\\n\r\nThankfully, the show does get back on track in its final stretch. For starters, it actually felt as if there were stakes this time around. I don’t just mean that in the whole “Oh no! The world’s gonna be destroyed” way, but also in the way that the characters actually have a reason to be personally involved in all of this.\\n\\n\r\nAlso, while I don’t care much about the three Emperors individually, I do love Arporia. Putting aside the fact that half his damn dialogue sounds as if it came out of Danganronpa, the guy is imposing and has a very relatable backstory. Much of the same can be said about his two allies, Antinomy and Z-ONE, who’s quite possibly the best main villain in the whole franchise.\\n\\n\r\nFinally, the arc does legitimately feel like the climax to an epic story, with everyone getting their own little moment to shine. And of course, despite how ridiculously long it is, the Yusei vs. Z-ONE Duel is amazing, definitely the best defeat of a big bad in the whole franchise.\\n\\n\r\nIn general, this was a pretty good end to the show, and while it doesn’t entirely redeem all of the post-Dark Signer stuff, it does make it somewhat more bearable.\\n\\n\r\nAnimation:\\n\\n\r\nYou know how GX’s animation as average but at least it was consistent? Well, this show is the exact opposite. At times, the show looks borderline amazing, but other times, it looks like absolute crap. I should also note that this is the show that marked the point in which some Monsters would be CGI, and thankfully it’s only reserved for the more simplistic designs, with most of the more complex ones being traditionally animated.\\n\\n\r\nSound:\\n\\n\r\nThe soundtrack is fantastic. As always, traditional instruments are used often, however in contrast to GX’s use of the electric guitar, this show seems to be more fond of techno beats. That is, outside of the Openings, all of whom are straight up rock. As for said Openings, I didn’t really care for “Kizuna” or “FREEDOM”, but I really liked “BELIEVE IN NEXUS” and absolutely adored both “LAST TRAIN” and “Going My Way”. Also, the first Insert song in the franchise: “Clear Mind”, which is AWESOME! Same goes for the endings, with my favorite being the fourth one “Close To You”.\\n\\n\r\nVoice Acting:\\n\\n\r\nOnce again, the cast is somewhat Amateurish. Thankfully, there isn’t any performance that was particularly bad this time around. I already mentioned Kinoshita Ayumi as Aki, and she did a fantastic job, even if she did sometimes sound like discount Koshimizu Ami (In fact, is it just me or does Aki kinda look like Kallen from Code Geass?). Same goes for Miyashita Yuya as Yusei, who, like Kazama Shunsuke before him, is not even a Seiyuu but rather a singer, yet he had one of the best performances in the show.\\n\\n\r\nThe rest of the Cast is pretty good too. Just mantioning some of the more recognizable Seiyuus, we have Ono Yuki, Terasaki Yuka, Hoshino Takanori, Minagawa Junko, Okomura Akemi and (Most surprisingly for me) Ishikawa Hideo.\\n\\n\r\nOverall:\\n\\n\r\nSo no, 5D’s isn’t the best Yu-Gi-Oh! series. That said, I wouldn’t mind considering it either the second or third best. The middle is what brings it down, as the show does start and end on a high note. Overall, it’s a fun show brought down by a few too many issues.\\n\\n\r\nFinal Score: 8/10",
            "date": "2018-12-20T06:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 296247,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7355925.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SupremeLord",
                "username": "SupremeLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=296247"
        },
        {
            "content": "I wouldn't recommend this to any people that aren't familiar with Yu Gi Oh because they would struggle to follow the duels that make up far more than who wins. Lots of character development is tied into the dueling and play styles reflect characters.\r\nFor people that can follow the dueling, the start of all these Yu Gi Oh animies tend to start slowly with bad duels but they duels themselves get much better later in.\r\nThe character development is superb and arcs well throughout.\r\nMy main complaint would be the dubbing US company cut out around 20 episodes at the end and literally changed the ending. Thedubbed ending is basically just bad and cuts out crucial development and story features, so even if you prefer watching dubs, switch over to subs over Season 4 because the dub cuts out there.",
            "date": "2014-10-25T06:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 166097,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4203427.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Skeletonxf",
                "username": "Skeletonxf"
            },
            "url": "https://myanimelist.net/reviews.php?id=166097"
        },
        {
            "content": "Yu-Gi-Oh 5D's, while certainly not without its flaws, is the third addition to the Yu-Gi-Oh anime franchise (not counting the one by Toei) and is quite possibly the most intriguing of the bunch. As you should know by now, in this series the card games are played on motorcycles, or \"D-Wheels\" (Duel Runners if you're watching the dub, but really, the dub is so bad it's laughable, so the Japanese version is recommended in this case).   I'm sure everyone had the initial \"Card Games on Motorcycles?!?!\" reaction upon coming across this show, myself included.  But really once you think about it, GXhad an school that teaches kids how to play card games for a living, so motorcycles can't be that much more ridiculous. \\n\\n\r\nStory (7/10): The story is more outlandish and interesting than its predecessors, being set in the future (though exactly how much in the future compared to GX and DM is never said), and it is also a bit darker since it's set in a dystopian society. Synchro monsters are heavily used by characters here much like how fusions were used a lot in GX. The \"Card Games on  Motorcycles\" concept is executed quite well; it has its own system of dueling with \"Speed World\", and regular ground duels still occur often. On the other hand, it is a bit annoying that an explanation is never given for how card games on motorcycles originated or why the characters even bother with the trouble. \\n\r\nThe overarching plot is based in Incan culture which was nice, but there's not really anything that's particularly deep or though-provoking in the plot, and card games and friendship (KIZUNA!!!!) are still used to save the world, though more believably than the other two series. The main characters are the Signers who are chosen by the Crimson Dragon, a Yu-Gi-Oh god, to save the world from the Dark Signers. There are a fair share of twists and turns and a good amount of foreshadowing (though sometimes it's not that subtle), but there are also a few deus ex machinas, so be warned. There are a few places where the story slows down a bit for duels, but overall the plot moves along quite nicely. The first arc was probably the most consistently good, but the second arc really made you like the characters despite some speed bumps near the end.\\n\\n\r\nArt (7/10): The art is quite a mish mash, ranging from really good (though still not with a lot of moving) to mediocre, and it's obvious that the animation team changes with each episode. The CGI for certain monsters can be really bad as well, but it thankfully doesn't use it that often. Overall, the art is okay and usually doesn't detract from the viewing experience.\\n\\n\r\nSound (8/10): This series is known among fans for having a great soundtrack that really helps support the mood of the scene. It probably won't make anyone's Top Anime Soundtracks of All Time, but the music is still consistently good. \\n\\n\r\nCharacters (8/10): This show is better at not making the focus on only one character and having them duel all the time than the previous two (I'm looking at you, GX). It also has some of the best character development the franchise has to offer. Since there aren't too many main characters, I'll just go through them one by one. \\n\\n\r\nYusei Fudo- Yusei, the main character, is a serious and cool Signer instead of a standard shonen idiot hero. He is also unfairly looked down upon by society due to his background.  Both of these things are a fresh breath of air from Judai from GX, and it was really cool to seem him win duels in clever ways and make people change the way they view him. He's a static character, but he also is quite round in his personality; though initially he's just a kind stoic who really cares about his friends but otherwise doesn't let much bother him, later he's shown to have insecurities and is quite distraught whenever someone he cares dies. But like I said previously, he's a static character so he doesn't go through much character development at all (this is not necessarily a bad thing). Overall, he's probably one of the most likable characters in the series, and I'm glad they didn't decide to make him invincible, win every duel through cards that he never had before and will never use again, and steal all the screen time. *coughs* \\n\\n\r\nJack Atlus: Jack is the rival of this series, coming from the same background as Yusei, and is the main antagonist of the first arc despite also being a Signer. I know that a lot of people think he's a cheap rip-off of Kaiba, and he really seems like that at first, being a jerk who betrayed his friends so that he could become the King of Riding Duels. Later, however, I think Jack's really more like Silver from the Pokemon games, and by that, I mean WAY BETTER THAN KAIBA. Jack is a dynamic round character so he goes through a lot a character development (probably the best next to Ushio's, who isn't really a main character and thus I won't spend much time talking about him) and later you find out that he's really not as much of a jerk as Kaiba (and is over 9000 times better than said CEO), and is also insecure and most of all HUMAN. I could gush on and on about how awesome it was to see Jack change from a knock-off of Kaiba (who is just a plain jerk whose only redeeming factor is his relationship with Mokuba) to a man who is trying to improve himself. He also has ATLAS PUNCH which is just plain awesome. Definitely my personal favorite character, and he's pretty well-received by others as well. It's just a good thing that they didn't make him a total noob at card games later and be mostly for comic relief than an actual rival. \\n\r\n*coughs loudly*\\n\\n\r\nAki Izayoi-  Aki is a Signer who happens to have psychic powers that make any card she plays come to life. Although this may seem cool at first, this also means that any damage she inflicts is actually painful and destructive, which leads her to be prejudiced against by society.  Aki is probably best described as misunderstood. She is initially a violent, destructive, but skilled duelist who everyone hates (I think this is the Aki that most people like), but it is later revealed that the unstableness of her personality stems mostly from her parents. While the way this is presented mostly makes Aki come off as a brat who takes things too seriously, it also shows that she is not genuinely a bad person, but just has somewhat understandable issues. I think Aki's character development from a violent witch to a stable, well-meaning individual made people think her character got derailed, but I don't think that \"violent witch\" was really part of her personality in the first place; it was just a mask. But no matter how you look at it, Aki was a good character with a design that many men I know are happy with. I'm just glad they didn't make her a bench warmer whose is totally dependent on Yusei for everything. \\n\r\n*nearly chokes on the mucus in her throat*\\n\\n\r\nRuka and Rua- Ruka and Rua are \"identical\" twins, so they look alike despite the fact that one of them is a girl and the other is a boy. They are younger than the rest of the cast, being around 11 while everyone else is in their late teens. Ruka is the younger yet more mature Signer twin, and is also a dueling prodigy who can talk to duel spirits like Judai and Manjoume from GX. Rua is the immature older twin who is not a Signer and probably fits the idiot hero bill better than anyone else. He's reckless, and he cries if he loses a duel. But he truly cares about his sister and wants to protect her, and his character is developed quite a bit. Ruka, while nice and insightful, is a bit of a disappointment. She actually gets to duel less than Rua despite the fact that she's a Signer and Rua's not. She's not weak in a dueling sense, but she gets to duel so rarely that it's hard to tell that she's really a prodigy.\\n\\n\r\nCrow Hogan- Crow is a guy who comes from the same background as Yusei and Jack and yet is introduced 30 whole episodes after they were introduced. He's probably the worst character of the main cast because of this. While his personality of being essentially a loud-mouthed Robin Hood figure for children is okay (though still not very interesting), him suddenly getting introduced in the second arc and being old buddies with Jack and Yusei, despite never being mentioned or even foreshadowed  makes him creep into Gary Stu territory. He also has a deck that is very good in real life and thus, Crow almost never loses a duel.  I personally don't hate Crow as much as many others do, but it's impossible to deny that he stole screen time from more interesting characters who were established before him solely to promote his deck. That, and his D-Wheel can fly. \\n\\n\r\nEnjoyment (9/10): In my opinion, this is the most enjoyable Yu-Gi-Oh series to date, with interesting characters who all actually do stuff and a plot that actually goes somewhere. Seeing Yusei be prejudiced against by society yet still kick butt was awesome, as well. \\n\\n\r\nOverall (8/10): Being 64 episodes long and with virtually no filler, Yu-Gi-Oh 5D's is a must-see for any Yu-Gi-Oh fan even with its ridiculous concept. I'm just glad they didn't make the series 90 episodes of crud longer and totally derail virtually every character's personality. *falls out of her chair in a coughing fit* Wow, I think I might be coming down with something.",
            "date": "2011-06-11T15:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 37761,
            "reviewer": {
                "episodes_seen": 64,
                "image_url": "https://cdn.myanimelist.net/images/userimages/219839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rainbow67737",
                "username": "Rainbow67737"
            },
            "url": "https://myanimelist.net/reviews.php?id=37761"
        },
        {
            "content": "Yuugiou 5D's is, honestly, the best Yuugiou series out of Generation Next and Duel Monsters. I know we all got irratated with Yuugiou thanks to GX, but after watching the first episode, 5D's, like DM, even though it may look sort've weird and outlandish, it manages to suck you into watching it.\r\nStory: 10/10\r\nAt first, the storyline may seem a little weird. Well, due to the fact the story line actually varies, yes. It does seem weird. But you'll grow to like it and love it even. \r\nArt: 8/10\r\nHonestly, if the animation wasn't so weird at random intervals, I could have given this a 10/10 also.The art is enjoyable and colorful. And it's not hurting to your eyes, especially later on. \\n\\n\r\nSound: 10/10\\n\r\nThat is, if you watch good quality videos. But in all seriousness, the sound is good too.\\n\\n\r\nCharacter: 10/10\\n\r\nWell, they're not cheap rip-offs of the other characters in Yuugiou and that's always a good thing. But, each character has their own personality and while you might think at times, \"This character is oddly like so-and-so\", the truth is, they're not. Characters are just that good.\\n\\n\r\nEnjoyment: 10/10\\n\r\nI just enjoy it. Through the sad moments to happy to funny.\\n\\n\r\nOverall: 10/10\\n\r\nIn conclusion, if you've been a Yuugiou fan for years, you'll love this series. ;3",
            "date": "2009-02-19T14:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 12566,
            "reviewer": {
                "episodes_seen": 46,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99346.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChibiCrow",
                "username": "ChibiCrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=12566"
        },
        {
            "content": "I'd like to start off by saying that I've been a huge fan of Yu-Gi-Oh! since I was a grade schooler. However, I'm not talking about all the terrible 4Kids dubs. The Japanese versions have such great writing and storytelling, you'd be doing yourself a huge disservice by watching this in the censored and butchered English dub. 4Kids decided not to even dub and air the last 10 episodes.\r\nI will be reviewing this series as a whole and not each individual arc. Now with that out of the way, here are my thoughts on what I believe to be the best Yu-Gi-Oh! has to offer:Yu-Gi-Oh! 5D's\\n\\n\\n\r\nStory: 10\\n\r\nWhat I hear a lot from people in both the avid and non-avid community is that the whole idea of card games on motorcycles sound incredibly silly. At first, I felt the same way. But hear me out, it's really badass.\\n\\n\r\nThe act of dueling on motorcycles known as D-Wheels (or Duel Runners in the dub) is called Riding Duels (or Turbo Duels in the dub). Think of this as this world's equivalent of circuit racing and illegal street racing. Of course, when there's illegal street racing, there will be police chases. The Public Security Maintenance Bureau (or Sector Security in the dub) is the authority that forces illegal D-Wheelers into a duel, in which the loser's bike shuts down.\\n\\n\r\nThe setting takes place some time waaay after the events of Duel Monsters and GX in Neo Domino City. A highly maintained and advanced city that feels so much more alive than just a city that glorifies a card game. Away from the main city is a slum area known as the Satellite. This place is basically the ghetto. This is also where laborers are forced to separate trash and recyclables. Security keeps heavy watch over Satellite, arresting anyone they possibly can. People living in the city treats people from the Satellite with heavy discrimination. A theme of this show is overcoming that discrimination and unifying those in the city and those in the Satellite.\\n\\n\r\nThe show also tackle themes of regarding revenge, death, and mass genocide. Just wanted to put that out there.\\n\\n\\n\r\nCharacters: 9\\n\r\n5D's has my favorite protagonist in all of the Yu-Gi-Oh! series. Yusei Fudo. An 18 year-old duelist and mechanic living in the Satellite slums. He has a more mature and collected personality than the previous protagonists, adding to that, he's an incredibly good duelist. Rather than defeating his opponents with powerful cards, he uses a collection of what is thought to be weak and useless cards to achieve massive victories. He represents the weak but many lives of those living in the Satellite.\\n\\n\r\nAs for the rest of the cast, I would rather not spoil it, but I will say that they are the most developed and complex characters in Yu-Gi-Oh!\\n\\n\r\nI do, however, want to mention Aki Izayoi. She is the female protagonist of 5D's and is only one in all the Yu-Gi-Oh! series that was not tossed aside as a cheerleader or damsel in distress for the main character. She received one hell of her own story arc and was written to be one of the best duelists and characters in the show.\\n\\n\\n\r\nArt: 7\\n\r\nIt's pretty decent. Definitely a huge step up from Duel Monsters and GX. I'm very fond of the CG used in the show, as it makes for VERY eye-catching summon animations.\\n\\n\\n\r\nSound: 10\\n\r\nMy god, am I in love with the OST for this series. Yutaka Minobe did a fantastic job for 5D's. The OSTs from Duel Monsters and GX were only okay, but this one was just soooo good. It was such a shame that not even this was left in the English dub, 4Kids replaced it with their own crappy music.\\n\\n\r\nAn insert song was written by Masaaki Endoh called \"Clear Mind.\" And let me just say that the scene where it played was hype as f**k.\\n\\n\r\nAs for sound effects, also great. A huge step up from the previous series.\\n\\n\\n\r\nEnjoyment: 10\\n\r\nThere is a huge bias here, as I am still a very active Yu-Gi-Oh! player in college. There was no barrier of entry here, as I already play the game myself at a competitive level. So I was able to enjoy the story to its fullest extent.\\n\\n\\n\r\nOverall: 10\\n\r\nYu-Gi-Oh! 5D's has a special place in my heart and I cannot fairly rank it on my favorites list. Yusei is my favorite character in any form of fiction of all times. He's such a heroic and righteous figure. There really were times where the show brought tears to my eyes. Yu-Gi-Oh! 5D's wasn't meant to be the children's show/advertising campaign that 4Kids made it out to be. It has a deep and compelling story and a large cast of lovable characters that I can never forget.",
            "date": "2016-07-11T15:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 223769,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5124040.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KapnTemple",
                "username": "KapnTemple"
            },
            "url": "https://myanimelist.net/reviews.php?id=223769"
        },
        {
            "content": "When I first heard of the series, I thought it would be a lame attempt to try to get people to continue buying the merchandise. I got bored after watching the first few episodes and put the series on hold for many months. After a while, I decided to get the series off my list and decided to watch it.\r\nBoy, was I glad I did.\r\nPlot:\r\nPersonally, I found that this plot was a lot better than the plots of the previous two series. It wasn't just people wanting revenge for random reasons, it was people trying to change the world for the better, albeit using thewrong techniques. It also focused on a lot of real-life issues such as discrimination and how the under-classed people have hopes and dreams too.\\n\\n\r\nI liked the second season storyline better than the first. \\n\\n\r\nArt:\\n\r\nFor a Yuugiou series, the art is pretty good. I find that animators focused their art skills more on the monsters than the characters. The characters are pretty simple, but they look good. However, I think animators should pay more attention to details when characters are zoomed out; usually the characters don't look great from far away.\\n\\n\r\nSound:\\n\r\nSound effects are realistic. I love the theme and insert music; I think they are the best out of all the Yuugiou series. Soundtrack fits with the mood - mysterious, dark - , but I feel that Yusei's theme was overused - it played just about every episode...\\n\\n\r\nCharacter:\\n\r\nOverall, characters were great; they weren't flat. Development is good too. I just found Yusei to be the same in the first 40 episodes or so; he kept talking about bonds and the speech every time was kind of annoying, but other than that, it was good.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this series very much. I'm sad it's the shortest series.\\n\\n\r\n-Sigh, my first review ^^-",
            "date": "2011-08-19T09:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 41765,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CabernetRose",
                "username": "CabernetRose"
            },
            "url": "https://myanimelist.net/reviews.php?id=41765"
        }
    ],
    [
        {
            "content": "This is my first review ... so bare with me as im typing this all on spot off the top of my head\r\nThe series has come to an end and what an end it was. Upon the end of GX the world got a glimpse of the new era of YGO and its safe to say we all had our doubts about card games being played on motorcycles.\r\nStory:\r\nYou start the story off with our not so young protagonist Fudo Yusei who appears to be in the outskirts of the city, Neo Domino City, the outskirts was know as Satelittle. After being betrayed by his formerfriend Jack Atlus, Yusei builds a D-Whell from scratch and aims to break through into Neo Domino City to take back his stolen Stardust Dragon the card which at the time was said to have held all the hopes and dreams of their friends in the Satelittle.\\n\\n\r\nAfterwards everything is pretty cliche, a new enemy appears and Yusei aims to defeat them however through out each arc the bonds between him and anyone he makes positive relations with is stressed greatly and not in a \"Our friendship can make us do anything\" sort of relationship but more of a sense of support between him and everyone they might to do their best\\n\\n\r\nArt/Sound:\\n\\n\r\nThis is the first YGO series to be animated in HD, visually i thought it was amazing though i could have done without some 3D animations in some scenes  involving the main Dragons, it was something that was easily overlooked.\\n\\n\r\nThe 5D's OST is simply amazing and gets your heart racing, just look up themes such as \"Yuseis Battle\" or \"Unleashed Force\" and youll see\\n\\n\r\nCharacter:\\n\\n\r\nThe main protagonist was a much more mature character compared to previous heros Yugi and Judai, alot of people always clinged to Yugi for being the original King of Games but Yusei had that mature sense of mind and was always calm and collected throughout all of his hardships. Then you had the Seto Kaiba of the show Jack Atlus who was the most self centered character of the series, but of course every series needs one. \\n\\n\\n\r\nOverall:\\n\\n\r\nRiding Duels have really liven up the way duels were played in the show, instead of both players just standing across each other drawing cards you have the characters riding whatever course theyre on whether it be an offcial route made by the city or a random duel in the outskirts of the Satelittle, the entire world was their duel field.",
            "date": "2011-04-08T23:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 35832,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207908.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tsuntenshi",
                "username": "Tsuntenshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=35832"
        },
        {
            "content": "Ah yes, Yu-gi-oh, a show that perhaps most of the kids growing up in the 90s have at least heard of. I remember the agonizing wait for each new episode of the original Yu-gi-oh to air on Saturday mornings. It wasn't until I grew older that I realized how corny the whole premise of Yu-Gi-Oh when I decided to re-watch a childhood favorite. I still enjoyed the show, but I found it was lacking depth. It was a show about people taking children's card games way too seriously, and that was that. \r\nThe next iteration of Yu-Gi-Oh, Yu-Gi-Oh GX was a step back from theoriginal. It took a long time to develop any meaningful momentum, and the whole show was seeping with high school angst. In the end, I never finished the series -- it felt like it was on a road to nowhere.\\n\\n\r\nI was about to give up on the whole franchise, but one day a sudden fit of boredom struck me. I didn't have any anime that looked appealing and I had nothing to do. I heard about a new Yu-Gi-Oh series that took place on *gasp* motorcycles! Wait... motorcycles? Really? So... with great trepidation I once delved into an old childhood favorite of mine that was now on two wheels, only to find out that this version of Yu-Gi-Oh is very different than the other two. \\n\\n\r\n5ds sets a much darker, heavy tone from the get go from the other two series. It's more heavy handed in it's delivery, and things are much more serious, than in the predecessors. Despite the absurd notion of dueling on motorcycles, 5ds makes it clear from the get go that it is dealing with far heavier, and loftier themes than it's predecessors. In fact, I'm inclined to not even call this a children's television show anymore.\\n\\n\r\nI say this because Yugioh 5ds is very dark, especially when compared to its predecessors. From episode 1 there is a clear difference in tone. The setting is a beat up slum that was separated from the rest of the city in a cataclysmic event. The buildings look like they have been bombed out, and junk stretches as far as the eye could see. This is where our protagonist Yusei is from. Every day the residence of this slum called satellite are discriminated against, the only the only hope they have for a future is bleak. The protagonist grew up an orphan, not knowing his parents, and he is out to seek revenge on a friend that took something very important to him. The very image of such a city invokes images of the Jim Crow era in the United States. \\n\\n\r\nThat being said this is not an anime for everybody, not even fans of yugioh. I find that those who like yugioh either love this anime or hate it. I personally think this is the best iteration of yugioh, it's not simply just card games -- it is an anime that transcends its source material. If you want a gritty form of yugioh, this is the anime for you",
            "date": "2015-09-13T03:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 198467,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SpinDoctor",
                "username": "SpinDoctor"
            },
            "url": "https://myanimelist.net/reviews.php?id=198467"
        },
        {
            "content": "First, Yu-Gi-Oh is an anime based off of a card game and unless you're a big fan of the card game then this anime is going to be pretty boring for you because all the conflict in this anime is based around characters playing the game. \r\nOf Yu-Gi-Oh!, Yu-Gi-OH! GX, and Yu-Gi-Oh! 5D's I'd have to say 5D's is my favorite. I love how Yusei is so much more serious of a character than Jaden from  GX was. Also, synchro summoning and turbo duels really made this anime twice as good and kept old viewers like me watching. Plus, the series finale was muchbetter this time than it was in GX. \\n\\n\r\nThe bad things I have to say about this anime is for one it can get a little boring watching some characters duel, some duels in this anime get so complicated and drawn out that I just completely lose track and interest. Also, I understand that the entire anime is based around this, but why do the characters in this anime have to solve every problem they have by dueling? For example, in GX there's an episode where a girl gets kidnapped and Jaden must rescue her by beating the kidnapper in a duel. Why? because obviously any problem in this anime, and I'm referring to the Yu-Gi-Oh franchise as a whole, can be solved by playing a card game. That's a problem with this anime, all the action scenes are just characters playing a card game and there's never any good old fashioned fight scenes. Also, I saw the 4 kids edit of this anime and let me just warn you that 4 kids is infamous for ruining the animes it translates. 4 kids chose not to include this little mini story arch that happens at the end of the series that I believe would have been a much better ending then the way 4 kids decided to end the series. \\n\\n\r\nIf you are a big fan of Yugioh that already saw Yu-Gi-Oh! and Yu-Gi-Oh! GX then I highly recommend watching this anime.",
            "date": "2013-11-16T16:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 120525,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3238983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/middleground4471",
                "username": "middleground4471"
            },
            "url": "https://myanimelist.net/reviews.php?id=120525"
        },
        {
            "content": "Yu-Gi-Oh! 5D's is the third in the ongoing Yu-Gi-Oh! franchise, which has captured the attention of many worldwide. It is a long-running series consisting of 154 episodes with various story arcs, much like previous instalments in the franchise.\r\nThe series consists of protagonist Yusei Fudo, a cool-headed but determined individual who seeks to free himself and others of oppression. He is a social outcast due to living in Satellite, the slums near Neo Domino City, and his eventual victory with friends he made along the way is highly predictable. Much of the story rides on Yusei and his predictable victories in duels, and the rest consistsof usually well-intentioned villains who disagree with Yusei's idealistic view of saving everyone from future dangers who explain the wrongs of his ways of thinking. Of course, they're eventually disposed of.\\n\\n\r\nYusei is joined by many characters from various walks of life on his journey, though they lack dimension. Most characters serve a purpose in the plot, and aren't explored beyond that. Some characters experience development through the actions of Yusei and the world around them, but only becomes noticeable after watching the series for an extended time, especially when they become capable of helping the world and people around them much like Yusei himself. However, many characters face degradation, being later forgotten or turned into comic relief or duel commentators.\\n\\n\r\nExecution of the aforementioned concepts is a mixed bag. As with previous Yu-Gi-Oh! series, 5D's boasts some fantastic music, accentuating the highs and lows of the story. Animation, however, is less consistent: it is mostly pleasing to look at, but looks obnoxiously off-model during various episodes. The eye candy is placed where it matters most, namely, during revelations in the plot or otherwise important episodes.\\n\\n\r\nWith any long-running series, there is the issue of maintaining a feeling of freshness to the content of the show. This is especially difficult with 5D's, a show in a franchise relying on a card game and already preceded with two extended series with a very similar premise. 5D's does a good job of keeping plot points and characters colourful and varied, with a large cast of characters and various story arcs. However, there is very little feeling of continuity between these arcs. Characters and plot points previously important to the story are understandably dropped in favour of newer material. This can occasionally be annoying as many of these characters gain little closure until the very end of the 154 episode series. The long chain of playing card games and explaining it also hampers the experience for some, especially those already familiar with the card effects.\\n\\n\r\nOverall, Yu-Gi-Oh! 5D's is a fun series to watch if you turn off your mind and sit back, but far too loosely packed to be truly great. Although the idea of \"card games on motorcycles\" is an oddity, it is presented in a reasonable manner which is entertaining. The 'never give up' attitude of the protagonists, over-the-top flair and overcoming adversity is exciting to watch. If you're after something more serious, pick something else.",
            "date": "2012-01-07T19:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 51223,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/734703.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HybriDefiance",
                "username": "HybriDefiance"
            },
            "url": "https://myanimelist.net/reviews.php?id=51223"
        },
        {
            "content": "Ok, first of all, I'm just going to say it, when Yugioh 5D's first came out I had zero interest in it. I'm not to sure why either. Probably because when I first watched it, it was like the 20th episode or something and that's probably why I couldn't get into it. So, after I applied to Hulu and decided to watch it I really kicked myself in the foot, because I can't believe that I missed such a great anime because I think Yugioh 5D's is not only the best in the series thus far, I think it's one of the best anime's everestablished. It had an unique story line that really kept viewers engaged with its well developed plot lines for both seasons, the first one especially. Plus, this was the first time that we actually had a story that actually centered around not just one character but five. Yeah, Yugi and Jaden had friends that backed them up and everything but they pretty much did all the dueling and saving. In this one, it's five characters who are both dueling and saving the world.\\n\\n\r\nThe anime was top notch in this series, in certain situations or the summoning's of certain monsters like the Earthbound Immortals, the Majestic Dragons, Shooting Stardust Dragon, it almost felt like that they were actually there in actual life. It was outstanding.\\n\\n\r\nYugioh once again brought us some great themes to the show and a great theme song. Hyperdrive is the best theme of the show thus far and believe it or not, I actually never get bored of it whenever I hear it. The other two were ok for a while but then sadly loss their touch. I think the reason why this one works well is because it's a slow rock theme instead of a super hipped rock theme like the other two were. Nevertheless; it's a great theme. \\n\\n\r\nThe characters, while admitidly a couple of them are a little boring or so are very well done in this one and I think that, that is this series strongest point, the characters. Yusei is pretty much the same as Yugi and Jaden, but the difference is, is that he does more actually. While the other two pretty much only did was duel and save the world, Yusei was also a mechanic along with Crow and Jack, and if fit well for him and his friends because they were turbo duelists, so it only made sense that they would have to have mechanic skills so they could work on their duel runners. \\n\\n\r\nJack was a great character also though I'll admit I thought at first that he was gonna fall into the same rut as Kaiba. Being power hungry, wanting to prove that he's the best and do whatever it took to defeat his rival, but here not only does Jack not fall into that rut, but the rivalry here really, really works. It's my version of a rivalry done right. Cause unlike Yugi and Kaiba, as well as Jaden and Chaz who weren't friends and started out as rivals by being defeated by the hero. Yusei and Jack were actually friends to begin with, growing up in the Satilight, being part of a team known as the Inforcers, and what I really loved was that whenever Yusei loss to Jack due to some flashbacks that we got was that Jack would give Yusei some guidence by telling him that he has to trust in every card in his deck. Plus, unlike Kaiba and Chaz who would only work up a plan to try and defeat Yugi or Jaden to win back their honor, Jack would actually spend his time either drinking coffee, helping out with his friends on improving their duel runners, or would be out helping others. Like in one episode, he challenges a crime boss and demands that if he wins, they have to hand over every contract that they have. He of course does win, not using his deck of course but one of the victims decks which is a huge plus and rips up every contract that they have, freeing every victim from whatever contract they had. Jack was definetly a strong character and a huge step-up for your everyday rival. I would talk about every character but then this review would be too long. Maybe I'll update it one day and talk about the other characters, one of which that I would really love to talk about.\\n\\n\r\nI really did enjoy this series and will probably watch it again, if you haven't seen this series yet and you're a die hard Yugioh fan like myself, I strongly reccomened that you see it, you will not be dissapointed unlike some certain peace of crap that came after this.",
            "date": "2014-04-01T11:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 138205,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2812563.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Darkness-Ryu",
                "username": "Darkness-Ryu"
            },
            "url": "https://myanimelist.net/reviews.php?id=138205"
        },
        {
            "content": "You know when you have that feeling that you just have to review an oldy but a goody thats is what happened when i thought to do this. 5D is that great anime that just keeps you on your toes and keeps you wanting and it does it better than alot of other yugioh series and i will say why. \r\nThe story in itself is great and original if you look at it in a yugioh perspective. It grasp you with a badass story which doesnt begin with a world all happy go lucky. No 5d gives a more real world perspective by dividing thedifferent city parts in Satellite and Neo domino. Neo is the place thats got all the money basically while Satelilite is used for cheap labor basically. This beginning has never happened and prob will never happen in yugioh series later because it gives you a more serious feels to its world. Because yugioh often is alot of goofy hahaa basically 20 episodes in. This is not saying the story doesnt have its humor parts but it gives a more badass feeling than any yugioh series has given earlier.  And as the story progress through the seasons it becomes better and better it never gets boring or much of the same it always  has something new to offer. \\n\\n\r\nWhile the story is great the nice music that goes with it just helps it get better. Most openings and endings in 5d is great which is rare for an anime like yugioh imo and the soundtrack adds to it all even more. \\n\\n\r\nRemember earlier when i said the story was badass well you need great characters by its side which this anime has plenty although i will just mention 3 cause well 5d have to many Xd. Yusei fudo has no equal when it comes to the  MCs in yugioh in my opinion. Hes calm hes cool although he has the cheese feeling of friends is all thing that we know yugioh always must have. But its not something that seeps into him and becomes him. Yusei is that badass Mc everyone wished for and even those seeing Zexal or later should admit that they fell short to him.  Although with a name thats slight cheesy Jak atlas is a great yet at times annoying character considering he tends to be arrogant but dont let that fool you. He has a great personality as the time goes although he stays a little arrogant since jak atlas wouldnt be it if he wasnt. If there is a character i could say he was similar to it would be Kaiba from the original series. They both have that superior view but Jak has some more humility than Kaiba ever got. And no anime or yugioh series is without a great heroine. Again 5d shows another point it does better than most yugioh series in creating a independent female character that can do all that and look beautiful. Her closest simiilarity is Alexis Rhodes or Asuka as in japanese who is from Gx. But Aki is just better than her also in every sence of the word. She has a better feel to her in general as you watch her develop and she is more interesting of a character that actually becomes part of the series and not just one sidekick girl that is along on the ride. \\n\\n\r\nIf i praise it so much so yes of course i enjoyed it. Its a yugioh anime i have longed for. One that can be serious and still call itself a yugioh anime. There is little i dont enjoy about it. Although as with many Yugioh  series this just keeps on getting better as you watch through the seasons and it has a great climax to finish it. \\n\\n\r\nOverall i mean if there is anything negative i would say that sometimes Yusei does comboes that isnt possible unless your in bed with lady luck but thats just about it. Its great on every point its the yugioh anime which is most unique in the franchise including the newer series. And this will probably be my all time favorite yugioh anime until the day they dare to do what they did with 5d and make a more serious wicked and badass world. Keep in mind you have to watch the later seasons on sub because Murica didnt like that this anime had violence in it so they didnt want to dub it\\n\\n\r\nAs a sidenote people will complain about the motorcycle duels which is unique to this anime but in my opinion its part of what makes it so good. It has something of its own and it does it well.  So dont be discouraged from watching this great yugioh series if its only small things like that which people tell is bad because i honestly think their going to be better than most people think when they hear it.",
            "date": "2017-07-27T16:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 253985,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=253985"
        },
        {
            "content": "My review is based on the first season.\r\nUsually, I wouldn't be bothered with the Yu-Gi-Oh franchise. I mean it's an anime franchise revolved around a card game. But I saw that Hulu Plus carries the subtitled version of the show. Curious, plus with the desire of making the most of my Hulu Plus subscription, I decided to give it a try.\r\nIt's actually not bad....\r\nThe premise of 5D's sounds ridiculous, and it is. Imagine playing a card game, while riding a motorcycle. Yeah... Setting that aside, however, is a story and characters that are actually pretty interesting than what you would expect out of the franchise.Yusei, unlike the other Yu-Gi-Oh series, is the silent-cool protagonist type. It brings a more \"mature\" feel to the series. His rival, Jack, is more of the typical over-confident super cool but kind-inside guy. Then there's Aki, the conflicted gal. Of course, since the series franchise is targeted towards younger kids, they have Lua/Luca twins that can be annoying, but not enough to detract from the main feel of the show.\\n\\n\r\nThe main attraction, the card-game, is the meat of the show. In addition to the standard face-to-face duels, which is still there, there's the riding-duels too. What makes the show so captivating to me is the way they set up the duels. In most of the duels, Yusei is pretty much very close to defeat with extremely low LP left, yet he managed to turn things around with multitude of crazy combos. Many of the duels are also fairly fast-paced, only taking several turns to complete, although they did drag some of the battles towards the end of the season. The only annoyance is that the way the characters have to explain each move/card every single time.\\n\\n\r\nThe story, at least the first season that I finished, carries certain mature themes like discrimination and abuse by authority, in addition to the standard friendship, bonds, family, and of course, trusting the cards. There are pretty emotional scenes too, especially during the battle with the Dark Signers. \\n\\n\r\nOther aspects of the anime is fairly standard. The animation is typical, with some overused sound effects. And of course, the typical staple of Yu-Gi-Oh series, the protagonist's amazing hair (apparently it's genetic as his dad has the same hair...). In the end, it's still Yu-gi-Oh, but I actually enjoyed it more that I thought. Hulu Plus provided both the original Japanese version with subtitle and the English dub version. I recommend watching the Japanese version, at least to enjoy one of the songs from Alice-Nine. ;-)",
            "date": "2012-06-07T14:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 62863,
            "reviewer": {
                "episodes_seen": 64,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1309915.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pika2000",
                "username": "pika2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=62863"
        },
        {
            "content": "When people bring up Yu-Gi-Oh 5D's, what first comes to mind for many is \"CARD GAMES ON MOTORCYCLES!\" While it is true that this show does use motorcycles (called D-Wheels in the Anime) for duels, it does so in a believable manner. Coupled with enjoyable characters, an interesting story, and the best music of all the Yu-Gi-Oh franchise, this could easily be the best anime adaptation for the beloved card game.\r\nStory:\r\nI'll try not to spoil any of the plot.\r\nPrologue: About 17 year before the beginning of 5D's, a huge disaster occured that destroyed half of Neo Domino City, the setting of the show. The cataclysmicevent left the city in ruins and tore off a huge chunk of land. After the city was repaired and everything returned to normal, that little island became to be known as Satellite, and that is where all the poor people are quarantined, along with convicts and other people that are not considered upper class. Satellite is where Yusei and his friends lived and grew up.\\n\\n\r\nThe first arc of Yu-Gi-Oh! 5D's is the Dark Signers Arc. It focuses on the Signers vs Dark Signers war. The Dark Signers are trying to revive ancient deities to conquer the world. The Signers are people who have the mark of the Crimson Dragon, an ancient deity, and must stop the Dark Signers. The Signers comprise of the main protagonist group of the series; Yusei Fudo, Jack Atlas, Aki Izayoi, Crow Hogan, and Leo and Luna. \\n\\n\r\nThe second arc is the Ark Cradle. In the far future, humanity has been all but destroyed, by the very things they love most, Synchro Monsters. To prevent this future, a group of people travel back in time to erase what they believe to be the source of all the destruction of the future, Neo Domino City, which happens to be Yusei's home.\\n\\n\r\nThe first arc is slightly better than the second arc of the series. It had more plot twists and was much more darker in terms of themes and actions. That is not to say that the second arc is bad. Both arcs provide very entertaining duels, good character development, and other memorable moments. The actual story that each arc provides is easy to understand but is still geared more towards an older audience. The only fault is that the second arc has one or two little plot holes that can go easily unnoticed, and quite a few episodes of filler.\\n\\n\r\nArt:\\n\r\nVisually this is just like any other Yu-Gi-Oh!. Cool monsters, sparkly card effects, and outrageous hairstyles. But it should be noted that this is first Yu-Gi-Oh! series to use quite a bit of CGI. The CGI is mostly used for the Synchro Monsters, most notably the protagonists cards. The art style changes from drawings to CGI frequently, and it sometimes makes the mosnters look a bit wierd.\\n\\n\r\nSound:\\n\r\nEasily the best out of all the Yu-Gi-Oh! franchises. The instrumental pieces used throughout the series do their job very well. Some themes are very recognizable that when it starts playing, you know what's going to happen next. But what really stands out are the vocal tracks that are played during the show. Even after the introduction of Zexal, 5D's is the only Yu-Gi-Oh! series to insert vocal music during the show. The most notable song would be \"Clear Mind' by Masaaki Endoh. It is a Japanese rock song that first plays when Yusei first summons \"Shooting Star Dragon\". With the fast paced action of dueling on D-Wheels, this song playing in the back ground, while Yusei renounces the needed summoning chant, adds up to the most epic summon I've seen in Yu-Gi-Oh!. \\n\\n\r\nCharacter:\\n\r\nI will only be covering the six main protaganists.(Minor spoilers)\\n\\n\r\nYusei Fudo is the true main protagonist of the series. Yusei is a calm and collected individual who rarely raises his voice when not needed. He is very loyal to all his friends, even one's who have back stabbed him in the past. Growing up poorer than dirt, he's learned that nothing is worthless and that all people should be allowed to have what they need, especially friends. Even though he may pass off as stoic and headstrong, beneath this facade is a man who is deeply depressed about the disaster that happened in the past. His personality changes greatly during the first arc, becoming much happier, and the second arc really shows how he's grown since the beginning. His skills not only lie in dueling, for he has also learned many other useful skills. He can fix anything with an engine, and has vast knowledge on Momentum, the power source of the city. \\n\r\nHis duels are mostly on his bike, but many duels have his two feet firmly on the ground. Either he way, he uses superior tactics and strategy to defeat all opponents who look down on him. \\n\\n\r\nJack Atlas, a childhood friend of Yusei, he too grew up in the poor district of Satellite. As he got older, he got sick of the poor man's life and wanted to be among the riches. A mysterious person offered him a life such as that, but the catch would be abandoning his friends. He then became a master duelist known as the King, and his history from Satellite all but forgotten. Jack comes off as arrogant, obnoxious and really over-confident. He always proclaims that no one can defeat him in a duel.  But as the series goes on, he comes to regret betraying his friends and then does his best to keep the friends he has. His duels are just as entertaining as Yusei's and his number of duels in the show are second only to Yusei.\\n\\n\r\nCrow Hogan, he does not make an appearance until halfway through the first arc. But his personality is nearly the same as Yusei. Kind, caring, and good at heart. But when compared to Yusei and Jack, Crow is easily the most childish of them. He can come off as an immature prankster, but he only wants all friends to be happy. Unlike Yusei and Jack, Crow chose to stay behind in Satellite. \\n\\n\r\nAki Izayoi, is one of the more interesting characters of the show.  She is known as a psychic duelist, people who can make duel monsters come to life, not just holograms. In addition, whoever duels her receives physical damage equal to their lifepoint damage. Her past is the darkest of all the protagonists, and it really adds to her character development, for she debuted in the series as a cruel and heartless person, uncaring for other people. But in reality, she's just a poor girl who needs a little love, and who else but Yusei comes to the rescue. Her duels are definitely interesting since people actually get injured during her duels, some even to the point of unconsciousness. \\n\\n\r\nLeo and Luna are twins, with Leo a boy, and Luna a girl. These twins are completely unlike the protagonists, because they're young, rich, and inexperienced. But they still try to find the good side to anything and always try to be their happiest. Luna has the power to talk to duel spirits, much like Jaden from GX. Leo has no special powers. After an encounter with Yusei, they begin to experience things that help them grow into better duelists and better people.\\n\\n\r\nEnjoyment:\\n\r\nLike all Yu-Gi-Oh! animes, the true treasure in this show is the duels. There are mainly two kinds of duels, either on a D-Wheel or on your feet. Either way, the duels in this show are the most like duels in real life. There aren't any game breaking cards that let a player win instantly. The duels take time and each player sets up their victory many turns ahead of time. Most of the time, the protagonist cards are weaker than their opponents, and they must adjust their tactics and strategy to beat them. With duels that force each character to change their playstyle for a while, no duel is uninteresting. \\n\\n\r\nOverall:\\n\r\nThe anime is great. While humor and seriousness are not even, it makes the show more enjoyable. For an estimation, the show is about 70% serious and 30% humor, with most of the humor coming from filler episodes. If you are a fan of Yu-Gi-Oh! or just fast paced strategy games, then don't ignore this anime.",
            "date": "2014-03-12T23:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 135579,
            "reviewer": {
                "episodes_seen": 154,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3485691.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Killerbarr",
                "username": "Killerbarr"
            },
            "url": "https://myanimelist.net/reviews.php?id=135579"
        },
        {
            "content": "Quicky Review: \r\nAfter watching Yugioh Duel Monsters and Duel Monsters GX, Yugioh 5Ds came along and took everything that made the original good, and also what made GX good, and created an amazing story.\r\nWithout spoiling much of the story, 5Ds has one of the darkest stories in the series, though I thought that after season 1, this dark feel had been toned down, but that's not a bad thing at all.\r\nThe characters are really engaging and the voice work for them is superb, I wish the same could be said for the god-awful 4kids english dub.\r\nThe music is very good, some tunes really put youin all kinds of mood, and the opening and ending songs are great as well.\\n\\n\r\nThe animation is a mixture of 2D anime cell, and CG, while in some other animes this mixture seems rather unorthodox, in 5Ds, the transition between the 2D and the CG looks almost seamless.\\n\\n\r\nThe new D-Wheel mechanic for the card duels is also very original, and also, the brand new cards introduced in the series also look cool. A shame that some of these cards designs were edited in the 4kids version.\\n\\n\r\nAll in all, Yugioh 5Ds is a very entertaining card game anime that remains worthy to the original Yugioh, which is one of my top favorite series. \\n\\n\r\nAnd so far I''ve heard that this series have been getting better ratings than Naruto and Bleach, which are also good animes, however, I'm not a big fan of these.\\n\\n\r\nI highly recommend you watch this anime, for something based/ that focuses on a children's card game, the story is very engaging and the characters are very colorful and expressive.\\n",
            "date": "2011-10-06T11:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 44949,
            "reviewer": {
                "episodes_seen": 64,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PkUltimaga",
                "username": "PkUltimaga"
            },
            "url": "https://myanimelist.net/reviews.php?id=44949"
        }
    ]
]