[
    [
        {
            "content": "Before watching this anime, you should know the definition of \"omnibus format\". The omnibus format main purpose is to dismantle harem genre anime such that the protagonist is able to have romantic developments with the multiple different chosen candidate without having a dispute between each other. One famous example would be the Amagami SS.\r\nAmagami SS was the first anime that adopted the style \"Omnibus Format\". Each heroine had 4 episodes arc in which their romantic confrontation was completed. By each confront's conclusion, the universe would reset to the initial world for the next heroine's romantic confrontation to begin. All memories of moments that happened duringthe 4-episode arc are also wiped. Photokano was successful in doing the same style.\\n\\n\r\nHowever, Photokano which was aired in an omnibus format, used a different approach compared to Amagami SS. It used an introductory arc to let the viewers know more about the characters. Then, it approaches to appeal the viewers using the omnibus format.\\n\\n\r\nMany would think that one or two episodes for each character may be too short. I might have to disagree with that.\\n\\n\r\nThe few episodes duration was enough. Even with the short duration, they've managed to deliver a well-developed character progress. Each heroine has drastically improve their relationship with the protagonist. Remember, at the end, the anime only has 13 episodes, with about half has been taken off for the introduction arc. If you're looking for a fully developed romantic anime, this place is not for you, please leave.\\n\\n\r\nOne thing I would like to mention which is the introduction arc. It's not very appealing and is superficial in expressing the show to its viewers. When I began watching this show, I was expecting this show might not produce great results. Although the omnibus format truly surprised me, the introduction arc didn't cause a great impact on me to continue watching it. In the end, one would think it's just an introduction. If the introduction were juicy, will it affect the main story and the climax? Ultimately, the decision lies on the viewers. For me, I'm fine with the advancement they used.\\n\\n\r\nBut again, this anime doesn't have many advantages. The only think I like is that they surprised me with using the omnibus format and the acceptable character development within such short duration. Other than that, I wouldn't say I'm very interested in the most other areas of the show. \\n\\n\r\nIn a nutshell, this anime is designed specially for people who are looking for an omnibus format style anime. If you like Amagami SS , this could be a wonderful gem for you. However, if you prefer a fully detailed romance anime, I suggest you drop this anime immediately.\\n\\n\r\nPlease note: You're suppose to give your feedback whether this review is helpful or not. Even if this review has its flaws but is helpful, you should choose the appropriate answer. Well, I'll leave that up to you. Good day, peeps!",
            "date": "2013-07-01T10:16:00+00:00",
            "helpful_count": 243,
            "mal_id": 103305,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/562817.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/darkj25",
                "username": "darkj25"
            },
            "url": "https://myanimelist.net/reviews.php?id=103305"
        },
        {
            "content": "Well, what do we have here. It's PhotoKano, a series based off the dating game of the same name. The series focuses on this young boy named Kazuya Maeda who happens to be a high school student enjoying the youth of his life. Perhaps he is enjoying it too much though with that little toy of his. It's a camera and used to capture memories through its lenses. With imagination, you can discover magic through a camera. But that's just all an imagination because in PhotoKano, magic doesn't exist. Rather, there exists many girls who wants to pose for you in lascivious positions just wantingto capture those 'memories'. Honestly, this series is definitely something that I don't want to be part of my memories.\\n\\n\r\nNow for starters, the anime series is adapted from a dating sim developed by Dingo and Enterbrain. The way it structures its series is a bit bizarre as rather than a linear storyline, it focuses on our lucky protagonist-kun who is involved in several arcs each with a different girl whom gets acquainted with him. But hey, that's just high school life right? It's all about teenagers getting involved in romance angles and creating drama. Well, the thing here is that Kazuya, the protagonist becomes the chick magnet who somehow is not only be able to attract the various girls in this show but also get them to do pose in seductive positions. Talk about having a lucky life.\\n\\n\r\nWell, there are some basic merits to this show. For instance, there's the Photography Club who invites Kazuya to join as a member. The club itself is made up of guys who likes nothing more than capturing those seductive photos of girls and making them worth a thousand words. Kazuya on the other hand seems to be the easy-going guy who is able to make friends with both guys and girls like a day in the park. The catch here is that as a bonus, he is able to take pictures of girls with his camera. It's making friends, taking seductive photo-shoots, and striking relationships all in one package of this lucky guy.\\n\\n\r\nFor some reason, the girls of this show only allows Kazuya to take pictures of them in those seductive poses. Why? That's probably a magical question beyond what I can comprehend. Perhaps it's because of his easy going personality. But wait, the guy doesn't seem to have a clue what to do with the girls he hangs out most of the time. Rather than just 'hanging out', the girls of this show all seems to be interested in the boy for reasons beyond just 'taking photographs'. Kazuya on the other hand plays the follower and goes with the flow. Sometimes, this lands him into trouble as he is accidentally labeled as  a 'pervert'. Despite Kazuya trying to negate these situations, they just happen to come by like pouring rain with the compromising positions, accidental kisses, and even other situations where he doesn't want to be in. Ugh.\\n\\n\r\nThe series falls under many of the cliched themes of an ecchi/romantic romance. There's the childhood love, the beach episodes (more than just one of them actually), various confessions, and the obvious fan service. Speaking of which, the fan service of this show is thrown at your face literally every episode. There's the panty shots, the suggestive poses, the swimsuits, and camera angles. The OP song even focuses this as if it''s some sort of art. Then, there's the camera shots that focuses more than just painting a memory. Rather, it points at the various angles of the camera at suggestive body parts. Again, Kazuya is having the fun of his time.\\n\\n\r\nAt some point, I just decided to watch this series for the sake of a possible deeper story to develop. Unfortunately, the plot of PhotoKano is more dry than sands of the beach. It doesn't progress and makes little sense. For whatever reason, Kazuya is like a bachelor and whether he likes it or not, he gets the attention of the girls through his charms. At many points, the boy isn't even trying and girls are allowing him to take suggestive photographs of them. Then, there's the love confessions and lovey dovey scenes that follows. Oh and no one is safe either. Whether you're a class president, an athlete, a school beauty, an imouto type, childhood friend, or the shyest girl on Earth. No girl is safe from Kazuya's 'charms'. NO ONE. Once you're part of the route, expect romance to pop out of nowhere.\\n\\n\r\nWell at various points, I try to dig out something out of this series. I mean, there has to be something that can attract the viewers right? The artwork might be part of that from what I originally thought but it's nothing at all attractive. Rather, it's generic, standard, and poorly constructed. The school uniforms are all generic and nothing stands out. It's not even unique in the sense of being attractive. Rather, it's typical and hardly memorable. The soundtrack isn't any better as the OST itself hardly makes an impression. The OP song \"Koisuru Lens\" by Kaori Hayato clearly matches the theme of the series through those lens of the camera. Only problem is that it seems Kazuya isn't getting any highlights in it. Rather, the girls are the main course of the dish and gives those delicious poses. \\n\\n\r\nTo conclude, this series is something crafted out of a weak plot, with weakly developed characters, and a lackluster premise that makes it a dull experience. The main male protagonist is dull anyways so nothing else new to see there. It doesn't help with the lackluster soundtrack or the artwork. On a positive note though, the series does have a variety of characters to watch and see how they interact with Kazuya. Unfortunately, it all ends with predictable results that spells out what a cliched series this is. I can't recommend PhotoKano to anyone, not unless you enjoy photography or something in animated form. But then again, it makes fun of that in a lascivious way of an attempt to spark interest. It tries too HARD and this was one series that I had a HARD time getting through. But if you really want to try this out, then the ball's in your court.",
            "date": "2013-07-02T11:42:00+00:00",
            "helpful_count": 135,
            "mal_id": 103469,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=103469"
        },
        {
            "content": "I've made another review. The original one (the one I wrote at six episodes out of ten) is below.\r\n~ Completed Review ~\r\nPhoto Kano was definitely a disappointment. The first few episodes led me on, it suggested potential that was definitely never realized. And that, makes me sad. It makes me sad because Photo Kano was something that I had actually looked forward to watching - that implementation of photography, actually really interested me. The art and character design, were actually appealing. The opening, wasn’t amazing, but it was better than average. It was potential. From the very first episode, I felt some, if any potential.Aand, it’s gone.\\n\\n\r\nOriginally, I was going to blame the series’ lost potential on what I thought was a stupid idea. Doing one character arc per episode, omnibus style, is just a horrible idea. Everything gets so packed together and compressed that it’s just a massive outflow of information and emotions, and nothing is really developed, information is just being thrown at you. Ironically, this came to mind not after I had finished Photo Kano, but halfway in, at the sixth episode. Seems like my prediction was right. It was a bad idea. This series, is a great example of an anime that had too little time to voice it’s story, and I know for a fact that had Photo Kano been given more time, it wouldn't have turned out as bad as it did. But with nine heroines, what can they really do? Two episodes per heroine, like what we say with Amagami SS+, would be alright, but that would make the anime 18 episodes long. And that would have been great, if they had 18 episodes to work with. But they didn't. And that’s a shame.\\n\\n\r\nBecause the story was a good concept. I know that’s ample praise for a story that spawned from a dating sim, but it had decent potential as a story - it was just poorly executed because of a lack of time. Granted, it’s not an awesome story, but it wasn’t terrible. The photography element is really what made the anime interesting for me. It’s mildly rare to find photography posing itself as a major plot point in any anime, so Photo Kano caught my eye. What’s unfortunate about this though, is that the element of photography, is rarely seen properly expressed in the anime. It’s like it’s an excuse for the anime to show lewd scenes of Kazuya’s lady friends. It’s really only there to connect the hero to his heroines, in some form or another. But then again, I suppose this is exactly what Photo Kano wanted to do, and in this, it serves it’s purpose well. As a guy with a soft spot for cameras and photography, I was kinda disappointed in the fact that photography isn't really a main element in this anime, it just kinda opened up the stage for the love stories between the hero and the heroines. The thing is though, it’s not like the arcs were even that good - they were just average, like the rest of the anime. The love stories were at best, rushed and executed poorly. And although it’s mildly bad to stuff a character’s arc in a single episode, it’s even worse to introduce said character in their debut episode, finish their arc, and never show them again. And it’s not like these were short-but-sweet stories either, they were basically supercompressed versions of what they should have been, a very summative conclusion of a story that should have really lasted two to four episodes. What makes it worse, is that even if these arcs did last two to four episodes, they would be alright at best.\\n\\n\r\nAnd that, is pretty unfortunate, because the way that these said heroines were drawn, is actually quite good - they’re all really cute (sorry) and adorable (again, sorry), and I really feel like I want to set them as my wallpaper. They’re all well realized. But then again, this is 2013, and it’s not uncommon to see an anime that has been drawn quite well. The BGM and theme songs were alright too, and like the animation, were pretty average for today’s time. The opening didn’t really strike me as being excellent, but it’s not terrible. The ending, is pretty generic, but I suppose that’s alright. It’s hard to judge an anime on it’s music, as if you screw that up, you’ve failed hardcore. The same goes for the BGM, it’s alright, but nothing more.\\n\\n\r\nIf there was one thing that was generic, it has to be the cast. Lets face it, every single friggin anime has a childhood friend heroine, and Photo Kano isn’t any exception. Let’s do a quick checklist. Cute imouto? Check. Tsundere? Check. Quiet girl who rarely smiles? Check. Childhood friend? Check. Athletic, over the top, enthusiastic sports chick? Check. Shy girl with massive tits? Check. There you have it, the most generic friggin cast of heroines I have ever seen, at least at face-level. They’re not too bad once they’re developed. Oh yeah, totally forgot, I can't remember anything about them because Photo Kano merely threw facts at my face for nine episodes. But what I find definitively weird, is the fact that despite having a really generic cast, I still enjoyed them. I still liked the execution of their respective stories.\\n\\n\r\nIn conclusion, it’s pretty easy to quickly summate Photo Kano. It’s a poorly executed slightly-above-average story. That’s all it is. And had it been given say, a nice 25 episodes, it would still be slightly above average at best. And what’s unfortunate is that it didn’t get 25 episodes. It got 13. What emphasizes it’s poor quality, is the fact that it had a decent start. It led me on, brought my hopes up, and crashed them down. But what I still can’t understand, is why I enjoyed it too much.\\n\\n\r\nMaybe I’m just a pervert.\\n\\n\r\n...\\n\\n\\n\r\n...\\n\\n\\n\r\nNaaaah.\\n\\n\\n\r\n~ Original Review ~\\n\\n\r\nI feel like I'm enjoying this show way too much for what it is.\\n\\n\r\nBecause really, the plot is pretty average, the humor isn't really funny at all, and the development of the characters is just straight-up not there. It's pretty average. So, I guess you could assume that the rest of the anime is pretty bad too - which is where you'd probably be wrong. For some reason, it's really quite well animated, everyone is drawn really cute, and everything flows pretty nicely. Not only are the characters drawn really well, it's not the stereotypical fanservicey type of art where you basically have a face and various styles and colors of hair, the characters are genuinely drawn pretty well. The soundtrack's alright as well, it's not bad, but in some places, I've found myself surprised at how decent it was.\\n\\n\r\nBut, I suppose, I should have seen this coming. This is an anime adaptation of a dating sim, and really, the only reason why you would be playing a dating sim, is to stare at really well drawn cute girls that you would probably never get a shot at anyways. So I suppose I shouldn't be surprised that Photo Kano is full of moments where I felt like I was literally playing a dating sim. But if there's one thing that I am surprised about, is how much I found myself enjoying those moments.\\n\\n\r\nI'm not really sure what I enjoy Photo Kano, really. Maybe it's the fact that I can see so much of myself in the main character. Then again, that's probably a selling point - the dude is practically an everyday normal guy, anybody could paint themselves onto him. That being said, I suppose you could call this a fault, because like Photo Kano itself, the guy really just doesn't seem to have anything interesting about him. That's probably why the most interesting thing about him, is actually that he gets to take lewd pics of all his cute high-school classmates.\\n\\n\r\nI suppose I should be called a pervert then, because I've enjoyed all I've complained about in the above.\\n\\n\r\nBut really, what else is there to enjoy? Because let's all admit that any plotline adapted from a dating sim is probably going to be bad. It's a shame too that it's not all to great, because the idea of using photography as a central theme is something that hasn't been tried very often, and when pulled off right, could probably make a decent storyline. It's too bad they didn't seem to even try, because the photography element is what really makes this anime what it is, or rather, what it could be. If Photo Kano was actually well produced in terms of a story, it would probably be known for highlighting photography in it's storyline.\\n\\n\r\nOf course though, we're only halfway through, so it could get better. Hopefully the storyline takes a departure from its current generalisms that Photo Kano has attempted to build it's storyline on thus far, and makes use of the unique nature of it's central theme.\\n\\n\r\nBut unfortunately, with the direction it's taking, it seems like Photo Kano is going to take the approach of telling the story of every single girl in the anime one by one - and what's bad, is that we're 6 episodes in, and we've only done cute Niimi-san, and to an extent, the student council president. That basically means the show is either going to skip half the cast, or do one girl per episode - which is going to be terrible. However, it does mean that we'll probably get to the main character's little sister soon - which I'm sure will please some viewers. She cant be that cute, right?",
            "date": "2013-05-11T00:56:00+00:00",
            "helpful_count": 54,
            "mal_id": 96691,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1115213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ressamp",
                "username": "Ressamp"
            },
            "url": "https://myanimelist.net/reviews.php?id=96691"
        },
        {
            "content": "This series is a fine example of wasted potential. When I discovered this anime I was really looking forward to watch it, I'm a great fan of romance, even the cheesy, sometimes forced, type of romance, and after learning this show used the now more popular omnibus format I defenitely had to give it a try because I was expecting something along the lines of Amagami SS which was fine by me. The idea of having a show where all the possible scenarios are depicted is in my opinion an asset because fans can't get angry with pairings since they get all of them, it'salso a plus for people who can't play the visual novel that these animes are always based off.\\n\\n\r\nThese were my initial thoughts before getting into the anime itself, obviously I didn't raise my expectations because I already knew right off the bat it wasn't gonna be as long as Amagami SS so it would most likely lack some aspects but I remained positive about it. \\n\\n\r\nFor starters we have our main character  Kazuya Maeda, a plain guy who was given a camera by his dad and now for some reason is really into photography, it got even weirder when he joins the photography club which is full of pervs, I thought this guy was going to become one but thankfully he was a nice guy with a more clear mind. From episode 1 to episode 4 there's really no plot, there's barely any story, it is literally just the main character wandering around meeting with all the female heroines and having some sort of talk with them, for 4 episodes I was unclear about what was going on, who was going to be the heroine and what arc was the anime on at the moment, there were no references whatsoever. Then begins episode 5 and then it is clear who the main character is going for, but you have to figure that out yourself, the anime does not point out anything at all. But most of us aren't stupid so even if it was like that we would still get the idea as long as we keep in mind this is an anime in omnibus format.\\n\\n\r\nAfter the first arc was complete in 2 single episodes I thought to myself: \"That's it?\" due to the lack of any more development, the characters simply just out of nowhere love each other, this was such a let down, I'm a romance enthusiast but just ending an arc like that was literally hurtful, but I'm still staying optimistic through out these episodes. Then follows episode 7 which is itself one arc, yes you heard me, ONE ARC in ONE episode, time goes back as usual and the arc ends in the same episode, the characters magically fall in love and there's almost no development in the plot and what bugs me the most is the capability of the main character to change his personality with every single girl, it's as if he's a different guy every time, he's still plain and loves photography, and that's literally how he gets every single girl every time, by taking photos of them, the show progresses with the same scheme, every single episode is an arc, with one of the main heroines which the main character gets involved with due to his photography \"skills\" and magically get together. What a disapointment was all I could say.\\n\\n\r\nI'm not going to be gloomy here because I don't like to trash talk animes I make reviews on, if i'm making a review I have to look at both sides of a show. While this show lacks in plot and story it's still fairly entertaining to see every \"what if\" scenario, but it could have given us so much more.  A show with about 8 female heroines needs to be at least 24 episodes long so each heroine can have her arc explained and developed so we get a clear insight on the whole show. The novel this series is based on is over 50 hours long in gameplay and they're shrinking it to a 12 episode long anime, that's such an injustice in my opinion. My suggestion to the production team would be to either leave out some arcs or make it a longer anime because this just feels so incomplete.\\n\\n\r\nNonetheless if you enjoyed Amagami SS this is still a decent addition, let's consider Amagami the main dish and this is the side dish, not as good but still watcheable.\\n\\n\r\nDue to the lack of plot and the blandness or genericness of the characters this show gets an overall score of 6/10. Nonetheless i want to point out that it's still enjoyable, i rated it 8/10 for enjoyment because i personally like to see all the what if scenarios and the romance, however there is so little time in each episode for each arc to develop these aspects that it might be offensive to those who enjoy real romance, if you're one of those people, this is not a show for you, but if you still want something along the lines of Amagami SS, this show is something you might want to watch.",
            "date": "2013-06-15T13:55:00+00:00",
            "helpful_count": 42,
            "mal_id": 101173,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1950132.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IdleSheep",
                "username": "IdleSheep"
            },
            "url": "https://myanimelist.net/reviews.php?id=101173"
        },
        {
            "content": "Have you ever had that situation where you love the beginning of an anime but the rest of the series doesn’t turn out too well. You get disappointed and just want to forget all the things that were bad. That is how it was with Photokano for me. \r\nThis series is about Maeda Kazuya, a normal high school boy that receives a digital camera from his father. He starts to get interested in photographing which opens a lot of doors for him.  During the series he comes across people he would never had talked to if it wasn’t for his newfound hobby.\r\nThe structure ofthis series is pretty simple. It starts off with four episodes of introduction where you get to meet all the characters. Then the series becomes arc based. This is when it becomes problematic. Every arc is focused on one of the girls that Maeda meets. During these arcs Maeda helps the girls with their problems and also starts a relationship with them. The problem here is that the arcs are very short. Most of them only last for one episode. This makes them very rushed. This structure also makes it feel like the story doesn’t progress so much.\\n\\n\r\nThe photo theme is very interesting and was the reason for me checking this series out. They did handle it pretty well although they could added a bit more of it. Again the bad structure prevents from doing this.\\n\\n\r\nThe main characters Maeda Kazuya isn’t that special of a character but he is likeable. He doesn’t have so much development or a backstory, but this works because the focus is more on the main girls. The girls are many. So many that I won’t take the time to talk about each one of them. The good thing about them is that even though they are so many they still have interesting and unique backstories. But then we do also have a problem with the amount of girls. As I said before the arcs is only one episode and that’s because every girls is going to have one. The lack of time makes them really rushed and the main character barley gets to start a relationship before he has to move on to the next girl. I think the series would have been better if it had a smaller cast of girls.\\n\\n\r\nThe series also have few supporting characters. These characters don’t get so much screen time because of the focus on the main girls. This is pretty disappointing because some of them were really good and funny. My favorite character of the series is Kudou Hiromichi, the leader of the photo club Maeda joins. He does only appear a few times during the series and most of his appearance comes from the previews which he narrates.\\n\\n\r\nI don’t have so much to say about art and animation. It holds a good standard. My favorite part was how they did the photographing. It looked nice and beautiful. One of my favorite things about this series is the great feeling you get. You feel calm and relaxed. The biggest reason for this is the background music. It is always used at the right time and set such a good tone in the scene. The voice acting was good. There weren’t any performances I didn’t like. My favorite performance in this series came from Midorikawa Hikaru who played the character I talked about earlier, Kudou Hiromichi.\\n\\n\r\nPhotokano is a series that sets high expectations that it can't live up to. It follows the classic dating sim structure which is not a bad structure, but it has to be handled well. Photokano has a great intro but has a really bad structure. In this case it's the structure that decides if this series is very good or just good. This series would have worked out a lot better if it just were longer or had a smaller cast. Even with the bad structure the series has some interesting characters and it gives a really good feeling which is the first thing that comes to my mind when I think back on Photokano.\\n",
            "date": "2014-12-04T23:41:00+00:00",
            "helpful_count": 21,
            "mal_id": 171065,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2466457.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Znatte",
                "username": "Znatte"
            },
            "url": "https://myanimelist.net/reviews.php?id=171065"
        },
        {
            "content": "Photokano is about a boy Maeda Kazuya whose father passes his old camera to him. \"Through the viewfinder\" (he says it that way), he meets girls, and told in separate episodes, develops romances with each of them. \r\nStory: 5/10\r\nThe initial premise frankly doesn't sound too bad. You are given introductory episodes where Maeda meets the heroines. After that, each of the heroines' romance stories with Maeda is told in one episode. Each route follows the same format: an encounter that puts Maeda on the girl's route, problem, resolution, confession, then ending. Because each route is crammed into one episode, everything is rushed, and abrupt developmentoccurs. It's hard to take it seriously. Especially where at the end of each episode you get the \"I like you\", \"I'm okay with you?\", *hug*, process. Admittedly, I have done other things while watching Photokano and could still grasp what had happened. Well, it's not really something to be guilty of, but it goes to show how predictable it is.\\n\\n\r\nAlthough, it's good to note that Maeda's narration puts an ample amount of interest. Though it sounds the same in each episode, it gives the impression of him breaking the fourth wall - knowing that there are possibilities with each of the girls he has met. This isn't expounded on however.\\n\\n\r\nArt: 6/10\\n\r\nNot sloppy. But not eye-catching. The best part would be the camera shots, which at least look like something that is photographed.\\n\\n\r\nSound: 6/10\\n\r\nNothing special. You hear the same thing almost every time.\\n\\n\r\nThe prolific seiyuu in the voice cast (Saito Chiwa, Kaori Mizuhashi, Sanae Itou, among others) is the only reason why I watched this. But because each girl is usually important for just two episodes, you don't get to hear your favorite seiyuu much. At least you get to hear them.\\n\\n\r\nCharacters: 4/10\\n\r\nHere we go.\\n\\n\r\nMaeda is an amateur photographer -and clearly does not have any perverted intent in his actions- . Sounds too good to be true. Although he has many perverted encounters, he has good moral character. He's that kind of guy, so I guess it's not too bad. His clubmates, led by the eccentric club president voiced by Midorikawa, are pretty much opposite to him. They are perverts who like taking perverted pictures. And they're funny. \\n\\n\r\n...\\n\r\n..\\n\r\n.\\n\\n\r\nThe heroines however, they follow common stereotypes which makes them generally...stale, personality-wise anyway. To list: Niimi Haruka is the ideal girl, Nonoka is a sports girl, Aki is the ever-so-strict student council president, Hikari is the unsmiling one, Tomoe is another unsmiling one, Rina is the ideal waifu, and Mai and Kanon satisfy the kouhai and imouto complex respectively, and inner lolicon collectively. \\n\\n\r\nProbably the only character I really cared about was Uchida, the stealth photographer, who in each episode you slightly learn more about her. Too bad she didn't get a route. Now while they are stock characters with stock personalities, it doesn't mean they don't develop. But since each girl only gets one episode, you don't get to feel the momentum of her development that leads to romance and/or realization. The result: an unsurprising 24 minutes.\\n\\n\r\nEnjoyment: 6/10\\n\r\nSo you have a route-type plot coupled with stereotypical characters. You get scenes you've probably seen numerous times like, \"Try this food\" and a succeeding \"Delicious!\" phrase. The humor is silly, forced, and unfunny. Unique to Photokano though are the camera scenes. They be objects, scenery, but mostly, the girls. Many of their poses are suggestive, but in the anime itself there aren't many ecchi scenes.\\n\\n\r\nFor fans of Hikaru Midorikawa, he has extremely hilarious lines and shouts in each episode preview. Listening to that with UTW subs, it was something to look forward to every week (and was the only thing that kept me watching). Even if you're not a fan of him, please don't skip the episode previews. PLEASE DON'T. I BEG YOU. That's the only saving grace of a dull half hour.\\n\\n\r\nOverall: 5/10\\n\r\nIf you have a thing for dating sim adaptations and girls having their pictures taken which results into generic romance, by all means watch Photokano. Otherwise, you might just be wasting your time.",
            "date": "2013-06-28T19:00:00+00:00",
            "helpful_count": 20,
            "mal_id": 102887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/923135.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Obihiro",
                "username": "Obihiro"
            },
            "url": "https://myanimelist.net/reviews.php?id=102887"
        },
        {
            "content": "*If you're not into reading too many sentences, just read the conclusion parts*\r\n**There is some comparison and minor spoilers in this review**\r\n\"I dont like take a people photo, their smile doesnt matching with what in their mind\" - Hikari Sanehara (Episode 7)\r\nPhotoKano is an anime that you wouldnt find in anywhere. Using same method as Amagami SS and Yosuga no Sora called Omnibus format*. Photokano is said to be the successor of those both anime. Many people like me (who loves Amagami SS) have a high expectation about this anime, since like i said before not many anime using this format. So is this animesuccess as Amagami SS? I must said not.\\n\\n\r\n* Omnibus format is story that usually \"reset\" after they completed some arc. If you still have no idea about omnibus format, please google it\\n\\n\r\nSTORY (5/10)\\n\\n\r\nPhotoKano as the name said it, its about a guy who just got interest in photography and from that, he start to take photos surrounding him (Including girls). But. somehow the photography itself changes the way how he lives including his love life. \\n\\n\r\nThe premise of the story is quite attracting but sure you wondered why does this anime have a quite low score. The answer for that is the execution. Basically to make a good omnibus format anime, they must have fair allocation episode for each heroines, like Amagami SS. they use 4 episodes for each heroines, so how about in Photokano? Its an unfair one. They accentuate one of the heroines and for the others, they just got a small proposition.\\n\\n\r\nHave a good concept but poorly in execution, thats why this anime is failure. Allocate 1 or 2 episodes for each heroines is too narrow to building up the atmosphere and romance feelings. Moreover, the series will make you bored and feels plain since its easy to predictable on whats gonna happen next.Using omnibus format means they have to restart each episodes and to make it interesting you must put some interesting scenes or differents act in every arcs but be pitied, Photokano doesnt do that and thats why photokano feels so plain and dull.\\n\\n\r\nART (7/10)\\n\\n\r\nThere isnt any interesting point to being said in this section, overall its good enough. The background is so well made and quite realistic. Well, its quite standard for big studios like Madhouse studios. Though on the art, basically we can see that the director is wanted to make a romantic atmospheres and i thought, he really did it but the execution of the story really ruins it all. Anyway, the main point is not the background but the character design, as in the same producers as Amagami SS, the characters design is the main attractive of this show. The girls are so admirable and cute. Honestly, i am watching this anime because of two things, first because of its like amagami SS (omnibus format) and second for the girls. \\n\\n\\n\r\nSOUND (6/10)\\n\\n\r\nThe one that can build the tension is music. For the OP, it was quite lovely and suitable for this anime. Just by hearing the OP song, you would realize this anime was about romance things. Personally, i love the OP. Its quite representing on the anime itself, with love as the main themes. The OP is quite success to send the message to all the viewers\\n\\n\r\nFor the seiyuu, it was fine. Each seiyuu really represents the nature of each character. Like Mariya Ise which voicing the imouto of the MC, its sounds childish but also cute. Thats totally suitable which role that she has. For other seiyuus, i think there isnt any worth to mention again since what memorable  for me in sound was Mariya Ise's voice. But, it doesnt mean the other seiyuus was bad, they do a good job too but its quite standard.\\n\\n\\n\r\nCHARACTER (6/10)\\n\\n\r\nThis is maybe the worst part of this anime. Well, how can i said. What will you have with just one episode for one heroine? too rushed. Almost in every episodes i said \"How? Why? What?\". The details for each characters are deficient in this anime, with just 4 episodes of introduction (4 episodes for 7 character) and 1 episode for the a heroine, thats still doesnt enough. Well, i cant complain it since Photokano just have 13 episodes. So, please bear with it.\\n\\n\r\nBut of course, not all bad. The girls (the heroines) are quite attractive. Lets see, we have tsundere, kuudere, loli, childhood friends, clumsy with bigboobs, and tomboy one. Thats quite generic if i could said. This type of girls is quite common in romance story. But i still found this is quite attractive. No matter how cliche for the character pesonality was, the character is still quite charming and attracting for all the viewers. For the main character, Kazuya Maeda. There isnt any interesting points about him. He is just your normal guy who have good luck. \\n\\n\r\nCONCLUSION\\n\\n\r\nDespite of how bad story and the character was, i still found this anime was quite enjoyable. Its cliche if you want to know it, but well.... i LOVE cliche. maybe this enjoyable just because on how i love Amagami SS and seems i am being carried into this anime. \\n\\n\r\n+ Have a good concept\\n\r\n+ Attractive character design (especially the girls)\\n\\n\r\n- Poorly execution\\n\r\n- The half to the end of the show feel so rushed\\n\r\n- The character development is the worst\\n\r\n- Cliche story",
            "date": "2013-07-09T19:28:00+00:00",
            "helpful_count": 14,
            "mal_id": 104643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=104643"
        },
        {
            "content": "Photo Kana~\r\nI know there are only eight episodes out for this anime but I feel like this is actually a good time to review this hidden gem. I didn't really hear about this anime from anyone and really just decided to watch it because the art looked gorgeous. And no i'm not just here for the pretty girls...\r\nStory -  Photo Kana is pretty simple. There isn't a whole lot to it and I think that suits it just fine. It's a story that unfolds before you that might be predictable but still enjoyable. The main character Maeda gets a hand-me-down camera from his fatherand decides to see if photography is for him. During the course of having this camera he manages to capture rare moments of each of the girls. He was scouted by a mysterious photo club that seemed rather sketchy and decided that it would be okay if he joined because they shared the same love for photography as he did even if it wasn't for the same reasons.\\n\\n\r\nArt - Simply beautiful. The main reason I decided to check it out was because of the art style. At first glance it looks overused but as you watch you notice that it takes on a style of its own. To best explain what I mean you really have to pay attention to Maeda's Photo Opportunities. He'll do this awesome camera zoom in thing and capture the moment that takes your breathe away. Or atleast it did that to me ^^;\\n\\n\r\nSound - The music to this anime is wonderful. Right out of a visual novel soundtrack if you ask me. I'm big on VN's and I could tell that maybe some of its music was inspired by other VN's. Most of the music really captures the moments perfectly. Slice of life in a cup of tea please!\\n\\n\r\nCharacter - Now the characters really don't scream i'm different than any other person you've seen before. Though it's not really a down side to me. Since i'm taking this anime like it were a romantic slice of life i'm not much bothered by its lack of originality. Though I really wish they would have made this series a bit longer than twelve episodes. It could have down a Amagami SS thing and given 4 episodes to each girl to give good character development.\\n\\n\r\nEnjoyment - Not much needs to be said here that you haven't already read from my review already. I really enjoy this series. It's nice to get a breathe of fresh air like this every now and then.\\n\\n\r\nOverall - I know I said this already but I wish it were more like Amagami SS. Though I will give it pointers for being like it in a sense. How many times do you actually get to see the main characters go for each of the girls rather than just one. I sit there most of the time and just sigh. Not the girl I wanted him to end up with.... (Great example :P) Anyways I still have a couple of episodes left of this wonderful series. I can exactly rate this yet since it's not over yet. But for right now I give it an 8 for being exactly what I need at this given time in my life :)",
            "date": "2013-06-01T02:52:00+00:00",
            "helpful_count": 12,
            "mal_id": 99259,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146213.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nano-kun",
                "username": "Nano-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=99259"
        },
        {
            "content": "Well this series kind of felt boring for me since the romance wasn't really that developed. It's like Amagami except that the girls fall in love a lot easier and well... the guy just takes pictures of the various heroines in each route.\r\nI personally think that the whole point of this show is really just focusing about taking the photos of the girlfriends in each episodes as the title suggests Photokano which means Photo Girlfriend. \r\nI wouldn't really recommend this series but if you have lots of free time and like romance genre, you can try watching this and might come like it but whoknows...",
            "date": "2013-06-10T00:54:00+00:00",
            "helpful_count": 10,
            "mal_id": 100543,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2688013.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/crrstle",
                "username": "crrstle"
            },
            "url": "https://myanimelist.net/reviews.php?id=100543"
        },
        {
            "content": "Applause for the girls, they're like a tool to use and getting expired after he says \"I love you\".\r\nI hate it more, just because Madhouse disappointed me. The thing is they're got the wrong show to make money for.\r\nOkay if you're going to say WHY you're making a review in only an 8 episodes done. Let me say, this show hasn't been something to look forward to, other than seeing the girls. So i thought why not, girls will keep coming in the end.\r\nThe jumping from one to another girl. That's something should develop that guy. I'd say it's a developing BUT it's not, becausehe always taking the same pictures but with a different girls. And how he take the picture is simply saying \"always look at me, i'm the good guy, can i take pictures now?\" and the girls keep saying \"why not i trust you\" (THAT SUCKS) . \\n\\n\r\nFolks that's Photokano doing its thing. To make that guy loving his thing. (Which is taking pictures of girls with mostly swimsuits or anything they got on, it'll do), so he could be a great Photographer.\\n\r\nHe joined a club or class Photography with 3 guys and 1 girls. The main thing of the club is to take girls pictures. (Fan-services). Every time he ends with a girl, you'll start to think this is the end scene of the series.\\n\\n\r\nLet's talk about \"the trust\" which is always comes from back then, when they were kids!. And he never stick with one girl, he's only acting cool and the girls trusted him as person whom they met when they were kids. Is that the trust? seemingly NO it is not.\\n\\n\r\nCharacters are the worst personalities you'll ever see. The main character is a bit annoying for me, the annoying part is, he keeps doing the same thing. The other characters aren't something special and they haven't got the light as the main character yet, they're only a reminder characters. (I mean the guys only)\\n\r\nThe girls are tools as i said before.\\n\\n\r\nArt: School backgrounds (mostly) which is a common thing, and sometimes out of the school. Still nothing special. \\n\\n\r\nOverall: I'd rather watch some Hentai, other than watching this crap. I haven't got any interest, at all. I wish i could, but i'm not.\\n",
            "date": "2013-05-31T16:18:00+00:00",
            "helpful_count": 9,
            "mal_id": 99173,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1167295.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Onsaki",
                "username": "Onsaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=99173"
        },
        {
            "content": "I thought it was decent, the first four episodes set it up pretty well, because it had also served as the common \"Arc\" for the rest, however because it was based off of a dating game, the rest of the episodes didn't have very much depth to them.\r\n I didn't mind the idea, in fact I liked how they made the series treat the other girls as canon as he \"did their route\" but they condensed each story into one episode with the exception of one character in which they gave her two episodes and of course she felt more round than the others becauseof that.\\n\r\n They could've made multiple episodes for how he eventually gets to date each character however they had not, so the episodes felt very rushed for them instead and thus the relationship that grew between the protagonist and each of the girls didn't feel very in-depth.\\n\r\nIts a short series (13 episodes) but I don't really mind short series because to me it depends on what or how they cover the content, but trying to cover all of the girls in such a short amount of time is definitely going to make it feel rushed.\\n\r\nIn the majority of the series as he explored each character, the drama was not very well either, it just seemed like each character had one problem that he helped them with in order to win them over. I am a large fan of romantic anime and before I was watching this I was fed up with anime that was just a giant cock-tease throughout the entire series, If I probably wasn't hoping to find something in which the main character had gotten with a female character(s) then this would have received a lower score from me.\\n\\n\r\nTLDR; If you like an anime in which the protagonist actually makes things happen with the female characters, this one may be for you. The series however due to its length is not very in-depth with its development.",
            "date": "2013-07-11T09:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 104845,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2414867.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ace0fspad3s",
                "username": "ace0fspad3s"
            },
            "url": "https://myanimelist.net/reviews.php?id=104845"
        },
        {
            "content": "Photokano was described as the spiritual successor to Amagami SS prior to it's airing.  This fact alone made wanting to watch Photokano appealing.  However, in the end, this particular anime did not satisfy the romantic in me and likely not in you.  \r\nStory:\r\nThe story is an omnibus format which simply means the show is split into stand alone arcs.  This is arguable the biggest flaw. There are simply not enough episodes to flesh out any meaning in the relationships given the number of heroines.  Being a romance at it's core, Photokano does a very average job in capturing the emotionsof the audience in any meaningful way.  The relationships are bland and the transition from bonding to falling in love happens in a matter of transitions throughout a 20 minutes episode.  It takes the fun and joy out of watching the relationship develop.  More importantly, you can't connect with the couple to be.  Additionally, it seems that too much emphasis was placed on seduction and eroticism during the photo sessions.  Not a bad thing I suppose, but did seem really out of place.  \\n\\n\r\nArt:\\n\r\nNo way this is Madhouse! In all seriousness, the art is fairly lackluster.  The backgrounds are stagnant and everything has a very dull feeling to it.  There are inconsistencies between episodes unfortunately. The only really stand out part about the animation comes when you get the behind the viewfinder approach.  The still image which Maeda takes are usually a pleasure to look at.  \\n\\n\r\nSound:\\n\r\nThe most redeeming aspect of this show was the music.  Although not wonderful, the BGM pieces are appropriate and easy on the ears.  The OP and ED are well placed.  I personally don't have any major complaints with the voice acting.  Given the bland story and development, there weren't any of those \"moments\" were you find yourself sucked into the dialogue for any period of time to later find yourself appreciating the voice acting or more superficially that character. \\n\\n\r\nCharacters:\\n\r\nThe characters...the characters were, again, nothing special.  It's suppose to be a romance.  If you can't bond to a heroine or say the coveted \"best girl\" then what's the point.  Although a very subjective remark, it is somewhat important in this category.  Each heroine has their own issue and Maeda helps them overcome to live a happier and brighter high school life.  While nothing expressly makes one particular character bad, there is nothing that makes them good either.  Add in the transition found in the finale and all hope is about lost.  I would have to say the character that was the most interesting, being Yuuko, was never given an arc. The entire photography club is annoying to say the least and their efforts are repeated so many times it just adds to the displeasure of seeing them on screen.  I will say the president of said club did make the episode previews...unique.   \\n\\n\r\nEnjoyment: \\n\r\nIt's unfortunate that this show never really took off.  The four starter episodes gave a false hope to an already struggling show in the romance department.  It failed at where it should accel,  the relationships.  If wanting to watch a school romance is the lure that brought you to Photokano then I do suggest picking something that is more likely to make an impression on you.  Although my personal rating of Amagami SS may be very high, I do believe it is a very well done school romance anime that you should enjoy given the appeal the this genre has already to you. Yosuga no Sora may be another option however it is much more...adult.",
            "date": "2013-06-29T00:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 102947,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/429216.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/IZEROII",
                "username": "IZEROII"
            },
            "url": "https://myanimelist.net/reviews.php?id=102947"
        },
        {
            "content": "Photokano is one of the few anime I know that are depicted in the omnibus format; the other 2 being Amagami SS and  Yosuga no Sora. I was pretty surprised.  It was better than I thought it would be, but it could still use some work.\r\nStory: 8\r\nWhat can I say? The series is based on a dating sim. The story is that of the typical dating sim game plot. But how the protagonist started his whole romance life because of a hand-me-down camera his dad gave him was original, as far as I'm concerned. Other than that, the rest is pretty standard: \r\n1.Talk to the girl\\n\r\n2. Earn her friendship \\n\r\n3. Find out her life problem\\n\r\n4. Fix whatever the problem is\\n\r\n5. Falls in love \\n\\n\r\nArt: 6 / Animation: 7\\n\\n\r\nHonestly, the art could have used some work. It isn't exactly a pain to look at, nor is it appealing in any way. But it's just fine the way it is, and te art doesn't falter. Animation is pretty decent too.\\n\\n\r\nSound: 6\\n\\n\r\nNothing special to note here. The OP was alright, but it wasn't catchy. The voice acting is okay. But other than that, no complaints on the sound.\\n\\n\r\nEnjoyment: 9\\n\\n\r\nI love me a good romance story, so my score here might be a little biased. Omnibus format anime are hard to come across, and there are only 2 good ones (Ones mentioned above) After seeing the outcome of the story, you'll want to find out what happens in the next story. I guess that's where most of the enjoyment lies. \\n\\n\r\nOverall:  8\\n\\n\r\nIf you want a serious anime with a good amount of drama and romance, this one isn't exactly for you. It's a light-hearted  romance story involving multiple in alternate stories. The art and sound aren't that notable. If you loved Amagami SS, this one bears many similarities (But won't be as good) and I'm sure you'll like it too.",
            "date": "2013-06-05T04:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 99863,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2189923.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KaiserLos24",
                "username": "KaiserLos24"
            },
            "url": "https://myanimelist.net/reviews.php?id=99863"
        },
        {
            "content": "this Anime is pretty fucking underrated than I expected, I will make a comparison here so deal with it, for instance, Tonari no Kaibutsu-kun as we all know is about a pair of couple named Shizuku and Haru, Shizuku in general is pretty fucking weird who only focused on studying, but I can deal with that, while on the other hand, Haru is completely fucked up who only do what he wants and not giving a shit about what others think, if he wants to punch a guy with his friends, he will do it despite the fact that he might get beaten afterwards, that'sjust how fucked he is, you can say that I just fucking hate his guts, their story in general is a rom-com that most of who watched it liked, I get it, it's pretty fucking funny and interesting, but it gets old when it happens every fucking time, they meet, they learned a lot about each other in the process, they think they're falling in love with each other, then they get to the point that they do love each other, but then they give up on that idea, then they do get to that point, they they not again, I admit I got annoyed and decided just to finish this Anime because I'm halfway through, and the Anime finished with both of them not ending up with other, what the fuck?! I watched it with that idea where they end up with each other but they didn't because Haru is fucking Autistic, but it got a pretty decent score while PHOTOKANO DONT! what the fuck is wrong with these people?! They fucking liked Tonari no Kaibutsu-kun with that ending, but PHOTOKANO where all the heroines get their happy fucking ending DONT! It might be short but they produced happy fucking endings! Where is the justice there?! you might get offended but I just want this Anime to get that score it deserves, some of you might understand, some might not. This is just my honest opinion, It's HAREM! I ain't gonna explain more shit.",
            "date": "2015-06-13T21:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 190259,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/467095.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vanillax04",
                "username": "Vanillax04"
            },
            "url": "https://myanimelist.net/reviews.php?id=190259"
        },
        {
            "content": "I called luck.... and it's a win...\r\nCause it all make sense...\r\nHe end up with all of them.. in every route.. (especially his sister???? better not involve her with this)\r\nBest to update the route (Ep. 8 i wish it's much longer than the rest)\r\nA kind of photograph which could tell that your youth had just about to start..\r\na kind of shot... which hold a secrets that hold us together... Well i'd say the anime is a very simple romcom, where a boy encounters a girl... In other words even we don't need a better strong story or any kind of gestures that attains much more mutual..There are few details which missed from the game (Even i didn't know all of it)... Especially guy like him.. who's known to be dream as a photographer... To be honest... the last episode isn't really the ending... mostly it's like a secret event... that people don't know anything.. Like i said.. the different route where much better than the common route itself.. well if you're into the canonized girl... Like Amagami SS.. this could make your series picked which he wants to end up with..\\n\r\nand before that, you\"ll know already who's the most dearest to him..\\n\\n\r\nAn underrated series.. which did not appeal but the series itself is still good..\\n\r\nwhether if your into omnibus format like this one.. This chill your mind and beats all of your mood...\\n\\n\\n\\n",
            "date": "2017-01-27T08:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 239232,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5472966.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HikiNEET021",
                "username": "HikiNEET021"
            },
            "url": "https://myanimelist.net/reviews.php?id=239232"
        },
        {
            "content": "I thought it was really great and cute but then as i got further into the eps i felt like i was watching amagami ss all over again. Dont get me wrong they are both good animes, but all i know is that if you really like amagami ss and want to watch something almost identicall, then photokano is your anime. Of course there are some differences, and the first few eps would catch your attention if your into love dramas. Its nice.",
            "date": "2013-05-29T17:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 98899,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2638145.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/soupsane",
                "username": "soupsane"
            },
            "url": "https://myanimelist.net/reviews.php?id=98899"
        },
        {
            "content": "WARNING SPOILERS ARE CONTAINED (Last Paragraph)\r\n^^^^^^^^^^^^^^^^^^^^^^^^^\r\nOhhh boy, here we go, Kazuya, a mild-mannered high school sophomore receives a gift (Camera) from his father. Kazuya begins to take pictures of a-lot of things he find as a \"Photo Opportunity\". The club leader of the Photography club spots Kazuya and wants to recruit him. However, he only wants to recruit him for perverted reasons since Kazuya knows some popular girls and can get some dirty pictures out of them for the perverted Photography club. That's basically the main story (So far).\r\nTo be honest here, this is one of the most stereotypical cliche Animes I have ever watched.To me, this anime is just another Harem Slice of life Cliche Moe Anime. What the Anime to me is about a guy trying to protect girls \"purity\" from his perverted club members, however takes erotic pictures of the girls he's \"protecting\". Not to mention he sexually harasses the girls (Or atleast I think he does) by touching their boobies, taking photos without first asking, and blackmailing the student president for what he wants, but I guess it's okay since THE GIRLS DO NOTHING ABOUT IT. And since it's just another Slice of life Harem, you'd think there is comedy, BUT NO! There is none at all! Maybe if comedy was constantly having the main character sexually assaulting \"by accident\" and taking erotic photos of the girls. Really though, this anime is nothing but fan service to me.\\n\\n\r\nThere is one character in this Anime that is pretty interesting, however, her story is ALSO CLICHE ( in my opinion). She wants to be another girl. I might change my mind on her and this anime later in the series, but for now, i'm completely dissapointed. And after watching 10 minutes of episode 5, Kazuya was put into an sad mood from some stupid rumor and a guy asking out the girl he likes (Nimii-san), he thinks he's not \"worthy\" enough to be with her. I can't do this, I dropped this.",
            "date": "2013-07-07T03:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 104215,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2830085.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EIsword",
                "username": "EIsword"
            },
            "url": "https://myanimelist.net/reviews.php?id=104215"
        },
        {
            "content": "This anime is one of the worst i've ever seen and i didn't just watch one episode. I watched eight, yes i wasted a good couple of hours sitting and wasting my time on this. Ok, its based on a game and to be fair, when you're watching it, it feels as if you were playing a videogame. But if i wanted to play i videogame i would have bought the videogame.\r\nNow, lets start by saying that the music in this show is the most intrusive music ever, you cant focus on the utterly pathetic dialogue and almost non existent but most certainly dreadful plotbecause there is this arrythmic clown-like music playing at a volume and speed that will probably annoy you to the point where you just want to stop watching the show.\\n\r\nThe dialogue...oh, the dialogue. I just cant imagine this crap bien written by anything else than a undeveloped monkey that is high on acid, forced to write. \\n\r\nSo, i wont say much more, but this is just my opinion and i dont want to make it too long so yeah. This show is just. Bad",
            "date": "2014-04-21T15:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 140793,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3117603.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Chilz",
                "username": "Chilz"
            },
            "url": "https://myanimelist.net/reviews.php?id=140793"
        },
        {
            "content": "Well, it's been a while since I wrote a review on MAL, but since I've got nothing to do now, I thought I'd do one.\r\nNow, this is gonna be a fun one to write. Photokano has been on my radar for quite some time now for several reasons: 1) It's by Madhouse, 2) but it's got a pretty mediocre score, and of course 3) just because it's got Ecchi as a genre. Well, what can I say? I am a guy after all and I ain't gonna miss out on some 'nice' shots that I may come across. And speaking of nice shots, it reallyfits the topic of this review because Photokano actually is about a guy who got a camera passed down from his father.\\n\\n\r\nFirst, let's get it out there regarding the best thing about this anime. Being a product of Madhouse, I am happy to say that this anime has got some fantastic shots. The animation technique commonly used by slowly panning the camera around the girls make for some beautiful and undeniably sexy collections. Not to mention, it is a good thing Madhouse did not slack on the art quality. Added detail definitely puts this anime ahead on the ecchi ranks. There should be more than enough reason for me to consider this a decent guilty pleasure anime. Unfortunately, almost everything else about this anime just ruins that potential.\\n\\n\r\nHave you heard of an anime called Amagami SS? Basically, it is an anime that follows a guy named Juunichi and he falls in love with 6 different girls. How does that work? The anime is separated into 6 different arcs spanning 24 episodes with each arc focusing on 1 of the 6 girls, showcasing alternate possibilities for Juunichi's romance. In essence, it was the perfect solution to adapting a visual novel with all the different routes being shown in anime form. Now, take that concept of Amagami SS, increase the number of girls from 6 to 8, and half the number of episodes, and you get Photokano. Do you see the problem here?\\n\\n\r\nThe first 4 episodes were basically an introduction to the setting of the anime. This phase was alright because it does give us a general understanding of each character. We are also introduced to the main character Kazuya. His introduction was as bland as it gets. We know very little about him, his ambitions and such, and his personality is just contradictory the more the anime goes on. He gets dragged into The Photography Club, which is interesting in its own way because of its members. And while the club does create some highlight moments, their significance in the anime seemed kinda lacking. And with the exception of Haruka, every other girl gets literally just 1 episode in the spotlight. And from this point on, just get ready for some random ramblings as I recollect my thoughts about each arc.\\n\\n\r\nIf we're talking about rushing, Photokano has got that covered. What's even more painful is that we have to go through that process 8 freaking times. An extra episode for Haruka's arc didn't help much because of another problem: This anime is awful at handling drama. This was particularly evident in Haruka's and Nonoka's arcs. With so little time to set up these personal conflicts, the drama just comes off as out of place and sometimes even laughable. That brings about another atrocity: Character Overreactions. While this is most evident during dramatic moments, the biggest crime involves Aki Muroto. If this is the best the anime can depict her as being STRICT, then this anime has failed tremendously. I've seen many strict student council presidents in anime, and Muroto would be considered tame amongst many. In fact, she had every freaking right to lecture the accused because of clear solid evidence. And the way she was treated by Kazuya makes me want to smack this jerk in the head. By the way, what I meant earlier about Kazuya's personality being contradictory can be summed up as 'The closer the girl is to Kazuya, the less aggressive he is'. It makes absolutely no sense that Kazuya would be a dense idiot towards his childhood friends but somehow being so persistent with someone as hard to get as Hikari Sanehara. Though I will say that the best backstory was in Sanehara's arc. If only that quality was prevalent in the other arcs. And while my personal favourite arc was Tomoe Misumi's arc, it was still bogged down because this anime is just too damn short for its own good. To be perfectly honest, there is very little variation between arcs. And because of that, it's not surprising that the anime felt unnecessarily repetitive and boring after a while. While it is nice to see a happy ending for every girl, there really isn't much point if every one of these arcs just feels so empty and hollow.\\n\\n\r\nAnd then the icing on the cake, the fact that they pulled out that trope between the relationship of the two individuals in Episode 13. Seriously, is this a common occurrence in Japan or just a fantasy that every Japanese individual have? I have seen it pop out in so many anime and I am honestly getting sick of it at this point. By the way, I'm referring to how the characters are related, not what they decided to do.\\n\\n\r\nI guess I was less surprised once I found out the director and series composer of this anime would later direct Cutie Honey Universe, which I have dropped after 3 episodes. Photokano is an anime that had all the elements to be a decent romance series but everything about it just screams BAD DECISIONS. If you seriously don't mind the story at all, then by all means go ahead and check this out because Madhouse did great work with the fanservice. But honestly, I would not recommend this anime even for that because you can't very well ignore its attempt of creating romances, which it takes seriously but by no means competently. If anything, I would rather you check out Amagami SS which I have mentioned because it still has some nice fanservice moments but its character arcs are heaps more developed than this.\\n\\n\r\nSeriously, there are two ways this anime could have been improved:\\n\r\n1) INCREASE THE NUMBER OF EPISODES\\n\r\n2) DECREASE THE NUMBER OF LOVE INTERESTS",
            "date": "2019-04-22T22:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 306943,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6028087.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Eugenefindit",
                "username": "Eugenefindit"
            },
            "url": "https://myanimelist.net/reviews.php?id=306943"
        },
        {
            "content": "Harem anime offer a multitude of aspects for a viewer to enjoy when watching one. Viewers are offered what`s essentially a line-up of different female characters (or males for the reverse genre) who tend to all follow a certain archetype that`s become fairly common in most genres of moe-blob, and slice of life shows, and almost staple to visual novel adaptations. Given that the characters are interesting enough, with a sensible plot behind them, anyone can find at least one character who found themselves enjoying the time of day given to that one specific character, even though that, canonically, the main girl will be chosenin the end. But the overall experience can be enhanced when the show offers a good sense of humor, nice presentation, and interesting character designs. What happens when all of that is achieved, but it fails horribly? Photokano.\\n\\n\r\nWhat is unfortunately considered the spiritual successor to the more successful game, and subsequently more successful anime, Amagami SS, Photokano attempts to take the same direction but with what is arguably a better studio, Madhouse. What this means is that this is almost guaranteed a visually appealing show, which it actually does accomplish. There are multiple scenes where the studio can show off its budget and skill of animation, and create a pseudo-3D scene when the characters themselves are just drawn in. Photokano also inherits the style and character designs from its earlier games, KimiKiss and Amagami. The characters themselves are vaguely original in design, and they don`t try too hard to adhere strictly to their respective archetypes (i.e. the tsundere, the little sister, the childhood friend) by not actually shoving that fact in the viewers` face. \\n\\n\r\nThe overall theme of the show is that of a camera, where the main character obtains one and begins his journey of self-discovery through his newly acquired `new look` at the world around him. This also gives the show a unique excuse to include ecchi scenes and panty shots left and right. A clever aspect to the show is the overall setup of the rest of the series. In the early episodes, most, if not all, of that `flags` for the girls are setup n what can be considered subtle, and not out of place or awkward in writing. This gives somewhat of a justification for the following `arcs` that the show presents itself in. \\n\\n\r\nHowever, the problem with Photokano lies in its delivery, in that there is none. The character flags are set up in the near beginning, the setting with the Photography Club is created, and the main character isn`t a terribly boring and generic person. But what comes to follow is essentially a string of one episode arcs, where each episode is dedicated to one girl. The camera motif is quickly rendered meaningless because the (very few) character dynamics have almost nothing to do with the theme of the camera itself. The secondary characters, who are the members of the Photography Club fall flat after their introductions (which is unfortunate because one of them is voiced by Shiraishi Minoru) and are never developed. The final and most important flaw of the show lies in the girls. While the show can cleverly jump from arc to arc, there is absolutely no time for any characters to be developed. All that can be presented in the end is a character trait, like one`s love for food, or the other`s stoicism, and then immediately tries to force false character development in the span of 10-15 minutes. \\n\\n\r\nAnything and everything that was set up by the beginning of the show, which was in all fairness actually not that bad, is completely stunted and abandoned. In its attempt to try and accomplish what Amagami SS did, which had roughly 40 episodes total when OVAs are included with each girl getting at least 3-4 episodes each, Photokano hurts itself by spreading itself too thin. Sadly, the only problem really was the length of the show.\\n\\n\r\nArt & Animation: 9/10 - Madhouse sure knows how to show off when they can do a pseudo-3D space camera trick. Good colors, good backgrounds, nice shading when the detail is there.\\n\\n\r\nSound: 7/10 - While voice acting is nothing special in this show, the music tends to stand out for at least 2 or 3 tracks when things get serious in mood.\\n\\n\r\nStory: 5/10 - It`s a shame to say that time restrictions are whats holding back nearly everything about that show, even though that isn`t saying much to begin with, but it`s the truth and the story suffers for it.\\n\\n\r\nCharacter: 3/10 - There are nice designs for the girls, and some of the secondary characters look pretty nice, but style only goes so far when the characters are literally paper thin and shallow.\\n\\n\r\nValue: 2 - Nothing too meta or self-aware about the show, and no significant impact on the industry other than being an attempt at what Amagami was.\\n\\n\r\nEnjoyment: 5 - Personally, I wanted to like the show. There was just no real chance to.",
            "date": "2014-01-15T04:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 128863,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Arizzle",
                "username": "Arizzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=128863"
        }
    ],
    [
        {
            "content": "Before watching this anime, you should know the definition of \"omnibus format\". The omnibus format main purpose is to dismantle harem genre anime such that the protagonist is able to have romantic developments with the multiple different chosen candidate without having a dispute between each other. One famous example would be the Amagami SS.\r\nAmagami SS was the first anime that adopted the style \"Omnibus Format\". Each heroine had 4 episodes arc in which their romantic confrontation was completed. By each confront's conclusion, the universe would reset to the initial world for the next heroine's romantic confrontation to begin. All memories of moments that happened duringthe 4-episode arc are also wiped. Photokano was successful in doing the same style.\\n\\n\r\nHowever, Photokano which was aired in an omnibus format, used a different approach compared to Amagami SS. It used an introductory arc to let the viewers know more about the characters. Then, it approaches to appeal the viewers using the omnibus format.\\n\\n\r\nMany would think that one or two episodes for each character may be too short. I might have to disagree with that.\\n\\n\r\nThe few episodes duration was enough. Even with the short duration, they've managed to deliver a well-developed character progress. Each heroine has drastically improve their relationship with the protagonist. Remember, at the end, the anime only has 13 episodes, with about half has been taken off for the introduction arc. If you're looking for a fully developed romantic anime, this place is not for you, please leave.\\n\\n\r\nOne thing I would like to mention which is the introduction arc. It's not very appealing and is superficial in expressing the show to its viewers. When I began watching this show, I was expecting this show might not produce great results. Although the omnibus format truly surprised me, the introduction arc didn't cause a great impact on me to continue watching it. In the end, one would think it's just an introduction. If the introduction were juicy, will it affect the main story and the climax? Ultimately, the decision lies on the viewers. For me, I'm fine with the advancement they used.\\n\\n\r\nBut again, this anime doesn't have many advantages. The only think I like is that they surprised me with using the omnibus format and the acceptable character development within such short duration. Other than that, I wouldn't say I'm very interested in the most other areas of the show. \\n\\n\r\nIn a nutshell, this anime is designed specially for people who are looking for an omnibus format style anime. If you like Amagami SS , this could be a wonderful gem for you. However, if you prefer a fully detailed romance anime, I suggest you drop this anime immediately.\\n\\n\r\nPlease note: You're suppose to give your feedback whether this review is helpful or not. Even if this review has its flaws but is helpful, you should choose the appropriate answer. Well, I'll leave that up to you. Good day, peeps!",
            "date": "2013-07-01T10:16:00+00:00",
            "helpful_count": 243,
            "mal_id": 103305,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/562817.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/darkj25",
                "username": "darkj25"
            },
            "url": "https://myanimelist.net/reviews.php?id=103305"
        },
        {
            "content": "Well, what do we have here. It's PhotoKano, a series based off the dating game of the same name. The series focuses on this young boy named Kazuya Maeda who happens to be a high school student enjoying the youth of his life. Perhaps he is enjoying it too much though with that little toy of his. It's a camera and used to capture memories through its lenses. With imagination, you can discover magic through a camera. But that's just all an imagination because in PhotoKano, magic doesn't exist. Rather, there exists many girls who wants to pose for you in lascivious positions just wantingto capture those 'memories'. Honestly, this series is definitely something that I don't want to be part of my memories.\\n\\n\r\nNow for starters, the anime series is adapted from a dating sim developed by Dingo and Enterbrain. The way it structures its series is a bit bizarre as rather than a linear storyline, it focuses on our lucky protagonist-kun who is involved in several arcs each with a different girl whom gets acquainted with him. But hey, that's just high school life right? It's all about teenagers getting involved in romance angles and creating drama. Well, the thing here is that Kazuya, the protagonist becomes the chick magnet who somehow is not only be able to attract the various girls in this show but also get them to do pose in seductive positions. Talk about having a lucky life.\\n\\n\r\nWell, there are some basic merits to this show. For instance, there's the Photography Club who invites Kazuya to join as a member. The club itself is made up of guys who likes nothing more than capturing those seductive photos of girls and making them worth a thousand words. Kazuya on the other hand seems to be the easy-going guy who is able to make friends with both guys and girls like a day in the park. The catch here is that as a bonus, he is able to take pictures of girls with his camera. It's making friends, taking seductive photo-shoots, and striking relationships all in one package of this lucky guy.\\n\\n\r\nFor some reason, the girls of this show only allows Kazuya to take pictures of them in those seductive poses. Why? That's probably a magical question beyond what I can comprehend. Perhaps it's because of his easy going personality. But wait, the guy doesn't seem to have a clue what to do with the girls he hangs out most of the time. Rather than just 'hanging out', the girls of this show all seems to be interested in the boy for reasons beyond just 'taking photographs'. Kazuya on the other hand plays the follower and goes with the flow. Sometimes, this lands him into trouble as he is accidentally labeled as  a 'pervert'. Despite Kazuya trying to negate these situations, they just happen to come by like pouring rain with the compromising positions, accidental kisses, and even other situations where he doesn't want to be in. Ugh.\\n\\n\r\nThe series falls under many of the cliched themes of an ecchi/romantic romance. There's the childhood love, the beach episodes (more than just one of them actually), various confessions, and the obvious fan service. Speaking of which, the fan service of this show is thrown at your face literally every episode. There's the panty shots, the suggestive poses, the swimsuits, and camera angles. The OP song even focuses this as if it''s some sort of art. Then, there's the camera shots that focuses more than just painting a memory. Rather, it points at the various angles of the camera at suggestive body parts. Again, Kazuya is having the fun of his time.\\n\\n\r\nAt some point, I just decided to watch this series for the sake of a possible deeper story to develop. Unfortunately, the plot of PhotoKano is more dry than sands of the beach. It doesn't progress and makes little sense. For whatever reason, Kazuya is like a bachelor and whether he likes it or not, he gets the attention of the girls through his charms. At many points, the boy isn't even trying and girls are allowing him to take suggestive photographs of them. Then, there's the love confessions and lovey dovey scenes that follows. Oh and no one is safe either. Whether you're a class president, an athlete, a school beauty, an imouto type, childhood friend, or the shyest girl on Earth. No girl is safe from Kazuya's 'charms'. NO ONE. Once you're part of the route, expect romance to pop out of nowhere.\\n\\n\r\nWell at various points, I try to dig out something out of this series. I mean, there has to be something that can attract the viewers right? The artwork might be part of that from what I originally thought but it's nothing at all attractive. Rather, it's generic, standard, and poorly constructed. The school uniforms are all generic and nothing stands out. It's not even unique in the sense of being attractive. Rather, it's typical and hardly memorable. The soundtrack isn't any better as the OST itself hardly makes an impression. The OP song \"Koisuru Lens\" by Kaori Hayato clearly matches the theme of the series through those lens of the camera. Only problem is that it seems Kazuya isn't getting any highlights in it. Rather, the girls are the main course of the dish and gives those delicious poses. \\n\\n\r\nTo conclude, this series is something crafted out of a weak plot, with weakly developed characters, and a lackluster premise that makes it a dull experience. The main male protagonist is dull anyways so nothing else new to see there. It doesn't help with the lackluster soundtrack or the artwork. On a positive note though, the series does have a variety of characters to watch and see how they interact with Kazuya. Unfortunately, it all ends with predictable results that spells out what a cliched series this is. I can't recommend PhotoKano to anyone, not unless you enjoy photography or something in animated form. But then again, it makes fun of that in a lascivious way of an attempt to spark interest. It tries too HARD and this was one series that I had a HARD time getting through. But if you really want to try this out, then the ball's in your court.",
            "date": "2013-07-02T11:42:00+00:00",
            "helpful_count": 135,
            "mal_id": 103469,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=103469"
        },
        {
            "content": "I've made another review. The original one (the one I wrote at six episodes out of ten) is below.\r\n~ Completed Review ~\r\nPhoto Kano was definitely a disappointment. The first few episodes led me on, it suggested potential that was definitely never realized. And that, makes me sad. It makes me sad because Photo Kano was something that I had actually looked forward to watching - that implementation of photography, actually really interested me. The art and character design, were actually appealing. The opening, wasn’t amazing, but it was better than average. It was potential. From the very first episode, I felt some, if any potential.Aand, it’s gone.\\n\\n\r\nOriginally, I was going to blame the series’ lost potential on what I thought was a stupid idea. Doing one character arc per episode, omnibus style, is just a horrible idea. Everything gets so packed together and compressed that it’s just a massive outflow of information and emotions, and nothing is really developed, information is just being thrown at you. Ironically, this came to mind not after I had finished Photo Kano, but halfway in, at the sixth episode. Seems like my prediction was right. It was a bad idea. This series, is a great example of an anime that had too little time to voice it’s story, and I know for a fact that had Photo Kano been given more time, it wouldn't have turned out as bad as it did. But with nine heroines, what can they really do? Two episodes per heroine, like what we say with Amagami SS+, would be alright, but that would make the anime 18 episodes long. And that would have been great, if they had 18 episodes to work with. But they didn't. And that’s a shame.\\n\\n\r\nBecause the story was a good concept. I know that’s ample praise for a story that spawned from a dating sim, but it had decent potential as a story - it was just poorly executed because of a lack of time. Granted, it’s not an awesome story, but it wasn’t terrible. The photography element is really what made the anime interesting for me. It’s mildly rare to find photography posing itself as a major plot point in any anime, so Photo Kano caught my eye. What’s unfortunate about this though, is that the element of photography, is rarely seen properly expressed in the anime. It’s like it’s an excuse for the anime to show lewd scenes of Kazuya’s lady friends. It’s really only there to connect the hero to his heroines, in some form or another. But then again, I suppose this is exactly what Photo Kano wanted to do, and in this, it serves it’s purpose well. As a guy with a soft spot for cameras and photography, I was kinda disappointed in the fact that photography isn't really a main element in this anime, it just kinda opened up the stage for the love stories between the hero and the heroines. The thing is though, it’s not like the arcs were even that good - they were just average, like the rest of the anime. The love stories were at best, rushed and executed poorly. And although it’s mildly bad to stuff a character’s arc in a single episode, it’s even worse to introduce said character in their debut episode, finish their arc, and never show them again. And it’s not like these were short-but-sweet stories either, they were basically supercompressed versions of what they should have been, a very summative conclusion of a story that should have really lasted two to four episodes. What makes it worse, is that even if these arcs did last two to four episodes, they would be alright at best.\\n\\n\r\nAnd that, is pretty unfortunate, because the way that these said heroines were drawn, is actually quite good - they’re all really cute (sorry) and adorable (again, sorry), and I really feel like I want to set them as my wallpaper. They’re all well realized. But then again, this is 2013, and it’s not uncommon to see an anime that has been drawn quite well. The BGM and theme songs were alright too, and like the animation, were pretty average for today’s time. The opening didn’t really strike me as being excellent, but it’s not terrible. The ending, is pretty generic, but I suppose that’s alright. It’s hard to judge an anime on it’s music, as if you screw that up, you’ve failed hardcore. The same goes for the BGM, it’s alright, but nothing more.\\n\\n\r\nIf there was one thing that was generic, it has to be the cast. Lets face it, every single friggin anime has a childhood friend heroine, and Photo Kano isn’t any exception. Let’s do a quick checklist. Cute imouto? Check. Tsundere? Check. Quiet girl who rarely smiles? Check. Childhood friend? Check. Athletic, over the top, enthusiastic sports chick? Check. Shy girl with massive tits? Check. There you have it, the most generic friggin cast of heroines I have ever seen, at least at face-level. They’re not too bad once they’re developed. Oh yeah, totally forgot, I can't remember anything about them because Photo Kano merely threw facts at my face for nine episodes. But what I find definitively weird, is the fact that despite having a really generic cast, I still enjoyed them. I still liked the execution of their respective stories.\\n\\n\r\nIn conclusion, it’s pretty easy to quickly summate Photo Kano. It’s a poorly executed slightly-above-average story. That’s all it is. And had it been given say, a nice 25 episodes, it would still be slightly above average at best. And what’s unfortunate is that it didn’t get 25 episodes. It got 13. What emphasizes it’s poor quality, is the fact that it had a decent start. It led me on, brought my hopes up, and crashed them down. But what I still can’t understand, is why I enjoyed it too much.\\n\\n\r\nMaybe I’m just a pervert.\\n\\n\r\n...\\n\\n\\n\r\n...\\n\\n\\n\r\nNaaaah.\\n\\n\\n\r\n~ Original Review ~\\n\\n\r\nI feel like I'm enjoying this show way too much for what it is.\\n\\n\r\nBecause really, the plot is pretty average, the humor isn't really funny at all, and the development of the characters is just straight-up not there. It's pretty average. So, I guess you could assume that the rest of the anime is pretty bad too - which is where you'd probably be wrong. For some reason, it's really quite well animated, everyone is drawn really cute, and everything flows pretty nicely. Not only are the characters drawn really well, it's not the stereotypical fanservicey type of art where you basically have a face and various styles and colors of hair, the characters are genuinely drawn pretty well. The soundtrack's alright as well, it's not bad, but in some places, I've found myself surprised at how decent it was.\\n\\n\r\nBut, I suppose, I should have seen this coming. This is an anime adaptation of a dating sim, and really, the only reason why you would be playing a dating sim, is to stare at really well drawn cute girls that you would probably never get a shot at anyways. So I suppose I shouldn't be surprised that Photo Kano is full of moments where I felt like I was literally playing a dating sim. But if there's one thing that I am surprised about, is how much I found myself enjoying those moments.\\n\\n\r\nI'm not really sure what I enjoy Photo Kano, really. Maybe it's the fact that I can see so much of myself in the main character. Then again, that's probably a selling point - the dude is practically an everyday normal guy, anybody could paint themselves onto him. That being said, I suppose you could call this a fault, because like Photo Kano itself, the guy really just doesn't seem to have anything interesting about him. That's probably why the most interesting thing about him, is actually that he gets to take lewd pics of all his cute high-school classmates.\\n\\n\r\nI suppose I should be called a pervert then, because I've enjoyed all I've complained about in the above.\\n\\n\r\nBut really, what else is there to enjoy? Because let's all admit that any plotline adapted from a dating sim is probably going to be bad. It's a shame too that it's not all to great, because the idea of using photography as a central theme is something that hasn't been tried very often, and when pulled off right, could probably make a decent storyline. It's too bad they didn't seem to even try, because the photography element is what really makes this anime what it is, or rather, what it could be. If Photo Kano was actually well produced in terms of a story, it would probably be known for highlighting photography in it's storyline.\\n\\n\r\nOf course though, we're only halfway through, so it could get better. Hopefully the storyline takes a departure from its current generalisms that Photo Kano has attempted to build it's storyline on thus far, and makes use of the unique nature of it's central theme.\\n\\n\r\nBut unfortunately, with the direction it's taking, it seems like Photo Kano is going to take the approach of telling the story of every single girl in the anime one by one - and what's bad, is that we're 6 episodes in, and we've only done cute Niimi-san, and to an extent, the student council president. That basically means the show is either going to skip half the cast, or do one girl per episode - which is going to be terrible. However, it does mean that we'll probably get to the main character's little sister soon - which I'm sure will please some viewers. She cant be that cute, right?",
            "date": "2013-05-11T00:56:00+00:00",
            "helpful_count": 54,
            "mal_id": 96691,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1115213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ressamp",
                "username": "Ressamp"
            },
            "url": "https://myanimelist.net/reviews.php?id=96691"
        },
        {
            "content": "This series is a fine example of wasted potential. When I discovered this anime I was really looking forward to watch it, I'm a great fan of romance, even the cheesy, sometimes forced, type of romance, and after learning this show used the now more popular omnibus format I defenitely had to give it a try because I was expecting something along the lines of Amagami SS which was fine by me. The idea of having a show where all the possible scenarios are depicted is in my opinion an asset because fans can't get angry with pairings since they get all of them, it'salso a plus for people who can't play the visual novel that these animes are always based off.\\n\\n\r\nThese were my initial thoughts before getting into the anime itself, obviously I didn't raise my expectations because I already knew right off the bat it wasn't gonna be as long as Amagami SS so it would most likely lack some aspects but I remained positive about it. \\n\\n\r\nFor starters we have our main character  Kazuya Maeda, a plain guy who was given a camera by his dad and now for some reason is really into photography, it got even weirder when he joins the photography club which is full of pervs, I thought this guy was going to become one but thankfully he was a nice guy with a more clear mind. From episode 1 to episode 4 there's really no plot, there's barely any story, it is literally just the main character wandering around meeting with all the female heroines and having some sort of talk with them, for 4 episodes I was unclear about what was going on, who was going to be the heroine and what arc was the anime on at the moment, there were no references whatsoever. Then begins episode 5 and then it is clear who the main character is going for, but you have to figure that out yourself, the anime does not point out anything at all. But most of us aren't stupid so even if it was like that we would still get the idea as long as we keep in mind this is an anime in omnibus format.\\n\\n\r\nAfter the first arc was complete in 2 single episodes I thought to myself: \"That's it?\" due to the lack of any more development, the characters simply just out of nowhere love each other, this was such a let down, I'm a romance enthusiast but just ending an arc like that was literally hurtful, but I'm still staying optimistic through out these episodes. Then follows episode 7 which is itself one arc, yes you heard me, ONE ARC in ONE episode, time goes back as usual and the arc ends in the same episode, the characters magically fall in love and there's almost no development in the plot and what bugs me the most is the capability of the main character to change his personality with every single girl, it's as if he's a different guy every time, he's still plain and loves photography, and that's literally how he gets every single girl every time, by taking photos of them, the show progresses with the same scheme, every single episode is an arc, with one of the main heroines which the main character gets involved with due to his photography \"skills\" and magically get together. What a disapointment was all I could say.\\n\\n\r\nI'm not going to be gloomy here because I don't like to trash talk animes I make reviews on, if i'm making a review I have to look at both sides of a show. While this show lacks in plot and story it's still fairly entertaining to see every \"what if\" scenario, but it could have given us so much more.  A show with about 8 female heroines needs to be at least 24 episodes long so each heroine can have her arc explained and developed so we get a clear insight on the whole show. The novel this series is based on is over 50 hours long in gameplay and they're shrinking it to a 12 episode long anime, that's such an injustice in my opinion. My suggestion to the production team would be to either leave out some arcs or make it a longer anime because this just feels so incomplete.\\n\\n\r\nNonetheless if you enjoyed Amagami SS this is still a decent addition, let's consider Amagami the main dish and this is the side dish, not as good but still watcheable.\\n\\n\r\nDue to the lack of plot and the blandness or genericness of the characters this show gets an overall score of 6/10. Nonetheless i want to point out that it's still enjoyable, i rated it 8/10 for enjoyment because i personally like to see all the what if scenarios and the romance, however there is so little time in each episode for each arc to develop these aspects that it might be offensive to those who enjoy real romance, if you're one of those people, this is not a show for you, but if you still want something along the lines of Amagami SS, this show is something you might want to watch.",
            "date": "2013-06-15T13:55:00+00:00",
            "helpful_count": 42,
            "mal_id": 101173,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1950132.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IdleSheep",
                "username": "IdleSheep"
            },
            "url": "https://myanimelist.net/reviews.php?id=101173"
        },
        {
            "content": "Have you ever had that situation where you love the beginning of an anime but the rest of the series doesn’t turn out too well. You get disappointed and just want to forget all the things that were bad. That is how it was with Photokano for me. \r\nThis series is about Maeda Kazuya, a normal high school boy that receives a digital camera from his father. He starts to get interested in photographing which opens a lot of doors for him.  During the series he comes across people he would never had talked to if it wasn’t for his newfound hobby.\r\nThe structure ofthis series is pretty simple. It starts off with four episodes of introduction where you get to meet all the characters. Then the series becomes arc based. This is when it becomes problematic. Every arc is focused on one of the girls that Maeda meets. During these arcs Maeda helps the girls with their problems and also starts a relationship with them. The problem here is that the arcs are very short. Most of them only last for one episode. This makes them very rushed. This structure also makes it feel like the story doesn’t progress so much.\\n\\n\r\nThe photo theme is very interesting and was the reason for me checking this series out. They did handle it pretty well although they could added a bit more of it. Again the bad structure prevents from doing this.\\n\\n\r\nThe main characters Maeda Kazuya isn’t that special of a character but he is likeable. He doesn’t have so much development or a backstory, but this works because the focus is more on the main girls. The girls are many. So many that I won’t take the time to talk about each one of them. The good thing about them is that even though they are so many they still have interesting and unique backstories. But then we do also have a problem with the amount of girls. As I said before the arcs is only one episode and that’s because every girls is going to have one. The lack of time makes them really rushed and the main character barley gets to start a relationship before he has to move on to the next girl. I think the series would have been better if it had a smaller cast of girls.\\n\\n\r\nThe series also have few supporting characters. These characters don’t get so much screen time because of the focus on the main girls. This is pretty disappointing because some of them were really good and funny. My favorite character of the series is Kudou Hiromichi, the leader of the photo club Maeda joins. He does only appear a few times during the series and most of his appearance comes from the previews which he narrates.\\n\\n\r\nI don’t have so much to say about art and animation. It holds a good standard. My favorite part was how they did the photographing. It looked nice and beautiful. One of my favorite things about this series is the great feeling you get. You feel calm and relaxed. The biggest reason for this is the background music. It is always used at the right time and set such a good tone in the scene. The voice acting was good. There weren’t any performances I didn’t like. My favorite performance in this series came from Midorikawa Hikaru who played the character I talked about earlier, Kudou Hiromichi.\\n\\n\r\nPhotokano is a series that sets high expectations that it can't live up to. It follows the classic dating sim structure which is not a bad structure, but it has to be handled well. Photokano has a great intro but has a really bad structure. In this case it's the structure that decides if this series is very good or just good. This series would have worked out a lot better if it just were longer or had a smaller cast. Even with the bad structure the series has some interesting characters and it gives a really good feeling which is the first thing that comes to my mind when I think back on Photokano.\\n",
            "date": "2014-12-04T23:41:00+00:00",
            "helpful_count": 21,
            "mal_id": 171065,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2466457.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Znatte",
                "username": "Znatte"
            },
            "url": "https://myanimelist.net/reviews.php?id=171065"
        },
        {
            "content": "Photokano is about a boy Maeda Kazuya whose father passes his old camera to him. \"Through the viewfinder\" (he says it that way), he meets girls, and told in separate episodes, develops romances with each of them. \r\nStory: 5/10\r\nThe initial premise frankly doesn't sound too bad. You are given introductory episodes where Maeda meets the heroines. After that, each of the heroines' romance stories with Maeda is told in one episode. Each route follows the same format: an encounter that puts Maeda on the girl's route, problem, resolution, confession, then ending. Because each route is crammed into one episode, everything is rushed, and abrupt developmentoccurs. It's hard to take it seriously. Especially where at the end of each episode you get the \"I like you\", \"I'm okay with you?\", *hug*, process. Admittedly, I have done other things while watching Photokano and could still grasp what had happened. Well, it's not really something to be guilty of, but it goes to show how predictable it is.\\n\\n\r\nAlthough, it's good to note that Maeda's narration puts an ample amount of interest. Though it sounds the same in each episode, it gives the impression of him breaking the fourth wall - knowing that there are possibilities with each of the girls he has met. This isn't expounded on however.\\n\\n\r\nArt: 6/10\\n\r\nNot sloppy. But not eye-catching. The best part would be the camera shots, which at least look like something that is photographed.\\n\\n\r\nSound: 6/10\\n\r\nNothing special. You hear the same thing almost every time.\\n\\n\r\nThe prolific seiyuu in the voice cast (Saito Chiwa, Kaori Mizuhashi, Sanae Itou, among others) is the only reason why I watched this. But because each girl is usually important for just two episodes, you don't get to hear your favorite seiyuu much. At least you get to hear them.\\n\\n\r\nCharacters: 4/10\\n\r\nHere we go.\\n\\n\r\nMaeda is an amateur photographer -and clearly does not have any perverted intent in his actions- . Sounds too good to be true. Although he has many perverted encounters, he has good moral character. He's that kind of guy, so I guess it's not too bad. His clubmates, led by the eccentric club president voiced by Midorikawa, are pretty much opposite to him. They are perverts who like taking perverted pictures. And they're funny. \\n\\n\r\n...\\n\r\n..\\n\r\n.\\n\\n\r\nThe heroines however, they follow common stereotypes which makes them generally...stale, personality-wise anyway. To list: Niimi Haruka is the ideal girl, Nonoka is a sports girl, Aki is the ever-so-strict student council president, Hikari is the unsmiling one, Tomoe is another unsmiling one, Rina is the ideal waifu, and Mai and Kanon satisfy the kouhai and imouto complex respectively, and inner lolicon collectively. \\n\\n\r\nProbably the only character I really cared about was Uchida, the stealth photographer, who in each episode you slightly learn more about her. Too bad she didn't get a route. Now while they are stock characters with stock personalities, it doesn't mean they don't develop. But since each girl only gets one episode, you don't get to feel the momentum of her development that leads to romance and/or realization. The result: an unsurprising 24 minutes.\\n\\n\r\nEnjoyment: 6/10\\n\r\nSo you have a route-type plot coupled with stereotypical characters. You get scenes you've probably seen numerous times like, \"Try this food\" and a succeeding \"Delicious!\" phrase. The humor is silly, forced, and unfunny. Unique to Photokano though are the camera scenes. They be objects, scenery, but mostly, the girls. Many of their poses are suggestive, but in the anime itself there aren't many ecchi scenes.\\n\\n\r\nFor fans of Hikaru Midorikawa, he has extremely hilarious lines and shouts in each episode preview. Listening to that with UTW subs, it was something to look forward to every week (and was the only thing that kept me watching). Even if you're not a fan of him, please don't skip the episode previews. PLEASE DON'T. I BEG YOU. That's the only saving grace of a dull half hour.\\n\\n\r\nOverall: 5/10\\n\r\nIf you have a thing for dating sim adaptations and girls having their pictures taken which results into generic romance, by all means watch Photokano. Otherwise, you might just be wasting your time.",
            "date": "2013-06-28T19:00:00+00:00",
            "helpful_count": 20,
            "mal_id": 102887,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/923135.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Obihiro",
                "username": "Obihiro"
            },
            "url": "https://myanimelist.net/reviews.php?id=102887"
        },
        {
            "content": "*If you're not into reading too many sentences, just read the conclusion parts*\r\n**There is some comparison and minor spoilers in this review**\r\n\"I dont like take a people photo, their smile doesnt matching with what in their mind\" - Hikari Sanehara (Episode 7)\r\nPhotoKano is an anime that you wouldnt find in anywhere. Using same method as Amagami SS and Yosuga no Sora called Omnibus format*. Photokano is said to be the successor of those both anime. Many people like me (who loves Amagami SS) have a high expectation about this anime, since like i said before not many anime using this format. So is this animesuccess as Amagami SS? I must said not.\\n\\n\r\n* Omnibus format is story that usually \"reset\" after they completed some arc. If you still have no idea about omnibus format, please google it\\n\\n\r\nSTORY (5/10)\\n\\n\r\nPhotoKano as the name said it, its about a guy who just got interest in photography and from that, he start to take photos surrounding him (Including girls). But. somehow the photography itself changes the way how he lives including his love life. \\n\\n\r\nThe premise of the story is quite attracting but sure you wondered why does this anime have a quite low score. The answer for that is the execution. Basically to make a good omnibus format anime, they must have fair allocation episode for each heroines, like Amagami SS. they use 4 episodes for each heroines, so how about in Photokano? Its an unfair one. They accentuate one of the heroines and for the others, they just got a small proposition.\\n\\n\r\nHave a good concept but poorly in execution, thats why this anime is failure. Allocate 1 or 2 episodes for each heroines is too narrow to building up the atmosphere and romance feelings. Moreover, the series will make you bored and feels plain since its easy to predictable on whats gonna happen next.Using omnibus format means they have to restart each episodes and to make it interesting you must put some interesting scenes or differents act in every arcs but be pitied, Photokano doesnt do that and thats why photokano feels so plain and dull.\\n\\n\r\nART (7/10)\\n\\n\r\nThere isnt any interesting point to being said in this section, overall its good enough. The background is so well made and quite realistic. Well, its quite standard for big studios like Madhouse studios. Though on the art, basically we can see that the director is wanted to make a romantic atmospheres and i thought, he really did it but the execution of the story really ruins it all. Anyway, the main point is not the background but the character design, as in the same producers as Amagami SS, the characters design is the main attractive of this show. The girls are so admirable and cute. Honestly, i am watching this anime because of two things, first because of its like amagami SS (omnibus format) and second for the girls. \\n\\n\\n\r\nSOUND (6/10)\\n\\n\r\nThe one that can build the tension is music. For the OP, it was quite lovely and suitable for this anime. Just by hearing the OP song, you would realize this anime was about romance things. Personally, i love the OP. Its quite representing on the anime itself, with love as the main themes. The OP is quite success to send the message to all the viewers\\n\\n\r\nFor the seiyuu, it was fine. Each seiyuu really represents the nature of each character. Like Mariya Ise which voicing the imouto of the MC, its sounds childish but also cute. Thats totally suitable which role that she has. For other seiyuus, i think there isnt any worth to mention again since what memorable  for me in sound was Mariya Ise's voice. But, it doesnt mean the other seiyuus was bad, they do a good job too but its quite standard.\\n\\n\\n\r\nCHARACTER (6/10)\\n\\n\r\nThis is maybe the worst part of this anime. Well, how can i said. What will you have with just one episode for one heroine? too rushed. Almost in every episodes i said \"How? Why? What?\". The details for each characters are deficient in this anime, with just 4 episodes of introduction (4 episodes for 7 character) and 1 episode for the a heroine, thats still doesnt enough. Well, i cant complain it since Photokano just have 13 episodes. So, please bear with it.\\n\\n\r\nBut of course, not all bad. The girls (the heroines) are quite attractive. Lets see, we have tsundere, kuudere, loli, childhood friends, clumsy with bigboobs, and tomboy one. Thats quite generic if i could said. This type of girls is quite common in romance story. But i still found this is quite attractive. No matter how cliche for the character pesonality was, the character is still quite charming and attracting for all the viewers. For the main character, Kazuya Maeda. There isnt any interesting points about him. He is just your normal guy who have good luck. \\n\\n\r\nCONCLUSION\\n\\n\r\nDespite of how bad story and the character was, i still found this anime was quite enjoyable. Its cliche if you want to know it, but well.... i LOVE cliche. maybe this enjoyable just because on how i love Amagami SS and seems i am being carried into this anime. \\n\\n\r\n+ Have a good concept\\n\r\n+ Attractive character design (especially the girls)\\n\\n\r\n- Poorly execution\\n\r\n- The half to the end of the show feel so rushed\\n\r\n- The character development is the worst\\n\r\n- Cliche story",
            "date": "2013-07-09T19:28:00+00:00",
            "helpful_count": 14,
            "mal_id": 104643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=104643"
        },
        {
            "content": "Photo Kana~\r\nI know there are only eight episodes out for this anime but I feel like this is actually a good time to review this hidden gem. I didn't really hear about this anime from anyone and really just decided to watch it because the art looked gorgeous. And no i'm not just here for the pretty girls...\r\nStory -  Photo Kana is pretty simple. There isn't a whole lot to it and I think that suits it just fine. It's a story that unfolds before you that might be predictable but still enjoyable. The main character Maeda gets a hand-me-down camera from his fatherand decides to see if photography is for him. During the course of having this camera he manages to capture rare moments of each of the girls. He was scouted by a mysterious photo club that seemed rather sketchy and decided that it would be okay if he joined because they shared the same love for photography as he did even if it wasn't for the same reasons.\\n\\n\r\nArt - Simply beautiful. The main reason I decided to check it out was because of the art style. At first glance it looks overused but as you watch you notice that it takes on a style of its own. To best explain what I mean you really have to pay attention to Maeda's Photo Opportunities. He'll do this awesome camera zoom in thing and capture the moment that takes your breathe away. Or atleast it did that to me ^^;\\n\\n\r\nSound - The music to this anime is wonderful. Right out of a visual novel soundtrack if you ask me. I'm big on VN's and I could tell that maybe some of its music was inspired by other VN's. Most of the music really captures the moments perfectly. Slice of life in a cup of tea please!\\n\\n\r\nCharacter - Now the characters really don't scream i'm different than any other person you've seen before. Though it's not really a down side to me. Since i'm taking this anime like it were a romantic slice of life i'm not much bothered by its lack of originality. Though I really wish they would have made this series a bit longer than twelve episodes. It could have down a Amagami SS thing and given 4 episodes to each girl to give good character development.\\n\\n\r\nEnjoyment - Not much needs to be said here that you haven't already read from my review already. I really enjoy this series. It's nice to get a breathe of fresh air like this every now and then.\\n\\n\r\nOverall - I know I said this already but I wish it were more like Amagami SS. Though I will give it pointers for being like it in a sense. How many times do you actually get to see the main characters go for each of the girls rather than just one. I sit there most of the time and just sigh. Not the girl I wanted him to end up with.... (Great example :P) Anyways I still have a couple of episodes left of this wonderful series. I can exactly rate this yet since it's not over yet. But for right now I give it an 8 for being exactly what I need at this given time in my life :)",
            "date": "2013-06-01T02:52:00+00:00",
            "helpful_count": 12,
            "mal_id": 99259,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146213.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nano-kun",
                "username": "Nano-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=99259"
        },
        {
            "content": "Well this series kind of felt boring for me since the romance wasn't really that developed. It's like Amagami except that the girls fall in love a lot easier and well... the guy just takes pictures of the various heroines in each route.\r\nI personally think that the whole point of this show is really just focusing about taking the photos of the girlfriends in each episodes as the title suggests Photokano which means Photo Girlfriend. \r\nI wouldn't really recommend this series but if you have lots of free time and like romance genre, you can try watching this and might come like it but whoknows...",
            "date": "2013-06-10T00:54:00+00:00",
            "helpful_count": 10,
            "mal_id": 100543,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2688013.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/crrstle",
                "username": "crrstle"
            },
            "url": "https://myanimelist.net/reviews.php?id=100543"
        },
        {
            "content": "Applause for the girls, they're like a tool to use and getting expired after he says \"I love you\".\r\nI hate it more, just because Madhouse disappointed me. The thing is they're got the wrong show to make money for.\r\nOkay if you're going to say WHY you're making a review in only an 8 episodes done. Let me say, this show hasn't been something to look forward to, other than seeing the girls. So i thought why not, girls will keep coming in the end.\r\nThe jumping from one to another girl. That's something should develop that guy. I'd say it's a developing BUT it's not, becausehe always taking the same pictures but with a different girls. And how he take the picture is simply saying \"always look at me, i'm the good guy, can i take pictures now?\" and the girls keep saying \"why not i trust you\" (THAT SUCKS) . \\n\\n\r\nFolks that's Photokano doing its thing. To make that guy loving his thing. (Which is taking pictures of girls with mostly swimsuits or anything they got on, it'll do), so he could be a great Photographer.\\n\r\nHe joined a club or class Photography with 3 guys and 1 girls. The main thing of the club is to take girls pictures. (Fan-services). Every time he ends with a girl, you'll start to think this is the end scene of the series.\\n\\n\r\nLet's talk about \"the trust\" which is always comes from back then, when they were kids!. And he never stick with one girl, he's only acting cool and the girls trusted him as person whom they met when they were kids. Is that the trust? seemingly NO it is not.\\n\\n\r\nCharacters are the worst personalities you'll ever see. The main character is a bit annoying for me, the annoying part is, he keeps doing the same thing. The other characters aren't something special and they haven't got the light as the main character yet, they're only a reminder characters. (I mean the guys only)\\n\r\nThe girls are tools as i said before.\\n\\n\r\nArt: School backgrounds (mostly) which is a common thing, and sometimes out of the school. Still nothing special. \\n\\n\r\nOverall: I'd rather watch some Hentai, other than watching this crap. I haven't got any interest, at all. I wish i could, but i'm not.\\n",
            "date": "2013-05-31T16:18:00+00:00",
            "helpful_count": 9,
            "mal_id": 99173,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1167295.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Onsaki",
                "username": "Onsaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=99173"
        },
        {
            "content": "I thought it was decent, the first four episodes set it up pretty well, because it had also served as the common \"Arc\" for the rest, however because it was based off of a dating game, the rest of the episodes didn't have very much depth to them.\r\n I didn't mind the idea, in fact I liked how they made the series treat the other girls as canon as he \"did their route\" but they condensed each story into one episode with the exception of one character in which they gave her two episodes and of course she felt more round than the others becauseof that.\\n\r\n They could've made multiple episodes for how he eventually gets to date each character however they had not, so the episodes felt very rushed for them instead and thus the relationship that grew between the protagonist and each of the girls didn't feel very in-depth.\\n\r\nIts a short series (13 episodes) but I don't really mind short series because to me it depends on what or how they cover the content, but trying to cover all of the girls in such a short amount of time is definitely going to make it feel rushed.\\n\r\nIn the majority of the series as he explored each character, the drama was not very well either, it just seemed like each character had one problem that he helped them with in order to win them over. I am a large fan of romantic anime and before I was watching this I was fed up with anime that was just a giant cock-tease throughout the entire series, If I probably wasn't hoping to find something in which the main character had gotten with a female character(s) then this would have received a lower score from me.\\n\\n\r\nTLDR; If you like an anime in which the protagonist actually makes things happen with the female characters, this one may be for you. The series however due to its length is not very in-depth with its development.",
            "date": "2013-07-11T09:43:00+00:00",
            "helpful_count": 8,
            "mal_id": 104845,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2414867.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ace0fspad3s",
                "username": "ace0fspad3s"
            },
            "url": "https://myanimelist.net/reviews.php?id=104845"
        },
        {
            "content": "Photokano was described as the spiritual successor to Amagami SS prior to it's airing.  This fact alone made wanting to watch Photokano appealing.  However, in the end, this particular anime did not satisfy the romantic in me and likely not in you.  \r\nStory:\r\nThe story is an omnibus format which simply means the show is split into stand alone arcs.  This is arguable the biggest flaw. There are simply not enough episodes to flesh out any meaning in the relationships given the number of heroines.  Being a romance at it's core, Photokano does a very average job in capturing the emotionsof the audience in any meaningful way.  The relationships are bland and the transition from bonding to falling in love happens in a matter of transitions throughout a 20 minutes episode.  It takes the fun and joy out of watching the relationship develop.  More importantly, you can't connect with the couple to be.  Additionally, it seems that too much emphasis was placed on seduction and eroticism during the photo sessions.  Not a bad thing I suppose, but did seem really out of place.  \\n\\n\r\nArt:\\n\r\nNo way this is Madhouse! In all seriousness, the art is fairly lackluster.  The backgrounds are stagnant and everything has a very dull feeling to it.  There are inconsistencies between episodes unfortunately. The only really stand out part about the animation comes when you get the behind the viewfinder approach.  The still image which Maeda takes are usually a pleasure to look at.  \\n\\n\r\nSound:\\n\r\nThe most redeeming aspect of this show was the music.  Although not wonderful, the BGM pieces are appropriate and easy on the ears.  The OP and ED are well placed.  I personally don't have any major complaints with the voice acting.  Given the bland story and development, there weren't any of those \"moments\" were you find yourself sucked into the dialogue for any period of time to later find yourself appreciating the voice acting or more superficially that character. \\n\\n\r\nCharacters:\\n\r\nThe characters...the characters were, again, nothing special.  It's suppose to be a romance.  If you can't bond to a heroine or say the coveted \"best girl\" then what's the point.  Although a very subjective remark, it is somewhat important in this category.  Each heroine has their own issue and Maeda helps them overcome to live a happier and brighter high school life.  While nothing expressly makes one particular character bad, there is nothing that makes them good either.  Add in the transition found in the finale and all hope is about lost.  I would have to say the character that was the most interesting, being Yuuko, was never given an arc. The entire photography club is annoying to say the least and their efforts are repeated so many times it just adds to the displeasure of seeing them on screen.  I will say the president of said club did make the episode previews...unique.   \\n\\n\r\nEnjoyment: \\n\r\nIt's unfortunate that this show never really took off.  The four starter episodes gave a false hope to an already struggling show in the romance department.  It failed at where it should accel,  the relationships.  If wanting to watch a school romance is the lure that brought you to Photokano then I do suggest picking something that is more likely to make an impression on you.  Although my personal rating of Amagami SS may be very high, I do believe it is a very well done school romance anime that you should enjoy given the appeal the this genre has already to you. Yosuga no Sora may be another option however it is much more...adult.",
            "date": "2013-06-29T00:26:00+00:00",
            "helpful_count": 7,
            "mal_id": 102947,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/429216.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/IZEROII",
                "username": "IZEROII"
            },
            "url": "https://myanimelist.net/reviews.php?id=102947"
        },
        {
            "content": "Photokano is one of the few anime I know that are depicted in the omnibus format; the other 2 being Amagami SS and  Yosuga no Sora. I was pretty surprised.  It was better than I thought it would be, but it could still use some work.\r\nStory: 8\r\nWhat can I say? The series is based on a dating sim. The story is that of the typical dating sim game plot. But how the protagonist started his whole romance life because of a hand-me-down camera his dad gave him was original, as far as I'm concerned. Other than that, the rest is pretty standard: \r\n1.Talk to the girl\\n\r\n2. Earn her friendship \\n\r\n3. Find out her life problem\\n\r\n4. Fix whatever the problem is\\n\r\n5. Falls in love \\n\\n\r\nArt: 6 / Animation: 7\\n\\n\r\nHonestly, the art could have used some work. It isn't exactly a pain to look at, nor is it appealing in any way. But it's just fine the way it is, and te art doesn't falter. Animation is pretty decent too.\\n\\n\r\nSound: 6\\n\\n\r\nNothing special to note here. The OP was alright, but it wasn't catchy. The voice acting is okay. But other than that, no complaints on the sound.\\n\\n\r\nEnjoyment: 9\\n\\n\r\nI love me a good romance story, so my score here might be a little biased. Omnibus format anime are hard to come across, and there are only 2 good ones (Ones mentioned above) After seeing the outcome of the story, you'll want to find out what happens in the next story. I guess that's where most of the enjoyment lies. \\n\\n\r\nOverall:  8\\n\\n\r\nIf you want a serious anime with a good amount of drama and romance, this one isn't exactly for you. It's a light-hearted  romance story involving multiple in alternate stories. The art and sound aren't that notable. If you loved Amagami SS, this one bears many similarities (But won't be as good) and I'm sure you'll like it too.",
            "date": "2013-06-05T04:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 99863,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2189923.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KaiserLos24",
                "username": "KaiserLos24"
            },
            "url": "https://myanimelist.net/reviews.php?id=99863"
        },
        {
            "content": "this Anime is pretty fucking underrated than I expected, I will make a comparison here so deal with it, for instance, Tonari no Kaibutsu-kun as we all know is about a pair of couple named Shizuku and Haru, Shizuku in general is pretty fucking weird who only focused on studying, but I can deal with that, while on the other hand, Haru is completely fucked up who only do what he wants and not giving a shit about what others think, if he wants to punch a guy with his friends, he will do it despite the fact that he might get beaten afterwards, that'sjust how fucked he is, you can say that I just fucking hate his guts, their story in general is a rom-com that most of who watched it liked, I get it, it's pretty fucking funny and interesting, but it gets old when it happens every fucking time, they meet, they learned a lot about each other in the process, they think they're falling in love with each other, then they get to the point that they do love each other, but then they give up on that idea, then they do get to that point, they they not again, I admit I got annoyed and decided just to finish this Anime because I'm halfway through, and the Anime finished with both of them not ending up with other, what the fuck?! I watched it with that idea where they end up with each other but they didn't because Haru is fucking Autistic, but it got a pretty decent score while PHOTOKANO DONT! what the fuck is wrong with these people?! They fucking liked Tonari no Kaibutsu-kun with that ending, but PHOTOKANO where all the heroines get their happy fucking ending DONT! It might be short but they produced happy fucking endings! Where is the justice there?! you might get offended but I just want this Anime to get that score it deserves, some of you might understand, some might not. This is just my honest opinion, It's HAREM! I ain't gonna explain more shit.",
            "date": "2015-06-13T21:50:00+00:00",
            "helpful_count": 5,
            "mal_id": 190259,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/467095.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vanillax04",
                "username": "Vanillax04"
            },
            "url": "https://myanimelist.net/reviews.php?id=190259"
        },
        {
            "content": "I called luck.... and it's a win...\r\nCause it all make sense...\r\nHe end up with all of them.. in every route.. (especially his sister???? better not involve her with this)\r\nBest to update the route (Ep. 8 i wish it's much longer than the rest)\r\nA kind of photograph which could tell that your youth had just about to start..\r\na kind of shot... which hold a secrets that hold us together... Well i'd say the anime is a very simple romcom, where a boy encounters a girl... In other words even we don't need a better strong story or any kind of gestures that attains much more mutual..There are few details which missed from the game (Even i didn't know all of it)... Especially guy like him.. who's known to be dream as a photographer... To be honest... the last episode isn't really the ending... mostly it's like a secret event... that people don't know anything.. Like i said.. the different route where much better than the common route itself.. well if you're into the canonized girl... Like Amagami SS.. this could make your series picked which he wants to end up with..\\n\r\nand before that, you\"ll know already who's the most dearest to him..\\n\\n\r\nAn underrated series.. which did not appeal but the series itself is still good..\\n\r\nwhether if your into omnibus format like this one.. This chill your mind and beats all of your mood...\\n\\n\\n\\n",
            "date": "2017-01-27T08:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 239232,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5472966.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HikiNEET021",
                "username": "HikiNEET021"
            },
            "url": "https://myanimelist.net/reviews.php?id=239232"
        },
        {
            "content": "I thought it was really great and cute but then as i got further into the eps i felt like i was watching amagami ss all over again. Dont get me wrong they are both good animes, but all i know is that if you really like amagami ss and want to watch something almost identicall, then photokano is your anime. Of course there are some differences, and the first few eps would catch your attention if your into love dramas. Its nice.",
            "date": "2013-05-29T17:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 98899,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2638145.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/soupsane",
                "username": "soupsane"
            },
            "url": "https://myanimelist.net/reviews.php?id=98899"
        },
        {
            "content": "WARNING SPOILERS ARE CONTAINED (Last Paragraph)\r\n^^^^^^^^^^^^^^^^^^^^^^^^^\r\nOhhh boy, here we go, Kazuya, a mild-mannered high school sophomore receives a gift (Camera) from his father. Kazuya begins to take pictures of a-lot of things he find as a \"Photo Opportunity\". The club leader of the Photography club spots Kazuya and wants to recruit him. However, he only wants to recruit him for perverted reasons since Kazuya knows some popular girls and can get some dirty pictures out of them for the perverted Photography club. That's basically the main story (So far).\r\nTo be honest here, this is one of the most stereotypical cliche Animes I have ever watched.To me, this anime is just another Harem Slice of life Cliche Moe Anime. What the Anime to me is about a guy trying to protect girls \"purity\" from his perverted club members, however takes erotic pictures of the girls he's \"protecting\". Not to mention he sexually harasses the girls (Or atleast I think he does) by touching their boobies, taking photos without first asking, and blackmailing the student president for what he wants, but I guess it's okay since THE GIRLS DO NOTHING ABOUT IT. And since it's just another Slice of life Harem, you'd think there is comedy, BUT NO! There is none at all! Maybe if comedy was constantly having the main character sexually assaulting \"by accident\" and taking erotic photos of the girls. Really though, this anime is nothing but fan service to me.\\n\\n\r\nThere is one character in this Anime that is pretty interesting, however, her story is ALSO CLICHE ( in my opinion). She wants to be another girl. I might change my mind on her and this anime later in the series, but for now, i'm completely dissapointed. And after watching 10 minutes of episode 5, Kazuya was put into an sad mood from some stupid rumor and a guy asking out the girl he likes (Nimii-san), he thinks he's not \"worthy\" enough to be with her. I can't do this, I dropped this.",
            "date": "2013-07-07T03:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 104215,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2830085.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EIsword",
                "username": "EIsword"
            },
            "url": "https://myanimelist.net/reviews.php?id=104215"
        },
        {
            "content": "This anime is one of the worst i've ever seen and i didn't just watch one episode. I watched eight, yes i wasted a good couple of hours sitting and wasting my time on this. Ok, its based on a game and to be fair, when you're watching it, it feels as if you were playing a videogame. But if i wanted to play i videogame i would have bought the videogame.\r\nNow, lets start by saying that the music in this show is the most intrusive music ever, you cant focus on the utterly pathetic dialogue and almost non existent but most certainly dreadful plotbecause there is this arrythmic clown-like music playing at a volume and speed that will probably annoy you to the point where you just want to stop watching the show.\\n\r\nThe dialogue...oh, the dialogue. I just cant imagine this crap bien written by anything else than a undeveloped monkey that is high on acid, forced to write. \\n\r\nSo, i wont say much more, but this is just my opinion and i dont want to make it too long so yeah. This show is just. Bad",
            "date": "2014-04-21T15:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 140793,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3117603.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Chilz",
                "username": "Chilz"
            },
            "url": "https://myanimelist.net/reviews.php?id=140793"
        },
        {
            "content": "Well, it's been a while since I wrote a review on MAL, but since I've got nothing to do now, I thought I'd do one.\r\nNow, this is gonna be a fun one to write. Photokano has been on my radar for quite some time now for several reasons: 1) It's by Madhouse, 2) but it's got a pretty mediocre score, and of course 3) just because it's got Ecchi as a genre. Well, what can I say? I am a guy after all and I ain't gonna miss out on some 'nice' shots that I may come across. And speaking of nice shots, it reallyfits the topic of this review because Photokano actually is about a guy who got a camera passed down from his father.\\n\\n\r\nFirst, let's get it out there regarding the best thing about this anime. Being a product of Madhouse, I am happy to say that this anime has got some fantastic shots. The animation technique commonly used by slowly panning the camera around the girls make for some beautiful and undeniably sexy collections. Not to mention, it is a good thing Madhouse did not slack on the art quality. Added detail definitely puts this anime ahead on the ecchi ranks. There should be more than enough reason for me to consider this a decent guilty pleasure anime. Unfortunately, almost everything else about this anime just ruins that potential.\\n\\n\r\nHave you heard of an anime called Amagami SS? Basically, it is an anime that follows a guy named Juunichi and he falls in love with 6 different girls. How does that work? The anime is separated into 6 different arcs spanning 24 episodes with each arc focusing on 1 of the 6 girls, showcasing alternate possibilities for Juunichi's romance. In essence, it was the perfect solution to adapting a visual novel with all the different routes being shown in anime form. Now, take that concept of Amagami SS, increase the number of girls from 6 to 8, and half the number of episodes, and you get Photokano. Do you see the problem here?\\n\\n\r\nThe first 4 episodes were basically an introduction to the setting of the anime. This phase was alright because it does give us a general understanding of each character. We are also introduced to the main character Kazuya. His introduction was as bland as it gets. We know very little about him, his ambitions and such, and his personality is just contradictory the more the anime goes on. He gets dragged into The Photography Club, which is interesting in its own way because of its members. And while the club does create some highlight moments, their significance in the anime seemed kinda lacking. And with the exception of Haruka, every other girl gets literally just 1 episode in the spotlight. And from this point on, just get ready for some random ramblings as I recollect my thoughts about each arc.\\n\\n\r\nIf we're talking about rushing, Photokano has got that covered. What's even more painful is that we have to go through that process 8 freaking times. An extra episode for Haruka's arc didn't help much because of another problem: This anime is awful at handling drama. This was particularly evident in Haruka's and Nonoka's arcs. With so little time to set up these personal conflicts, the drama just comes off as out of place and sometimes even laughable. That brings about another atrocity: Character Overreactions. While this is most evident during dramatic moments, the biggest crime involves Aki Muroto. If this is the best the anime can depict her as being STRICT, then this anime has failed tremendously. I've seen many strict student council presidents in anime, and Muroto would be considered tame amongst many. In fact, she had every freaking right to lecture the accused because of clear solid evidence. And the way she was treated by Kazuya makes me want to smack this jerk in the head. By the way, what I meant earlier about Kazuya's personality being contradictory can be summed up as 'The closer the girl is to Kazuya, the less aggressive he is'. It makes absolutely no sense that Kazuya would be a dense idiot towards his childhood friends but somehow being so persistent with someone as hard to get as Hikari Sanehara. Though I will say that the best backstory was in Sanehara's arc. If only that quality was prevalent in the other arcs. And while my personal favourite arc was Tomoe Misumi's arc, it was still bogged down because this anime is just too damn short for its own good. To be perfectly honest, there is very little variation between arcs. And because of that, it's not surprising that the anime felt unnecessarily repetitive and boring after a while. While it is nice to see a happy ending for every girl, there really isn't much point if every one of these arcs just feels so empty and hollow.\\n\\n\r\nAnd then the icing on the cake, the fact that they pulled out that trope between the relationship of the two individuals in Episode 13. Seriously, is this a common occurrence in Japan or just a fantasy that every Japanese individual have? I have seen it pop out in so many anime and I am honestly getting sick of it at this point. By the way, I'm referring to how the characters are related, not what they decided to do.\\n\\n\r\nI guess I was less surprised once I found out the director and series composer of this anime would later direct Cutie Honey Universe, which I have dropped after 3 episodes. Photokano is an anime that had all the elements to be a decent romance series but everything about it just screams BAD DECISIONS. If you seriously don't mind the story at all, then by all means go ahead and check this out because Madhouse did great work with the fanservice. But honestly, I would not recommend this anime even for that because you can't very well ignore its attempt of creating romances, which it takes seriously but by no means competently. If anything, I would rather you check out Amagami SS which I have mentioned because it still has some nice fanservice moments but its character arcs are heaps more developed than this.\\n\\n\r\nSeriously, there are two ways this anime could have been improved:\\n\r\n1) INCREASE THE NUMBER OF EPISODES\\n\r\n2) DECREASE THE NUMBER OF LOVE INTERESTS",
            "date": "2019-04-22T22:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 306943,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6028087.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Eugenefindit",
                "username": "Eugenefindit"
            },
            "url": "https://myanimelist.net/reviews.php?id=306943"
        },
        {
            "content": "Harem anime offer a multitude of aspects for a viewer to enjoy when watching one. Viewers are offered what`s essentially a line-up of different female characters (or males for the reverse genre) who tend to all follow a certain archetype that`s become fairly common in most genres of moe-blob, and slice of life shows, and almost staple to visual novel adaptations. Given that the characters are interesting enough, with a sensible plot behind them, anyone can find at least one character who found themselves enjoying the time of day given to that one specific character, even though that, canonically, the main girl will be chosenin the end. But the overall experience can be enhanced when the show offers a good sense of humor, nice presentation, and interesting character designs. What happens when all of that is achieved, but it fails horribly? Photokano.\\n\\n\r\nWhat is unfortunately considered the spiritual successor to the more successful game, and subsequently more successful anime, Amagami SS, Photokano attempts to take the same direction but with what is arguably a better studio, Madhouse. What this means is that this is almost guaranteed a visually appealing show, which it actually does accomplish. There are multiple scenes where the studio can show off its budget and skill of animation, and create a pseudo-3D scene when the characters themselves are just drawn in. Photokano also inherits the style and character designs from its earlier games, KimiKiss and Amagami. The characters themselves are vaguely original in design, and they don`t try too hard to adhere strictly to their respective archetypes (i.e. the tsundere, the little sister, the childhood friend) by not actually shoving that fact in the viewers` face. \\n\\n\r\nThe overall theme of the show is that of a camera, where the main character obtains one and begins his journey of self-discovery through his newly acquired `new look` at the world around him. This also gives the show a unique excuse to include ecchi scenes and panty shots left and right. A clever aspect to the show is the overall setup of the rest of the series. In the early episodes, most, if not all, of that `flags` for the girls are setup n what can be considered subtle, and not out of place or awkward in writing. This gives somewhat of a justification for the following `arcs` that the show presents itself in. \\n\\n\r\nHowever, the problem with Photokano lies in its delivery, in that there is none. The character flags are set up in the near beginning, the setting with the Photography Club is created, and the main character isn`t a terribly boring and generic person. But what comes to follow is essentially a string of one episode arcs, where each episode is dedicated to one girl. The camera motif is quickly rendered meaningless because the (very few) character dynamics have almost nothing to do with the theme of the camera itself. The secondary characters, who are the members of the Photography Club fall flat after their introductions (which is unfortunate because one of them is voiced by Shiraishi Minoru) and are never developed. The final and most important flaw of the show lies in the girls. While the show can cleverly jump from arc to arc, there is absolutely no time for any characters to be developed. All that can be presented in the end is a character trait, like one`s love for food, or the other`s stoicism, and then immediately tries to force false character development in the span of 10-15 minutes. \\n\\n\r\nAnything and everything that was set up by the beginning of the show, which was in all fairness actually not that bad, is completely stunted and abandoned. In its attempt to try and accomplish what Amagami SS did, which had roughly 40 episodes total when OVAs are included with each girl getting at least 3-4 episodes each, Photokano hurts itself by spreading itself too thin. Sadly, the only problem really was the length of the show.\\n\\n\r\nArt & Animation: 9/10 - Madhouse sure knows how to show off when they can do a pseudo-3D space camera trick. Good colors, good backgrounds, nice shading when the detail is there.\\n\\n\r\nSound: 7/10 - While voice acting is nothing special in this show, the music tends to stand out for at least 2 or 3 tracks when things get serious in mood.\\n\\n\r\nStory: 5/10 - It`s a shame to say that time restrictions are whats holding back nearly everything about that show, even though that isn`t saying much to begin with, but it`s the truth and the story suffers for it.\\n\\n\r\nCharacter: 3/10 - There are nice designs for the girls, and some of the secondary characters look pretty nice, but style only goes so far when the characters are literally paper thin and shallow.\\n\\n\r\nValue: 2 - Nothing too meta or self-aware about the show, and no significant impact on the industry other than being an attempt at what Amagami was.\\n\\n\r\nEnjoyment: 5 - Personally, I wanted to like the show. There was just no real chance to.",
            "date": "2014-01-15T04:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 128863,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Arizzle",
                "username": "Arizzle"
            },
            "url": "https://myanimelist.net/reviews.php?id=128863"
        }
    ],
    [
        {
            "content": "Photokano\r\nStory (6)\r\nFollows Maeda Kazuya, After a boring Summer he receives a gift of a Camera from his father, From there he gets addicted to it due to him seeing the ability it has to expand and enhance his social life. \r\nUsing Photography to enhance a social life or improve an non-existing one is rather unique, But that is pretty much the only positive about the story. The early episodes pans out in a way that everyone who takes pictures is perverts, It has this darker side i just didn't expect from Photokano, For example blackmailing a girl for her to take pictures of her inprovocative poses. The Photography club is the prime example of wasted potential, They rarely have any purpose in the series and more of something Maeda stumbles into, rather than anything core to the plot. \\n\\n\r\nThen like a few episodes in Photokano basically becomes \"Amagami SS\" Where each episodes focuses on a certain female character, In most they are resolved in one episode usually with a very romantic ending. \\n\\n\r\nArt (8)\\n\\n\r\nA good looking series, Isn't the best i've seen, Very similar to \"Amagami SS\" Art Style\\n\\n\r\nSound (7)\\n\\n\r\nVoice's fit the characters and the music they used was good, Most where Piano pieces which i liked, But they all felt rather similar to one another, Even the same \"Slower\" tempo to fit the romantic portion of the series.\\n\\n\r\nCharacters (5)\\n\\n\r\nAs mentioned in the \"Story\" Photokano starts off focusing around a Photography Club, They are a constant in the Series, Yet the Characters all felt the same, Pervy with no real substance to them, This is mirrored by most of the cast, Due to the series from an early stage changing into a \"Amagami SS\" which refers to every episode being dedicated to a different girl who falls for Maeda. Most of these routes were finished in one episode and again most character felt a bit stereotypical and bland, Needed to have more focus to give Characters depth and some meaning. \\n\\n\r\nEnjoyment (6)\\n\\n\r\nHard to say, At the start i felt this show was Strange, Really didn't have a direction to go down and was fixated of this pervy angle of taking pictures of girls in provocative poses, but i have to say after they found their feet the format of having one episode for one route (In a game) is nice and gave the series some structure but then again i felt it lacked many qualities to make it special, Characters are pretty much carbon copies of each other, Stereotypical with no depth or substance, Each episode usually ending in the same manner and result did get a bit predictable, I just hope they had more of a focus because the synopsis was promising, Yet it will be remembered by me as just one of those series that was wasted potential. \\n\\n\r\nOverall it's a decent series, If you like Romance or School setting anime you will mostly like this, But in the end to me even though i some what enjoyed it, I felt it was just another \"Average\" series.",
            "date": "2013-07-01T16:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 103359,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1514017.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lukas10",
                "username": "Lukas10"
            },
            "url": "https://myanimelist.net/reviews.php?id=103359"
        },
        {
            "content": "Photokano provides us with with a unique storytelling style that is very hard to find in anime.  I'm talking about the omnibus format.  For those unfamiliar with the term, it's a unique format in which we are able to see each heroine end up with the main character, in a sort of \"alternate reality\".  It's just like beating every route in a VN, only animated.  This alone makes this anime a must see, but that isn't all.  Despite the short length of only 13 episodes, this anime does a great deal at telling a wonderful, touching story that we don'tsee as often as we should.\\n\\n\r\nStory: 9/10\\n\r\nThe story of Photokano revolves around our main character, Kazuya Maeda, as he introduced into the world of photography when his father gives him his old camera as a gift.  But what is a camera without something to take a picture of?  Enter our heroines.  This eight girls are inexplicably drawn to Kazuya and his amateur photography.  This is where the story lacks the most.  SInce each heroine only gets one episode (and a few scenes in the first two episodes) to get her story told, the \"building up friendship\" part is severely lacking.  The omnibus storytelling more than makes up for this fact though.  Each of these girls has her own unique personality that gives the viewer a fresh look at the series every episode.  SInce the story resets every episode it is hard to get a complete look at the world and characters of Photokano, but it is this exact concept that makes Photokano such an enjoyable watch.\\n\\n\r\nArt: 9/10\\n\r\nThe visual style of Photokano isn't anything groundbreaking, but it is still very good.  Sure, there are some rough edges around the characters every now and again, but this only adds to the overall charm.  This is actually one of the departments in which this anime shines though.  Every time Kazuya snaps a shot of one of the girls, the art changes to a stunning 3D/CGI look that is absolutely gorgeous.  And Kazuya takes a lot of pictures.  People spend hours playing through every route in a VN just to see images like these.  \\n\\n\r\nSound: 8/10\\n\r\nThis anime doesn't have a very diverse soundtrack, but that doesn't mean it's bad.  You may hear a lot of the same BGM over and over again, but it's soothing nature makes it not only tolerable, but enjoyable.  The OP was fantastic in my opinion.  I've already listened to it at least a couple dozen times since I last watched the series.  Not only that, but the ED is unique in the fact that each heroine gets to sing her own version of the song.  \\n\\n\r\nCharacter: 10/10\\n\r\nWith a style like this, the entire anime hinges on the characters, and Photokano does not disappoint.  Kazuya, our main character, is more or less your typical forgettable nice guy.  Then again, what harem MC isn't?  But we don't watch harems for the guy, no, we watch them for the girls, and this anime has a variety of them.  A shy girl, student council president, airhead, childhood friend, heck, this anime even has an imouto character.  Due to the nature of this anime character development is kept to a minimum, which is really too bad, but the creators did the best with what little time they had and did not disappoint.  Even though you only see some of these characters for a total of 30 minutes, you feel like you can understand them.  At least to some extent.  \\n\\n\r\nOverall: 10/10\\n\r\nPhotoakano was a very enjoyable anime to watch.  I happen to be a major fan of the omnibus format, ever since watching Amagami SS, so this anime was like a gold mine for me.  Those looking for in depth storytelling and character development may want to steer clear of this anime, but for those like me who enjoy a good harem and a large cast of diverse girls, this anime is a must watch.",
            "date": "2014-08-30T21:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 158579,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1312169.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TheGreaterOwl",
                "username": "TheGreaterOwl"
            },
            "url": "https://myanimelist.net/reviews.php?id=158579"
        },
        {
            "content": "Its a great anime after you watch one that is either way to serious or feelsy. \r\nIt isn't that great in terms of a sophiscated story but is is kinda heartwarming and happy sort of anime. \r\nwatched it after Your lie in April so it definitely cheered me up. \r\nart is pretty good but i have a bias towards clean/smoother animations\r\ncharacters are underdeveloped but its all happy endings so all good after you finished a trip on the feels train.\r\nreminds me of a dating sim now that i think about it...\r\nalso there's a bit of fanservice but nothing a 'mature' person can't handle",
            "date": "2016-04-02T05:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 215164,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4910845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/rklk",
                "username": "rklk"
            },
            "url": "https://myanimelist.net/reviews.php?id=215164"
        },
        {
            "content": "Where should I start?\r\nFor one thing, Its more than one storyline, so its hard to follow if you don't pay attention.  It has an ending for each of the Main Girl Characters, and the dude essentially gets with all of them(not at the same time).  It wasn't that great of an enjoyable show in terms of Story, but I will say, it had a TON of Fan Service.  If your looking for something thats just great to watch that have good pictures of girls, then go ahead and watch this.\r\nEach Story arc was interesting in its own, yet felt very rushed andway too fast.  I mean the dude gets with these women after having met them like 2-3 weeks prior to them getting together.  The Only real great story arc that I felt content about was the last one, with Kanon.  The First girl was an okay scenario what with them being childhood friends, but the rest, the guy meets in his Highschool years.\\n\\n\r\nThe Opening Song made me wanna suicide half the time because its just weird. yet it somehow fits the way the anime is in a way.\\n\\n\r\nI'll say I didn't necessarily excitedly wait for the next episode, but It was okay for an spring anime to get out of the way.\\n\\n\r\nDon't expect a 2nd season out of this one because the way they have it now, they would have to pick a story arc, and Honestly I think that would make people mad, because each one had its own different story.\\n\\n\r\nI Don't think i would recommend this one because its only appealing for the Eye, and Not for your mind or heart.",
            "date": "2013-06-28T19:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 102897,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1122179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DustPotato",
                "username": "DustPotato"
            },
            "url": "https://myanimelist.net/reviews.php?id=102897"
        },
        {
            "content": "When I started watching Photo Kano, I initially though that it would be a single story, harem style anime. Unfortunately, I was wrong. Photo Kano is an anime that has alternate \"arcs\", so to speak.\r\nIn every arc, the protagonist ends up with a different girl. In my opinion, I dislike anime in which the episodes contain the different arcs. I would prefer that the protagonist ends up with one girl in the main episodes and that the others are made into different episodes, probably much like Clannad. But that's just my opinion.\r\nThe main arc was kind of interesting but when I found out that PhotoKano had different arcs, I kinda lost interest because, as I've said, I dislike anime in which the main episodes have different arcs.\\n\\n\r\nOverall, Photo Kano is good anime to watch if you like anime like these. Though, I gotta say, the story and plot are kinda disappointing due to my dislike of you-know-what.",
            "date": "2013-08-12T04:57:00+00:00",
            "helpful_count": 0,
            "mal_id": 109285,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3033115.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kiyazuki",
                "username": "kiyazuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=109285"
        }
    ]
]