[
    [
        {
            "content": "REVIEW REUPLOAD\r\nOLD REVIEW WAS DELETED SINCE IT WAS POSTED TO SOON\r\n-SPOILER FREE-\r\nSaiki Kusuo no Ψ nan is a comedy slice-of-life story about Saiki Kusuo who has special powers that allow him to do pretty much anything.\r\nThe Episodes are not very long with around 4-5 min per episode but the episodes are coming out almost daily right now.\r\nStory: 8/10\r\nThere is no core story as there is always another core in each episode, but the main story (that is that Saiki Kusuo has special powers) still affects all episodes.\r\nThere are some surprising moments that really catch you off guard and you never expected.\r\nArt: 8/10\r\nThe art is verybeautiful with good animation and good character design and all characters are very different!\\n\\n\r\nSound: 9/10\\n\r\nThe voice acting is good and the intro song is very catchy, there is no outro song. The background music/sounds are fitting and enjoyable.\\n\\n\r\nEdit:\\n\r\nThere is an outro in the 20-minute version (I watch the 5-minute version so there isn't for me)\\n\\n\r\nCharacter: 10/10\\n\r\nThe Characters are all unique and well-written, and the characters show a clear relation to each other.\\n\\n\r\nSomeone else pointed out that every character follows a cliché, for example, the sports loving class rep, the stupid delinquent or the beautiful girl everyone gets nervous around.\\n\\n\r\nEnjoyment: 10/10\\n\r\nThe Series is very enjoyable with lots of funny jokes and interesting character development!\\n\\n\\n\r\nOverall: 10/10\\n\r\nI recommend this anime to everyone, it's funny, well written and definitely not a waste of your time! Give it a try!\\n\\n\r\nEdit after watching 56 episodes:\\n\r\nThe more you watch the most things Saiki does, one of the jokes is also the writer making stuff up on the spot and Saiki commenting on that breaking the 4th wall, relationships are also (in a sense) build trough the series\\n\\n\r\n-Laurin",
            "date": "2016-07-15T07:44:00+00:00",
            "helpful_count": 276,
            "mal_id": 224082,
            "reviewer": {
                "episodes_seen": 56,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4695462.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Laurin",
                "username": "Laurin"
            },
            "url": "https://myanimelist.net/reviews.php?id=224082"
        },
        {
            "content": "Aired during the Summer and Fall 2016 seasons, Saiki Kusuo no Ψ-nan is (hopefully just for now) a hidden gem in comedy anime that I can't recommend enough to watch.\r\nThe protagonist in this story, Saiki, is a boy that was born with psychic powers in a normal world. He can read minds, he can teleport from one place to another, he can restore things (people included) to their previous state in the past… and these three are just a few examples of all that he can do. Saiki is so powerful that, if he wanted to, he could singlehandedly take control of the Earth ina few days, is that his intention? Hell no! He just wants to live a quiet life, and I can already tell you that he isn't even close to have one.\\n\\n\r\nFrom his family, to his classmates, to seemingly anyone he meets, everyone is a weirdo, and they are all hilarious and awesome in their own way and won't let Saiki alone for a second. There is Shun, the chuunibyou that believes in the existence of Dark Reunion, an evil organization that only he can defeat (even if in reality he is a complete weakling), Nendou, a character that is so empty-headed that Saiki is not able to read his mind, Teruhashi, a girl that is considered perfect by everyone (especially herself), and so, so many other awesome characters that will grow up on you and make you laugh so much.\\n\\n\r\nSaiki itself is a fantastic and unique character, he's a straight man (and the only sane person around) that doesn't fully act like one, instead of shouting like it's the usual, he stays silent for the other characters, and we can listen to him internally complaining in his normal tone, there is something so funny about seeing him wondering what the hell is wrong with everyone, all while keeping his trademark deadpan face, that rarely changes outside of when near his biggest weakness: coffee jello, he absolutely loves it and he will do anything for them.\\n\\n\r\nThe variety that having psychic powers provides to the story makes this anime so great, every episode feels very different to the others thanks to the multiple uses that they have. The humor itself is quite fast paced, and manages to be constantly funny, you will be laughing all the time while watching this anime. All the side characters get the right amount of screen time to become memorable, yet never feel like they are overused. The 4th wall breaks are fantastic, and I really have to mention the parodies, that are mostly from other popular games and series that everyone knows about, so one is not left with a “well, I don't get it” reaction everytime they happen.\\n\\n\r\nThe art style and animation of this anime is honestly pretty average, it doesn't look bad, but it's definitively not a high budget work at all, I personally don't give much value to that since the main objective in this type of stories is to make us laugh, and actually, if used properly, that can work  pretty well in their favour, this can be especially be seen in scenes featuring Nendou, where the intention is to make him look as derp as possible and that helps making it even better.\\n\\n\r\nIn the sound department, as most of the time with comedies, the songs are quite forgettable and mostly there to simply go along with the events that happen, there is one big exception though, and it's the “JUDGEMENT KNIGHTS OF” song that follows some Shun scenes and makes them so much better. Both two opening and ending themes are pretty good, especially “Ψ desu I LIKE YOU”, the first ending theme (or the opening one if you watch the shorts), that is a very catchy song.\\n\\n\r\nThis next and final point is meaningless for the new watcher now that this anime finished, but I really need to still mention it, Saiki Kusuo aired as both a series of shorts (4 minutes episode per weekday, being 5 episodes in total each week) and one episode each Sunday, that was all of the shorts from that week together, this format was simply fantastic and I want it so much to become more popular in the future. In my timezone it meant that each weekday, when I woke up, I had one new episode available, there is simply no better way to start the day than with a good laugh, and I appreaciated it so much. \\n\\n\r\nIn conclussion, Saiki Kusuo no Ψ-nan is a very original and hilarious comedy, full of lovable characters that will make you laugh from start to end. If you're a fan of comedy anime, make sure to watch this one, and if you aren't, I still heavily recommend you to give it a try, because it's probable that it will greatly surprise you!",
            "date": "2016-12-25T14:11:00+00:00",
            "helpful_count": 120,
            "mal_id": 236484,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759794.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetaThPr4h",
                "username": "MetaThPr4h"
            },
            "url": "https://myanimelist.net/reviews.php?id=236484"
        },
        {
            "content": "You're in a crowd of people and trying to hide from a really creepy dude that you know from school or work. Luckily, he hasn't noticed you yet.\r\nYou probably want to do the best you can to get out of his line of sight... right? So you've finally managed to make it behind him, but then, just as you think that you're safe, the creepy dude stays facing forward, but SWIFTLY does a horrifying 180-degree HEAD-ONLY turn. He then, with a derp face, looks SOLELY at you out of everybody in the crowd. In a shocking development, you've somehow been spotted! That \"wtf moment\" thatyou'd experience makes for comedy at its finest! You will find that type of comedy and much, much more in Saiki Kusuo no psi-nan.\\n\\n\r\nFunny does not even begin to describe this anime! That's right, it's hilarious! It's one of the best, if not the best, comedy anime that I've ever seen. It's very original and has definitely become my new favorite comedy anime.\\n\\n\r\nTL;DR at end\\n\\n\r\nStory: 10/10\\n\r\nSaiki, the main protagonist, comically takes being overpowered to a whole new level. He's basically a god-level psychic that can do anything. He's smart, has x-ray vision, one punch man level strength (or maybe All Might?), time warping, can change the laws of the universe, has telepathy, teleportation, memory wiping, there's basically nothing this guy can't do. The story follows him in his everyday life as he, an extremely superior being, has to deal with ordinary folk. He's a pretty sarcastic guy and is always doing a hilarious internal commentary about the bothersome events that happen to him throughout the anime. There is no overarching goal of the plot (it's kind of just a linear succession of skits). The pacing is often very fast, but I think that its speediness actually benefits the series because the series continuously hits you with jokes like they're bullets from a machine gun (if some jokes miss, np there are like 20 more incoming). I truly cannot imagine how they could have improved the story in this series. This story's comedy is a 10/10 masterpiece.\\n\\n\r\nArt: 6/10\\n\r\nThe artwork was very plain and the animation was a bit choppy, but it didn't take away from the series in my opinion. The simple art may have actually enhanced the series in a way. Perhaps you would have missed the comedy if you were too focused on the art? Who knows, but there's really not much to talk about when it comes to the art.\\n\\n\r\nSound: 10/10\\n\r\nI loved the opening of the 4-minute shorts. The background music were mostly very unique, well-suited, and catchy (8.5/10 for music). I think it should be strongly noted that the sound effects were masterful in this series. Sound effects in anime often go unnoticed, but this anime’s sound effects really enhanced the comedy if you took notice of them. The voice acting was absolutely fantastic! The diverse characters and their personalities were well acted out by each of the voice actors/actresses. Normally music is what largely determines the score when it comes to sound, but I feel the other areas of the sound were so strong that this category actually does indeed deserve a 10/10. \\n\\n\r\nCharacter: 10/10\\n\r\nA riveting cast set of mostly original characters. I mean, c'mon. This anime had a fucking “Nendou”. Once I discovered this “Nendou” creature, I just knew that the characters deserved a 10/10. Just kidding, but in all seriousness, this series had many really diverse characters including: a Nendou, dramatized narcissistic perfect girl who attracts everybody but Saiki, average girl, chuunibyou guy character, thug character, tsundere grandpa, workaholic, deliberately annoying kids, shitty magicians--- there’s too much substance here to list them all! All of the main characters get pretty well developed as well. \\n\\n\r\nEnjoyment: 10/10\\n\r\nThis series had me laughing very hard every day! The simple and fast humor was perfect for my tastes. Often other popular comedy anime, like Nichijou for example, take much too long to get the jokes across and consequently make the watchers feel bored. Saiki Kusuo no Psi-nan usually hits you with the jokes so fast and repeatedly that you only have a few moments to let it sink in before it hits you with the next one. I’m so glad this anime had a bold, new type of episode design where it did 4-minute comedy sketches released once a day (most days). I was so excited to watch a fun new skit from this series every day. At the end of the weeks, the five 4-minute sketches were compiled into a single normal-length episode. I think this anime will be setting the precedent for future 4-minutes-a-day comedy anime. I look forward to season 2!\\n\\n\r\nOverall: 10/10  \\n\r\nTL;DR \\n\r\nThis is one of the funniest comedy series I’ve ever seen! You WILL laugh if you watch this series. The story was non-complex and in the form of multiple short skits with no overarching unifying plot (It’s just following Saiki as he lives his god-like superior being life). The art was pretty basic, but it didn’t take away from the series much. The background noises and voice acting were all great, but the opening song and the “shit’s going down” BGM were the only memorable OSTs for me. The main characters were all very unique, diverse, added to the comedy, and well developed by the end of the series. \\n\\n\\n\r\nShould you watch this series?\\n\r\nIf you’re looking for a comedy series, then hell yeah you should!\\n\r\nIf you want to try a new type of series that you haven’t seen before, yeah watch it!\\n\r\nIf you’re looking for a sci-fi, then ehh it’s not THAT sci-fi related but you can give it a shot. \\n\r\nIf you’re looking for a serious, complex, and/or linear plot with an end-goal, then you’re definitely in the wrong place buddy.\\n\\n\r\nThis series was too great! You should definitely watch it! \\n\\n\r\nIf you thought this review helped you make your decision please let me know by clicking the “helpful” button~ If you thought it was wrong or inaccurate, let me know why so I can improve my reviews in the future ^^.",
            "date": "2017-01-01T13:03:00+00:00",
            "helpful_count": 79,
            "mal_id": 237187,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1244257.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/3xTripple",
                "username": "3xTripple"
            },
            "url": "https://myanimelist.net/reviews.php?id=237187"
        },
        {
            "content": "I personally think that this is the best physic anime your probably ever going to watch.  It has great comedy and this serious attitude of the character just makes it more hilarious. Of coarse this is my opinion you don't have to agree with it. It also has a certain comedy that probably only a few like. I don't like the fact that it's only 5 mins last time the made a anime out of it they only had one episode I'm not sure if the other adaption was a OVA or not. But I definite recommend this show I just hope it doeswell in the future",
            "date": "2016-07-26T16:53:00+00:00",
            "helpful_count": 92,
            "mal_id": 225097,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4623198.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GintokiLover01",
                "username": "GintokiLover01"
            },
            "url": "https://myanimelist.net/reviews.php?id=225097"
        },
        {
            "content": "With the abundance of short four minute episode anime becoming increasingly more common every anime season, Saiki-kun felt like a breath of fresh air from the same boring and tiring formula that has been used ever so frequently.\r\nOne thing that works in favour of the show above others of the same format is that Saiki-kun lasted for many more episodes while also airing a new episode everyday. My main problem with these types of shows is the weekly formula as they're airing; once the episode stops and the next one begins the following week its hard to keep track of what has happened and theshow feels like it is going nowhere. Sure, this problem is eliminated after the show has finished airing but the lack of episodes also means a lack of characterisation and story progression which, fortunately, Saiki-kun does not lack.\\n\\n\r\nSaiki-kun tells the story of a teenager who has physic powers but ends up living a life in which these powers are more of an annoyance then a gift. The show follows his life and how he uses these various powers for different situations; very basic stuff for a basic type of show. But the main strength of this show lies in its comedy and its characterisation. Each character has an interesting gimmick and quirky personality which all bounce off each other  rather effectively throughout the show as they find themselves in various scenarios and situations. Most characters have more depth and personality traits to them then just what is on the surface which invokes a lingering sense of anticipation as each character will act in a different way based on the situation at hand keeping the comedy fresh and interesting.\\n\\n\r\nThere is also a variety in jokes keeping the comedy from becoming too stale or repetitive and the four minute formula only helps with this. There are also many references in the show to other manga and anime, which if you're like me, then you'll enjoy since I like referential comedy. What's good about this show is that it doesn't rely solely on references (which can become tiresome after a while) as most of the comedy is derivative of the interaction between the characters. In terms of an over-arching story there is really none aside from a few mini-arcs which sees one particular scenario play across a multitude of episodes. The animation and art style were not always the best and could at times look plain ugly and strange but it was nothing bad enough to take any pleasure away from the overall experience.\\n\\n\r\nIn conclusion, Saiki-kun was a refreshing four minute show that actually has substance with fun characters and great comedy. I would recommend it.",
            "date": "2016-10-28T13:08:00+00:00",
            "helpful_count": 50,
            "mal_id": 232796,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=232796"
        },
        {
            "content": "This incredible show can redefine how you view anime. My initial reaction, mentally, was to fault it for the continuous expositional dialogue from the protagonist. In visual media and in general in creative works, it's often a crutch substituting a good character introduction and development, but in Saiki Kusuo the stream-of-consciousness style grows on you as innovative and postmodern and eventually it plays on essential role to the themes of the anime. It's a really interesting narrative style that adds a lot to the characters.\r\nThe art style stands out as distinct but at the same time seems very natural. Something that stood out to meis that minor or background characters have thought put into their designs and they're distinguishable, which is something that can't be said even for many good shows. It goes out of its way to explain why the main character looks so conspicuously like a protagonist and justifies the weirdness of the hair styles of the other characters and not only is it not presented in a way one would expect, but it's pretty funny. \\n\\n\r\nThe meta-ness is also unique. Certain elements of meta-humor have become cliche, and the anime in several instances subverts the expectation that it will follow a particular meta-trope by setting it up and them subverting it. That's honestly remarkable. That's not to say it's flawless in its approach, but when a joke about some trope itself has become a trope, you can expect some interesting deviation. One beautiful thing is that, in a way, Saiki personally takes on the role of the frame. He takes responsibility for making the world is different from our own in ways that many shows take for granted, while also justifying the omniscience as a first person point of view.\\n\\n\r\nThe characters are interesting and capture the youthful aggrandizement of the world that distinguishes those memories from their experiences. Not only can the viewer see how everything feels more important in the moment, but the dissonance felt as a result is clearly intentional. Also, there seem to be fairly few genuinely one-dimensional characters, and since the anime isn't over yet there is some benefit of the doubt since so far it has been quite effective in bringing back previously less-developed characters and building on them. \\n\\n\r\nThe characters themselves don't take the premise for granted, which is also a relieving departure. That's not to say a show needs the premise to be acknowledged by its characters, but it's so rare for the atypical to be recognized as such that it's a breath of fresh air. The explanation of extremely commonly occurring story-telling tropes usually taken for granted is great. \\n\\n\r\nThis is a great anime that stands out in a variety of ways and manages to do almost everything well. The best thing is that it gradually seems to add more and more to the world as it progresses, but in such a way that the premise doesn't get repetitive or exhausting, often when it's least expected. Everyone and everything is developed, and not just linearly. It isn't constant joke after joke, but the comedy lining the series is well set up. There is so much value in this anime and I'd encourage anyone to experience it for themselves and I cannot wait to see where it'll go next!",
            "date": "2016-08-04T13:29:00+00:00",
            "helpful_count": 54,
            "mal_id": 225924,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5585065.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MillenniumA",
                "username": "MillenniumA"
            },
            "url": "https://myanimelist.net/reviews.php?id=225924"
        },
        {
            "content": "well it might get you to laugh once or twice but it will fail to keep up quickly because of the childish plot, it's very boring he never fail and the characters except for that monk boy are all trash females are annoying there is no sign of any character development, in fact, there won't be. even children show like gumball or something will amuse you more than this and more exciting things would happen there! for some reason, the main doesn't speak which lead to a poor and small dialogue. overall it's crap don't waste your time on this poorly written clairaudient experience.",
            "date": "2018-08-08T01:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 285878,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4584378.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LeonardoHarvey",
                "username": "LeonardoHarvey"
            },
            "url": "https://myanimelist.net/reviews.php?id=285878"
        },
        {
            "content": "I'm most definitely in the minority here when I say this anime isn't good, and looking at all the other positive reviews on this show I can already tell this will receive bad feedback. This show is unique comedy in its own way. It has a basic plot of a pink haired guy with superpowers trying to live a normal life. This anime is full of cliches and overused tropes, but uses them to its advantage and the show basically becomes a guy doing everything in his power to avoid cliches. Anyone who likes these kinds of comedy will definitely be interested in this butI will try to highlight the positives and negatives of this show.\\n\\n\r\nPros:\\n\r\n-Has a unique approach to comedy. With its way of dealing with cliches it makes for a fun watch\\n\\n\r\n-Characters are pretty fun for a while, and it's enjoyable watching every one of them mess with Saiki's life\\n\\n\r\n-Some moments can manage you make you laugh, even if it is just for a short moment.\\n\\n\r\nCons:\\n\r\n-Art can get pretty bad at times, but nothing enough to make you hate the show.\\n\\n\r\n-The comedy can get really repetitive and this is my main issue with this anime. At first it will manage to get a few laughs out of you but then what? After about the first 30 short episodes it runs out of ideas, really quickly. The characters go through the same process every episode, there's a dumb guy, a guy who thinks he has superpowers but doesn't, a popular girl who wants Saiki's attention and a few other people heavily relied on for comedy. Everyone and everything just becomes repetitive and boring to watch.\\n\\n\r\n-Even if it has a unique approach, the plot is unoriginal and nothing spectacular.\\n\\n\\n\r\nOverall:\\n\r\nApologies if the review was a bit shorter than most, i'm kinda tired now. To summarise, although the humour is there and it can be fun at some points, the comedy gets really dry and repeated really quickly. Not much changes plot or comedy wise so I recommend watching this at around 4 short episodes (1 compiled) a day so you don't get too bored too quickly.\\n\\n",
            "date": "2019-02-21T00:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 302118,
            "reviewer": {
                "episodes_seen": 36,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7523460.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gilliesss",
                "username": "Gilliesss"
            },
            "url": "https://myanimelist.net/reviews.php?id=302118"
        },
        {
            "content": "An anime that is so easily dismissed and left out was easily my favorite anime of not only the season but also for the entire year. Last year I felt there was no shortage of good anime. From seasoned veterans like JoJo to new shows like Mob Psycho, there was no dearth of anime I enjoyed. But between good shows there was another one which for me was great and arguably the greatest of them all. As this is a review for Saiki Kusuo (too long a name to write in full), there would be no prize for guessing the best of the lot. 5mins a day, for 5 days a week, this anime consistently delivered big on laughs. Containing with itself all sorts of humor from slapstick to deadpan, this 5 min. anime was a treasure chest filled with rich laughs.\\n\\n\r\nThe premise of the anime was simple, it follows the life of protagonist Saiki who was born with superpowers, as he navigates through various scenarios of school life interacting with various people. These powers that range from telekinesis to transformation are all not a convenient gift, they also cause minor inconveniences. Each of the episode time just above 4 min and have a different stories. Earliest episodes include Saiki dealing with his over enthusiastic but simple parents, as the series progressed we become introduced to other lively characters at his school. Again, the early episodes were used to introduce characters, set up their personalities and to showcase Saiki's relationship with them. As the show progressed the stories used these characters like paint, they were mixed and match together creating hilarious situation for Saiki as he dealt with not only the characters but with the mess they created. Another impressive thing about the anime was how it dealt with introducing characters. A lot of characters were introduced at early stages of the anime. Then the anime focused on their relationship with Saiki. When the same characters were used multiple times the show introduced new characters. Also, unlike anime like Sket Dance, all the new characters weren't introduced simultaneously; rather they were introduced over a period of time. Often not more than one character was introduced at a time. As soon as a character was introduced, the character's relation with Saiki and co. was displayed, and just when things were starting to go stale another character was introduced, launching more permutation and combination into the mix. This way throughout 120 or 24 depending on the version, the anime was able to retain its charm and freshness. \\n\\n\r\nThe show had a huge cast. The good thing about having a huge cast is to have a variety of personalities. This can be both good and bad, depending on the mangaka. Though Saiki uses this to its advantage in a big way, probably the anime's biggest strength. All, I mean every single character had something to contribute. Every character had a different personality and each personality brought with it, its own brand of humour. From Saiki's deadpan-sarcastic style to Kaido's delusions humor to Nendou's dumb humor to Teruhashi's obsessed girl, to name a few; like this every character brought something new to the show. Every character a different color in the beautiful painting. None of the character will feel repetitive or tedious. From the moment they enter to the moment they sign off, each character was an absolute delight to watch.\\n\\n\r\nThe art and sound had nothing much to complain about, not that the anime itself had many complaints. They were pretty standard. Though I personally would give a shout out to both openings. A good opening, I feel, helps set the tone of the show. In this anime both the openings were cheerful and joyous, and helped set a merry mood. They were absolutely catchy to me and despite not being a Japanese, I couldn't help but hum the tune occasionally.\\n\\n\r\nAt long last, I would say that this little anime is absolutely worth the watch and deserves way more applause than it receives. To be honest, I too skipped on this one, due to episode's duration; albeit the very thing that made me skip it made me watch it. The duration per episode, it was perfect to watch as a break in between exams. Though once I started it I watched almost 30 episodes of it at once. After that everyday watching the 5 mins of the show and anticipating the next episode for 23hrs and 55 mins became part of my schedule. Thus, as said earlier this anime is perfect for the watchers who are looking for something hilarious and fun to watch and stress off on.",
            "date": "2017-02-04T08:55:00+00:00",
            "helpful_count": 18,
            "mal_id": 239887,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5702326.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CivilianHero",
                "username": "CivilianHero"
            },
            "url": "https://myanimelist.net/reviews.php?id=239887"
        },
        {
            "content": "Anime, as a medium, does not leave me all that satisfied when it comes to the comedy genre. I can count around 4-5 comedy series that managed to get some enjoyment out of me. Two examples would be Cromartie High School and Nichijou. The former, except of being a top-notch comedy series with many bizarre happenings and wacky moments, is also an excellent parody of immeasurable things, including capitalism, gangs, the toll that technology takes on us people, and many many more. The latter is more of an incredible comedy with its fair share of wacky moments on the one hand, exquisite art on theother, also working as a successful parody of moe (K-on, Lucky Star, etc. You do know the deal, I bet).\\n\\n\r\nChecking last season's line-up, quite the amount of series spiked my interest. I stumbled across this entry called \"Saiki Kusuo no Ψ-nan\" (I am fortunate because I am Greek, otherwise I would have to use \"Psi\"). What I got out of a first taste of the thingy was:\\n\r\n>Comedy\\n\r\n>5 minutes per episode\\n\r\nI backed away immediately when I read the two factors above. A short, and a comedy at that? All I got was an intuition that it would definitely fail. However, my prejudice got proved wrong. After pushes from several people, I decided to give its first episode a try. What I found out is that I could not stop pressing the \"next episode\" button. That's the moment when I said to myself that yup, Saiki Kusuo no Ψ-nan might have been able to measure up to the several anime comedies that I loved. It truly did, I presume. It even managed to refer to my given examples pricelessly.\\n\\n\r\nThe series is about your dude named Saiki Kusuo, who has a lot of psychic powers on his hands, ranging from telekinisis to reading minds to changing sceneries and perceptions of other people. This might sound awesome to some, but our man does not agree. He thinks that harboring all those powers is a hassle most of the times. Letting alone that he does not care about almost anyone, he just wants to lead a calm life, not get into the center of attention that would have been possible hadn't he been who he was, and not get involved with many kinds of people in a more personal manner. Unfortunately for him, that ain't gonna be the case, because he makes many encounters on the way.\\n\\n\r\nThere is not a specific plot we could speak about, because the series is strictly episodic, except in some cases where few-episode arcs are evident. The pacing is very fast, as expected from a short and wacky comedy at that, but not in a way that it might feel unnatural in a way. The series itself is quite random of course, but it manages to be satisfying when it comes to pacing and transitions. Especially the transitions, which fit incredibly well with the main point of the series, its all-around pleasing spontaneousness. In contrast with that, it usually takes place at Saiki's home and/or the school he attends.\\n\\n\r\nIn addition, Saiki-Kusuo no Ψ-nan manages to bring about a great sense of how cliches should be handled. The dude who wants to lead a peaceful life, the narcissistic girl, the eighth year syndrome pupil, the hyped and hyperkinetic youth, the perverted pal who also has psychic powers, the lad who can not think, moms and dads that fight a lot yet love each other. The whole run is plagued with anime cliches, something that usually does not work well. With Saiki Kusuo though, it was more than triumphant. \\n\\n\r\nConsequently, we strive towards the character section. The whole cast is, for the lack of a better term, hilarious. Not as much the cliches they represent, but the interactions in between, and the situations they are orchestrated to follow. Whether it be slapstick, or wackiness, or long monologues that our main character tends to have, the show relies heavily on its characters. One or two jokes might be able to slip out of my line of perception, but other than that, the humor hits home. That is one thing that this series should not be missed for.\\n\\n\r\nEven if it was not one of its main intentions to develop characters of course, some change between the starting and ending episodes can be detected in the long run. Still managing to representing cliches in a really pleasing way, Saiki Kusuo no Ψ-nan manages to make our tremendously fun cast to evolve, especially the main character. This change, as I would name it, is mostly evident towards the series' end. Along with this partial development come the emotional scenes, which work surprisingly well.\\n\\n\r\nThe art and animation are digestible for a short. There is this short episode which explains as of why all the characters have weird hair styles and harbor strange accessories and clothes in many of the circumstances, and how Saiki changed those things. (And then you might think about why he has those strange game machine-like thingies on his head.) Just thinking about that makes me laugh further more. The backgrounds are nice, though not something I would bother talking a lot about. Character designs, in general, are a joy to bestow, because of the factors mentioned above.\\n\\n\r\nSoundtrack-wise, the opening is full of wack and a nice way to prepare for the short heaven that one single four minute episode might be. The tracks included are not all that memorable to me, to be completely honest, because I was way too busy noticing other things. There is no ending to speak of.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nNo doubts about it, I managed to enjoy Saiki-Kusuo no Ψ-nan to the fullest. Revealing one more counterpart of Saiki's life per second episode was really fun. The hilarious interactions were quite the sight. The humor, as in overall, smelled success, and some of the supernatural elements were interesting to say the least. I am more than glad to have watched this anime, especially when it did not take all that much of my time in the first place.\\n\\n\r\nOverall: 7/10\\n\\n\r\nIn conclusion, I am going to thank J.C.Staff for brightening my days with this piece. Following it for one season made it seem like it was something that was important for the anime industry. A really funny short that can bring many kinds of inventions to the table. Definitely one of the best series of 2016, along with JoJo, Shouwa Genroku Rakugo Shinjuu, Mob Psycho 100 etc.\\n\\n\r\nThanks for reading this review, feedback shall always be appreciated. I am bound to upload more!",
            "date": "2016-12-26T01:51:00+00:00",
            "helpful_count": 14,
            "mal_id": 236523,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3703551.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cynthesizer",
                "username": "Cynthesizer"
            },
            "url": "https://myanimelist.net/reviews.php?id=236523"
        },
        {
            "content": "MUST WATCH ANIME\r\nHilarious! My #1 pick for this season. \r\nAt first you may be wondering when you watch this \"really?\" \"What the...\" \r\nBut this is comedy guys and just let yourself take the ride\r\nAND best part. Have your questions. Wonder, \"how the heck did he...?\"\r\nAnd be amazed. Because all of your questions, and I mean ALL of your questions will be answered.\r\nAnd start to wonder.... is SAIKI REALLY PSYCHIC!? IS HE WATCHING US WATCH HIM!?\r\nhaha... but seriously guys, don't be too serious and enjoy the show!\r\nLots of laughs to come. \r\nArt is fitting for this anime.\r\nNot too much of a storyline, other than basically sliceof saiki's life. And how everything kind of revolves around him. But its a comedy and its great.\\n\\n\r\nSound....? all I can say is... \"Oh...\" That's all you need. ;]\\n\\n\r\nCharacters. Nendou is personally my favorite. Love the types of archetypes the creator brings in. \\n\\n\r\nEnjoyment. Extreme. I'm almost always laughing every episode. Occasionally some are not quite as funny, but those are usually the ones that are more sweet or trying to show saiki's good side\\n\\n\r\nOverall: Must watch.\\n\\n",
            "date": "2016-10-11T10:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 231599,
            "reviewer": {
                "episodes_seen": 70,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/aznlady",
                "username": "aznlady"
            },
            "url": "https://myanimelist.net/reviews.php?id=231599"
        },
        {
            "content": "\"Here's a another gag anime about an all powerful character, I think we had Sakomoto last season already ?\" - if you are having these same thoughts then... well you are missing out on a lot of fun and laughter that so many animes fail to achieve these days.\r\nSakomoto wasn't bad, but I didn't find it much appealing either. But this show achieves what Sakomoto probably failed at ..... I m still laughing at the jokes and sarcasm thrown at me even after 30 episodes and (obviously) not yet bored by the mc. \r\nMan, I haven't had a good laugh watching anime in a longtime. It's not only this intriguing mc but also the characters surrounding him which amuses me. Yea, they are a kind-of cliched characters we have all been seeing in animes for an eternity but still...they are different...they are funnier!\\n\\n\r\nAfter watching the first 30 episodes I could conclude that the voice actors are well chosen and it is probably them that gives this show another light and distinguishes itself 100s of wannabe gag-animes. Paticularly the mc's voice actor, our very own, Kamiya hiroshi fits in too well with the mc as if he is Saiki himself. The pauses and the emphasis of his sarcasm on the absurdities he faces in his not-so-average life are remarkably well executed by Hiroshi. Yeah, I have come to the point where I can't imagine Saiki to be voiced by anyone but Hiroshi.\\n\\n\r\nAnd unlike Sakomoto, the fact that every other character (be it male or female) doesn't fall for the mc due to his \"coolness\" gives me at least one more reason to watch the show.\\n\\n\r\nThe fact that it's not a single continuous 23 mins long ep each week but a 5 mins ep each day fits in perfectly with the comedic environment of the show. Now, I have strangely got addicted to this show that I find it as my daily source of fun and laughter, be it only for 5 mins. \\n\\n\r\nThough I can't call it a masterpiece just yet, but unlike other animes this season, it is probably the only anime that has still kept me hooked!",
            "date": "2016-08-17T10:39:00+00:00",
            "helpful_count": 14,
            "mal_id": 226950,
            "reviewer": {
                "episodes_seen": 32,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545016.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Venky_Shetty",
                "username": "Venky_Shetty"
            },
            "url": "https://myanimelist.net/reviews.php?id=226950"
        },
        {
            "content": "*** no spoilers ***\r\nSaiki Kusuo no Ψ-nan has short episodes, approximately four to five minutes, but this doesn't stop it from being a great comedy anime.\r\nStory, 9 out of 10:\r\nSince the episodes are about five minutes long, there isn't really any plot, except for main events, like a new character, new setting, etcetera. At several points in every episode, Saiki Kusuo no Ψ-nan always kept me laughing with it's sarcastic humor. \r\nArt, 9 out of 10: The art in Saiki Kusuo no Ψ-nan is animated very well, it suits the genres of the show, making Saiki Kusuo no Ψ-nan even better.\r\nSound, 10 out of 10:\\n\\n\r\nThe voice actors in Saiki Kusuo no Ψ-nan go with the characters very well, suiting their personalities. Although there isn't an ending song, the opening is quite pleasant.\\n\\n\r\nCharacter, 10 out of 10:\\n\\n\r\nThe characters are a main part of why Saiki Kusuo no Ψ-nan is so enjoyable to watch.     The characters vary from sports-loving characters, the nice \"pretty girl\", the somewhat retarded delinquent, the weird parents, and even more.\\n\\n\r\nEnjoyment, 10 out of 10:\\n\\n\r\nSaiki Kusuo no Ψ-nan was very funny, and I got many laughs out of this anime, due to the story, characters, and the sarcastic humor.\\n\\n\\n\r\nOverall, 10 out of 10: \\n\\n\r\nI highly recommend this anime, it's a great way to pass time, and it's sure to make you smile, so check out Saiki Kusuo no Ψ-nan!!\\n\\n",
            "date": "2016-08-24T21:49:00+00:00",
            "helpful_count": 13,
            "mal_id": 227548,
            "reviewer": {
                "episodes_seen": 31,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5531791.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NeonNinja",
                "username": "NeonNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=227548"
        },
        {
            "content": "Saiki is an anime about a boy who has psychic powers but despite this awesome gift he is very pessimistic\r\nStory: The story isn't really anything special but this anime doesn't particularly need anything grand as its very episodic and cut up in 5-minute segments.\r\nArt: Pretty awful to be honest. Characters aren't ugly but the animation is so lazy. \r\nSound: The voice acting was fine, and they have some nice quirky sound effects which can be quite charming\r\nCharacters: Saiki is a funny character and is quite relatable in his thinking, however, the surrounding characters are very over the top and can sometimes be funny, but othertimes annoying\\n\\n\r\nEnjoyment: This is just pure fun and something light-heart to put on in the background. The humour was funny at first but after a few hours of watching it became mundane.\\n",
            "date": "2018-10-13T11:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 291641,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5104482.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Moyosore",
                "username": "Moyosore"
            },
            "url": "https://myanimelist.net/reviews.php?id=291641"
        },
        {
            "content": "This is easily the best shorts of all time for me. Whether you like serious anime or not, i would recommend you this comedy anime. It's a comedy/parody anime with a cynical and normal main character who spends his everyday life hanging out with extremely odd people. \r\nThe story doesn't really have any purpose, heck i would even say that there isn't one. Instead this anime showcases the extremely weird everyday life of the main character and how he spends it which is what makes it so nice to watch. \r\nA very good thing is that the episodes do not end (almost always) randomly andthe next episode they suddenly go into a random place and time. There is an obvious timeline and you will not have to worry about what is going on or where they are. This is a common problem other shorter anime tend to have.\\n\\n\r\nAnother thing that might seem minor but actually increased the score for me is the world building. In some anime you only see the school and you kind of feel kind of shut in because of the lack of information outside of their school. In this anime they go to a lot of places and it feels like you understand how their city (including some other places) looks and it feels closer to you.\\n\\n\r\nThe art is above the usual because of how unique it is. The animation is pretty good and the designs are different. The songs and background music aren't anything special. However, the voice acting is perfectly done because everyone fits their respective roles and really expresses themselves perfectly. This is really important because this is the main reason why the comedy works very well. It would be pretty boring if they were emotionless.\\n\\n\r\nThe characters are all unique and have stupid traits which makes them likeable however extremely funny as well. There's multiple characters that fit every necessary comedic role to make every scene build up into the peak of your comedy explosion bar (the moment you'll start bursting out into laugh).\\n\r\nAnother reason the characters (and the anime as well) is so likeable is because it's kind of long and you get to know the characters pretty well.\\n\\n\r\nI guess it's time to talk about my laugh counter. Well, if you have seen and liked Gintama you should know that beating that anime is pretty hard. While it didn't do that it did certainly beat the average laughs per second compared to Gintama. This anime killed me inside a lot of times because of how genius it is with the comedy. It really understands what the anime industry needs and can feel the viewers.\\n\\n\r\nPersonally, i would recommend  that you should try out this anime as soon as you feel like it. The episodes are short so you can easily drop it if you don't like the type of comedy it offers. However if you do enjoy it you'll probably end up binging it. The great voice actors and unique characters are what makes this anime work as well as it did.",
            "date": "2016-10-29T09:11:00+00:00",
            "helpful_count": 10,
            "mal_id": 232838,
            "reviewer": {
                "episodes_seen": 85,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4009925.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Alians-",
                "username": "-Alians-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232838"
        },
        {
            "content": "I remember on a forum thread somewhere, someone posted about how they wanted to see a anime based around someone being born with pink hair and tries to go through life day after day, narrowly avoiding being the main character in whatever anime cliche is thrown at them (ignore the person falling from the sky! ignore the popular girl/boy talking to you! im never late for school, my alarm always goes off in time!), and Saiki is as close to that anime dream as we will ever get. \r\nSaiki is born with ridiculously powerful psychic abilities, to the point that he has to restrain themin order to live an every day life. This is as much plot as you get, because a plot would ruin the feel of this anime, which is essentially a slice of life if you were an All Powerful Psychic Highschooler. Except he doesnt want any friends and will go out of his way to avoid anything that sounds like it would be a nuisance, unless it will benefit him in some way. \\n\\n\r\nEach episode is 5 minutes, until a little later on when they are 20. 5 minutes seems short, but it really fits in with the format of the show well. Plus most episodes are outright hilarious. I laughed outright on the first and second eps and that was enough to get me hooked. \\n\\n\r\nAll the characters that Saiki interact with are great. They are all the anime cliches (the idiot, the PUMPED UP SPORTS GUY, the beautiful popular girl, etc, etc) but they are played around with so well. The anime really doesn't take itself seriously at all, so later on the 4th wall breaking jokes feel pretty natural instead of being way out of place. Sometimes 4th wall breaking can kill off a joke, but here its done pretty well. \\n\\n\\n\r\nThe animation is nice, the art is good and the enjoyment is easily a solid 10 just for the Teruhashi episodes alone! I'm just gutted that I've now finished them all!",
            "date": "2017-01-01T04:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 237150,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5031766.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Torra27",
                "username": "Torra27"
            },
            "url": "https://myanimelist.net/reviews.php?id=237150"
        },
        {
            "content": "it has been quite a long time since i have a blast watching an anime.\r\nfirstly and foremost, if you turned down by seeing its duration per episode, worry not!. Even though Saiki has an odd airing schedule (which is 4 minutes episode daily), every week they recap and release it to fully mainstream anime duration per-episode (which is around 24 minutes include OP-ED), so it is a decent show.\r\nSaiki is your alternate saitama version with smarter plot and funnier gags. Every episode offer you the joy of watching this supposedly very unlucky boy handling his disastrous life, and from my experience watching this golden showuntil the day i write this review, every episode is always better then the previous one. So its escalating ride of joy and fun.\\n\\n\\n\r\nwell, you dont have to believe me obviously. Just download 1 episode and try it.\\n\r\nI highly recommended this ;D .",
            "date": "2016-10-22T06:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 232310,
            "reviewer": {
                "episodes_seen": 80,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5592402.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Freya_Magna",
                "username": "Freya_Magna"
            },
            "url": "https://myanimelist.net/reviews.php?id=232310"
        },
        {
            "content": "Saiki Kusuo no Psi Nan is one of those comedies that is actually funny and not Japanese-funny. One of its strong points is that it uses a short chapter format with fast paced comedy, so there is rarely a dull filler moment. Most characters, while interesting, are \"stereotypes with a twist\", which might make some punchlines predictable. The humor of many chapters comes from the not-informed-by-the-narration fact that, although the main character appears serious and presents himself as a sort of voice of reason, he's actually kind of an idiot and does unexpected and ridiculous things with his powers. Has some nice world building thatmakes everything that happens kind of make sense in the context of the series. It includes some subtle social critique in some skits, which I personally like.\\n\r\nAnimation is nothing special, adequate for a comedy anime. Has very few off-model moments.",
            "date": "2016-08-06T12:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 226062,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1102421.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ilDesu",
                "username": "ilDesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=226062"
        },
        {
            "content": "\"You're just my father, don't give me advice\" - Saiki Kusuo\r\nComedy is a very tough genre to excel at. Why? It's because of the difficulty in knowing what tickles people's funny bone. School comedies are even more tougher to work since the school setting makes it hard to step out and make people laugh. Now there are many supernatural school comedies but none of them made me laugh. Except Saiki Kusuo. Behold, the anime that made a comedy lover like me already decide it's score at a 10 in the middle of watching the show (I decide on ratings after binging a show). This ismy review of Saiki Kusuo no PSI Nan. Yare yare, here we go.\\n\\n\r\n\"JUSTICE KNIGHTS OF THUNDER!!!\"\\n\\n\r\nSupernatural powers already allow so much more comedy that the folks went overboard and made a 120 episode anime over it, now even though they're 5 mins each they're to be enjoyed in bite sizes, much like coffee jello. Since it's a comedy a plot would be too much too ask (which makes sense) and so the only \"plot\" we got to see was the introduction of new characters. That and some very loosely tied events showed that the story isn't Saiki's best parts but plot progression isn't the only thing that is calculated in a comedy, it being a slice of life excuses that fact so we judge the scenarios that the characters are put in, and so far maybe around 5 out of the 120 episodes were remotely predictable and maybe kinda meh. The rest? Brilliant scenario making and not to mention brilliant story telling. The 5 minute per scenario focus made it even better since everything just kept a consistency of being fresh again and again. And so despite the fact that plot progression isn't the best of what a SOL (or any SOL for that matter) can offer, it more than made up for it by it's scenarios. The way the independent story moved on was easy-going and a joy to watch, even for J.C Staff who are known for being rushers. What does all this mean? Saiki has got a goddamn epic story telling mangaka being the works.\\n\\n\r\nArguably the best part of the anime is how lovable all the idiots in the anime are. We've got the main character Saiki who seems like he's the only smart guy in the group but then he gets baited by coffee jello, making him a very relatable character for reasons countless apart from the one I mentioned above. Teruhashi as well is an idiot in her own way and the fun part is how determined she is to make Saiki for \"Oh!\". Nendou goes without saying, his stupidity was so massive that it was refreshing to see such a baka in a comedy anime. Justice Knight of Thunder as well was as Chuuni as you get and Hairo was the Goku everyone knew him to be. Chiyo as well was a funny love interest although she wasn't too fixated on Saiki as Teruhashi was. That leaves us with a few characters who came a bit later on so I won't be spoiling them for you. The point is, if there's one reason why I hold Saiki Kusuo to such high regard, it's the characters. They are, were and always will be the quintessential part of the anime and a huge reason why it's such a joy to watch. An important thing about an anime is to have memorable characters, but just making them stronger and stronger and giving them multiple Saiyan powers won't do the trick, you have to make them lovable. Needless to say Saiki Kusuo more than managed that. There wasn't a single character I disliked in the anime, and that's saying something because I always have that one character I nitpick on and frankly Saiki Kusuo had me dancing with joy and laughter since it's character were so lovable and so fun to watch and interact with together. If there's one thing you should take away from this (overrating) reviewer, it's that Saiki Kusuo has one of the best casts in anime. Period.\\n\\n\r\nCasts remind me of something very important that should definitely not be missed out here, the staff who worked on this beautiful anime. The highlight would of course be our leading man Saiki Kusuo, played by legendary VA Kamiya Hiroshi. You all may know him as Ararararararararagi if you watch the Monogatari series to name just one of the many award winning roles he's played. The rest of the cast isn't an A-Lister but to push them away would be the biggest mistake you'd ever do apart from say Coffee Jello is shit (I WILL end you if you say that), none, I repeat NONE of the characters were bad in their voicing and each of the VAs selected were brilliant. Another important part is the soundtrack. (JUSTICE KNIGHTS OF THUNDER) The OST in this anime is simply breathtaking, I fell in love with the soundtrack early on and that's to say nothing about Natsuki Hanae's oh-so-wonderful voice. His voice graced the first OP and second ED and let's just say it made me go \"Oh!\". Another thing I went \"Oh!\" at was Dempagumi.inc. (What? You think I'd go \"Oh!\" at Teruhashi? Bakaka [I'm lying]). Dempagumi.inc balanced out Hanae's soothing voice with some cheerful and playful action. It was reflected in the visual itself. A fun fact is that Hanae also played Reita in the anime apart from the theme songs. This all shows just how wonderful the soundtrack was along with the amazing characters which I'm sure I don't need to mention by now.\\n\\n\r\nI've loved J.C Staff for a long time, but to say that J.C is the sole reason the anime looks good is totally unfair, the mangaka made the characters so beautiful from both the inside and outside that I was shell-shocked. Everyone was unique in their own way, and like I said before, to make an anime memorable you NEED to make them lovable and unique, and the mangaka and J.C Staff for that matter did that job elegantly. My reviews are rated according to my critical analysis of the anime by my point of view, so many times my score rating and my review rating are at odds but sometimes they do match and I'm sure this is one of those times they do. Why am I saying this? I gave Saiki a score of 10. Now I don't know what rating I gave it now (since I'm writing this before actually rating it in it's respective places) but I'm sure they'll be really close. The reasons are very simple. Be it my critical analysis or my personal enjoyment, Saiki Kusuo is an anime that is simple fun. It's an anime you relax to, cheer up to where you're down or just laugh when you're with your Aibos. Even if you don't have friends (Hontoni just find some friends then :P) watching these lovable idiots in action will give your perhaps cold heart some much needed warmth. \\n\\n\r\nSaiki has a lot of things to it's name. It's first and foremost THE most hilarious school comedy I have EVER seen. Then it has some of the most memorable characters. A soundtrack to dance or sleep to (Ah Hanae Natsuki <3). A well constructed MC. A non-flat love interest. A hilarious Chuuni for once. A whole set of lovable idiots and so much more. And if these don't sell you off then I'm sorry but you won't find a school comedy that gets better than this. I'm well aware that I used to overrated anime before but this isn't just me speaking. This is the MAL score speaking, this is the popularity speaking, this is the amount of favorites this anime has that's speaking. I'm constantly rambling on about the good of the anime (ahem no faults here apart from plot progression) but it's all on you the viewer. Saiki Kusuo speaks for itself. Will you try a much praised show? Are you going to lose something by trying a 5 min per ep show? Do you want to laugh? If your answers to all three questions was \"Yes!\" then dear sir/madam/person, get your funny bone ready, because it's about to be tickled, like REALLY tickled. Say hello to the best school comedy anime!\\n\\n\r\nOverall Score: 9.4 (\"OH! THIS MUST BE DARK REUNION AT WORK!!! THIS CALLS FOR JUSTICE KNIGHTS OF THUNDER!!!\")\\n\\n\r\nP.S: Girl Saiki is worth dying for. Yes, Girl Saiki is better than Teruhashi (maybe). Tbh Girl Saiki best trap, fight me :P\\n\\n\r\nP.P.S: Oi we got season 2? Majide???\\n\\n\r\nWait, the review is over already? Yare-yare. See you next time! ^_^",
            "date": "2018-03-18T09:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 274194,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=274194"
        },
        {
            "content": "-- This is my first review so please bear with me --\r\nI have been thirsting for a comedy anime that's actually funny ever since the winter season of this year ended and Saiki Kusuo no Psi-nan fits the bill. I'm really upset that it isn't getting much attention cause this anime is gold.\r\nStory: 8\r\nThis anime doesn't really have a defined plot as it's just instances where Saiki's psychic powers make his life hard or where Saiki gets attention that he doesn't want. However, each episode in itself has its own (hilarious) mini plot (some of these plots span for multiple episodes) and it's not entirelyepisodic as the characters somewhat develop based on what happens in the previous episodes. \\n\\n\r\nArt: 7\\n\r\nThe art style isn't ugly but it's not the most beautiful thing ever. It's about average, almost generic looking. The colors, however, are very vibrant and add on to the wackiness of this anime. It was a smart move to make Saiki the brightest character since he doesn't want to stand out in any way.\\n\\n\r\nSound: 7\\n\r\nThe opening isn't really special; it's a catchy, 10 second song. Most of the BGM doesn't really stand out, but it still adds to the scene. However, the short song that plays when the chuunibyou, Kaidou, does anything weird easily makes up for the lack of BGM or opening as it's so cool it's ridiculous and makes the situation ten times more funny. \\n\r\nThe voice acting in this anime is pretty well done. Hiroshi Kamiya does a good job at making Saiki sound very unfazed and cynical and the rest of the voice actors add on to each character's personality and makes the anime come together.\\n\\n\r\nCharacters: 10\\n\r\nThe characters are what make this anime hilarious. Saiki is a cynical boy with god-like psychic powers and just wants to be left alone while every supporting character acts like an annoyance to his life. For example, there's Nendou, Saiki's \"friend\" that is basically empty headed, Kaidou, the chuunibyou, and Saiki's own parents that take advantage of his psychic powers. Watching how Saiki interacts with each character (aka. trying to push them away) makes up most of the enjoyment that the anime has to offer. Saiki's also the most chill tsukkomi I've ever seen and that just makes his character even more great.\\n\\n\r\nEnjoyment: 10\\n\r\nI consider this anime to be the funniest and most underrated anime of the season. A lot of the episodes are pretty relatable to someone like me (introverted and kind of antisocial) and make the anime that much better. Most people seem to be disappointed because the anime is only four minutes long, but I feel like it adds to the enjoyment of the anime since it's impressive to see how much they can fit in one episode without making the anime feel rushed in any way. There's also supposedly going to be 85 episodes so there is enough content to keep you entertained.\\n\\n\r\nOverall: 9\\n\r\nI'm a sucker for comedy anime and I could easily put this in my list of the Top Seven(?) Funniest Anime. I can easily recommend this anime to anyone that wants a good laugh and doesn't mind short anime.",
            "date": "2016-08-24T11:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 227509,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4259189.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/flababe",
                "username": "flababe"
            },
            "url": "https://myanimelist.net/reviews.php?id=227509"
        }
    ],
    [
        {
            "content": "REVIEW REUPLOAD\r\nOLD REVIEW WAS DELETED SINCE IT WAS POSTED TO SOON\r\n-SPOILER FREE-\r\nSaiki Kusuo no Ψ nan is a comedy slice-of-life story about Saiki Kusuo who has special powers that allow him to do pretty much anything.\r\nThe Episodes are not very long with around 4-5 min per episode but the episodes are coming out almost daily right now.\r\nStory: 8/10\r\nThere is no core story as there is always another core in each episode, but the main story (that is that Saiki Kusuo has special powers) still affects all episodes.\r\nThere are some surprising moments that really catch you off guard and you never expected.\r\nArt: 8/10\r\nThe art is verybeautiful with good animation and good character design and all characters are very different!\\n\\n\r\nSound: 9/10\\n\r\nThe voice acting is good and the intro song is very catchy, there is no outro song. The background music/sounds are fitting and enjoyable.\\n\\n\r\nEdit:\\n\r\nThere is an outro in the 20-minute version (I watch the 5-minute version so there isn't for me)\\n\\n\r\nCharacter: 10/10\\n\r\nThe Characters are all unique and well-written, and the characters show a clear relation to each other.\\n\\n\r\nSomeone else pointed out that every character follows a cliché, for example, the sports loving class rep, the stupid delinquent or the beautiful girl everyone gets nervous around.\\n\\n\r\nEnjoyment: 10/10\\n\r\nThe Series is very enjoyable with lots of funny jokes and interesting character development!\\n\\n\\n\r\nOverall: 10/10\\n\r\nI recommend this anime to everyone, it's funny, well written and definitely not a waste of your time! Give it a try!\\n\\n\r\nEdit after watching 56 episodes:\\n\r\nThe more you watch the most things Saiki does, one of the jokes is also the writer making stuff up on the spot and Saiki commenting on that breaking the 4th wall, relationships are also (in a sense) build trough the series\\n\\n\r\n-Laurin",
            "date": "2016-07-15T07:44:00+00:00",
            "helpful_count": 276,
            "mal_id": 224082,
            "reviewer": {
                "episodes_seen": 56,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4695462.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Laurin",
                "username": "Laurin"
            },
            "url": "https://myanimelist.net/reviews.php?id=224082"
        },
        {
            "content": "Aired during the Summer and Fall 2016 seasons, Saiki Kusuo no Ψ-nan is (hopefully just for now) a hidden gem in comedy anime that I can't recommend enough to watch.\r\nThe protagonist in this story, Saiki, is a boy that was born with psychic powers in a normal world. He can read minds, he can teleport from one place to another, he can restore things (people included) to their previous state in the past… and these three are just a few examples of all that he can do. Saiki is so powerful that, if he wanted to, he could singlehandedly take control of the Earth ina few days, is that his intention? Hell no! He just wants to live a quiet life, and I can already tell you that he isn't even close to have one.\\n\\n\r\nFrom his family, to his classmates, to seemingly anyone he meets, everyone is a weirdo, and they are all hilarious and awesome in their own way and won't let Saiki alone for a second. There is Shun, the chuunibyou that believes in the existence of Dark Reunion, an evil organization that only he can defeat (even if in reality he is a complete weakling), Nendou, a character that is so empty-headed that Saiki is not able to read his mind, Teruhashi, a girl that is considered perfect by everyone (especially herself), and so, so many other awesome characters that will grow up on you and make you laugh so much.\\n\\n\r\nSaiki itself is a fantastic and unique character, he's a straight man (and the only sane person around) that doesn't fully act like one, instead of shouting like it's the usual, he stays silent for the other characters, and we can listen to him internally complaining in his normal tone, there is something so funny about seeing him wondering what the hell is wrong with everyone, all while keeping his trademark deadpan face, that rarely changes outside of when near his biggest weakness: coffee jello, he absolutely loves it and he will do anything for them.\\n\\n\r\nThe variety that having psychic powers provides to the story makes this anime so great, every episode feels very different to the others thanks to the multiple uses that they have. The humor itself is quite fast paced, and manages to be constantly funny, you will be laughing all the time while watching this anime. All the side characters get the right amount of screen time to become memorable, yet never feel like they are overused. The 4th wall breaks are fantastic, and I really have to mention the parodies, that are mostly from other popular games and series that everyone knows about, so one is not left with a “well, I don't get it” reaction everytime they happen.\\n\\n\r\nThe art style and animation of this anime is honestly pretty average, it doesn't look bad, but it's definitively not a high budget work at all, I personally don't give much value to that since the main objective in this type of stories is to make us laugh, and actually, if used properly, that can work  pretty well in their favour, this can be especially be seen in scenes featuring Nendou, where the intention is to make him look as derp as possible and that helps making it even better.\\n\\n\r\nIn the sound department, as most of the time with comedies, the songs are quite forgettable and mostly there to simply go along with the events that happen, there is one big exception though, and it's the “JUDGEMENT KNIGHTS OF” song that follows some Shun scenes and makes them so much better. Both two opening and ending themes are pretty good, especially “Ψ desu I LIKE YOU”, the first ending theme (or the opening one if you watch the shorts), that is a very catchy song.\\n\\n\r\nThis next and final point is meaningless for the new watcher now that this anime finished, but I really need to still mention it, Saiki Kusuo aired as both a series of shorts (4 minutes episode per weekday, being 5 episodes in total each week) and one episode each Sunday, that was all of the shorts from that week together, this format was simply fantastic and I want it so much to become more popular in the future. In my timezone it meant that each weekday, when I woke up, I had one new episode available, there is simply no better way to start the day than with a good laugh, and I appreaciated it so much. \\n\\n\r\nIn conclussion, Saiki Kusuo no Ψ-nan is a very original and hilarious comedy, full of lovable characters that will make you laugh from start to end. If you're a fan of comedy anime, make sure to watch this one, and if you aren't, I still heavily recommend you to give it a try, because it's probable that it will greatly surprise you!",
            "date": "2016-12-25T14:11:00+00:00",
            "helpful_count": 120,
            "mal_id": 236484,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759794.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MetaThPr4h",
                "username": "MetaThPr4h"
            },
            "url": "https://myanimelist.net/reviews.php?id=236484"
        },
        {
            "content": "You're in a crowd of people and trying to hide from a really creepy dude that you know from school or work. Luckily, he hasn't noticed you yet.\r\nYou probably want to do the best you can to get out of his line of sight... right? So you've finally managed to make it behind him, but then, just as you think that you're safe, the creepy dude stays facing forward, but SWIFTLY does a horrifying 180-degree HEAD-ONLY turn. He then, with a derp face, looks SOLELY at you out of everybody in the crowd. In a shocking development, you've somehow been spotted! That \"wtf moment\" thatyou'd experience makes for comedy at its finest! You will find that type of comedy and much, much more in Saiki Kusuo no psi-nan.\\n\\n\r\nFunny does not even begin to describe this anime! That's right, it's hilarious! It's one of the best, if not the best, comedy anime that I've ever seen. It's very original and has definitely become my new favorite comedy anime.\\n\\n\r\nTL;DR at end\\n\\n\r\nStory: 10/10\\n\r\nSaiki, the main protagonist, comically takes being overpowered to a whole new level. He's basically a god-level psychic that can do anything. He's smart, has x-ray vision, one punch man level strength (or maybe All Might?), time warping, can change the laws of the universe, has telepathy, teleportation, memory wiping, there's basically nothing this guy can't do. The story follows him in his everyday life as he, an extremely superior being, has to deal with ordinary folk. He's a pretty sarcastic guy and is always doing a hilarious internal commentary about the bothersome events that happen to him throughout the anime. There is no overarching goal of the plot (it's kind of just a linear succession of skits). The pacing is often very fast, but I think that its speediness actually benefits the series because the series continuously hits you with jokes like they're bullets from a machine gun (if some jokes miss, np there are like 20 more incoming). I truly cannot imagine how they could have improved the story in this series. This story's comedy is a 10/10 masterpiece.\\n\\n\r\nArt: 6/10\\n\r\nThe artwork was very plain and the animation was a bit choppy, but it didn't take away from the series in my opinion. The simple art may have actually enhanced the series in a way. Perhaps you would have missed the comedy if you were too focused on the art? Who knows, but there's really not much to talk about when it comes to the art.\\n\\n\r\nSound: 10/10\\n\r\nI loved the opening of the 4-minute shorts. The background music were mostly very unique, well-suited, and catchy (8.5/10 for music). I think it should be strongly noted that the sound effects were masterful in this series. Sound effects in anime often go unnoticed, but this anime’s sound effects really enhanced the comedy if you took notice of them. The voice acting was absolutely fantastic! The diverse characters and their personalities were well acted out by each of the voice actors/actresses. Normally music is what largely determines the score when it comes to sound, but I feel the other areas of the sound were so strong that this category actually does indeed deserve a 10/10. \\n\\n\r\nCharacter: 10/10\\n\r\nA riveting cast set of mostly original characters. I mean, c'mon. This anime had a fucking “Nendou”. Once I discovered this “Nendou” creature, I just knew that the characters deserved a 10/10. Just kidding, but in all seriousness, this series had many really diverse characters including: a Nendou, dramatized narcissistic perfect girl who attracts everybody but Saiki, average girl, chuunibyou guy character, thug character, tsundere grandpa, workaholic, deliberately annoying kids, shitty magicians--- there’s too much substance here to list them all! All of the main characters get pretty well developed as well. \\n\\n\r\nEnjoyment: 10/10\\n\r\nThis series had me laughing very hard every day! The simple and fast humor was perfect for my tastes. Often other popular comedy anime, like Nichijou for example, take much too long to get the jokes across and consequently make the watchers feel bored. Saiki Kusuo no Psi-nan usually hits you with the jokes so fast and repeatedly that you only have a few moments to let it sink in before it hits you with the next one. I’m so glad this anime had a bold, new type of episode design where it did 4-minute comedy sketches released once a day (most days). I was so excited to watch a fun new skit from this series every day. At the end of the weeks, the five 4-minute sketches were compiled into a single normal-length episode. I think this anime will be setting the precedent for future 4-minutes-a-day comedy anime. I look forward to season 2!\\n\\n\r\nOverall: 10/10  \\n\r\nTL;DR \\n\r\nThis is one of the funniest comedy series I’ve ever seen! You WILL laugh if you watch this series. The story was non-complex and in the form of multiple short skits with no overarching unifying plot (It’s just following Saiki as he lives his god-like superior being life). The art was pretty basic, but it didn’t take away from the series much. The background noises and voice acting were all great, but the opening song and the “shit’s going down” BGM were the only memorable OSTs for me. The main characters were all very unique, diverse, added to the comedy, and well developed by the end of the series. \\n\\n\\n\r\nShould you watch this series?\\n\r\nIf you’re looking for a comedy series, then hell yeah you should!\\n\r\nIf you want to try a new type of series that you haven’t seen before, yeah watch it!\\n\r\nIf you’re looking for a sci-fi, then ehh it’s not THAT sci-fi related but you can give it a shot. \\n\r\nIf you’re looking for a serious, complex, and/or linear plot with an end-goal, then you’re definitely in the wrong place buddy.\\n\\n\r\nThis series was too great! You should definitely watch it! \\n\\n\r\nIf you thought this review helped you make your decision please let me know by clicking the “helpful” button~ If you thought it was wrong or inaccurate, let me know why so I can improve my reviews in the future ^^.",
            "date": "2017-01-01T13:03:00+00:00",
            "helpful_count": 79,
            "mal_id": 237187,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1244257.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/3xTripple",
                "username": "3xTripple"
            },
            "url": "https://myanimelist.net/reviews.php?id=237187"
        },
        {
            "content": "I personally think that this is the best physic anime your probably ever going to watch.  It has great comedy and this serious attitude of the character just makes it more hilarious. Of coarse this is my opinion you don't have to agree with it. It also has a certain comedy that probably only a few like. I don't like the fact that it's only 5 mins last time the made a anime out of it they only had one episode I'm not sure if the other adaption was a OVA or not. But I definite recommend this show I just hope it doeswell in the future",
            "date": "2016-07-26T16:53:00+00:00",
            "helpful_count": 92,
            "mal_id": 225097,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4623198.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GintokiLover01",
                "username": "GintokiLover01"
            },
            "url": "https://myanimelist.net/reviews.php?id=225097"
        },
        {
            "content": "With the abundance of short four minute episode anime becoming increasingly more common every anime season, Saiki-kun felt like a breath of fresh air from the same boring and tiring formula that has been used ever so frequently.\r\nOne thing that works in favour of the show above others of the same format is that Saiki-kun lasted for many more episodes while also airing a new episode everyday. My main problem with these types of shows is the weekly formula as they're airing; once the episode stops and the next one begins the following week its hard to keep track of what has happened and theshow feels like it is going nowhere. Sure, this problem is eliminated after the show has finished airing but the lack of episodes also means a lack of characterisation and story progression which, fortunately, Saiki-kun does not lack.\\n\\n\r\nSaiki-kun tells the story of a teenager who has physic powers but ends up living a life in which these powers are more of an annoyance then a gift. The show follows his life and how he uses these various powers for different situations; very basic stuff for a basic type of show. But the main strength of this show lies in its comedy and its characterisation. Each character has an interesting gimmick and quirky personality which all bounce off each other  rather effectively throughout the show as they find themselves in various scenarios and situations. Most characters have more depth and personality traits to them then just what is on the surface which invokes a lingering sense of anticipation as each character will act in a different way based on the situation at hand keeping the comedy fresh and interesting.\\n\\n\r\nThere is also a variety in jokes keeping the comedy from becoming too stale or repetitive and the four minute formula only helps with this. There are also many references in the show to other manga and anime, which if you're like me, then you'll enjoy since I like referential comedy. What's good about this show is that it doesn't rely solely on references (which can become tiresome after a while) as most of the comedy is derivative of the interaction between the characters. In terms of an over-arching story there is really none aside from a few mini-arcs which sees one particular scenario play across a multitude of episodes. The animation and art style were not always the best and could at times look plain ugly and strange but it was nothing bad enough to take any pleasure away from the overall experience.\\n\\n\r\nIn conclusion, Saiki-kun was a refreshing four minute show that actually has substance with fun characters and great comedy. I would recommend it.",
            "date": "2016-10-28T13:08:00+00:00",
            "helpful_count": 50,
            "mal_id": 232796,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3420421.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LIQfilms",
                "username": "LIQfilms"
            },
            "url": "https://myanimelist.net/reviews.php?id=232796"
        },
        {
            "content": "This incredible show can redefine how you view anime. My initial reaction, mentally, was to fault it for the continuous expositional dialogue from the protagonist. In visual media and in general in creative works, it's often a crutch substituting a good character introduction and development, but in Saiki Kusuo the stream-of-consciousness style grows on you as innovative and postmodern and eventually it plays on essential role to the themes of the anime. It's a really interesting narrative style that adds a lot to the characters.\r\nThe art style stands out as distinct but at the same time seems very natural. Something that stood out to meis that minor or background characters have thought put into their designs and they're distinguishable, which is something that can't be said even for many good shows. It goes out of its way to explain why the main character looks so conspicuously like a protagonist and justifies the weirdness of the hair styles of the other characters and not only is it not presented in a way one would expect, but it's pretty funny. \\n\\n\r\nThe meta-ness is also unique. Certain elements of meta-humor have become cliche, and the anime in several instances subverts the expectation that it will follow a particular meta-trope by setting it up and them subverting it. That's honestly remarkable. That's not to say it's flawless in its approach, but when a joke about some trope itself has become a trope, you can expect some interesting deviation. One beautiful thing is that, in a way, Saiki personally takes on the role of the frame. He takes responsibility for making the world is different from our own in ways that many shows take for granted, while also justifying the omniscience as a first person point of view.\\n\\n\r\nThe characters are interesting and capture the youthful aggrandizement of the world that distinguishes those memories from their experiences. Not only can the viewer see how everything feels more important in the moment, but the dissonance felt as a result is clearly intentional. Also, there seem to be fairly few genuinely one-dimensional characters, and since the anime isn't over yet there is some benefit of the doubt since so far it has been quite effective in bringing back previously less-developed characters and building on them. \\n\\n\r\nThe characters themselves don't take the premise for granted, which is also a relieving departure. That's not to say a show needs the premise to be acknowledged by its characters, but it's so rare for the atypical to be recognized as such that it's a breath of fresh air. The explanation of extremely commonly occurring story-telling tropes usually taken for granted is great. \\n\\n\r\nThis is a great anime that stands out in a variety of ways and manages to do almost everything well. The best thing is that it gradually seems to add more and more to the world as it progresses, but in such a way that the premise doesn't get repetitive or exhausting, often when it's least expected. Everyone and everything is developed, and not just linearly. It isn't constant joke after joke, but the comedy lining the series is well set up. There is so much value in this anime and I'd encourage anyone to experience it for themselves and I cannot wait to see where it'll go next!",
            "date": "2016-08-04T13:29:00+00:00",
            "helpful_count": 54,
            "mal_id": 225924,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5585065.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MillenniumA",
                "username": "MillenniumA"
            },
            "url": "https://myanimelist.net/reviews.php?id=225924"
        },
        {
            "content": "well it might get you to laugh once or twice but it will fail to keep up quickly because of the childish plot, it's very boring he never fail and the characters except for that monk boy are all trash females are annoying there is no sign of any character development, in fact, there won't be. even children show like gumball or something will amuse you more than this and more exciting things would happen there! for some reason, the main doesn't speak which lead to a poor and small dialogue. overall it's crap don't waste your time on this poorly written clairaudient experience.",
            "date": "2018-08-08T01:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 285878,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4584378.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LeonardoHarvey",
                "username": "LeonardoHarvey"
            },
            "url": "https://myanimelist.net/reviews.php?id=285878"
        },
        {
            "content": "I'm most definitely in the minority here when I say this anime isn't good, and looking at all the other positive reviews on this show I can already tell this will receive bad feedback. This show is unique comedy in its own way. It has a basic plot of a pink haired guy with superpowers trying to live a normal life. This anime is full of cliches and overused tropes, but uses them to its advantage and the show basically becomes a guy doing everything in his power to avoid cliches. Anyone who likes these kinds of comedy will definitely be interested in this butI will try to highlight the positives and negatives of this show.\\n\\n\r\nPros:\\n\r\n-Has a unique approach to comedy. With its way of dealing with cliches it makes for a fun watch\\n\\n\r\n-Characters are pretty fun for a while, and it's enjoyable watching every one of them mess with Saiki's life\\n\\n\r\n-Some moments can manage you make you laugh, even if it is just for a short moment.\\n\\n\r\nCons:\\n\r\n-Art can get pretty bad at times, but nothing enough to make you hate the show.\\n\\n\r\n-The comedy can get really repetitive and this is my main issue with this anime. At first it will manage to get a few laughs out of you but then what? After about the first 30 short episodes it runs out of ideas, really quickly. The characters go through the same process every episode, there's a dumb guy, a guy who thinks he has superpowers but doesn't, a popular girl who wants Saiki's attention and a few other people heavily relied on for comedy. Everyone and everything just becomes repetitive and boring to watch.\\n\\n\r\n-Even if it has a unique approach, the plot is unoriginal and nothing spectacular.\\n\\n\\n\r\nOverall:\\n\r\nApologies if the review was a bit shorter than most, i'm kinda tired now. To summarise, although the humour is there and it can be fun at some points, the comedy gets really dry and repeated really quickly. Not much changes plot or comedy wise so I recommend watching this at around 4 short episodes (1 compiled) a day so you don't get too bored too quickly.\\n\\n",
            "date": "2019-02-21T00:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 302118,
            "reviewer": {
                "episodes_seen": 36,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7523460.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gilliesss",
                "username": "Gilliesss"
            },
            "url": "https://myanimelist.net/reviews.php?id=302118"
        },
        {
            "content": "An anime that is so easily dismissed and left out was easily my favorite anime of not only the season but also for the entire year. Last year I felt there was no shortage of good anime. From seasoned veterans like JoJo to new shows like Mob Psycho, there was no dearth of anime I enjoyed. But between good shows there was another one which for me was great and arguably the greatest of them all. As this is a review for Saiki Kusuo (too long a name to write in full), there would be no prize for guessing the best of the lot. 5mins a day, for 5 days a week, this anime consistently delivered big on laughs. Containing with itself all sorts of humor from slapstick to deadpan, this 5 min. anime was a treasure chest filled with rich laughs.\\n\\n\r\nThe premise of the anime was simple, it follows the life of protagonist Saiki who was born with superpowers, as he navigates through various scenarios of school life interacting with various people. These powers that range from telekinesis to transformation are all not a convenient gift, they also cause minor inconveniences. Each of the episode time just above 4 min and have a different stories. Earliest episodes include Saiki dealing with his over enthusiastic but simple parents, as the series progressed we become introduced to other lively characters at his school. Again, the early episodes were used to introduce characters, set up their personalities and to showcase Saiki's relationship with them. As the show progressed the stories used these characters like paint, they were mixed and match together creating hilarious situation for Saiki as he dealt with not only the characters but with the mess they created. Another impressive thing about the anime was how it dealt with introducing characters. A lot of characters were introduced at early stages of the anime. Then the anime focused on their relationship with Saiki. When the same characters were used multiple times the show introduced new characters. Also, unlike anime like Sket Dance, all the new characters weren't introduced simultaneously; rather they were introduced over a period of time. Often not more than one character was introduced at a time. As soon as a character was introduced, the character's relation with Saiki and co. was displayed, and just when things were starting to go stale another character was introduced, launching more permutation and combination into the mix. This way throughout 120 or 24 depending on the version, the anime was able to retain its charm and freshness. \\n\\n\r\nThe show had a huge cast. The good thing about having a huge cast is to have a variety of personalities. This can be both good and bad, depending on the mangaka. Though Saiki uses this to its advantage in a big way, probably the anime's biggest strength. All, I mean every single character had something to contribute. Every character had a different personality and each personality brought with it, its own brand of humour. From Saiki's deadpan-sarcastic style to Kaido's delusions humor to Nendou's dumb humor to Teruhashi's obsessed girl, to name a few; like this every character brought something new to the show. Every character a different color in the beautiful painting. None of the character will feel repetitive or tedious. From the moment they enter to the moment they sign off, each character was an absolute delight to watch.\\n\\n\r\nThe art and sound had nothing much to complain about, not that the anime itself had many complaints. They were pretty standard. Though I personally would give a shout out to both openings. A good opening, I feel, helps set the tone of the show. In this anime both the openings were cheerful and joyous, and helped set a merry mood. They were absolutely catchy to me and despite not being a Japanese, I couldn't help but hum the tune occasionally.\\n\\n\r\nAt long last, I would say that this little anime is absolutely worth the watch and deserves way more applause than it receives. To be honest, I too skipped on this one, due to episode's duration; albeit the very thing that made me skip it made me watch it. The duration per episode, it was perfect to watch as a break in between exams. Though once I started it I watched almost 30 episodes of it at once. After that everyday watching the 5 mins of the show and anticipating the next episode for 23hrs and 55 mins became part of my schedule. Thus, as said earlier this anime is perfect for the watchers who are looking for something hilarious and fun to watch and stress off on.",
            "date": "2017-02-04T08:55:00+00:00",
            "helpful_count": 18,
            "mal_id": 239887,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5702326.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CivilianHero",
                "username": "CivilianHero"
            },
            "url": "https://myanimelist.net/reviews.php?id=239887"
        },
        {
            "content": "Anime, as a medium, does not leave me all that satisfied when it comes to the comedy genre. I can count around 4-5 comedy series that managed to get some enjoyment out of me. Two examples would be Cromartie High School and Nichijou. The former, except of being a top-notch comedy series with many bizarre happenings and wacky moments, is also an excellent parody of immeasurable things, including capitalism, gangs, the toll that technology takes on us people, and many many more. The latter is more of an incredible comedy with its fair share of wacky moments on the one hand, exquisite art on theother, also working as a successful parody of moe (K-on, Lucky Star, etc. You do know the deal, I bet).\\n\\n\r\nChecking last season's line-up, quite the amount of series spiked my interest. I stumbled across this entry called \"Saiki Kusuo no Ψ-nan\" (I am fortunate because I am Greek, otherwise I would have to use \"Psi\"). What I got out of a first taste of the thingy was:\\n\r\n>Comedy\\n\r\n>5 minutes per episode\\n\r\nI backed away immediately when I read the two factors above. A short, and a comedy at that? All I got was an intuition that it would definitely fail. However, my prejudice got proved wrong. After pushes from several people, I decided to give its first episode a try. What I found out is that I could not stop pressing the \"next episode\" button. That's the moment when I said to myself that yup, Saiki Kusuo no Ψ-nan might have been able to measure up to the several anime comedies that I loved. It truly did, I presume. It even managed to refer to my given examples pricelessly.\\n\\n\r\nThe series is about your dude named Saiki Kusuo, who has a lot of psychic powers on his hands, ranging from telekinisis to reading minds to changing sceneries and perceptions of other people. This might sound awesome to some, but our man does not agree. He thinks that harboring all those powers is a hassle most of the times. Letting alone that he does not care about almost anyone, he just wants to lead a calm life, not get into the center of attention that would have been possible hadn't he been who he was, and not get involved with many kinds of people in a more personal manner. Unfortunately for him, that ain't gonna be the case, because he makes many encounters on the way.\\n\\n\r\nThere is not a specific plot we could speak about, because the series is strictly episodic, except in some cases where few-episode arcs are evident. The pacing is very fast, as expected from a short and wacky comedy at that, but not in a way that it might feel unnatural in a way. The series itself is quite random of course, but it manages to be satisfying when it comes to pacing and transitions. Especially the transitions, which fit incredibly well with the main point of the series, its all-around pleasing spontaneousness. In contrast with that, it usually takes place at Saiki's home and/or the school he attends.\\n\\n\r\nIn addition, Saiki-Kusuo no Ψ-nan manages to bring about a great sense of how cliches should be handled. The dude who wants to lead a peaceful life, the narcissistic girl, the eighth year syndrome pupil, the hyped and hyperkinetic youth, the perverted pal who also has psychic powers, the lad who can not think, moms and dads that fight a lot yet love each other. The whole run is plagued with anime cliches, something that usually does not work well. With Saiki Kusuo though, it was more than triumphant. \\n\\n\r\nConsequently, we strive towards the character section. The whole cast is, for the lack of a better term, hilarious. Not as much the cliches they represent, but the interactions in between, and the situations they are orchestrated to follow. Whether it be slapstick, or wackiness, or long monologues that our main character tends to have, the show relies heavily on its characters. One or two jokes might be able to slip out of my line of perception, but other than that, the humor hits home. That is one thing that this series should not be missed for.\\n\\n\r\nEven if it was not one of its main intentions to develop characters of course, some change between the starting and ending episodes can be detected in the long run. Still managing to representing cliches in a really pleasing way, Saiki Kusuo no Ψ-nan manages to make our tremendously fun cast to evolve, especially the main character. This change, as I would name it, is mostly evident towards the series' end. Along with this partial development come the emotional scenes, which work surprisingly well.\\n\\n\r\nThe art and animation are digestible for a short. There is this short episode which explains as of why all the characters have weird hair styles and harbor strange accessories and clothes in many of the circumstances, and how Saiki changed those things. (And then you might think about why he has those strange game machine-like thingies on his head.) Just thinking about that makes me laugh further more. The backgrounds are nice, though not something I would bother talking a lot about. Character designs, in general, are a joy to bestow, because of the factors mentioned above.\\n\\n\r\nSoundtrack-wise, the opening is full of wack and a nice way to prepare for the short heaven that one single four minute episode might be. The tracks included are not all that memorable to me, to be completely honest, because I was way too busy noticing other things. There is no ending to speak of.\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nNo doubts about it, I managed to enjoy Saiki-Kusuo no Ψ-nan to the fullest. Revealing one more counterpart of Saiki's life per second episode was really fun. The hilarious interactions were quite the sight. The humor, as in overall, smelled success, and some of the supernatural elements were interesting to say the least. I am more than glad to have watched this anime, especially when it did not take all that much of my time in the first place.\\n\\n\r\nOverall: 7/10\\n\\n\r\nIn conclusion, I am going to thank J.C.Staff for brightening my days with this piece. Following it for one season made it seem like it was something that was important for the anime industry. A really funny short that can bring many kinds of inventions to the table. Definitely one of the best series of 2016, along with JoJo, Shouwa Genroku Rakugo Shinjuu, Mob Psycho 100 etc.\\n\\n\r\nThanks for reading this review, feedback shall always be appreciated. I am bound to upload more!",
            "date": "2016-12-26T01:51:00+00:00",
            "helpful_count": 14,
            "mal_id": 236523,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3703551.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cynthesizer",
                "username": "Cynthesizer"
            },
            "url": "https://myanimelist.net/reviews.php?id=236523"
        },
        {
            "content": "MUST WATCH ANIME\r\nHilarious! My #1 pick for this season. \r\nAt first you may be wondering when you watch this \"really?\" \"What the...\" \r\nBut this is comedy guys and just let yourself take the ride\r\nAND best part. Have your questions. Wonder, \"how the heck did he...?\"\r\nAnd be amazed. Because all of your questions, and I mean ALL of your questions will be answered.\r\nAnd start to wonder.... is SAIKI REALLY PSYCHIC!? IS HE WATCHING US WATCH HIM!?\r\nhaha... but seriously guys, don't be too serious and enjoy the show!\r\nLots of laughs to come. \r\nArt is fitting for this anime.\r\nNot too much of a storyline, other than basically sliceof saiki's life. And how everything kind of revolves around him. But its a comedy and its great.\\n\\n\r\nSound....? all I can say is... \"Oh...\" That's all you need. ;]\\n\\n\r\nCharacters. Nendou is personally my favorite. Love the types of archetypes the creator brings in. \\n\\n\r\nEnjoyment. Extreme. I'm almost always laughing every episode. Occasionally some are not quite as funny, but those are usually the ones that are more sweet or trying to show saiki's good side\\n\\n\r\nOverall: Must watch.\\n\\n",
            "date": "2016-10-11T10:08:00+00:00",
            "helpful_count": 13,
            "mal_id": 231599,
            "reviewer": {
                "episodes_seen": 70,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/aznlady",
                "username": "aznlady"
            },
            "url": "https://myanimelist.net/reviews.php?id=231599"
        },
        {
            "content": "\"Here's a another gag anime about an all powerful character, I think we had Sakomoto last season already ?\" - if you are having these same thoughts then... well you are missing out on a lot of fun and laughter that so many animes fail to achieve these days.\r\nSakomoto wasn't bad, but I didn't find it much appealing either. But this show achieves what Sakomoto probably failed at ..... I m still laughing at the jokes and sarcasm thrown at me even after 30 episodes and (obviously) not yet bored by the mc. \r\nMan, I haven't had a good laugh watching anime in a longtime. It's not only this intriguing mc but also the characters surrounding him which amuses me. Yea, they are a kind-of cliched characters we have all been seeing in animes for an eternity but still...they are different...they are funnier!\\n\\n\r\nAfter watching the first 30 episodes I could conclude that the voice actors are well chosen and it is probably them that gives this show another light and distinguishes itself 100s of wannabe gag-animes. Paticularly the mc's voice actor, our very own, Kamiya hiroshi fits in too well with the mc as if he is Saiki himself. The pauses and the emphasis of his sarcasm on the absurdities he faces in his not-so-average life are remarkably well executed by Hiroshi. Yeah, I have come to the point where I can't imagine Saiki to be voiced by anyone but Hiroshi.\\n\\n\r\nAnd unlike Sakomoto, the fact that every other character (be it male or female) doesn't fall for the mc due to his \"coolness\" gives me at least one more reason to watch the show.\\n\\n\r\nThe fact that it's not a single continuous 23 mins long ep each week but a 5 mins ep each day fits in perfectly with the comedic environment of the show. Now, I have strangely got addicted to this show that I find it as my daily source of fun and laughter, be it only for 5 mins. \\n\\n\r\nThough I can't call it a masterpiece just yet, but unlike other animes this season, it is probably the only anime that has still kept me hooked!",
            "date": "2016-08-17T10:39:00+00:00",
            "helpful_count": 14,
            "mal_id": 226950,
            "reviewer": {
                "episodes_seen": 32,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5545016.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Venky_Shetty",
                "username": "Venky_Shetty"
            },
            "url": "https://myanimelist.net/reviews.php?id=226950"
        },
        {
            "content": "*** no spoilers ***\r\nSaiki Kusuo no Ψ-nan has short episodes, approximately four to five minutes, but this doesn't stop it from being a great comedy anime.\r\nStory, 9 out of 10:\r\nSince the episodes are about five minutes long, there isn't really any plot, except for main events, like a new character, new setting, etcetera. At several points in every episode, Saiki Kusuo no Ψ-nan always kept me laughing with it's sarcastic humor. \r\nArt, 9 out of 10: The art in Saiki Kusuo no Ψ-nan is animated very well, it suits the genres of the show, making Saiki Kusuo no Ψ-nan even better.\r\nSound, 10 out of 10:\\n\\n\r\nThe voice actors in Saiki Kusuo no Ψ-nan go with the characters very well, suiting their personalities. Although there isn't an ending song, the opening is quite pleasant.\\n\\n\r\nCharacter, 10 out of 10:\\n\\n\r\nThe characters are a main part of why Saiki Kusuo no Ψ-nan is so enjoyable to watch.     The characters vary from sports-loving characters, the nice \"pretty girl\", the somewhat retarded delinquent, the weird parents, and even more.\\n\\n\r\nEnjoyment, 10 out of 10:\\n\\n\r\nSaiki Kusuo no Ψ-nan was very funny, and I got many laughs out of this anime, due to the story, characters, and the sarcastic humor.\\n\\n\\n\r\nOverall, 10 out of 10: \\n\\n\r\nI highly recommend this anime, it's a great way to pass time, and it's sure to make you smile, so check out Saiki Kusuo no Ψ-nan!!\\n\\n",
            "date": "2016-08-24T21:49:00+00:00",
            "helpful_count": 13,
            "mal_id": 227548,
            "reviewer": {
                "episodes_seen": 31,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5531791.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NeonNinja",
                "username": "NeonNinja"
            },
            "url": "https://myanimelist.net/reviews.php?id=227548"
        },
        {
            "content": "Saiki is an anime about a boy who has psychic powers but despite this awesome gift he is very pessimistic\r\nStory: The story isn't really anything special but this anime doesn't particularly need anything grand as its very episodic and cut up in 5-minute segments.\r\nArt: Pretty awful to be honest. Characters aren't ugly but the animation is so lazy. \r\nSound: The voice acting was fine, and they have some nice quirky sound effects which can be quite charming\r\nCharacters: Saiki is a funny character and is quite relatable in his thinking, however, the surrounding characters are very over the top and can sometimes be funny, but othertimes annoying\\n\\n\r\nEnjoyment: This is just pure fun and something light-heart to put on in the background. The humour was funny at first but after a few hours of watching it became mundane.\\n",
            "date": "2018-10-13T11:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 291641,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5104482.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Moyosore",
                "username": "Moyosore"
            },
            "url": "https://myanimelist.net/reviews.php?id=291641"
        },
        {
            "content": "This is easily the best shorts of all time for me. Whether you like serious anime or not, i would recommend you this comedy anime. It's a comedy/parody anime with a cynical and normal main character who spends his everyday life hanging out with extremely odd people. \r\nThe story doesn't really have any purpose, heck i would even say that there isn't one. Instead this anime showcases the extremely weird everyday life of the main character and how he spends it which is what makes it so nice to watch. \r\nA very good thing is that the episodes do not end (almost always) randomly andthe next episode they suddenly go into a random place and time. There is an obvious timeline and you will not have to worry about what is going on or where they are. This is a common problem other shorter anime tend to have.\\n\\n\r\nAnother thing that might seem minor but actually increased the score for me is the world building. In some anime you only see the school and you kind of feel kind of shut in because of the lack of information outside of their school. In this anime they go to a lot of places and it feels like you understand how their city (including some other places) looks and it feels closer to you.\\n\\n\r\nThe art is above the usual because of how unique it is. The animation is pretty good and the designs are different. The songs and background music aren't anything special. However, the voice acting is perfectly done because everyone fits their respective roles and really expresses themselves perfectly. This is really important because this is the main reason why the comedy works very well. It would be pretty boring if they were emotionless.\\n\\n\r\nThe characters are all unique and have stupid traits which makes them likeable however extremely funny as well. There's multiple characters that fit every necessary comedic role to make every scene build up into the peak of your comedy explosion bar (the moment you'll start bursting out into laugh).\\n\r\nAnother reason the characters (and the anime as well) is so likeable is because it's kind of long and you get to know the characters pretty well.\\n\\n\r\nI guess it's time to talk about my laugh counter. Well, if you have seen and liked Gintama you should know that beating that anime is pretty hard. While it didn't do that it did certainly beat the average laughs per second compared to Gintama. This anime killed me inside a lot of times because of how genius it is with the comedy. It really understands what the anime industry needs and can feel the viewers.\\n\\n\r\nPersonally, i would recommend  that you should try out this anime as soon as you feel like it. The episodes are short so you can easily drop it if you don't like the type of comedy it offers. However if you do enjoy it you'll probably end up binging it. The great voice actors and unique characters are what makes this anime work as well as it did.",
            "date": "2016-10-29T09:11:00+00:00",
            "helpful_count": 10,
            "mal_id": 232838,
            "reviewer": {
                "episodes_seen": 85,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4009925.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/-Alians-",
                "username": "-Alians-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232838"
        },
        {
            "content": "I remember on a forum thread somewhere, someone posted about how they wanted to see a anime based around someone being born with pink hair and tries to go through life day after day, narrowly avoiding being the main character in whatever anime cliche is thrown at them (ignore the person falling from the sky! ignore the popular girl/boy talking to you! im never late for school, my alarm always goes off in time!), and Saiki is as close to that anime dream as we will ever get. \r\nSaiki is born with ridiculously powerful psychic abilities, to the point that he has to restrain themin order to live an every day life. This is as much plot as you get, because a plot would ruin the feel of this anime, which is essentially a slice of life if you were an All Powerful Psychic Highschooler. Except he doesnt want any friends and will go out of his way to avoid anything that sounds like it would be a nuisance, unless it will benefit him in some way. \\n\\n\r\nEach episode is 5 minutes, until a little later on when they are 20. 5 minutes seems short, but it really fits in with the format of the show well. Plus most episodes are outright hilarious. I laughed outright on the first and second eps and that was enough to get me hooked. \\n\\n\r\nAll the characters that Saiki interact with are great. They are all the anime cliches (the idiot, the PUMPED UP SPORTS GUY, the beautiful popular girl, etc, etc) but they are played around with so well. The anime really doesn't take itself seriously at all, so later on the 4th wall breaking jokes feel pretty natural instead of being way out of place. Sometimes 4th wall breaking can kill off a joke, but here its done pretty well. \\n\\n\\n\r\nThe animation is nice, the art is good and the enjoyment is easily a solid 10 just for the Teruhashi episodes alone! I'm just gutted that I've now finished them all!",
            "date": "2017-01-01T04:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 237150,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5031766.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Torra27",
                "username": "Torra27"
            },
            "url": "https://myanimelist.net/reviews.php?id=237150"
        },
        {
            "content": "it has been quite a long time since i have a blast watching an anime.\r\nfirstly and foremost, if you turned down by seeing its duration per episode, worry not!. Even though Saiki has an odd airing schedule (which is 4 minutes episode daily), every week they recap and release it to fully mainstream anime duration per-episode (which is around 24 minutes include OP-ED), so it is a decent show.\r\nSaiki is your alternate saitama version with smarter plot and funnier gags. Every episode offer you the joy of watching this supposedly very unlucky boy handling his disastrous life, and from my experience watching this golden showuntil the day i write this review, every episode is always better then the previous one. So its escalating ride of joy and fun.\\n\\n\\n\r\nwell, you dont have to believe me obviously. Just download 1 episode and try it.\\n\r\nI highly recommended this ;D .",
            "date": "2016-10-22T06:22:00+00:00",
            "helpful_count": 10,
            "mal_id": 232310,
            "reviewer": {
                "episodes_seen": 80,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5592402.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Freya_Magna",
                "username": "Freya_Magna"
            },
            "url": "https://myanimelist.net/reviews.php?id=232310"
        },
        {
            "content": "Saiki Kusuo no Psi Nan is one of those comedies that is actually funny and not Japanese-funny. One of its strong points is that it uses a short chapter format with fast paced comedy, so there is rarely a dull filler moment. Most characters, while interesting, are \"stereotypes with a twist\", which might make some punchlines predictable. The humor of many chapters comes from the not-informed-by-the-narration fact that, although the main character appears serious and presents himself as a sort of voice of reason, he's actually kind of an idiot and does unexpected and ridiculous things with his powers. Has some nice world building thatmakes everything that happens kind of make sense in the context of the series. It includes some subtle social critique in some skits, which I personally like.\\n\r\nAnimation is nothing special, adequate for a comedy anime. Has very few off-model moments.",
            "date": "2016-08-06T12:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 226062,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1102421.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ilDesu",
                "username": "ilDesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=226062"
        },
        {
            "content": "\"You're just my father, don't give me advice\" - Saiki Kusuo\r\nComedy is a very tough genre to excel at. Why? It's because of the difficulty in knowing what tickles people's funny bone. School comedies are even more tougher to work since the school setting makes it hard to step out and make people laugh. Now there are many supernatural school comedies but none of them made me laugh. Except Saiki Kusuo. Behold, the anime that made a comedy lover like me already decide it's score at a 10 in the middle of watching the show (I decide on ratings after binging a show). This ismy review of Saiki Kusuo no PSI Nan. Yare yare, here we go.\\n\\n\r\n\"JUSTICE KNIGHTS OF THUNDER!!!\"\\n\\n\r\nSupernatural powers already allow so much more comedy that the folks went overboard and made a 120 episode anime over it, now even though they're 5 mins each they're to be enjoyed in bite sizes, much like coffee jello. Since it's a comedy a plot would be too much too ask (which makes sense) and so the only \"plot\" we got to see was the introduction of new characters. That and some very loosely tied events showed that the story isn't Saiki's best parts but plot progression isn't the only thing that is calculated in a comedy, it being a slice of life excuses that fact so we judge the scenarios that the characters are put in, and so far maybe around 5 out of the 120 episodes were remotely predictable and maybe kinda meh. The rest? Brilliant scenario making and not to mention brilliant story telling. The 5 minute per scenario focus made it even better since everything just kept a consistency of being fresh again and again. And so despite the fact that plot progression isn't the best of what a SOL (or any SOL for that matter) can offer, it more than made up for it by it's scenarios. The way the independent story moved on was easy-going and a joy to watch, even for J.C Staff who are known for being rushers. What does all this mean? Saiki has got a goddamn epic story telling mangaka being the works.\\n\\n\r\nArguably the best part of the anime is how lovable all the idiots in the anime are. We've got the main character Saiki who seems like he's the only smart guy in the group but then he gets baited by coffee jello, making him a very relatable character for reasons countless apart from the one I mentioned above. Teruhashi as well is an idiot in her own way and the fun part is how determined she is to make Saiki for \"Oh!\". Nendou goes without saying, his stupidity was so massive that it was refreshing to see such a baka in a comedy anime. Justice Knight of Thunder as well was as Chuuni as you get and Hairo was the Goku everyone knew him to be. Chiyo as well was a funny love interest although she wasn't too fixated on Saiki as Teruhashi was. That leaves us with a few characters who came a bit later on so I won't be spoiling them for you. The point is, if there's one reason why I hold Saiki Kusuo to such high regard, it's the characters. They are, were and always will be the quintessential part of the anime and a huge reason why it's such a joy to watch. An important thing about an anime is to have memorable characters, but just making them stronger and stronger and giving them multiple Saiyan powers won't do the trick, you have to make them lovable. Needless to say Saiki Kusuo more than managed that. There wasn't a single character I disliked in the anime, and that's saying something because I always have that one character I nitpick on and frankly Saiki Kusuo had me dancing with joy and laughter since it's character were so lovable and so fun to watch and interact with together. If there's one thing you should take away from this (overrating) reviewer, it's that Saiki Kusuo has one of the best casts in anime. Period.\\n\\n\r\nCasts remind me of something very important that should definitely not be missed out here, the staff who worked on this beautiful anime. The highlight would of course be our leading man Saiki Kusuo, played by legendary VA Kamiya Hiroshi. You all may know him as Ararararararararagi if you watch the Monogatari series to name just one of the many award winning roles he's played. The rest of the cast isn't an A-Lister but to push them away would be the biggest mistake you'd ever do apart from say Coffee Jello is shit (I WILL end you if you say that), none, I repeat NONE of the characters were bad in their voicing and each of the VAs selected were brilliant. Another important part is the soundtrack. (JUSTICE KNIGHTS OF THUNDER) The OST in this anime is simply breathtaking, I fell in love with the soundtrack early on and that's to say nothing about Natsuki Hanae's oh-so-wonderful voice. His voice graced the first OP and second ED and let's just say it made me go \"Oh!\". Another thing I went \"Oh!\" at was Dempagumi.inc. (What? You think I'd go \"Oh!\" at Teruhashi? Bakaka [I'm lying]). Dempagumi.inc balanced out Hanae's soothing voice with some cheerful and playful action. It was reflected in the visual itself. A fun fact is that Hanae also played Reita in the anime apart from the theme songs. This all shows just how wonderful the soundtrack was along with the amazing characters which I'm sure I don't need to mention by now.\\n\\n\r\nI've loved J.C Staff for a long time, but to say that J.C is the sole reason the anime looks good is totally unfair, the mangaka made the characters so beautiful from both the inside and outside that I was shell-shocked. Everyone was unique in their own way, and like I said before, to make an anime memorable you NEED to make them lovable and unique, and the mangaka and J.C Staff for that matter did that job elegantly. My reviews are rated according to my critical analysis of the anime by my point of view, so many times my score rating and my review rating are at odds but sometimes they do match and I'm sure this is one of those times they do. Why am I saying this? I gave Saiki a score of 10. Now I don't know what rating I gave it now (since I'm writing this before actually rating it in it's respective places) but I'm sure they'll be really close. The reasons are very simple. Be it my critical analysis or my personal enjoyment, Saiki Kusuo is an anime that is simple fun. It's an anime you relax to, cheer up to where you're down or just laugh when you're with your Aibos. Even if you don't have friends (Hontoni just find some friends then :P) watching these lovable idiots in action will give your perhaps cold heart some much needed warmth. \\n\\n\r\nSaiki has a lot of things to it's name. It's first and foremost THE most hilarious school comedy I have EVER seen. Then it has some of the most memorable characters. A soundtrack to dance or sleep to (Ah Hanae Natsuki <3). A well constructed MC. A non-flat love interest. A hilarious Chuuni for once. A whole set of lovable idiots and so much more. And if these don't sell you off then I'm sorry but you won't find a school comedy that gets better than this. I'm well aware that I used to overrated anime before but this isn't just me speaking. This is the MAL score speaking, this is the popularity speaking, this is the amount of favorites this anime has that's speaking. I'm constantly rambling on about the good of the anime (ahem no faults here apart from plot progression) but it's all on you the viewer. Saiki Kusuo speaks for itself. Will you try a much praised show? Are you going to lose something by trying a 5 min per ep show? Do you want to laugh? If your answers to all three questions was \"Yes!\" then dear sir/madam/person, get your funny bone ready, because it's about to be tickled, like REALLY tickled. Say hello to the best school comedy anime!\\n\\n\r\nOverall Score: 9.4 (\"OH! THIS MUST BE DARK REUNION AT WORK!!! THIS CALLS FOR JUSTICE KNIGHTS OF THUNDER!!!\")\\n\\n\r\nP.S: Girl Saiki is worth dying for. Yes, Girl Saiki is better than Teruhashi (maybe). Tbh Girl Saiki best trap, fight me :P\\n\\n\r\nP.P.S: Oi we got season 2? Majide???\\n\\n\r\nWait, the review is over already? Yare-yare. See you next time! ^_^",
            "date": "2018-03-18T09:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 274194,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=274194"
        },
        {
            "content": "-- This is my first review so please bear with me --\r\nI have been thirsting for a comedy anime that's actually funny ever since the winter season of this year ended and Saiki Kusuo no Psi-nan fits the bill. I'm really upset that it isn't getting much attention cause this anime is gold.\r\nStory: 8\r\nThis anime doesn't really have a defined plot as it's just instances where Saiki's psychic powers make his life hard or where Saiki gets attention that he doesn't want. However, each episode in itself has its own (hilarious) mini plot (some of these plots span for multiple episodes) and it's not entirelyepisodic as the characters somewhat develop based on what happens in the previous episodes. \\n\\n\r\nArt: 7\\n\r\nThe art style isn't ugly but it's not the most beautiful thing ever. It's about average, almost generic looking. The colors, however, are very vibrant and add on to the wackiness of this anime. It was a smart move to make Saiki the brightest character since he doesn't want to stand out in any way.\\n\\n\r\nSound: 7\\n\r\nThe opening isn't really special; it's a catchy, 10 second song. Most of the BGM doesn't really stand out, but it still adds to the scene. However, the short song that plays when the chuunibyou, Kaidou, does anything weird easily makes up for the lack of BGM or opening as it's so cool it's ridiculous and makes the situation ten times more funny. \\n\r\nThe voice acting in this anime is pretty well done. Hiroshi Kamiya does a good job at making Saiki sound very unfazed and cynical and the rest of the voice actors add on to each character's personality and makes the anime come together.\\n\\n\r\nCharacters: 10\\n\r\nThe characters are what make this anime hilarious. Saiki is a cynical boy with god-like psychic powers and just wants to be left alone while every supporting character acts like an annoyance to his life. For example, there's Nendou, Saiki's \"friend\" that is basically empty headed, Kaidou, the chuunibyou, and Saiki's own parents that take advantage of his psychic powers. Watching how Saiki interacts with each character (aka. trying to push them away) makes up most of the enjoyment that the anime has to offer. Saiki's also the most chill tsukkomi I've ever seen and that just makes his character even more great.\\n\\n\r\nEnjoyment: 10\\n\r\nI consider this anime to be the funniest and most underrated anime of the season. A lot of the episodes are pretty relatable to someone like me (introverted and kind of antisocial) and make the anime that much better. Most people seem to be disappointed because the anime is only four minutes long, but I feel like it adds to the enjoyment of the anime since it's impressive to see how much they can fit in one episode without making the anime feel rushed in any way. There's also supposedly going to be 85 episodes so there is enough content to keep you entertained.\\n\\n\r\nOverall: 9\\n\r\nI'm a sucker for comedy anime and I could easily put this in my list of the Top Seven(?) Funniest Anime. I can easily recommend this anime to anyone that wants a good laugh and doesn't mind short anime.",
            "date": "2016-08-24T11:41:00+00:00",
            "helpful_count": 9,
            "mal_id": 227509,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4259189.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/flababe",
                "username": "flababe"
            },
            "url": "https://myanimelist.net/reviews.php?id=227509"
        }
    ],
    [
        {
            "content": "Every year there are many good anime that many people miss out on. This may be because its synopsis seems uninteresting, or the key visuals seem bland, or maybe there were other anime from the same season that were more eye-catching. Saiki Kusuo no Ψ-nan suffers from the same problem as it basically went unnoticed. The key visuals don’t say much and it the episodes being short-length might’ve made people expect little from it. But Saiki Kusuo no Ψ-nan manages to be not only one of the most funniest anime of the year, but also simply one of the best anime of the year.\r\n~{Story}~\r\nThe mainpremise of the series is about the protagonist, Saiki Kusuo, being a teenager with psychic powers who wants to live a normal life, but can’t because of his powers… and he always surrounded by idiots! And that’s basically what the shows about. The entire story is about how Saiki tries is best to avoid any nuisance that follows him and tries his best to have a peaceful life. There is no real structure as the entire series is episodic. However, many episodic series tend to have an overarching or backbone storyline, like Cowboy Bebop or Gintama. However, Saiki doesn’t really have a main story, it just runs on its simple premise and makes comedic situations out of it. However, its comedic situations are hilariously written and feels genuinely smart despite how silly the comedy is. Most of these episodic stories end up being just as long as a short episode (4 mins), however, some stories can go up to a couple of episodes long or 5-episodes long so it’ll fill up an entire compilation episode (20 mins). \\n\r\nStory: 7.5/10\\n\\n\r\n~{Presentation}~\\n\r\nSaiki Kusuo no Ψ-nan feels just like how a short anime should feel. It’s fast-paced which makes the series more consistently humorous, something short comedy anime have an advantage over normal-length comedy anime. Its production values are in between the quality of an average short series and an average normal-length series, and personally, it works well with these production values. As mentioned before, Saiki Kusuo no Ψ-nan is an episodic series that doesn’t really have a main story to it. But that’s also its greatest strength as it’s not restricted to follow anything other than its original premise and can do whatever it wants with its characters. Saiki Kusuo no Ψ-nan is a comedy series more than anything and it never takes any breaks with its humor. Every episode will have something to laugh to. There are a couple of heartwarming moments that compliments its humor and makes the series have a bit more depth too it.\\n\r\nPresentation: 10/10\\n\\n\r\n~{Character}~\\n\r\nMost of the characters in Saiki Kusuo no Ψ-nan are absurd, idiotic, but a lot of fun. The protagonist Saiki Kusuo is a really enjoyable main character and he doesn’t take long in becoming interesting. He’s one of the very few characters in this series who’s not a total idiot, so his contrast with the other characters is always amusing. His commentary on comedic situation is always hilarious, and the fact that he never says a single dialogue himself (since he uses his telepathic powers to communicate), makes it even funnier. He is the straight man of the series, just like how Shinpachi is in Gintama. Every other character besides Saiki has some sort of mental issue to them that makes them total idiots, but that’s what makes all of them hilarious and enjoyable. Kaidou suffers from an extreme case of chuunibyou, Teruhashi is a narcissistic girl who simply can’t understand that Saiki has no interest in her, Nendou has the same amount of brain cells as a cockroach, yet he’s Saiki’s greatest opponent, and there’s many other characters in the series that have serious mental issues, but overall make Saiki Kusuo no Ψ-nan’s cast, a unique and hilarious one. \\n\r\nCharacter: 8.5/10\\n\\n\r\n~{Art}~, \\n\r\nThe art quality of the series is very good for a short anime, but below average when compared to normal-length anime. However, since Saiki Kusuo no Ψ-nan’s original structure was a short anime that aired every weekday, its art quality should be judged in comparison to other short anime. And in this case, Saiki Kusuo no Ψ-nan looks very good. Though its art pales in comparison to other anime’s art (which is one of the primary reasons why Saiki Kusuo no Ψ-nan couldn’t end up becoming popular), but the art style really matches the series quite well. It’s quirky use of color and simplicity is put into good use for the comedic moments. Also, the character designs are really unique. Saiki’s design, with his pink hair and limiter, is something you’ll rarely seen and it’s really eye-catching. And then there’s Nendou’s design…\\n\r\nArt: 7/10\\n\\n\r\n~{Animation}~\\n\r\nAnd for a short anime, the animation quality is surprisingly pretty good, and it can be considered average for a normal-length anime. The fluidity for character movements is fairly good, and they get the job done. I mean, Saiki Kusuo no Ψ-nan isn’t really that demanding animations wise and despite it being an anime a about a psychic, it’s not an action anime so not much effort in the animations are needed. The backgrounds in the anime are a bit static and flat, but this is a common thing for short-length anime. But overall, the animation quality is very good for short anime standards, and feels much better than the poorly-animated ONA that was released three years ago (if you can call that ‘animated’ in the first place).\\n\r\nAnimation: 7/10\\n\\n\r\n~{Voice Acting}~\\n\r\nThe voice acting cast in Saiki Kusuo no Ψ-nan is filled with well-known seiyuu, which isn’t very common for short anime. Legendary status seiyuu Kamiya Hiroshi voiced Saiki and he’s perfect at it. He does his character’s pessimistic and negative personality well, and considering the fact that most of the series is just listening to Saiki’s commentary on these comedic situations, I’m glad that someone as talented as Kamiya voiced Saiki. Shimazaki Nobunaga voices Kaidou and he did a really good job as the chunnibyou character. Though I might have preferred Eguchi Takuya from the ONA, Shimazaki is still really good. Ono Daisuke does Nendou’s voice and he’s perfect. OnoD is literally the best voice for deep-voiced characters, but he’s also a perfect match for characters who lack brain cells, just like Juushimatsu from Osomatsu-san. And there’s countless of other well-known seiyuuu that are part of this series; some major characters and not-so major. Seiyuu, such as Hosoya Yoshimasa, Hino Satoshi, Kayano Ai, Tamura Yukari, Hanae Natsuki, Maeno Tomoaki, Tanaka Rie, and even Matsuoka Yoshitsugu… as a cat. Overall, the cast of well-known cast does a great job with their characters and nail their comic timing. \\n\r\nVoice Acting: 9.5/10\\n\\n\r\n~{Music}~\\n\r\nJust like most two-cour anime, Saiki Kusuo no Ψ-nan features two OPs and two EDs. The first OP used in the compilation episodes, “Seishun wa Zankoku ja nai” is a really good OP with great vocals… that doesn’t match its visuals too much, nor does it match the series as a whole. But it does represent the peace Saiki’s trying to achieve. The first ED used in the compilation episodes, “Ψ desu I LIKE YOU”, is the same as the OP used in the shorter episodes. It’s really good and it matches the wackiness of the series. The second OP, “Sai Ψ Sai Kouchou” is done by the same idol group that did the second ED and this one is, well… weird to say the least. It does match the absurdity of the series, but the second half of the OP just drastically changes and sounds weird. But it’s pretty catchy. The second ED, “Kokoro”, is sung by Hanae Natsuki (who also did the first OP) and it’s pretty soothing, (and it kind of has a feminine-style to its vocals). The background music in the series is lackluster. Nothing ever stands out, nor are they used to add a greater effect to the comedic situations, which is a shame since there’s countless of comedy anime that used their OST to add to the comic timing. \\n\r\nMusic: 7.5/10\\n\\n\r\n~{Enjoyment}~\\n\r\nSaiki Kusuo no Ψ-nan was a blast to watch from beginning to end. This series gave me more enjoyment than I originally expected from this series. It’s one of the funniest anime I’ve ever seen, and that’s saying a lot since comedy is my favorite genre for any medium. The characters are ridiculous and hilarious and Saiki with his commentary is absolutely entertaining. And the fact that HiroC voice acted him made things a lot better. As a matter of a fact, because of the great cast of seiyuu, this series manages to be a lot more hilarious. And the fact that it has no real story makes the series have a lot more freedom and not feel restrained by its own premise. \\n\r\nEnjoyment: 9.5/10\\n\\n\r\nIn the end, Saiki Kusuo no Ψ-nan is one of those unfortunate anime that got overshadowed by other anime of the same season, despite the fact that it’s a lot better than most of the stuff that did get popular this year. This anime is a treat for anyone who loves comedy anime as it is genuinely hilarious. Its characters are idiotic, but fun, including a protagonist that contrasts well with his surroundings. Supported by amazing voice acting and its episodic structure, the series manages to effectively create great comedic situations with great comic timing. If you haven’t seen Saiki Kusuo no Ψ-nan, then you should because it deserves a try. It may not be for everyone, but for those who had this series click with them, Saiki Kusuo no Ψ-nan ended up being a blast. Now, I can’t wait to see what this series has to offer in its second season!\\n\\n\r\n+ Well-written comedic situations that are consistently humorous. \\n\r\n+ Absurd and ridiculously hilarious characters and Saiki’s commentary on the comedic situations are great\\n\r\n+ Lack of a main story makes the series feel less restricted by its own premise and go all out with its comedy.\\n\r\n+ Amazing voice acting, especially Kamiya’s voice acting for Saiki.\\n\r\n- The background music isn’t used to add a greater effect to its comedic moments.\\n\r\n- Production values are lacking when compared to the average normal-length anime.\\n\\n\r\nOverall: 8.4/10",
            "date": "2016-12-31T07:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 237080,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586872.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/GoldenDevilGamer",
                "username": "GoldenDevilGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=237080"
        },
        {
            "content": "Japanese humor has a lot in common with Pepe the Frog. They’re both hella random (heh) and sometimes too deadpan, and you don't really know why they’re so funny. In fact, they shouldn't be funny. They don't deserve to be funny. \r\nBut they are. And let me stress: the former is absolutely hilarious.\r\nIndeed, few things in this world are as inherently entertaining as the sound of a Japanese man screaming \"OUUUUUHHHHHHHH\" at the top of his lungs. Why? Dunno. But it sure makes me laugh. The writers know this full well and exploit it (and a whole host of other such truths) to great effect.\r\n'SaikiKusuo no Ψ-nan' is a 5-min. per episode show that originally aired every weekday. Adapted from the manga of the same name, it follows the high school life of Saiki K. (oh look, there's already a pun!), a psychic whose powers include telepathy, teleportation, and the ability to change the entire world on a whim.\\n\\n\r\nAt this point, you might be thinking how awesome having all that power would be. If so, Saiki strongly disagrees with you.\\n\\n\r\nHe reminds me of the guy who wrote Ecclesiastes. Both reached some deep understanding of the world. And both, basically, came to a single conclusion. In a word: \"Meaningless.\" Saiki doesn't care for power. He doesn't care about relationships. He doesn't care for achievement.\\n\\n\r\nThis setup, combined with the various people that force themselves into Saiki's life, lay the groundwork for a very flexible show. The result of this flexibility? Episodes that are overflowing with jokes, puns, and gags. So overflowing, in fact, that I found myself pausing the show on many an occasion just so I could read all the subtitles on the screen. Granted, not every single one of them is going to make you laugh. But rest assured, my friends. A whole lot of them will.\\n\\n\r\nUnsurprisingly, a lot of 'Saiki Kusuo no Ψ-nan's' humor comes from the way it plays on the viewer's expectations, as hinted at earlier with Saiki's complete lack of ambition.\\n\\n\r\nEven the most ardent (or perhaps, especially the most ardent) anime fans have to admit: some of the anime we get these days are very, very predictable.\\n\\n\r\nAh yes, the harem.\\n\r\nAh yes, the dude sitting at the center of that harem who inexplicably doesn't realize he's at the center of a harem.\\n\r\nAh yes, he has this hidden power too.\\n\r\nOh, and did we mention that that power makes him ****ing OP?\\n\r\nAHHH YEEES!!! I LOVE ANIME!!!\\n\\n\r\nSaiki K. has super OP psychic powers. He (understandably) works hard to keep them well hidden. He also gets a mini harem.\\n\\n\r\n...\\n\\n\r\nAt this point, the show sticks its finger up your nose. It looks you dead in the eyes, says \"ouh,\" and snaps in half the baby spoon that all those other shows have been breastfeeding [sic] you with.\\n\\n\r\nThat pretty much sums it up.\\n\\n\\n\r\nScore Breakdown:\\n\r\n---------------------\\n\r\nStory:\\n\r\nVery Good - 8/10\\n\r\n'Saiki Kusuo no Ψ-nan' is episodic in nature, using 5 short episodes to form what would normally be a single episode (episode, episode, episode). Each of these... I'll call them arcs... is unique, fits well into the overall narrative (which is surprisingly coherent), and is suitably hilarious. In addition, I wouldn't classify any of them as \"filler.\"  Because actual filler is bad, this is good.\\n\\n\r\nAnd oh. Something I particularly liked is how the show tells a rather heartwarming overarching story. I won't go into detail, but trust me, you'll go \"aw\" and smile.\\n\\n\r\nImportant to note here, however, is that the show doesn't provide real closure on many of the larger subplots, the aforementioned one included. This, of course, is an obvious consequence of the show's detached nature and doesn’t truly detract from the experience. For those who don’t like loose ends, however (and for people like me, who are vehemently shipping Saiki and a certain blue haired girl – “…offu…”), this may prove to be a slight annoyance.\\n\\n\r\n-------\\n\r\nArt:\\n\r\nFair - 6/10\\n\r\nNothing amazing here. Though character designs are good and the sometimes ditzy style fits the tone of the show perfectly, the art never does more than it needs to.\\n\\n\r\n-------\\n\r\nSound:\\n\r\nGreat - 9/10\\n\r\nVoice acting is great, and the \"essence\" of each character is manifested very well in the way they each sound. As for music, the only memorable tracks are the opening from the 5 minute version and the second ED from the compiled version. Background music (though suitably cheesy and downright hilarious on occasion) doesn't amount to more than just background music.\\n\\n\r\nNote: I was going to give sound a 7/10 based off of the above, but then I remembered \"JUDGEMENT KNIGHTS OF\" and bumped it up 2 points. Seriously ya'll, this show is really damn funny. Even the sound gags are gold.\\n\\n\r\n-------\\n\r\nCharacter:\\n\r\nGreat  - 9/10\\n\r\nHere is where the show really shines. Despite the fact that every character falls into a well-worn archetype (e.g. the \"chuunibyou\", the earnest gym teacher, the hopeless foodie girl), each and every one is able to leave a lasting impression. Every character is a massive troll, and every single one is able to garner their fair share of laughs.\\n\\n\r\nThe best part? The show constantly, over the course of its run, introduces new characters that are just as funny as the ones who came before. While it does feel a bit cheap and formulaic at times, all such notions are instantly dispelled the moment a new character drops their first side-splitting line.\\n\\n\r\nBy the end of 'Saiki Kusuo no Ψ-nan', you may very well find yourself loving archetypes that other shows had previously conditioned you to hate out of sheer repetition. And for a show to be able to cause that, I think, is quite the crowning achievement.\\n\\n\r\n-------\\n\r\nEnjoyment:\\n\r\nOutstanding - 10/10\\n\r\nI picked this show up because of a friend's passing recommendation: \"yo dude you should watch this. is pretty funny lol\"\\n\\n\r\nNeedless to say, Saiki K. and his clueless pals did not disappoint. Right from the start, 'Saiki Kusuo no Ψ-nan' had me laughing. And I'm still laughing now just thinking about it.\\n\\n\r\n-------\\n\r\nOverall:\\n\r\nGreat! - 9/10\\n\r\nFar better than most of the stuff we get these days.\\n\\n\r\nPros:\\n\r\n+ Jam-packed with funny gags\\n\r\n+ Fantastic cast of characters\\n\r\n+ Short episodes are easy to digest\\n\r\n+ Season 2 confirmed; “Let’s continue the party,” indeed!\\n\r\n+ JUDGEMENT KNIGHTS OF\\n\\n\r\nCons:\\n\r\n- So jam-packed with funny gags that it's often hard to catch them all without pausing or rewinding\\n\r\n- Has a few short lulls in the writing\\n\r\n- Somewhat formulaic\\n\\n\\n\r\nFinal Recommendation:\\n\r\n---------------------------\\n\r\nIf you liked the humor in shows like 'One Punch Man' and 'Hataraku Maou-sama!,' this show is definitely for you.\\n\\n\r\nOn the other hand, if you know that the randomness of Japanese humor just isn't your thing… watch it anyways. This, my friend, could be the show that brings you into the light.\\n\\n\r\nIf you're in between or aren't sure, go on and give it a shot. I reckon you'll like it.\\n\\n\r\nSo yes, long story short: no matter what boat you’re in, you should put down whatever it is you’re doing right now and WATCH THIS SHOW. The goal of entertainment is to entertain, and 'Saiki Kusuo no Ψ-nan' does a fantastic job of it.\\n\\n\r\nNote: Avoid the dub if you can. This is not just me being a subs purist; the English dub bleeds the characters of far more soul than is acceptable, and the end result is a show that is markedly less funny.\\n",
            "date": "2016-12-26T12:54:00+00:00",
            "helpful_count": 7,
            "mal_id": 236574,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4518676.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Congress",
                "username": "Congress"
            },
            "url": "https://myanimelist.net/reviews.php?id=236574"
        },
        {
            "content": "The life of a psychic? Interesting. Saiki Kusuo no Psi-nan is another one of those skit animes, whose episodes are fairly short (4 mins ea.), and in each of them packs at least something to enjoy, who would've ever known how interesting Saiki's disastrous life as a psychic was going to be.\r\nStory--well, simply put, there is \"none\". While the anime doesn't follow a main story arc, there are some sequences of episodes that you'd would've wanted to watched the prior episodes to, like skits that come in parts. Other than that, you're basically watching a snarky psychic narrate his life as it unfolds.\r\nArt is prettygood, the only gripe I have with the art are the few inconsistencies you'll see here and there, and oddly drawn out frames. But, I digress: I'm picky when it comes to things like that.\\n\\n\r\nVoice acting is on-par, A+++ for the seiyuu working on this anime. Sound effects are on-par. Music is quirky and each of the character's seem to have their own theme that fit them perfectly. I'd go above and beyond 10 on this.\\n\\n\r\nThe characters are interesting and hilarious, and how they come to play a part in Saiki's life is pretty interesting. Development is rock solid, although there are a couple of other characters that are kind-of throwaway.\\n\\n\r\nAll in all, I think the greatest asset this anime has is it's level of enjoyment. The almost-daily episodes makes it a great experience in general, and when they bundle up 5 skits into one episode it almost feels like an actual anime series. I never end an episode feeling disappointed and I always want more.\\n\\n\r\nSo, overall? 9/10, and that's based solely on the enjoyment, with a couple of minor deductions from the quality of the anime itself, but honestly, the quality is a non-issue. Go watch it.",
            "date": "2016-11-16T19:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 233874,
            "reviewer": {
                "episodes_seen": 91,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ieny",
                "username": "Ieny"
            },
            "url": "https://myanimelist.net/reviews.php?id=233874"
        },
        {
            "content": "If you are interested in parody style comedy, this might be the anime for you. The episodes are short and are quite enjoyable as they are packed with humor. It is about the struggles of an OP character trying to live life quietly as a normal person, however everyone around him strives to stand out in their own way and tries to pull him in with them. I must say that the character that amuses me the most is Kaidou who is a humorous representation of a shounen/action/supernatural anime character. Kaidou thinks he is awesome with great power but in reality he is quite ordinary.His appearance on screen comes with a soundtrack that always gets me laughing.\\n\\n\r\nI think the hardest thing for me with this show was dealing with the subtitles during cross talking. The Japanese is fast paced and there is much interruptions and cross talking between characters that may be challenging for the non-Japanese speaker to follow.",
            "date": "2016-11-05T06:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 233259,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007424.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Anastazia12",
                "username": "Anastazia12"
            },
            "url": "https://myanimelist.net/reviews.php?id=233259"
        },
        {
            "content": "Kusuo Saiki is a high school student who was born with all manner of psychic abilities, including telepathy, psychokinesis, teleportation, and more. Despite having all these powers, Saiki faces all kinds of hardships and tries to avoid attention as much as possible. The story follows Saiki as he attempts to secretly use his powers to live a normal high school life while dealing with his less than ordinary classmates at P.K. Academy.\r\nStory: NA\r\nThere isn't really a main story, it's more episode-based. We are just watching this man deal with the problems that constantly arise and encircle him.\r\nArt: 10/10\r\nNothing much to say here, it's great!\r\nSound: 10/10\r\nBoththe opening and the ending songs are really good. The opening gets you hyped for the episode and the ending fills your heart with satisfaction.\\n\\n\r\nCharacter: 10/10\\n\r\nThis is where the show truly shines. Not a single character that appeared in this show felt dull. Each one of them embodied a specific personality that was unique to them. Every single character is memorable and funny.\\n\\n\r\nEnjoyment: 10/10\\n\r\nSaiki Kusuo has to be my favorite comedy series. The show was something special; it left me wanting more. Not a single episode was bad; every single one was bright and funny. It's a really enjoyable show.\\n\\n\r\nOverall: 10/10\\n\r\nI didn't want to finish this series because I didn't want it to end. The characters really grew on me. I highly recommend Saiki Kusuo no Ψ-nan to everyone. It's a really good show with quick-witted humor. There is a lot to look into in every episode.; the gags that can easily fly past you. I'm really glad I gave this series a try. It became an instant favorite not even a quarter into the show.",
            "date": "2017-02-20T22:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 241054,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5981245.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Koloshow",
                "username": "Koloshow"
            },
            "url": "https://myanimelist.net/reviews.php?id=241054"
        },
        {
            "content": "This is probably one of may favourite all time anime, i enjoyed pretty much every episode of this anime. All of the characters are interesting and unique in a way and make it a very entertaining anime. I have rated it very high as i really enjoyed it, it does has it's faults such as being quite cliched when it comes to certain points, however this didn't really bother me as the anime either states that it is cliched or makes fun of it. There is also alot of 4th wall breaks, if you find them funny.\r\nBut overall i would really recommend this anime, especiallyif you like gag anime and some stupid humour.",
            "date": "2019-03-02T17:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 302774,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5777104.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xhaia",
                "username": "xhaia"
            },
            "url": "https://myanimelist.net/reviews.php?id=302774"
        },
        {
            "content": "Story: Normal. A student with psychic powers going to school. Nothing surprising but, the situations that the protagonist passes are very interesting.\r\nArt: Normal. Some imperfections here and there but, it flows. It makes the characters even funnier. Especially the Nendou Riki.\r\nSound: It's not so bad. Just complements the anime, nothing spectacular.\r\nCharacter: The best characters in a comedy are here. Maybe just miss out on the characters from Arakawa Under the Bridge. Everyone is charismatic and can turn any scene into a comedy. It's really very funny!\r\nSaiki can make you laugh at anything, anytime. But Nendou is the one who draws the most attention, how cananyone be so dumb and funny at the same time? It's hilarious.\\n\\n\r\nTeruhashi is a little overdone, but he's also a good character.\\n\\n\r\nEnjoyment: Very funny jokes. You cling to the characters by charisma and that's one thing in the genre. Saiki and Nendou were a pair of best friends who together, have a level of humor more than * 8,000 *.\\n\\n\r\nShun is also very funny, his Chuunibyou made me laugh a lot.\\n\\n\r\nOverall: As I said earlier, it's one of the best comedy anime I've ever seen. Only lose to Arakawa.\\n\r\nWould recommend to anyone and I will watch the second season for sure.\\n\\n\r\nSorry for the graph, this review is from a Brazilian.\\n\r\nThanks for reading.",
            "date": "2017-07-05T07:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 252008,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278127.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/erickpaini",
                "username": "erickpaini"
            },
            "url": "https://myanimelist.net/reviews.php?id=252008"
        },
        {
            "content": "The Disastrous Life of Saiki K caught my eye and I'm glad it did. It is a great anime, especially for beginners.\r\nStory: 7/10\r\nThe Disastrous Life of Saiki K doesn't have a core story, but each mini-story is hilarious and keeps you hooked in and eager to watch another.\r\nArt: 8/10\r\nThe art is quite nice. The artists really did put a lot of effort into polishing the art in this show.\r\nCharacter: 10/10\r\nThe characters are great. They show that flaws are present in everyone. For example, Saiki may have psychic powers, but they aren't perfect and neither is he. Another example is Teruhashi, who shows that the perfectones are not exactly as perfect and mellow as they may seem.\\n\\n\r\nOverall, 9/10.",
            "date": "2019-02-11T07:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 301413,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7267319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VenomPoisonBlow",
                "username": "VenomPoisonBlow"
            },
            "url": "https://myanimelist.net/reviews.php?id=301413"
        },
        {
            "content": "sorry im bad english.\r\nthe best comedy anime after gintama, this anime is very funny like the character of Nendou Riki, I like it when he says RAMEN MOU IKOZE. BTW this anime is like Gintama, SKET Dance, Danshi Koukosei no Nichijou. must watch this anime!\r\nwhy am I recommending this anime, because I like the story, if you like comedy anime, you must watch this anime. maybe for me this is the best comedy anime, every episode makes you laugh.\r\nSTORY 10/10: Ok not bad.\r\nART 10/10: Ok not bad.\r\nSOUND 10/10: I like the opening and ending songs.\r\nCHARA 10/10: Simple but i like.\r\nENJOYMENT 10/10: Ok not bad.\r\nOVERALL 10/10:Ok not bad.",
            "date": "2018-09-21T14:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 289607,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7155737.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/3o3",
                "username": "3o3"
            },
            "url": "https://myanimelist.net/reviews.php?id=289607"
        },
        {
            "content": "One of the most underrated comedy anime in my opinion.\r\nNo spoilers, I promise.\r\nStory- 9\r\nHonestly there is no story, but that is the point and along with self aware jokes that does not drag and not being so repetitive and when you are linking this to the story which is the MC (Kusuo's everyday life with psychic powers) is expected of a comedy anime.\r\nArt: 8\r\nCould be better for a 2016 anime, but does not ruin the overall experience, heck makes it funnier.\r\nSound: 9\r\nI actually like the soundtrack of the anime it is memorable (shocking tbh)\r\nJust repetitive.\r\nCharacters:10 \r\nMy god they are all so funny. Literally I amcrying of laughter because everyone has such a perfect chemistry. (Only one character *cough you know who *cough* annoys the crap out of me).\\n\\n\r\nEnjoyment: 10\\n\r\nRe watchable as hell. You can watch is as many times as you want and still not get bored. Although some segments might be a pain but still not bad. Also, all memorable. \\n\\n\r\nOverall: 9\\n\\n\r\nGive it a watch! You will not regret it. As long as you do not take this anime seriously anyone will enjoy this as much as I did.",
            "date": "2017-09-28T10:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 258982,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4545459.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Mohammadalmannai",
                "username": "Mohammadalmannai"
            },
            "url": "https://myanimelist.net/reviews.php?id=258982"
        },
        {
            "content": "Simply put, this is probably the best and smartest comedy anime I've ever had the pleasure of seeing. Since it originally aired as a series of shorts, and considering the fact that it is a comedy anime after all, the physical aesthetic is pretty good, i.e., art, animation and sound are okay.\r\nThe characters are really where it's at though, with the wackiest set of characters that you can't help but want to meet in real life. It's truly brilliant, really. \r\nThe whole \"psychic powers\" thing was also smoothly integrated into the story, and almost always leads to a freaking hilarious scenario. \r\nThe actual \"plot\" isnon-existent. However, I do have a problem with the inconsistencies in the timeline. It simply isn't up to snuff, and is thoroughly confusing.\\n\r\nAll in all, don't disservice yourself by skipping on this one. It truly is up there with the likes of Gintama(not quite, however) as one of the best comedy series anime has to offer.",
            "date": "2018-04-10T14:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 277665,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5284154.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MustNotWankToday",
                "username": "MustNotWankToday"
            },
            "url": "https://myanimelist.net/reviews.php?id=277665"
        },
        {
            "content": "It brings me a lot of joy to see this type of anime being so well received by the anime community. Having not known about it until seeing that its second season was beating out My Hero Academia in the rankings, I decided to check it out. \r\nThis is like a nice mix between Mob Pshyco and Handa-Kun, as the main character is an overpowered physic who is purposely trying to distance himself from people so he can live a quiet life. But of course, as the slice of life-esc comedy kicks in, anything but that will happen. \r\nIt has a huge array of characters,that by themselves are all pretty generic characters, but when they mix together ends up creating something really unique, with our main character having to be damage control for everything that they do, as he likes to let them get into bad situations without them realizing it and saving them at the last second without them realizing anything bad was even going to happen.\\n\r\nSaiki is different from what the classic definition of a Psychic is, given this anime takes that as \"person that can do basically whatever they want with some minor side effects\". The anime also has great moments where Saiki is just so powerful that his target is the genre of \"Slice of life\" anime itself, where he actually goes out of his way to bend his world around the classics of the slice of life genre so that he doesn't stand out as much.\\n\r\nAlso, its enjoyable that every character has their own short theme, and it will play almost every time they do something dramatic, causing scenes where two characters are doing something and their themes just keep on repeating every time the screen focuses back on them, which would seem like it gets boring but because of the dual lives almost every character is trying to live, it simply builds on how the character is feeling at the moment.\\n\r\nBut I also have to appreciate that this anime doesn't try to go too far with the meta commentary on Slice of Life anime as a whole, preferring to simply use the standard rules to create a nice balanced world. \\n\r\nMy only issue is that there is simply to many characters that don't get all that much time in the spotlight, to the point of where the final episode goes out of its way to joke about that exact thing.\\n\r\nBut overall, its very enjoyable. I knew from starting the first episode I was going to enjoy it and ended watching the whole thing in one night (The series says its 120 episodes, but that's because the original release was 5 minute episodes, which was condensed down into a nice 24 episode series)\\n\\n\r\nSo yeah, overall, its about 8 coffee puddings out of 10, I'm looking forward to how far he will go to get the last two.",
            "date": "2018-04-08T09:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 277388,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5100143.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BenjaminRogers",
                "username": "BenjaminRogers"
            },
            "url": "https://myanimelist.net/reviews.php?id=277388"
        },
        {
            "content": "Saiki Kusuo no Ψ-nan is such an underrated anime that I just felt I needed to write this review. I feel like so many more people would enjoy the show if they only knew about it. So if anyone is looking at this anime and thinking to themselfs... \"i wonder if I should watch it\" then my answer is YES! And please do spread the word of this anime around to anyone who loves a laugh.\r\nStory: 9/10.\r\nThe story is about Saiki who has psychic powers and lives his life trying to keep his powers a secret from everyone. The only thing he truly wants issilence and a good Coffee Jelly. But everyday at school he meets challenges that might expose him for who he truly is. The story however is not why the anime is as good as it is. The comedy aspect of the anime is what truly makes this so good. The bad thing about this is that not everyone will enjoy the jokes and that really hits the anime the wrong way. The anime is also divided into small skits. But you can find versions that have five skits per episode and you won't even notice the difference from a normal 20 min long episode. \\n\\n\r\nArt: 8/10.\\n\r\nThere is nothing special about the art of this anime. It is your casual and typical anime style, which is ok. This anime does not need a special or unique art to make it good.\\n\\n\r\nSound: 10/10.\\n\r\nWhen you fisrt start to listen to the opening you immediately realize that this is going to be a calm and funny anime. And that fits perfectly with what the anime is trying to do. What really is amazing with the sounds in this anime is that it really amplifies the comedy aspect. Already in the first scene when the car is lifted over the dog, the sound it makes is perfect. And when we have some amazing voice actors you really see the amazing fit they all make.\\n\\n\r\nCharacters: 9/10.\\n\r\nFirst of all we have Saiki, the main character. He is a chill person that don't really care about the world. He don't want to be a superhero that others might want to be if they had his powers. He just wants to enjoy a peaceful life with a lot of Coffee Jelly. Then there is his classmates. The perfekt girl, the unpredictable fool, the coward with a lot of imagination and others. There is a whole variety of different people that make a funny ass anime.\\n\\n\r\nEnjoyment: 10/10.\\n\r\nI really enjoy this anime and I hope that more people will come to see that. This is not a anime that makes your sweat or cry, it is the perfect show to watch if you want to relax and laugh a bit. \\n\\n\r\nOverall: 9/10.\\n\r\nI recommend this anime to everyone who enjoys either comedy, superpowers, slice of life or drama. If you end up watching this anime you won't regret it and I promise you that you will laugh and you won't get enough of this show. Please recommend this anime to your friends and let's give more people the joy of watching this anime. \\n",
            "date": "2018-03-31T04:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 275856,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6585401.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Alca",
                "username": "Alca"
            },
            "url": "https://myanimelist.net/reviews.php?id=275856"
        },
        {
            "content": "https://www.youtube.com/watch?v=zXFk-wWrczc&vl=tr\r\nA very nice anime\r\nI do not want it to end.\r\nWhen I look at MAL, 85 episodes today, 120 episodes have appeared, so I will have 24 episodes. This is one of my favorite animations this year.\r\nThe humor I am looking for :) The parts I read from the people's mind are good for me: D Hele is the loser of Odunspor if I cry when I see Nendou. D Hairo needs to throw the nail in the crack, it shows at every opportunity: D Comedy solid series, Be heard.\r\nWhen I heard the voice of Hiroshi Kamiya, I almost had to throw hearts around. : P\r\nIt'sfunny, too, in this moment. I liked it frankly. ^^\\n\r\nLook at the kid, though he was in love just after the kid did nothing. :D\\n\\n\r\nhttps://www.youtube.com/watch?v=zXFk-wWrczc&vl=tr",
            "date": "2016-11-22T07:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 234185,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Wuycan",
                "username": "Wuycan"
            },
            "url": "https://myanimelist.net/reviews.php?id=234185"
        },
        {
            "content": "Saiki Kusuo no Psi-nan is one of the more unique kind of anime shorts to come out of 2016, that being broadcasted once a day only in a weekday, 120 episodes thus lasted 24 weeks AS well as broadcasting those same episodes into bulked combined 5 episodes each week. These broadcasts are really for those who wants a certain mood for it. So why did LA talk so much about the broadcast of Saiki Kusuo no Psi-nan even before making a witty comment about this anime short?...because Saiki Kusuo no Psi-nan is one of the funniest anime shorts a la Mob Psycho 100 but morein the comedic route. Which broadcast did LA watch?..the 5 minute broadcast every weekday...well with that out of the way, let's start shall we?...\\n\\n\r\nSaiki Kusuo no Psi-nan's plot by the premise about a one Kusuo Saiki voiced by Hiroshi Kamiya's wanting a normal life without the use of his powers as his powers isn't all that's cracked up to be especially in the comedic route it becomes doubly funny when Kusuo's powers backfires on him. LA did say it's like Mob Psycho 100 but more comedic route and really it has that vibe to it and if you watched Mob Psycho 100 and had that kind of atmosphere, then Saiki Kusuo no Psi-nan will give off a similar vibe. By a simple premise Saiki Kusuo no Psi-nan is really just about Kusuo's straining wanting of a normal life and NOT wanting to use his powers (unless if it has to do with coffee jello...uhhhh makes sense in context) but with the other characters...it can't be helped and hijinks DEFINITELY ensues.\\n\\n\r\nIn terms of characters, Kusuo Saiki being the central character and is one of the more self-aware character in which he KNOWS he's in an anime in this anime. Kusuo Saiki by all means really wants to be a loner (due to his childhood and ALL his powers making him turn into this cynical loner eg. he can't watch movies or TV shows as he would unconsciously use telepathy to get all the spoilers thus kill his enjoyment) but with his MANY contributing characters, he essentially is the straight man to almost every other character. You'd think that because of his cynical personality you'd think he's somewhat bland, on the contrary as since he's the straight man he becomes a reactant to most of the comedy and sometimes he's the punchline to the buildup of the episode (or episodes) with his powers (some which includes...teleportation, telepathy, time traveling, restoration, psychometry, weather manipulation, likability meters (no seriously), pyrokinesis and even memory manipulation...hmmmm felt like some of those powers were tangential to Kusuo's powers no?). Further down the plot especially by the start of the Kyoto Field Trip arc, Kusuo does show points where he wants to genuinely help someone (not as a comedic gag or anything)...Kusuo being a centralized character, he really does bring everyone together, not just comedically. \\n\\n\r\nNow aside from Kusuo, LA has ALOT to talk about with the other characters within this anime short, let's start with...Riki Nendou voiced by Daisuke Ono. He's more or less one of the more unpredictable characters for Kusuo as Kusuo can't track or use most of his powers against Nendou, yes, he's a rock solid boke to Kusuo's tsukommi, ohh and his parents all look EXACTLY like him so Kusuo can't detect them either. Shun Kaidou voiced by Nobunaga Shimazaki is your typical chunni. Shun Kaidou really is a satellite character as most of his comedy comes from the other characters reactants to him, some of his better skits are obviously with Kusuo but with him and Nendou they are essentially the three amigo's when it comes to comedy and their boke to tsukommi routine their chemistry together works wonders with Kusuo ostensibly telling us what we already know. Finally we have Reita Toritsuka voiced by Natsuki Hanae is a spirit medium but is an utter perv, he sometimes joins Kusuo and the three amigo's with their antics.\\n\\n\r\nNext are the the \"love interests\", that being Kokomi Teruhashi voiced by Ai Kayano and Chiyo Yumehara voiced by Yukari Tamura, let's go with Kokomi first. Kokomi is a perfect/\"pure maiden\" of sorts but is a \"alpha-bitch\" in disguise as she KNOWS she is the perfect girl and she is HIGHLY obsessed with Kusuo and wants to get a reaction out of Kusuo of \"woo~\", she really isn't LA's favorite character and LA knows that LA isn't the only one, her personality can easily get on people's nerves and comedically her running gag with Kusuo is repetitive and annoying, the best thing about Kokomi is her voice actor Ai Kayano is her ONLY good trait about her, now on the opposite side of things, Chiyo Yumehara voiced by Yukari Tamura is LA more favourite character and although her screentime is NEARLY less than say Uryoku \"Kouta Nakanishi\" Chouno voiced by Showtaro Morikubo the \"fake magician\", you think LA really didn't like her because of that, but quite the contrary although Chiyo and Kokomi have the same goals and romance interest *cough* Kusuo *cough* and nearly the same plot points, but where Chiyo deviate from Kokomi as it's Chiyo's personality of being the typical romance love interest and is obsessed with Kusuo but she's the \"sweetheart\" of the series and just wants a bit of attention from anyone but especially Kusuo in comparison to Kokomi who gets ALL the attention, also it helps that Yukari Tamura voices Chiyo in which her likability increases a bit more and Chiyo really is LA's favorite character of the series. Chiyo and Kokomi later on get into a complicated mess of misunderstandings romantically with the tangled mess of Shun, Nendou, Kusuo and them...ohh poor Chiyo.\\n\\n\r\nNext up (yup still not done), are the more satellite characters, Kineshi Hairo voiced by Satoshi Hino who is your extreme vers. of the hot-blooded, no-\"can't sit down and calm down\" kind of character, weirdly because he's a catalyst to make \"stuff happen\", lots of the non-speaking characters rally to him due to his personality and it's to be expected\\n\r\nthat Kusuo really doesn't want to be near him. Chisato Mera voiced by Maaya Uchida is an all working-kind of character but melded with the eat anything archetype and is Chiyo and Kokomi's friend. Takahashi voiced by Taishi Murata is the butt monkey...no that's about it for him. Makoto Teruhashi voiced by Tomoaki Maeno, Kokomi's older brother and is utter obsessed with Kokomi a la a siscon and he's a talented actor...it's to be expected LA really didn't like him either. We also have Aren Kuboyasu voiced by Yoshimasa Hosoya a delinquent wanting to have a normal life but the other main characters (sans Kusuo) keeps alerting his delinquent side, LA thought he could have been developed slightly but his running gag becomes his personality by the end of it. Finally to round it up, we have Kusuo's parents Kuniharu voiced by Mitsuo Iwata and Kurumi voiced by Rikako Aikawa and really they are the love-sweethearts/sudden arguing to make the relationship better...worse? kind of relationship, Kuniharu is the idiotic dad that ALWAYS needs Kusuo's power to hep him with his job, Kurumi more or less falls into the oblivious mother, but Kurumi is also kind of a threat not to be messed with so she's good in LA's books...seriously DON'T PISS HER OFF. (ohh also great voice work by the both of them but especially Rikako for her tranquil fury vocals).\\n\\n\r\nReally Saiki Kusuo no Psi-nan's strengths lie in how it works the characters and their wacky chemistry together (for what little screentime they get each episodes it's a great feat for an anime short nonetheless) in specific situations and how it plays off to it, whether it's one of Kusuo's friends, parents or external forces that instigates and Kusuo \"fixes\" it and a side effect causes the punchline of the episode or Kusuo is in/directly responsible for what happened, the character jabbing and the meta-joke done by Kusuo are just an extra bonus. Well even if LA says this, comedy is subjective and you can quite easily see this kind of constant boke to tsukommi routine as repetitive, for LA?, it's unpredictability along with it's punchlines made the comedy pretty well done and it's episode length (5 minutes in LA's broadcast) levitated the \"monotony\" of the boke to tsukommi routines though it never dissipated. \\n\\n\r\nIn terms of animation by JC Staff and Egg Firm, the animation was without a doubt consistent though the anime only lasted 5 minutes each, from the colorful character cast designs to the typical \"decent\" backgrounds. The anime being a comedy anime short, there also tends to be some detailed scenes at times to emphasis the seriousness to the ridiculous scenarios.\\n\\n\r\nIn terms of voice acting, well LA already said that Kurumi Saiki had a pretty erratic voice actor and her voice actor Rikako Aikawa was LA's favorite in the series, next to Yukari Tamura. LA will say this as something quite obvious, due to the length of each episodes, it's to be expected that most if not ALL the voice actors in Saiki Kusuo no Psi-nan to talk extremely quickly (mainly because, they need to setup the punchline of the episode/s, make frequent jabs at the situation or characters and the punchline itself) and LA utterly loved how quickly they talked especially Hiroshi Kamiya at the constant jabbing of the situation/characters...nonetheless voice acting even in an anime short such as this, the voice acting is above-average top notch.\\n\\n\r\nSaiki Kusuo no Psi-nan is definitely an anime short from 2016, in which you NEED to see, especially if you watched Mob Psycho 100 and liked it for it's comedy, then Saiki Kusuo no Psi-nan take it's comedic settings of Mob Psycho 100 and runs with it. Sure Saiki Kusuo no Psi-nan has TONS AND TONS of characters and they don't really get all developed, but it's what Saiki Kusuo no Psi-nan's comedic timing and constant situation/character jabbing AND how meta Saiki Kusuo no Psi-nan is which can easily grab people into carrying on watching it, you just want to see what hijinks Kusuo and his classmates get to and how Kusuo gets roped into all the crazy antics of the boke character cast. Saiki Kusuo no Psi-nan is a great anime short, sure it's HUGE run time of...425 minutes (7 hours 5 minutes) makes it unique to ALOT of anime shorts and even MORE with how it was broadcasted...but it's where Saiki Kusuo no Psi-nan's comedy and it's wacky cast where the anime short strives and the anime itself manifested to Kusuo (oddly enough as much as he's an antithesis to it all) knows it.\\n\\n\r\nUPDATED NOTES from Ep. 85 to 120 - So with newer characters getting into the mix as well as some old ones mixing into it, Saiki Kusuo no Psi-nan does do a good job at bringing back in the underdeveloped characters (like Chiyo and the before underdeveloped Aren making himself into the peanut gallery of annoyance for Saiki). New characters like Saiki's grandparents was also a welcome of new skits such as Saiki's grandfather's blatant tsundereism that was pretty funny. There were some new characters who LA felt replaced Aren's underdevelopness due to their \"one to 3 episode\" status to them such as Tsuyoshi Kongou the REAL delinquent and the one-time villain to Saiki because of Kokomi, Saiko Metori.  There was however one \"arc\" that was more or less focused and kinda reigned in a sorta antagonist in the form of Saiki's older brother Kuusuke voiced by Kenji Nojima, due to an incident, Saiki's family go find Kuusuke and him having a massive sibling rivalry complex leads Saiki down an elaborate game of cat and mouse (easy?...no really if you add in Saiki's annoying peanut gallery best friends). Really Ep. 85 to 120 helped with some of LA's problems such as lacking development to some of the characters like Chiyo and \"at first\" disliked Aren and even adding in newer characters that both had the same problems before but it worked well as the newer characters with more screentime blended into the comedy and it's cast pretty well mainly again because Saiki is the catalyst to make it happen.",
            "date": "2016-10-28T14:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 232804,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=232804"
        },
        {
            "content": "Firstly, don't be intimidated by the number of episodes, they actually fit 5 episodes into a regular-length episode (20+ min) so the series is only twice as long as your average 12 episode anime.\r\nThis anime features a superhuman in a world of pretty much ordinary people, so in a way it's kinda like One Punch Man, except in a slice of life setting. Every single episode is hilarious, and it never felt repetitive even if any gags were repeated. It's not too often that you get an anime (well, manga) capable of running so long without feeling like the gags are overused and repetitive, asevery episode feels fresh, even season 2.\\n\\n\r\nYou can also see that Saiki and his friends grow as characters throughout the anime, despite the 5-min episode comedy style.\\n\\n\r\nAlso, it's just a comedy, not a shonen, don't get too caught up when the protagonist suddenly tells you he has a new power you never knew about; I can't think of how the protagonist was supposed to introduce every single power anyway.",
            "date": "2019-03-03T20:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 302858,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/YourLeader",
                "username": "YourLeader"
            },
            "url": "https://myanimelist.net/reviews.php?id=302858"
        },
        {
            "content": "Reviewing a show like \"The Disastirous Life of Saiki K.\" on its technical aspects would be unfair, because it makes it apparent from the get go that it isn't a series that takes itself seriously. It's goal is to make you laugh with zany characters, wacky scenarios, and 4th wall breaking comedy. Luckily, it does it well.\r\nKusuo Saiki, our main character, has psychic powers that allow him to do pretty much anything he wants. He can turn back time, he can summon any item he needs, he can real peoples minds. You would think having these powers would be a wonderful thing, but Saiki doesn'tsee it that way. He see them as a burden because he ends up having to be the one to fix all the problems the people in his life create. \\n\\n\r\nThe format of the show is different than anything I've seen before. There are 120 episodes, but each one is only 5 minutes long. You can also watch the series in the tradition way, where 5 episodes make a typical 24 minute episode. Each 5 minute episode is its own mini-story, none of which play into a central plot because there isn't one, save for introducing new characters. Some episodes have a part two, but that's about it. \\n\\n\r\nThe characters in this series are stupid, but that's not a bad thing. They are enjoyable, not only because they themselves are crazy, but we constantly are able to hear their thoughts and what Saiki thinks of them, which creates some humorous moments. Saiki is the main character, but he is also the audience character, because he thinks what most people would be thinking if presented with the same situation. There are times when his thoughts are overly mean, but most the time his opinion is a relatable one. \\n\\n\r\nThe voice cast does a good job. Jerry Jewel is a good Saiki, keeping the \"annoyed, disinterested\" voice consistent throughout the series. Micah Solusod as Kaidou, David Wald as Nendou, and Tia Ballard as Teruhashi bring good comedic performances to the table as well as the rest of the supporting cast. \\n\\n\r\nCritiquing the art and sound wouldn't be fair, because they aren't attempting to be anything extraordinary. The best thing I can say is that neither did anything too distracting to turn me off of the series.\\n\\n\r\n\"The Disastrous Life of Saiki K.\" is a great comedy that compliments it's silly situations with the relatable inner monologue of a down to earth man with unearthly abilities. It's a good series to watch when you want a good show to unwind with.",
            "date": "2017-01-28T17:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 239357,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4825918.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SirDooblay",
                "username": "SirDooblay"
            },
            "url": "https://myanimelist.net/reviews.php?id=239357"
        },
        {
            "content": "|:| INTRO |:| \r\nSaiki Kusuo no Ψ-nan: a very enjoyable series. It's full of comedy, which I love and recommend to all comedy-fans out there. If you like it, then this is just for you. It also has a mix of superpowers to it, and they even make that humorous too. It also changes our perspective into thinking that maybe having everything is not all so great.\r\n|:| STORY |:| (8/10)\r\nAlright, I'll be honest, there IS NO STORY. This just goes for 3-5 minutes, but at least it comes out daily. There are 20 minutes ones though, which contain an intro and an outro. The 3-5minutes one just has an intro.\\n\\n\r\nBut if you start watching just a few of these episodes, you can immediately tell that there is no plot. That's fine by me, because the enjoyment of this series wants to make you watch this again and again, over and over. I've watched it so many times. But if you like a series that has a very deep plot, then I'm afraid this isn't exactly for you. But please, give it a try!\\n\\n\r\n|:| ART |:| (10/10)\\n\r\nArt? Excellent! For Saiki, sure, they make him look maybe a bit dull, but that's his character! I enjoy the art-style very much. To be honest, I don't like art styles that look like they're from the 90's. So glad this one isn't like that. But trust me, it looks beautiful (especially the coffee jello -- if you don't know what I mean, just watch it). \\n\\n\r\n|:| SOUND |:| (10/10)\\n\r\nThe sound has many comedy-effects and it fits fully fits the anime. It makes it more enjoyable to me. I think it mixes with it perfectly.\\n\\n\r\n|:| CHARACTER |:| (10/10)\\n\r\nI think each character is very well written. I'll admit though, it seems a bit cliche. There's that pretty girl that everyone is nervous around and has a crush on, then there's gotta be some delinquent, then there's some class rep that is seriously obsessed with something (in this case, sports). But even if they are cliche, they somehow make it so amusing! Give the characters a chance, and you'll see what I mean. You'll easily develop a connection with them, as I did.\\n\\n\r\n|:| ENJOYMENT |:| (10/10)\\n\r\nHah... easiest question. 10/10. Without hesitation. I'm sure I included in all the others how much I enjoyed this series. With all the unique comedy swirling around and all of Saiki's savage remarks, it just makes it more enjoyable by the second! \\n\\n\r\n|:| OVERALL |:| (10/10)\\n\r\nAnd here we are at last. 10/10, of course. I'm sure I didn't even have to write all of this. Just watch the anime and give it a go! It definitely won't be a waste of your time, I assure you!",
            "date": "2017-01-26T19:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 239196,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5935042.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/randompeeps",
                "username": "randompeeps"
            },
            "url": "https://myanimelist.net/reviews.php?id=239196"
        },
        {
            "content": "yare yare should i write a review? \r\nbut somehow i feel like writing one! >.<\r\nwhat attract me to this anime is because 'Mr.Live Action Manga Prince' AKA Yamazaki Kento was starring as the lead character(not really a fan tho).\r\nmy first impression is \"WHAT'S WITH THE FREAKIN PINK HAIR\" and because the LiveAction doesn't turned out that good for me, i try to watched the anime and it is actually ROCKS.\r\n[STORY 9/10]\r\nfor a gag/comedy story it's pretty light, it's not the type that make you laugh hilarious-ly like gintama but it's kinda addicting. how's the main character are surrounded by idiots hook you to keep watching.Eventhough it's a gag but each episode kinda related and actually kinda deep if you really think and feel what the main character feeling.\\n\\n\r\n[Art & Sound 8/10]\\n\r\nit's doesn't give a badass animation or a freakin good soundtrack, it's a gag anyway not an adventure or action genre. overall it's still match the show and satisfying but somehow the bridge between episode gives me a bit cringe feeling, but it's gag anyway, it has to be that way..(?)\\n\\n\r\n[Character & Enjoyment 10/10]\\n\r\ni enjoy this show so much! it's on the level of 'i-will-rewatch-it-some-other-time'. The simplicity and idiocy each character just perfect. especially saiki and his tsukomi-ish character kinda unique unlike any other tsukomi chara.\\n\\n\r\n[Overall 8/10]\\n\r\nvery well done! it's addicting in a strange way! it's really easy to follow, the story and plot is good, the light slice of life comedy is really on point!\\n\r\ni can't guarantee that you'll laugh out loud but you'll unconciously smile while watching it :)\\n\r\nit's a very good recommendation for you who needs an unusual slice-of-life heartwarming comedy :D",
            "date": "2019-01-12T04:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 298801,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7583944.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sogegesoge",
                "username": "sogegesoge"
            },
            "url": "https://myanimelist.net/reviews.php?id=298801"
        },
        {
            "content": "Look, I watch a lot of comedy shows. I like funny stuff and there’s a lot of unfunny shit out there for you to sieve through. And it is true that not all people have the same sense of humour so I’ll say off the bat to not waste your time: if deadpan and sarcastic humour is not your thing then you might not find this show as hysterical as I did.\r\nNow, I am pretty particular about what I rate shows (this gets relevant). For example, most shows I rate on a 1-10 scale, yet with comedies my rating is a little different. One ofmy favourite shows is Keroro Gunso (which I have mentioned here before as being absolutely fantastic) and it is a comedy. I believe that as a comedy it is so good that it deserves to be a whole rating above any other comedy show. Therefore, the highest rating I will give to a comedy show is a nine and the only comedy show to get as high as a nine is Cromartie High School (another show I have mentioned before). So my top two comedy shows are literally, in my eyes, in tiers of their own. Nothing else is on the same level as them.\\n\r\nExcept Saiki Kusuo No PSI-nan. I gave this show the most difficult nine I have ever given a show in my life. Not because I was debating if really was that good but because I was having such a hard time deciding if it should be a nine or a ten. The only reason it’s not a ten is because the show has a few episodes which aren’t up to the same comedic standards as all the other episodes. That’s it. That is the only problem. Now, onto the good stuff.\\n\\n\r\nIn the hours and hours of watching this there were many times when I had full on fits of laughter. I haven’t laughed this much since watching Bo Burnham for the first time. And I’m not kidding when I say there are tears and hyperventilating levels of funny in this show. It’s so easy to digest the show, with each episode only lasting around five minutes which means it’s filled with great moments and does not try to drag out one concept for twenty minutes. There’s no real story here, it really is just putting Saiki, an all-powerful deadpan psychic, in scenes with the wacky supporting cast and letting them bounce off of each other. The dialogue is fast and the jokes are plentiful so in every five minute episodes there are going to be several jokes that are guaranteed to land with most audiences.\\n\\n\r\nSound is not something I usually talk about. Openings and endings don’t really bother me, neither does the voice acting. As long as I can understand what they’re saying (in terms of dubs) or the tone doesn’t irritate me (in terms of subs where the audio is in Japanese) then I’m fine. But oh my god is the dub in this show amazing. Like I said, the jokes come thick and fast and you really won’t have the time to read and digest the subtitles and will really leave you feeling exhausted. This is a show which really does benefit from having an English dub available as you can just sit back and listen as Saiki quickly and sarcastically takes the utter piss out of all his classmates whilst also breaking the fourth wall. It really is a beautiful thing to experience.",
            "date": "2019-01-08T13:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 298446,
            "reviewer": {
                "episodes_seen": 78,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7384353.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RainShift_2",
                "username": "RainShift_2"
            },
            "url": "https://myanimelist.net/reviews.php?id=298446"
        }
    ],
    [
        {
            "content": "If you think you will enjoy \"Daily Lives of High School Boys,\" \"Haven't You Heard? I'm Sakamoto,\" or even \"Handa-kun,\" with the same touch of fun awkward social skills, mixed with a twist of psychic powers, and Captain Levi's indifferent yet sexy voice, this anime is for you! The Disastrous Life of Saiki K is definitely a great watch and is ready to surprise you again and again. Just when I finish an episode and think \"they can't get any funnier than that,\" Saiki K exceeds expectations. The show presented a mixture of slapstick, farcical, hyperbolic, and even blue humor.\r\nArt that was used was nothingspecial, just pleasant to the eyes, I guess. The same can be said about the soundtrack/effects. Captain Levi (Hiroshi Kamiya)'s voice was definitely a plus to me, but that's jut my personal opinion. \\n\\n\r\nThe trouble with slice-of-life series is that there is often no continuity and most characters seem one-dimensional. Especially with personas such as Saiki's, who are omnipotent and omniscient, it is difficult to get a plot that causes growth. But as the story progresses, we are able to see subtle changes in his interactions with his so-called friends and classmates. During those times, however, Saiki should not have to explain himself whenever he does any altruistic action (i.e. I will help this person because it will benefit me, not because I want to help). All these justifications make him seem so tsundere... perhaps I was just overthinking for an otherwise simple, comedic anime.",
            "date": "2018-12-27T18:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 297109,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5264.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hyouron",
                "username": "Hyouron"
            },
            "url": "https://myanimelist.net/reviews.php?id=297109"
        },
        {
            "content": "Without a doubt my favorite comedy anime, I am one of those who comedy in anime does not like but this anime gets so absurd situations with the interaction between the characters that it is impossible that you do not get at least a smile.\r\nAlthough it seems that the episodes do not have continuity between them, the actions of the characters do affect the story and in my opinion it gives a special touch since not many comedy animes do that.\r\nThere are also surprises in the plot that I personally did not expect and more than once they made me say \"loooool\", as for example-SPOILER- The revelation of a student who can communicate with ghosts or that Saiki has a brother.- SPOILER-\\n\r\nReally an anime that I recommend to everyone and that all otako should know.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\nSin lugar a dudas, mi comedia favorita anime, soy una de las que a la comedia en anime no le gustan, pero este anime tiene situaciones tan absurdas con la interacción entre los personajes que es imposible que no obtengas al menos una sonrisa.\\n\r\nAunque parece que los episodios no tienen continuidad entre ellos, las acciones de los personajes sí afectan la historia y, en mi opinión, le dan un toque especial, ya que no hay muchas animes de comedia que lo hagan.\\n\r\nTambién hay sorpresas en la trama que personalmente no esperaba y más de una vez me hicieron decir \"loooool\", como por ejemplo -SPOILER- La revelación de un estudiante que puede comunicarse con fantasmas o que Saiki tiene un hermano.- SPOILER -\\n\r\nRealmente un anime que recomiendo a todos y que todo otako debería saber.\\n\\n",
            "date": "2018-12-26T11:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 296949,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7661261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ciber_D_Teorias",
                "username": "Ciber_D_Teorias"
            },
            "url": "https://myanimelist.net/reviews.php?id=296949"
        },
        {
            "content": "I want to premise this review with a statement: Saiki Kusuo no Ψ-nan is a(n) comedy anime; there is no plot, storyline, drama, or any other aspect of the show other than comedy for which it should be reviewed. Therefore, the following review and the score I've given this show are in relation to how well the show preformed as a comedy anime. \r\nSaiki Kusuo no Ψ-nan follows the eventful life of Saiki Kusuo: a young man who happens to have been born with every psychic power one could imagine. With such powers it's no surprise that Saiki's life is so eventful; however it's notSaiki himself who creates this busy and energetic life, it's his eccentric and out-going group of friends. Saiki, if anything, wishes for a quiet and simple life; his friends however don't have the same agenda. In the midst of attempting to hide his psychic powers, manage his bustling group of friends, and deal with his giddy family; hilarity ensues. \\n\\n\r\nSaiki Kusuo no Ψ-nan is by no means a story driven anime. It's a succession of short 4 minute episodes which are meant to make you laugh. The show is meant to perform and express itself as a comedy, which is does very well. Each character is hand-crafted to be unique enough that they pique your curiosity and get you to laugh when they come around. All the way from a(n) eighth-grade syndrome inflicted boy fighting off the notorious \"Dark Reunion,\" to a self-absorbed bishoujo you'll find that each character comes off in their own way and does a fantastic job of adding to the show's comedy.\\n\\n\r\nEach skit presented within the anime made me laugh; I found there was rarely a dull moment and none of the anime's writing came off as lackluster or poorly done. Each joke has substance, and it reminded me of the same style expressed by latter series Gintama.\\n\\n\r\nThe art and music are fantastic for improving the show's atmosphere and comedic vibe. I need not stumble too far into reviewing the art and music, because there's not much in this area I'm looking to comment on; however I did want to leave something here that you'll understand once you've seen the show, something which should sum up my feelings on the music selection in the anime: \"JUDGEMENT KNIGHTS OF ♫\"\\n\\n\r\nIf you're on the prowl for a good comedy anime, do not pass up Saiki Kusuo no Ψ-nan. I strongly recommend this show to anyone reading this review; get ready for a good laugh and some light-hearted fun. Hope to see everyone here for Season 2!",
            "date": "2016-12-26T20:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 236620,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1523389.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShaneM",
                "username": "ShaneM"
            },
            "url": "https://myanimelist.net/reviews.php?id=236620"
        },
        {
            "content": "At first I was skeptical because cliche storylines with overwhelming powers due to western super hero movies and long Japanese fights with a complicated backstory. However this story was as humorous as watching viral youtube animation shorts. \r\nThe short duration of each episode lessens the cliffhanger hiatus feel when there is a long plot build up. This show illustrate the complete opposite. It feels like if Sakamoto from \"Sakamoto desu ga?\" were the main character with a \"One Punch Man\" vibe of the main character being overpowered but doesn't care about anything but food.\r\nPretty much that. I highly recommend for anyone with little free timeto watch this because it is a good way to relax for a short time without feeling anxiety over the entire plot.",
            "date": "2016-11-30T09:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 234651,
            "reviewer": {
                "episodes_seen": 46,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5777627.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OniSaibogu",
                "username": "OniSaibogu"
            },
            "url": "https://myanimelist.net/reviews.php?id=234651"
        },
        {
            "content": "I'd honestly never thought I'd find a comedy anime as enjoyable as Danshi Koukousei no Nichijou was for me. TL;DR, show's real funny and worth watching, got it? Alright, go!\r\nIt's rare that any anime that has a comedy tag would make me literally laugh out loud, and only a handful have, this included along with Flying Witch and Danshi Koukousei no Nichijou. Expecting that this show would be mediocre in it's comedy aspect at best, the only reason I started watching this show was due to the fact that it was on Netflix and I had like a free weekend to burn doing nothing.\r\nSo basically,this show's protagonist, Saiki Kusou, has phenomenal psychic powers, cool right? Well no, as his magnificent his powers seem they have their own drawbacks, as such Saiki is bombarded with the thoughts of everyone within a certain radius of him. Thus he tries his absolute hardest to live a peaceful and simple life devoid of anything exciting or anything that he may deem tiring or a waste of time, which is the entire premise of this show. This achieves a blend of being somewhat able to relate to Saiki's daily problems to a certain degree that makes his efforts to avoid such interactions enjoyably funny.\\n\\n\r\nThe characters are memorable and the voice actors have done a great job portraying the characters as intended as per their individual introductions and have brought them to a realistic enough standard that I can imagine myself in Saiki's shoes and would react in the same ways he would. Also, specifically Kamiya Hiroshi who voiced our lovely protagonist, his experience with inter-monologues and his elaborate thought processes that we have seen also from the Monogatari series is a perfect match for each other. \\n\\n\r\nThe art and sound effects could be better, but they definitely suffice for an anime such as this since it does not look for beautiful animation and sound track within high tension situations or scenes.\\n\\n\r\nThe music is decent (???), albeit not very memorable but as far as I remember managed to fit themselves nicely within certain themes / emotions in the show. \\n\\n\r\nOverall, a comedy anime has not much plot to judge on in my opinion, and has fulfilled it's task of making a enjoyable comedy anime that is worth watching. This show does well the same way Danshi Koukousei no Nichijou does, provide a non-offensive show with minimal plot and focus on the moments that people could relate to on a personal level which creates enjoyment from watching.",
            "date": "2018-09-25T12:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 289978,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5114338.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Wheelshun",
                "username": "Wheelshun"
            },
            "url": "https://myanimelist.net/reviews.php?id=289978"
        },
        {
            "content": "Saiki Kusuo no Ψ-nan ( The Disastrous Life of Saiki ) is a story following our main protagonist Saiki and his naturally born-with psychic powers. Saiki frequently encounters disastrous events ( as the title suggests ) in which Saiki must deal with, without alerting his friends of his supernatural powers.\r\n  What makes this anime so special, is the fact that Saiki's powers are blatantly used to cover anything illogical in the world. Look at any other anime and you'll definitely find plot holes and/or mistakes in the writing of some events or the setting of the world, Saiki Kusuo no Ψ-nan gainsit comedic value by blaming all of the illogical themes and features of the anime on poor Saiki. Supporting characters in the anime further prove this as they all fit extreme cliches in anime, to the point where you might see them or their behavior in people in real life, and you'll become surprisingly attached to them in no time. \\n\\n\r\n  With a nice story, suitable art style, and surprisingly well though out characters, Saiki Kusuo no Ψ-nan brings out a very enjoyable experience, probably the best gag anime ever. I came into this anime not really expecting anything worthwhile, finished it in one sitting.\\n",
            "date": "2018-07-07T21:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 283346,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4936996.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MAF__",
                "username": "MAF__"
            },
            "url": "https://myanimelist.net/reviews.php?id=283346"
        },
        {
            "content": "This is what we want more of!! Saiki Kusuo no Ψ-nan captures the comedy used in Gintama perfectly and since Gintama is my favorite anime of all time Saiki Kusuo no Ψ-nan is now the runner up.\r\nThe anime is absolutely ridiculous, the main character is basically an extremely overpowered character that could do whatever he wants. However he views his abilities as terribly inconvenient to have and just wants to live a normal live. But that can't happen with all the other \"special\" characters around him.\r\nJust like Gintama this anime thrives by throwing together ridiculous characters in all kinds of situations and then chain togetherjokes one after another until you can't stop laughing.",
            "date": "2017-05-12T18:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 247553,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4553847.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bramve",
                "username": "bramve"
            },
            "url": "https://myanimelist.net/reviews.php?id=247553"
        },
        {
            "content": "This review contains no spoilers, because then the review would be pointless.\r\nSo, it's been a month since I've watched Saiki Kusuo no Ψ-nan (also known as the Disastrous Life of Saiki K.) Since then, I still believe that is probably the best show I have ever watched, and for many reasons. It is hilarious, the voice casting is perfect, each episode is condensed perfectly into eight minute bits, and it has a story that pulls the viewer in. \r\nAssuming you read the synopsis, onto the review we go!\r\nSTORY\r\nRated: 9/10\r\nThe story, which some would argue is the most important part of the show, is great. However,this isn't only due to the main character, or the way the episodes are structured. No, I give the credit to the supporting characters, who all have different personalities and goals. Take, for example, Nendou Riki. Nendou is, simply put, an idiot. So much of an idiot that Saiki can't use simple telepathy to see what Nendou is thinking. However, this only propels the story forward, as the most unexpected things can come this doofus that the audience soon grows to love. We'll go more in depth in the Character section, but the blend of supporting characters and the main character is simply put, amazing.\\n\\n\r\nAs I mentioned above, each episode is around eight to ten minutes long. If you watched this series on Netflix, like I did, then you'll see that four episodes are squeezed into one single episode, which surprisingly works. These episodes, who manage to put a background, story, and solution in only eight minutes, are a piece of art. A conflict can usually be resolved in eight minutes, but each episode helps develop a character more, whether it be developing a new power of Saiki's, or adding a new motivation or reason to befriend/annoy Saiki. \\n\\n\r\nLastly, the comedic presence and timing of this show is great. It makes sure not to overflow us with jokes, but each joke usually hits at home with the audience. There are several instances which I can pull up but won't due to spoilers, but the writing isn't only it. The art style of this anime, which is soft and goes smoothly with mostly any background, can also add to the comedy of this show. \\n\\n\r\nHowever, there are some negatives to the story. Mainly, the lack of a continuous story can be annoying at times, as well as forgetting what happened in previous episodes due to the shortness of them. However, the positives vastly outnumber the negatives, and make the story very, very enjoyable.\\n\\n\r\nWhew. Sorry about the long Story section, but it's probably the most important part of a show, so I had to include as much as I could.\\n\\n\r\nART\\n\r\nRated 7/10\\n\\n\r\nThe art of the show isn't anything amazing. There are no action packed fight scenes which involve Saiki fighting an alien or anything like that. As I mentioned above, the art is very soft, and the only time we see bold lines is when Saiki is getting serious. However, the background art is very pretty, whether it be the beach, Saiki's house, or the high school. The art for this show gets the bare minimum done, and it honestly doesn't need anything else. While the art can be lacking, for this type of comedic show, it can work perfectly.\\n\\n\r\nSOUND\\n\r\nRated 10/10\\n\\n\r\nGod, I love the sounds that this show makes. Each character, save for Saiki, has a mini theme that goes along perfectly with their character. I'll give the example of Kaidou Shun. Kaidou Shun is another \"friend\" of Saiki's, who has a hero complex. Whenever he goes into his alter ego, a member of a secret society where all the members have powers, mysterious music plays, usually stereotyped as something dark and interesting is about to happen. However, what usually happens next is Kaidou embarrassing himself. The audio helps majorly the comedic timing of the show.\\n\r\nAlso, the intro and outro songs of the show is effin amazing and I love all of them to bits.\\n\\n\r\nCHARACTER\\n\r\nRated 10/10\\n\\n\r\nHoly hell. The characters in this anime are, simply put, amazing. I'll put a list of them and some characteristics, and then describe them a bit more.\\n\\n\r\nKusuo Saiki- The protagonists of this anime. He has psychic powers, and is pretty damn powerful. He also just wants to be left alone by his friends and family.\\n\\n\r\nShun Kaidou- A companion of Saiki, who thinks that he is a hero called Jet Black Wings, where he has to stop the evil organization Dark Reunion. In reality, he's a dorky kid with an overbearing mother and too much time on his hands.\\n\\n\r\nNendou Riki-Another companion of Saiki's, he is an idiot who's mind can't be read. Literally. He enjoys ramen and hanging out with Saiki. Later into the anime, he is considered a \"rival\" by Kineshi Hairo, although Nendou isn't aware of this. His father died when he was a child, and his father's ghost haunts Saiki from time to time.\\n\\n\r\nKineshi Hairo- The jock of the group, he loves motivating his classmates and playing sports. He doesn't back down to any challenge, and isn't afraid to strip down to his underwear to represent his school. Can be overenthusiastic at times.\\n\\n\r\nKokomi Teruhashi- Literally every man's love interest, she is a high schooler who just wants to get Saiki to say \"Wow!\" at her good looks. Is friends with Chiyo Yumehara. Her brother has a crush on her. Her father probably does as well.\\n\\n\\n\r\nThat's really the main group. They all have such great dynamic together that it's honestly pretty amazing that the anime managed to pull it off. There are other smaller characters, such as Saiki's parents, but that group is probably the best part of the anime.\\n\\n\r\nENJOYMENT\\n\r\nRated 10/10\\n\\n\r\nJust watch the damn show. It's so good. I throughly enjoyed it, and am surprised that it isn't more popular. There is only a sub out right now, but even if you don't like subs, you'll enjoy this one. Watch. The. Show.\\n\\n\r\nENDING REMARKS\\n\r\nThe Disastrous Life of Saiki K will forever hold a special place in my heart as one of the first animes that made me burst out laughing and always made me happy. If I was offered to watch it again, I would 100% take that opportunity. So, Overall, I give it a 10/10, and can't WAIT to watch the second season.\\n\\n\\n\r\nNow, for a casual sellout. If you enjoyed this review or thought it was helpful, please mark the Helpful button or whatever you use to say it was helpful. It really does help me with my reviews, as I can see and look at what I can improve when writing. Not only that, but if you want to follow my profile to see what I write a review on next, that would be great! Thanks for reading, and have a great day!\\n",
            "date": "2018-05-11T18:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 280315,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7241503.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Falconhero",
                "username": "Falconhero"
            },
            "url": "https://myanimelist.net/reviews.php?id=280315"
        },
        {
            "content": "Well where do i start with this one,i think i will start with comedy.\r\nComedy in this anime i so good it got me laughing every single episode i watched.And i didn't think it would be this funny,because i saw opening and i was like i think it will be only good for first five episodes,and i was wrong.\r\nIf you're looking for anime to laugh so hard to i recommend this one,but if you're looking for fight,sport,logical story i wouldn't go with this one.\r\nAnd this anime have great dub,you don't need to watch sub if you want to enjoy,you can go straight to dub in myopinion.\\n\\n",
            "date": "2018-05-05T14:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 279851,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7170081.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shy_boy",
                "username": "shy_boy"
            },
            "url": "https://myanimelist.net/reviews.php?id=279851"
        },
        {
            "content": "Saiki Kusuo no Ψ-nan is awesome. The writing of season 1 deftly exemplified intelligence and an assortment of unique but familiar humor. Transitions and jokes were on point in surprising ways fairly often. Really enjoyed my time all the way through. I used to savor episodes at first and just impulsively watched the last four episodes straight. Theres a special electricity to this show which was as endearing as it was entertaining. \r\nFrom my perspective, this show nailed whats it was trying to do so well that I have no complaints. Proud to have just weighed in with first review for an anime on thissite or ever. It's really great that people gather here to share ideas and learn about anime. Excited to continue contributing to a collective representation! No sarcasm I'm just not all that normal\\n\\n\r\nAnywasy yeah- Saiki Kusuo no Ψ-nan- 10/10",
            "date": "2018-04-19T11:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 278473,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7165636.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ShaneOmac27",
                "username": "ShaneOmac27"
            },
            "url": "https://myanimelist.net/reviews.php?id=278473"
        },
        {
            "content": "Saiki Kusuo no ψ-nan is a short-segment comedy about an-all powerful psychic high school student trying to pass as average. As unique as Saiki is-his friends are just as colorful. Yet, as much of a hassle they are to Saiki, deep down he probably likes them. Well, he at least tolerates them. \r\nThe humor is quick and the jokes come one after another-it doesn’t leave you much time to think. There’s not an overarching plot, but snapshots of Saiki’s life. His deadpan narration makes him the straight man to the world around him and with this I would say Saiki is a good comedy anime.\\n\\n\r\nWhat makes Saiki great is how much the show does with such little time. Through these short moments the characters shine and are so endearing. The show plays on the tropes and clichés it presents so well. Each character proves and subverts his/her labels continuously, proving you can’t judge at face value. In fact, the show literally called me out on this later on in the series. \\n\\n\r\nAs a side note I’ll say I watched this series in the standard 24-minute episode format, which I would recommend since the entire series is out now. I didn’t think the jokes dulled due to a longer format; I enjoyed binging on two or three episodes at a time. Also I’ve only seen a quarter of the show dubbed but I’d still like to share my thoughts. The dubbing did surprise me quality-wise and I enjoyed it. Definitely consider watching a little to see if it suits you. Since the comedy can be contextual I noticed slight differences that sometimes enhanced my watching experience.\\n\\n\r\nThe other aspects of the anime like music, art, and animation-are good. I’d just rather focus on the strong point of this show: its characters. Just like Saiki, the characters surprised me. Other times they were exactly how I thought and over time they grew on me. Essentially the characters definitely carry the heart and humor of this show.\\n",
            "date": "2017-03-04T13:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 241858,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/AsukaHero",
                "username": "AsukaHero"
            },
            "url": "https://myanimelist.net/reviews.php?id=241858"
        },
        {
            "content": "A long time ago i don't watch a comedy anime like this, i think the last has Nichijou (for me the better in this category) and this anime has come to save the category on 2016.\r\nYes, we've Konosuba, Working too, but this anime is one of a kind, the way then the jokes are built is what makes greatful.\r\nThe bad point is the technical quality which leaves much to be desired, but the comedy compensates that.\r\nSo if you want a really comedy anime i give you Saiki Kusuo no Ψ-nan. It's odd, it's freakish, it's good.\r\nMy final note is a 8 (8.8)",
            "date": "2017-02-08T05:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 240151,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4889385.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SweetPumpkin",
                "username": "SweetPumpkin"
            },
            "url": "https://myanimelist.net/reviews.php?id=240151"
        },
        {
            "content": "Saiki Kusou was one of the best, yet more overlooked, anime of 2016. With each episode being only 4 minutes long every anime fan should watch atleast watch the first few and see if this is for you. \r\nComedy is inherently subjective, but this was the first comedic anime where I consistently laughed at the jokes. The main character is one of the most OP in the history of anime - but where much of the comedy comes from is that these powers are more of a curse than a blessing. Typically each episode will focus on one of Saiki's powers, a new character, ora new situation, which prevents things from getting stale or jokes being reused, a flaw of many other similar anime. \\n\\n\r\nThe technical aspects of Saiki Kusou are quite good. The standout is Saiki's VA - who does most of the talking (in an internal monologue - the character is almost mute) has an appropriate deadpan. The other character's voices also sound fine. The animation is nothing fancy, but is always on-model and attractive to the eye. \\n\\n",
            "date": "2017-01-25T02:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 239073,
            "reviewer": {
                "episodes_seen": 40,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5831882.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yorkshire_Megan",
                "username": "Yorkshire_Megan"
            },
            "url": "https://myanimelist.net/reviews.php?id=239073"
        },
        {
            "content": "So I just finished watching Saiki Kusuo no Psi Nan. The anime is about a 16 year old boy named, as the title states, Saiki Kusuo who has psychic powers. These powers seem like they're a god send, but Saiki doesn't like them because it ruins things for him. Its a slice of life comedy and the protag is has a cool demeanor. The episode format for this show is odd. It works by having a singular episode that's only about 3 minutes long, with about 100+ episodes, it works basically as well as a 24 normal episode series. The art and animation is nothingoutstanding, but the comedy makes it a good show. I give this show a 7 out of 10. I would recommend this to anyone looking for any comedy show, its casts a very wide net. With season 2 of Saiki Kusuo no Psi Nan coming out it would be a perfect time to watch this show. This has been your spoiler free but not really review on Saiki Kusuo no Psi Nan.",
            "date": "2017-11-24T11:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 263859,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=263859"
        },
        {
            "content": "As a fan of action, mecha, sci-fi and dark fantasy animes, Saiki Kusuo no Sai Nan was an entirely new experience for me. On the whole, I'd say this is one of the best, if not the best Slice of Life/Comedy anime I've seen till date. In spite of having no strong plot line, it is both beautiful as well as exceptionally entertaining. The episodes are short and absolutely hilarious. Saiki, the protagonist is a 16-year-old schoolboy with psychic powers. One of the funniest parts is how he takes having superpowers to a whole new level. Be it teleportation, telepathy, turning invisible, superhuman strength nameit and he has can do it. There is practically nothing he can't do. The story mainly revolves around how he uses his powers to avoid attention while occasionally helping those in need. Although he repeatedly declares that he cares for no one but himself, as the story progresses you begin to realize that he actually cares way more than prefers to admit. As for the other characters, there is Nendou who is stupid to the point that his mind is empty and can't be read, the delusional Kaido, the ridiculously beautiful Teruhashi who spends most of her time making a good impression on others and many more. \\n\r\nSaiki and his friends are a rather odd bunch who are extremely lovable and at the same time downright hilarious. \\n\r\nAlthough the second season is rather repetitive, it is still entertaining as many new characters are introduced. \\n\r\nAs the anime nears its end you can't help but feel touched as you realize that Saiki, as well as his friends, are actually great people.\\n\r\nOverall Saiki Kusuo no Sai Nan is an absolute masterpiece both in terms of uniqueness as well as character development. On a concluding note, I'd say that Saiki Kusuo no Sai Nan will make you laugh from the first episode to the very last. If you are a fan of Comedy animes  I'd definitely suggest this as a must watch.",
            "date": "2019-01-20T07:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 299560,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7513689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/01Sarkar10",
                "username": "01Sarkar10"
            },
            "url": "https://myanimelist.net/reviews.php?id=299560"
        },
        {
            "content": "I'm not one to sit down and watch a comedy, but this is definitely my favourite. Without a doubt.\r\nThe animation is probably the weakest part of the show. It's not the worst but it's not great. Also since Saiki speaks through telepathy, it's difficult to know when he's actually speaking.\r\nThe characters are what make the show great. There's a huge cast of memorable characters that are introduced throughout the two seasons. The tsundere grandpa, the idiot that's so dumb he doesn't have any thoughts, the guy with a superhero complex and the girl that is completely failing in terms of love are just some examplesof the interesting cast. \\n\\n\r\nThey're not all just two dimensional characters, though.  Since Saiki knows what everyone (well, almost everyone) is thinking, it really gives some insight into who these people are and it's great.\\n\\n\r\nThe soundtrack is also pretty notable. It has some great openings, endings and just OST in general.\\n\\n\r\nI'm obsessed with this show. It really is worth a watch if you can spare the time. I highly recommend it!",
            "date": "2018-12-30T15:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 297523,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/crazygamergirl90",
                "username": "crazygamergirl90"
            },
            "url": "https://myanimelist.net/reviews.php?id=297523"
        },
        {
            "content": "~If you're looking for an anime that will give you lots of honest laughs,\r\nthis is one of the best options you have! \\(^O^)/\r\nIt made me happy and motivated every time I felt sad and miserable! \r\n~First of all, the fact that the episodes are short, makes it easier to watch, even when you don't have enough time and you just want to chill, with some light comedy. Also, almost every episode had seperate script, which made it even easier and more enjoyable to watch.\r\n~I thought of it as quite different and it kept my interest from the first to the last episode, without having actuallya specific storyline.\\n\r\n~I really enjoyed the inside jokes, which start being affective even from the first 5 episodes.\\n\r\n~The characters are unique and funny.\\n\r\n~Even tho my first observation was the intense weird coloring, it didn't bother me at all during the anime. On the contrary, it helped me recognise and remember the characters from the very start.\\n\\n\r\n**Highly recommended!**",
            "date": "2017-01-01T02:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 237145,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3975607.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ReikaUchiha",
                "username": "ReikaUchiha"
            },
            "url": "https://myanimelist.net/reviews.php?id=237145"
        },
        {
            "content": "This is surprisingly good.\r\nStory 6/10\r\nArt 6/10\r\nSound 6/10\r\nCharacter... 6/10\r\nEnjoymenbt 7/10\r\nOverall 7/10\r\nThis anime is a comedy, and it is composed of many short episodes. The appeal here is that episodes are short, fast, move at breackneck pace, so it doesn't really ever waste time on anything, and just keep throwing jokes and ridiculous situations.\r\nThe visuals are clean, but not terribly detailed, for the anime they do the job. First half of the episodes used incredibly mediocre tune, but it has been fixed in second half. Voice actors are quite good.\r\nCharacters begin as sterotypes, but they're incredibly well done stereotypes and frequently look quite real. Meaning you'll feelsorry for them in some awkward situation. Also there's a lot of characters.\\n\\n\r\nAll things considered the anime is quite fun.\\n\\n\r\nThe pacing is quick, it doesn't waste any time, art style is clean (even though it is not masterpiece leve), and characters are enjoyable enough. There is a lot of parodying going on through the series, and episodes have varying qualities, but in the end it is a very enjoyable ride.\\n\\n\r\nIf you have the time, check it out. I think it is worth it.",
            "date": "2018-12-09T17:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 295512,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=295512"
        },
        {
            "content": "One of the best ANIME comedy I've seen until today, he does not have a deep story and with a lot of sense (since it's an anime you have to accept what happens.\r\nExample: They invent power from nowhere, or the Saiki does not use the power he should use at the time)\r\nI loved the 1 episode scheme having 4 to 5 stories each (not all are like that, but it's still wonderful).\r\nThe only flaw I found was that he sometimes does not know how to deal with the powers, even though he's fucking smart.\r\nFor me, the best character, it's not Saiki, but Shun Kaido, hewith his spirit that the world is actually being invaded by a being of darkness, and he and Saiki (who he believes have powers) will do away with all the evil that this darkness is bringing (But in fact he's just a normal fucking guy)",
            "date": "2018-09-10T12:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 288686,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7401963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MarcoNegrao1",
                "username": "MarcoNegrao1"
            },
            "url": "https://myanimelist.net/reviews.php?id=288686"
        },
        {
            "content": "This anime is a pretty underrated gem and I definitely regret not watching sooner. I disregarded it as looking too goofy and just ignored it in my watch-list until this year. Yet it has quickly shot up to one of my favorite anime within the past year or two. \r\nStory: 9/10 Saiki Kusuo is a 4-5 minute per episode anime about a psychic that is inconvenienced by his powers and just wants to be an average person living an average life. If you're like me and dislike hitting the \"next episode\" button a lot due to the 4-5 minute episode schedule, then don't worry! There'sother options out there that let you watch it on a normal 24 minute anime runtime. There isn't really a main plotline other than a few rare mini-arcs in the show but it is endlessly entertaining. Saiki and his interactions with his school, friends, and family end up making some really lovable and hilarious moments that can get some laughs out of me. The story of each episode can be really hard to follow sometimes as Saiki and the humor is really fast-paced, but if you're a fast reader I don't think you'll have many problems. \\n\\n\r\nArt: 7/10 I'd normally give it a 6/10 as I feel it's pretty simplistic but I think Saiki being in the comedy genre gives the art an extra point for me. It's just too fitting for its show and characters.\\n\\n\r\nSound: 7/10 I'm not a big fan of the opening and endings of Saiki, but the OST and themes for each character are pretty great and entertaining. Especially Kaido's theme, the Judgement Knights of Thunder song makes me feel like I can survive a 50 foot story drop. \\n\\n\r\nCharacters: 9/10 Each character has a lovable or unique niche that makes their interactions with each other really entertaining. It's hard for me to find a favorite because they're all really great in their own right. \\n\\n\r\nOverall: 9/10 I don't think I've had an anime make me laugh this hard since Nichijou. I highly recommend this show if you're looking for good comedy anime as those can be hard to come by.",
            "date": "2018-09-10T09:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 288675,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4339385.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DryBread",
                "username": "DryBread"
            },
            "url": "https://myanimelist.net/reviews.php?id=288675"
        }
    ],
    [
        {
            "content": "Saiki Kusuo no Ψ-nan is the best gag/comedy anime that I’ve ever watched. It’s the perfect combination of absurd, ridiculous and heart-warming that keeps me compelled through every five minute segment. And yes, the episodes of this are only five minutes long. \r\n\t• Don’t let the length of the episodes repel you from watching though. Unlike many other short anime series, the animation and designs are high quality with really, really high-profile Japanese voice actors doing the subtitles version. I’m not sure about the English dub, so I wouldn’t risk watching it unless someone told you it was really good and I still wouldn’t trustit, because the Japanese voices are perfect. And there’s Japanese humor and jokes that might be tossed in the back burner for the English script. \\n\\n\r\n\t• Saiki, our hero, is voice by Araragi’s notorious actorーHiroshi Kamiya, who is officially the king of monologuing. He’s the best at it, at the ver least, but monologues actually make sense in this show, because the main character can practically read everyone in the worlds’ minds through telepathy. So, much of his dialogue is combatting weird shit that his classmates are thinking with witty, short rebuttals. \\n\\n\r\n\t• This series is a like an improved version of One Punch Man, because’s it’s actually funny, and the main character has amazingly OP abilities that sometimes screw him over and sometimes save him from a bad situation. Like, being able to go back to the beginning of time and being able to delete something out of existence, so it won’t further hinder him. \\n\\n\r\n\t• I’ve been focusing on Saiki this entire time, but the whole cast is likable, no matter how douche-baggy they may seem initially. There are the typical character archetypes such as: the pretty girl, the power in my right hand-chuuni-bro, the overly competitive-athletic guy, the girl who falls in love with every guy she sees, and a failed alcoholic magician. \\n\\n\r\n\t• Initially, you think that all of these characters are going to be extremely typical, but Saiki being able to read their minds adds more depth to them. The cast grows on you and after a while, you feel like you’re watching a group of people you know in real life, doing crazy things. \\n\\n\r\n\t• Saiki’s humor is somewhat spastic like Teekyu, but has an eloquence about it like Gintama. It became one of my favorite series in a short period of time, and I haven’t put a show past 2012 on my favorite list yet. So, to me, it’s been the best anime in four or so years. Between coffee jello, a sweet escape, and glorious laugh-out-loud moments, all of you should definitely watch Saiki Kusuo, it’s hasn’t gotten enough press in the West. I give Saiki Kusuo no Ψ-nan a 8/10 without any reservations.",
            "date": "2018-09-08T22:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 288528,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LunaPrecure",
                "username": "LunaPrecure"
            },
            "url": "https://myanimelist.net/reviews.php?id=288528"
        },
        {
            "content": "I was somewhere in my house, on the edge of the bed, when the drugs began to take hold. I watched an Anime series that was as aware of itself as I was. The strange vision of a world devoid of a Fourth Wall sprang loose before my eyes, I remember a voice shouting, \"What are these God darn animals?!\" but as it turned out I wasn't on any drugs at all. I was simply watching, \"Saiki Kusuo no Ψ-nan\" AKA \"The Disastrous Life of Saiki K.\"\r\nThis is an Anime show for Anime fans. Adapted from the popular manga series of the same name, thisfeels like what Deadpool would do if he were a PG-rated series. A series so full of colorful characters, mundane yet bizarre plots, and an MC who is perfectly aware that he is an Anime character in a TV show and also has so many powers that it would be pointless to throw challenges his way. If you know of a psychic power, he has it. All put to use in ways I can imagine using them myself and also for the most comedic of purposes. Add in a supporting cast of lovable goofballs and semi-antagonists, you have a perfect roster of people to bring this show to life beyond just a gimmick of fourth wall breaks.\\n\\n\r\nThe music and art are just a means to an end. The meat is in the writing and creative shows of Saiki's powers. Sub vs. Dub doesn't happen here. You need to watch this show in your native tongue. Subtitles alone cannot handle the rapid fire jokes that happen in a given moment. A throwaway line in the background can often be as if not more funny than the one we hear best. To say I enjoyed this show is a massive understatement. It's format of 5-minute episodes makes it easily binge worthy or for casual viewing if you just need a good chuckle. It is truly a wonderful show and is easily funnier than anything on TV right now. 8/10. Check it out. Cheers!",
            "date": "2018-09-07T11:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 288385,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5233934.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GarlandReese",
                "username": "GarlandReese"
            },
            "url": "https://myanimelist.net/reviews.php?id=288385"
        },
        {
            "content": "tl;dr: you liked Nichijou-like humor and you've seen a lot of anime? Watch this it's brilliant.\r\nSaiki Kusuo no Psi-nan is one of my favorite anime. It's a gag anime that deconstructs many other genres in anime as well as manga, and does so brilliantly. There have been episodes where I was laughing out loud for a solid 10 seconds, which is something that happens extremely rarely for me when watching anime.\r\nThe type of humor it takes to enjoy this anime is similar to Nichijou or Asobi Asobase. If you liked those, you'll definitely like Saiki, but there's one problem...\r\nSaiki (the show) is very much reference-based,and so it's probably best to not watch it until you've watched many different anime of many different genres. At least watch the major shounen, some romance, and some seinen.\\n\\n\r\nThe way Saiki deconstructs these other shows is brilliant, it sets up their premise and breaks them using Saiki's cynical disinterest. Really makes you think \"yeah,.. maybe those shows are a waste of time and effort\". Saiki also frames their premises in such a way to perfectly predict their outcomes.\\n\\n\r\nTo add in to this criticism and humor we have a wonderful cast of characters that are all memorable and in general very fun, except Mera, but hell I even remembered her name without looking it up. Just goes to show how strong the characters are in this show. The main cast is very much archetypal of different shows, for instance, Nendou is a bumbling but hilarious idiot who is super strong, much like some shounen protagonists, whereas Hairo is your typical \"give 120%\" character. Saiki basically criticizes these characters' ridiculousness and thereby transitively criticizes other anime and manga.\\n\\n\r\nAbsolutely a fantastic show - and - while the story/art/sound are all meh (really, there isn't a big story, it's very much SoL), the characters and enjoyment make up for it, easily.",
            "date": "2018-09-02T09:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 287965,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047832.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jcore24",
                "username": "jcore24"
            },
            "url": "https://myanimelist.net/reviews.php?id=287965"
        },
        {
            "content": "This is one of my favorite feel good anime. It's a short form gag show about a deadpan cynical psychic who can alter the nature if the world if he wants too. \r\nI generally don't like comedy anime, but I could not stop watching Saiki Kusuo. The jokes are ridiculous and nonstop and the delivery is spot on. Most of the side characters are fantastic to watch from his bumbling parents to the \"perfect pretty girl\" who obsesses over him because he's the only person who could not be asked to care. \r\nFor Saiki Kusuo it doesn't matter how powerful you are, the world doesn'tstop being stupid, and I wouldn't have it any other way.",
            "date": "2018-08-10T21:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 286151,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/redwooddown",
                "username": "redwooddown"
            },
            "url": "https://myanimelist.net/reviews.php?id=286151"
        },
        {
            "content": "REVIEW WITH NO SPOILERS\r\nI never expected to have so much fun watching an anime.\r\nThe story follows a overpower high school boy surrounded by idiots.\r\nThat's it. The episodes have 5 minutes. And it's brilliant, because the humor is really clever and really absurd.\r\nThe animation is really solid and colorful, nothing unique but really pretty. I would not recommend if you want to think about life, complicated social questions watching an anime.\r\nBut if you're looking for an anime to pass the time, like watching while you're in the bus, this is really great. Or in the case you're looking for a wonderful comedy anime that's really practical,THIS IS IT.",
            "date": "2018-07-08T19:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 283464,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6406325.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JohnPerez",
                "username": "JohnPerez"
            },
            "url": "https://myanimelist.net/reviews.php?id=283464"
        },
        {
            "content": "Short and sweet, if you are looking for a comedy that breaks the fourth wall from time to time, has an OP protagonist that hates his power (in a \"do I have to\" kind of way), and really doesn't make a lot of sense, then this is the anime for you. It never goes too over the top, is usually good for a laugh, and has very short episodes in case you don't have a lot of time (they made 4-5 episodes make one story line but each 5 minute part is self contained. It is a surprisingly good format.)\r\nSound like something you'd like? Watchit!",
            "date": "2018-04-12T21:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 277912,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mortemdeus",
                "username": "mortemdeus"
            },
            "url": "https://myanimelist.net/reviews.php?id=277912"
        },
        {
            "content": "“Anything that can go wrong will go wrong” -Murphys law\r\nFirstly to get some things out of the way, the plot for this show is non-existent this isn’t a serious anime it’s an anime purely meant for enjoyment and comedy. Secondly the episodes are 5 minutes shorts collected into 23minute episodes and most of the shorts don’t have any relevance to the episode before however some shorts do which make for an enjoyable story arc. \r\nWhat I particularly liked about The Disastrous Life of Saiki was how it utilises Murphys Law in almost all of its shorts and then the writers use Saiki’s cunning and methodicalthinking paired up with his many supernatural powers (without letting others know about his abilities) to correct these problems or in some cases, endure the problem, this was a very original way of creating comedic effect and I applaud the writers for using this technique to make The Disastrous Life of Saiki a very original and enjoyable comedy anime. I also appreciated the side characters unique personalities and how it contrasted with Saiki’s bland and uncaring personality which I also like how Saiki’s views consistently contrasted with the side characters actions or views which made for some pretty comedic moments. Moreover I like how each short is unique in its own way and how the writers think up new gags to use in the shorts and also how each short is enjoyable and comedic.\\n\\n\r\nI would recommend this anime to anyone who likes either the comedy genre or the supernatural genre because The Disastrous Life of Saiki is one of the very few anime that stand out among its genres by using different original ways to create comedy e.g Murphy law which made it a very interesting and enjoyable watch.",
            "date": "2018-04-07T11:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 277254,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6678743.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Yatdude",
                "username": "Yatdude"
            },
            "url": "https://myanimelist.net/reviews.php?id=277254"
        },
        {
            "content": "Actually, when I went looking for something to watch I was looking for a romantic drama anime.  Instead I found... this.\r\nI can't stop laughing.  While watching this I did something I never ever do: I laughed out loud in room by myself.  I'm glad I wasn't drinking anything because I'd be cleaning it off my carpet right now instead of typing up this review.\r\nYou already know the plot, and honestly it's fairly repetitive.  Episode after episode, our MC is faced with the annoying, persistent, and hilarious challenges of being an overpowered psychic.  This shouldn't work, but somehow they pull itoff:\\n\\n\r\n+ First and foremost, the voice actor for the MC is a genius at deadpan delivery.  Even though I can predict his lines most of the time, the way he delivers them often has me on the floor rolling.  It's silly at times, even puerile, but the main character is incredible due the performance of his seiyuu.  Also, not having a completely generic milksop for an MC is a nice change of pace.\\n\\n\r\n+ The main character's parents are a hoot.  I am usually annoyed by such weak personalities that would drive their family to ruin within a year, but for some reason it is comedic gold they keep mining again and again.  \\n\\n\r\n+ Supporting characters are also annoying as all get out, but again they make it work.  The writers are able to take their stereotypes and poke just enough fun at them to let us know we're also in on the joke.  \\n\\n\r\nThat's the key to the series really.  Instead of hoping that we are stupid viewers who will succumb to the common tropes of anime comedy (e.g. the MC trips and \"accidentally\" gropes a girl), they instead poke fun at the often lazy writing in the genre itself.  In fact, nearly an entire episode has the MC narrating by breaking the fourth wall and taking tongue-in-cheek shots at the anime industry by explaining how his psychic powers are the actual cause of all the odd realities in anime: like why the Japanese people have multi-colored hair in anime.\\n\\n\r\n- The only thing I can think of that might detract from your enjoyment is if you can't see past the show's intentional attempts to annoy you and then defuse the annoyance with the MC's response to the situation.  That's their winning formula: how does an overpowered psychic deal with super-annoying situations?  If you're the type who gets too involved with what you're watching and puts yourself in his shoes (and into his troubles), then you'll be too annoyed to enjoy the humor.  For example, the personalities of the support characters are intentionally reprehensible.  The guy with the 8th grade syndrome is especially cringe-inducing, but his other \"friends\" are nearly as awful.  Seriously, none of the people surrounding Saiki are people you'd want to make friends with, not even the well-intentioned jock who helps everyone.\\n\\n\r\nSometimes you get lucky and you find something you weren't looking for and it's very, very good.  I keep telling myself I'm going to stop watching at the next episode and locate that romantic drama, but instead I let the next episode roll on to the next one, and the next one.  If you have a funny bone in your body somewhere you should watch this--but make sure you're not going to creep out anyone living with you by laughing hysterically.",
            "date": "2018-03-18T19:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 274246,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Qichar",
                "username": "Qichar"
            },
            "url": "https://myanimelist.net/reviews.php?id=274246"
        },
        {
            "content": "I've watched this series in 2016 and re-watch it again in 2017. To anyone who are fans of good-quality comedy genre or super busy with their life but still want to enjoy some short good stress-relief, this anime is for you (as one episode lasts for 5 minutes) . As for my rating: \r\nStory: 10 \r\nThe reasons I give such an outstanding score is because this anime is not like your usual comedy anime. The comedy material are fresh every single episodes and none of them are reused to the point where you can just guess what this character will do comically. It gives youthis feeling of mind-blown of \"how come this author could make such comedic scene like this\". Furthermore, the story really captures the essence of the character and the comedic pace are not mundane. Is it re-watchable? Definitely yes!\\n\\n\r\nArt: 7\\n\r\nThe art itself doesn't look like it could attract many people to watch the anime due to the use of its generalized anime style. However, I could say each scene in this anime are vivid because not all character just sit still and watch another character doing something (ex: when Saiki speaks, you could see in the background Nendou and his friends are doing something silly, etc). This scene direction totally makes the viewer really engaged to the anime. \\n\\n\r\nSound: 7 \\n\r\nIf you seek for a memorable ost in this anime then there's none. HOWEVER, the way that the sound effect or the background music interacts with a certain scene being played is really spot on. (ex: certain character shocked, there's this TA-DAAH sfx that could portrayed the same shocks that the character feels). \\n\\n\r\nCharacter: 10\\n\r\nDo they look unique? Yes, heck even absurd. What about their personality? It totally suits their looks, bizarre and unique. (Ex: Kokomi looks like those popular and kind bishoujo girl. You think that she acts like she's really nice to people, much like the bishoujo archetype. However, she's a stuck-up narcissist who thinks that the world revolves around her.) This characteristic though, really gives the series a comedic punch right through the audience and makes them laugh at how stupid some character acts. \\n\\n\r\nEnjoyment: 9\\n\r\n It's a good series, I dare you. You wouldn't even take your eyes off the screen because of how hilarious the character is and how unpredictable their action is; making you question what will happened next? The comedy itself could instantly make your day better! (I'm not exaggerating though)  \\n\\n\r\nOverall: 9\\n\r\nIs it recommended to watch? Hell yeah! Get ready to feel the roller coaster of comedic fun!\\n\\n",
            "date": "2017-09-23T10:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 258387,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6288066.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FarmerGirl",
                "username": "FarmerGirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=258387"
        },
        {
            "content": "The Disastrous Life of Saiki K. Overview\r\nMerits:\r\n-\tGood Sense of Humour.\r\n-\tVery Likeable/Relatable Protagonist.\r\n-\tUse of Psychic Powers as a main theme.\r\n-\tVery likeable minor characters each with a specific personality.\r\nCons:\r\n-\tEach episode is split up into 4 parts which can slow the pace slightly; also I am not a fan of it.\r\n-\tEven through each character has a specific personality they feel somewhat shallow sometimes but not always.\r\n-\tSchool theme is very common; I don’t mind it but prefer something unique.\r\nIS THAT A GIANT HAMBURGER POTATO HYBRID WITH QUANTUM LASER TORPEDOS!? No? Oh…want to get some McQuackers; I’m kind of hungry now.\r\nRandom comedy is my favourite comedy, this is always apparentwith anime too. Because anime (this can also relate to Western Cartoons too) have no boundaries in which the comedy can flow they can pretty much do whatever they want. On the over hand everyone has a different style of comedy and find certain things funny that others do not, even though because of this we have a diverse range of comedy to pick from. Saiki Kusou no Psi-Nan has top notch comedy in my book but is that because of my personal preference; for example I like Saiki’s personality and the fact that he finds pretty much all normal things pointless and boring because his psychic powers allow him to pretty much anything.\\n\\n\r\nThe greatest comedy comes from the fact that Saiki which simply wants a quiet and peaceful life ends up accidently making somewhat reasonable decisions, which for some reason turns out disastrous. For example he makes friends with people even though he doesn’t want any but this can be down to there singular personalities.\\n\\n\r\nRiki Nendo – Saiki can’t read his mind and thus makes it difficult to predict what he’s going to do, reading minds is one of Saiki’s powers. Although due to Nendo being a complete idiot, it makes it impossible for Saiki to read his mind. Nendo ends up becoming friends with Saiki regardless of Saiki’s choice in the matter.\\n\\n\r\nShun Kaido – Suffers from 8th Grader Syndrome as Saiki calls it, thinks he’s the protagonist for some fantasy anime and thinks that Dark Reunion will be the end of us. He can be quite funny at times considering even though he thinks he’s some powerful fighter in reality he’s really weak.\\n\\n\r\nKokomi Teruhashi – The prettiest girl in school, or how this anime portrays her to be the prettiest girl in the world. She’s extremely self aware about this and thinks that all boys should worship her and acknowledge her beauty. Saiki on the other hand see’s everyone as flesh and bones, once Teruhashi realises this she goes out of her way to get Saiki to achnowledge her.\\n\r\nKineshi Hairo – The class-rep and is all about spirit and willpower to do and overcome everything. Not much else to say about him sweats a lot and shows his ass quite often. Don’t really find him funny.\\n\\n\r\nI won’t go over any other characters as it’s unnecessary.\\n\\n\r\nI’m not much of a reviewer; I don’t think I spoiled anything for you. Saiki is just straight up funny, but considering my favorite comedy anime is Bobobo-bo Bo-bobo my comedy is quite obscure. I found this series to be funny and you might as well.\\n\\n\r\nPlease keep in mind again that my comedy is obscure, I find Bobobo funny but Gintama not funny. This is mainly due to Gintama having hit or miss comedy for me and the pacing being thrown off when it gets serious, like how can you try to do both? Just completely takes me out of it and I lose interest. I have tried to get into Gintama (just look at all the seasons I’ve watched) but just find the comedy unbalanced and when it gets serious boring. Sorry to go off on Gintama just wanted you to get a complete understanding of my comedy.\\n\\n\r\nSaiki I give a 7/10\\n",
            "date": "2017-01-01T07:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 237161,
            "reviewer": {
                "episodes_seen": 120,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1388749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KungSour",
                "username": "KungSour"
            },
            "url": "https://myanimelist.net/reviews.php?id=237161"
        }
    ]
]