[
    [
        {
            "content": "the only baseball anime i will ever watch!!\r\ni only started watching this because of yuki kaji, but i ended up falling in love with it. for people who enjoy character-driven stories like me, this is a great anime to watch. it's very satisfying to see how all of the characters come together and become some sort of found family.\r\nthe arcs aren't drawn out, but instead of feeling rushed, they just make me feel more satisfied. they spend a bit of time in each arc introducing and fleshing out a character, which is to be expected with how many there are in the group. it doesn'tfeel disjointed though.\\n\\n\r\nthe music is also great!!! the jazz ed playing at high points of the episodes kind of remind me of archer a bit. and the op is a quality bop as well!!\\n\\n\r\nthe only thing that bothers me is how they use light in scenes outside, but other than that, i really love this anime. hope more people watch it!!",
            "date": "2018-03-30T10:19:00+00:00",
            "helpful_count": 69,
            "mal_id": 275741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/loancruz",
                "username": "loancruz"
            },
            "url": "https://myanimelist.net/reviews.php?id=275741"
        },
        {
            "content": "(Spoiler Warning)\r\nHakata Tonkotsu Ramens was one of the Winter 2018 anime I've anticipated for quite a while, and it truly delivered the punch that it deserves.\r\nStory:\r\nThe city of Fukuoka (or Hakata City as always mentioned) is not your usual city, while it thrives on the outside world, its citizens are literally another story. Basically, the thing is, one in every three citizens is are revenge-job-seeking hitmen, killers (whether hired or not) and detectives, all laying low in the lurch.\r\nZenji Banba is one of those private detectives in the Hakata area, trying to seek out hitmen companies so that he could interfere with their hitmen jobs,and that raises the aspect of hitmen Ling Xianming, a crossdressing man who's complaining about the lack of jobs and pay of his hitmen agency. A killer job out to exterminate Banba sets him the job of partnering with him and the slew of casts who are tied together with him (Saitou, hire-turn-target for Murder Inc, Enokida the mushroom head and intelligent hacker, the other hitmen Jiro and his caretaker Misaki) to figure out the disturbings of Hakata city.\\n\\n\r\nBased off a novel series of the same name, I was immediately pumped by the setting and was deeply enthralled with the killing (be advised, no one below 18 should watch this) and action that kept me engrossed all the while, and I wasn't disappointed one bit.\\n\\n\r\nCharacters:\\n\r\nZenji Banba isn't your causal, typical detective. Nicknamed the Niwaka Samurai for his slick-sharp ninja skills, he's considered the primary target for most of the hitmen, including the organization (sorry I forgot the name) that on hindsight oversees the entire hitmen situation, and with the help of his friends, he's always a step above the competition. His love for ramen, pollock roe and baseball defines the show's title and it's uncanny but good information.\\n\\n\r\nLing Xianming the crossdressing man who's on a mission to figure out the death of his sister, is the usual hitmen, until (as mentioned) the very agency he worked for are the culprits behind the murdering, and storms on a rage to get his revenge back. His young appearance with Fei-lan serves as both a brother and a backstabber, as his killing-ridden youth serves him the purpose of being a hitmen to this day. Never a man that's cool on jokes, he primarily serves to get his job done with the least amount of disruption possible.\\n\\n\r\nKazuki Saito is your average hired hitmen that really can't seem to do his job well after a hiring from Murder, Inc. that leaves him in tropes that nothing ever goes well for him, and that relegates him into secondary character development.\\n\\n\r\nEnokida, Banba's best informant and hacker, is also uncanny, but the best character I have seen in this series: Intelligent, knows his way around things, and even if in a tight corner, plays the trick games to eliminate his opponents into oblivion. His signature hacking is displayed by his red mechanical spiders that pick up info, and serves great information for him as sort of a pick-up. His relationship with his father is canon to the series, once admonished for hacking his dad's stuff, was sent to be killed but given a chance to live in Hakata and reestablish him as an alias to his real identity.\\n\\n\r\nShunsake Saruwatari (or Sarucchi as Nitta calls him) the hitmen sent to kill Banba (that no one else can kill) and Naoya Nitta the consultant on child murders both have a relationship that extends beyond the agency that they once worked for, Murder Inc. Their young days were spent playing baseball, and with that relationship, extends to the hitmen days where Sarucchi (like Lin) was getting tired of lesser jobs, and left Murder Inc on the job to exterminate Banba. Unfortunately, crossing with Banba with his always miss-the-target shirukens, so his killing resolves into another day.\\n\\n\r\nThe other characters (Jiro the other hitmen, Misaki his caretaker) really did a good job showing off their character traits, and that's something that I really treasure with the series, it's really good.\\n\\n\r\nArt/Animation:\\n\r\nSatelight really did their magic on this, and it really feels on-point with the lavishing visuals of Hakata City, no to mention the murders that though feel like uncensored, but it really fleshes out the series as its driving tour de force. The character designs were really nice and thought out through and through, giving the series the stylized, serious but casual look. Well done and well played.\\n\\n\r\nSound:\\n\r\nIt's weird for an OST to have a jazz-sounding track on here, but it's the same reason that is exemplifies the series when it comes in adherence to the settings that the series is based upon. With that said, the OST here is nothing short of a great job done, with the OP really giving the sense of the killing and murder intent and the ED totally jazz-sounding end card that showcases the series setting (AGAIN) and rounds it up like a summary.\\n\\n\r\nOverall:\\n\r\nHakata Tonkotsu Ramens definitely isn't a show for those below 18 (age-restriction), but it highlights what it was supposed to do, and it does that well. Moreover, like me, if you came into this with the PVs before it, the anticipation really turned out to be an experience not to be missed. With that said (for anime onlys), if you're up for the action, I'd recommend this to you, it's one of the great shows of the Winter season.\\n",
            "date": "2018-03-30T08:38:00+00:00",
            "helpful_count": 66,
            "mal_id": 275729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=275729"
        },
        {
            "content": "The night sky is vibrantly illuminated by the mellow glow of colorful lights, emanating from each building throughout the city. More lively during the night than day, the city of Hakata radiates a deceptively alluring glow covering it entirely; masking the dangers that lurk around every corner.\r\nHakata is infamously known for 3% of its population being comprised of hitmen, torturers, yakuza, and worse. This percentile is further divided into agencies, gangs, and websites for freelancers; a few of them are hilariously named “Murder Inc”, “Shadeyjobs.com”, and “RedRum Inc”. A sly snap at other action crime anime that strive to be realistic with overwrought edginess. Darklycomedic and self-aware writing like this permeates throughout Hakata Tonkotsu Ramens, immediately defining the tone as pure enjoyment as opposed to the logic-based standard.\\n\\n\r\nWith each member of the show’s large cast is in the 3%, it becomes abundantly clear that there’s always at least one criminal exchange occurring in this city. Even the cross-dressing main character Lin is an expert hitman with a comically harsh attitude. Cursing the men who ogling him, simply saying “I’m a man you moron” or “I’ll kick your ass” under his breath. He may say his cross-dressing is just because he likes the fashionable clothing, but he cleverly uses it as a method to be underestimated by his targets.\\n\\n\r\nAt the beginning Lin’s completing his latest hit on a private investigator, that is until he finds that he’d rather swap sides and defend him to try and earn some extra cash. Hakata is after all as much of a money-driven city as it is crime riddled and our main character is only a cog in the system. \\n\\n\r\nLin’s lone wolf personality immediately clashes in quite funny ways with the charismatic detective Banba. Make no mistake, him being a detective does not grant him moral high ground over the rest of the felonious 3%. In his introduction, we see him at a political rally casually feigning a gunshot by popping a balloon, all for the sake of weeding out a potential suspect. He often employs these radical but successful methods that no detective in their right mind would resort to. He's just as ready to kill as Lin and does so mercilessly alongside his hitman counterpart, with personalities so opposed it wouldn't be unfair to call them foils of one another. \\n\\n\r\nAt first, their whole relationship consists of Lin being annoyed by Banba’s listlessness and constant baseball metaphors. Then, to kick the first arc motion, Lin’s sister is unexpectedly murdered, forcing the unlikely pair to work together and seek vengeance against the hitmen agency responsible. \\n\\n\r\nIn the first of many arcs, the wide ensemble cast of characters is introduced. Each with a vivid personality, a distinct urban design, and a role they fill in Hakata. As Banba so nonchalantly puts it, they’re all playing a game of baseball. Whether or not you depend on the allies you make will decide how far you make it in the game. An ideology that starkly contrasts that of the lone wolf Lin, but satisfyingly he comes to embrace it as he spends more time with Banba. Them playing baseball on a team of their fellow hitmen served to support the show’s many metaphors, but also provided some of the purest light-hearted comedy in the show. Numerous food scenes also serve to lighten the tone, with delicious looking dishes and of course the titular Hakata tonkotsu ramen.\\n\\n\r\nAside from those heartwarming moments, a devilishly wry tone drenches Hakata. Delving into the criminal underworld, dark themes are inevitably explored; however, these themes do not overpower the sarcastically comedic tone due to the characters we see them through. Each member of the criminal cast contributes to this tone with cool and collected attitudes; aware that their dangerous careers can lead to their death at any time, they throw themselves into entertaining action. Any need any need for arbitrary anxiety is removed. Even with the uncertainty when the next betrayal, murder, or kidnapping might happen, the headstrong cast remains a joy to watch. Most of them work in or run those previously mentioned agencies and gangs. In one of the more impressively balanced but tonally ludicrous scenes, we see the stereotypical but inoffensively portrayed gay bartender Jirou with the sly middle school girl Misaki design their torturing agency website as casually as if it were a school project.\\n\\n\r\nOnly one character, a fresh face in town trying to start his hitman career, gives us a perspective of what an everyman would look like stuck in the middle of the whirlwind of crime. He's way out of his depth and gets into many hilariously troublesome situations. These side characters don’t receive the same level of development as the leads, but through seeing where they fit in the wacky underground of Hakata they become likable people who get further exploration in the background of the central story. After all, the story moves like a bullet, a pace fast enough to engage but it still finds the time to spare on the minor details. Shaping the world and its inhabitants as believable rather than outright outlandish.\\n\\n\r\nMost importantly out of the whole cast, the lead characters Lin and Banba are unphased by Hakata’s crime-infested underground and are ready to give it all they’ve got in combat to secure the outcome most in their favor. \\n\\n\r\nSharing a few snide comments to maintain an air of entertainment rather than fear, they slice, shoot, mask their identities, and use every trick they’ve got up their sleeve to create action set pieces worth watching for alone. In spite of the show’s relatively low budget, it thrills with swift and comprehensive shot composition, thoughtfully composed writing, and enough blood to earn an R rating. \\n\\n\r\nBolstered by a volley of trumpets rising during action scenes and mellowing into jazz during quieter ones, even the soundtrack contributes to the rich style. Both opening and ending sequences have fast pace jazzy tracks as well, showcasing major characters in rapid-fire succession with enough style and symbolism to make them as substantial of the show. Practically every facet of this anime carries the city’s dense style; the glow of colorful lights reflecting off the river during the night, as well as sunshafts sneaking around buildings during the day. \\n\\n\r\nHakata is the kind of setting that serves as a character itself, with a distinct visual style underscored by jazzy music, alluring but also undeniably dangerous. Stylish, darkly comedic, and slyly self-aware. Even without a complex plot or top-tier production values, Hakata Tonkotsu Ramens is a good neo-noir action anime worth watching.",
            "date": "2018-03-30T16:24:00+00:00",
            "helpful_count": 41,
            "mal_id": 275797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=275797"
        },
        {
            "content": "Hakata Tonkotsu Ramens is like an action movie made in todays Holywood. It doesn't make sense, it's overflowing with clichés and one could ask why the hell does it even exist. Yet, it does and I have to bear with the fact that it'll continue to exist. Because there is one reason why it does still make a lot of money. And that reason is the action, because action equals entertainment. But entertainment, like Hakata Tonkotsu Ramens perfectly shows, doesn't equal quality. \r\nThe story takes place in a city Fukuoka, which, in this fictional version, is overflowing with killers and assasins. So much infact thatthe show itself tells you that 3% of Fukuoka's population are indeed those blood-seeking hitmen. Wait.. what? Let's take a minute and think about how ridiculous that number is. Speaking in the name of math, every 33rd person is a killer, and we are not counting those who are not directly killing, but work within the hitmen system aswell, hence the number of people either working or helping the hitmen companies is even more ridiculous. Not only it begs a question like 'why doesn't the police or goverment do anything about it' it's also absurd to believe that such a city could even exist as it would be very normal for people to move out of a city in which there are murders happening at every corner of the street. Oh but please don't missunderstand, I don't want this show to be realistic, I purely want it to make sense. Which it doesn't.\\n\\n\r\nYou might start complaining that I'm digging too much into details that are not supposed to be the main factor of the show and that I'm just nit-picking to find mistakes in it. Which is fair, because I propably am, however I just can't stand that the show tries to act normal and peaceful even though the information it provides suggest almost everyone should be dead by now and the whole city should be in shambles. And it's not just that. Nothing about the show makes sense. I have an another example. There are some sort of detectives, which might make you think that somebody wants to do something about the situation. However, the only thing the detectives do is kill the 'bad guys', which results in more mad people, which results in more hitmen jobs, which results in more killed people. Good job Mr. Detective, you really saved the city this time around.\\n\\n\r\nOne thing I hear a lot when defending a non-sense making show is that it's just making fun of itself, which is something I understand and can respect. In terms of Hakata however, it just seems like a lame excuse. Sure, all the things I've written might make it seem like the show is a one big satire. However, even if that's supposed to be the case, it doesn't work. A show that it worked quite well in is for example Animegataris. Which was just a parody in general, and a good one at that. Hakata is not a parody. It's creators exaggerated every single statistic number to new heights to make it seem like it's an original idea and then completely forgot to explain why are the things as ridiculous as they are. That's a parody? No, that's laziness.\\n\\n\r\nIn terms of the actual story, the show could be divided into a couple of arcs in which always some sort of bad guy who likes to kill people appears only then to be killed or reformed to a good guy in the end. Sounds plain and simple and that is exactly the case. It always tries to give us background information about some of the characers, but not only those moments fail at making me care about them, the flashbacks themselves are in most times so overused and cliché that you can't even take much from them. There was for example that classic case of two best friends forced to kill each other in order for one of them to survive. Which is as cliché as you could possibly get. The whole story development also lacks a lot of drive and almost every episode, even if having a different villain and resolving around a different character, always had the same feeling as the ones before. Overall, the story ended up being a huge pile of rubbish mess that didn't make any sense and wasn't even interesting one bit.\\n\\n\r\nAnother thing that supports my claim of Hakata being a bad anime are the characters. Which are (suprisingly?), just very bad. I guess I'm gonna start with the main duo, Bamba and Lin. Both of them are hitmen and they start living together because of circumstances I don't even remember anymore. Bamba is a.. nice guy, potentially. A classic case of an outgoing, caretaking MC that would normally end up with the female MC. I said normally because there is not really a female MC present. But you know who is? It's Lin. A guy, who is, for untold reasons, wearing women clothes and a blonde wig for the whole show. Yes guys, that 'girl' on the cover is a guy in reality. Well, atleast the show says it. I personally wouldn't want to believe it because outside of having a male voice-actor, that guy is just a classic anime woman in heart. You know, just a 'trap' in general. And I hate traps. They are always the most bland and poorly developped characters in the entire show and their only purpose to exist is to get the memes going for you. Which is a process just begging for attention. He is also an extreme Tsundere, which is just a terrible personal trait for males in general and the whole series makes it seem like he has a thing for Bamba. All hail yaoi? Well, nothing really happens (thank god), but the feeling is certainly there at times. And while the show tries to make us care about both of them, neither of the two appealed to me in any way. Quite the opposite actually.\\n\\n\r\nAs for the other characters, I don't think anyone is even worth mentioning. There is really a lot of side characters and almost none get any actual screen-time. The reason for that is that the show really overdid it with the number of people shown. You'll realize soon enough that there are so many characters just standing in the background doing absolutely nothing, that really shouldn't even be there. The problem of so many random characters came in place when some of the kinda important ones really started to blend together and I just didn't know which one of the bad guys is on the screen anymore. And talking about characters, I think the show tried too hard to 'please' everyone with the personalities diversity. There is the super-smart guy, the loli, the strong guy, the dumb and aggresive guy, the Tsundere, the nice guy, the innocent and clumsy guy and some others. I'm not saying that this would't work under different circumstances, however in this case it felt like the show once again tried to hide it's huge flaws behind a thing that could possibly appeal to the audience, which could result into them not noticing the actual mess. And by the mess I mean the non-existent plot continuity and terrible character development.\\n\\n\r\nThe last thing the show does and the only thing I can agree does atleast respectably well is the action. Environment around hitmen and assasins provides quite a lot of ground for fightning and killing and the show does an OK job at exploiting that. The fights, while not being dramatic or climactic by any means, are pretty much the only bearable part this anime has. One because you are able to forget about all the other things for a while, Two because they are not the worst even in comparison to some others. Though I still have to say that while the close-quarters combat was the one done decently, whenever anyone tried to use a gun I was asking myself if they ever held that thing in their hands.\\n\\n\r\nThe art was definetly not the worst, I would call it very fair. Some characters had interesting desings though most of the less important ones looked almost the same. The whole animation wasn't bad and the arstyle looked nice and clean. The OST was very fast-paced and decent, though nothing extraordinary by any means. The voice-acting was not the most pleasant, though I think it's rather a problem of the character personalities rather than the actors that voiced them.\\n\\n\r\n------------\\n\\n\r\nWith my review coming to an end, it's about time to answer some questions. Is Hakata fun to watch? Possibly, it's fast paced and has a lot of blood. That's enough for lot of people. But is Hakata also a good anime? No, it's not. It tries to hide it's undeniable flaws behind some action and self-aware jokes, and goes full-on enjoyment mode without caring about it's actual quality. And while I think I would fall for the bait half a year ago, I'm slowly getting to the level in which I also care about if the anime is actually good. And Hakata Tonkotsu Ramens is not.\\n\\n",
            "date": "2018-03-30T09:14:00+00:00",
            "helpful_count": 31,
            "mal_id": 275733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6348377.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Tomm01p",
                "username": "Tomm01p"
            },
            "url": "https://myanimelist.net/reviews.php?id=275733"
        },
        {
            "content": "I'd like to share my thoughts on this Show, as I think it doesnt get the Attention it deserves. [EDITED]\r\nStory : 7\r\nHakata Tonkotsu Ramens is the Story of a Group of Killers. You'll see who they are, and follow them while they struggle through life. There are a few Story arcs that will develop each characters, nothing complicated. Some stories like the first one could have been developped more and some may seem unnecessary but it doesnt Keep you from enjoying the Show.\r\nEven though the world the caracters live in is really violent, the fact that it is normalized and that noone in the Animeoverreacts makes you accept the context and enjoy the Show. It even makes it more unique.\\n\r\nOf Course there is some social criticism, as it deals with corruption, murder, modern slave trade, drugs..\\n\\n\r\nArt : 8\\n\r\nBoth the opening and the ending have a great style.\\n\r\nI found the caracter design really cool, the animation is smooth, theres really nothing negative to say about it\\n\\n\r\nSound : 9\\n\r\nThe ending is outstanding and gives a unique style to the anime as is it also used as an OST during the episodes. The opening is also very good, and the other musics are descrete but well used\\n\\n\\n\r\nCharacters : 9\\n\r\nTo me this is the strong point in this anime. I got attached to the caracters very quickly. They all have their Backstory or an entire arc dedicated to them, and the anime manages to make you like them all. Even though they're killers, you see them act as humans, and they become heroes even though they should be antiheroes.\\n\\n\r\nEnjoyment : 9\\n\r\nI can't give a 10 because this is not the Anime of the year, but I can tell that this is one of the Shows I looked Forward to the most during the week, and it has a very unique atmosphere.\\n\\n\\n\r\nOverall : 9\\n\r\nI can't give this Show less than nine as it is really enjoyable once you've gotten attached to the caracters.\\n\\n\r\nSorry for the poor english",
            "date": "2018-03-05T10:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 273094,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4624672.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SerebiSenpai",
                "username": "SerebiSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=273094"
        },
        {
            "content": "An Interesting Mystery With an Excellent Soundtrack\r\nThis show has the potential to become a slightly more comedic, but also grounded Psycho Pass in my eyes. The setting, while more than a bit ridiculous in concept, is still a pretty cool world with endless possibilities for big action and twisted crime capers that refreshingly have no sci-fi tech or magic involved for once. It also has the foundation of some potentially great sociopolitical satire as it essentially turns modern day corruption in the regular political process up to eleven a its entire premise and I'm excited to see how the main conflict will unfold over thecourse of the series, it certainly has my attention.\\n\\n\r\nThe characters, while somewhat simplistic in design, have wit, humor and unique personality that make up for it in strides, not to mention that their professional fields also tend to require that they be at least a little badass. The assassin, bodyguard, corrupt cop and honest detective factions that are revealing themselves are all entertaining to watch interacting with their various codes of conduct and MOs and they all boast a new cool or crazy character or two. \\n\\n\r\nThe OP and EP, along with the running score of the show are also primo, catching major Cowboy Bebop vibe in terms of both sound and choreography and that's something you'll never hear me complain about. Overall, it's not top tier excellent quite yet, but it has the makings of something special and I'm definitely going to be keeping up with it if the quality remains consistent and the story keeps improving, it's an 8 out of 10 so far.",
            "date": "2018-02-09T19:32:00+00:00",
            "helpful_count": 15,
            "mal_id": 271147,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6557058.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShotgunXShogun",
                "username": "ShotgunXShogun"
            },
            "url": "https://myanimelist.net/reviews.php?id=271147"
        },
        {
            "content": "(NOTE: When writing this review I had watched the first 5 episodes of this title each week upon release. I tried to avoid spoilers. There may be some very mild spoilers by context, but definitely nothing plot related.)\r\nHakata Tonkotsu Ramens is the most surprisingly entertaining and enthralling anime of the current season, in my opinion. It feels almost like a slice-of-life anime as you watch it, filled with colorful, interesting characters and goofy situations. However, these are interspersed with moments of intense action, drama, energy, and tension. Though it may start off a bit soft and slow, the story and its diverse cast of quirkycharacters will quickly draw you into their daily struggles for work, companionship… and survival. \\n\\n\r\nYes, survival. As in, trying not to get a bullet through the head. Despite its appearance and benign title, Hakata Tonkotsu Ramens (I’ll just call it HTR from now on) addresses some very, very adult themes as the story progresses, and therefore this show might not be for everyone. And I don’t mean “adult themes” like an ecchi anime. Five episodes in I haven’t seen a single case of fanservice in this show. No, the adult themes of HTR are of a more dark, sinister nature, something that clashes wonderfully with the upbeat, charming characters that populate this world. The plot of HTR follows the stories of a number of hitmen and their associates in the city of Fukuoka as they fight for work, money, family, revenge, forgiveness, and the simple right to live a quiet and normal life as they please. The writers of HTR go on to bring in some incredibly dark themes such as murder, rape, human trafficking, political corruption and intrigue, blackmail, physical and psychological torture, and more. All this would normally produce an anime that leaves the viewer with a bad taste in their mouth, but HTR contrasts these themes brilliantly with a cast of comedic, intriguing, wonderful characters, who lighten the story and allow the viewer to approach these horrors in a relatively safe and controlled way. \\n\\n\r\nWhile the story of this series is still developing at this point, I would also like to mention how well the plot of HTR has been woven together. The story starts out feeling somewhat disjointed; each character in the show is introduced individually, in their own separate contexts. However, the writers quickly lead us, the viewers, to suspect that all of these disparate characters are somehow, some way, connected to one another. Call it fate, call it good writing, call it whatever you want, the story quickly leads its audience to suspect that there is more to this anime than meets the eye, a feeling that has kept me coming back for more each week. \\n\\n\r\nThe music in this series has been fairly mundane thus far, nothing stood out to me as being particularly bad or good about it. The voice acting is excellent, the animation crisp and clear, and as I already said, the story is both entertaining and engrossing. If you are looking for an anime to try out this season, and enjoy complex stories that develop alongside their characters, I would highly recommend checking out HTR. We’re just five episodes in, and I’m definitely looking forward to next week.\\n\\n\r\nTl;Dr This show a delightful mix of Gangsta. and Durarara!.",
            "date": "2018-02-09T13:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 271123,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6475379.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TacitCandor",
                "username": "TacitCandor"
            },
            "url": "https://myanimelist.net/reviews.php?id=271123"
        },
        {
            "content": "I decided to give this anime a try after 6 episodes had been released because the reviews were pretty good. I was skeptical at first because the story didn't interest me. Hence, the reason I just started watching now. I'm already caught up and I'm glad I decided to give it a chance. I normally would watch shows with two or more of the following genres: fantasy, adventure, superpowers, supernatural, and comedy. That being said, this show is entertaining even for me someone who prefers shows like One Punch Man, Hunter X Hunter, Overlord, etc.. I would recommend giving it a try.",
            "date": "2018-02-17T07:11:00+00:00",
            "helpful_count": 10,
            "mal_id": 271744,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Casual_Anime_Fan",
                "username": "Casual_Anime_Fan"
            },
            "url": "https://myanimelist.net/reviews.php?id=271744"
        },
        {
            "content": "The story was promising at first. But what I thought was going to be our main character ended up panning out to be someone who was only relevant on certain occasions. I'm okay with an anime having certain arcs to it, but unless the arcs lead to a final conclusion, story line wise I lose interest...luckily the action was so well done in this anime that I never lost interest and the story basically took a back seat to the amount of kick ass moments there were. Plus BASEBALL!!!\r\nThe art and animation were not anything special. With guts, bloods, and brains spilling, along with headsrolling you would think they would do a little more then Red Sports and Rivers of Blood. The hand to hand combat scenes were done okay but again nothing over the top.\\n\\n\r\nThe opening and ending were really awesome. I thoroughly enjoyed them. The bgm was slightly above average but still fit the show great.\\n\\n\r\nThe freaking characters were so enjoyable to watch. Normally an anime with a proficient amount of males turns me off to it, but these guys were freaking awesome! Each in their own unique way.\\n\\n\r\nI really enjoyed this anime a lot. It gave me a break from a lot of the cute and dramatic filled anime I have been watching for a while.\\n\\n\r\nOverall I can see how people will see flaws in this anime. Is it shelf worthy when it finally gets released on bluray? Maybe, but it definitely worth a watch if your looking for a nice action anime.",
            "date": "2018-03-30T11:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 275752,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275752"
        },
        {
            "content": "TL;DR: It's Durarara!!, but stupider, and it's fantastic. Watch at least the first two episodes, since episode 1 doesn't sell the show as well as episode 2 does.\r\nDo not expect great plot or lore from this show. The plot is purely an excuse for characters to bounce off of eachother in fun and interesting ways. The highlights of this show are its action scenes, its characters and their designs, and the sound. \r\nThe action scenes, at least as far as has released at time of writing, are pretty fantastic. Solid animation, plenty of blood, and a god number of stupid cool moments. Stupid is theoperative word here: a guy swings a katana like a baseball bat to reflect a bomb, and it works. If that makes you roll your eyes, this isn't your kind of show. It's stupid, it knows it, and so it throws just enough logic out the window to let it do what it wants, while keeping just enough logic for things to be coherent, if silly.\\n\\n\r\nThe characters in this show are really entertaining. Everyone has a pretty distinct and interesting personality, and the way they interact with one another is pretty fun to watch even when nothing's happening. Additionally, every character, even the ones who show up for one scene with no dialogue, has a memorable design that sets them apart from each other character in the show. This means that you often can't tell whether characters will last past the arc or even the episode they're introduced, leading to several moments of \"oh shit he's dead!\", which are very entertaining. The one complaint I have is that the main guy looks like a tool, but his design has grown on me a bit, and it's not that big of a deal.\\n\\n\r\nFinally, the show's music tends to be pretty good, but the main thing that makes me mention it is the ending theme. God damn, TRI4TH did a fucking killer job with it. It's jazzy and fun, and I love the way they put the 'next episode teaser' in the middle of the song and how that actually works. Fight scenes also have pretty good sound effects and such, so that's also good.\\n\\n\r\nHakata Tonkatsu Ramens is not a smart show. It is a very, very, stupid show. It's also been a ton of fun to watch this season, and I'm glad I didn't stop after the (mediocre) first episode. I think the best way to describe it is that it's Durarara!!, with a pinch of No More Heroes/Kill Bill, and a ton of brain damage. But I love it.",
            "date": "2018-02-22T11:51:00+00:00",
            "helpful_count": 9,
            "mal_id": 272183,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ramalammy",
                "username": "ramalammy"
            },
            "url": "https://myanimelist.net/reviews.php?id=272183"
        },
        {
            "content": "This show is worth your time. It is a dumb-fun action romp, but it is also more than that. It is a portrayal of queer people in a way that is fun, humanizing, sympathetic, and, almost miraculously, in an way that is not in the slightest bit preachy. If you like stupid action and also like gay characters and stories, you could do a hell of a lot worse than Hakata Tonkasu Ramens.\r\nI will be completely forthright and admit that I went in Hakata Tonkatsu Ramens (hereafter HTR) both expecting and wanting to hate-watch it. Even starting to watch this show with a clear biasagainst it's being good, I will be damned if it did not completely pleasantly surprise me by being a really enjoyable experience. I expected the show to be dumb, fun, and crappy, but what I found was that it was only the first of those two things. I love things that are dumb and fun, and as such I unironically loved watching HTR. \\n\\n\r\nStory: Only sort of. There isn't really a strong plot, but what there is instead is a whole bunch of character development and world building. In short, a hit-man named Lin comes to a new town full of crazies and murderers and finds out that it is actually the coolest town ever. Hakata is a city where everybody seems to be allowed to kill anybody they want to with essentially no repercussions and also does so professionally. Lin meets and befriends secret samurai detectives in cute sweaters, terrifying little girls, mushroom-shaped 1337 hackers, camp gay revenge dispensers, and clumsy and petulant ninjas. There are also some subtle homosexual overtones,  in the way that an episode of Rupaul's Drag Race also contains some subtle homosexual overtones. This show is gay as a peacock and all the better for it. \\n\\n\r\nArt: Not great. Actually pretty bad, which kind of drags the show down a bit. The character designs, barring one in main character Lin, are nothing to write home about, and the action scenes frequently go off model. The whole show in general looks a little crunchy. The fact that I still liked it anyway is a testament to the other strengths of HTR. \\n\\n\r\nSound: Love the OP. The song is catchy and emotional and always gets me hyped up. The voice acting is also great, and makes characters that could have been really stupid and cheesy instead seem grounded and relateable. Overall the sound great and fit the show like a glove. \\n\\n\r\nCharacter: Why you should watch this show. Not all of them are great, although all of them are fun. The ones who are though, namely Lin, deuteragonist Banba, and their relationship, are worth the price of admission on their own.\\n\\n\r\n Let us first take Lin. When we are introduced to Lin we see what appears to be a beautiful young woman in a school uniform and sensible high heels, but we soon find out that, despite what he may look like, Lin is very much a dude and will very much kill your ass dead if you get in his way. Lin lives his his life as a woman, and the fact that Hakata Tonkatsu Ramens chooses to have a person on the LGBTQ and so-forth spectrum as its hero and not choose to make fun of them or (SPOILER ALERT) murder them graphically is such a sight for sore eyes. We grow to know and like him despite and in fact partially because of his many and varied foibles, just as Lin grows as a person as he meets the residents of Hakata. \\n\\n\r\nChief among these residents (at least in Lin and the story's eyes) is Banba Zenji, a detective with a mysterious secret life and an LL Bean sweater. Banba takes Lin in during a rare moment of vulnerability, and much to Lin's consternation he discovers that he kinda likes it here. \\n\\n\r\nThe show ships Lin and Banba from the get, and their interactions are pretty damn cute. Lin is a textbook tsundere, and the fact that he is a man living as a woman makes the interaction between him and Banba all the more rife with incidences for Lin to tsun out over. Banba is alternately cool and adorable as the mood takes him, and really it is no wonder Lin falls for him so hard. I mean, just look at that sweater. \\n\\n\r\nHTR never comes right out and confirms that Lin and Banba are boning down, but come on guys we all know they are. It's great, just have fun with it! At one point Banba's ex girlfriend sits down with Lin and is like \"so Banba's totally your boyfriend, amirite?\" and Lin is like \"nooo I'm totally not a gay\" and then she basically looks at the camera with an expression on her face that might as well have been subtitled \"GURL PLEASE.\" Lin doesn't bother to defend the point. He's too busy being dere. \\n\\n\r\nThe rest of the characters are more or less successful and fun, particularly mushroom hacker and glasses ninja agent, but all of them feel like they live and belong in the world of Hakata. They all serve to help tell the story of Lin learning to love other people and eventually himself, and as Rupaul says \"If you can't love yourself how in the hell are you gonna love somebody else?\" The entire city of Hakata gives him an AMEN.\\n\\n\\n\r\nIf you made it through this overly effusive review, you owe it to yourself to watch this show. You are clearly interested in or at least appreciate gay shit, else you would've tuned out the second you saw the big scary word QUEER (oh my god so spooky!!!). If you are the kind of person who would enjoy watching To Wong Fu, Thanks for Everything, Julie Newmar but would also enjoy watching one of the sillier James Bond movies, go ahead and watch Hakata Tonkatsu Ramens. I am that type of person, and I LOVED it!!",
            "date": "2018-03-31T22:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 276152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983772.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jRad522",
                "username": "jRad522"
            },
            "url": "https://myanimelist.net/reviews.php?id=276152"
        },
        {
            "content": "When I went through the reviews of this anime I noticed an all or none phenomenon. People either loved it or despised it and that made me super curious. And man am I glad that I watched it.\r\nThe setting is very idiosyncratic. I mean a world where hitmen casually hung out and discussed their jobs and the people they murdered in public and had baseball teams...uhmm ...weird. But at the same time its pretty interesting if you just ignore the improbability if it. It had a bit of bebop feel to it at times(maybe thats just me though)\r\nThe art is good when its good butso very low budget at times. Sound is pretty good too but nothing to rave about.\\n\\n\r\nNow what made the story so so so very enjoyable for me were the characters. All of them are ridiculously quirky with amazing lgbt representation(for a shounen anime). Banba is definitley the hitman with a heart of gold but mess with him or the people he cares about and we see a totally different side of him. Lin is amazing. I dont think ive seen any non shoujo anime where a cross dresser is the lead but i seriously loved him. He met banba at a terrible point in time and slowly learns to trust him again. all the side characters were pretty intersting too especially the avengers. I felt there was solid chemistry between lin and banba but at the same time it leaves their relationship to the viewers imagination ( totally domestic newlyweds in my opinion). Very few female characters though\\n\\n\\n\r\nThis anime certainly has its flaws but i think the charm outweighs it. Id definitely recommend it to anyone who wants a fun anime watching experience\\n\\n",
            "date": "2018-03-31T00:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 275848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7077188.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rhiannon_carter",
                "username": "rhiannon_carter"
            },
            "url": "https://myanimelist.net/reviews.php?id=275848"
        },
        {
            "content": "Please watch if you like Durarara!! \r\nStory 9-10/10 (I really love this kind of story)\r\nNot that complicated (Drrr is far more confusing than this), will give you many surprised and voila! Usually I'm pretty good at guessing where the story will bring me but I failed several time from this series. Please watch if you like to be deceived (w).\r\nArt 7-8/10\r\nThe design is pretty good. Everyone has their own characteristic. The animation is so-so though. Several fighting scenes are good but some are not. The animation seems unstable. My eyes can tolerate it though. Not mentioning the story, enjoyment, and curiousity fill the lack ofanimation so it's okay.\\n\\n\r\nSound 7/10\\n\r\nIt's good. But nothing special. The OP and ED is awesome!\\n\\n\r\nCharacter 8-9/10\\n\r\nI like the character development. Feels so good and refreshing. The connection between characters is presented very well too. They have strong bonds for each other.\\n\\n\r\nEnjoyment 10/10\\n\r\nI can't wait to watch this every weeks. Although the excitement kinda down in the middle of the episodes. But it is awesome\\n\\n\r\nP.S : The relationship between Banba and Lin is amazing please don't miss it. \\n\\n\r\nOverall : \\n\r\nIt's great please give me more.",
            "date": "2018-04-08T12:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 277416,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1279301.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/futsuu03",
                "username": "futsuu03"
            },
            "url": "https://myanimelist.net/reviews.php?id=277416"
        },
        {
            "content": "Best anime of the season hands down!\r\nPlus more importantly best ending of the season!\r\nStory is uniquely interesting and well paced, although you probably need a matured mindset to wrap the entire concept around your head... cos it may be seen as a little controversial, which of course is one of the reasons why i love it. I give this a 10.\r\nArt & background is top-notch, no complaints there. Infact I wish i could visit Hakata with the vibrant way it was depicted here. I also give this a 10.\r\nSounds, also a 10. I personally love the opening & ending songs...it fits so well with theworld settings.\\n\\n\r\nNow the characters, where the show shines the best. Every character is well rounded and we see developments where necessary. We also see one of the best back story which gave more dept to our Tsundere MC. Of course I also give this a 10!\\n\\n\r\nI thoroughly enjoyed this and I really hope we get a season 2! For those that haven't seen it yet, or those that stopped on episode 1 or 2, you should totally give this a try. Yer won't regret it, desu!",
            "date": "2018-04-03T12:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 276712,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6328191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LeviAckermanChan",
                "username": "LeviAckermanChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=276712"
        },
        {
            "content": "When I think of this anime, the words that come to my mind include: killers, mentaiko, Hakata, hacking, crime, baseball, black market, justice, corrupt, etc. Killers are basically killing each other, and there's a hitman killing other hitmen.\r\nSet in Fukuoka, where 3% if the population are killers, this show is quite thrilling with a lot of action, but it's definitely not for someone under 18. It focuses on a corrupt society with murder, human trafficking, revenge, etc. Some places might look nice on the outside, but inside is way darker than expected. Unfortunately stuff like this actually happens in the real world. There are hitmankilling people they are assigned to, and even a hitman killing other hitman. It's pretty violent with not much comedy, but there are some scenes that are relaxing and enjoyable. Moral and ethic issues come up throughout this show too. Are the killers all evil, or are they doing this because that's what they were assigned to do the job or are there other reasons?? Each of the main characters have different backgrounds that are explored in the episode. If you read the light novel like I did, you'll learn even more about the characters. \\n\\n\r\nCharacter: I wish the anime explained more about each character and their backstory. They did a good job for Lin and Enokida, but the rest were not that clear. Why is Misaki with Jirou?? There's not much about Banba actually. \\n\\n\r\nAlso the title mentions ramen, but food is not the main part of the show. I first thought this was maybe a show about food, but it's totally the opposite. The OP is not bad. The music is jazzy, something I did not expect for an anime like this. The order for the last two arcs in the anime are slightly different from the novel, but it doesn't seem to have a big problem. I would recommend this for adults who want some action anime. It's not super powers like BNHA, Naruto, OP, etc, but more like violence you can see in the real world. \\n\r\nOh, and there is baseball in the show. The baseball scenes are quite enjoyable.",
            "date": "2018-03-30T14:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 275784,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5523670.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/momo9",
                "username": "momo9"
            },
            "url": "https://myanimelist.net/reviews.php?id=275784"
        },
        {
            "content": "This show isn't a mature, dark, or edgy look at the criminal underworld like some of the people who praise it would have you think. Nor is it a stupid premise that went nowhere, like the haters would say. It's just fun. It's also a breath of fresh air from the usual high school setting and moe girls.\r\nI'll have a lot of negatives to say about the show in this review, but don't get me wrong. I enjoyed it a lot, and I recommend that you try it.\r\nA city where 3% of the people are assassins? Absurd. All the people relevant to the plot happento know each other and/or randomly meet each other in the city? Impossible. If you're going to be put off by this, it's probably not the show for you. I wouldn't blame you.\\n\\n\r\nWhat the show is good at is the characters. This show is honestly just a bunch of eccentric, hilarious, but still believable characters having hilarious interactions. If you saw (and liked Durarara), you'll probably understand what I mean about having a bunch of crazy characters talking to each other. There are plots, and story, and \"character development\" sure, but... well, I'll tell you about that later. There's a dude who dresses in a weird samurai getup and uses a sword. But when you meet him, it totally makes sense. He thinks it looks cool and won't let anyone get him down. There's another dude who gets a ninja theme, and again, it makes sense. He's not some crazy ninja fan, it's a marketing ploy to get more people to hear about him. It's things like this that kept the characters from feeling like absurd caricatures that wouldn't exist in real life.\\n\\n\r\nThe story? I mentioned earlier that you need suspension of disbelief. Something happens to somebody, it turns out all the characters are involved in a different part of the plot, they accidentally run into each other, then they team up to steamroll the enemies like a group of over-leveled MMORPG characters crushing a public event. Rinse, repeat. There is also a main-ish story. Sort of. I forgot about it until I was writing this paragraph.\\n\\n\r\nThe art? I like the designs. They're memorable, suit the characters, and animated well enough. The action is fine. (Aren't you glad you are reading this? Top-tier quality in-depth reviewing right here.)\\n\\n\r\nThe characters? They get over trauma far too quickly. Some stuff goes down in the first arc of the show, and it just never gets brought up again. They have believable motivations and backstories that support their personalities in the show, but they don't change. There's not a lot of depth there, either. The show tries to make Lin deeper, but it's hard to feel serious when it's usually silly.\\n\\n\r\nThe sound? It's not one of those OSTs that I remember after I finished watching the show. It didn't detract from the show, but it didn't stand out to me. The OP and ED themes were nice.\\n\\n\r\nAs a personal gripe, I thought the gay doctor was too stereotypically gay. I'm not the type of person who would really know if it was offensive or not, but it just irked me.\\n\r\nOn the other hand, I thought Lin was great. He crossdresses, and it's not made into a big deal. He's not a trap, either. I liked how it was done.",
            "date": "2018-03-30T13:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 275769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5783598.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DainBramaged",
                "username": "DainBramaged"
            },
            "url": "https://myanimelist.net/reviews.php?id=275769"
        },
        {
            "content": "Hakata Tonkotsu Ramens, an anime about assassins in a city, dealing with other assassins and corrupt groups / organizations, came out of nowhere during the Winter 2018 season and surprised me. I would even go as far as to say this was the dark horse anime of the season and possibly year. I did not expect much from this show but was pleasantly surprised with what I got. Basically, the show is comprised of arcs each comprising 2 to 3 episodes. The arcs focus on a particular characters problems with other characters of the protagonist's group involved. \r\n[Story]\r\nThis element was the biggest surprise for me.I enjoyed most of the arcs shown in the series and how it gives certain characters the spotlight. The main characters in the show are Lin and Banba who were both surprisingly likeable and a joy to follow throughout the show. They did a good job in making these assassins not seem unlikable and even succeeds in making me really care about the whole main cast. \\n\\n\r\n[Art/Sound]\\n\r\n Solid is the best I can say. There is nothing I saw that really ruined my enjoyment. I was also surprised to find a decent amount of saxophone/jazz like music. \\n\\n\r\n[Characters]\\n\r\nLike I mentioned prior, I enjoyed this cast of characters. The main cast is very likeable and I found them to be characters I wanted to root for. Despite this, the characters are not perfect. Lin by the end of the show was developed enough to where we knew enough of him and he became a very developed character. Some of the other characters were not given the same treatment. Banba in particular is an example. Despite this, given that the show is 12 episodes makes it understandable why many characters have to be sidelined and left undeveloped.\\n\\n\r\n[Enjoyment}\\n\r\nThis was the dark horse of the season. I was pleasantly surprised with what I saw in a season of cute girls doing cute things. This show brought me into a world of shitty people and made me explore a certain group of characters adventures through all of this. I found the first few arcs to be fun and interesting despite some OPness of some of the main cast. The last arc definitely was more predictable and not as strong as the others but despite this, did not really hurt the show.\\n\\n\r\nOverall, Hakata Tonkotsu Ramens is an anime for anyone looking to see an enjoyable action show. There is a likeable cast, a lot of bad situations for characters to go through, and just pure fun. Just be cautious of some lack of character development, over powered characters, and slightly weaker final act that doesn't answer every question.",
            "date": "2018-04-07T16:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 277297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wjs066",
                "username": "wjs066"
            },
            "url": "https://myanimelist.net/reviews.php?id=277297"
        },
        {
            "content": "It's been a long time since I enjoy an anime this much. It's about hitmen, they just do the job, not trying to do something for justice like one of the popular review said, the target just happen to be a bad person, nothing heroic here. (In the Light Novel they mentioned that the hitmen does take requests from police, to 'dispose' criminals they can't arrest by law.)\r\nThe characters' stories are interesting, art and sound are good and fit very well with the theme. They didn't make the best decision in some cases imo, but I enjoy watching this anime so much. My only complaintis there was no second season. I hope they follow the light novel, it's getting very thrilling at this moment.",
            "date": "2019-02-01T17:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 300644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7723550.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/CandyPool",
                "username": "CandyPool"
            },
            "url": "https://myanimelist.net/reviews.php?id=300644"
        },
        {
            "content": "Do you like cool and quirky characters, complex and multi-layered plots, and awesome knife fights? \r\nIf so, you came to the right place. This anime has all that and more. \r\nWe’ve got Lin, the straight crossdresser who looks irritated almost all the time but’s a lot brighter than you give him credit for. We’ve got Banba, the easy-going, enigmatic and downright cool guy who’s totally reminiscent of Spike Spiegel. We’ve got Enokida, the obligatory hacker who’s actually pretty interesting by himself, the perpetually unlucky Saitou who really is just not cut out to be an assassin, and the ‘Submarine Ninja’ who, despite the goofy name,is a short-tempered lone wolf. \\n\\n\r\nThat’s just to mention a few. Hakata Tonkotsu Ramens has a massive and extremely diverse cast, and all the characters are important in one way or the other. It’s a lot like Durarara!! In that regard, lots of minor events in the city have ripple effects that can alter the entire course of the story. You never know if that one guy you bump into whilst shopping will be the assassin that tries to kill you later, or the pitcher for your baseball team. It’s part of what keeps the anime exciting, and seriously there is rarely a dull moment.\\n\\n\r\n Sure, not everyone gets a load of screen-time, and that’s to be expected in a mere 12 episodes, but you get to know their personalities nonetheless. Lin, as the MC, is well developed – we get to see past his shell and into his backstory. The others are mainly developed through their interactions with each other. The characters are sort of like a family, but not like the Fairy Tail type. They tend to look out for themselves first and foremost, but will show up if someone’s in real trouble. They don’t show affection often, but it is somewhere under the surface. It’s less cheesy and melodramatic that way – plus all their snippy banter is quite amusing to listen to.\\n\\n\r\nInstead of a story revealed straight from the beginning, there’s a set of seemingly random episodes that introduce you to the city of Hakata and the weird bunch that inhabit it. There are some relatively heavy topics dealt with – murder, torture, human trafficking – but the anime doesn’t go all philosophical on you. Everything except killing is bad, and even then you should only try and kill those who deserve it (mainly organisations dealing with the aforementioned activities). It’s a show about various groups of hitmen after all, and an action series at that, so you would expect it to take a somewhat lighter approach to the killing aspect. Besides, we get to see a lot more fights that way.\\n\\n\r\nWhich brings me on to the art and animation. Both are good – nothing outstanding, but the city is well drawn, the fights are animated nicely and the characters’ faces show their emotions properly. \\n\\n\r\nThe sound is really great. The op theme felt really nostalgic for some reason, and the jazzy ed is also worth a mention. Distinct Cowboy Bebop vibes there.\\n\\n\r\nTo conclude, I did enjoy this anime a lot. It was fast-paced and entertaining. Some parts were downright clever, and the mysteries and fights were thrilling. I got taken in by a fair few of the twists, and I was always eager for the next episode. I’d definitely watch another season of this.\\n\\n\r\nI’d recommend if you like anime like Durarara!!, Cowboy Bebop, or just anything fast-paced, fun, and action-packed. XD\\n\\n\r\nBTW, the baseball aspect did catch me a bit off guard, but it ends up being more than just a distraction from all the killings. It’s used both to show the neighbourhood dynamic, and as a shared activity that helps to foster teamwork and trust. It’s also part of what makes the anime unique; instead of a cult or secret society they have a baseball team. And the best part? Watching them play baseball is made even more fun by just how absurd it actually is. 😊\\n",
            "date": "2018-04-01T15:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 276398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=276398"
        },
        {
            "content": "(Sorry ahead of time for my terribly awful organization of this review) Writing this after finishing the very last episode, and boy will I say, what a roller coaster. It started off very intriguing, yet confusing. But a few episodes in I was able to understand everything. They kept everything fast-paced, yet always slowly inching toward a massive, unexpected ending. There were multiple flashbacks for the main characters, and each and every one was VERY likable, diverse, unique, entertaining, funny, etc. I thought this was a solid show until up to the last few episodes, where I thought it was an AMAZING show, the lastep was action packed, just like the whole show. I highly recommend you watch this if you enjoy any sort strategic killing anime. This show features multiple agencies that have different relationships with each other, and follows the story of one guy through his journey through them and the city itself, rebellious acts through all. There's so much going on, and it's easy to miss something. Soundtrack was great, I loved how they were able to fit jazz into this killing spree. Overall, a fantastic show. It stands out among others and I most definitely enjoyed it even though I thought I was risking quite a bit watching this show due to the rest of my watch list. All in all, fantastic execution.",
            "date": "2018-03-30T21:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 275833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6250230.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/s1mthi",
                "username": "s1mthi"
            },
            "url": "https://myanimelist.net/reviews.php?id=275833"
        }
    ],
    [
        {
            "content": "the only baseball anime i will ever watch!!\r\ni only started watching this because of yuki kaji, but i ended up falling in love with it. for people who enjoy character-driven stories like me, this is a great anime to watch. it's very satisfying to see how all of the characters come together and become some sort of found family.\r\nthe arcs aren't drawn out, but instead of feeling rushed, they just make me feel more satisfied. they spend a bit of time in each arc introducing and fleshing out a character, which is to be expected with how many there are in the group. it doesn'tfeel disjointed though.\\n\\n\r\nthe music is also great!!! the jazz ed playing at high points of the episodes kind of remind me of archer a bit. and the op is a quality bop as well!!\\n\\n\r\nthe only thing that bothers me is how they use light in scenes outside, but other than that, i really love this anime. hope more people watch it!!",
            "date": "2018-03-30T10:19:00+00:00",
            "helpful_count": 69,
            "mal_id": 275741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/loancruz",
                "username": "loancruz"
            },
            "url": "https://myanimelist.net/reviews.php?id=275741"
        },
        {
            "content": "(Spoiler Warning)\r\nHakata Tonkotsu Ramens was one of the Winter 2018 anime I've anticipated for quite a while, and it truly delivered the punch that it deserves.\r\nStory:\r\nThe city of Fukuoka (or Hakata City as always mentioned) is not your usual city, while it thrives on the outside world, its citizens are literally another story. Basically, the thing is, one in every three citizens is are revenge-job-seeking hitmen, killers (whether hired or not) and detectives, all laying low in the lurch.\r\nZenji Banba is one of those private detectives in the Hakata area, trying to seek out hitmen companies so that he could interfere with their hitmen jobs,and that raises the aspect of hitmen Ling Xianming, a crossdressing man who's complaining about the lack of jobs and pay of his hitmen agency. A killer job out to exterminate Banba sets him the job of partnering with him and the slew of casts who are tied together with him (Saitou, hire-turn-target for Murder Inc, Enokida the mushroom head and intelligent hacker, the other hitmen Jiro and his caretaker Misaki) to figure out the disturbings of Hakata city.\\n\\n\r\nBased off a novel series of the same name, I was immediately pumped by the setting and was deeply enthralled with the killing (be advised, no one below 18 should watch this) and action that kept me engrossed all the while, and I wasn't disappointed one bit.\\n\\n\r\nCharacters:\\n\r\nZenji Banba isn't your causal, typical detective. Nicknamed the Niwaka Samurai for his slick-sharp ninja skills, he's considered the primary target for most of the hitmen, including the organization (sorry I forgot the name) that on hindsight oversees the entire hitmen situation, and with the help of his friends, he's always a step above the competition. His love for ramen, pollock roe and baseball defines the show's title and it's uncanny but good information.\\n\\n\r\nLing Xianming the crossdressing man who's on a mission to figure out the death of his sister, is the usual hitmen, until (as mentioned) the very agency he worked for are the culprits behind the murdering, and storms on a rage to get his revenge back. His young appearance with Fei-lan serves as both a brother and a backstabber, as his killing-ridden youth serves him the purpose of being a hitmen to this day. Never a man that's cool on jokes, he primarily serves to get his job done with the least amount of disruption possible.\\n\\n\r\nKazuki Saito is your average hired hitmen that really can't seem to do his job well after a hiring from Murder, Inc. that leaves him in tropes that nothing ever goes well for him, and that relegates him into secondary character development.\\n\\n\r\nEnokida, Banba's best informant and hacker, is also uncanny, but the best character I have seen in this series: Intelligent, knows his way around things, and even if in a tight corner, plays the trick games to eliminate his opponents into oblivion. His signature hacking is displayed by his red mechanical spiders that pick up info, and serves great information for him as sort of a pick-up. His relationship with his father is canon to the series, once admonished for hacking his dad's stuff, was sent to be killed but given a chance to live in Hakata and reestablish him as an alias to his real identity.\\n\\n\r\nShunsake Saruwatari (or Sarucchi as Nitta calls him) the hitmen sent to kill Banba (that no one else can kill) and Naoya Nitta the consultant on child murders both have a relationship that extends beyond the agency that they once worked for, Murder Inc. Their young days were spent playing baseball, and with that relationship, extends to the hitmen days where Sarucchi (like Lin) was getting tired of lesser jobs, and left Murder Inc on the job to exterminate Banba. Unfortunately, crossing with Banba with his always miss-the-target shirukens, so his killing resolves into another day.\\n\\n\r\nThe other characters (Jiro the other hitmen, Misaki his caretaker) really did a good job showing off their character traits, and that's something that I really treasure with the series, it's really good.\\n\\n\r\nArt/Animation:\\n\r\nSatelight really did their magic on this, and it really feels on-point with the lavishing visuals of Hakata City, no to mention the murders that though feel like uncensored, but it really fleshes out the series as its driving tour de force. The character designs were really nice and thought out through and through, giving the series the stylized, serious but casual look. Well done and well played.\\n\\n\r\nSound:\\n\r\nIt's weird for an OST to have a jazz-sounding track on here, but it's the same reason that is exemplifies the series when it comes in adherence to the settings that the series is based upon. With that said, the OST here is nothing short of a great job done, with the OP really giving the sense of the killing and murder intent and the ED totally jazz-sounding end card that showcases the series setting (AGAIN) and rounds it up like a summary.\\n\\n\r\nOverall:\\n\r\nHakata Tonkotsu Ramens definitely isn't a show for those below 18 (age-restriction), but it highlights what it was supposed to do, and it does that well. Moreover, like me, if you came into this with the PVs before it, the anticipation really turned out to be an experience not to be missed. With that said (for anime onlys), if you're up for the action, I'd recommend this to you, it's one of the great shows of the Winter season.\\n",
            "date": "2018-03-30T08:38:00+00:00",
            "helpful_count": 66,
            "mal_id": 275729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=275729"
        },
        {
            "content": "The night sky is vibrantly illuminated by the mellow glow of colorful lights, emanating from each building throughout the city. More lively during the night than day, the city of Hakata radiates a deceptively alluring glow covering it entirely; masking the dangers that lurk around every corner.\r\nHakata is infamously known for 3% of its population being comprised of hitmen, torturers, yakuza, and worse. This percentile is further divided into agencies, gangs, and websites for freelancers; a few of them are hilariously named “Murder Inc”, “Shadeyjobs.com”, and “RedRum Inc”. A sly snap at other action crime anime that strive to be realistic with overwrought edginess. Darklycomedic and self-aware writing like this permeates throughout Hakata Tonkotsu Ramens, immediately defining the tone as pure enjoyment as opposed to the logic-based standard.\\n\\n\r\nWith each member of the show’s large cast is in the 3%, it becomes abundantly clear that there’s always at least one criminal exchange occurring in this city. Even the cross-dressing main character Lin is an expert hitman with a comically harsh attitude. Cursing the men who ogling him, simply saying “I’m a man you moron” or “I’ll kick your ass” under his breath. He may say his cross-dressing is just because he likes the fashionable clothing, but he cleverly uses it as a method to be underestimated by his targets.\\n\\n\r\nAt the beginning Lin’s completing his latest hit on a private investigator, that is until he finds that he’d rather swap sides and defend him to try and earn some extra cash. Hakata is after all as much of a money-driven city as it is crime riddled and our main character is only a cog in the system. \\n\\n\r\nLin’s lone wolf personality immediately clashes in quite funny ways with the charismatic detective Banba. Make no mistake, him being a detective does not grant him moral high ground over the rest of the felonious 3%. In his introduction, we see him at a political rally casually feigning a gunshot by popping a balloon, all for the sake of weeding out a potential suspect. He often employs these radical but successful methods that no detective in their right mind would resort to. He's just as ready to kill as Lin and does so mercilessly alongside his hitman counterpart, with personalities so opposed it wouldn't be unfair to call them foils of one another. \\n\\n\r\nAt first, their whole relationship consists of Lin being annoyed by Banba’s listlessness and constant baseball metaphors. Then, to kick the first arc motion, Lin’s sister is unexpectedly murdered, forcing the unlikely pair to work together and seek vengeance against the hitmen agency responsible. \\n\\n\r\nIn the first of many arcs, the wide ensemble cast of characters is introduced. Each with a vivid personality, a distinct urban design, and a role they fill in Hakata. As Banba so nonchalantly puts it, they’re all playing a game of baseball. Whether or not you depend on the allies you make will decide how far you make it in the game. An ideology that starkly contrasts that of the lone wolf Lin, but satisfyingly he comes to embrace it as he spends more time with Banba. Them playing baseball on a team of their fellow hitmen served to support the show’s many metaphors, but also provided some of the purest light-hearted comedy in the show. Numerous food scenes also serve to lighten the tone, with delicious looking dishes and of course the titular Hakata tonkotsu ramen.\\n\\n\r\nAside from those heartwarming moments, a devilishly wry tone drenches Hakata. Delving into the criminal underworld, dark themes are inevitably explored; however, these themes do not overpower the sarcastically comedic tone due to the characters we see them through. Each member of the criminal cast contributes to this tone with cool and collected attitudes; aware that their dangerous careers can lead to their death at any time, they throw themselves into entertaining action. Any need any need for arbitrary anxiety is removed. Even with the uncertainty when the next betrayal, murder, or kidnapping might happen, the headstrong cast remains a joy to watch. Most of them work in or run those previously mentioned agencies and gangs. In one of the more impressively balanced but tonally ludicrous scenes, we see the stereotypical but inoffensively portrayed gay bartender Jirou with the sly middle school girl Misaki design their torturing agency website as casually as if it were a school project.\\n\\n\r\nOnly one character, a fresh face in town trying to start his hitman career, gives us a perspective of what an everyman would look like stuck in the middle of the whirlwind of crime. He's way out of his depth and gets into many hilariously troublesome situations. These side characters don’t receive the same level of development as the leads, but through seeing where they fit in the wacky underground of Hakata they become likable people who get further exploration in the background of the central story. After all, the story moves like a bullet, a pace fast enough to engage but it still finds the time to spare on the minor details. Shaping the world and its inhabitants as believable rather than outright outlandish.\\n\\n\r\nMost importantly out of the whole cast, the lead characters Lin and Banba are unphased by Hakata’s crime-infested underground and are ready to give it all they’ve got in combat to secure the outcome most in their favor. \\n\\n\r\nSharing a few snide comments to maintain an air of entertainment rather than fear, they slice, shoot, mask their identities, and use every trick they’ve got up their sleeve to create action set pieces worth watching for alone. In spite of the show’s relatively low budget, it thrills with swift and comprehensive shot composition, thoughtfully composed writing, and enough blood to earn an R rating. \\n\\n\r\nBolstered by a volley of trumpets rising during action scenes and mellowing into jazz during quieter ones, even the soundtrack contributes to the rich style. Both opening and ending sequences have fast pace jazzy tracks as well, showcasing major characters in rapid-fire succession with enough style and symbolism to make them as substantial of the show. Practically every facet of this anime carries the city’s dense style; the glow of colorful lights reflecting off the river during the night, as well as sunshafts sneaking around buildings during the day. \\n\\n\r\nHakata is the kind of setting that serves as a character itself, with a distinct visual style underscored by jazzy music, alluring but also undeniably dangerous. Stylish, darkly comedic, and slyly self-aware. Even without a complex plot or top-tier production values, Hakata Tonkotsu Ramens is a good neo-noir action anime worth watching.",
            "date": "2018-03-30T16:24:00+00:00",
            "helpful_count": 41,
            "mal_id": 275797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=275797"
        },
        {
            "content": "Hakata Tonkotsu Ramens is like an action movie made in todays Holywood. It doesn't make sense, it's overflowing with clichés and one could ask why the hell does it even exist. Yet, it does and I have to bear with the fact that it'll continue to exist. Because there is one reason why it does still make a lot of money. And that reason is the action, because action equals entertainment. But entertainment, like Hakata Tonkotsu Ramens perfectly shows, doesn't equal quality. \r\nThe story takes place in a city Fukuoka, which, in this fictional version, is overflowing with killers and assasins. So much infact thatthe show itself tells you that 3% of Fukuoka's population are indeed those blood-seeking hitmen. Wait.. what? Let's take a minute and think about how ridiculous that number is. Speaking in the name of math, every 33rd person is a killer, and we are not counting those who are not directly killing, but work within the hitmen system aswell, hence the number of people either working or helping the hitmen companies is even more ridiculous. Not only it begs a question like 'why doesn't the police or goverment do anything about it' it's also absurd to believe that such a city could even exist as it would be very normal for people to move out of a city in which there are murders happening at every corner of the street. Oh but please don't missunderstand, I don't want this show to be realistic, I purely want it to make sense. Which it doesn't.\\n\\n\r\nYou might start complaining that I'm digging too much into details that are not supposed to be the main factor of the show and that I'm just nit-picking to find mistakes in it. Which is fair, because I propably am, however I just can't stand that the show tries to act normal and peaceful even though the information it provides suggest almost everyone should be dead by now and the whole city should be in shambles. And it's not just that. Nothing about the show makes sense. I have an another example. There are some sort of detectives, which might make you think that somebody wants to do something about the situation. However, the only thing the detectives do is kill the 'bad guys', which results in more mad people, which results in more hitmen jobs, which results in more killed people. Good job Mr. Detective, you really saved the city this time around.\\n\\n\r\nOne thing I hear a lot when defending a non-sense making show is that it's just making fun of itself, which is something I understand and can respect. In terms of Hakata however, it just seems like a lame excuse. Sure, all the things I've written might make it seem like the show is a one big satire. However, even if that's supposed to be the case, it doesn't work. A show that it worked quite well in is for example Animegataris. Which was just a parody in general, and a good one at that. Hakata is not a parody. It's creators exaggerated every single statistic number to new heights to make it seem like it's an original idea and then completely forgot to explain why are the things as ridiculous as they are. That's a parody? No, that's laziness.\\n\\n\r\nIn terms of the actual story, the show could be divided into a couple of arcs in which always some sort of bad guy who likes to kill people appears only then to be killed or reformed to a good guy in the end. Sounds plain and simple and that is exactly the case. It always tries to give us background information about some of the characers, but not only those moments fail at making me care about them, the flashbacks themselves are in most times so overused and cliché that you can't even take much from them. There was for example that classic case of two best friends forced to kill each other in order for one of them to survive. Which is as cliché as you could possibly get. The whole story development also lacks a lot of drive and almost every episode, even if having a different villain and resolving around a different character, always had the same feeling as the ones before. Overall, the story ended up being a huge pile of rubbish mess that didn't make any sense and wasn't even interesting one bit.\\n\\n\r\nAnother thing that supports my claim of Hakata being a bad anime are the characters. Which are (suprisingly?), just very bad. I guess I'm gonna start with the main duo, Bamba and Lin. Both of them are hitmen and they start living together because of circumstances I don't even remember anymore. Bamba is a.. nice guy, potentially. A classic case of an outgoing, caretaking MC that would normally end up with the female MC. I said normally because there is not really a female MC present. But you know who is? It's Lin. A guy, who is, for untold reasons, wearing women clothes and a blonde wig for the whole show. Yes guys, that 'girl' on the cover is a guy in reality. Well, atleast the show says it. I personally wouldn't want to believe it because outside of having a male voice-actor, that guy is just a classic anime woman in heart. You know, just a 'trap' in general. And I hate traps. They are always the most bland and poorly developped characters in the entire show and their only purpose to exist is to get the memes going for you. Which is a process just begging for attention. He is also an extreme Tsundere, which is just a terrible personal trait for males in general and the whole series makes it seem like he has a thing for Bamba. All hail yaoi? Well, nothing really happens (thank god), but the feeling is certainly there at times. And while the show tries to make us care about both of them, neither of the two appealed to me in any way. Quite the opposite actually.\\n\\n\r\nAs for the other characters, I don't think anyone is even worth mentioning. There is really a lot of side characters and almost none get any actual screen-time. The reason for that is that the show really overdid it with the number of people shown. You'll realize soon enough that there are so many characters just standing in the background doing absolutely nothing, that really shouldn't even be there. The problem of so many random characters came in place when some of the kinda important ones really started to blend together and I just didn't know which one of the bad guys is on the screen anymore. And talking about characters, I think the show tried too hard to 'please' everyone with the personalities diversity. There is the super-smart guy, the loli, the strong guy, the dumb and aggresive guy, the Tsundere, the nice guy, the innocent and clumsy guy and some others. I'm not saying that this would't work under different circumstances, however in this case it felt like the show once again tried to hide it's huge flaws behind a thing that could possibly appeal to the audience, which could result into them not noticing the actual mess. And by the mess I mean the non-existent plot continuity and terrible character development.\\n\\n\r\nThe last thing the show does and the only thing I can agree does atleast respectably well is the action. Environment around hitmen and assasins provides quite a lot of ground for fightning and killing and the show does an OK job at exploiting that. The fights, while not being dramatic or climactic by any means, are pretty much the only bearable part this anime has. One because you are able to forget about all the other things for a while, Two because they are not the worst even in comparison to some others. Though I still have to say that while the close-quarters combat was the one done decently, whenever anyone tried to use a gun I was asking myself if they ever held that thing in their hands.\\n\\n\r\nThe art was definetly not the worst, I would call it very fair. Some characters had interesting desings though most of the less important ones looked almost the same. The whole animation wasn't bad and the arstyle looked nice and clean. The OST was very fast-paced and decent, though nothing extraordinary by any means. The voice-acting was not the most pleasant, though I think it's rather a problem of the character personalities rather than the actors that voiced them.\\n\\n\r\n------------\\n\\n\r\nWith my review coming to an end, it's about time to answer some questions. Is Hakata fun to watch? Possibly, it's fast paced and has a lot of blood. That's enough for lot of people. But is Hakata also a good anime? No, it's not. It tries to hide it's undeniable flaws behind some action and self-aware jokes, and goes full-on enjoyment mode without caring about it's actual quality. And while I think I would fall for the bait half a year ago, I'm slowly getting to the level in which I also care about if the anime is actually good. And Hakata Tonkotsu Ramens is not.\\n\\n",
            "date": "2018-03-30T09:14:00+00:00",
            "helpful_count": 31,
            "mal_id": 275733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6348377.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Tomm01p",
                "username": "Tomm01p"
            },
            "url": "https://myanimelist.net/reviews.php?id=275733"
        },
        {
            "content": "I'd like to share my thoughts on this Show, as I think it doesnt get the Attention it deserves. [EDITED]\r\nStory : 7\r\nHakata Tonkotsu Ramens is the Story of a Group of Killers. You'll see who they are, and follow them while they struggle through life. There are a few Story arcs that will develop each characters, nothing complicated. Some stories like the first one could have been developped more and some may seem unnecessary but it doesnt Keep you from enjoying the Show.\r\nEven though the world the caracters live in is really violent, the fact that it is normalized and that noone in the Animeoverreacts makes you accept the context and enjoy the Show. It even makes it more unique.\\n\r\nOf Course there is some social criticism, as it deals with corruption, murder, modern slave trade, drugs..\\n\\n\r\nArt : 8\\n\r\nBoth the opening and the ending have a great style.\\n\r\nI found the caracter design really cool, the animation is smooth, theres really nothing negative to say about it\\n\\n\r\nSound : 9\\n\r\nThe ending is outstanding and gives a unique style to the anime as is it also used as an OST during the episodes. The opening is also very good, and the other musics are descrete but well used\\n\\n\\n\r\nCharacters : 9\\n\r\nTo me this is the strong point in this anime. I got attached to the caracters very quickly. They all have their Backstory or an entire arc dedicated to them, and the anime manages to make you like them all. Even though they're killers, you see them act as humans, and they become heroes even though they should be antiheroes.\\n\\n\r\nEnjoyment : 9\\n\r\nI can't give a 10 because this is not the Anime of the year, but I can tell that this is one of the Shows I looked Forward to the most during the week, and it has a very unique atmosphere.\\n\\n\\n\r\nOverall : 9\\n\r\nI can't give this Show less than nine as it is really enjoyable once you've gotten attached to the caracters.\\n\\n\r\nSorry for the poor english",
            "date": "2018-03-05T10:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 273094,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4624672.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SerebiSenpai",
                "username": "SerebiSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=273094"
        },
        {
            "content": "An Interesting Mystery With an Excellent Soundtrack\r\nThis show has the potential to become a slightly more comedic, but also grounded Psycho Pass in my eyes. The setting, while more than a bit ridiculous in concept, is still a pretty cool world with endless possibilities for big action and twisted crime capers that refreshingly have no sci-fi tech or magic involved for once. It also has the foundation of some potentially great sociopolitical satire as it essentially turns modern day corruption in the regular political process up to eleven a its entire premise and I'm excited to see how the main conflict will unfold over thecourse of the series, it certainly has my attention.\\n\\n\r\nThe characters, while somewhat simplistic in design, have wit, humor and unique personality that make up for it in strides, not to mention that their professional fields also tend to require that they be at least a little badass. The assassin, bodyguard, corrupt cop and honest detective factions that are revealing themselves are all entertaining to watch interacting with their various codes of conduct and MOs and they all boast a new cool or crazy character or two. \\n\\n\r\nThe OP and EP, along with the running score of the show are also primo, catching major Cowboy Bebop vibe in terms of both sound and choreography and that's something you'll never hear me complain about. Overall, it's not top tier excellent quite yet, but it has the makings of something special and I'm definitely going to be keeping up with it if the quality remains consistent and the story keeps improving, it's an 8 out of 10 so far.",
            "date": "2018-02-09T19:32:00+00:00",
            "helpful_count": 15,
            "mal_id": 271147,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6557058.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShotgunXShogun",
                "username": "ShotgunXShogun"
            },
            "url": "https://myanimelist.net/reviews.php?id=271147"
        },
        {
            "content": "(NOTE: When writing this review I had watched the first 5 episodes of this title each week upon release. I tried to avoid spoilers. There may be some very mild spoilers by context, but definitely nothing plot related.)\r\nHakata Tonkotsu Ramens is the most surprisingly entertaining and enthralling anime of the current season, in my opinion. It feels almost like a slice-of-life anime as you watch it, filled with colorful, interesting characters and goofy situations. However, these are interspersed with moments of intense action, drama, energy, and tension. Though it may start off a bit soft and slow, the story and its diverse cast of quirkycharacters will quickly draw you into their daily struggles for work, companionship… and survival. \\n\\n\r\nYes, survival. As in, trying not to get a bullet through the head. Despite its appearance and benign title, Hakata Tonkotsu Ramens (I’ll just call it HTR from now on) addresses some very, very adult themes as the story progresses, and therefore this show might not be for everyone. And I don’t mean “adult themes” like an ecchi anime. Five episodes in I haven’t seen a single case of fanservice in this show. No, the adult themes of HTR are of a more dark, sinister nature, something that clashes wonderfully with the upbeat, charming characters that populate this world. The plot of HTR follows the stories of a number of hitmen and their associates in the city of Fukuoka as they fight for work, money, family, revenge, forgiveness, and the simple right to live a quiet and normal life as they please. The writers of HTR go on to bring in some incredibly dark themes such as murder, rape, human trafficking, political corruption and intrigue, blackmail, physical and psychological torture, and more. All this would normally produce an anime that leaves the viewer with a bad taste in their mouth, but HTR contrasts these themes brilliantly with a cast of comedic, intriguing, wonderful characters, who lighten the story and allow the viewer to approach these horrors in a relatively safe and controlled way. \\n\\n\r\nWhile the story of this series is still developing at this point, I would also like to mention how well the plot of HTR has been woven together. The story starts out feeling somewhat disjointed; each character in the show is introduced individually, in their own separate contexts. However, the writers quickly lead us, the viewers, to suspect that all of these disparate characters are somehow, some way, connected to one another. Call it fate, call it good writing, call it whatever you want, the story quickly leads its audience to suspect that there is more to this anime than meets the eye, a feeling that has kept me coming back for more each week. \\n\\n\r\nThe music in this series has been fairly mundane thus far, nothing stood out to me as being particularly bad or good about it. The voice acting is excellent, the animation crisp and clear, and as I already said, the story is both entertaining and engrossing. If you are looking for an anime to try out this season, and enjoy complex stories that develop alongside their characters, I would highly recommend checking out HTR. We’re just five episodes in, and I’m definitely looking forward to next week.\\n\\n\r\nTl;Dr This show a delightful mix of Gangsta. and Durarara!.",
            "date": "2018-02-09T13:17:00+00:00",
            "helpful_count": 11,
            "mal_id": 271123,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6475379.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TacitCandor",
                "username": "TacitCandor"
            },
            "url": "https://myanimelist.net/reviews.php?id=271123"
        },
        {
            "content": "I decided to give this anime a try after 6 episodes had been released because the reviews were pretty good. I was skeptical at first because the story didn't interest me. Hence, the reason I just started watching now. I'm already caught up and I'm glad I decided to give it a chance. I normally would watch shows with two or more of the following genres: fantasy, adventure, superpowers, supernatural, and comedy. That being said, this show is entertaining even for me someone who prefers shows like One Punch Man, Hunter X Hunter, Overlord, etc.. I would recommend giving it a try.",
            "date": "2018-02-17T07:11:00+00:00",
            "helpful_count": 10,
            "mal_id": 271744,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Casual_Anime_Fan",
                "username": "Casual_Anime_Fan"
            },
            "url": "https://myanimelist.net/reviews.php?id=271744"
        },
        {
            "content": "The story was promising at first. But what I thought was going to be our main character ended up panning out to be someone who was only relevant on certain occasions. I'm okay with an anime having certain arcs to it, but unless the arcs lead to a final conclusion, story line wise I lose interest...luckily the action was so well done in this anime that I never lost interest and the story basically took a back seat to the amount of kick ass moments there were. Plus BASEBALL!!!\r\nThe art and animation were not anything special. With guts, bloods, and brains spilling, along with headsrolling you would think they would do a little more then Red Sports and Rivers of Blood. The hand to hand combat scenes were done okay but again nothing over the top.\\n\\n\r\nThe opening and ending were really awesome. I thoroughly enjoyed them. The bgm was slightly above average but still fit the show great.\\n\\n\r\nThe freaking characters were so enjoyable to watch. Normally an anime with a proficient amount of males turns me off to it, but these guys were freaking awesome! Each in their own unique way.\\n\\n\r\nI really enjoyed this anime a lot. It gave me a break from a lot of the cute and dramatic filled anime I have been watching for a while.\\n\\n\r\nOverall I can see how people will see flaws in this anime. Is it shelf worthy when it finally gets released on bluray? Maybe, but it definitely worth a watch if your looking for a nice action anime.",
            "date": "2018-03-30T11:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 275752,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275752"
        },
        {
            "content": "TL;DR: It's Durarara!!, but stupider, and it's fantastic. Watch at least the first two episodes, since episode 1 doesn't sell the show as well as episode 2 does.\r\nDo not expect great plot or lore from this show. The plot is purely an excuse for characters to bounce off of eachother in fun and interesting ways. The highlights of this show are its action scenes, its characters and their designs, and the sound. \r\nThe action scenes, at least as far as has released at time of writing, are pretty fantastic. Solid animation, plenty of blood, and a god number of stupid cool moments. Stupid is theoperative word here: a guy swings a katana like a baseball bat to reflect a bomb, and it works. If that makes you roll your eyes, this isn't your kind of show. It's stupid, it knows it, and so it throws just enough logic out the window to let it do what it wants, while keeping just enough logic for things to be coherent, if silly.\\n\\n\r\nThe characters in this show are really entertaining. Everyone has a pretty distinct and interesting personality, and the way they interact with one another is pretty fun to watch even when nothing's happening. Additionally, every character, even the ones who show up for one scene with no dialogue, has a memorable design that sets them apart from each other character in the show. This means that you often can't tell whether characters will last past the arc or even the episode they're introduced, leading to several moments of \"oh shit he's dead!\", which are very entertaining. The one complaint I have is that the main guy looks like a tool, but his design has grown on me a bit, and it's not that big of a deal.\\n\\n\r\nFinally, the show's music tends to be pretty good, but the main thing that makes me mention it is the ending theme. God damn, TRI4TH did a fucking killer job with it. It's jazzy and fun, and I love the way they put the 'next episode teaser' in the middle of the song and how that actually works. Fight scenes also have pretty good sound effects and such, so that's also good.\\n\\n\r\nHakata Tonkatsu Ramens is not a smart show. It is a very, very, stupid show. It's also been a ton of fun to watch this season, and I'm glad I didn't stop after the (mediocre) first episode. I think the best way to describe it is that it's Durarara!!, with a pinch of No More Heroes/Kill Bill, and a ton of brain damage. But I love it.",
            "date": "2018-02-22T11:51:00+00:00",
            "helpful_count": 9,
            "mal_id": 272183,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ramalammy",
                "username": "ramalammy"
            },
            "url": "https://myanimelist.net/reviews.php?id=272183"
        },
        {
            "content": "This show is worth your time. It is a dumb-fun action romp, but it is also more than that. It is a portrayal of queer people in a way that is fun, humanizing, sympathetic, and, almost miraculously, in an way that is not in the slightest bit preachy. If you like stupid action and also like gay characters and stories, you could do a hell of a lot worse than Hakata Tonkasu Ramens.\r\nI will be completely forthright and admit that I went in Hakata Tonkatsu Ramens (hereafter HTR) both expecting and wanting to hate-watch it. Even starting to watch this show with a clear biasagainst it's being good, I will be damned if it did not completely pleasantly surprise me by being a really enjoyable experience. I expected the show to be dumb, fun, and crappy, but what I found was that it was only the first of those two things. I love things that are dumb and fun, and as such I unironically loved watching HTR. \\n\\n\r\nStory: Only sort of. There isn't really a strong plot, but what there is instead is a whole bunch of character development and world building. In short, a hit-man named Lin comes to a new town full of crazies and murderers and finds out that it is actually the coolest town ever. Hakata is a city where everybody seems to be allowed to kill anybody they want to with essentially no repercussions and also does so professionally. Lin meets and befriends secret samurai detectives in cute sweaters, terrifying little girls, mushroom-shaped 1337 hackers, camp gay revenge dispensers, and clumsy and petulant ninjas. There are also some subtle homosexual overtones,  in the way that an episode of Rupaul's Drag Race also contains some subtle homosexual overtones. This show is gay as a peacock and all the better for it. \\n\\n\r\nArt: Not great. Actually pretty bad, which kind of drags the show down a bit. The character designs, barring one in main character Lin, are nothing to write home about, and the action scenes frequently go off model. The whole show in general looks a little crunchy. The fact that I still liked it anyway is a testament to the other strengths of HTR. \\n\\n\r\nSound: Love the OP. The song is catchy and emotional and always gets me hyped up. The voice acting is also great, and makes characters that could have been really stupid and cheesy instead seem grounded and relateable. Overall the sound great and fit the show like a glove. \\n\\n\r\nCharacter: Why you should watch this show. Not all of them are great, although all of them are fun. The ones who are though, namely Lin, deuteragonist Banba, and their relationship, are worth the price of admission on their own.\\n\\n\r\n Let us first take Lin. When we are introduced to Lin we see what appears to be a beautiful young woman in a school uniform and sensible high heels, but we soon find out that, despite what he may look like, Lin is very much a dude and will very much kill your ass dead if you get in his way. Lin lives his his life as a woman, and the fact that Hakata Tonkatsu Ramens chooses to have a person on the LGBTQ and so-forth spectrum as its hero and not choose to make fun of them or (SPOILER ALERT) murder them graphically is such a sight for sore eyes. We grow to know and like him despite and in fact partially because of his many and varied foibles, just as Lin grows as a person as he meets the residents of Hakata. \\n\\n\r\nChief among these residents (at least in Lin and the story's eyes) is Banba Zenji, a detective with a mysterious secret life and an LL Bean sweater. Banba takes Lin in during a rare moment of vulnerability, and much to Lin's consternation he discovers that he kinda likes it here. \\n\\n\r\nThe show ships Lin and Banba from the get, and their interactions are pretty damn cute. Lin is a textbook tsundere, and the fact that he is a man living as a woman makes the interaction between him and Banba all the more rife with incidences for Lin to tsun out over. Banba is alternately cool and adorable as the mood takes him, and really it is no wonder Lin falls for him so hard. I mean, just look at that sweater. \\n\\n\r\nHTR never comes right out and confirms that Lin and Banba are boning down, but come on guys we all know they are. It's great, just have fun with it! At one point Banba's ex girlfriend sits down with Lin and is like \"so Banba's totally your boyfriend, amirite?\" and Lin is like \"nooo I'm totally not a gay\" and then she basically looks at the camera with an expression on her face that might as well have been subtitled \"GURL PLEASE.\" Lin doesn't bother to defend the point. He's too busy being dere. \\n\\n\r\nThe rest of the characters are more or less successful and fun, particularly mushroom hacker and glasses ninja agent, but all of them feel like they live and belong in the world of Hakata. They all serve to help tell the story of Lin learning to love other people and eventually himself, and as Rupaul says \"If you can't love yourself how in the hell are you gonna love somebody else?\" The entire city of Hakata gives him an AMEN.\\n\\n\\n\r\nIf you made it through this overly effusive review, you owe it to yourself to watch this show. You are clearly interested in or at least appreciate gay shit, else you would've tuned out the second you saw the big scary word QUEER (oh my god so spooky!!!). If you are the kind of person who would enjoy watching To Wong Fu, Thanks for Everything, Julie Newmar but would also enjoy watching one of the sillier James Bond movies, go ahead and watch Hakata Tonkatsu Ramens. I am that type of person, and I LOVED it!!",
            "date": "2018-03-31T22:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 276152,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983772.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jRad522",
                "username": "jRad522"
            },
            "url": "https://myanimelist.net/reviews.php?id=276152"
        },
        {
            "content": "When I went through the reviews of this anime I noticed an all or none phenomenon. People either loved it or despised it and that made me super curious. And man am I glad that I watched it.\r\nThe setting is very idiosyncratic. I mean a world where hitmen casually hung out and discussed their jobs and the people they murdered in public and had baseball teams...uhmm ...weird. But at the same time its pretty interesting if you just ignore the improbability if it. It had a bit of bebop feel to it at times(maybe thats just me though)\r\nThe art is good when its good butso very low budget at times. Sound is pretty good too but nothing to rave about.\\n\\n\r\nNow what made the story so so so very enjoyable for me were the characters. All of them are ridiculously quirky with amazing lgbt representation(for a shounen anime). Banba is definitley the hitman with a heart of gold but mess with him or the people he cares about and we see a totally different side of him. Lin is amazing. I dont think ive seen any non shoujo anime where a cross dresser is the lead but i seriously loved him. He met banba at a terrible point in time and slowly learns to trust him again. all the side characters were pretty intersting too especially the avengers. I felt there was solid chemistry between lin and banba but at the same time it leaves their relationship to the viewers imagination ( totally domestic newlyweds in my opinion). Very few female characters though\\n\\n\\n\r\nThis anime certainly has its flaws but i think the charm outweighs it. Id definitely recommend it to anyone who wants a fun anime watching experience\\n\\n",
            "date": "2018-03-31T00:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 275848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7077188.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/rhiannon_carter",
                "username": "rhiannon_carter"
            },
            "url": "https://myanimelist.net/reviews.php?id=275848"
        },
        {
            "content": "Please watch if you like Durarara!! \r\nStory 9-10/10 (I really love this kind of story)\r\nNot that complicated (Drrr is far more confusing than this), will give you many surprised and voila! Usually I'm pretty good at guessing where the story will bring me but I failed several time from this series. Please watch if you like to be deceived (w).\r\nArt 7-8/10\r\nThe design is pretty good. Everyone has their own characteristic. The animation is so-so though. Several fighting scenes are good but some are not. The animation seems unstable. My eyes can tolerate it though. Not mentioning the story, enjoyment, and curiousity fill the lack ofanimation so it's okay.\\n\\n\r\nSound 7/10\\n\r\nIt's good. But nothing special. The OP and ED is awesome!\\n\\n\r\nCharacter 8-9/10\\n\r\nI like the character development. Feels so good and refreshing. The connection between characters is presented very well too. They have strong bonds for each other.\\n\\n\r\nEnjoyment 10/10\\n\r\nI can't wait to watch this every weeks. Although the excitement kinda down in the middle of the episodes. But it is awesome\\n\\n\r\nP.S : The relationship between Banba and Lin is amazing please don't miss it. \\n\\n\r\nOverall : \\n\r\nIt's great please give me more.",
            "date": "2018-04-08T12:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 277416,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1279301.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/futsuu03",
                "username": "futsuu03"
            },
            "url": "https://myanimelist.net/reviews.php?id=277416"
        },
        {
            "content": "Best anime of the season hands down!\r\nPlus more importantly best ending of the season!\r\nStory is uniquely interesting and well paced, although you probably need a matured mindset to wrap the entire concept around your head... cos it may be seen as a little controversial, which of course is one of the reasons why i love it. I give this a 10.\r\nArt & background is top-notch, no complaints there. Infact I wish i could visit Hakata with the vibrant way it was depicted here. I also give this a 10.\r\nSounds, also a 10. I personally love the opening & ending songs...it fits so well with theworld settings.\\n\\n\r\nNow the characters, where the show shines the best. Every character is well rounded and we see developments where necessary. We also see one of the best back story which gave more dept to our Tsundere MC. Of course I also give this a 10!\\n\\n\r\nI thoroughly enjoyed this and I really hope we get a season 2! For those that haven't seen it yet, or those that stopped on episode 1 or 2, you should totally give this a try. Yer won't regret it, desu!",
            "date": "2018-04-03T12:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 276712,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6328191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LeviAckermanChan",
                "username": "LeviAckermanChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=276712"
        },
        {
            "content": "When I think of this anime, the words that come to my mind include: killers, mentaiko, Hakata, hacking, crime, baseball, black market, justice, corrupt, etc. Killers are basically killing each other, and there's a hitman killing other hitmen.\r\nSet in Fukuoka, where 3% if the population are killers, this show is quite thrilling with a lot of action, but it's definitely not for someone under 18. It focuses on a corrupt society with murder, human trafficking, revenge, etc. Some places might look nice on the outside, but inside is way darker than expected. Unfortunately stuff like this actually happens in the real world. There are hitmankilling people they are assigned to, and even a hitman killing other hitman. It's pretty violent with not much comedy, but there are some scenes that are relaxing and enjoyable. Moral and ethic issues come up throughout this show too. Are the killers all evil, or are they doing this because that's what they were assigned to do the job or are there other reasons?? Each of the main characters have different backgrounds that are explored in the episode. If you read the light novel like I did, you'll learn even more about the characters. \\n\\n\r\nCharacter: I wish the anime explained more about each character and their backstory. They did a good job for Lin and Enokida, but the rest were not that clear. Why is Misaki with Jirou?? There's not much about Banba actually. \\n\\n\r\nAlso the title mentions ramen, but food is not the main part of the show. I first thought this was maybe a show about food, but it's totally the opposite. The OP is not bad. The music is jazzy, something I did not expect for an anime like this. The order for the last two arcs in the anime are slightly different from the novel, but it doesn't seem to have a big problem. I would recommend this for adults who want some action anime. It's not super powers like BNHA, Naruto, OP, etc, but more like violence you can see in the real world. \\n\r\nOh, and there is baseball in the show. The baseball scenes are quite enjoyable.",
            "date": "2018-03-30T14:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 275784,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5523670.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/momo9",
                "username": "momo9"
            },
            "url": "https://myanimelist.net/reviews.php?id=275784"
        },
        {
            "content": "This show isn't a mature, dark, or edgy look at the criminal underworld like some of the people who praise it would have you think. Nor is it a stupid premise that went nowhere, like the haters would say. It's just fun. It's also a breath of fresh air from the usual high school setting and moe girls.\r\nI'll have a lot of negatives to say about the show in this review, but don't get me wrong. I enjoyed it a lot, and I recommend that you try it.\r\nA city where 3% of the people are assassins? Absurd. All the people relevant to the plot happento know each other and/or randomly meet each other in the city? Impossible. If you're going to be put off by this, it's probably not the show for you. I wouldn't blame you.\\n\\n\r\nWhat the show is good at is the characters. This show is honestly just a bunch of eccentric, hilarious, but still believable characters having hilarious interactions. If you saw (and liked Durarara), you'll probably understand what I mean about having a bunch of crazy characters talking to each other. There are plots, and story, and \"character development\" sure, but... well, I'll tell you about that later. There's a dude who dresses in a weird samurai getup and uses a sword. But when you meet him, it totally makes sense. He thinks it looks cool and won't let anyone get him down. There's another dude who gets a ninja theme, and again, it makes sense. He's not some crazy ninja fan, it's a marketing ploy to get more people to hear about him. It's things like this that kept the characters from feeling like absurd caricatures that wouldn't exist in real life.\\n\\n\r\nThe story? I mentioned earlier that you need suspension of disbelief. Something happens to somebody, it turns out all the characters are involved in a different part of the plot, they accidentally run into each other, then they team up to steamroll the enemies like a group of over-leveled MMORPG characters crushing a public event. Rinse, repeat. There is also a main-ish story. Sort of. I forgot about it until I was writing this paragraph.\\n\\n\r\nThe art? I like the designs. They're memorable, suit the characters, and animated well enough. The action is fine. (Aren't you glad you are reading this? Top-tier quality in-depth reviewing right here.)\\n\\n\r\nThe characters? They get over trauma far too quickly. Some stuff goes down in the first arc of the show, and it just never gets brought up again. They have believable motivations and backstories that support their personalities in the show, but they don't change. There's not a lot of depth there, either. The show tries to make Lin deeper, but it's hard to feel serious when it's usually silly.\\n\\n\r\nThe sound? It's not one of those OSTs that I remember after I finished watching the show. It didn't detract from the show, but it didn't stand out to me. The OP and ED themes were nice.\\n\\n\r\nAs a personal gripe, I thought the gay doctor was too stereotypically gay. I'm not the type of person who would really know if it was offensive or not, but it just irked me.\\n\r\nOn the other hand, I thought Lin was great. He crossdresses, and it's not made into a big deal. He's not a trap, either. I liked how it was done.",
            "date": "2018-03-30T13:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 275769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5783598.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DainBramaged",
                "username": "DainBramaged"
            },
            "url": "https://myanimelist.net/reviews.php?id=275769"
        },
        {
            "content": "Hakata Tonkotsu Ramens, an anime about assassins in a city, dealing with other assassins and corrupt groups / organizations, came out of nowhere during the Winter 2018 season and surprised me. I would even go as far as to say this was the dark horse anime of the season and possibly year. I did not expect much from this show but was pleasantly surprised with what I got. Basically, the show is comprised of arcs each comprising 2 to 3 episodes. The arcs focus on a particular characters problems with other characters of the protagonist's group involved. \r\n[Story]\r\nThis element was the biggest surprise for me.I enjoyed most of the arcs shown in the series and how it gives certain characters the spotlight. The main characters in the show are Lin and Banba who were both surprisingly likeable and a joy to follow throughout the show. They did a good job in making these assassins not seem unlikable and even succeeds in making me really care about the whole main cast. \\n\\n\r\n[Art/Sound]\\n\r\n Solid is the best I can say. There is nothing I saw that really ruined my enjoyment. I was also surprised to find a decent amount of saxophone/jazz like music. \\n\\n\r\n[Characters]\\n\r\nLike I mentioned prior, I enjoyed this cast of characters. The main cast is very likeable and I found them to be characters I wanted to root for. Despite this, the characters are not perfect. Lin by the end of the show was developed enough to where we knew enough of him and he became a very developed character. Some of the other characters were not given the same treatment. Banba in particular is an example. Despite this, given that the show is 12 episodes makes it understandable why many characters have to be sidelined and left undeveloped.\\n\\n\r\n[Enjoyment}\\n\r\nThis was the dark horse of the season. I was pleasantly surprised with what I saw in a season of cute girls doing cute things. This show brought me into a world of shitty people and made me explore a certain group of characters adventures through all of this. I found the first few arcs to be fun and interesting despite some OPness of some of the main cast. The last arc definitely was more predictable and not as strong as the others but despite this, did not really hurt the show.\\n\\n\r\nOverall, Hakata Tonkotsu Ramens is an anime for anyone looking to see an enjoyable action show. There is a likeable cast, a lot of bad situations for characters to go through, and just pure fun. Just be cautious of some lack of character development, over powered characters, and slightly weaker final act that doesn't answer every question.",
            "date": "2018-04-07T16:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 277297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wjs066",
                "username": "wjs066"
            },
            "url": "https://myanimelist.net/reviews.php?id=277297"
        },
        {
            "content": "It's been a long time since I enjoy an anime this much. It's about hitmen, they just do the job, not trying to do something for justice like one of the popular review said, the target just happen to be a bad person, nothing heroic here. (In the Light Novel they mentioned that the hitmen does take requests from police, to 'dispose' criminals they can't arrest by law.)\r\nThe characters' stories are interesting, art and sound are good and fit very well with the theme. They didn't make the best decision in some cases imo, but I enjoy watching this anime so much. My only complaintis there was no second season. I hope they follow the light novel, it's getting very thrilling at this moment.",
            "date": "2019-02-01T17:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 300644,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7723550.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/CandyPool",
                "username": "CandyPool"
            },
            "url": "https://myanimelist.net/reviews.php?id=300644"
        },
        {
            "content": "Do you like cool and quirky characters, complex and multi-layered plots, and awesome knife fights? \r\nIf so, you came to the right place. This anime has all that and more. \r\nWe’ve got Lin, the straight crossdresser who looks irritated almost all the time but’s a lot brighter than you give him credit for. We’ve got Banba, the easy-going, enigmatic and downright cool guy who’s totally reminiscent of Spike Spiegel. We’ve got Enokida, the obligatory hacker who’s actually pretty interesting by himself, the perpetually unlucky Saitou who really is just not cut out to be an assassin, and the ‘Submarine Ninja’ who, despite the goofy name,is a short-tempered lone wolf. \\n\\n\r\nThat’s just to mention a few. Hakata Tonkotsu Ramens has a massive and extremely diverse cast, and all the characters are important in one way or the other. It’s a lot like Durarara!! In that regard, lots of minor events in the city have ripple effects that can alter the entire course of the story. You never know if that one guy you bump into whilst shopping will be the assassin that tries to kill you later, or the pitcher for your baseball team. It’s part of what keeps the anime exciting, and seriously there is rarely a dull moment.\\n\\n\r\n Sure, not everyone gets a load of screen-time, and that’s to be expected in a mere 12 episodes, but you get to know their personalities nonetheless. Lin, as the MC, is well developed – we get to see past his shell and into his backstory. The others are mainly developed through their interactions with each other. The characters are sort of like a family, but not like the Fairy Tail type. They tend to look out for themselves first and foremost, but will show up if someone’s in real trouble. They don’t show affection often, but it is somewhere under the surface. It’s less cheesy and melodramatic that way – plus all their snippy banter is quite amusing to listen to.\\n\\n\r\nInstead of a story revealed straight from the beginning, there’s a set of seemingly random episodes that introduce you to the city of Hakata and the weird bunch that inhabit it. There are some relatively heavy topics dealt with – murder, torture, human trafficking – but the anime doesn’t go all philosophical on you. Everything except killing is bad, and even then you should only try and kill those who deserve it (mainly organisations dealing with the aforementioned activities). It’s a show about various groups of hitmen after all, and an action series at that, so you would expect it to take a somewhat lighter approach to the killing aspect. Besides, we get to see a lot more fights that way.\\n\\n\r\nWhich brings me on to the art and animation. Both are good – nothing outstanding, but the city is well drawn, the fights are animated nicely and the characters’ faces show their emotions properly. \\n\\n\r\nThe sound is really great. The op theme felt really nostalgic for some reason, and the jazzy ed is also worth a mention. Distinct Cowboy Bebop vibes there.\\n\\n\r\nTo conclude, I did enjoy this anime a lot. It was fast-paced and entertaining. Some parts were downright clever, and the mysteries and fights were thrilling. I got taken in by a fair few of the twists, and I was always eager for the next episode. I’d definitely watch another season of this.\\n\\n\r\nI’d recommend if you like anime like Durarara!!, Cowboy Bebop, or just anything fast-paced, fun, and action-packed. XD\\n\\n\r\nBTW, the baseball aspect did catch me a bit off guard, but it ends up being more than just a distraction from all the killings. It’s used both to show the neighbourhood dynamic, and as a shared activity that helps to foster teamwork and trust. It’s also part of what makes the anime unique; instead of a cult or secret society they have a baseball team. And the best part? Watching them play baseball is made even more fun by just how absurd it actually is. 😊\\n",
            "date": "2018-04-01T15:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 276398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=276398"
        },
        {
            "content": "(Sorry ahead of time for my terribly awful organization of this review) Writing this after finishing the very last episode, and boy will I say, what a roller coaster. It started off very intriguing, yet confusing. But a few episodes in I was able to understand everything. They kept everything fast-paced, yet always slowly inching toward a massive, unexpected ending. There were multiple flashbacks for the main characters, and each and every one was VERY likable, diverse, unique, entertaining, funny, etc. I thought this was a solid show until up to the last few episodes, where I thought it was an AMAZING show, the lastep was action packed, just like the whole show. I highly recommend you watch this if you enjoy any sort strategic killing anime. This show features multiple agencies that have different relationships with each other, and follows the story of one guy through his journey through them and the city itself, rebellious acts through all. There's so much going on, and it's easy to miss something. Soundtrack was great, I loved how they were able to fit jazz into this killing spree. Overall, a fantastic show. It stands out among others and I most definitely enjoyed it even though I thought I was risking quite a bit watching this show due to the rest of my watch list. All in all, fantastic execution.",
            "date": "2018-03-30T21:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 275833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6250230.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/s1mthi",
                "username": "s1mthi"
            },
            "url": "https://myanimelist.net/reviews.php?id=275833"
        }
    ],
    [
        {
            "content": "Story 7 / 10:\r\nThe story was entertaining enough that it kept my attention, but I do admit that there were moments when it seemed a bit jumpy with sudden throw ins of certain things. That said, the story was MOSTLY well kept together and was enjoyable nonetheless.\r\nArt 5 / 10:\r\nTruthfully the art wasn't anything special for me. It was average. Nothing overly appealing, but not the worst I've ever seen either.\r\nSound 5 / 10\r\nI feel the same about the sound as I do with the art. I didn't really care much about the op or ed and I feel similarly with the soundtrack. There wasn'tanything that I wanted to listen to over and over again. It was just music, but not music I particularly cared about or hated.\\n\\n\r\nCharacter 7 / 10\\n\\n\r\nI have to say there were some characters that I really loved an enjoyed while there were others that I liked but didn't think too much of. There were a lot of characters that just showed up every once in a while that I didn't care much for but I didn't hate either. Lin and Banba's relationship was very enjoyable for me, but they were also the most entertaining characters for me with Lin being my favorite overall. I think learning about Lin's past was quite nice too and I hadn't expected the show to delve into that so it was a nice surprise that made him more enjoyable for me.\\n\\n\r\nEnjoyment 8 / 10\\n\\n\r\nDespite what I've said so far, Hakata Tonkotsu Ramens was definitely a show I was excited for weekly. I wanted to see it come around week by week and I'm definitely glad I continued with it up until the very end because I can definitely say it was worth my time.\\n\\n\r\nOverall 8 / 10\\n\\n\r\nAt the end of the day this show gets an 8 because while some factors of it may not be particularly special, I enjoyed it enough that I can't possibly rate it any lower than an 8. I would definitely recommend it to others and I would watch it again maybe once more just because I enjoyed the characters I liked so much. It's going to be a series that I'll miss quite a bit now that it's over.",
            "date": "2018-03-30T21:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 275828,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971075.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rachachan",
                "username": "rachachan"
            },
            "url": "https://myanimelist.net/reviews.php?id=275828"
        },
        {
            "content": "The first 2 episodes or so were kinda interesting, but with the story moving on we get new characters all the time with no development or explanation whatsoever, and also episodes where you feel that nothing is happening. \r\n  The art is not terrible, but the animation gets really shitty at episode 4/5. \r\n  The character development of the two protagonist is really poor and you get nothing else from \"Hi, I'm a tsundere\" from Lin after episode 3. \r\n   So, for me this is a 4, a 5 in a good day, but I would not recommend thisto anybody. Go watch something else.\\n\\n\\n\\n\\n\\n",
            "date": "2018-02-26T11:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 272505,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4473436.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/chapulandia",
                "username": "chapulandia"
            },
            "url": "https://myanimelist.net/reviews.php?id=272505"
        },
        {
            "content": "Have u ever watch Durarara ???\r\nit's same, but here we got dead peoples, violence, lil nudity and more \r\nWell this show got basic impression of it, but with more bloody crimes material (and mature content) than it counterparts (dat  i told earlier). well most of it shows daily lives of those who dwells in \"this\" kind dirty line of jobs. Noted that this was just ordinary crime fantasy novel base. No need to be serious\r\n this anime wasn't so dark, u can tell by lookin at those pretty Boi faces. YES we got rape and dead people, but this is normal  especially inthis  line of set and story.\\n\\n\r\nlike durarara, at start most of the key figure introduced in separate story, making tension escalated in more \"smart\" dramatic ways. Then all of them fated to meet each other with some \"just\" cause. a good use of \"small world\" terms indeed.\\n\\n\r\nNow The difference between them, Hakata Tonkotsu Ramens Would literary feels like  Eating an Instant Ramen/noodel. Typical Instant Noodle, IT TASTE GOOD (most bcuz of the MSG), CHEAP, EASY TO EAT & PREPARE. But Wait there more of it.\\n\\n\r\nthis because how quick, easy (to understand) and straight forward the story goes within just 5 episode. \\n\\n\r\nMaking gud compact Detective-crime base story style like this is truly a challenge. The arts was Good, u can tell from just one look at the city background. gud sound, and enjoyment as well.\\n\\n\r\nThe only lack is some of the character design feels out of place, maybe bcause there are reason to it. or maybe the writer wants both bois & girl to enjoy eatin this \"ramen\".\\n\\n\r\nfor just 5 Episode, it seems alright enough. what could possibly goes wrong (lol)\\n\\n\r\nStill, this anime was not the best in this season but don't UNDERRATED it. just watch if u feels like want to eat some ramen\\n",
            "date": "2018-02-21T00:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 272080,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5947088.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Der_Reichter",
                "username": "Der_Reichter"
            },
            "url": "https://myanimelist.net/reviews.php?id=272080"
        },
        {
            "content": "Characters\r\nThe three main characters of Hakata Tonkotsu Ramens all have excellent design and shining personalities, however, only Xianming Ling got a legitimate backstory. The main protagonist and his rival were by far the most interesting of the bunch and even after the final episode we still don’t know much about them or how they came to be. Even with excellent pacing it’s hard to properly develop characters in a show that is only twelve episodes in length. Hakata Tonkotsu Ramens did nothing to help itself by wasting two of the last four episodes with side action that added absolutely nothing to the story. Had thestudio used this time to further develop either Banba or Saruwatari the show could’ve earned itself at least an average score in this category. In addition to the poor character development, the MC’s rival, Saruwatari, was introduced with a clear purpose that never really went anywhere throughout the show. While he was actually one of the more entertaining characters, he left without doing anything significant and really could’ve been left out of the show all together.\\n\\n\\n\r\nVisuals\\n\\n\r\nTheres not much here to talk about in all honesty. Hakata Tonkotsu Ramens’  production quality is run of the mill for a shounen in 2018. The animation of the action scenes was crisp and the more lax scenes had just enough detail to please the average viewer.\\n\\n\\n\r\nOverall Score\\n\\n\r\nIt would be an understatement to say that Satelight studios’ Hakata Tonkotsu Ramens had potential. The premise behind the show and the interesting universe full of assassins are enough to carry its viewers through episode twelve despite the many issues it faces. Even with it’s problems I would be quite excited for a reboot as long as the story and characters get properly fleshed out. Everything considered, Hakata Tonkotsu Ramens is an excellent and fun idea turned  mediocre show with a slew of problems. Only put it on your list if  you’re an anime vet scrounging the bottom of the barrell.\\n\\n\r\n522/1000 Obvious but Somehow unnoticed Spider Trackers\\n\\n\\n\\n\\n\\n",
            "date": "2019-03-09T06:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 303159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5985213.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Latt",
                "username": "Latt"
            },
            "url": "https://myanimelist.net/reviews.php?id=303159"
        },
        {
            "content": "First off, if you think this is a show about ramen noodles then nope, best looking elsewhere. It's a trap.\r\nThe Hakata prefecture in Fukuoka was famous for its Tonkotsu ramen and looks like your regular city but it had its own underworld where 3% of its population were killers for hire. Some called themselves \"avengers\", people who can be hired to get revenge for their clients. Baseball loving Zenji Banba is a private detective out investigating a murder of a fellow detective who was murdered by a local hitman. As such, he also ends up being targeted for nosying around. Rash Lin Xianming on theother hand, is a highly skilled hitman who had sold himself off as a kid so that his family could live a better life. Now he was trying to buy his freedom back from a Taiwanese gang so that he can return home to his sister and ends up being assigned to the job. However, he refuses and decides to protect Zenji instead - at least, until he gets paid properly. Laid back Zenji goes with the flow and it just so happens Lin was part of the organisation he was investigating. When Lin's sister ends up abused and killed by the very same gang, they end up working together and Lin ends up seeing a different side of the underworld including a close encounter with the Niwaka Samurai, a hitman that kills hitmen.\\n\\n\r\nBackground art's quite good at times while others they over diffuse the lighting so much they look overly blurred. Otherwise the overall quality of the show stays consistent even though it's not great. As far as presentation goes, I think the instrumental pieces of the OST is the best part of this show including the upbeat ending theme, \"Dirty Bullet\".\\n\\n\r\nI assume the show got it's silly name from Zenji's favourite food, instant Hakata Tonkotsu ramen which is about the only thing linked to ramen. As if the title itself wasn't enough to hint at it being a bit of a silly show about the life of underworld criminals, they throw in a cross-dressing hitman and a kind of superhero who goes around slaying hitmen just to be sure so don't expect a Black Lagoon. In a way it kind of reminded me of Samurai Flamenco because the characters all have the same silly, easy going personality as they fight crime dressed up except here, they're not playing superheroes or fighting the supernatural. Instead, it's mostly a group of criminals who end up being the good guys. This show can be a lot more violent too where people are mercilessly tortured or killed with lots of blood and some gore. Even then they can still laugh and joke as they are surrounded by corpses. Of course, you also end up with brief scenes involving the abuse and exploitation of ladies. It's not a show for the young audience that's for sure.\\n\\n\r\nInstead of going for your usual cast of cliche Anime personalities it feels like the show just tries to make all the main characters look cool with the only exception of Lin. It's a character driven show since it's fairly much lacking a main plot and for the most part you're watching how Lin finds a place in his new circle of friends. When the show's not busy slaughtering people it does have it's fun moments as the gang spends time playing baseball matches together or, when you watch the odd relationship between Zenji and Lin playout. Even though everyone's buddy, buddies some don't hesitate to sell each other out when their professional career in the underworld calls for it. Eventually you get some more insight into the character's pasts too. Well... One or two of them anyway.\\n\\n\r\nI think the show does a fair job of bringing characters together through coincidence with only 12 episodes to do it in although I don't know how faithful it is to the 8 volume light novel series. In that regard I think a show like Durarara or Baccano pulls it off much better with its alternating POVs and equally silly characters. Funnily enough the original author Chikai Kisaki did do a collaboration with Ryougo Narita, the author of those two titles at one point, \"Durarara x Hakata Tonkotsu Ramens\".\\n\\n\r\nIf you like action character driven shows with a laid back cast and don't mind the underworld violence you might like this. There's the odd episode with extra scenes after the credits so don't miss out.",
            "date": "2019-01-19T04:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 299435,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7426800.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xcomprr",
                "username": "xcomprr"
            },
            "url": "https://myanimelist.net/reviews.php?id=299435"
        },
        {
            "content": "Story: 7/10 This is where my major turn off is. The title had you thinking it's an anime about cooking. Then the first four episodes went on as a murder mystery revenge anime. Fine, I like where that goes. It's not a bad idea. We still don't know where the Tonkotsu Ramen comes into play but if the story is about a crossdressing hitman getting revenge together with the Killer Killer in disguise, then that alone would make a pretty interesting plot. Then after that it suddenly turns into a baseball anime with all the members being either professional killers, or related to them. Andthen the Tonkotsu Ramen's only purpose is being their baseball team name!?? WTF. Not only that, in the beginning of this anime there're lots of foreshadowings that're quickly revealed in the SAME episode or the next. That's not how it works, man. Please make up your mind. Be it a murder mystery or a sports anime or a cooking show. Pick one and STICK WITH IT! And please announce it beforehand so the right audience comes watching it.\\n\\n\r\nArt: 7/10 Not the best I've seen, not the worst. No one's really memorable except the mushroom blond wearing the neon yellow hoodie. Not my taste of art style.\\n\\n\r\nSound: 7/10 It's okay. OP and ED are not my taste. Voice acting's good. I like the ost they playing when they fought.\\n\\n\r\nCharacter: 7/10 The mc is interesting when he wanted revenge but his revenge story ended as quickly as it began and then there's no more development after that and I quickly grew bored with him. No one else really stands out to me that makes me want to know more. Oh, maybe why all these professional killers want to make a frickin baseball team with a food name!??\\n\\n\r\nEnjoyment: 7/10 Was gonna give it a 6 but the revenge mystery in the beginning is totally my cup of tea, so I give it a 7. That's pretty much it.\\n\\n\r\nOverall a 7/10. If it stayed a murder mystery then I wouldn't have dropped this series. I like sports anime but baseball especially professional killers playing baseball is just not for me. And I never really liked food/cooking anime either so sadly this anime is just not for me.",
            "date": "2018-07-08T03:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 283374,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4264843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ttcchen",
                "username": "ttcchen"
            },
            "url": "https://myanimelist.net/reviews.php?id=283374"
        },
        {
            "content": "A great anime to pass the time and enjoy good entertainment. It's not tiring to watch and all the characters pleased me, even those that were not well explored by the director.\r\nThe dynamics between the two protagonists was what pleased me the most. Lin was my favorite character because of his indifferent way and the same goal. Lin has developed a very solid partnership with Banba who, in turn, is an easy-going character.\r\nThe story does not have a very well defined ending because the goal was more aimed at the development of Lin as a new member of the gang, but nothing that leaves theviewer dissatisfied.",
            "date": "2018-03-31T10:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 275885,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3091641.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Itam",
                "username": "Itam"
            },
            "url": "https://myanimelist.net/reviews.php?id=275885"
        },
        {
            "content": "As a underworld/mafia drama lover, I write this review mainly for fellow audience considering this anime due to its mafia setting or existence of multiple characters, who may come across Ramens due to its connections/ collaborations with other works such as Durarara. No non-biases guaranteed.\r\nIn short, I find Ramens a relatively \"idealistic\" and \"light-hearted\" potrayal of the underworld (as opposed to others like Black Lagoon). This is a good show for pass-time, fun, light-hearted, (BL,) and perhaps, knowing slightly more about baseball and Hakata. However, it lacks depth for character and plot development, which is prevelant in underworld dramas involving multiple parties, reasons explained below.\r\nStory:6\\n\r\n12 episodes are quite neatly divided into several arcs. No strong cause-and-effect relationships between arcs. However, the patterns are largely similar and strong hints to the story development are always given. Towards the later arcs, I gave up worrying for the protagonists even when they are emminent danger of betrayal/ death because of the repetitive and cliche pattern.\\n\\n\r\nCharacters: 4\\n\r\nTry recalling the underworld animes (e.g. Black Lagoon, Jorumugand, Durarara), or even movies you watched, what pops up in your mind first? It is often not the plot, but the characters that impress audience the most. The soul of this genre of work often lies in the characters. Ramens is critically damaged and flawed in this respect.\\n\\n\r\nAll characters I can recall at this moment are largely stereotypes, especially allies of the protagonists: typical loli, typical old man-with a-past-glory, typical innocent rookie, typical smartie pants, typical hotheads. Allies of the protagonists mainly stand in the background as \"back-up\" serving protagonists in respective professional fields such as hacking and medication, and by chance information sources. Lack of female characters' screen time, while proving Ramens' target audience is fujoshi, is unrealistic for a modern city like Hakata.\\n\\n\r\nNow back to the main characters, who supposedly have more screen time and development to be convincing. Bamba (possibly also tasked with baseball and Hakata tourism promotion) is composed yet humourous, the type of lead which many, including myself, enjoy to watch. Lin, supposedly a well-trained assassin, is the de facto female lead which shows characteristics conflicting with his profession. Dressed as a female (yet staying with a male voice) for unexplained reasons, Lin's abilities has more than once been compromised by the outfit. Heels he wore caused him to lose balance when the train suddenly stops, and twisted his ankle when he jumped out from the window.  When protecting allies, Lin had also forgone to fight using his skills as an assassin/ fighter,and opted for the less effective method often used by female leads of other animes for no obvious reasons. I respect characters of different styles, but allowing style to get into the way of assassin's profession, where a slight mishap could cost life, is purely perplexing.\\n\\n\r\nThe extremely strong bond between protagonists and their allies, while impressive and admirable, does not seem realistic for a world of outlaws. All characters never hesitated in siding with their own friends, despite threatened with death, in standing against politicians and mafia syndiciates. Ramen's alliance (centred around the main characters) has over 10 people (sufficient to monopolize Hakata underworld), always serves the protagonists but never maintains any organization structure or gives any interests. It solely relies on self-conscience and friendship, which is very ideal, but often stands so vulnerable to power, fame and money in the complexed world of reality, especially underworld. Can such pure alliance and trust exist in a world of outlaws, where even law is disregarded? Even if so, how such strong bonding came to centre around the protagonists is never explained in the story, thus failing to convince the audience.\\n\\n\r\nEnemies are less on par with the lead and their allies than expected. Minor: Although some screen time is given to the last boss, his tone is not strong enough to fully characterize a strong last boss with a unique mindset. (this is perhaps due to my own imagination of a stronger line for the boss)\\n\\n\r\nArt: 7\\n\r\nGenerally fine. Action scenes are often neglected until the last 2 episodes.\\n\\n\r\nSound: 8\\n\r\nEnding theme of pure jazz is great, bringing back reminiscence of Cowboy Bebop's OP, especially with the images shown as the song plays. Some piano arrangements of the Opening and Ending inserted towards the end of the arcs are pleasant, comparable to the kind of music performed live by a pianist at a hotel candlelit dinner. Rest of background music generally fits with the scene but does not stand out.\\n\\n\r\nOverall: 6\\n\r\nBiased with my expectation of a in-depth exploration of the underworld, I find the story cliche and unexciting, characters unrealistic and even perplexing. On the other hand, I do recognize its effort in music and some light-hearted comedies. Again, if you look for light pass-times, Ramens is a good choice, but it is the opposite if you are looking for in-depth potrayals of human interaction in underworld/ mafia.\\n\\n",
            "date": "2018-03-31T08:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 275872,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5652763.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HopbeeK",
                "username": "HopbeeK"
            },
            "url": "https://myanimelist.net/reviews.php?id=275872"
        }
    ]
]