[
    [
        {
            "content": "The anime is more comedy than \"romance\". It has some parts with kind of drama/romantic themes but the main thing here is the comedy borderlining silly and nonsensical. Every episode was fun to watch. The characters are interesting, the main is well balanced between wacky and serious, the support characters are interesting. The main theme is very interesting, the references and self awareness are good too. I really enjoyed and I wish there was another season or more episodes.",
            "date": "2014-05-10T19:24:00+00:00",
            "helpful_count": 228,
            "mal_id": 142933,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MarcoAlencar81",
                "username": "MarcoAlencar81"
            },
            "url": "https://myanimelist.net/reviews.php?id=142933"
        },
        {
            "content": "In life, there are things that are misleading, such as commercials on TV, ads on the internet, and even, anime.  There are certain things in anime that I require in order for me to really like it, and that is a good exposition, a decent amount of character development, and a nice end in the last few minutes of the series to wrap it all up.  Nourin here...broke every single one of those foundations I set down for myself.  In any case, here's the review.\r\nStory (3.43/10):  The story of Nourin is set in an agricultural school, where a student by thename of Kousaku Hata, aka our main protagonist, is shattered by the fact that his precious little idol superstar Kusakabe Yuka has retired.  Due to this fact, he is rendered helpless, as without the existence of his little goddess to keep it up, his world is shattered, making him miserable and sad.  It is until a few days later, that a transfer student by the name of Kinoshita Ringo transfers into his class, a girl who has a remarkable resemblance to his favorite idol star, and from then on, he intends to find out why this girl has come into his school.  \\n\\n\r\nFrom an idea standpoint, this could create a good deconstruction of the life of an idol, focusing mainly on the characters for the majority of the series, and maybe tossing in a bit of character development and romance here and there.  \\n\\n\r\nAt least, that's what I hoped for before my dreams were completely smashed and grounded like miso.  The main idea that is in the paragraph above is a complete and utter lie.  In no way shape or form beyond the second episode will they ever touch on this subject again as heavily as they did in that time frame.  Beyond the second episode, this main idea is completely obsolete beyond measure, to the point that by episode 8, you're not even watching the same anime.\\n\\n\r\nWhat I mean by that, is the fact that Nourin is basically an episodic series, and not a good one at that.  The entirety of an episode can be summed up as random, almost to the point that I could compare it to another well known random, episodic anime called FLCL.  However, unlike FLCL, this series was supposed to have an idea for it to follow.  Every episode contains a singular plot point, which the whole episode follows suit.  After the episode is finished, that singular plot point is pretty much disregarded for the rest of the series.  The thing is, this whole series is just improv, as it feels like the creators just threw in a bunch of ideas into a box, and drew them out one by one to determine the ideas that would be made into episodes of the show.  Here's a few examples;  Having a beach party in a flash flood thunderstorm, making money off of a moe themed egg brand, and even a battle bikini farming showdown.  If these ideas aren't random, I don't know what is.\\n\\n\r\nThe randomness was only one factor to this show's downfall.  Another thing it did wrong, was its comedy.  The show tried to be one of those animes that exaggerated itself so that it could ridiculous to the point that it was funny.  It didn't work.  The show tried WAY too hard to be funny, featuring characters riding on goats, having jousts in farmlands, etc.  Because it tried so hard to be funny, what with it failing in the end, I was just bored and saddened by how pathetic it really was.\\n\\n\r\nThe end I felt was just as terrible due to the fact that it basically ends, like how it felt watching this series, a punch to the face.  Not even kidding.  The fact that this series was just so terribly written, due to how distant the anime made itself from its main idea, was just enough for me to hate this series to my very core.  \\n\\n\r\nOverall, the story was a mess, what with it not pertaining to the original idea it was supposed to follow, trying way to hard to be a good comedy show, and even failing to deliver a good end in the final episode, I was rather disappointed as a result.  On the plus side though, more than likely, you'll learn something about modern day farming, so that's a plus, I guess.\\n\\n\r\nOverview\\n\r\n+  Good starting idea\\n\r\n+  You learn stuff about farming.\\n\r\n-   Terrible execution of starting idea\\n\r\n-   90% of the series wasted on stupid side episodes\\n\r\n-   Tried way too hard to be funny\\n\r\n-   Strange ending\\n\\n\r\nCharacters (4.21/10):  The characters of Nourin were similar to the story they were based in, terrible.  But, towards the end, some of them did have some redeeming factors, but not enough to save this show.  \\n\\n\r\nStarting with the main protagonist, Kousaku Hata.  Without spoiling anything, (since any character development he gets is shoved to the end.  Yes, there somehow is character development in this.)  Hata is a very ambitious person.  He aspires to have his own little farm one day and just lead a nice little farm life.  That is all you pretty much get in terms of character from him till about episode 11.  What I didn't like also about this series, was the fact that they shove any if not all character development within the last 3 episodes.  Hata here, is no exception.  With such a vague idea of who he really is, he mostly remains as a mystery to the audience as we don't know who he is.  But we don't even get enough time to think about it since the sporadicly unnecessary plot takes most of the audiences attention.  It isn't until the very end, the very last 7 minutes, where he accepts his own past and ultimately changes his outlook on his life.  Little late there, buddy.  \\n\\n\r\nUp next is Kinoshita Ringo.  Ringo, as the supposed focus of the show, is mainly pushed to be the new kid, questioning things at every turn, so that us, the audience, can learn about how farming works.  This show is basically a messed up farming training video.  While for the most part, she is shown to be utterly emotionless in terms of expressions, (she's a kuudere!), she does express the fact that she has emotions and wonderment about her new life, and even explaining what she went through as an idol.  Still didn't explain why the f**k she's here.  She is also shown throughout the series to have some sort of attachment to Kousaku, but it's so minute and rarely shown, that it was pointless to make her a love interest.\\n\\n\r\nNakazawa Minori is the next one on the chopping block.  The way I see it, her purpose for the show is actually rather pointless.  Sure, she can help create the non-existent love triangle that is really not shown/explain, but other then that, I don't see her really being all that important.  She plays a role really only at the end of the series where Kousaku is contemplating shit at the end of the series like any other stereotypical guy in a romance anime.  She also has a crush on Kousaku and wants to be his wife, or a bride in general.  Other than that, there's nothing else to really talk about.  Moving on.\\n\\n\r\nKamatori Kei is the \"glasses\" character of the group, being a lot more knowledgable about farming than the rest of the cast.  Due to his past that becomes the main focus on the 10th episode, (For some reason, they liked pushing the character development at the end), he has aspired to become a very \"natural\" grower of vegetables.  Still though, I find him very awkward because he has that look to basically make any ridiculous topic sound \"super cereal\" and just weird to watch because it gives the impression that he talks about everything WAY too seriously.  \\n\\n\r\nAnd finally, the last character that I will be formally mentioning, BOOBS!  Or as her real name is in the series, Kochou Yoshida.  (Though she's in the supporting role, she appears quite often and is regularly shown in the series to help out with the main cast.)  First off, why?  When you nickname a character, boobs, you're instantly going to lose credibility.  Though she doesn't appear quite as often as the rest of the cast, she's usually helping out with the main cast, and is often involved with anything they do.  More or less though, she plays the extreme supporting role of helping the main cast.  (Honestly, that nickname though...)  \\n\\n\r\nWhile the main cast themselves were were a main problem with the series, it's really the side characters I think that really killed the show.  First off, the homeroom teacher, Bekki.  She a lonely 40 year old woman who wants to get married.  Based off of what you know of the lonely teacher  anime troupe, multiply the desperateness by 9000.  Bekki's ridiculousness of a character I felt, hurt the show too.  \\n\\n\r\nAbove all, what I felt was the real nail in the coffin, was the fact that the series kept adding in more, and more, and more, and more pointless side characters that didn't matter.  Adding in characters is fine, but it's the way they did it, that felt really pointless and stupid.  The show makes you feel like you should know about these side characters beforehand, because the main characters freak out or are aware of their existence before we know anything about them.  Above all, they don't really give much of a character explanation much less a trait about them.  All of them, literally, all of them are one note characters that have a singular trait that exists as their existence.  Personally, I found the additives of more and more characters hurt the show more and more, adding to the already badly explained plot.\\n\\n\r\nOverview\\n\r\n+  Ok main cast?\\n\r\n+  Character development\\n\r\n-   WAY too many side characters\\n\r\n-   Introduction of most of the cast way too late\\n\r\n-   Generic one sided troupes as the majority of the cast\\n\r\n-   Bekki.....  (personal complaint more or less)\\n\\n\r\nArt and Sound (7.10/10): (While I have been bashing this show left and right for its terrible writing and characters, one thing I have to compliment, are its aesthetics.  \\n\\n\r\nThe actual art for the series is actually quite nice.  The backgrounds are very nice and colorful with very nicely drawn out produce and flora.  The characters themselves look a bit odd, but for what this show's worth, it's still pretty nice.  The color palette is mainly on the white side of the spectrum, making blinding colors of a very high gradient prominent in their characters.  (They even reference their own show's original artwork creator at one point.  Humble much, Nourin?)\\n\\n\r\nNow, for ecchi.  The show has a lot.  It was so much to the point that I covered my screen because of the sheer amount of it, as well as how pointless it all was.  Like its comedy, they went over the top with it, and in the end, it didn't help the show at all.  And it's not just the female characters; there's even some manservice for the girls too in the show.  Personally, I think the show could've done without the ecchi, since the actual storyline was hurting it enough already.  (I'm fine with ecchi, but personally, this was just too much.)\\n\\n\r\nFrom a music standpoint, the show's music is actually somewhat decent.  The OST is quite high spirited with an idol song as the soundtrack.  Personally, I felt like this was a nice touch for the series due to the fact that this was about an idol in an agriculture school.  What better way to start it off than to make an idol song the OST?  \\n\\n\r\nPersonally, I don't like the ED, due to how it was presented, and I more or less found it to be a generic song that I skipped after every episode.  I still listened to the OST though.\\n\\n\r\nOverview\\n\\n\r\n+  Interesting character designs\\n\r\n+  Nicely colored and made backgrounds\\n\r\n+  Enjoyable OST\\n\r\n-   Too much ecchi even by ecchi standards\\n\\n\r\nPersonal Enjoyment (5.56/10):  Week after week of me watching this show, I asked myself, why the hell am I still watching this.  I still ask this to myself.  While the first few episodes peeked my interest, I quickly found myself facepalming at the episode ideas and shouting REALLY?  at my computer screen for the whole 30 minutes of me watching this show.  I'm all for really stupid and pointless comedy, but this was brain damagingly stupid.  \\n\\n\r\nSomehow though, I can't disregard this show completely.  I was still watching it, and even made it to the end, watching the entire show, but I still didn't think it was worth it.  What troubled me the most watching it, was the fact that the actual main idea that the show was supposed to originally follow, didn't exist, and just recently at the end of the show, found out that the character development happens at the end of the show.  Personally, I felt like the show didn't need any character development because it just clashed with the path it was going on, which was the random anime path.  \\n\\n\r\nI won't recommend anyone to watch this, since there are just so many flaws with the execution of this anime.  Personally, I found this show to be quite an awkward watch, and felt glad that I finished it.\\n\\n\r\nOverall Score: (4.98/10)",
            "date": "2014-03-28T16:55:00+00:00",
            "helpful_count": 92,
            "mal_id": 137591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=137591"
        },
        {
            "content": "Who knew farming could be filled with so much passion and fun? Well, probably not as much in real life, but certainly in anime anything can be made fun, even something as mundane as farming. And oh boy, did I have fun watching this one.\r\nWith unique characters and strange, humorous twists at every episode, I was grinning most of the time. The personalities of the characters were simply and elegantly presented, allowing for easy understanding of where they were coming from and the kind of person each character was. Well, except a few. A bonus was that, amidst all of the fun, there was aplot! Not a flawless story, but something to add a bit of drama and set a level of seriousness. \\n\\n\r\nAs I continued to watch, and as the existing plot continued to develop, I realized that I was watching Nourin more for its humor than for its serious undertone. I could appreciate where the seriousness fit into the grand scheme of things, but the most memorable parts of this series were the funny and ridiculous. \\n\\n",
            "date": "2014-06-17T19:51:00+00:00",
            "helpful_count": 52,
            "mal_id": 147385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3835455.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dontaskme",
                "username": "Dontaskme"
            },
            "url": "https://myanimelist.net/reviews.php?id=147385"
        },
        {
            "content": "Hate it! Hate it hate it hate it!\r\nWhy? The story is somewhat original, the jokes are pretty funny, the music and the animation are on pretty ok levels, the fanservice is good. But the ideology makes me want to burn rainforests, preferrably filled with endangered species.\r\nThe anime begins with our protagonist, Kosaku, 100% obsessed over a certain pop idol in Tokyo, far away from the countryside where our protagonist attends a Farmer's School (something like a regular high school with lots of focus and special lessons about various aspects of farming). The pop idol on the other hand, Ringo, is going through depression due tobeing forced to smile all day. After a certain point she has a mental breakdown and can't show emotions anymore. (By the way, did I mention she's practically a loli? We're talking emotionless loli here! (Y)  ). She decides to take a break from the world of showbuis, and visits the place where one of her fans sent her vegetables from (reaaaaaal smooth Kosaku...  Send tomatoes to the person you admire.)  Anyway, she rerolls at the protagonist's school where she's trying to learn about farming in order to get over her depression (And yes it's a fact. Freud just came back from the dead so he can commit suicide!).\\n\\n\r\nThe supporting cast consists of the rest of the school's students, most notable of which is a classmate of the protagonist (with rediculously large b.. cleavage ... No, screw it. Her boobs are huge.) who has a crash on him and an eyeglasses dude that from the beginning to the end you will suspect of being homo.  As the loli (Ringo) attends the farming school, the show throws at us the \"wisdom of country folk\" with Ringo learning their ways.\\n\\n\r\nLet me be clear with this: I do not have anything against people from villages, farmers etc. But the way the anime is trying to force on us the \"wisdom of nature and countryfolk\" is making me puke. First of all, Ringo has lived in Tokyo, doing a pretty hard job there too. And after leaving Tokyo she comes to a place where she is practically taught that the ways of the \"ignorant folk\" in the cities are wrong (obviously the anime never 100% puts it like that, but it is kind of the general message). Most of all, I am angered by the fact that Ringo accepts this instead of reminding them that practically none of them has dared stepped out of their small community (as in, never). People, you shouldn't get life lessons from someone who hasn't left the safety of his neightbours & family for his whole life. Seriously, it's not smart. \\n\\n\r\nI HATE the \"noble savage\" idea. I get that staying close to nature and respecting it is the right way and all that, but unless Peter Jackson directs it history has shown that our \"evil corrupt civilizations\" have repeatedly kicked \"a$$ while a few billion \"good respectful nature folk\" have gone extinct. I don't have a problem with the show questioning our morals, or saying that life in the big cities may be stressfull for some, but presenting us as morons I will NOT stand for.\\n\\n\r\nThe animation and sound are definitely well done, the sub-plots are interesting (so long as you can avoid puking) and the fanservice is acceptable.  But I really, really can't stand the idea of a pop idol dirtying herself and sweating to plant a potato while some random guy keeps giving her monologues about how the potato represents life and the ground feeds us and by-the-gods-shut-up-already!. If I were in Ringo's position I would be burying something else beneath the soil.",
            "date": "2014-11-01T22:30:00+00:00",
            "helpful_count": 27,
            "mal_id": 167105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=167105"
        },
        {
            "content": "Well, that anime ain't bad,but I'm just not that impress as how it was presented at all, the plot was pretty much a typical harem theme, but I can't ignore that there are two groups of characters that this anime was on two, the first one was the harem theme of Minori, Hata and Ringo, the second group was the romance theme between Kei and Yoshida. Well, if one is to examine this anime more focus was on the comedy aspect, but its comedy aspect- well let's just say that some parts were funny while there are some that where downright corny. Now, there aresomethings that were conflicting especially when it come to the other character's, like the so called 'Four Heavenly Farmers\", according to info it was suppose to be Yoshida the livestock specialist, Akari the bio chemist of food production, Rintarou the woodman and the homosexual Karou the flower guy. Now, I don't know about any of you out there, but this anime was suppose to be in an agricultural setting so why is there a character who is suppose to be in forestry, horticulture, biochemistry and some 5th wheel who is an ergonomist be called the Four Heavenly farmers\"  and why was there a 5th one? Now, let's face it, this is probably one of those anime's that can be compared to a crudely customize car where all the parts were ill fitted but  for some reason can still run....only barely, and it looks like this series creator  Shiratori, Shirow, can't distinguish the difference between floral culture, forestry, agriculture and ergonomics which were each of it were a science of its own. Then again, Shiratori, Shirow, didn't do a bad job with his serial, but he didn't do a nice one either, so overall it was ok.....but barely. So, here were my ratings for this anime.\\n\\n\r\nStory: Decent 4.\\n\\n\r\nSince it wasn't bad, it wasn't good either.\\n\\n\r\nArt: fair 6.\\n\\n\r\nSince there isn't a lot of fan service.\\n\\n\r\nSound: Decent 4.\\n\\n\r\nSince, I like the opening and the ending where Becky did a number.\\n\\n\r\nCharacter: Decent 4.\\n\\n\r\nSince, the character's themselves were divided into the harem theme and romance theme, also there is the Becky theme where she is the comedy genre  in this anime.\\n\\n\r\nEnjoyment: Decent 4.\\n\\n\r\nLike I've said, it was barely funny.\\n\\n\r\nOverall: Decent 4.\\n\\n\r\nSince this serial's creator, Shiratori, Shirow, has done it in a half ass manner.\\n\\n\\n",
            "date": "2014-03-29T13:32:00+00:00",
            "helpful_count": 22,
            "mal_id": 137745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2004376.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Baddie007",
                "username": "Baddie007"
            },
            "url": "https://myanimelist.net/reviews.php?id=137745"
        },
        {
            "content": "My pick for \"Underrated Anime of Winter 2013/14\"...\r\nUsually the titles which are in the spotlight would be those involving intense action, intense feels, or those which were adapted from already popular manga or LNs. However, it has been proven over the past few seasons that some of the ones which are less popular may turn out to be that decent after all. \r\nNou-rin was by no means an anticipated series. The LN was relatively unknown by most, and there wasn't a manga adaptation. Hence when I first started watching it, I really didn't know what to expect from it. And 12 weeks on, I'm gladto say it was a series I didn't regret watching. What's so good about Nou-rin is that, it had an almost perfect balance between comedy and feels. Okay, at the start of the series like for the first few episodes, it was more of a comedy and I thought that was the way it was gonna go on. How wrong I'd been. After that, each episode had it's fair share of comical scenes, then moments and dialogues which made us think/feel. It wasn't about great and significant stuff like saving the world as such, but instead dwells on the little things in life that we tend to ignore. That, I believe, is the true beauty of anime with Slice-of-Life genres, and Nou-rin was definitely no exception. \\n\\n\r\n- No matter what we're doing, as long as we're having fun, that's enough.\\n\r\n- Sometimes, we have to admit that we're inferior to others before we can truly improve ourselves. \\n\r\n- If one person in a group is unhappy, there's no way everyone else can be truly happy. \\n\\n\r\nThese are just some of the morals I've learnt from this relatively simple comedy series. Indeed, it may not be the best, but I assure y'all, it's definitely not the worst.",
            "date": "2014-04-04T10:01:00+00:00",
            "helpful_count": 15,
            "mal_id": 138619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3423567.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/henkuku",
                "username": "henkuku"
            },
            "url": "https://myanimelist.net/reviews.php?id=138619"
        },
        {
            "content": "Looking at the preview before this aired, we can already tell that the art and cg animation on the music performance was good. The synopsis was interesting, so I gave it a try. Unfortunately, my expectations on this anime was wrong. Let's start with the many things that's wrong with this anime. \r\nHata, our main protagonist was energetic, but not interesting. He isn't that important in some parts of the story, which is a problem if he is a main protagonist. His end story at least could have been improved if he showed some foreshadowing for his hatred for the country. Instead, they shoehorned itin the end to fool the audience to think that this series is good.\\n\\n\r\nRingo was a let down character. In the beginning, it made us all be anticipated as to why she entered Hata's school and quit her pop idol career. Turns out she comes over because she can't smile and just followed the letters to the school? Her inability to smile was bullcrap since a disorder like that can only be obtained from genetics. Character derailment is a major indication of a bad story. She finds out that Minori, a character that is mainly annoying, sent those letters and got along with her and forgot about Hata. That immediately changes as she falls in love with Hata anyways because the author demands plot development and wish fulfillment.\\n\\n\r\nKei is the only interesting character in this show, but unfortunately he doesn't get the spotlight too much. It's interesting how he has agricultural tips and some decent humor.\\n\\n\r\nBecky is a character that enjoys raises the ecchi level of this anime, and knowing that I dislike fanservice, since it's a detraction to a good story, you can already guess how I feel about her.\\n\\n\r\nNothing much can be said about Minori and Oppai, since they don't have any sort of interesting quirks to amuse anyone.\\n\\n\r\nWakadanna is the best!\\n\\n\r\nFinally, the four kings of the school. I have no idea what in the world the author was thinking when bringing these terrible characters in, with the exception of Kanegami. Her information on the business of the world in her episode was indeed interesting, making her not a complete garbage character like the other three, who mainly are there to fulfill the wishes of yaoi fangirls.\\n\\n\r\nSound: Sound is alright. Nothing to go home talking about. The opening was energetic, which fits the atmosphere of this anime.\\n\\n\r\nArt: The art and animation were pretty good. Nothing seemed a bit choppy or weird in this show, though it's unfortunate that it's wasted on this piece of junk.\\n\\n\r\nStory: The beginning story introduced the mystery of why a pop idol came to an agricultural school. The concept was interesting, but, not to be repetitive, the whole concept of 'I can't smile for some unknown reason' was stupid. Kei's conflict with his father ended up being interesting, as Kei believed in making business without relying on pesticides, due to his failure of a father killed Kei's mother just because of money. Lastly, Hata's conflict was not handled well (please refer to my explanation on him). The guy deserved to get punched in the face right after he pursued a harem ending, which made me laugh at his stupidity. The story, overall, was a mess.\\n\\n\r\nTechnique: Here is an important concept that I want to talk about. The show relys on parody to spill out comedy and uses a lot of it! The show doesn't not stand out at all. No fresh comedy. The author couldn't think of anything original, so he just decided to use other things into his content. Terrible technique.\\n\\n\r\nOverall, this trash deserves a (2/10)",
            "date": "2014-03-29T16:20:00+00:00",
            "helpful_count": 12,
            "mal_id": 137785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3501491.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PenX",
                "username": "PenX"
            },
            "url": "https://myanimelist.net/reviews.php?id=137785"
        },
        {
            "content": "I hope you really appreciate my effort in coming up with reviews. As I have said Winter Season Anime is definitely a difficult time for me to review anime. My brain is finally relaxed and calm after I enraged a lot in my Pupa review. However, there is still one more review to go in the Winter Season and that's \"Nourin\". \"Nourin\" is directed by Shin Onuma who also directed one of my favorite comedy of all time \"Baka & Test\". \"Nourin\" is produced by Silver Link. Let's get started.\r\nSTORY (5):\r\nThe story takes place in Tamo Agriculture School where Kousaku, Kei, Minori & Yoshida wereclassmates. Tamo Agriculture School trains the students on how to practice farming with brilliant techniques like protecting crops, maintaining the soil, etc... A transfer student, Ringo, comes to Tamo Agriculture School. Ringo was a former idol by the name of Yuka Kusakabe. Ringo decided to stay with the students in Tamo Agriculture School.\\n\\n\r\nIn my mind, I picture what the producers are thinking when they try to make this anime, \"Hey, we couldn't come up with great comedies, so why not let's reference some parts from previous anime?\". And there we have it.\\n\\n\r\nThe story was cliched and predictable because they use previous references but without coming up with a new and brilliant idea in comedy. You know, comedy is not easy to pull off, as I have mentioned in my D-frag review.\\n\\n\r\nThere was one scene in the last episode when Kousaku gave Becky the apple and Becky transforms from an old haggard to a normal and beautiful woman using the \"Sailor Moon\" transformation. \\n\\n\r\nDuring the episode 11, we get to see Kousaku's back story as a farmer. Why didn't you do it in the early episodes? So that at least we can get a better understanding of the characters and where they stand. The anime that managed to pull it off better was \"Golden Time\". In fact, this anime showed us the back story in the early episodes so that at least we can find out what happened to their relationships, etc... Not only that they tried to balance the comedy in the anime.\\n\\n\r\nART (5):\\n\\n\r\nThere's nothing special about the animation.\\n\\n\r\nSOUND (5):\\n\\n\r\nThe opening and ending theme are ok.\\n\\n\r\nCHARACTER (3):\\n\\n\r\nThis is what I had mentioned in the story section. If you would have given the characters back story in the early episodes, I would definitely care for them and follow them on their journey.\\n\\n\r\nThe characters are weak, dull and cliched.\\n\\n\r\nThe only characters that went through a development were Kei & Yoshida. It was when they decided to upgrade their education skills.\\n\\n\r\nRingo was like a copy from Kirishima Shoko from Baka & Test. However, all she does was follow Kousaku.\\n\\n\r\nMinori was annoying in the later episodes like for example in episode 9, when a typhoon occured, Minori just go out of the window and play on the muddy field which of course gets the rest of the characters into deep trouble.\\n\\n\r\nKousaku's back story in episode 11 was forced, because this was used in order to make the audience care for Kousaku.\\n\\n\r\nCONCLUSION (4):\\n\\n\r\nFirst, Strike the Blood. Now, Nourin? Seriously, what happened to you, Silver Link? Why did you do this? \\n\\n\r\nThe plot is full of contrived characters and contrived comedy. \\n\\n\r\nAnd if you say it's an Ecchi anime, it's just the start. Then, you need to work on the characters and their relationships, then you can have a good ecchi anime. \\n\\n\r\nI could go on about how much I didn't like about this anime, but I don't want to put any more effort in talking about an anime I just didn't have fun watching. So overall, I have to give this anime sadly a 4 out of 10. I would say there are better comedies out there.\\n\\n\r\nIf you find the comedy fun and entertaining, that's good. If you like the characters, that's also good.\\n\\n\r\nI am finally done with the Winter Anime Season. I am so looking forward to seeing Spring Season Anime.",
            "date": "2014-03-28T20:32:00+00:00",
            "helpful_count": 9,
            "mal_id": 137643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=137643"
        },
        {
            "content": "I'm sure all of us have one or two idols we look up to. Usually it's musicians or sports stars, maybe you're completely head-over-heels over your favourite anime director. Hata Kousaku is no different than us. Kousaku, attending an agriculture school, is completely obssesed over a certain popstar named Kusakabe Yuka. His obsession goes to absurd lenghts. He occasionaly sends his grown vegetables or fruit to Yuka and his whole room is completely filled with posters and what-not. Kusakabe Yuka shocks the world when she announces her retirement leaving Kousaku shocked and majorly depressed. Suddenly, a transfer  student joins Kousaku's school and class underthe name Kinoshita Ringo and it turns out this girl is a striking resemblance to Kusakabe Yuka. Kousaku instantly realizes that she is the idol he's been looking up to. For future reference i'm going to use the name Ringo as it's her real name. Kusakabe Yuka was only her stage name\\n\\n\\n\r\nStory: (6) \\n\\n\r\nThe story isn't anything fancy or deep. I feel the entire point of the anime is to make you smile and allthough it does manage to accomplish this it does not take away the fact the story is rather mediocre. However, this is not necessarily a bad thing. As most rom-com's dont utilize a deep storyline and i believe they don't need to. The comedy part is definitely strong in this anime. Most of the times it goes totally random and you're left wondering what the hell you just watched. \\n\\n\r\nThe setting of an agriculture environment is an interesting choice, one i haven't seen yet before. I'm not the kind of person that's into agriculture but i feel that's not a problem. It was actually fairly interesting to hear about different methods of growing vegetables and it was absolutely hilarious to watch the students go to absurd lengths in protecting their crops. \\n\\n\r\nArt: (8)\\n\\n\r\nThe art was good. There were no major flaws or inconsistency issues and i felt like they did a really good job in portraying the characters and the crops. I feel like this is to be expected from a 2014 release. Allthough the characters were drawn nicely i personally didn't like their clothing and work uniforms. I felt like Ringo and a few other characters ( whom i'll be going over at in the character section ) were robbed from their natural beauty solely because of the clothing. Ofcourse, this is subjective and to be expected because in order to accomplish succesful farming you have to get your hands dirty. In my opinion, once the characters switched from their work uniform into normal clothing you would feel better about watching them.\\n\\n\r\nSound: (7)\\n\\n\r\nThe sound, while being nothing special certainly wasn't bad either. The music was used at the appropriate times. It did well adjusting to the mood and was overall very cheery.\\n\\n\r\nCharacters: (5)\\n\\n\r\nDefinitely the weak part of the anime. About every character in this anime is generic and unoriginal. You have mr. nothing special protagonist, your typical tsundere who is in possession of the most oversized and unrealistic boobs i've ever seen in any anime and on top of that she is either extremely self unconscious or she thinks big and small have a reverse meaning, You simply do NOT deny the size of your boobs when they're the equavalent of a basketball. You also have your typical childhood friend who is there solely to form a love triangle. The amount of noteworthy contribution she has to this series is about as high as the amount of basketball-sized boobwomen on earth. Also i feel like she dyed her hair with vomit. Onto the next person, you have Kamatori Kei, who, at first glance would make you think he's the ''mature'' person in the series. Oh god how wrong was i in that assumption. He, alongside Ringo was one of the few enjoyable characters in this series. He is slightly perverted but hey nothing wrong with that right? He contributes alot to the randomness of this anime. Last but not least, you have Kinoshita Ringo. The adorable, purple haired girl who seems to blush 24/7. She is definitely the strong point of this anime. She gave a mysterious feeling. She talks almost monotone and doesn't say much. Even so she was fun to watch and definitely great to look at. I feel like there was little to no character development in this series at all. Ringo and Kousaku's relationship barely change and as such the end of this series will leave you infuriated. When this anime ended it felt like the last episode was just another random episode. It didn't feel like an ending so i'm generally disappointed by this.\\n\\n\r\nEnjoyment: (7)\\n\\n\r\nFor me this anime was fairly enjoyable, however i struggled to finish this to the end as i felt like there was no clear objective. When i finally thought about an ending that would have to be cramped up in one episode i was unpleasantly shocked that it simply did not have an ending at all. The agricultre however, was fairly interesting and the comedy was definitely fresh and enjoyable. \\n\\n\r\nOverall: (7)\\n\\n\r\nAllthough i rated this a ''6'' on MAL i did so on a subjective basis. When i rate a series i do so on personal enjoyment and not on an objective basis. The anime had both a very clear strength and an obvious flaw. Thus i feel the lack of character development is balanced out by the great amount and original comedy. a ''7'' would only be a logical conclusion from this point of view.",
            "date": "2014-04-05T10:02:00+00:00",
            "helpful_count": 9,
            "mal_id": 138781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3363559.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Holorence",
                "username": "Holorence"
            },
            "url": "https://myanimelist.net/reviews.php?id=138781"
        },
        {
            "content": "Welcome wretch who unfortunately stumbled across this promising looking series!\r\nWelcome to a journy full of overused and completely misplaced standart jokes and tons of other failures!\r\nWelcome to a still somehow enjoyable time!\r\nA few months ago - I was searching for new series for my List - I incidentally saw the Illustrations from Nourin and was at least a little bit impressed. I thought that just maybe this would turn out as a pretty good series ... and I was wrong!\r\nTo be honest the farmer clothes and the tractor already made it look kinda suspicious but I didn't know anything about the story so there wasa little hope left in me. Unaware of the thruth I was really looking forward to watching this so my impressions of it are probably even worse right now. \\n\\n\r\nWell let's get down to the point! I'll first describe the cons, then the pros and then the whole thing in short!\\n\\n\r\nHave you ever seen a series where each Episode has various different contents and none of them are properly finished? I haven't before so i was extremely shocked! You don't even understand what I'm talking about? Makes sense! Let me explain it:\\n\\n\r\nJust like many other series most Nourins Episodes aren't connected to each other except from the story background (all four main charas together in the countryside, fields, tractor, tomatos, whatever ... ). So the main story of Episode X has no deeper connections to the main story of Episode Y. The makers of Nourin probably thought this wasn't enough and doubled the No-Connection-Effect. Now in almost every Episode the first half is completely unrelated to the second half so basically every little story gets about ten minutes. Of course it's nearly impossible to finish a story in ten minutes. So what did they do to end every of these storys? They just cut them off somewhere in the middle of the end - time lapse for the win! \\n\\n\r\nUnfortunately that's not the only problem! Almost every comedy series has it: the standard anime jokes. From the unmarried lonely teacher to the typical BL jokes ... you know what I'm talking about! Even though these jokes are completely overused they still can be kinda funny if they're placed at the right time and with the right context. About 99% of the jokes in Nourin are these kind of jokes. Unluckily they are completely misplaced and the context isn't funny either! It's not true that I never laughed while watching this series ... I can even remember one slightly funny moment! But still for a Rom-Com the jokes are just way to generic and misplaced.\\n\\n\r\nAnother thing is the placement of Oh-so-epic-Moments. You can say what you want, farming is NOT epic! It's impossible to take to take the typical School-Roof-Epic-Weather-Epic-Quotes or the Epic-Romantic-Encourage-Talk-Through-Door scene whe all know from various romance animes seriously when the characters are talking about farming! There are so many topics that can be made epic in the right moment. However tractors and soy boans are a entirely different matter! \\n\\n\r\nJust as incomplete as the the ending of the most story parts is the ending of the whole series. I don't want to spoiler anyone so I won't tell the details but i can say that almost everything in the last few episodes sucked. Even the good moments sucked because there was still no solution of the bad moments. To  make it even worse the finally appearing solution is completely half-assed and can't really be called a solution. So in short the current ending sucks and is incomplete! If eventually a few years later another season has been finished with a real ending I'll increase the rating to 7 or more according to the new ending. \\n\\n\r\nThere are a lot more aspects to complain about but I described the biggest problems so let's leave this aside for now! \\n\\n\r\nThe best thing about Nourin is definitely the Artwork. Both colours and illustrations are beautifull. Even for a 2014-series it's still breathtaking! However at least in my opinion it's too much hentailike for example the breasts of Minori or Yoshida are way too big. You could argue that it's like that because the story says they have big breasts but in my opinion this is more than just big breasts. I think it's a bit disgusting but okay ... \\n\\n\r\nAnother Pro is the sound. The OP and ED are a bit corny but I've seen far worse. The background sound is stereotypical but that's normal. The best thing of the sound are the voice actors though. Top actors like Yukari Tamura bring live into the plain story. One exception though is Wataru Hatano (known from Mikakunin de Shinkoukei, Nogizaka Haruka no Himitsu or Papa no Iukoto wo Kikinasai)! In my opinion his voice is completely out of the place here and to be honest in his previous roles i thought the same. \\n\\n\r\nThe characters are okay too. While I'll better ignore the main character Hata and his childhood friend Minori I have to say that the character of Kinoshita was really likeable! Her emotions and inner conflicts are expressed pretty good. She's nothing really completely special though so don't except something you've never seen before!\\n\\n\r\nThe last pro is the enjoyment. Believe it or not this series is enjoyable! It's neither one of the series where you laugh all the time or one of the series with heartbreaking moments but except of the last two episodes you have a constant feeling of happyness while watching it. The reason for this is that Nourin constantly shows an ideal world. Every problem, every fight gets solved in a few minutes! Because of this you shouldn't expect really exciting moments though ...\\n\\n\\n\r\nEverything in short with a few more pros and cons!\\n\\n\r\nCons:\\n\r\n- horrible story cuts \\n\r\n- misplaced standard jokes\\n\r\n- misplaced epic moments\\n\r\n- incomplete ending\\n\r\n- way too big breasts\\n\r\n- Wataru Hatano\\n\r\n- rather lame plot\\n\r\n- romance? sou ka ...\\n\\n\r\nPros:\\n\r\n- breathtaking Artwork\\n\r\n- neat Soundtrack and good voice actors\\n\r\n- a few good characters\\n\r\n- a few funny moments\\n\r\n- enjoyable!\\n\\n\\n\r\nOverall this series IS enjoyable but that doesn't change the facts that it's sometimes at the borderline to stupidness and also incomplete! I'd definitely like to see another season - with a lot of improvements and a real (hopefully Hata x Kinoshita) ending!",
            "date": "2014-04-13T10:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 139771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3405627.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kshmir",
                "username": "Kshmir"
            },
            "url": "https://myanimelist.net/reviews.php?id=139771"
        },
        {
            "content": "The ultimate goal of farming is not the growing of crops, but the cultivation and perfection of human beings. - Masanobu Fukuoka\r\nAll we have to decide is what to do with the time that is given to us. We cannot do everything we want. But we can do small things with great love. What you see depends on how you view the world. To most people, this is just dirt. To a farmer it’s potential. \r\nNourin also covers all aspects of Romance, Slice of life, Agriculture down to the core itself.\r\nI'll get back to the main story in a minute. I want to clear thisfirst.\\n\\n\r\nThe stories of Nourin tell us about how is it to be a farmer. At this point, we will go through a daily farmer life which it shows also to be something fun. Yes, the producers want us to be at least open minded. Skeptical view from the media side about a farmer life not really all the truth. Life as a farmer is not necessarily bad or worse than for example life of salary man. It actually can be fun and entertaining. But, most of us looking it with one side eye only. You can say ignorance yet try to defy and judge it.\\n\\n\r\nStory \\n\r\nThis story is about Kousaku Hata who goes to Tamo Agriculture School. Hata is a huge fan of national idol Yuka Kusakabe. Suddenly, his national idol Kusakabe Yuka retired from the entertainment business and went quiet. This give a huge shock to Hata and made him depressed and unmotivated. After Hata successful past through those bad days, Kusakabe Yuka appears again in his life. Shockingly, she goes with a nickname as Kinoshita Ringo, a new transfer student to his school. Could this be a chance for him to know better the girl he once idolizes and love? This set a new hard life Hata will go through. You cannot rest yet Hata-kun! More hardship, love, and funny moments are yet to come! If you are wondering whether the series is worth to be watched I'll tell you in one beautiful phrase: damn good writing.\\n\\n\r\nArt \\n\r\nSimple but cute. It's good and not even worse or bad. Still the art play its part marvelously without blemish.\\n\\n\r\nSound\\n\r\nFair enough but not memorable. Undulating rhythm plays in our ears without realizing it. \\n\\n\r\nCharacter\\n\r\nI love all the characters in this series. We get relationships we can invest in and we get characters that properly progress through beginning, middle and end. It might not be anywhere that deep but it is affecting, fun and deeply enjoyable. The main lead, Hata is a person who the shiny one among the character showed us his kind and caring personality up to the bitter end without hesitation. He proved that he is not some stupid Main lead who is just pushed over by everyone. Which results in a fresh scenes in anime series once in a while. His crush, Ringo who is also an idol does not disappoint us as the main girls of the series. Supporting Hata in her owns way. Ringo is undeniably a cute girl in inside and outside.\\n\\n\r\nEnjoyment and Overall \\n\r\nRight at the start, to be honest, I was surprised. I tried to think that this anime is just your base average type of anime. Rather, I found it amusing and fun to watch as I kind of enjoy the story and comedy. It's a really great series overall. Never let the appearance fooled you. It looks like this series is kind of boring one but actually opposite of what we've been thinking. I can assume at least that the series potential is more than meet the eyes.\\n\\n",
            "date": "2015-09-13T04:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 198474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4465109.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/End",
                "username": "End"
            },
            "url": "https://myanimelist.net/reviews.php?id=198474"
        },
        {
            "content": "Although using agriculture as a school setting, this anime is almost never taughtanything about farming or the lives of those who study there. There is still no information was delivered, but the amount rarely, is highly technical, and inserted at random so it feels so forced, just as long as he looks had something to do with the agricultural school and not seriously intend that the audience can understand. More often, the anime is actually using the agricultural element as a material for a comedy that tends erotic nuance. What he actually wants to achieve by using a unique setting? Is this anime is nottrying to attract the audience's attention on agriculture? Then is not a trick like this will actually have the opposite effect? Worse, most of the comedy anime is also far from being said to be entertaining. Relying too sleazyjokes and excessive actions of the characters, at the beginning of this animeis still quite comical, but it did not take long before he then started to change boring ... and sometimes even disgusting.",
            "date": "2017-02-24T13:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 241287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241287"
        },
        {
            "content": "I wasn't sure what to expect from Nourin. An ero-comedy, set in an agricultural school? It's not the best show, but it definitely lands some good jokes, probably more than it misfires. Unlike some shows that kind of poke fun at fan service (while still employing it) Nourin leans into it too heavily and it comes across as over the top without always being funny because of it. If you can get around that though some of the episode plots are a lot of fun and I'd definitely have watched more eps/a second season. I guess because it's an on-going manga it doesn't have asatisfying ending at all, so that's something to consider if you can't stand incomplete stories.\\n\\n\r\nA note on the translation/subs: I watch most things on Crunchyroll but occasionally rely on fansubs, and the fan translation for this often came across as, well, mean and caustic. I don't know whether that's just accurate to the original but it sometimes put me off.",
            "date": "2016-10-25T04:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 232585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3271853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jiroemon",
                "username": "Jiroemon"
            },
            "url": "https://myanimelist.net/reviews.php?id=232585"
        },
        {
            "content": "When I planned to watch Nourin, I thought \"Its a 12 episode laid back kinda anime like D-frag or Maken-ki that I can watch and not get to stressed over\" and I was right. Except in this anime I actually liked the characters, and connected to them faster than I would in say Maken-ki or any other type of that anime. Also didn't have as much fan service than your typical harem/echhi anime. Still has some but most of the time they use it for funny moments, not just for the hell of it, they have fanservise for all boys and girls and Cows!\r\n-\r\nGOOD THINGS\r\n·Theshow had an awesome/different setting that I surprisingly liked (Agriculture). \\n\r\n·The setting and the characters were the main part I enjoyed it the most, it had some hilarious seens, and I thought there school/home was pretty freakin awesome.\\n\r\n·I didn't have to stress out over it too much unlike shows like Future Diary or Gurren Lagann.\\n\r\n-\\n\r\nBAD THINGS\\n\r\n·The shows english singing is absolutely horrible, they made the same mistake in other anime were the voices aren't bad, it's the transition to English that makes it bad, the lyrics don't mix well, though the songs in Japanese are pleasant.\\n\r\n·Same old same old love triangle that never has a conclusion, always grinds my gears!\\n\r\n·Story isn't really a thing, I don't mind that much though.\\n\r\n·Hated the last 2 episodes, could of been so much better with a different ending\\n\r\n-\\n\r\nFINAL RESULT\\n\r\n·FAVORITE MALE CHARACTER : Kei Kamatori \\n\r\n·FAVORITE FEMALE CHARACTER : Minori Nakazawa \\n\r\n·FAVORITE EPISODE/s : 5 (hilarious episode XD)\\n\r\n-\\n\r\nDo I want season 2? YES \\n\r\n-\\n\r\nRATE\\n\r\n7.8/10\\n",
            "date": "2016-03-21T17:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 213571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4484658.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/captaincool",
                "username": "captaincool"
            },
            "url": "https://myanimelist.net/reviews.php?id=213571"
        },
        {
            "content": "For a Rom-Com genre type, it didn't have much impact on the romance side. It did however have a great comedic side. Unfortunately, the story did not progress so much especially the ending. So it did left a bitter taste. \r\nThe anime definitely have no problem in its comedic side. Every episode can make you laugh. \r\nIt has a unique story and as much as the art and sound its average. A good Anime for me has high qualities in the climax and ending. However, the Nourin is a cliffhanger in the progression of the plot.\r\n-STORY-\r\nIt certainly is unique and intriguing but progresses really slow,also concerning Romance. \\n\\n\\n",
            "date": "2016-09-11T06:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 228785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5688477.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hoohah",
                "username": "Hoohah"
            },
            "url": "https://myanimelist.net/reviews.php?id=228785"
        },
        {
            "content": "First think that comes into your mind when you think of farming would be the countryside, right? Well, after watching anime, the first thing that comes into your mind when you think of farming, would be the massive boobs... heh, right?\r\nStory: 9/10\r\nStory is based around agriculture and mostly the countryside. So, if you're a futuristic, sci-fi lover then look no further, this anime is might not be for you. The one aspect that stands above the rest is the comedy. 80% comedy and 20% romance. I would find myself laughing to each episode, because of how stupid one sounds or how they make the biggestdeal out of one small thing, which can somehow be funny for me. The story can get serious, maybe tear-jerking but hey, feel free to ride the feelcoaster with me. This story is similar to Sakurasou no Pet na Kanojo, so if you liked that one, you will like this one too.\\n\\n\r\nArt: 10/10\\n\\n\r\nAs expected from an anime that was released last year, smooth animations and very vibrant colors. Nothing much else to say.\\n\\n\r\nSound: 9/10\\n\\n\r\nSoundtracks fit each scene, funny or serious. The OP is very catchy, fitting the comedy aspect and so does the ED, but not as catchy.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nHata Kousaku, a hardworking student who is the biggest fan of Yuka Kusakabe. But, he's the idiot of the anime, which can be hilarious.\\n\\n\r\nKinoshita Ringo, or her past-self, Yuka Kusakabe is a very quiet girl. The first impression I had on her when I saw the cover photo, is that she would be a cheerful yet the klutz-type girl. \\n\\n\r\nKamatori Kei, a knowledgeable student, who excels in agriculture, also very hardworking.\\n\\n\r\nNakazawa Minori, Kousaku's childhood friend. Short hair, massive boobs (or she's fat) and very cheerful. Also, I realised that everytime there's a childhood friend in an anime, that girl would have a crush on her childhood friend. \\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThis anime is very funny, but not for someone who's first time watching anime. It has some ecchi scenes, like Ms Becky rubbing oil on her. That picture gave me an impression that this might be some kind of hentai, but I was wrong. Would I re-watch? Definitely, in the future when I'm bored.\\n\\n\r\nOverall: 9/10\\n\\n\r\nIf you're looking for a comedy title, then this anime is for you.",
            "date": "2015-01-27T21:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 179097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=179097"
        },
        {
            "content": "This show deals with a uncommon topic: rural life. More specifically, the farmer's life. This is very cool, because you don't expect this subject to be dealt with in a romantic comedy. On the other hand, It's not a great show in general terms. \r\nStory/Idea (7/10) \r\nThe story is the best one in this series. I already said that the subject is uncommon. Well, It does not delve much on the aspects of a farmer's life, but when it does, it does it very well. The way in which some things are explained is funny and lighthearted, without too many complex details.\r\nOn the other hand,the series is about a love triangle (and a weird love triangle at that), between the protagonist named Kousaku, the idol whom the protagonist loves named Ringo and the protagonist's childhood friend named Minori. The romantic interest of the protagonist is evident. At the start of the series, Kousaku doesn't show any interest in the advances of his friend. Throughout the story he shows his love to Ringo, but even so he can't make a decision at the end. Well... I couldn't expect anything else from a typical story about a love triangle, but even so... \\n\r\nThe other important aspect is the comedy. Most of the show is comedy… clichéd comedy. The sexual jokes are very frequent and some-times there's meta-jokes about this. I didn't like the most of the comedy in this show, it was very stereotypical.\\n\\n\r\nArt/Style/Animation (7/10) \\n\r\nIt's not bad, but it's not good either. The characters have an interesting style, I really liked their eyes. But at times the elements of their bodies were very artificial, as if they were in the wrong place. The design of some characters is made by fanservice and this is not bad for a show in this genre.\\n\r\nThe backgrounds and the settings are beautiful. Mainly the panoramics scenes.\\n\\n\\n\r\nSound (6/10) \\n\r\nIt's not very good, but good enough (or efficient, maybe). The opening and endings are not the greatest thing, but are funny and nice to listen to.\\n\\n\r\nCharacters (6/10) \\n\r\nThe characters have the common tropes for this kind of stories. Their personalities don't stand out. Even so, the main character has excellent moments where they really do a good job developing his personality.\\n\r\nA similar thing happens with Ringo. This character is the most developed, although his role in the love triangle is a little forced.\\n\\n\r\nEnjoyment (6/10) \\n\r\nIn some chapters you want to drop it, but in some others you'll have fun. It's a show that's hard to enjoy, but it's not a bad show at all. Some chapters will surprise you.\\n\\n\r\nOverall (6/10) \\n\r\nA common show with a uncommon subject. If this show had a different setting, I would not recommend watching it. But the rural and farming setting is a good subject to explore.\\n\r\nWatch it and form your own opinion.",
            "date": "2015-08-02T16:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 195012,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634639.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZizRenanim",
                "username": "ZizRenanim"
            },
            "url": "https://myanimelist.net/reviews.php?id=195012"
        },
        {
            "content": "Nourin , at first when I've read the description of this anime , it didn't appeal me that much.\r\nI mean c'mon? Farming? \r\nBut I decided to give a try ,\r\nIt has a really good art style and I personally think the art style saved this anime.\r\nThe main character had a annoying voice and hairstyle .\r\nI liked the fact another guy had a crush on him, I think the voice of kei was hot and I liked his borat swimsuit haha.\r\nI cheer for Minori , I yearn to have a childhood friend like her wich is truly devoted onto \r\nHer crush.\r\nIt could appeal anyone wich hasgreen fingers though I doubt they ever watch this . \\n\r\nBUT! It was intresting to watch till the end.\\n\\n\r\nI only gonna give 6/10 on this one because \\n\r\nIt had many cliches and I didn't like the ending.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-02-23T07:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 211533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5217982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hadoke",
                "username": "Hadoke"
            },
            "url": "https://myanimelist.net/reviews.php?id=211533"
        },
        {
            "content": "NO SPOILERS\r\nStory(7) Nourin's story is quite weird in some parts: often very funny but sometimes it become serious and surely too serious. It's like you're watching an other anime in these parts. Excepted that, the story is bit disappointing in its proceedings. \r\nArt(9) Very colorful, Nourin has also a clean line and a fluid animation. There is nothing to reproach to the animation. The chara-design is funny too!\r\nSound(8) The opening and the ending respect and suit perfectly with the atmosphere of idol music. Enjoyable and dynamic is the OST of this anime.\r\nCharacter(7) Like the story, characters evolve in a strange way. Very dynamic and happy,they become much more serious and deep, but it doesn't fit with the anime: it's a comedy!\\n\\n\r\nEnjoyment and Overall(7,5) Strangely evolving characters, like the story, in a colorful place and idol music in the background, this is Nourin. Pleasurable but it's a difficult question about recommending it.",
            "date": "2015-08-31T02:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 197543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4727447.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EpicWapanese",
                "username": "EpicWapanese"
            },
            "url": "https://myanimelist.net/reviews.php?id=197543"
        },
        {
            "content": "You know, reader, in the 7 years I've watched anime I've seen quite a few shows. Thinking back on what I've watched I can only remember so many specifically, in fact a lot of shows I just straight up forget about. \r\nNourin is the latest edition on that non-existent list. \r\nLet's see if we can't find out why.\r\nIf you look at the tags on your left you'll notice it's an ecchi rom-com in a high school setting. Sound familiar? It's one of \"those\" shows, the one's that'd be mass produced on a conveyor belt if it were any other type of product. I'll give creditwhere it's due and at least acknowledge that they tried to do something differently by setting the show in an agricultural school, which basically means our characters tend to crops instead of filling out tests.\\n\r\nOther than that, well, you probably know how this song and dance goes: transfer student -> meet characters -> filler filler filler -> obligatory beach episode -> filler filler -> end\\n\r\nI'd get into more details but I've already forgotten most of what the hell was going on in this show about 40 minutes after watching it. \\n\\n\r\nThe issue isn't that it's just another high school romance, it's that nothing happens for 11 episodes. I honestly can't remember the last time I've been this bored. I literally dropped this show 4 times before finally thinking \"screw it, might as well finish it\" It's impressive, really.\\n\r\nYou could just watch the first and last episodes of this show and get the same story I did. You'd probably even have a better experience since you didn't just waste around 5 hours of your day on a show you won't remember tomorrow. Actually, you know what? Skip that last episode and just go straight for the beach ep instead (episode 9 btw), the status quo is reset at the end anyway. \\n\\n\r\nThe characters in this show are something else you'll probably immediately recognize, you've got:\\n\\n\r\nKousaku - The dense MC who's really good at what he does for no reason.\\n\r\nKei - The support character who's really smart and wears glasses. \\n\r\nMinori - The childhood friend character who's obviously in love with our MC.\\n\r\nRingo - The kuudere transfer student who takes an interest in our MC to create a love triangle.\\n\r\nOh, we also have:\\n\r\nTorao - The tomboyish one\\n\r\nKochou - The princess-hime type with big boobs.\\n\\n\r\nDid I mention there's a \"top x\" at the highschool? \\n\\n\r\nWe even have a comedic pet Wakadonna. Good for us.\\n\\n\r\nThe art/animation of this show is the only positive thing I could bring up about it. Animations are smooth, the art is consistent and colourful, even if the designs themselves are about as stock as you can legally get away with. The sound? Standard at best, no background tracks that stand out. I'll at least mention the cringeworthy opening music, couldn't even listen to that once, and this is coming from a guy who unironically listens to vocaloid.\\n\\n\r\nThis show really is completely unremarkable in every possible way. The characters are bland and one dimensional, there's virtually no story to speak of, the music isn't memorable and the animation is slightly above average. This is that one high school rom-com that's released on mass every single season. I almost feel bad for paying attention to it by writing a review, but maybe I can at least save some hours of your time if I can't get mine back.\\n\\n\r\nTL;DR: Don't watch this show unless you desperately need to be as bored as possible.\\n\\n\\n",
            "date": "2016-09-16T14:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 229150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2440981.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/notraven",
                "username": "notraven"
            },
            "url": "https://myanimelist.net/reviews.php?id=229150"
        }
    ],
    [
        {
            "content": "The anime is more comedy than \"romance\". It has some parts with kind of drama/romantic themes but the main thing here is the comedy borderlining silly and nonsensical. Every episode was fun to watch. The characters are interesting, the main is well balanced between wacky and serious, the support characters are interesting. The main theme is very interesting, the references and self awareness are good too. I really enjoyed and I wish there was another season or more episodes.",
            "date": "2014-05-10T19:24:00+00:00",
            "helpful_count": 228,
            "mal_id": 142933,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MarcoAlencar81",
                "username": "MarcoAlencar81"
            },
            "url": "https://myanimelist.net/reviews.php?id=142933"
        },
        {
            "content": "In life, there are things that are misleading, such as commercials on TV, ads on the internet, and even, anime.  There are certain things in anime that I require in order for me to really like it, and that is a good exposition, a decent amount of character development, and a nice end in the last few minutes of the series to wrap it all up.  Nourin here...broke every single one of those foundations I set down for myself.  In any case, here's the review.\r\nStory (3.43/10):  The story of Nourin is set in an agricultural school, where a student by thename of Kousaku Hata, aka our main protagonist, is shattered by the fact that his precious little idol superstar Kusakabe Yuka has retired.  Due to this fact, he is rendered helpless, as without the existence of his little goddess to keep it up, his world is shattered, making him miserable and sad.  It is until a few days later, that a transfer student by the name of Kinoshita Ringo transfers into his class, a girl who has a remarkable resemblance to his favorite idol star, and from then on, he intends to find out why this girl has come into his school.  \\n\\n\r\nFrom an idea standpoint, this could create a good deconstruction of the life of an idol, focusing mainly on the characters for the majority of the series, and maybe tossing in a bit of character development and romance here and there.  \\n\\n\r\nAt least, that's what I hoped for before my dreams were completely smashed and grounded like miso.  The main idea that is in the paragraph above is a complete and utter lie.  In no way shape or form beyond the second episode will they ever touch on this subject again as heavily as they did in that time frame.  Beyond the second episode, this main idea is completely obsolete beyond measure, to the point that by episode 8, you're not even watching the same anime.\\n\\n\r\nWhat I mean by that, is the fact that Nourin is basically an episodic series, and not a good one at that.  The entirety of an episode can be summed up as random, almost to the point that I could compare it to another well known random, episodic anime called FLCL.  However, unlike FLCL, this series was supposed to have an idea for it to follow.  Every episode contains a singular plot point, which the whole episode follows suit.  After the episode is finished, that singular plot point is pretty much disregarded for the rest of the series.  The thing is, this whole series is just improv, as it feels like the creators just threw in a bunch of ideas into a box, and drew them out one by one to determine the ideas that would be made into episodes of the show.  Here's a few examples;  Having a beach party in a flash flood thunderstorm, making money off of a moe themed egg brand, and even a battle bikini farming showdown.  If these ideas aren't random, I don't know what is.\\n\\n\r\nThe randomness was only one factor to this show's downfall.  Another thing it did wrong, was its comedy.  The show tried to be one of those animes that exaggerated itself so that it could ridiculous to the point that it was funny.  It didn't work.  The show tried WAY too hard to be funny, featuring characters riding on goats, having jousts in farmlands, etc.  Because it tried so hard to be funny, what with it failing in the end, I was just bored and saddened by how pathetic it really was.\\n\\n\r\nThe end I felt was just as terrible due to the fact that it basically ends, like how it felt watching this series, a punch to the face.  Not even kidding.  The fact that this series was just so terribly written, due to how distant the anime made itself from its main idea, was just enough for me to hate this series to my very core.  \\n\\n\r\nOverall, the story was a mess, what with it not pertaining to the original idea it was supposed to follow, trying way to hard to be a good comedy show, and even failing to deliver a good end in the final episode, I was rather disappointed as a result.  On the plus side though, more than likely, you'll learn something about modern day farming, so that's a plus, I guess.\\n\\n\r\nOverview\\n\r\n+  Good starting idea\\n\r\n+  You learn stuff about farming.\\n\r\n-   Terrible execution of starting idea\\n\r\n-   90% of the series wasted on stupid side episodes\\n\r\n-   Tried way too hard to be funny\\n\r\n-   Strange ending\\n\\n\r\nCharacters (4.21/10):  The characters of Nourin were similar to the story they were based in, terrible.  But, towards the end, some of them did have some redeeming factors, but not enough to save this show.  \\n\\n\r\nStarting with the main protagonist, Kousaku Hata.  Without spoiling anything, (since any character development he gets is shoved to the end.  Yes, there somehow is character development in this.)  Hata is a very ambitious person.  He aspires to have his own little farm one day and just lead a nice little farm life.  That is all you pretty much get in terms of character from him till about episode 11.  What I didn't like also about this series, was the fact that they shove any if not all character development within the last 3 episodes.  Hata here, is no exception.  With such a vague idea of who he really is, he mostly remains as a mystery to the audience as we don't know who he is.  But we don't even get enough time to think about it since the sporadicly unnecessary plot takes most of the audiences attention.  It isn't until the very end, the very last 7 minutes, where he accepts his own past and ultimately changes his outlook on his life.  Little late there, buddy.  \\n\\n\r\nUp next is Kinoshita Ringo.  Ringo, as the supposed focus of the show, is mainly pushed to be the new kid, questioning things at every turn, so that us, the audience, can learn about how farming works.  This show is basically a messed up farming training video.  While for the most part, she is shown to be utterly emotionless in terms of expressions, (she's a kuudere!), she does express the fact that she has emotions and wonderment about her new life, and even explaining what she went through as an idol.  Still didn't explain why the f**k she's here.  She is also shown throughout the series to have some sort of attachment to Kousaku, but it's so minute and rarely shown, that it was pointless to make her a love interest.\\n\\n\r\nNakazawa Minori is the next one on the chopping block.  The way I see it, her purpose for the show is actually rather pointless.  Sure, she can help create the non-existent love triangle that is really not shown/explain, but other then that, I don't see her really being all that important.  She plays a role really only at the end of the series where Kousaku is contemplating shit at the end of the series like any other stereotypical guy in a romance anime.  She also has a crush on Kousaku and wants to be his wife, or a bride in general.  Other than that, there's nothing else to really talk about.  Moving on.\\n\\n\r\nKamatori Kei is the \"glasses\" character of the group, being a lot more knowledgable about farming than the rest of the cast.  Due to his past that becomes the main focus on the 10th episode, (For some reason, they liked pushing the character development at the end), he has aspired to become a very \"natural\" grower of vegetables.  Still though, I find him very awkward because he has that look to basically make any ridiculous topic sound \"super cereal\" and just weird to watch because it gives the impression that he talks about everything WAY too seriously.  \\n\\n\r\nAnd finally, the last character that I will be formally mentioning, BOOBS!  Or as her real name is in the series, Kochou Yoshida.  (Though she's in the supporting role, she appears quite often and is regularly shown in the series to help out with the main cast.)  First off, why?  When you nickname a character, boobs, you're instantly going to lose credibility.  Though she doesn't appear quite as often as the rest of the cast, she's usually helping out with the main cast, and is often involved with anything they do.  More or less though, she plays the extreme supporting role of helping the main cast.  (Honestly, that nickname though...)  \\n\\n\r\nWhile the main cast themselves were were a main problem with the series, it's really the side characters I think that really killed the show.  First off, the homeroom teacher, Bekki.  She a lonely 40 year old woman who wants to get married.  Based off of what you know of the lonely teacher  anime troupe, multiply the desperateness by 9000.  Bekki's ridiculousness of a character I felt, hurt the show too.  \\n\\n\r\nAbove all, what I felt was the real nail in the coffin, was the fact that the series kept adding in more, and more, and more, and more pointless side characters that didn't matter.  Adding in characters is fine, but it's the way they did it, that felt really pointless and stupid.  The show makes you feel like you should know about these side characters beforehand, because the main characters freak out or are aware of their existence before we know anything about them.  Above all, they don't really give much of a character explanation much less a trait about them.  All of them, literally, all of them are one note characters that have a singular trait that exists as their existence.  Personally, I found the additives of more and more characters hurt the show more and more, adding to the already badly explained plot.\\n\\n\r\nOverview\\n\r\n+  Ok main cast?\\n\r\n+  Character development\\n\r\n-   WAY too many side characters\\n\r\n-   Introduction of most of the cast way too late\\n\r\n-   Generic one sided troupes as the majority of the cast\\n\r\n-   Bekki.....  (personal complaint more or less)\\n\\n\r\nArt and Sound (7.10/10): (While I have been bashing this show left and right for its terrible writing and characters, one thing I have to compliment, are its aesthetics.  \\n\\n\r\nThe actual art for the series is actually quite nice.  The backgrounds are very nice and colorful with very nicely drawn out produce and flora.  The characters themselves look a bit odd, but for what this show's worth, it's still pretty nice.  The color palette is mainly on the white side of the spectrum, making blinding colors of a very high gradient prominent in their characters.  (They even reference their own show's original artwork creator at one point.  Humble much, Nourin?)\\n\\n\r\nNow, for ecchi.  The show has a lot.  It was so much to the point that I covered my screen because of the sheer amount of it, as well as how pointless it all was.  Like its comedy, they went over the top with it, and in the end, it didn't help the show at all.  And it's not just the female characters; there's even some manservice for the girls too in the show.  Personally, I think the show could've done without the ecchi, since the actual storyline was hurting it enough already.  (I'm fine with ecchi, but personally, this was just too much.)\\n\\n\r\nFrom a music standpoint, the show's music is actually somewhat decent.  The OST is quite high spirited with an idol song as the soundtrack.  Personally, I felt like this was a nice touch for the series due to the fact that this was about an idol in an agriculture school.  What better way to start it off than to make an idol song the OST?  \\n\\n\r\nPersonally, I don't like the ED, due to how it was presented, and I more or less found it to be a generic song that I skipped after every episode.  I still listened to the OST though.\\n\\n\r\nOverview\\n\\n\r\n+  Interesting character designs\\n\r\n+  Nicely colored and made backgrounds\\n\r\n+  Enjoyable OST\\n\r\n-   Too much ecchi even by ecchi standards\\n\\n\r\nPersonal Enjoyment (5.56/10):  Week after week of me watching this show, I asked myself, why the hell am I still watching this.  I still ask this to myself.  While the first few episodes peeked my interest, I quickly found myself facepalming at the episode ideas and shouting REALLY?  at my computer screen for the whole 30 minutes of me watching this show.  I'm all for really stupid and pointless comedy, but this was brain damagingly stupid.  \\n\\n\r\nSomehow though, I can't disregard this show completely.  I was still watching it, and even made it to the end, watching the entire show, but I still didn't think it was worth it.  What troubled me the most watching it, was the fact that the actual main idea that the show was supposed to originally follow, didn't exist, and just recently at the end of the show, found out that the character development happens at the end of the show.  Personally, I felt like the show didn't need any character development because it just clashed with the path it was going on, which was the random anime path.  \\n\\n\r\nI won't recommend anyone to watch this, since there are just so many flaws with the execution of this anime.  Personally, I found this show to be quite an awkward watch, and felt glad that I finished it.\\n\\n\r\nOverall Score: (4.98/10)",
            "date": "2014-03-28T16:55:00+00:00",
            "helpful_count": 92,
            "mal_id": 137591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=137591"
        },
        {
            "content": "Who knew farming could be filled with so much passion and fun? Well, probably not as much in real life, but certainly in anime anything can be made fun, even something as mundane as farming. And oh boy, did I have fun watching this one.\r\nWith unique characters and strange, humorous twists at every episode, I was grinning most of the time. The personalities of the characters were simply and elegantly presented, allowing for easy understanding of where they were coming from and the kind of person each character was. Well, except a few. A bonus was that, amidst all of the fun, there was aplot! Not a flawless story, but something to add a bit of drama and set a level of seriousness. \\n\\n\r\nAs I continued to watch, and as the existing plot continued to develop, I realized that I was watching Nourin more for its humor than for its serious undertone. I could appreciate where the seriousness fit into the grand scheme of things, but the most memorable parts of this series were the funny and ridiculous. \\n\\n",
            "date": "2014-06-17T19:51:00+00:00",
            "helpful_count": 52,
            "mal_id": 147385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3835455.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dontaskme",
                "username": "Dontaskme"
            },
            "url": "https://myanimelist.net/reviews.php?id=147385"
        },
        {
            "content": "Hate it! Hate it hate it hate it!\r\nWhy? The story is somewhat original, the jokes are pretty funny, the music and the animation are on pretty ok levels, the fanservice is good. But the ideology makes me want to burn rainforests, preferrably filled with endangered species.\r\nThe anime begins with our protagonist, Kosaku, 100% obsessed over a certain pop idol in Tokyo, far away from the countryside where our protagonist attends a Farmer's School (something like a regular high school with lots of focus and special lessons about various aspects of farming). The pop idol on the other hand, Ringo, is going through depression due tobeing forced to smile all day. After a certain point she has a mental breakdown and can't show emotions anymore. (By the way, did I mention she's practically a loli? We're talking emotionless loli here! (Y)  ). She decides to take a break from the world of showbuis, and visits the place where one of her fans sent her vegetables from (reaaaaaal smooth Kosaku...  Send tomatoes to the person you admire.)  Anyway, she rerolls at the protagonist's school where she's trying to learn about farming in order to get over her depression (And yes it's a fact. Freud just came back from the dead so he can commit suicide!).\\n\\n\r\nThe supporting cast consists of the rest of the school's students, most notable of which is a classmate of the protagonist (with rediculously large b.. cleavage ... No, screw it. Her boobs are huge.) who has a crash on him and an eyeglasses dude that from the beginning to the end you will suspect of being homo.  As the loli (Ringo) attends the farming school, the show throws at us the \"wisdom of country folk\" with Ringo learning their ways.\\n\\n\r\nLet me be clear with this: I do not have anything against people from villages, farmers etc. But the way the anime is trying to force on us the \"wisdom of nature and countryfolk\" is making me puke. First of all, Ringo has lived in Tokyo, doing a pretty hard job there too. And after leaving Tokyo she comes to a place where she is practically taught that the ways of the \"ignorant folk\" in the cities are wrong (obviously the anime never 100% puts it like that, but it is kind of the general message). Most of all, I am angered by the fact that Ringo accepts this instead of reminding them that practically none of them has dared stepped out of their small community (as in, never). People, you shouldn't get life lessons from someone who hasn't left the safety of his neightbours & family for his whole life. Seriously, it's not smart. \\n\\n\r\nI HATE the \"noble savage\" idea. I get that staying close to nature and respecting it is the right way and all that, but unless Peter Jackson directs it history has shown that our \"evil corrupt civilizations\" have repeatedly kicked \"a$$ while a few billion \"good respectful nature folk\" have gone extinct. I don't have a problem with the show questioning our morals, or saying that life in the big cities may be stressfull for some, but presenting us as morons I will NOT stand for.\\n\\n\r\nThe animation and sound are definitely well done, the sub-plots are interesting (so long as you can avoid puking) and the fanservice is acceptable.  But I really, really can't stand the idea of a pop idol dirtying herself and sweating to plant a potato while some random guy keeps giving her monologues about how the potato represents life and the ground feeds us and by-the-gods-shut-up-already!. If I were in Ringo's position I would be burying something else beneath the soil.",
            "date": "2014-11-01T22:30:00+00:00",
            "helpful_count": 27,
            "mal_id": 167105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=167105"
        },
        {
            "content": "Well, that anime ain't bad,but I'm just not that impress as how it was presented at all, the plot was pretty much a typical harem theme, but I can't ignore that there are two groups of characters that this anime was on two, the first one was the harem theme of Minori, Hata and Ringo, the second group was the romance theme between Kei and Yoshida. Well, if one is to examine this anime more focus was on the comedy aspect, but its comedy aspect- well let's just say that some parts were funny while there are some that where downright corny. Now, there aresomethings that were conflicting especially when it come to the other character's, like the so called 'Four Heavenly Farmers\", according to info it was suppose to be Yoshida the livestock specialist, Akari the bio chemist of food production, Rintarou the woodman and the homosexual Karou the flower guy. Now, I don't know about any of you out there, but this anime was suppose to be in an agricultural setting so why is there a character who is suppose to be in forestry, horticulture, biochemistry and some 5th wheel who is an ergonomist be called the Four Heavenly farmers\"  and why was there a 5th one? Now, let's face it, this is probably one of those anime's that can be compared to a crudely customize car where all the parts were ill fitted but  for some reason can still run....only barely, and it looks like this series creator  Shiratori, Shirow, can't distinguish the difference between floral culture, forestry, agriculture and ergonomics which were each of it were a science of its own. Then again, Shiratori, Shirow, didn't do a bad job with his serial, but he didn't do a nice one either, so overall it was ok.....but barely. So, here were my ratings for this anime.\\n\\n\r\nStory: Decent 4.\\n\\n\r\nSince it wasn't bad, it wasn't good either.\\n\\n\r\nArt: fair 6.\\n\\n\r\nSince there isn't a lot of fan service.\\n\\n\r\nSound: Decent 4.\\n\\n\r\nSince, I like the opening and the ending where Becky did a number.\\n\\n\r\nCharacter: Decent 4.\\n\\n\r\nSince, the character's themselves were divided into the harem theme and romance theme, also there is the Becky theme where she is the comedy genre  in this anime.\\n\\n\r\nEnjoyment: Decent 4.\\n\\n\r\nLike I've said, it was barely funny.\\n\\n\r\nOverall: Decent 4.\\n\\n\r\nSince this serial's creator, Shiratori, Shirow, has done it in a half ass manner.\\n\\n\\n",
            "date": "2014-03-29T13:32:00+00:00",
            "helpful_count": 22,
            "mal_id": 137745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2004376.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Baddie007",
                "username": "Baddie007"
            },
            "url": "https://myanimelist.net/reviews.php?id=137745"
        },
        {
            "content": "My pick for \"Underrated Anime of Winter 2013/14\"...\r\nUsually the titles which are in the spotlight would be those involving intense action, intense feels, or those which were adapted from already popular manga or LNs. However, it has been proven over the past few seasons that some of the ones which are less popular may turn out to be that decent after all. \r\nNou-rin was by no means an anticipated series. The LN was relatively unknown by most, and there wasn't a manga adaptation. Hence when I first started watching it, I really didn't know what to expect from it. And 12 weeks on, I'm gladto say it was a series I didn't regret watching. What's so good about Nou-rin is that, it had an almost perfect balance between comedy and feels. Okay, at the start of the series like for the first few episodes, it was more of a comedy and I thought that was the way it was gonna go on. How wrong I'd been. After that, each episode had it's fair share of comical scenes, then moments and dialogues which made us think/feel. It wasn't about great and significant stuff like saving the world as such, but instead dwells on the little things in life that we tend to ignore. That, I believe, is the true beauty of anime with Slice-of-Life genres, and Nou-rin was definitely no exception. \\n\\n\r\n- No matter what we're doing, as long as we're having fun, that's enough.\\n\r\n- Sometimes, we have to admit that we're inferior to others before we can truly improve ourselves. \\n\r\n- If one person in a group is unhappy, there's no way everyone else can be truly happy. \\n\\n\r\nThese are just some of the morals I've learnt from this relatively simple comedy series. Indeed, it may not be the best, but I assure y'all, it's definitely not the worst.",
            "date": "2014-04-04T10:01:00+00:00",
            "helpful_count": 15,
            "mal_id": 138619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3423567.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/henkuku",
                "username": "henkuku"
            },
            "url": "https://myanimelist.net/reviews.php?id=138619"
        },
        {
            "content": "Looking at the preview before this aired, we can already tell that the art and cg animation on the music performance was good. The synopsis was interesting, so I gave it a try. Unfortunately, my expectations on this anime was wrong. Let's start with the many things that's wrong with this anime. \r\nHata, our main protagonist was energetic, but not interesting. He isn't that important in some parts of the story, which is a problem if he is a main protagonist. His end story at least could have been improved if he showed some foreshadowing for his hatred for the country. Instead, they shoehorned itin the end to fool the audience to think that this series is good.\\n\\n\r\nRingo was a let down character. In the beginning, it made us all be anticipated as to why she entered Hata's school and quit her pop idol career. Turns out she comes over because she can't smile and just followed the letters to the school? Her inability to smile was bullcrap since a disorder like that can only be obtained from genetics. Character derailment is a major indication of a bad story. She finds out that Minori, a character that is mainly annoying, sent those letters and got along with her and forgot about Hata. That immediately changes as she falls in love with Hata anyways because the author demands plot development and wish fulfillment.\\n\\n\r\nKei is the only interesting character in this show, but unfortunately he doesn't get the spotlight too much. It's interesting how he has agricultural tips and some decent humor.\\n\\n\r\nBecky is a character that enjoys raises the ecchi level of this anime, and knowing that I dislike fanservice, since it's a detraction to a good story, you can already guess how I feel about her.\\n\\n\r\nNothing much can be said about Minori and Oppai, since they don't have any sort of interesting quirks to amuse anyone.\\n\\n\r\nWakadanna is the best!\\n\\n\r\nFinally, the four kings of the school. I have no idea what in the world the author was thinking when bringing these terrible characters in, with the exception of Kanegami. Her information on the business of the world in her episode was indeed interesting, making her not a complete garbage character like the other three, who mainly are there to fulfill the wishes of yaoi fangirls.\\n\\n\r\nSound: Sound is alright. Nothing to go home talking about. The opening was energetic, which fits the atmosphere of this anime.\\n\\n\r\nArt: The art and animation were pretty good. Nothing seemed a bit choppy or weird in this show, though it's unfortunate that it's wasted on this piece of junk.\\n\\n\r\nStory: The beginning story introduced the mystery of why a pop idol came to an agricultural school. The concept was interesting, but, not to be repetitive, the whole concept of 'I can't smile for some unknown reason' was stupid. Kei's conflict with his father ended up being interesting, as Kei believed in making business without relying on pesticides, due to his failure of a father killed Kei's mother just because of money. Lastly, Hata's conflict was not handled well (please refer to my explanation on him). The guy deserved to get punched in the face right after he pursued a harem ending, which made me laugh at his stupidity. The story, overall, was a mess.\\n\\n\r\nTechnique: Here is an important concept that I want to talk about. The show relys on parody to spill out comedy and uses a lot of it! The show doesn't not stand out at all. No fresh comedy. The author couldn't think of anything original, so he just decided to use other things into his content. Terrible technique.\\n\\n\r\nOverall, this trash deserves a (2/10)",
            "date": "2014-03-29T16:20:00+00:00",
            "helpful_count": 12,
            "mal_id": 137785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3501491.jpg",
                "scores": {
                    "animation": 9,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PenX",
                "username": "PenX"
            },
            "url": "https://myanimelist.net/reviews.php?id=137785"
        },
        {
            "content": "I hope you really appreciate my effort in coming up with reviews. As I have said Winter Season Anime is definitely a difficult time for me to review anime. My brain is finally relaxed and calm after I enraged a lot in my Pupa review. However, there is still one more review to go in the Winter Season and that's \"Nourin\". \"Nourin\" is directed by Shin Onuma who also directed one of my favorite comedy of all time \"Baka & Test\". \"Nourin\" is produced by Silver Link. Let's get started.\r\nSTORY (5):\r\nThe story takes place in Tamo Agriculture School where Kousaku, Kei, Minori & Yoshida wereclassmates. Tamo Agriculture School trains the students on how to practice farming with brilliant techniques like protecting crops, maintaining the soil, etc... A transfer student, Ringo, comes to Tamo Agriculture School. Ringo was a former idol by the name of Yuka Kusakabe. Ringo decided to stay with the students in Tamo Agriculture School.\\n\\n\r\nIn my mind, I picture what the producers are thinking when they try to make this anime, \"Hey, we couldn't come up with great comedies, so why not let's reference some parts from previous anime?\". And there we have it.\\n\\n\r\nThe story was cliched and predictable because they use previous references but without coming up with a new and brilliant idea in comedy. You know, comedy is not easy to pull off, as I have mentioned in my D-frag review.\\n\\n\r\nThere was one scene in the last episode when Kousaku gave Becky the apple and Becky transforms from an old haggard to a normal and beautiful woman using the \"Sailor Moon\" transformation. \\n\\n\r\nDuring the episode 11, we get to see Kousaku's back story as a farmer. Why didn't you do it in the early episodes? So that at least we can get a better understanding of the characters and where they stand. The anime that managed to pull it off better was \"Golden Time\". In fact, this anime showed us the back story in the early episodes so that at least we can find out what happened to their relationships, etc... Not only that they tried to balance the comedy in the anime.\\n\\n\r\nART (5):\\n\\n\r\nThere's nothing special about the animation.\\n\\n\r\nSOUND (5):\\n\\n\r\nThe opening and ending theme are ok.\\n\\n\r\nCHARACTER (3):\\n\\n\r\nThis is what I had mentioned in the story section. If you would have given the characters back story in the early episodes, I would definitely care for them and follow them on their journey.\\n\\n\r\nThe characters are weak, dull and cliched.\\n\\n\r\nThe only characters that went through a development were Kei & Yoshida. It was when they decided to upgrade their education skills.\\n\\n\r\nRingo was like a copy from Kirishima Shoko from Baka & Test. However, all she does was follow Kousaku.\\n\\n\r\nMinori was annoying in the later episodes like for example in episode 9, when a typhoon occured, Minori just go out of the window and play on the muddy field which of course gets the rest of the characters into deep trouble.\\n\\n\r\nKousaku's back story in episode 11 was forced, because this was used in order to make the audience care for Kousaku.\\n\\n\r\nCONCLUSION (4):\\n\\n\r\nFirst, Strike the Blood. Now, Nourin? Seriously, what happened to you, Silver Link? Why did you do this? \\n\\n\r\nThe plot is full of contrived characters and contrived comedy. \\n\\n\r\nAnd if you say it's an Ecchi anime, it's just the start. Then, you need to work on the characters and their relationships, then you can have a good ecchi anime. \\n\\n\r\nI could go on about how much I didn't like about this anime, but I don't want to put any more effort in talking about an anime I just didn't have fun watching. So overall, I have to give this anime sadly a 4 out of 10. I would say there are better comedies out there.\\n\\n\r\nIf you find the comedy fun and entertaining, that's good. If you like the characters, that's also good.\\n\\n\r\nI am finally done with the Winter Anime Season. I am so looking forward to seeing Spring Season Anime.",
            "date": "2014-03-28T20:32:00+00:00",
            "helpful_count": 9,
            "mal_id": 137643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=137643"
        },
        {
            "content": "I'm sure all of us have one or two idols we look up to. Usually it's musicians or sports stars, maybe you're completely head-over-heels over your favourite anime director. Hata Kousaku is no different than us. Kousaku, attending an agriculture school, is completely obssesed over a certain popstar named Kusakabe Yuka. His obsession goes to absurd lenghts. He occasionaly sends his grown vegetables or fruit to Yuka and his whole room is completely filled with posters and what-not. Kusakabe Yuka shocks the world when she announces her retirement leaving Kousaku shocked and majorly depressed. Suddenly, a transfer  student joins Kousaku's school and class underthe name Kinoshita Ringo and it turns out this girl is a striking resemblance to Kusakabe Yuka. Kousaku instantly realizes that she is the idol he's been looking up to. For future reference i'm going to use the name Ringo as it's her real name. Kusakabe Yuka was only her stage name\\n\\n\\n\r\nStory: (6) \\n\\n\r\nThe story isn't anything fancy or deep. I feel the entire point of the anime is to make you smile and allthough it does manage to accomplish this it does not take away the fact the story is rather mediocre. However, this is not necessarily a bad thing. As most rom-com's dont utilize a deep storyline and i believe they don't need to. The comedy part is definitely strong in this anime. Most of the times it goes totally random and you're left wondering what the hell you just watched. \\n\\n\r\nThe setting of an agriculture environment is an interesting choice, one i haven't seen yet before. I'm not the kind of person that's into agriculture but i feel that's not a problem. It was actually fairly interesting to hear about different methods of growing vegetables and it was absolutely hilarious to watch the students go to absurd lengths in protecting their crops. \\n\\n\r\nArt: (8)\\n\\n\r\nThe art was good. There were no major flaws or inconsistency issues and i felt like they did a really good job in portraying the characters and the crops. I feel like this is to be expected from a 2014 release. Allthough the characters were drawn nicely i personally didn't like their clothing and work uniforms. I felt like Ringo and a few other characters ( whom i'll be going over at in the character section ) were robbed from their natural beauty solely because of the clothing. Ofcourse, this is subjective and to be expected because in order to accomplish succesful farming you have to get your hands dirty. In my opinion, once the characters switched from their work uniform into normal clothing you would feel better about watching them.\\n\\n\r\nSound: (7)\\n\\n\r\nThe sound, while being nothing special certainly wasn't bad either. The music was used at the appropriate times. It did well adjusting to the mood and was overall very cheery.\\n\\n\r\nCharacters: (5)\\n\\n\r\nDefinitely the weak part of the anime. About every character in this anime is generic and unoriginal. You have mr. nothing special protagonist, your typical tsundere who is in possession of the most oversized and unrealistic boobs i've ever seen in any anime and on top of that she is either extremely self unconscious or she thinks big and small have a reverse meaning, You simply do NOT deny the size of your boobs when they're the equavalent of a basketball. You also have your typical childhood friend who is there solely to form a love triangle. The amount of noteworthy contribution she has to this series is about as high as the amount of basketball-sized boobwomen on earth. Also i feel like she dyed her hair with vomit. Onto the next person, you have Kamatori Kei, who, at first glance would make you think he's the ''mature'' person in the series. Oh god how wrong was i in that assumption. He, alongside Ringo was one of the few enjoyable characters in this series. He is slightly perverted but hey nothing wrong with that right? He contributes alot to the randomness of this anime. Last but not least, you have Kinoshita Ringo. The adorable, purple haired girl who seems to blush 24/7. She is definitely the strong point of this anime. She gave a mysterious feeling. She talks almost monotone and doesn't say much. Even so she was fun to watch and definitely great to look at. I feel like there was little to no character development in this series at all. Ringo and Kousaku's relationship barely change and as such the end of this series will leave you infuriated. When this anime ended it felt like the last episode was just another random episode. It didn't feel like an ending so i'm generally disappointed by this.\\n\\n\r\nEnjoyment: (7)\\n\\n\r\nFor me this anime was fairly enjoyable, however i struggled to finish this to the end as i felt like there was no clear objective. When i finally thought about an ending that would have to be cramped up in one episode i was unpleasantly shocked that it simply did not have an ending at all. The agricultre however, was fairly interesting and the comedy was definitely fresh and enjoyable. \\n\\n\r\nOverall: (7)\\n\\n\r\nAllthough i rated this a ''6'' on MAL i did so on a subjective basis. When i rate a series i do so on personal enjoyment and not on an objective basis. The anime had both a very clear strength and an obvious flaw. Thus i feel the lack of character development is balanced out by the great amount and original comedy. a ''7'' would only be a logical conclusion from this point of view.",
            "date": "2014-04-05T10:02:00+00:00",
            "helpful_count": 9,
            "mal_id": 138781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3363559.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Holorence",
                "username": "Holorence"
            },
            "url": "https://myanimelist.net/reviews.php?id=138781"
        },
        {
            "content": "Welcome wretch who unfortunately stumbled across this promising looking series!\r\nWelcome to a journy full of overused and completely misplaced standart jokes and tons of other failures!\r\nWelcome to a still somehow enjoyable time!\r\nA few months ago - I was searching for new series for my List - I incidentally saw the Illustrations from Nourin and was at least a little bit impressed. I thought that just maybe this would turn out as a pretty good series ... and I was wrong!\r\nTo be honest the farmer clothes and the tractor already made it look kinda suspicious but I didn't know anything about the story so there wasa little hope left in me. Unaware of the thruth I was really looking forward to watching this so my impressions of it are probably even worse right now. \\n\\n\r\nWell let's get down to the point! I'll first describe the cons, then the pros and then the whole thing in short!\\n\\n\r\nHave you ever seen a series where each Episode has various different contents and none of them are properly finished? I haven't before so i was extremely shocked! You don't even understand what I'm talking about? Makes sense! Let me explain it:\\n\\n\r\nJust like many other series most Nourins Episodes aren't connected to each other except from the story background (all four main charas together in the countryside, fields, tractor, tomatos, whatever ... ). So the main story of Episode X has no deeper connections to the main story of Episode Y. The makers of Nourin probably thought this wasn't enough and doubled the No-Connection-Effect. Now in almost every Episode the first half is completely unrelated to the second half so basically every little story gets about ten minutes. Of course it's nearly impossible to finish a story in ten minutes. So what did they do to end every of these storys? They just cut them off somewhere in the middle of the end - time lapse for the win! \\n\\n\r\nUnfortunately that's not the only problem! Almost every comedy series has it: the standard anime jokes. From the unmarried lonely teacher to the typical BL jokes ... you know what I'm talking about! Even though these jokes are completely overused they still can be kinda funny if they're placed at the right time and with the right context. About 99% of the jokes in Nourin are these kind of jokes. Unluckily they are completely misplaced and the context isn't funny either! It's not true that I never laughed while watching this series ... I can even remember one slightly funny moment! But still for a Rom-Com the jokes are just way to generic and misplaced.\\n\\n\r\nAnother thing is the placement of Oh-so-epic-Moments. You can say what you want, farming is NOT epic! It's impossible to take to take the typical School-Roof-Epic-Weather-Epic-Quotes or the Epic-Romantic-Encourage-Talk-Through-Door scene whe all know from various romance animes seriously when the characters are talking about farming! There are so many topics that can be made epic in the right moment. However tractors and soy boans are a entirely different matter! \\n\\n\r\nJust as incomplete as the the ending of the most story parts is the ending of the whole series. I don't want to spoiler anyone so I won't tell the details but i can say that almost everything in the last few episodes sucked. Even the good moments sucked because there was still no solution of the bad moments. To  make it even worse the finally appearing solution is completely half-assed and can't really be called a solution. So in short the current ending sucks and is incomplete! If eventually a few years later another season has been finished with a real ending I'll increase the rating to 7 or more according to the new ending. \\n\\n\r\nThere are a lot more aspects to complain about but I described the biggest problems so let's leave this aside for now! \\n\\n\r\nThe best thing about Nourin is definitely the Artwork. Both colours and illustrations are beautifull. Even for a 2014-series it's still breathtaking! However at least in my opinion it's too much hentailike for example the breasts of Minori or Yoshida are way too big. You could argue that it's like that because the story says they have big breasts but in my opinion this is more than just big breasts. I think it's a bit disgusting but okay ... \\n\\n\r\nAnother Pro is the sound. The OP and ED are a bit corny but I've seen far worse. The background sound is stereotypical but that's normal. The best thing of the sound are the voice actors though. Top actors like Yukari Tamura bring live into the plain story. One exception though is Wataru Hatano (known from Mikakunin de Shinkoukei, Nogizaka Haruka no Himitsu or Papa no Iukoto wo Kikinasai)! In my opinion his voice is completely out of the place here and to be honest in his previous roles i thought the same. \\n\\n\r\nThe characters are okay too. While I'll better ignore the main character Hata and his childhood friend Minori I have to say that the character of Kinoshita was really likeable! Her emotions and inner conflicts are expressed pretty good. She's nothing really completely special though so don't except something you've never seen before!\\n\\n\r\nThe last pro is the enjoyment. Believe it or not this series is enjoyable! It's neither one of the series where you laugh all the time or one of the series with heartbreaking moments but except of the last two episodes you have a constant feeling of happyness while watching it. The reason for this is that Nourin constantly shows an ideal world. Every problem, every fight gets solved in a few minutes! Because of this you shouldn't expect really exciting moments though ...\\n\\n\\n\r\nEverything in short with a few more pros and cons!\\n\\n\r\nCons:\\n\r\n- horrible story cuts \\n\r\n- misplaced standard jokes\\n\r\n- misplaced epic moments\\n\r\n- incomplete ending\\n\r\n- way too big breasts\\n\r\n- Wataru Hatano\\n\r\n- rather lame plot\\n\r\n- romance? sou ka ...\\n\\n\r\nPros:\\n\r\n- breathtaking Artwork\\n\r\n- neat Soundtrack and good voice actors\\n\r\n- a few good characters\\n\r\n- a few funny moments\\n\r\n- enjoyable!\\n\\n\\n\r\nOverall this series IS enjoyable but that doesn't change the facts that it's sometimes at the borderline to stupidness and also incomplete! I'd definitely like to see another season - with a lot of improvements and a real (hopefully Hata x Kinoshita) ending!",
            "date": "2014-04-13T10:07:00+00:00",
            "helpful_count": 5,
            "mal_id": 139771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3405627.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Kshmir",
                "username": "Kshmir"
            },
            "url": "https://myanimelist.net/reviews.php?id=139771"
        },
        {
            "content": "The ultimate goal of farming is not the growing of crops, but the cultivation and perfection of human beings. - Masanobu Fukuoka\r\nAll we have to decide is what to do with the time that is given to us. We cannot do everything we want. But we can do small things with great love. What you see depends on how you view the world. To most people, this is just dirt. To a farmer it’s potential. \r\nNourin also covers all aspects of Romance, Slice of life, Agriculture down to the core itself.\r\nI'll get back to the main story in a minute. I want to clear thisfirst.\\n\\n\r\nThe stories of Nourin tell us about how is it to be a farmer. At this point, we will go through a daily farmer life which it shows also to be something fun. Yes, the producers want us to be at least open minded. Skeptical view from the media side about a farmer life not really all the truth. Life as a farmer is not necessarily bad or worse than for example life of salary man. It actually can be fun and entertaining. But, most of us looking it with one side eye only. You can say ignorance yet try to defy and judge it.\\n\\n\r\nStory \\n\r\nThis story is about Kousaku Hata who goes to Tamo Agriculture School. Hata is a huge fan of national idol Yuka Kusakabe. Suddenly, his national idol Kusakabe Yuka retired from the entertainment business and went quiet. This give a huge shock to Hata and made him depressed and unmotivated. After Hata successful past through those bad days, Kusakabe Yuka appears again in his life. Shockingly, she goes with a nickname as Kinoshita Ringo, a new transfer student to his school. Could this be a chance for him to know better the girl he once idolizes and love? This set a new hard life Hata will go through. You cannot rest yet Hata-kun! More hardship, love, and funny moments are yet to come! If you are wondering whether the series is worth to be watched I'll tell you in one beautiful phrase: damn good writing.\\n\\n\r\nArt \\n\r\nSimple but cute. It's good and not even worse or bad. Still the art play its part marvelously without blemish.\\n\\n\r\nSound\\n\r\nFair enough but not memorable. Undulating rhythm plays in our ears without realizing it. \\n\\n\r\nCharacter\\n\r\nI love all the characters in this series. We get relationships we can invest in and we get characters that properly progress through beginning, middle and end. It might not be anywhere that deep but it is affecting, fun and deeply enjoyable. The main lead, Hata is a person who the shiny one among the character showed us his kind and caring personality up to the bitter end without hesitation. He proved that he is not some stupid Main lead who is just pushed over by everyone. Which results in a fresh scenes in anime series once in a while. His crush, Ringo who is also an idol does not disappoint us as the main girls of the series. Supporting Hata in her owns way. Ringo is undeniably a cute girl in inside and outside.\\n\\n\r\nEnjoyment and Overall \\n\r\nRight at the start, to be honest, I was surprised. I tried to think that this anime is just your base average type of anime. Rather, I found it amusing and fun to watch as I kind of enjoy the story and comedy. It's a really great series overall. Never let the appearance fooled you. It looks like this series is kind of boring one but actually opposite of what we've been thinking. I can assume at least that the series potential is more than meet the eyes.\\n\\n",
            "date": "2015-09-13T04:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 198474,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4465109.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/End",
                "username": "End"
            },
            "url": "https://myanimelist.net/reviews.php?id=198474"
        },
        {
            "content": "Although using agriculture as a school setting, this anime is almost never taughtanything about farming or the lives of those who study there. There is still no information was delivered, but the amount rarely, is highly technical, and inserted at random so it feels so forced, just as long as he looks had something to do with the agricultural school and not seriously intend that the audience can understand. More often, the anime is actually using the agricultural element as a material for a comedy that tends erotic nuance. What he actually wants to achieve by using a unique setting? Is this anime is nottrying to attract the audience's attention on agriculture? Then is not a trick like this will actually have the opposite effect? Worse, most of the comedy anime is also far from being said to be entertaining. Relying too sleazyjokes and excessive actions of the characters, at the beginning of this animeis still quite comical, but it did not take long before he then started to change boring ... and sometimes even disgusting.",
            "date": "2017-02-24T13:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 241287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241287"
        },
        {
            "content": "I wasn't sure what to expect from Nourin. An ero-comedy, set in an agricultural school? It's not the best show, but it definitely lands some good jokes, probably more than it misfires. Unlike some shows that kind of poke fun at fan service (while still employing it) Nourin leans into it too heavily and it comes across as over the top without always being funny because of it. If you can get around that though some of the episode plots are a lot of fun and I'd definitely have watched more eps/a second season. I guess because it's an on-going manga it doesn't have asatisfying ending at all, so that's something to consider if you can't stand incomplete stories.\\n\\n\r\nA note on the translation/subs: I watch most things on Crunchyroll but occasionally rely on fansubs, and the fan translation for this often came across as, well, mean and caustic. I don't know whether that's just accurate to the original but it sometimes put me off.",
            "date": "2016-10-25T04:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 232585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3271853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jiroemon",
                "username": "Jiroemon"
            },
            "url": "https://myanimelist.net/reviews.php?id=232585"
        },
        {
            "content": "When I planned to watch Nourin, I thought \"Its a 12 episode laid back kinda anime like D-frag or Maken-ki that I can watch and not get to stressed over\" and I was right. Except in this anime I actually liked the characters, and connected to them faster than I would in say Maken-ki or any other type of that anime. Also didn't have as much fan service than your typical harem/echhi anime. Still has some but most of the time they use it for funny moments, not just for the hell of it, they have fanservise for all boys and girls and Cows!\r\n-\r\nGOOD THINGS\r\n·Theshow had an awesome/different setting that I surprisingly liked (Agriculture). \\n\r\n·The setting and the characters were the main part I enjoyed it the most, it had some hilarious seens, and I thought there school/home was pretty freakin awesome.\\n\r\n·I didn't have to stress out over it too much unlike shows like Future Diary or Gurren Lagann.\\n\r\n-\\n\r\nBAD THINGS\\n\r\n·The shows english singing is absolutely horrible, they made the same mistake in other anime were the voices aren't bad, it's the transition to English that makes it bad, the lyrics don't mix well, though the songs in Japanese are pleasant.\\n\r\n·Same old same old love triangle that never has a conclusion, always grinds my gears!\\n\r\n·Story isn't really a thing, I don't mind that much though.\\n\r\n·Hated the last 2 episodes, could of been so much better with a different ending\\n\r\n-\\n\r\nFINAL RESULT\\n\r\n·FAVORITE MALE CHARACTER : Kei Kamatori \\n\r\n·FAVORITE FEMALE CHARACTER : Minori Nakazawa \\n\r\n·FAVORITE EPISODE/s : 5 (hilarious episode XD)\\n\r\n-\\n\r\nDo I want season 2? YES \\n\r\n-\\n\r\nRATE\\n\r\n7.8/10\\n",
            "date": "2016-03-21T17:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 213571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4484658.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/captaincool",
                "username": "captaincool"
            },
            "url": "https://myanimelist.net/reviews.php?id=213571"
        },
        {
            "content": "For a Rom-Com genre type, it didn't have much impact on the romance side. It did however have a great comedic side. Unfortunately, the story did not progress so much especially the ending. So it did left a bitter taste. \r\nThe anime definitely have no problem in its comedic side. Every episode can make you laugh. \r\nIt has a unique story and as much as the art and sound its average. A good Anime for me has high qualities in the climax and ending. However, the Nourin is a cliffhanger in the progression of the plot.\r\n-STORY-\r\nIt certainly is unique and intriguing but progresses really slow,also concerning Romance. \\n\\n\\n",
            "date": "2016-09-11T06:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 228785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5688477.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hoohah",
                "username": "Hoohah"
            },
            "url": "https://myanimelist.net/reviews.php?id=228785"
        },
        {
            "content": "First think that comes into your mind when you think of farming would be the countryside, right? Well, after watching anime, the first thing that comes into your mind when you think of farming, would be the massive boobs... heh, right?\r\nStory: 9/10\r\nStory is based around agriculture and mostly the countryside. So, if you're a futuristic, sci-fi lover then look no further, this anime is might not be for you. The one aspect that stands above the rest is the comedy. 80% comedy and 20% romance. I would find myself laughing to each episode, because of how stupid one sounds or how they make the biggestdeal out of one small thing, which can somehow be funny for me. The story can get serious, maybe tear-jerking but hey, feel free to ride the feelcoaster with me. This story is similar to Sakurasou no Pet na Kanojo, so if you liked that one, you will like this one too.\\n\\n\r\nArt: 10/10\\n\\n\r\nAs expected from an anime that was released last year, smooth animations and very vibrant colors. Nothing much else to say.\\n\\n\r\nSound: 9/10\\n\\n\r\nSoundtracks fit each scene, funny or serious. The OP is very catchy, fitting the comedy aspect and so does the ED, but not as catchy.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nHata Kousaku, a hardworking student who is the biggest fan of Yuka Kusakabe. But, he's the idiot of the anime, which can be hilarious.\\n\\n\r\nKinoshita Ringo, or her past-self, Yuka Kusakabe is a very quiet girl. The first impression I had on her when I saw the cover photo, is that she would be a cheerful yet the klutz-type girl. \\n\\n\r\nKamatori Kei, a knowledgeable student, who excels in agriculture, also very hardworking.\\n\\n\r\nNakazawa Minori, Kousaku's childhood friend. Short hair, massive boobs (or she's fat) and very cheerful. Also, I realised that everytime there's a childhood friend in an anime, that girl would have a crush on her childhood friend. \\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nThis anime is very funny, but not for someone who's first time watching anime. It has some ecchi scenes, like Ms Becky rubbing oil on her. That picture gave me an impression that this might be some kind of hentai, but I was wrong. Would I re-watch? Definitely, in the future when I'm bored.\\n\\n\r\nOverall: 9/10\\n\\n\r\nIf you're looking for a comedy title, then this anime is for you.",
            "date": "2015-01-27T21:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 179097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=179097"
        },
        {
            "content": "This show deals with a uncommon topic: rural life. More specifically, the farmer's life. This is very cool, because you don't expect this subject to be dealt with in a romantic comedy. On the other hand, It's not a great show in general terms. \r\nStory/Idea (7/10) \r\nThe story is the best one in this series. I already said that the subject is uncommon. Well, It does not delve much on the aspects of a farmer's life, but when it does, it does it very well. The way in which some things are explained is funny and lighthearted, without too many complex details.\r\nOn the other hand,the series is about a love triangle (and a weird love triangle at that), between the protagonist named Kousaku, the idol whom the protagonist loves named Ringo and the protagonist's childhood friend named Minori. The romantic interest of the protagonist is evident. At the start of the series, Kousaku doesn't show any interest in the advances of his friend. Throughout the story he shows his love to Ringo, but even so he can't make a decision at the end. Well... I couldn't expect anything else from a typical story about a love triangle, but even so... \\n\r\nThe other important aspect is the comedy. Most of the show is comedy… clichéd comedy. The sexual jokes are very frequent and some-times there's meta-jokes about this. I didn't like the most of the comedy in this show, it was very stereotypical.\\n\\n\r\nArt/Style/Animation (7/10) \\n\r\nIt's not bad, but it's not good either. The characters have an interesting style, I really liked their eyes. But at times the elements of their bodies were very artificial, as if they were in the wrong place. The design of some characters is made by fanservice and this is not bad for a show in this genre.\\n\r\nThe backgrounds and the settings are beautiful. Mainly the panoramics scenes.\\n\\n\\n\r\nSound (6/10) \\n\r\nIt's not very good, but good enough (or efficient, maybe). The opening and endings are not the greatest thing, but are funny and nice to listen to.\\n\\n\r\nCharacters (6/10) \\n\r\nThe characters have the common tropes for this kind of stories. Their personalities don't stand out. Even so, the main character has excellent moments where they really do a good job developing his personality.\\n\r\nA similar thing happens with Ringo. This character is the most developed, although his role in the love triangle is a little forced.\\n\\n\r\nEnjoyment (6/10) \\n\r\nIn some chapters you want to drop it, but in some others you'll have fun. It's a show that's hard to enjoy, but it's not a bad show at all. Some chapters will surprise you.\\n\\n\r\nOverall (6/10) \\n\r\nA common show with a uncommon subject. If this show had a different setting, I would not recommend watching it. But the rural and farming setting is a good subject to explore.\\n\r\nWatch it and form your own opinion.",
            "date": "2015-08-02T16:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 195012,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634639.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZizRenanim",
                "username": "ZizRenanim"
            },
            "url": "https://myanimelist.net/reviews.php?id=195012"
        },
        {
            "content": "Nourin , at first when I've read the description of this anime , it didn't appeal me that much.\r\nI mean c'mon? Farming? \r\nBut I decided to give a try ,\r\nIt has a really good art style and I personally think the art style saved this anime.\r\nThe main character had a annoying voice and hairstyle .\r\nI liked the fact another guy had a crush on him, I think the voice of kei was hot and I liked his borat swimsuit haha.\r\nI cheer for Minori , I yearn to have a childhood friend like her wich is truly devoted onto \r\nHer crush.\r\nIt could appeal anyone wich hasgreen fingers though I doubt they ever watch this . \\n\r\nBUT! It was intresting to watch till the end.\\n\\n\r\nI only gonna give 6/10 on this one because \\n\r\nIt had many cliches and I didn't like the ending.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-02-23T07:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 211533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5217982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hadoke",
                "username": "Hadoke"
            },
            "url": "https://myanimelist.net/reviews.php?id=211533"
        },
        {
            "content": "NO SPOILERS\r\nStory(7) Nourin's story is quite weird in some parts: often very funny but sometimes it become serious and surely too serious. It's like you're watching an other anime in these parts. Excepted that, the story is bit disappointing in its proceedings. \r\nArt(9) Very colorful, Nourin has also a clean line and a fluid animation. There is nothing to reproach to the animation. The chara-design is funny too!\r\nSound(8) The opening and the ending respect and suit perfectly with the atmosphere of idol music. Enjoyable and dynamic is the OST of this anime.\r\nCharacter(7) Like the story, characters evolve in a strange way. Very dynamic and happy,they become much more serious and deep, but it doesn't fit with the anime: it's a comedy!\\n\\n\r\nEnjoyment and Overall(7,5) Strangely evolving characters, like the story, in a colorful place and idol music in the background, this is Nourin. Pleasurable but it's a difficult question about recommending it.",
            "date": "2015-08-31T02:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 197543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4727447.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/EpicWapanese",
                "username": "EpicWapanese"
            },
            "url": "https://myanimelist.net/reviews.php?id=197543"
        },
        {
            "content": "You know, reader, in the 7 years I've watched anime I've seen quite a few shows. Thinking back on what I've watched I can only remember so many specifically, in fact a lot of shows I just straight up forget about. \r\nNourin is the latest edition on that non-existent list. \r\nLet's see if we can't find out why.\r\nIf you look at the tags on your left you'll notice it's an ecchi rom-com in a high school setting. Sound familiar? It's one of \"those\" shows, the one's that'd be mass produced on a conveyor belt if it were any other type of product. I'll give creditwhere it's due and at least acknowledge that they tried to do something differently by setting the show in an agricultural school, which basically means our characters tend to crops instead of filling out tests.\\n\r\nOther than that, well, you probably know how this song and dance goes: transfer student -> meet characters -> filler filler filler -> obligatory beach episode -> filler filler -> end\\n\r\nI'd get into more details but I've already forgotten most of what the hell was going on in this show about 40 minutes after watching it. \\n\\n\r\nThe issue isn't that it's just another high school romance, it's that nothing happens for 11 episodes. I honestly can't remember the last time I've been this bored. I literally dropped this show 4 times before finally thinking \"screw it, might as well finish it\" It's impressive, really.\\n\r\nYou could just watch the first and last episodes of this show and get the same story I did. You'd probably even have a better experience since you didn't just waste around 5 hours of your day on a show you won't remember tomorrow. Actually, you know what? Skip that last episode and just go straight for the beach ep instead (episode 9 btw), the status quo is reset at the end anyway. \\n\\n\r\nThe characters in this show are something else you'll probably immediately recognize, you've got:\\n\\n\r\nKousaku - The dense MC who's really good at what he does for no reason.\\n\r\nKei - The support character who's really smart and wears glasses. \\n\r\nMinori - The childhood friend character who's obviously in love with our MC.\\n\r\nRingo - The kuudere transfer student who takes an interest in our MC to create a love triangle.\\n\r\nOh, we also have:\\n\r\nTorao - The tomboyish one\\n\r\nKochou - The princess-hime type with big boobs.\\n\\n\r\nDid I mention there's a \"top x\" at the highschool? \\n\\n\r\nWe even have a comedic pet Wakadonna. Good for us.\\n\\n\r\nThe art/animation of this show is the only positive thing I could bring up about it. Animations are smooth, the art is consistent and colourful, even if the designs themselves are about as stock as you can legally get away with. The sound? Standard at best, no background tracks that stand out. I'll at least mention the cringeworthy opening music, couldn't even listen to that once, and this is coming from a guy who unironically listens to vocaloid.\\n\\n\r\nThis show really is completely unremarkable in every possible way. The characters are bland and one dimensional, there's virtually no story to speak of, the music isn't memorable and the animation is slightly above average. This is that one high school rom-com that's released on mass every single season. I almost feel bad for paying attention to it by writing a review, but maybe I can at least save some hours of your time if I can't get mine back.\\n\\n\r\nTL;DR: Don't watch this show unless you desperately need to be as bored as possible.\\n\\n\\n",
            "date": "2016-09-16T14:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 229150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2440981.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/notraven",
                "username": "notraven"
            },
            "url": "https://myanimelist.net/reviews.php?id=229150"
        }
    ],
    [
        {
            "content": "Overall, the series was enjoyable and had it's funny moments, but I feel like Ringo's character could have been developed a bit more. Can't say I hated her character, but I feel like she was a bit too shy. If perhaps the story evolved a bit more around her, and how she develops her character then it could have made the series even better. But overall, the setting, and all the characters put together, as well as the storyline was well developed and had it's funny moments. Therefore, I can't say that I don't recommend it if you want to have a bit of alaugh.",
            "date": "2018-04-09T05:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 277518,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6178075.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hime-han",
                "username": "Hime-han"
            },
            "url": "https://myanimelist.net/reviews.php?id=277518"
        },
        {
            "content": "I may receive a lot of hate for rating so high, but tbh, I don't really care. I watched this show with no expectations, just wanting something fun, and honestly, it delivered. It checked all the boxes that I wantd checked, and much more.\r\nIt's nothing brainwrecking. It's not phenomenal. You don't learn anything worldchanging.  It's kinda stupid, actually. But it's just pure enjoyment and laughter, simple as that. So if I were to rate actual \"quality\" of the show, I would give a 6-7, but I rate according to my enjoyment and yes, I enjoyed this anime a lot.\r\nAlso I really love the artstyle.",
            "date": "2017-10-20T11:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 261253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4529868.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ArinaChan",
                "username": "ArinaChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=261253"
        },
        {
            "content": "This is my first time writing a review for an anime. \r\nI am writing this review just to make it clear this anime screams baka and test because the jokes are hilarious, they are just to convincing that this anime resembles baka and test a lot.\r\nBoth animes \"Baka and Test\" and \"Nourin\" are made in same studio \"silver link\" so there are some similarities. \r\nArt:\r\nThis anime has the perfect art for its story. I am no expert but I can say this for sure that its better than any other romance/comedy anime.\r\nSound:\r\nThe music and the sounds in this anime is good and it amusing notlike other comedy anime which are annoying at some times. \\n\\n\r\ncharacter design:\\n\\n\r\nThe characters in this anime are very amusing and i laughed every time they make expressions on jokes.\\n\\n\r\noverall this anime is in my favorite list and i enjoyed it very much.\\n\\n\\n\\n",
            "date": "2016-01-09T12:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 208141,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894811.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RolandThsive",
                "username": "RolandThsive"
            },
            "url": "https://myanimelist.net/reviews.php?id=208141"
        },
        {
            "content": "So for anyone who come here for a review of anime before watching it please take a few minutes to look my review.It wont be long as i would not waste any second of yours to watch this wonderful anime. Dont really depend on the tags cause it is not really towards a romance plot like most shoujo manga and dont bother about the rating as it is only 7. So this story is mainly about friendship,hardship and love but it focused more on jokes,yep i mean 'dirty jokes',so if your the kind of person who like comedy anime this is a must for youor even u feel like to watch any random anime u found this is also a must, u will get addicted after the first 2 episodes.I would not spoil any more further,so i will just give a briefing about this worthy anime. Ps: <only continue to read from this point ownwards if u are interested in the following review of mine about this spectacular anime.> Peace>.<\\n\\n\r\nIt starts around the main character Kousaku who obssed with this idol named Ringo. Eventually as u can guess as anime lover,yep this idol has transferred to the school where kousaku study. So his school is an agricultural school. (Its way different than other anime as u hardly can find anime related to crops and plants). The story spins around between Kousaku and Ringo and not to forget everyone favourite character in romance anime,osananajimi of kousaku,Minori in their daily school life. Not to forget about the ally following the main character which plays an important role as best friend to boost up the quality of main protagonist,Kei. Besides it has the best jokes i ever encountered in anime,consist of adult jokes but not to over, like BL jokes,yuri style,ecchi or ero style.Even though its about daily life, the concept of this anime is still strong along the series where it did not neglect the romance part between 3 of them and the so called ally or sidekick has its own small romance part too. (Did a great job in here of not neglecting sidekick). So this would be a little part of review in the plot of it.\\n\\n\r\nSo about the character characteristic is great, has optimistic which is suitable for this anime and tsundere part which is quite sweet (You will know what i mean when you are watching it).The animation is not that good but it has all the types of characters your looking for like big oppai,flat ones,loli style, white knight style....For the music part,it is probably the best moe song I ever heard of,and yes it is sang by Yukarin and ending is duo between Kana Hanazawa and yukarin,so for the best combo for moe singers.\\n\\n\r\nFinal opinion of mine,don't get caught up with the poster as the female idol is not the major in this anime,i don't get it too why she has the biggest focus on it maybe due to the name of it. If you are the kind more to the guy side as major in romance,u should have not wasting few minutes on looking my pathetic review and start watching this series that will blow your head~",
            "date": "2016-03-01T08:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 212025,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4936624.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/derenceong",
                "username": "derenceong"
            },
            "url": "https://myanimelist.net/reviews.php?id=212025"
        },
        {
            "content": "Nourin was one of those anime's that I hesitated over before starting it. It was a new concept for me to watch about something so down-to-earth and as mundane as farming, and I didn't know what to expect. \r\nStory:\r\n If anyone has ever been to the very rural countryside and have lived there for even a short while, one can appreciate the level of accuracy with which Nourin portrays farm life. However, the point is to relate to the characters themselves and not the external environment of which they live and work. \r\nThe first few episodes, I thought, were funny in their own ways, butsoon trails off into exploring a deeper level of problems for the characters. Many cliches are repeated, overused jokes are used, and the viewer is only able to gain an obscure perspective of each character.\\n\\n\r\nArt:\\n\r\n Standard art, I felt nothing really stood out.\\n\\n\r\nSound: \\n\r\n Sound felt a tiny bit drowned out by the conversations, but all good. Nothing horrendous to mention, but nothing great either. The very first song was catchy at least. \\n\\n\r\nCharacter: \\n\r\n Here is where the crux of the problem lies. For me, at least. There just isn't enough development to keep me interested in any particular character. Sure, mention a sad background story for a character. Introduce an antagonist to rally against. It doesn't stick permanently, and I say this with the up-most respect. By the end, I lost a clear view of what the characters were trying to ultimately pursue, what their relations were to each other, and how they truly felt about each other. \\n\\n\r\nI won't deny that I chuckled a few times, but I also won't say that I wasn't frustrated many times. And, to be completely honest, even a small amount of frustration isn't all that worth it, especially if it's for entertainment. \\n\\n\r\nWatch it if you have a lot of free time, but other than that, you probably should keep this one on the wait list. \\n\\n\r\nUnless you love farming.\\n\r\nThen it's okay.\\n\\n\r\n6/10 - Fair\\n\\n",
            "date": "2014-04-14T18:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 139949,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3702761.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnExtra",
                "username": "AnExtra"
            },
            "url": "https://myanimelist.net/reviews.php?id=139949"
        },
        {
            "content": "NOURIN\r\nIf you're expecting a romance, don't watch Nourin. If your're expecting a drama, don't watch Nourin. If you're expecting a comedy, be prepared to be blown away.\r\nPROS\r\nWithout a single doubt, Nourin's best attribute is its comedy. Every single episode had me laughing at some point of it's just so refreshing to see an anime pushing the boundaries, using your usual light jokes, black humour and plenty of adult ones too.\r\nCONS \r\nNourin tries to include romance, I feel this was mostly done to move the plot along, I never found myself hating the fact that the romance lacked impact, because Nourin is a comedy first, somethingi really enjoyed seeing. So although yes the romance is lack luster, the blame can't all be on Nourin.\\n\\n\r\nShould you watch?\\n\r\nIf you are into comedy then yes. Nourin has some class leading comedy in it. Even though its romance and drama falls short of even average, that's absolutely okay because Nourin always puts its comedy before its romance.",
            "date": "2017-07-14T18:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 252874,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/reviewtime",
                "username": "reviewtime"
            },
            "url": "https://myanimelist.net/reviews.php?id=252874"
        },
        {
            "content": "I'm just going to say, \"this anime is really underrated.\" However, you kind of have to dive into the culture of anime to understand these jokes. From my own experience, when I was a freshman in college, I saw this show for the first time. \r\n(Minor Spoilage)\r\n(Story 5)  The opening was very artistic, but I thought the rest of the entire show was suppose to be the quality of the opening (similar to the opening of Oreshura). As the story progressed - I felt as though I was being mislead. The story began to turn into something awkward that I wasn't used to yet;I decided to turn it off. \\n\r\nA year had passed, and I decided to play the dub on vrv.co. I started to giggle after the first two episodes. On the 5th episode I couldn't stop laughing for the full 22 minutes. This show was hilarious, and it made me sad that I didn't try looking for the dub for two reasons. I felt robbed of my time after the opening, and I didn't enjoy being a weeb4life yet. \\n\\n\r\n(Art 10) The art does not bother me at all. It was very pleasing and fluid\\n\\n\r\n(Sound 7) The OP and ED are great and colorful. The style of music plays well into the comedy themed show. The overall OST isn't very impressive though. I've only seen clips of the sub, but the dub and sub seem pretty equal on presenting the script. \\n\\n\r\n(character 8) I don't hate any of the characters because most of them do something outrageously funny. However, most of the characters are very cheap, but you have to realize that the show is a comedy. \\n\\n\r\n(Enjoyment 10) Like I said, I couldn't stop laughing for the full 22 minutes on episode 5. \\n\\n\r\n(Overall 8) I'm still on episode 5, but  I trust that I will be rewarded with laughter as I continue the story. It's fun to watch while I'm working on projects. I definitely want to remember that I watched this kind of show for humor. \\n\\n\r\nP.S. I'm actually obsessing over this anime because Ringo's voice actress, Jad Saxton, plays as Mary from Grimgar, Ashes, and Illusions.",
            "date": "2017-06-24T16:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 250906,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/winterwyvern",
                "username": "winterwyvern"
            },
            "url": "https://myanimelist.net/reviews.php?id=250906"
        },
        {
            "content": "I don't know why this series has such a low rating, it is funny,art is good and has little fan service and its about agriculture and their daily life but you have to give this show a credit, cause it is rated farless than what it deserves and better than some silly cliche anime which are above than this ,i wrote a review for the very first time because it felt bad for such a good anime to have such a low score\r\n    .\r\n.\r\n.This anime is about a group of students in an agricultural school. Kousaku is a big fan of thisidol named Yuka. One day, this idol decided to give up her bright career and simply vanish. She ended up being the new transfer student in Kousaku’s class, but something is different. She isn’t the peppy idol she comes off in TV. In fact, she’s a kuudere and she now joins this eccentric cast doing farm chores and having fun in the process.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\n.\\n\r\ncause they asked for a longer review anyway thanks for reading",
            "date": "2017-05-24T15:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 248454,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/saqlain001",
                "username": "saqlain001"
            },
            "url": "https://myanimelist.net/reviews.php?id=248454"
        },
        {
            "content": "This is one of my most deared anime's and I get the jokes that they are saying and portraying. This is about a fanboy who likes an idol star from Tokyo named Yuka Kusatabe who changed her name to Ringo Kinoshita(Find this out in episode 1) then the real funny story begins. This is a farming anime this helped me with my agriculture test in school. This is a ecchi harem story with romance and little farming. But its an enjoyable story if you like statire to the otaku culture then you will like this. Kosaku is one of my most relatable characters ever. Ifyou like love triangles such as Nisekoi and Love Hina you will like this. Be warned there is sexualization of woman and suggestive content TV-MA. Overall good and well worth the 12 episodes!",
            "date": "2016-12-23T15:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 236278,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ZaizenMorishima1",
                "username": "ZaizenMorishima1"
            },
            "url": "https://myanimelist.net/reviews.php?id=236278"
        },
        {
            "content": "This one gets a quick review because there isn't a ton to say. Not a whole lot happens, characters do not develop much at all and the story ends without accomplishing anything. \r\nOne thing I will say that made this above an average anime was that it was funny. If you ever wanted to hear a TON of sexual jokes centered around farming and see a kawaii teacher who can't find a man hit on her students and ooze desperation and negative energy you will enjoy it. The best episode is the one where he talks about it being just another average day and itis all sorts of crazy stuff that happens that makes me die laughing. It isn't bad for a comedy but the other elements are sorely lacking and the tropes are too strong.\\n\\n\r\nStory 5/10 Art 8/10 Sound 7/10 Character 5/10 Enjoyment 6/10 Overall 6/10",
            "date": "2016-07-28T19:15:00+00:00",
            "helpful_count": 0,
            "mal_id": 225291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=225291"
        }
    ]
]