[
    [
        {
            "content": "Fall 2016 was meant to be a pretty stellar season for sports anime, and I for one was incredibly hyped for it. And I definitely wasn’t disappointed with it as a whole. The third season of Haikyuu!! proved to be just as good as the first two, and Yuri on Ice!!! made itself out to be an unexpectedly thrilling series. However, I can’t say the same about All Out!!. It was the Fall 2016 anime I was most looking forward to – after all, rugby is basically just men in tight shorts violently glomping each other. It should have been perfect. So what went wrong?Well, everything about All Out!! can be summed up in one word: lazy. \\n\\n\r\nMadhouse has produced some stellar anime in the past (Death Note, One Punch Man, Parasyte), and I guess they used up all their effort creating them, leaving absolutely none left for what could have been a brilliant sports anime. \\n\r\nFirstly, and most disappointingly, the animation is some of the shoddiest and least dynamic I’ve ever seen in any anime, let alone a sports anime, where movement and energy is a key factor. There is literally nothing going on in the majority of the scenes in any given episode, and this becomes most apparent in the match in episode 3 (or 4? It’s probably bad that I can’t remember…). The whole pitch seems to be covered up with this bright white fog of war, so the animators don’t have to animate anybody but the character(s) at the forefront of the scene. The scrums, one of the most exciting and homoerotic parts of rugby, are still frames with lines drawn on them to express movement. Even the ball looks bad, as somebody thought it was a good idea to animate it in CGI, making it look awkward and out of place next to the hand-drawn everything else. Everything about the animation is lazy, and makes the anime as a whole incredibly dull. I guess that’s why they made all the colours so saturated, to try and make up for it…\\n\\n\r\nThe character designs also make me want to rip my eyes out. They looked pretty decent in the manga, nothing special but still fairly nice looking, but I guess this didn’t translate as well into the anime as everybody looks like a Dangan Ronpa reject. This would be (a bit more) fine if this anime wasn’t trying to be realistic. When have you ever seen a kid with hair in the shape of devil horns? The stupid hairstyles and face shapes only serve to try and differentiate the characters from each other, as none of them have any personality. Even the main characters, who should be walking stereotypes (does a comedy, shippable duo made up of a tall, experienced guy and a short, angry, more energetic and DETERMINED guy sound familiar..?), don’t even have enough character development to be stereotypes. All sports anime have essentially the same plot – underdog team wants to get to nationals and win, so the audience has to be kept entertained by the characters and their journey and development from losers to winners. All Out!! is unable to do that. There isn’t even enough shipping potential to make it watchable, and what potentially yaoi moments there are are so forced (eg. when the Robbie Rotten looking dude straddled the captain man and professed his love for something or other of his) that it’s just offputting. \\n\\n\r\nOther, more minor irritations of mine about this anime are the absolutely inappropriate and generic choices of background music (half of it sounds like it was ripped directly from a comedy ecchi, the other half is generic rock guitar), everyone’s eyelashes (they look like they have spiders on their eyes) and the skintight sports kits (seriously, clothes do not work like that. Another example of laziness). I’m only continuing to watch this anime to make my past self happy, my sweet, deluded past self who didn’t know how terrible this would be. It’s the definition of a disappointment.\\n",
            "date": "2016-11-12T10:25:00+00:00",
            "helpful_count": 67,
            "mal_id": 233641,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5112502.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/thememequeen",
                "username": "thememequeen"
            },
            "url": "https://myanimelist.net/reviews.php?id=233641"
        },
        {
            "content": "With the rise in popularity of sports anime in the recent years, a lot of shows about different types of sports have been appearing on the last decade, from volleyball and swimming to ping-pong and ice skating. However, All Out!! is the first anime to deal with rugby, a rough sport which has been on the rise in Japan these last couple of years.\r\nHaving grown up in a house with three brothers who play rugby and a father who played on his youth, I have a basic knowledge of this sport, which was what drew me towards this anime in the first place. And I'mglad i decided to check it out tbh, because it was an amazing watch.\\n\\n\r\nStory: 8/10\\n\\n\r\nNow, let me get one thing clear. The story isn't something extremely wild or out of the box that hasn't been seen before. You have two protagonists who join their high school's rugby team, and the teammates start interacting and becoming friends as they train to reach their ultimate goal: winning the Hanazono, the biggest high school rigby competition.\\n\\n\r\nHaving said that, however, I have to admit that even though the plot isn't the most original, it was entertaining enough to keep me watching. The characters were likeable and the cast had good chemistry, which was a huge plus in my book. Also, the story does get really intense at times, just like a rugby match can get at certain points, and at times it gives you a breath by having the characters take a break from training (and using that time to delve into their backgrounds and develop them) so it doesn't get too intense.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nIn my opinion, the characters were one of the strongest points of the anime. The main reason why I think this is that they were the main reason why I kept coming back for more; if the characters were unlikeable, I probably would've dropped this after like five episodes.\\n\\n\r\nWhile it looks like the protagonists are Gion and Iwashimizu, the truth is that All Out!! is an ensemble show; the anime also gives a lot of focus to Sekizan, Oharano and coach Komori, as well as the rest of their supporting cast. And it does have a really large supporting cast; yet it manages to balance them well and the character interaction are always interesting and fun to watch.\\n\\n\r\nI felt like the majority of the cast was pretty memorable and very enjoyable to watch. It was easy to root for Gion or Sekizan to win because they were just that likeable. And I was surprised with how it manages to develop their characters with only 25 episodes; not only with Gion, Mutsumi or Iwashimizu, but even supporting characters such as Ise, Kifune or Suwa get their time to shine as well… just like in rugby, where not only one player gets to shine, but all 15 of them get their moments of glory.\\n\\n\r\nArt & Animation: 9/10\\n\\n\r\nI personally think that the art can be the most subjective aspect of an anime. I found the art really cool, and beautifully animated; as usual, Madhouse does not disappoint in this aspect. The character designs seemed pretty unique, making it easy to identify which character was which by having certain characteristics that simply made it obvious; you have three blonde characters in Iwashimizu, Oharano and Ebumi, but it wasn't hard to remember who each one of them were despite their initial similarities.\\n\\n\r\nThe most outstanding bits of animation that I want to point out, however, is when the action is happening. I was worried about how they were going to animate the rugby matches, but again I was pleasantly surprised; the animation of the matches was fantastic and really dynamic, which was needed for a game as dynamic as rugby.\\n\\n\r\nSound: 10/10\\n\\n\r\nLet me just say this: the soundtrack for this show is AMAZING. It's mainly composed of rock songs that really fit the series, and when they play it in the background during rugby matches or training scenes (specially when they're about to start) it really gives you the sensation that you're feeling the same excitement that the characters are feeling when they're getting ready to go out there and give it their all.\\n\\n\r\nAt the same time, there are some tracks that have a more soft and smooth vibe to them, and that play during less intense scenes. Those are just as memorable, specially the first ending… and while we're at it, the first opening is fantastic. The second one was good too imo, but the first opening, \"Flower\" by Lenny Code Fiction is thrilling; haven't heard such a fantastic op since SnK's \"Guren no Yumiya\".\\n\\n\\n\r\nOverall: 10/10\\n\\n\r\nNow, I'm the kind of gal who  mostly rates her animes out of the enjoyment that I get out of watching them. If it's boring or a chore to watch, it won't get a high score overall… and this was far from the case. It was enjoyable, and a really fun watch!\\n\\n\r\nBefore I end, I just want to say that you don't need a background knowledge of rugby to watch this; because Gion is new to rugby, he serves as a way to introduce the sports and its' many rules to the viewer, so you'll have characters such as Iwashimizu and Umeno teaching you a bit about the sport. \\n\\n\r\nSo, to sum up… give this show a chance! Thank you for your time :)\\n\\n\\n",
            "date": "2017-04-03T06:25:00+00:00",
            "helpful_count": 43,
            "mal_id": 244489,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1234325.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dawnangel14",
                "username": "dawnangel14"
            },
            "url": "https://myanimelist.net/reviews.php?id=244489"
        },
        {
            "content": "Putting the exaggerated art aside (even though it's charming in it's own way and grew on me), rather than playing and winning rugby matches, perhaps All Out is about personal development and team building (at this point, at least)... together, they want to get stronger. \r\nI do appreciate the fact that All Out doesn't put all focus on the main character, Gion, but also hints on backstories on individual team members and how that affects team dynamics and growth. Also, there's no one super strong team member, just players with their own strengths and own internal battles that game by game they seem to getbetter at overcoming and show us what they've got.  It's a slow build up, but it's happening. \\n\\n\r\nOne more thing I like is that Gion being new at playing rugby is just about clueless about everything... HOWEVER, for people who don't know the rules of rugby (like myself), Gion serves as that bridge since I can learn the game through his eyes. So far (ep. 9) he has improved, partially because he's the naturally wild and aggressive type but he still has ways to go and he knows this and therefore strives to get better. What I also like about Gion is how unexpectedly observant he is... not just about watching the game but how his teammates play and their mood as well. \\n\\n\r\nAll Out is not perfect but it has this thing about it that makes you want to cheer for the team... so even if like me, you don't understand the rules, then perhaps you'll enjoy watching the characters grow and eventually you'll get into the game. Now, I know when they score a 'Try' lol  \\n\\n\r\nMy one minor bone (which is laughable) is that they use a soundtrack that sounds like one regularly used in Naruto, so each time I hear it, my mind shifts to Naruto with shinobi training and flying through trees lol \\n\\n\r\nAnyway, give it a try!",
            "date": "2016-12-02T08:35:00+00:00",
            "helpful_count": 36,
            "mal_id": 234749,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2829547.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/greenroses",
                "username": "greenroses"
            },
            "url": "https://myanimelist.net/reviews.php?id=234749"
        },
        {
            "content": "I have been looking forward to All Out!! for months and so far it doesn't disappoint. First of all, if you are not a fan of sports anime then you will probably not enjoy it, so be warned. I am, however, and All Out!! is ticking all the right boxes for me. In the first episode a short, feisty character, Gion, meets a tall, shy, character, Iwashimizu, and gets introduced to the world of rugby. As the story progresses Gion meets the rest of the team, amongst them the captain, Sekizan, who seems to take rugby very seriously and looks a little scary.\r\nThe story isnot really original, as it seems to be a typical-newcomer-finds-out-about-a-sport-and-joins-a-team plot, but that's not why fans love sports anime: Fans love sports anime because there are awesome characters, great action and lots of humour. Judging by the first few episodes, All Out!! delivers on all three counts. \\n\\n\r\nIf you don't know anything about rugby, don't worry. Like many other sports animes, in All Out!! you are introduced to rugby through the eyes of a newcomer (Gion) who has to learn all the rules, allowing the viewer to learn about rugby as well. \\n\\n\r\nI gave Characters and Enjoyment 9 for Great and Art got 8 for Very Good (especially if you like muscles). Story I rated 7 (not really original and a little predictable, especially if you have seen a lot of sports anime) but I enjoyed the Sound, especially all the heavy rock tracks so I rated it 8 for Very Good. Overall I rated All Out!! an 8, but I might change it to a 9 later, especially if the story gets any better once the big championship starts. \\n\\n\r\nBasically, so far All Out!! is everything you want a sports anime to be. Hope you will enjoy it as much as I am!\\n",
            "date": "2016-11-10T23:45:00+00:00",
            "helpful_count": 37,
            "mal_id": 233557,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283651.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dreampanther",
                "username": "Dreampanther"
            },
            "url": "https://myanimelist.net/reviews.php?id=233557"
        },
        {
            "content": "All Out is a very mediocre anime and a bad sports anime.\r\nIf you want to watch this because it's a sports anime, don't bother, but if Rugby is the only premise that is strong enough for you to keep watching, then go for it. That was why i initially started watching.\r\nAll Out isn't your typical anime. In itself, it's rather mediocre. It has characters, animation, music and voice acting, but besides that, not a whole lot to write home about.\r\nThe story is as generic you can get away with in a sports anime. The main character begins in high school and wants to join therugby team. He isn't very good at rugby and he is physically not very strong or tall, but through training he very slowly gets better.\\n\\n\r\nThe composition of a normal sports anime starts with the main character playing against other teams in training matches, so he (and the viewer) can be taught the rules of the game, what roles there is on the team and who his new team members are and what they are like. The problem with All Out is that it jumps back and forth between in the composition and even skips some of it.\\n\\n\r\nThere is no sense of progression of the story in All Out. They keep talking about how they want to go to Hanazono (which is where the high schools compete against each other in a tournament) and how they want to go \"all out\" but they didn't even reach the starting line. They don't play any qualification matches in order to get to Hanazono. They just keep playing training matches on an empty field, with no spectators apart from the 2 teams that are playing.\\n\\n\r\nMadhouse. The name alone has set a standard for the level of animation you can expect. Hunter x Hunter (2011), One Punch Man, Death Parade. All well-known shows with great animation and a fantastic sense of artistic direction. Seeing that Madhouse was making All Out was a reason in itself to watch it. (Spoiler, it wasn't..)\\n\\n\r\nWhat we got was a lot of still frames with speed lines dashing on either sides of the screen, few frames of animation with a zoom and a pan over to the person who was catching the spinning ball and a few panning shots that ends with someone stepping forward.\\n\r\nJust look at the first opening if you don't know what i'm talking about. A 20 second slow pan towards the sky with \"ALL OUT\" written in all capital letters.\\n\\n\r\nThe soundtrack is very poor, meaning that there is very little variation. Music is the ultimate mood setter or mood killer, depending on how you use it. But in order to use it properly, you need a repertoire of music that can fit a wide range of moods and themes. All Out doesn't go \"all out\" on this.\\n\\n\r\nThere is no memorable tracks in the show. That is not entirely true. There is maybe 2 or 3 memorable tracks, but they're only memorable because I've heard them so many times throughout the series that it drives me crazy.\\n\\n\r\nThere's the track that starts with the guitar, which is shortly after accompanied with the drums and then the bass. That music is used when they train (Which is 70% of the show). Then there's the track where the team gets the ball and the track for when they're goofing off and being high school kids.\\n\r\nThere is shockingly little variety.\\n\\n\r\nRemember when i talked about the composition of a typical sports anime? That also applies to the characters. There has to be a generic base level where a character can be build and then later be expanded upon with personality, so you have a unique and interesting character.\\n\r\nGuess what All Out doesn't do.\\n\\n\r\nSome of the characters are purely identified by 2 things. How they look and what generic type of character they are.\\n\\n\r\nThere's the aggressive guy with spiky hair, who thinks the entire team is holding him back. Then there's the \"kinda happy\" guy with hair shaped like 2 small horns. Then there's the manager who is a girl. There is also 3 really fat dudes, who has very similar personalities. So the only way to distinguish them was to do make their faces different.\\n\r\nOne has weird eyebrows, another has really floppy chins that constantly points upwards and then there's the third fat guy who has a headband and likes to verbally remind everyone that he really ate a lot and that he reeeeealy likes food a whooooooooooooooole lot!\\n\\n\r\nTo give the show credit, there were some unexpected developments with the characters in a good way. One had an abusive brother, another one completely lost all motivation to continue playing rugby, but didn't want to quit in fear of letting his teammates down. But once those developments were brought up, they were dealt with in half an episode and then never mentioned again.\\n\\n\r\nI honestly don't know why i enjoyed the show as much as i did. I was considering dropping it but then episode 9 came along and changed my mind. Then after the hype had died down i was about to drop it one more time, but once again, a really good episode comes on and i just had to find out what happened next episode.\\n\\n\r\nThere were something oddly interesting about the show. The second opening really grew on me. The coach really seemed like a monotone guy, but it turned out that he had a good and relatable reason to be their coach.\\n\\n\r\nOverall, the show grew on me. I was interested in seeing how far the boys could go and how they would develop throughout the story.\\n\\n\r\nToo bad that neither the character nor the story got that development.",
            "date": "2017-03-31T12:40:00+00:00",
            "helpful_count": 28,
            "mal_id": 244153,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3317453.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Millawls",
                "username": "Millawls"
            },
            "url": "https://myanimelist.net/reviews.php?id=244153"
        },
        {
            "content": "Having this anime end, it made me realize how much I appreciate this anime  for having been animated during a season with mediocre anime. \r\nI totally recommend this anime for anyone who like character development, team development, a good amount of sports explanation and a lot of realistic aspect to a high school sports club. This is not a Prince of Tennis or Kuroko no Basket type of simple surreal anime that has one main character and leaves everyone to shit behind with no background development whatsoever. This anime has full great individual character development for each and everyone in the team. By theend you appreciate the team as a whole rather than having only one good character. \\n\r\nThe animation was consistent, it did have a few mehs but overall MadHouse did a great job animating. The opening/ending songs weren't the most memorable but they definitely make you feel happy once you listen to them a few times.\\n\r\nHonestly if you like sports anime but feel turned-off by how slow the \"action\" is then rather than taking it as your \"main stream\" style sports-anime you should approach it as a rather slice-of-life-sports-anime. Honestly its such a great anime and I definitely hope theres a season two where we actually get into big tournaments and so on.",
            "date": "2017-04-02T02:45:00+00:00",
            "helpful_count": 18,
            "mal_id": 244315,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5684670.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ken-K",
                "username": "Ken-K"
            },
            "url": "https://myanimelist.net/reviews.php?id=244315"
        },
        {
            "content": "I was really glad when there was another sports anime that was completed. I've been binge watching sports anime since last month. I have watched Eyeshield 21 before which kind of has the same game play but since that was football and this is rugby, there's a difference. \r\nI am really choosy with the animation but this one is good and unique. High school students with bulky muscles isn't that common but it kind of made the anime intense. They sometimes have awkward and gay poses which made me laugh my ass off but I did enjoy it. \r\nHowever, the anime had a lot offlashbacks that I think didn't really matter. It makes most out of the episode instead of a game play with strong schools or training. I remember a flashback of a player from another team which kind of confused me because I didn't really care with the other players. Also, the protagonist wasn't given more focus than I am expecting. I was expecting more focus on Gion and how he evolves and learn more about Rugby. Well, that's actually what I am expecting from a sports anime - starting from the beginning when the protagonist joins the team, how he learns more about the sport, how he evolves and improves in playing. \\n\\n\r\nBut, I managed to finish the anime and that only means one thing - I enjoyed it. I am looking forward to Season 2, if there's one which I probably think there will be but maybe aired for about a year or so. \\n\\n\r\nAfter saying all of that, I can say it deserves a chance to be recommended. Well, this is actually the first time commenting on an anime here on MAL so it really is good.",
            "date": "2017-04-02T19:20:00+00:00",
            "helpful_count": 15,
            "mal_id": 244435,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4306771.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hoseokie",
                "username": "hoseokie"
            },
            "url": "https://myanimelist.net/reviews.php?id=244435"
        },
        {
            "content": "All out  25/25 episodes \r\nAt the start I was a bit skeptical about the anime thought it would be bad and most of the time bout friendship and crap..\r\nBut it turned out really good and  I hope they will make a 2nd seasons so I can see them going to Hanazono,at the start the 1st few episodes I really wasn't sure if it was good to watch,but later when they got the new coach everything start to be better,their training,the fun in the anime,the matches versus other schools..My favorite character is Sekizan the captain of the team ...\r\nThe matches at the training campwere probably the best of the whole anime,especially the last one :D\\n\\n\r\nStory 7/10\\n\r\nArt Style 6/10\\n\r\nSound 6/10\\n\r\nCharacters Design 7/10\\n\r\nEnjoyment 7/10\\n\r\nAll together a good 7/10  \\n\r\nIt's definitely it worth watching :D",
            "date": "2017-03-30T13:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 244028,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4502091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akuma_X",
                "username": "Akuma_X"
            },
            "url": "https://myanimelist.net/reviews.php?id=244028"
        },
        {
            "content": "The story was good. It shows how some characters have to train to get there style and or over there fears.....well the two mains. The teams have to learn to get in sync, when an old coach (trains teams to the become the best), he teaches the team a whole lot where they are starting to compete against some of the best. Background on the team they don't have a coach, the captain led them to how they were and basically kept the team together, when they were first years they all learned everything from books, they have books all in the storage room withstrategies and all in them.\\n\\n\r\nArt is very good and some very good details of drawing of the muscle\\n\\n\r\nSound op is very good and some good ost\\n\\n\r\nCharacter is good, how the captain shows his emotions was nice \\n\\n\r\nEnjoyment  binge watch very good and every week also, but if you put it on hold for too long not very good. \\n\\n\r\nStory-7\\n\r\nArt-8\\n\r\nSound-8\\n\r\nCharacter-7\\n\r\nEnjoyment-7\\n\r\nOverall-7",
            "date": "2019-01-12T19:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 298869,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4906592.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lord_Valzin",
                "username": "Lord_Valzin"
            },
            "url": "https://myanimelist.net/reviews.php?id=298869"
        },
        {
            "content": "To me this show never gets boring. I enjoyed how the members of the Jinko's rugby team interact with one another and spend their time alone. I liked how each episode focuses on an issue with a few members of the team. However, I would like to see a bit more chaos with how each members arc conflicts and reinforces one another. Sure some of the issues may be already covered by other great sports anime and may seem as cliche's, but you have to watch this show while appreciating the effort that this show put into making these characters feel real based on howtheir experiences shaped their perceptions. It makes you appreciate that these characters are not treating these issues as cliches but as obstacles they have never thought much of or dealt with before. You have to notice that they are utilizing whatever resources they have at hand to overcome them and that they have to put in effort to notice what resources they have at hand even when it doesn't seem obvious to anyone. Despite being disappointed with how the show was wrapped up in the last episode it was still a moving experience all the way till the end.",
            "date": "2018-11-10T10:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 293776,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4623083.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kevlar20",
                "username": "kevlar20"
            },
            "url": "https://myanimelist.net/reviews.php?id=293776"
        },
        {
            "content": "After 7 episodes I thought I had found a great anime. I was intimidatingly disappointed.\r\nGion is established as the out-going, charismatic, yet humble on the account of his limits lead; approximately 8 ep in, the show is not about Gion anymore, but instead it's a backstory of the week on other members of the rugby club, some of which play no part in the story and whose names you can't recall towards the end of the series. Later, Gion takes center stage again for 2 episodes, but is quickly overlooked by the story, and I'm not joking when I say that I think that, outof the last 5 episodes, Gion probably didn't even get 20 minutes of screen-time. \\n\\n\r\nIt starts off very well. There are some minor issues, like the obviously low budget this project had; it shows all the symptoms of being under-funded: shots that are overly long and drawn out to fill time; shaky-cam tricks to give the illusion of motion, as well motion and emphasis lines to elude to movement like mangas do...\\n\r\nThe other aspect I'd consider a flaw is how every character - except Gion, the coach and a character with yellow eyes and a sweet tooh - is annyoingly effeminate. It doesn't really matter until it's just absurd and irritating.\\n\\n\r\nIt's a real let-down, since at the beginning it seemed like it was going to be a particularly good story about overcoming limits, and what it meants to live a life going \"all out\". This not just in the context of sports or personal goals, but also in terms of duty, since there's a great quote about the role of teachers, \"Abandonment doesn't foster independence...\" (I'm paraphrasing)...\\n\\n",
            "date": "2017-04-06T08:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 244840,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5744087.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SalarymanRambles",
                "username": "SalarymanRambles"
            },
            "url": "https://myanimelist.net/reviews.php?id=244840"
        },
        {
            "content": "It's very hard for me to recommend this to anyone that has their standard set by other sports anime like Haikyuu!! or Hajime no Ippo. This anime showed what everyone wanted to see in the trailer and the first 2 episodes, then took a nosedive so far that I have decided to stop watching it.  \r\nWarning, there are slight spoilers. It doesn't have much impact to the story, but if you wish to watch the anime with 0 knowledge, I suggest you stop reading this now. \r\nBefore I start ripping into it, I do want to point out that Rugby League is a 13person sport, so that's a lot of characters to go through in 25 episodes if you chose to flesh out every character. Because the developers chose to make every team member important, I would have wished to see this as a shounen rather than a 25 episode seasonal anime.  \\n\r\nWhy? Well, here is why:  \\n\\n\r\nStory - 5\\n\r\nThe anime moves at a snails pace. It is incredibly slow. I understand that this is the point of developing a team and showing how they progressed as one, but the supposed main character, Gion, has had the most convenient shortcuts given to him. This is contradictory to what I said about the anime moving at a snails pace, but this is only because we don't get any actual noticeable improvement from our main protagonist, in order to save screen time for the other characters you don't care about. The only time I can remember Gion having any real improvement was when he learned how to tackle in the first 2 episodes. After that, he's stayed exactly where he was. There was another point where *Spoilers* he learns how to predict where people are going to move before he tackles, but that's very quickly forgotten when the other team easily maneuver anyway *Spoilers End*. I'm sure he's going to become a menace to teams in the All Out!! universe later on, but the fact that it's been 17 episodes and I feel he's in the same place as he was in the start, I just don't want to commit my time to more convenient plot devices later on like \"I've been practicing a lot off screen while you were talking about boring character No. 5\"  \\n\r\nSPEAKING OF CONVENIENT PLOT DEVICES, Gion hired a Japan wide known Rugby coach to coach his team for... nothing? Yeah, right.  \\n\r\nThen on the latest episode (17), after everyone ran to the footy field, they were soaked in sweat and were out of breath, right? That's nothing for this 16 year old girl who was carrying dessert for all members of the team, and don't tell me that she took a taxi or some crap, because it would have taken 2 seconds of animation or explanation to clear that up, but why would they when that 2 seconds could go towards talking about the next guy you don't care about?  \\n\\n\r\nLook, I respect the idea of fleshing out the entire team, but in the anime, I only really care about 5 characters at most. \\n\r\nGion \\n\r\nTree Trunks \\n\r\nIwashimizu\\n\r\nEbumi\\n\r\nSekizan\\n\r\nEveryone else just seems like a distraction, yet we're wasting what little screen time that we have for this 25 episode seasonal anime on them. We're slowing down the pace of the entire anime for the sake of worthless teammates, and because of that, we're forced to enforce convenient plot devices and shortcuts. \\n\r\nAs a teacher once told me \"Does your story revolve around the interesting characters of the story, and if not, why isn't it?\".  \\n\\n\r\nArt is fine. Music is very repetitive. Characters are boring and I had no enjoyment from this.  \\n\r\nMaybe you'll enjoy it better than I did if you weren't spoiled with previous sports anime that I mentioned, but if you are spoiled, then I can't recommend this to you.",
            "date": "2017-02-03T03:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 239807,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3528005.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ItsMarill",
                "username": "ItsMarill"
            },
            "url": "https://myanimelist.net/reviews.php?id=239807"
        },
        {
            "content": "So I have just finished this series and would have to say it was an interesting ride. You can argue the story doesn't progress far in terms of the show's goals but I would say it was a nice ride and if anything gains interest in the manga. \r\nTo talk on the reviewed points. The story starts following somewhat of a main character, his interest of rugby... or if anything interest of tackling. The story then slowly expands on the members of the team instead of the small few and them bettering themselves and growing in foals and skills. A review made a clear pointto say you see the build up to the start of the challenges (in terms of competitions) but still a fulfilling story. \\n\\n\r\nThe art took a few episodes to adjust to, the variety of buff builds was weird but eventually it grew on me. Animation in my opinion was good, but they really put a great deal of work into clashes and tackles.\\n\\n\r\nThe characters, how to say. As mentioned before it starts focus on a small group mainly 4 or 5 characters but as episodes go on you see the focus on the team and you get to learn some things about the other members, while not fully fleshed out you get some nice side stories and interactions. Sure only a few characters are memorable by name mentioned alone, but you do feel you get to understand them all working together if not some of their personal lives, stories or hangups. \\n\\n\r\nI would say this show was very enjoyable. It starts a bit slow at first and not that interesting but as the team starts to train and develop themselves the show starts to take on a much more enjoyable feel and as you get more and more character development. I started the show with almost no knowledge of rugby and while I finished with some VERY basic knowledge of the rules I think this was still an enjoyable anime and worht watch to try a new sports anime, maybe not the most dedicated rugby fan might love it but I am sure all can find some value in it.",
            "date": "2018-11-03T15:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 293258,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6010409.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/squashem",
                "username": "squashem"
            },
            "url": "https://myanimelist.net/reviews.php?id=293258"
        },
        {
            "content": "\"I really do think everyone should give it a proper chance... I feel like you would be making a mistake to just disregard it...\"\r\nI Just finished ALL OUT !! and I genuinely have a lot to say about it. Also, even though I gave it a pretty high score I'm going to try my best to be 100% critical about the Anime - and leave out any bias until the end.\r\nI loved the show.\r\nI have to admit the first thing that stuck out to me was the unique art style. You know that one very bough character thats in almost every show? Yea well imagineall of those characters you can think of jammed into one anime. That'll give you an idea of the art style this Anime tends to lean on. It's also one of the first animes I've personally seen who really takes emphasis on the \"Bara\" Genre. \\n\\n\r\nMoving onto the story. \\n\r\nI can understand why some people might not like the anime solely because of the story. \\n\\n\r\nI will Admit ALL OUT !! lacks character development. Or... at least they don't execute it to the potential it deserves. While watching the anime in my opinion there are really only a few memorable characters. For example in the team there are about 15-20 players - Out of those 15-20 we really only get familiar with about 8 of the players. There were times where I forgot a few players were even on the team. \\n\\n\r\nI feel like the people working on the anime (or Manga) noticed this too, just maybe a little too late. Characters I didn't even know existed or I \"Saw that one time in that one episode\" were given a little story to maybe have the viewers know who they are. The only problem is... they weren't really done.... great. All of them were too short and maybe only focused on for one episode, sometimes not even that much.\\n\\n\r\nFor example theres a character in the team that I'm going to be honest I never knew he was there. I thought at first it was a new character we were going to be introduced to, only to find out hes been on the team all along. He ends up talking with one of the more known characters and its revealed that he has a lot of major insecurities about his position in the team. Rather than focusing more on who this guy is as a character it felt like the only reason he was there was to give a slight bit more information about the other more known character (due to the more known character connecting the lesser known characters problems with what he had to deal with with his brother.)\\n\\n\r\nOr even another example - Theres a character in the anime where hes given an entire episode about his backstory. And actually its a pretty deep one too, something in my opinion a lot of people would be interested in learning more about. Granted unlike some of the other characters he was actually given an entire episode. But even this ONE episode felt like it was just too short. It felt like as soon as we were about to get really into the drama it was cut short and the problem he was facing seemed to be \"fixed\" at the end of it.\\n\r\nIn a way you kind of feel cheated. Because your'e given a character that has the potential to becoming your favorite and then the show doesn't even properly expand on him. This is done with a lot of the characters, and I understand people who don't want to watch it and eventually drop it midway. The only way to get a grasp of who at least 95% of the players on the team are, is if you completely watch it all the way to the end.\\n\\n\r\nIt's hard because a lot of the side characters aren't really that distinguishable from each other. Especially when they have their hats/helmets on. Usually people can distinguish anime characters by their hair (if they don't have any other striking features about them) but when the hats are on you aren't even given that much, you're left trying to think harder on who's on the screen. There were times where I got lost and thought to myself \"Okay so he got the ball!... but... who is he again?\"\\n\\n\r\nThis is just my opinion but I feel like the people who were creating the anime didn't think it would be picked up for a second season therefore in the 25 episodes limit they were given, they tried making sure majority of the story was fit into that space. In which case some elements the story needed was cut short and squished together.\\n\\n\r\nStill don't let what I have just told you discourage you or make you turn away from watching this anime. \\n\\n\r\nWeirdly theres something about this show that keeps you interested. And I feel like it only works BECAUSE its a sports anime. If it was any other Action, Fantasy, Romance driven anime I think generally everyone would hate it. But because its a sports anime, theres a trait to the show that not a lot of animes have. \\n\\n\r\nWhen I was watching the show there wasnt an episode where I was bored or wanted to skip. Every episode was generally interesting in its own way. Though some side characters are hard to remember, the main characters (those 8 I talked about earlier) keep you grounded into wanting to see more of the show. This coming from a person who knew nothing about rugby before watching it - other than that its a sport that you're allowed to tackle someone in. \\n\\n\r\nI think it's because (and again this is just my opinion) this show drips with potential. It has the potential to be even greater than what it is. This is a show that a lot of people can hop onto if done just a smidge more differently.\\n\\n\r\nI feel like for some if you watch the entire anime - afterwords you'll be given an answer to what the show is kind of about. You'll be left with \"Ohhh, this is the type of show it is\" even if you don't know what direction its going in while watching it. \\n\\n\r\nThis is where my bias starts to come in. I can agree universally it isnt \"The Best\" Anime out there - however it is a darn good one. It has its flaws but it isnt so prominent where its distracting. It kind of just goes with it's own flow - and I think thats exactly how you should watch this anime. See it's flow and then try to follow along with it.\\n\\n\r\nIf you're not too.... \"critically moved\" when watching stuff - meaning for example: Theres a flaw within the show so that means I should just drop it. Or, Ehh this show sucks in this particular area so I guess I won't watch it anymore. If you stick with a show even when noticing a flaw in it - I think You'll like this Anime. And agree somewhat with me.\\n\\n\r\nI really do think everyone should give it a proper chance. Overall in its entirety it is a really good show. I feel like you would be making a mistake to just disregard it and move onto something else. \\n",
            "date": "2018-10-11T22:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 291546,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5249979.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Poisen-paradise",
                "username": "Poisen-paradise"
            },
            "url": "https://myanimelist.net/reviews.php?id=291546"
        },
        {
            "content": "After reading and watching the poor reviews for this anime, I felt an obligation to write this review to dispel some of the negative conceptions.\r\nI gave All Out!! really high scores and I'll tell you why...\r\nAfter watching episode 1, I wasn't really too impressed by it. In fact, I was a little annoyed at the short, hot-tempered character cliche that was the main character. But as I kept watching, I started to grow a fondness towards it.  \r\nWhat makes this show so enjoyable is the dynamic characters that continuously surprise you. My first impressions of Gion, Sekizan and Ebumi were not great, I'm notgonna lie. But now, they are my favorite characters. \\n\\n\r\nAlso, the action! The animation is truly amazing and it keeps you interested. I won't say too much, but episode 6 is a must watch.\\n\\n\r\nI noticed the anime was getting a lot a poor reviews by mainly guys who were just complaining about the revealing uniforms the boys wear and the unrealistic body standards (interesting, eh?). \\n\\n\r\nBut please, don't let the booty shorts stray you from watching this incredible anime. It's a great show, the butts are just a bonus!",
            "date": "2017-03-07T09:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 242058,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4971647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/aries0770",
                "username": "aries0770"
            },
            "url": "https://myanimelist.net/reviews.php?id=242058"
        },
        {
            "content": "All Out!!! was like a mecha anime but the human bodies as the machine.  I initially gave this anime a 6 but since then have rewatched this one twice and always find new reasons to watch it.  For a sports anime, its entertaining and I actually learned a lot about rugby; a sport I seem to always end up watching on the weekends but never fully understood until now.\r\nBesides being educational, the characters and their interactions were entertaining.  It kept with a common anime theme of overcoming insecurities and difficulties then yelling \"I got this!\" or \"I won't give up!\".  Therugby playing scenes were also intense and fun to watch.  I always wanted to go train or hit something afterwards.\\n\r\nAs a woman, I also found it refreshing to have a break from busty girls.  Besides a few slice of life animes, there always seems to be that one girl overflowing with boob.  Finally, an anime for chicks where the men are tall and muscular (except for one of the main characters who is short but stalky).  No skinny jean wearing characters or long haired pansies in this show.  Just big guys with big muscles and even larger dreams.",
            "date": "2018-03-20T08:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 274372,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5973670.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/COGirl1985",
                "username": "COGirl1985"
            },
            "url": "https://myanimelist.net/reviews.php?id=274372"
        },
        {
            "content": "7/10 The story? sports yass.\r\n3/10 Art? The muscles and body figure were too exaggerated, the kind of student that were once Pro rugby player and were put in highschool all over again. A slight muscle would've been okay but ugh...\r\n6/10 sound? didn't really focused on the sounds but it seems pretty average to me, nothing that caught my ears.\r\n5/10 character? Your average anime personality, nothing too \"new\" in this era of animes.\r\n6/10 enjoyment? so far so okay.\r\n6/10 overall? just another anime that I just watched and given an \"okay\".\r\nMy rating summary guide\r\n1=You have angered God thus creating Judgement day :( \r\n2=Studying Math is better \r\n3=whatis this trash \\n\r\n4=wat \\n\r\n5=um \\n\r\n6=okay \\n\r\n7=nice \\n\r\n8=another similar anime? \\n\r\n9=wow omg!! hype!!\\n\r\n10=impossibru, you make God happy and the entire existence is saved",
            "date": "2017-02-13T15:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 240535,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3619569.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jasteraz",
                "username": "Jasteraz"
            },
            "url": "https://myanimelist.net/reviews.php?id=240535"
        },
        {
            "content": "I love sports animes. With a complex web of character relationships across a large cast, anime-fied take on tactics (actually more enjoyable when you don't know the sport, and in this case, I didn't know rugby), and ability to vicariously live the simple up and down emotions of winning and losing, the basic hallmarks of a sports anime is an easy well-worn track for All Out!! to follow. Beyond the blueprint, however, All Out!! does a few things very well and one thing not so well.\r\nStarting with the pros:\r\n1. All Out is very self-aware. When the main character Gion first joins the team, the showrealizes an alphabet soup of names is not going to be helpful for the audience, and realistically not helpful to someone meeting a gigantic group for the first time. So they tell Gion and by extension, the viewer, oh well, you'll pick it up as we go. And it follows through with mostly organic introductions and interactions, rather than strictly regimenting meeting one or two new side characters per episode.\\n\r\n(Also, rather than having a character seem suspiciously too similar to Hiruma from Eyeshield-21, the show instead goes full homage complete with the \"ya-ha\")\\n\\n\r\n2. Characters do not remain boxed in cliques. Everyone interacts with everyone else. The dynamics within the third years and between the second years and third years, and between people in the same grade across different schools flourish independently of their relation to the main character.\\n\\n\r\n3. The adults interact with each other and offer viewpoints beyond the X's and O's of the game. It's difficult to elaborate without spoilers, but the adult characters in All Out are more fully realized than other shows that have mouthpieces for training techniques and game tactics.\\n\\n\r\nAnd now the con:\\n\r\nAll Out does not sustain drama. Main character Gion's issue is that he's short, but it's quickly evident that the people who recruited him weren't lying, plenty of rugby players in this show are of similar height. His bigger issue to being new to rugby, which also isn't really an issue unique to him at all. Also, while some themes are carried through the show (club was not competitive when the current third-years were first-years), the heaviest drama is reserved for sudden punches of serious issues with little foreshadowing and little follow-up.\\n\\n\r\nSo in conclusion, if you like sports anime, realistic feeling group dynamics, or just a total blank slate looking for the basic flow of a rugby game, you should watch All Out!! \\n\\n\r\nArt: 8 (some very...unique character designs can be hit or miss, animation-wise, there were a few places were stills were noticeable, but overall the rugby movements and character expressions are well done)\\n\r\nSound: 6 (I rarely notice voice acting unless it's particularly amazing or atrocious. All Out's VAs were fine, and the first OP/ED were decent. The second OP/ED were not my cup of tea, but All Out mostly loses points due to its lackluster background music.)",
            "date": "2018-01-29T02:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 269992,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/221452.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Selinea",
                "username": "Selinea"
            },
            "url": "https://myanimelist.net/reviews.php?id=269992"
        },
        {
            "content": "I just finished this anime and decided it was worthy of a review. I have not read the manga yet and I will try and make this as spoiler free as possible.\r\nI am a fan of sports anime and decided to give this one a try and am glad I did.\r\nAs far as sports anime go this one followed my rules as in making it easy to follow the sport (rugby) and room for character growth. I personally love it when background characters have their time to shine and this one does that and then some.\r\nThe art was great the characters are very well rounded.You won't see five guys with the same face/build here. the uniqueness in character design really shines as well.\\n\r\nIt was a very enjoyable ride with this new team trying to make a name for themselves. \\n\r\nThe season ended with so many more stories to be told that I'd be shocked (and disappointed) if there isn't more seasons to follow.\\n\r\nIf you enjoy sports anime then I highly recommend this one. Even if you are not familiar with rugby you will learn the basics and the lovable characters will draw you in. Madhouse did a great job with the aesthetic and I was really surprised that it hasn't gotten much recognition. \\n\r\nGive it a go! you may find yourself pleasantly surprised.",
            "date": "2017-08-29T19:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 256497,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6012165.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Oona_Shea",
                "username": "Oona_Shea"
            },
            "url": "https://myanimelist.net/reviews.php?id=256497"
        },
        {
            "content": "aehm ...\r\nNo quite Kuroko CGI and camera angles or Hajime no Ippo yet i find myself at 9 am on a rotten monday strangely not annoyed by anything at all after three episodes; which, after passing on 10 others after 5-10 minutes of the first eps is a welcome relief on this broke soon to back unemployed hunting for needle in a haystack jobs without an electromagnet-day.\r\nConsidering the fact that im an overstimulated quality junkie with mutant alien blue blood this probably means i should be able to finish the whole season unless they resort to below the belt or panties comedy after a fewfor lack of inspiration or ratings. I dont know if these series are done when they're released or not. Im new to the scene but as old as saint seya and hokuto no ken \\n\r\nwhcih actually taught me my first french since the only place to see was french tv just like the only place to find goldorak was luxembourg. See im losing topic again, i always do that. Too much in my head and brainfog.  i think there's a rumble in the jungle downstairs\\n",
            "date": "2017-02-19T23:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 240973,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/retorica_t",
                "username": "retorica_t"
            },
            "url": "https://myanimelist.net/reviews.php?id=240973"
        }
    ],
    [
        {
            "content": "Fall 2016 was meant to be a pretty stellar season for sports anime, and I for one was incredibly hyped for it. And I definitely wasn’t disappointed with it as a whole. The third season of Haikyuu!! proved to be just as good as the first two, and Yuri on Ice!!! made itself out to be an unexpectedly thrilling series. However, I can’t say the same about All Out!!. It was the Fall 2016 anime I was most looking forward to – after all, rugby is basically just men in tight shorts violently glomping each other. It should have been perfect. So what went wrong?Well, everything about All Out!! can be summed up in one word: lazy. \\n\\n\r\nMadhouse has produced some stellar anime in the past (Death Note, One Punch Man, Parasyte), and I guess they used up all their effort creating them, leaving absolutely none left for what could have been a brilliant sports anime. \\n\r\nFirstly, and most disappointingly, the animation is some of the shoddiest and least dynamic I’ve ever seen in any anime, let alone a sports anime, where movement and energy is a key factor. There is literally nothing going on in the majority of the scenes in any given episode, and this becomes most apparent in the match in episode 3 (or 4? It’s probably bad that I can’t remember…). The whole pitch seems to be covered up with this bright white fog of war, so the animators don’t have to animate anybody but the character(s) at the forefront of the scene. The scrums, one of the most exciting and homoerotic parts of rugby, are still frames with lines drawn on them to express movement. Even the ball looks bad, as somebody thought it was a good idea to animate it in CGI, making it look awkward and out of place next to the hand-drawn everything else. Everything about the animation is lazy, and makes the anime as a whole incredibly dull. I guess that’s why they made all the colours so saturated, to try and make up for it…\\n\\n\r\nThe character designs also make me want to rip my eyes out. They looked pretty decent in the manga, nothing special but still fairly nice looking, but I guess this didn’t translate as well into the anime as everybody looks like a Dangan Ronpa reject. This would be (a bit more) fine if this anime wasn’t trying to be realistic. When have you ever seen a kid with hair in the shape of devil horns? The stupid hairstyles and face shapes only serve to try and differentiate the characters from each other, as none of them have any personality. Even the main characters, who should be walking stereotypes (does a comedy, shippable duo made up of a tall, experienced guy and a short, angry, more energetic and DETERMINED guy sound familiar..?), don’t even have enough character development to be stereotypes. All sports anime have essentially the same plot – underdog team wants to get to nationals and win, so the audience has to be kept entertained by the characters and their journey and development from losers to winners. All Out!! is unable to do that. There isn’t even enough shipping potential to make it watchable, and what potentially yaoi moments there are are so forced (eg. when the Robbie Rotten looking dude straddled the captain man and professed his love for something or other of his) that it’s just offputting. \\n\\n\r\nOther, more minor irritations of mine about this anime are the absolutely inappropriate and generic choices of background music (half of it sounds like it was ripped directly from a comedy ecchi, the other half is generic rock guitar), everyone’s eyelashes (they look like they have spiders on their eyes) and the skintight sports kits (seriously, clothes do not work like that. Another example of laziness). I’m only continuing to watch this anime to make my past self happy, my sweet, deluded past self who didn’t know how terrible this would be. It’s the definition of a disappointment.\\n",
            "date": "2016-11-12T10:25:00+00:00",
            "helpful_count": 67,
            "mal_id": 233641,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5112502.jpg",
                "scores": {
                    "animation": 2,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/thememequeen",
                "username": "thememequeen"
            },
            "url": "https://myanimelist.net/reviews.php?id=233641"
        },
        {
            "content": "With the rise in popularity of sports anime in the recent years, a lot of shows about different types of sports have been appearing on the last decade, from volleyball and swimming to ping-pong and ice skating. However, All Out!! is the first anime to deal with rugby, a rough sport which has been on the rise in Japan these last couple of years.\r\nHaving grown up in a house with three brothers who play rugby and a father who played on his youth, I have a basic knowledge of this sport, which was what drew me towards this anime in the first place. And I'mglad i decided to check it out tbh, because it was an amazing watch.\\n\\n\r\nStory: 8/10\\n\\n\r\nNow, let me get one thing clear. The story isn't something extremely wild or out of the box that hasn't been seen before. You have two protagonists who join their high school's rugby team, and the teammates start interacting and becoming friends as they train to reach their ultimate goal: winning the Hanazono, the biggest high school rigby competition.\\n\\n\r\nHaving said that, however, I have to admit that even though the plot isn't the most original, it was entertaining enough to keep me watching. The characters were likeable and the cast had good chemistry, which was a huge plus in my book. Also, the story does get really intense at times, just like a rugby match can get at certain points, and at times it gives you a breath by having the characters take a break from training (and using that time to delve into their backgrounds and develop them) so it doesn't get too intense.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nIn my opinion, the characters were one of the strongest points of the anime. The main reason why I think this is that they were the main reason why I kept coming back for more; if the characters were unlikeable, I probably would've dropped this after like five episodes.\\n\\n\r\nWhile it looks like the protagonists are Gion and Iwashimizu, the truth is that All Out!! is an ensemble show; the anime also gives a lot of focus to Sekizan, Oharano and coach Komori, as well as the rest of their supporting cast. And it does have a really large supporting cast; yet it manages to balance them well and the character interaction are always interesting and fun to watch.\\n\\n\r\nI felt like the majority of the cast was pretty memorable and very enjoyable to watch. It was easy to root for Gion or Sekizan to win because they were just that likeable. And I was surprised with how it manages to develop their characters with only 25 episodes; not only with Gion, Mutsumi or Iwashimizu, but even supporting characters such as Ise, Kifune or Suwa get their time to shine as well… just like in rugby, where not only one player gets to shine, but all 15 of them get their moments of glory.\\n\\n\r\nArt & Animation: 9/10\\n\\n\r\nI personally think that the art can be the most subjective aspect of an anime. I found the art really cool, and beautifully animated; as usual, Madhouse does not disappoint in this aspect. The character designs seemed pretty unique, making it easy to identify which character was which by having certain characteristics that simply made it obvious; you have three blonde characters in Iwashimizu, Oharano and Ebumi, but it wasn't hard to remember who each one of them were despite their initial similarities.\\n\\n\r\nThe most outstanding bits of animation that I want to point out, however, is when the action is happening. I was worried about how they were going to animate the rugby matches, but again I was pleasantly surprised; the animation of the matches was fantastic and really dynamic, which was needed for a game as dynamic as rugby.\\n\\n\r\nSound: 10/10\\n\\n\r\nLet me just say this: the soundtrack for this show is AMAZING. It's mainly composed of rock songs that really fit the series, and when they play it in the background during rugby matches or training scenes (specially when they're about to start) it really gives you the sensation that you're feeling the same excitement that the characters are feeling when they're getting ready to go out there and give it their all.\\n\\n\r\nAt the same time, there are some tracks that have a more soft and smooth vibe to them, and that play during less intense scenes. Those are just as memorable, specially the first ending… and while we're at it, the first opening is fantastic. The second one was good too imo, but the first opening, \"Flower\" by Lenny Code Fiction is thrilling; haven't heard such a fantastic op since SnK's \"Guren no Yumiya\".\\n\\n\\n\r\nOverall: 10/10\\n\\n\r\nNow, I'm the kind of gal who  mostly rates her animes out of the enjoyment that I get out of watching them. If it's boring or a chore to watch, it won't get a high score overall… and this was far from the case. It was enjoyable, and a really fun watch!\\n\\n\r\nBefore I end, I just want to say that you don't need a background knowledge of rugby to watch this; because Gion is new to rugby, he serves as a way to introduce the sports and its' many rules to the viewer, so you'll have characters such as Iwashimizu and Umeno teaching you a bit about the sport. \\n\\n\r\nSo, to sum up… give this show a chance! Thank you for your time :)\\n\\n\\n",
            "date": "2017-04-03T06:25:00+00:00",
            "helpful_count": 43,
            "mal_id": 244489,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1234325.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dawnangel14",
                "username": "dawnangel14"
            },
            "url": "https://myanimelist.net/reviews.php?id=244489"
        },
        {
            "content": "Putting the exaggerated art aside (even though it's charming in it's own way and grew on me), rather than playing and winning rugby matches, perhaps All Out is about personal development and team building (at this point, at least)... together, they want to get stronger. \r\nI do appreciate the fact that All Out doesn't put all focus on the main character, Gion, but also hints on backstories on individual team members and how that affects team dynamics and growth. Also, there's no one super strong team member, just players with their own strengths and own internal battles that game by game they seem to getbetter at overcoming and show us what they've got.  It's a slow build up, but it's happening. \\n\\n\r\nOne more thing I like is that Gion being new at playing rugby is just about clueless about everything... HOWEVER, for people who don't know the rules of rugby (like myself), Gion serves as that bridge since I can learn the game through his eyes. So far (ep. 9) he has improved, partially because he's the naturally wild and aggressive type but he still has ways to go and he knows this and therefore strives to get better. What I also like about Gion is how unexpectedly observant he is... not just about watching the game but how his teammates play and their mood as well. \\n\\n\r\nAll Out is not perfect but it has this thing about it that makes you want to cheer for the team... so even if like me, you don't understand the rules, then perhaps you'll enjoy watching the characters grow and eventually you'll get into the game. Now, I know when they score a 'Try' lol  \\n\\n\r\nMy one minor bone (which is laughable) is that they use a soundtrack that sounds like one regularly used in Naruto, so each time I hear it, my mind shifts to Naruto with shinobi training and flying through trees lol \\n\\n\r\nAnyway, give it a try!",
            "date": "2016-12-02T08:35:00+00:00",
            "helpful_count": 36,
            "mal_id": 234749,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2829547.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/greenroses",
                "username": "greenroses"
            },
            "url": "https://myanimelist.net/reviews.php?id=234749"
        },
        {
            "content": "I have been looking forward to All Out!! for months and so far it doesn't disappoint. First of all, if you are not a fan of sports anime then you will probably not enjoy it, so be warned. I am, however, and All Out!! is ticking all the right boxes for me. In the first episode a short, feisty character, Gion, meets a tall, shy, character, Iwashimizu, and gets introduced to the world of rugby. As the story progresses Gion meets the rest of the team, amongst them the captain, Sekizan, who seems to take rugby very seriously and looks a little scary.\r\nThe story isnot really original, as it seems to be a typical-newcomer-finds-out-about-a-sport-and-joins-a-team plot, but that's not why fans love sports anime: Fans love sports anime because there are awesome characters, great action and lots of humour. Judging by the first few episodes, All Out!! delivers on all three counts. \\n\\n\r\nIf you don't know anything about rugby, don't worry. Like many other sports animes, in All Out!! you are introduced to rugby through the eyes of a newcomer (Gion) who has to learn all the rules, allowing the viewer to learn about rugby as well. \\n\\n\r\nI gave Characters and Enjoyment 9 for Great and Art got 8 for Very Good (especially if you like muscles). Story I rated 7 (not really original and a little predictable, especially if you have seen a lot of sports anime) but I enjoyed the Sound, especially all the heavy rock tracks so I rated it 8 for Very Good. Overall I rated All Out!! an 8, but I might change it to a 9 later, especially if the story gets any better once the big championship starts. \\n\\n\r\nBasically, so far All Out!! is everything you want a sports anime to be. Hope you will enjoy it as much as I am!\\n",
            "date": "2016-11-10T23:45:00+00:00",
            "helpful_count": 37,
            "mal_id": 233557,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283651.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dreampanther",
                "username": "Dreampanther"
            },
            "url": "https://myanimelist.net/reviews.php?id=233557"
        },
        {
            "content": "All Out is a very mediocre anime and a bad sports anime.\r\nIf you want to watch this because it's a sports anime, don't bother, but if Rugby is the only premise that is strong enough for you to keep watching, then go for it. That was why i initially started watching.\r\nAll Out isn't your typical anime. In itself, it's rather mediocre. It has characters, animation, music and voice acting, but besides that, not a whole lot to write home about.\r\nThe story is as generic you can get away with in a sports anime. The main character begins in high school and wants to join therugby team. He isn't very good at rugby and he is physically not very strong or tall, but through training he very slowly gets better.\\n\\n\r\nThe composition of a normal sports anime starts with the main character playing against other teams in training matches, so he (and the viewer) can be taught the rules of the game, what roles there is on the team and who his new team members are and what they are like. The problem with All Out is that it jumps back and forth between in the composition and even skips some of it.\\n\\n\r\nThere is no sense of progression of the story in All Out. They keep talking about how they want to go to Hanazono (which is where the high schools compete against each other in a tournament) and how they want to go \"all out\" but they didn't even reach the starting line. They don't play any qualification matches in order to get to Hanazono. They just keep playing training matches on an empty field, with no spectators apart from the 2 teams that are playing.\\n\\n\r\nMadhouse. The name alone has set a standard for the level of animation you can expect. Hunter x Hunter (2011), One Punch Man, Death Parade. All well-known shows with great animation and a fantastic sense of artistic direction. Seeing that Madhouse was making All Out was a reason in itself to watch it. (Spoiler, it wasn't..)\\n\\n\r\nWhat we got was a lot of still frames with speed lines dashing on either sides of the screen, few frames of animation with a zoom and a pan over to the person who was catching the spinning ball and a few panning shots that ends with someone stepping forward.\\n\r\nJust look at the first opening if you don't know what i'm talking about. A 20 second slow pan towards the sky with \"ALL OUT\" written in all capital letters.\\n\\n\r\nThe soundtrack is very poor, meaning that there is very little variation. Music is the ultimate mood setter or mood killer, depending on how you use it. But in order to use it properly, you need a repertoire of music that can fit a wide range of moods and themes. All Out doesn't go \"all out\" on this.\\n\\n\r\nThere is no memorable tracks in the show. That is not entirely true. There is maybe 2 or 3 memorable tracks, but they're only memorable because I've heard them so many times throughout the series that it drives me crazy.\\n\\n\r\nThere's the track that starts with the guitar, which is shortly after accompanied with the drums and then the bass. That music is used when they train (Which is 70% of the show). Then there's the track where the team gets the ball and the track for when they're goofing off and being high school kids.\\n\r\nThere is shockingly little variety.\\n\\n\r\nRemember when i talked about the composition of a typical sports anime? That also applies to the characters. There has to be a generic base level where a character can be build and then later be expanded upon with personality, so you have a unique and interesting character.\\n\r\nGuess what All Out doesn't do.\\n\\n\r\nSome of the characters are purely identified by 2 things. How they look and what generic type of character they are.\\n\\n\r\nThere's the aggressive guy with spiky hair, who thinks the entire team is holding him back. Then there's the \"kinda happy\" guy with hair shaped like 2 small horns. Then there's the manager who is a girl. There is also 3 really fat dudes, who has very similar personalities. So the only way to distinguish them was to do make their faces different.\\n\r\nOne has weird eyebrows, another has really floppy chins that constantly points upwards and then there's the third fat guy who has a headband and likes to verbally remind everyone that he really ate a lot and that he reeeeealy likes food a whooooooooooooooole lot!\\n\\n\r\nTo give the show credit, there were some unexpected developments with the characters in a good way. One had an abusive brother, another one completely lost all motivation to continue playing rugby, but didn't want to quit in fear of letting his teammates down. But once those developments were brought up, they were dealt with in half an episode and then never mentioned again.\\n\\n\r\nI honestly don't know why i enjoyed the show as much as i did. I was considering dropping it but then episode 9 came along and changed my mind. Then after the hype had died down i was about to drop it one more time, but once again, a really good episode comes on and i just had to find out what happened next episode.\\n\\n\r\nThere were something oddly interesting about the show. The second opening really grew on me. The coach really seemed like a monotone guy, but it turned out that he had a good and relatable reason to be their coach.\\n\\n\r\nOverall, the show grew on me. I was interested in seeing how far the boys could go and how they would develop throughout the story.\\n\\n\r\nToo bad that neither the character nor the story got that development.",
            "date": "2017-03-31T12:40:00+00:00",
            "helpful_count": 28,
            "mal_id": 244153,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3317453.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Millawls",
                "username": "Millawls"
            },
            "url": "https://myanimelist.net/reviews.php?id=244153"
        },
        {
            "content": "Having this anime end, it made me realize how much I appreciate this anime  for having been animated during a season with mediocre anime. \r\nI totally recommend this anime for anyone who like character development, team development, a good amount of sports explanation and a lot of realistic aspect to a high school sports club. This is not a Prince of Tennis or Kuroko no Basket type of simple surreal anime that has one main character and leaves everyone to shit behind with no background development whatsoever. This anime has full great individual character development for each and everyone in the team. By theend you appreciate the team as a whole rather than having only one good character. \\n\r\nThe animation was consistent, it did have a few mehs but overall MadHouse did a great job animating. The opening/ending songs weren't the most memorable but they definitely make you feel happy once you listen to them a few times.\\n\r\nHonestly if you like sports anime but feel turned-off by how slow the \"action\" is then rather than taking it as your \"main stream\" style sports-anime you should approach it as a rather slice-of-life-sports-anime. Honestly its such a great anime and I definitely hope theres a season two where we actually get into big tournaments and so on.",
            "date": "2017-04-02T02:45:00+00:00",
            "helpful_count": 18,
            "mal_id": 244315,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5684670.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ken-K",
                "username": "Ken-K"
            },
            "url": "https://myanimelist.net/reviews.php?id=244315"
        },
        {
            "content": "I was really glad when there was another sports anime that was completed. I've been binge watching sports anime since last month. I have watched Eyeshield 21 before which kind of has the same game play but since that was football and this is rugby, there's a difference. \r\nI am really choosy with the animation but this one is good and unique. High school students with bulky muscles isn't that common but it kind of made the anime intense. They sometimes have awkward and gay poses which made me laugh my ass off but I did enjoy it. \r\nHowever, the anime had a lot offlashbacks that I think didn't really matter. It makes most out of the episode instead of a game play with strong schools or training. I remember a flashback of a player from another team which kind of confused me because I didn't really care with the other players. Also, the protagonist wasn't given more focus than I am expecting. I was expecting more focus on Gion and how he evolves and learn more about Rugby. Well, that's actually what I am expecting from a sports anime - starting from the beginning when the protagonist joins the team, how he learns more about the sport, how he evolves and improves in playing. \\n\\n\r\nBut, I managed to finish the anime and that only means one thing - I enjoyed it. I am looking forward to Season 2, if there's one which I probably think there will be but maybe aired for about a year or so. \\n\\n\r\nAfter saying all of that, I can say it deserves a chance to be recommended. Well, this is actually the first time commenting on an anime here on MAL so it really is good.",
            "date": "2017-04-02T19:20:00+00:00",
            "helpful_count": 15,
            "mal_id": 244435,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4306771.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hoseokie",
                "username": "hoseokie"
            },
            "url": "https://myanimelist.net/reviews.php?id=244435"
        },
        {
            "content": "All out  25/25 episodes \r\nAt the start I was a bit skeptical about the anime thought it would be bad and most of the time bout friendship and crap..\r\nBut it turned out really good and  I hope they will make a 2nd seasons so I can see them going to Hanazono,at the start the 1st few episodes I really wasn't sure if it was good to watch,but later when they got the new coach everything start to be better,their training,the fun in the anime,the matches versus other schools..My favorite character is Sekizan the captain of the team ...\r\nThe matches at the training campwere probably the best of the whole anime,especially the last one :D\\n\\n\r\nStory 7/10\\n\r\nArt Style 6/10\\n\r\nSound 6/10\\n\r\nCharacters Design 7/10\\n\r\nEnjoyment 7/10\\n\r\nAll together a good 7/10  \\n\r\nIt's definitely it worth watching :D",
            "date": "2017-03-30T13:10:00+00:00",
            "helpful_count": 8,
            "mal_id": 244028,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4502091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akuma_X",
                "username": "Akuma_X"
            },
            "url": "https://myanimelist.net/reviews.php?id=244028"
        },
        {
            "content": "The story was good. It shows how some characters have to train to get there style and or over there fears.....well the two mains. The teams have to learn to get in sync, when an old coach (trains teams to the become the best), he teaches the team a whole lot where they are starting to compete against some of the best. Background on the team they don't have a coach, the captain led them to how they were and basically kept the team together, when they were first years they all learned everything from books, they have books all in the storage room withstrategies and all in them.\\n\\n\r\nArt is very good and some very good details of drawing of the muscle\\n\\n\r\nSound op is very good and some good ost\\n\\n\r\nCharacter is good, how the captain shows his emotions was nice \\n\\n\r\nEnjoyment  binge watch very good and every week also, but if you put it on hold for too long not very good. \\n\\n\r\nStory-7\\n\r\nArt-8\\n\r\nSound-8\\n\r\nCharacter-7\\n\r\nEnjoyment-7\\n\r\nOverall-7",
            "date": "2019-01-12T19:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 298869,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4906592.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lord_Valzin",
                "username": "Lord_Valzin"
            },
            "url": "https://myanimelist.net/reviews.php?id=298869"
        },
        {
            "content": "To me this show never gets boring. I enjoyed how the members of the Jinko's rugby team interact with one another and spend their time alone. I liked how each episode focuses on an issue with a few members of the team. However, I would like to see a bit more chaos with how each members arc conflicts and reinforces one another. Sure some of the issues may be already covered by other great sports anime and may seem as cliche's, but you have to watch this show while appreciating the effort that this show put into making these characters feel real based on howtheir experiences shaped their perceptions. It makes you appreciate that these characters are not treating these issues as cliches but as obstacles they have never thought much of or dealt with before. You have to notice that they are utilizing whatever resources they have at hand to overcome them and that they have to put in effort to notice what resources they have at hand even when it doesn't seem obvious to anyone. Despite being disappointed with how the show was wrapped up in the last episode it was still a moving experience all the way till the end.",
            "date": "2018-11-10T10:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 293776,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4623083.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kevlar20",
                "username": "kevlar20"
            },
            "url": "https://myanimelist.net/reviews.php?id=293776"
        },
        {
            "content": "After 7 episodes I thought I had found a great anime. I was intimidatingly disappointed.\r\nGion is established as the out-going, charismatic, yet humble on the account of his limits lead; approximately 8 ep in, the show is not about Gion anymore, but instead it's a backstory of the week on other members of the rugby club, some of which play no part in the story and whose names you can't recall towards the end of the series. Later, Gion takes center stage again for 2 episodes, but is quickly overlooked by the story, and I'm not joking when I say that I think that, outof the last 5 episodes, Gion probably didn't even get 20 minutes of screen-time. \\n\\n\r\nIt starts off very well. There are some minor issues, like the obviously low budget this project had; it shows all the symptoms of being under-funded: shots that are overly long and drawn out to fill time; shaky-cam tricks to give the illusion of motion, as well motion and emphasis lines to elude to movement like mangas do...\\n\r\nThe other aspect I'd consider a flaw is how every character - except Gion, the coach and a character with yellow eyes and a sweet tooh - is annyoingly effeminate. It doesn't really matter until it's just absurd and irritating.\\n\\n\r\nIt's a real let-down, since at the beginning it seemed like it was going to be a particularly good story about overcoming limits, and what it meants to live a life going \"all out\". This not just in the context of sports or personal goals, but also in terms of duty, since there's a great quote about the role of teachers, \"Abandonment doesn't foster independence...\" (I'm paraphrasing)...\\n\\n",
            "date": "2017-04-06T08:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 244840,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5744087.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SalarymanRambles",
                "username": "SalarymanRambles"
            },
            "url": "https://myanimelist.net/reviews.php?id=244840"
        },
        {
            "content": "It's very hard for me to recommend this to anyone that has their standard set by other sports anime like Haikyuu!! or Hajime no Ippo. This anime showed what everyone wanted to see in the trailer and the first 2 episodes, then took a nosedive so far that I have decided to stop watching it.  \r\nWarning, there are slight spoilers. It doesn't have much impact to the story, but if you wish to watch the anime with 0 knowledge, I suggest you stop reading this now. \r\nBefore I start ripping into it, I do want to point out that Rugby League is a 13person sport, so that's a lot of characters to go through in 25 episodes if you chose to flesh out every character. Because the developers chose to make every team member important, I would have wished to see this as a shounen rather than a 25 episode seasonal anime.  \\n\r\nWhy? Well, here is why:  \\n\\n\r\nStory - 5\\n\r\nThe anime moves at a snails pace. It is incredibly slow. I understand that this is the point of developing a team and showing how they progressed as one, but the supposed main character, Gion, has had the most convenient shortcuts given to him. This is contradictory to what I said about the anime moving at a snails pace, but this is only because we don't get any actual noticeable improvement from our main protagonist, in order to save screen time for the other characters you don't care about. The only time I can remember Gion having any real improvement was when he learned how to tackle in the first 2 episodes. After that, he's stayed exactly where he was. There was another point where *Spoilers* he learns how to predict where people are going to move before he tackles, but that's very quickly forgotten when the other team easily maneuver anyway *Spoilers End*. I'm sure he's going to become a menace to teams in the All Out!! universe later on, but the fact that it's been 17 episodes and I feel he's in the same place as he was in the start, I just don't want to commit my time to more convenient plot devices later on like \"I've been practicing a lot off screen while you were talking about boring character No. 5\"  \\n\r\nSPEAKING OF CONVENIENT PLOT DEVICES, Gion hired a Japan wide known Rugby coach to coach his team for... nothing? Yeah, right.  \\n\r\nThen on the latest episode (17), after everyone ran to the footy field, they were soaked in sweat and were out of breath, right? That's nothing for this 16 year old girl who was carrying dessert for all members of the team, and don't tell me that she took a taxi or some crap, because it would have taken 2 seconds of animation or explanation to clear that up, but why would they when that 2 seconds could go towards talking about the next guy you don't care about?  \\n\\n\r\nLook, I respect the idea of fleshing out the entire team, but in the anime, I only really care about 5 characters at most. \\n\r\nGion \\n\r\nTree Trunks \\n\r\nIwashimizu\\n\r\nEbumi\\n\r\nSekizan\\n\r\nEveryone else just seems like a distraction, yet we're wasting what little screen time that we have for this 25 episode seasonal anime on them. We're slowing down the pace of the entire anime for the sake of worthless teammates, and because of that, we're forced to enforce convenient plot devices and shortcuts. \\n\r\nAs a teacher once told me \"Does your story revolve around the interesting characters of the story, and if not, why isn't it?\".  \\n\\n\r\nArt is fine. Music is very repetitive. Characters are boring and I had no enjoyment from this.  \\n\r\nMaybe you'll enjoy it better than I did if you weren't spoiled with previous sports anime that I mentioned, but if you are spoiled, then I can't recommend this to you.",
            "date": "2017-02-03T03:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 239807,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3528005.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ItsMarill",
                "username": "ItsMarill"
            },
            "url": "https://myanimelist.net/reviews.php?id=239807"
        },
        {
            "content": "So I have just finished this series and would have to say it was an interesting ride. You can argue the story doesn't progress far in terms of the show's goals but I would say it was a nice ride and if anything gains interest in the manga. \r\nTo talk on the reviewed points. The story starts following somewhat of a main character, his interest of rugby... or if anything interest of tackling. The story then slowly expands on the members of the team instead of the small few and them bettering themselves and growing in foals and skills. A review made a clear pointto say you see the build up to the start of the challenges (in terms of competitions) but still a fulfilling story. \\n\\n\r\nThe art took a few episodes to adjust to, the variety of buff builds was weird but eventually it grew on me. Animation in my opinion was good, but they really put a great deal of work into clashes and tackles.\\n\\n\r\nThe characters, how to say. As mentioned before it starts focus on a small group mainly 4 or 5 characters but as episodes go on you see the focus on the team and you get to learn some things about the other members, while not fully fleshed out you get some nice side stories and interactions. Sure only a few characters are memorable by name mentioned alone, but you do feel you get to understand them all working together if not some of their personal lives, stories or hangups. \\n\\n\r\nI would say this show was very enjoyable. It starts a bit slow at first and not that interesting but as the team starts to train and develop themselves the show starts to take on a much more enjoyable feel and as you get more and more character development. I started the show with almost no knowledge of rugby and while I finished with some VERY basic knowledge of the rules I think this was still an enjoyable anime and worht watch to try a new sports anime, maybe not the most dedicated rugby fan might love it but I am sure all can find some value in it.",
            "date": "2018-11-03T15:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 293258,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6010409.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/squashem",
                "username": "squashem"
            },
            "url": "https://myanimelist.net/reviews.php?id=293258"
        },
        {
            "content": "\"I really do think everyone should give it a proper chance... I feel like you would be making a mistake to just disregard it...\"\r\nI Just finished ALL OUT !! and I genuinely have a lot to say about it. Also, even though I gave it a pretty high score I'm going to try my best to be 100% critical about the Anime - and leave out any bias until the end.\r\nI loved the show.\r\nI have to admit the first thing that stuck out to me was the unique art style. You know that one very bough character thats in almost every show? Yea well imagineall of those characters you can think of jammed into one anime. That'll give you an idea of the art style this Anime tends to lean on. It's also one of the first animes I've personally seen who really takes emphasis on the \"Bara\" Genre. \\n\\n\r\nMoving onto the story. \\n\r\nI can understand why some people might not like the anime solely because of the story. \\n\\n\r\nI will Admit ALL OUT !! lacks character development. Or... at least they don't execute it to the potential it deserves. While watching the anime in my opinion there are really only a few memorable characters. For example in the team there are about 15-20 players - Out of those 15-20 we really only get familiar with about 8 of the players. There were times where I forgot a few players were even on the team. \\n\\n\r\nI feel like the people working on the anime (or Manga) noticed this too, just maybe a little too late. Characters I didn't even know existed or I \"Saw that one time in that one episode\" were given a little story to maybe have the viewers know who they are. The only problem is... they weren't really done.... great. All of them were too short and maybe only focused on for one episode, sometimes not even that much.\\n\\n\r\nFor example theres a character in the team that I'm going to be honest I never knew he was there. I thought at first it was a new character we were going to be introduced to, only to find out hes been on the team all along. He ends up talking with one of the more known characters and its revealed that he has a lot of major insecurities about his position in the team. Rather than focusing more on who this guy is as a character it felt like the only reason he was there was to give a slight bit more information about the other more known character (due to the more known character connecting the lesser known characters problems with what he had to deal with with his brother.)\\n\\n\r\nOr even another example - Theres a character in the anime where hes given an entire episode about his backstory. And actually its a pretty deep one too, something in my opinion a lot of people would be interested in learning more about. Granted unlike some of the other characters he was actually given an entire episode. But even this ONE episode felt like it was just too short. It felt like as soon as we were about to get really into the drama it was cut short and the problem he was facing seemed to be \"fixed\" at the end of it.\\n\r\nIn a way you kind of feel cheated. Because your'e given a character that has the potential to becoming your favorite and then the show doesn't even properly expand on him. This is done with a lot of the characters, and I understand people who don't want to watch it and eventually drop it midway. The only way to get a grasp of who at least 95% of the players on the team are, is if you completely watch it all the way to the end.\\n\\n\r\nIt's hard because a lot of the side characters aren't really that distinguishable from each other. Especially when they have their hats/helmets on. Usually people can distinguish anime characters by their hair (if they don't have any other striking features about them) but when the hats are on you aren't even given that much, you're left trying to think harder on who's on the screen. There were times where I got lost and thought to myself \"Okay so he got the ball!... but... who is he again?\"\\n\\n\r\nThis is just my opinion but I feel like the people who were creating the anime didn't think it would be picked up for a second season therefore in the 25 episodes limit they were given, they tried making sure majority of the story was fit into that space. In which case some elements the story needed was cut short and squished together.\\n\\n\r\nStill don't let what I have just told you discourage you or make you turn away from watching this anime. \\n\\n\r\nWeirdly theres something about this show that keeps you interested. And I feel like it only works BECAUSE its a sports anime. If it was any other Action, Fantasy, Romance driven anime I think generally everyone would hate it. But because its a sports anime, theres a trait to the show that not a lot of animes have. \\n\\n\r\nWhen I was watching the show there wasnt an episode where I was bored or wanted to skip. Every episode was generally interesting in its own way. Though some side characters are hard to remember, the main characters (those 8 I talked about earlier) keep you grounded into wanting to see more of the show. This coming from a person who knew nothing about rugby before watching it - other than that its a sport that you're allowed to tackle someone in. \\n\\n\r\nI think it's because (and again this is just my opinion) this show drips with potential. It has the potential to be even greater than what it is. This is a show that a lot of people can hop onto if done just a smidge more differently.\\n\\n\r\nI feel like for some if you watch the entire anime - afterwords you'll be given an answer to what the show is kind of about. You'll be left with \"Ohhh, this is the type of show it is\" even if you don't know what direction its going in while watching it. \\n\\n\r\nThis is where my bias starts to come in. I can agree universally it isnt \"The Best\" Anime out there - however it is a darn good one. It has its flaws but it isnt so prominent where its distracting. It kind of just goes with it's own flow - and I think thats exactly how you should watch this anime. See it's flow and then try to follow along with it.\\n\\n\r\nIf you're not too.... \"critically moved\" when watching stuff - meaning for example: Theres a flaw within the show so that means I should just drop it. Or, Ehh this show sucks in this particular area so I guess I won't watch it anymore. If you stick with a show even when noticing a flaw in it - I think You'll like this Anime. And agree somewhat with me.\\n\\n\r\nI really do think everyone should give it a proper chance. Overall in its entirety it is a really good show. I feel like you would be making a mistake to just disregard it and move onto something else. \\n",
            "date": "2018-10-11T22:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 291546,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5249979.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Poisen-paradise",
                "username": "Poisen-paradise"
            },
            "url": "https://myanimelist.net/reviews.php?id=291546"
        },
        {
            "content": "After reading and watching the poor reviews for this anime, I felt an obligation to write this review to dispel some of the negative conceptions.\r\nI gave All Out!! really high scores and I'll tell you why...\r\nAfter watching episode 1, I wasn't really too impressed by it. In fact, I was a little annoyed at the short, hot-tempered character cliche that was the main character. But as I kept watching, I started to grow a fondness towards it.  \r\nWhat makes this show so enjoyable is the dynamic characters that continuously surprise you. My first impressions of Gion, Sekizan and Ebumi were not great, I'm notgonna lie. But now, they are my favorite characters. \\n\\n\r\nAlso, the action! The animation is truly amazing and it keeps you interested. I won't say too much, but episode 6 is a must watch.\\n\\n\r\nI noticed the anime was getting a lot a poor reviews by mainly guys who were just complaining about the revealing uniforms the boys wear and the unrealistic body standards (interesting, eh?). \\n\\n\r\nBut please, don't let the booty shorts stray you from watching this incredible anime. It's a great show, the butts are just a bonus!",
            "date": "2017-03-07T09:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 242058,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4971647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/aries0770",
                "username": "aries0770"
            },
            "url": "https://myanimelist.net/reviews.php?id=242058"
        },
        {
            "content": "All Out!!! was like a mecha anime but the human bodies as the machine.  I initially gave this anime a 6 but since then have rewatched this one twice and always find new reasons to watch it.  For a sports anime, its entertaining and I actually learned a lot about rugby; a sport I seem to always end up watching on the weekends but never fully understood until now.\r\nBesides being educational, the characters and their interactions were entertaining.  It kept with a common anime theme of overcoming insecurities and difficulties then yelling \"I got this!\" or \"I won't give up!\".  Therugby playing scenes were also intense and fun to watch.  I always wanted to go train or hit something afterwards.\\n\r\nAs a woman, I also found it refreshing to have a break from busty girls.  Besides a few slice of life animes, there always seems to be that one girl overflowing with boob.  Finally, an anime for chicks where the men are tall and muscular (except for one of the main characters who is short but stalky).  No skinny jean wearing characters or long haired pansies in this show.  Just big guys with big muscles and even larger dreams.",
            "date": "2018-03-20T08:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 274372,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5973670.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/COGirl1985",
                "username": "COGirl1985"
            },
            "url": "https://myanimelist.net/reviews.php?id=274372"
        },
        {
            "content": "7/10 The story? sports yass.\r\n3/10 Art? The muscles and body figure were too exaggerated, the kind of student that were once Pro rugby player and were put in highschool all over again. A slight muscle would've been okay but ugh...\r\n6/10 sound? didn't really focused on the sounds but it seems pretty average to me, nothing that caught my ears.\r\n5/10 character? Your average anime personality, nothing too \"new\" in this era of animes.\r\n6/10 enjoyment? so far so okay.\r\n6/10 overall? just another anime that I just watched and given an \"okay\".\r\nMy rating summary guide\r\n1=You have angered God thus creating Judgement day :( \r\n2=Studying Math is better \r\n3=whatis this trash \\n\r\n4=wat \\n\r\n5=um \\n\r\n6=okay \\n\r\n7=nice \\n\r\n8=another similar anime? \\n\r\n9=wow omg!! hype!!\\n\r\n10=impossibru, you make God happy and the entire existence is saved",
            "date": "2017-02-13T15:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 240535,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3619569.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jasteraz",
                "username": "Jasteraz"
            },
            "url": "https://myanimelist.net/reviews.php?id=240535"
        },
        {
            "content": "I love sports animes. With a complex web of character relationships across a large cast, anime-fied take on tactics (actually more enjoyable when you don't know the sport, and in this case, I didn't know rugby), and ability to vicariously live the simple up and down emotions of winning and losing, the basic hallmarks of a sports anime is an easy well-worn track for All Out!! to follow. Beyond the blueprint, however, All Out!! does a few things very well and one thing not so well.\r\nStarting with the pros:\r\n1. All Out is very self-aware. When the main character Gion first joins the team, the showrealizes an alphabet soup of names is not going to be helpful for the audience, and realistically not helpful to someone meeting a gigantic group for the first time. So they tell Gion and by extension, the viewer, oh well, you'll pick it up as we go. And it follows through with mostly organic introductions and interactions, rather than strictly regimenting meeting one or two new side characters per episode.\\n\r\n(Also, rather than having a character seem suspiciously too similar to Hiruma from Eyeshield-21, the show instead goes full homage complete with the \"ya-ha\")\\n\\n\r\n2. Characters do not remain boxed in cliques. Everyone interacts with everyone else. The dynamics within the third years and between the second years and third years, and between people in the same grade across different schools flourish independently of their relation to the main character.\\n\\n\r\n3. The adults interact with each other and offer viewpoints beyond the X's and O's of the game. It's difficult to elaborate without spoilers, but the adult characters in All Out are more fully realized than other shows that have mouthpieces for training techniques and game tactics.\\n\\n\r\nAnd now the con:\\n\r\nAll Out does not sustain drama. Main character Gion's issue is that he's short, but it's quickly evident that the people who recruited him weren't lying, plenty of rugby players in this show are of similar height. His bigger issue to being new to rugby, which also isn't really an issue unique to him at all. Also, while some themes are carried through the show (club was not competitive when the current third-years were first-years), the heaviest drama is reserved for sudden punches of serious issues with little foreshadowing and little follow-up.\\n\\n\r\nSo in conclusion, if you like sports anime, realistic feeling group dynamics, or just a total blank slate looking for the basic flow of a rugby game, you should watch All Out!! \\n\\n\r\nArt: 8 (some very...unique character designs can be hit or miss, animation-wise, there were a few places were stills were noticeable, but overall the rugby movements and character expressions are well done)\\n\r\nSound: 6 (I rarely notice voice acting unless it's particularly amazing or atrocious. All Out's VAs were fine, and the first OP/ED were decent. The second OP/ED were not my cup of tea, but All Out mostly loses points due to its lackluster background music.)",
            "date": "2018-01-29T02:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 269992,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/221452.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Selinea",
                "username": "Selinea"
            },
            "url": "https://myanimelist.net/reviews.php?id=269992"
        },
        {
            "content": "I just finished this anime and decided it was worthy of a review. I have not read the manga yet and I will try and make this as spoiler free as possible.\r\nI am a fan of sports anime and decided to give this one a try and am glad I did.\r\nAs far as sports anime go this one followed my rules as in making it easy to follow the sport (rugby) and room for character growth. I personally love it when background characters have their time to shine and this one does that and then some.\r\nThe art was great the characters are very well rounded.You won't see five guys with the same face/build here. the uniqueness in character design really shines as well.\\n\r\nIt was a very enjoyable ride with this new team trying to make a name for themselves. \\n\r\nThe season ended with so many more stories to be told that I'd be shocked (and disappointed) if there isn't more seasons to follow.\\n\r\nIf you enjoy sports anime then I highly recommend this one. Even if you are not familiar with rugby you will learn the basics and the lovable characters will draw you in. Madhouse did a great job with the aesthetic and I was really surprised that it hasn't gotten much recognition. \\n\r\nGive it a go! you may find yourself pleasantly surprised.",
            "date": "2017-08-29T19:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 256497,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6012165.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Oona_Shea",
                "username": "Oona_Shea"
            },
            "url": "https://myanimelist.net/reviews.php?id=256497"
        },
        {
            "content": "aehm ...\r\nNo quite Kuroko CGI and camera angles or Hajime no Ippo yet i find myself at 9 am on a rotten monday strangely not annoyed by anything at all after three episodes; which, after passing on 10 others after 5-10 minutes of the first eps is a welcome relief on this broke soon to back unemployed hunting for needle in a haystack jobs without an electromagnet-day.\r\nConsidering the fact that im an overstimulated quality junkie with mutant alien blue blood this probably means i should be able to finish the whole season unless they resort to below the belt or panties comedy after a fewfor lack of inspiration or ratings. I dont know if these series are done when they're released or not. Im new to the scene but as old as saint seya and hokuto no ken \\n\r\nwhcih actually taught me my first french since the only place to see was french tv just like the only place to find goldorak was luxembourg. See im losing topic again, i always do that. Too much in my head and brainfog.  i think there's a rumble in the jungle downstairs\\n",
            "date": "2017-02-19T23:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 240973,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/retorica_t",
                "username": "retorica_t"
            },
            "url": "https://myanimelist.net/reviews.php?id=240973"
        }
    ],
    [
        {
            "content": "Keep in mind that this is just my personal opinion.\r\nStory:\r\nKenji Gion is a dwarf. He meets a slightly taller guy named Iwashimizu, who despite his immense height is a total pussy. Kenji has never been accepted into any sports clubs because of his lack of height. However, not unlike a certain Eyeshield 21 he finds out that rugby is a nice, peaceful and happy sport where even a smurf could have a meaningful position. The captain takes him into the club with open arms and gets tackled. Here is the basic setting where all sorts of hijinks develop from. Very basic, very cliche, but interestingnonetheless since I have never heard about a rugby anime before. Kenji works as a main character because he's a novice and hardly anyone watching this actually plays rugby, and thus that sort of justifies the over-explaining of basic rules - so we know who's winning, who's losing and what is actually happening. I happen to love training montages and authors explaining actual tactics and techniques, so it's intriguing to see what Gion decides to do in different scenarios, e.g. tackling a bigger opponent, dealing with feints and so on.\\n\\n\r\nCharacters:\\n\r\nAs there are many positions to play in rugby, there are many personalities in play as well. Gion being the hotheaded MC who miraculously turns the match around in one tackle / pass / piss or whatever, Iwashimizu being the suppressed genius that holds himself back, Sekizan being the great captain that isn't as great as thought after all, Ebumi being the slacker tough guy who actually practices the hardest etc. I don't mind cliches and tropes, but c'mon now. The voice actors do a good job, though. With time, I also found myself somewhat immersed in their stories, despite them being quite unoriginal. \\n\\n\r\nSound:\\n\r\nI don't remember any of the soundtrack, so I guess nothing special in that regard. As I mentioned above, the voice actors do what they do well.\\n\\n\r\nArt:\\n\r\nOtherwise I wouldn't have a problem with the art style since it brings a very dynamic and vivid feeling, but some of the guys look like they came straight outta Chernobyl. Like seriously, the brown haired jaw guy must have some facial bones broken or a growth disease. Another one has two devil horns for hair, Sekizan has toilet paper in his and Ebumi is Hiruma with hair wings. The last one wasn't even a joke, he literally says \"Ya-ha\" in some cases which was Hiruma's catchphrase originally. \\n\\n\r\nAlso, I don't think the author knows how clothing works. The rugby players look like they just arrived from a wet t-shirt contest. I guess you could think that they sweat furiously, and the fabric sticks to their tight clothing or something like that.\\n\\n\r\nEnjoyment & overall:\\n\r\nI feel a bit odd bashing the show while I watch the episodes from start to end without getting distracted. Even though I realize that this show is the type that grows on you, it still feels lacking at times. That's why I decided to give it a 6, also considering the studio's other releases and how they handled them far better. I get that run-of-the-mill-anime feeling a bit too much.",
            "date": "2017-01-10T03:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 237931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675284.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mertsi",
                "username": "mertsi"
            },
            "url": "https://myanimelist.net/reviews.php?id=237931"
        },
        {
            "content": "You know that sport overshadowed by the other?\r\nSo you observe an anime about it, it is thought \"You should approach only basic things, a story of a team that will beat everything\"\r\nWell it is not well not, the anime has surprised me with the theme of rugby, in addition that such a hard head protagonist who does not like that others call him * softly *, yes even a small but determined protagonist he wants to demonstrate the Force him to the others who are much bigger, he will break the obstacles from the height and knock them all off the feet !!\r\nA great choicefor those who like sports, yes the story is great, the theme is also clear and the evolution that is occurring between the characters is absurd.\\n\r\nFabulous",
            "date": "2017-01-06T07:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 237588,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4104629.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gaaldinodesu",
                "username": "gaaldinodesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=237588"
        },
        {
            "content": "All Out 25/25\r\nSo I'm not usually big on the sport anime but I found that I enjoyed All Out. The story definitely picked up after they got the new coach, and it was nice that they explained some of the rugby rules and strategies throughout the show so even if you didn't know much about rugby you could still pick up a few things. I liked that this anime didn't fall into the \"friendship/team mates\" or \"work hard and you'll beat the best team after 1 practice session\" trap which a lot of sport anime tend to do. I hope this gets a second seasonbecause I'd like to see how the story develops and how the team does at Hanazono.",
            "date": "2017-04-01T12:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 244272,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6140728.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mona_04",
                "username": "Mona_04"
            },
            "url": "https://myanimelist.net/reviews.php?id=244272"
        }
    ]
]