[
    [
        {
            "content": "A description of Nanbaka is probably going to make it sound real dumb. This is likey because it really, really is. But the fact it is dumb does not preclude it from being entertaining, and I assure you that it is nothing if not that. I 100% recommend watching it if you are:\r\nA.) In the mood for something funny.\r\nB.) Unbothered by something being really stupid.\r\nC.) Equally unbothered by anime being weird for weird's sake.\r\nStory:\r\nI can best sum up Nanbaka thusly: it is pretty much what would happen if you transformed the Looney Tunes into bishy anime twinks with FABULOUS hair and threw them into afacility that is simultaneously the worlds most secure prison and the worlds most liberal Montessori preschool. So like Tiny Toon Adventures meets Orange is the New Black. Specifically those two shows, because like Tiny Toon Adventures the characters seem to have the impulse control of infants and can pull seemingly whatever they want out of Hammerspace and like OITNB everybody is kinda compelling and pretty fabulous and kinda gay and in prison. If that doesn't sound fun to you, you probably won't like it. We would probably also not be friends, because it sounds like a whole bunch of fun to me.\\n\\n\r\nArt: OH MY GOD REALLY GOOD! It is a joy to look at. The color is hyper-saturated, lime green and hot pink and crazy in the best way possible. It is exciting and surreal, which helps you suspend your disbelief over the antics of the ridiculous plot and characters. The art puts me in the mood to have fun, which the show then offers. 10/10, this is what art should do for an animated show: inform you by design alone what kind of show you are watching.\\n\\n\r\nSound: Also awesome. The opening song is pretty cool: rocky J-Pop paired with some fun imagery indicative of the mood of the show. The ending, however, is the shit. It's more or less chibi versions of the characters running around escaping from prison while they all sing a song together. I love it and watch it every time. It is charming and funny, and always made me want to watch the next episode.\\n\\n\r\nCharacter: Over the top and too much, but so is the show and consequentially it more or less works. The main 4 are all pretty funny and engaging, although main guy (#15/Jyuugo) is kind of a sad sack these days. Everybody has more or less exactly one joke that they are used to tell over and over, but the joke seems to always land despite being repeated ad nauseam. They are either manic and adorably annoying, or unvarying serious to the point that they cannot themselves be taken seriously. Sometimes both at once (The Warden). Special shout out goes to Nico, the hyper kid who takes a bunch of drugs and is really into stupid anime, because he is basically me. I just wanted to hang out with him and smoke a blunt and watch G-Gundam (secretly the best Gundam despite what everybody else who has ever watched it beside me and Nico might say).\\n\\n\r\nEnjoyment: Loads. This show isn't going to teach you anything. It's not going to tell you anything profound, it will just make you laugh a bunch. If that is enough for you, give it a watch. I did and do not regret it in the slightest.",
            "date": "2016-12-31T10:20:00+00:00",
            "helpful_count": 94,
            "mal_id": 237096,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983772.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jRad522",
                "username": "jRad522"
            },
            "url": "https://myanimelist.net/reviews.php?id=237096"
        },
        {
            "content": "NEVER TAKE THIS SHOW SERIOUSLY \r\nNow that that's out of the way, I found enjoyment in this show though the hilarious imagery and funny jokes. \r\nTHE STORY is mediocre at best, but it's a comedy, so there's not much you can expect. \r\nTHE ART is great. It's the main focus of the comedy element and sometimes is a bit too lenient on it. The art by itself  though colorful and wild is sometimes a bit eye bleeding.\r\nTHE CHARACTERS aren't varied. They are all just comic relief, which makes them seem  bland overall. \r\nOVERALL I liked this show, not to where I'll be recommendingit, but it made me laugh and I think a comedy shows goal is to make you laugh and this show accomplishes it's goal.",
            "date": "2016-12-30T06:17:00+00:00",
            "helpful_count": 33,
            "mal_id": 236958,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5814189.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/StrawberryEmmie",
                "username": "StrawberryEmmie"
            },
            "url": "https://myanimelist.net/reviews.php?id=236958"
        },
        {
            "content": "The action/comedy multi-genre is saturated with great shows and awful shows. The great shows are not only deliver brilliant action scenes through the quality of the technical aspects, they’re also hilarious and consistent with the comedy. The poor action/comedy shows either skimp on the quality of the art and sound involved or lack consistency in the comedy or both. Action/comedy shows are at their best when they’re funny or exciting but not when they drift off into needless drama.\r\nNanbaka falls between the two; it starts out great with an interesting premise and acceptable comedy. But it loses its focus along the way near the endof the series and slowly becomes boring.\\n\\n\r\n[Repeated prison escapists]\\n\r\nNanbaka is an action/comedy anime series based off a web manga originally created by Futamata Shou and his influence glows throughout the show. It is directed by Takamatsu Shinji, who’s directed brilliant comedy series like Gintama and The Daily Lives of Highschool boys. The series is revolves around the daily antics of four inmates in the self-proclaimed, most formidable prison in the world. The inmates of the infamous ward 13, Juugo, Uno, Rock and Nico, often try to escape the prison’s walls and are always stopped in their tracks by the fearsome guard, Sugoroku Hajime. But Juugo is also on the lookout for the man who gave him his unremovable shackles and his colleagues question their motives for trying to escape the prison.\\n\\n\r\n[An interesting premise abandoned]\\n\r\nNanbaka begins as a ‘gag’ comedy with an interesting premise: the main characters frequently try to escape from the prison. In the first few episodes, we see them break through several high security gates only to be caught and beaten by the head guard, Hajime. The hilarious execution of this premise coupled with the diverse skill set of the inmates makes these episodes interesting to watch. The premise also leaves a lot of room for creativity; the prison could be viewed as a dungeon, for example. As thin as the plot was, it was replaced by a pointless intra-prison arc.\\n\\n\r\nThe intra-prison arc was not boring by any chance; it was even more exciting than the initial episodes though less creative. The event introduced most of the cast of the show and showcased the abilities of the inmates and guards alike. It was hilarious and full of explosive battles with fluid animation and lots of special effects. It was pointless but still fun to watch. Unfortunately, the show slides into a series of dramatic sketches following the last battle in the arc.\\n\\n\r\nThe last few episodes seemed like the opposite of the first episodes; they had direction but were boring. They just seemed to tick off all the common tropes for drama present in an action show; a self-deprecating main character who learns to lean on his friends. It wasn’t awful; it just wasn’t what was sold by the show at the start. Also, the drama would have been better had there been more characters involved.\\n\\n\r\n[A diverse and wild cast]\\n\r\nNanbaka has a large cast of characters from various nationalities. Some are declared in the show like Juugo’s British and American fellow inmates. Others are inferred from their design like the inmates of ward 5. With this comes a variety in the design; some inmates wear their prison clothes while others do not. Unfortunately, the personalities aren’t as diverse. Almost all the characters, inmates and guards alike are hyperactive and aggressive; most of the inmates have no motives at all. Only the main characters seem to want other things hang out in prison.\\n\\n\r\nJuugo likes to break out of his cell, 13,  for the fun of it; it’s later revealed that it’s the only skill he has. He’s also in search of the man who placed shackles on him but this only becomes a focus of the show much later. Uno is the self-proclaimed pretty boy of his cell; Rock is the muscle who likes to eat and Nico is playful and immune to drugs. That’s about all there is to them although they reveal other skills that only last the duration of the intra-prison event arc. The other characters of note are ward 13’s head guard, Hajime, who’s a workaholic and the warden who has a crush on Hajime. Fortunately, what Nanbaka lacks in characterization, it makes up for in its art and character design.\\n\\n\r\n[Glitter, gloss and pretty boys]\\n\r\nThe art style of Nanbaka is distinct and loud. The background and character art is sharp and colourful; the colours are bold and bright; the characters are drawn with prominent outlines. It’s artstyle is similar to that of Jojo’s Bizarre Adventure but it’s recognizable for the tones of colour used. It’s uniqueness lies in its overall theme: femininity.\\n\\n\r\nIt’s difficult to miss the glitter that pervades the environment in the show. The characters glitter, the prison walls glitter, even the ocean that surrounds the prison glitters. In addition to the glitter is the gloss that’s also on everything, from hair to their clothing. The characters also tend to wear more jewellry than the average male and often have painted fingernails. Then there are characters that are effeminate in their appearance, voice and mannerisms. This art style, coupled with the jazzy themes, gives the show a 70s feel.\\n\\n\r\n[Jazzy with a spice of rock]\\n\r\nThe opening (Rin! Rin! Hi! Hi!) gives away the catchy jazz style that pervades the entire show. It’s a brilliant intro to the flamboyant show and one of the most memorable for me in the Fall season of 2016. Sadly, only Uno’s melody (a score that plays when he’s about to play a trick) comes close to being as memorable as the opening music. The rest of the scores are either gentle jazz tunes or generic rock music that’s designed for fight scenes in anime.\\n\\n\r\nI wouldn’t say I enjoyed Nanbaka in its entirety as some of the episodes were a chore to watch, often because of the obvious drama. The comedy grows less hilarious past the halfway point; it even loses its most popular running gag. The show was mostly enjoyable for its first few episodes and its flamboyant art style. It did get its technical aspects right and would have been a much better show had it stayed on course.",
            "date": "2016-12-29T09:40:00+00:00",
            "helpful_count": 28,
            "mal_id": 236860,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647223.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gnerkus",
                "username": "gnerkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=236860"
        },
        {
            "content": "Many have heard the old proverb, \"If you chase two rabbits, you will not catch either one\". By extension, the more rabbits one chases at once, the harder each is to catch. Nanbaka takes this a step further: it starts going after one rabbit, then gets distracted by a bird and later a fish. It unfortunately fails to catch any of them, but at least it looks cool trying.\r\nAt its core, Nanbaka is a zany, colourful gag comedy in a prison setting! ...Or is it an action shonen? No? A character drama? In practice, it frequently switches targets when it may have been wiser tostick to one.\\n\\n\r\nFrom the get-go, Nanbaka presents a fast-paced series of varied jokes, ranging from visual humour to ironic subversion to borderline non-sequitur. They weren't exactly original, and didn't get to me personally, but variety and quick pacing are handy tools for holding interest whenever a punchline doesn't quite hit the mark. At this point, I respected Nanbaka for what it was. It had a clear identity, and showed commitment to it.\\n\\n\r\nHowever, the show quickly lost its focus from there. In my eyes, a lack of focus is one of the fastest ways to kill viewer interest, and often a sign of poor writing. Nanbaka soon falls into this trap; rather than continuing its gag comedy roots, it tries to take on multiple identities at once. As soon as the action and drama arrive, the pacing slows considerably and the jokes become less varied or frequent. This would be fine if the new elements meshed well, or were at least strong additions to the series, but instead, they just make things messier.\\n\\n\r\nThe action elements suffer from weak choreography. This is expounded on by mid-action cuts to narration by onlooking characters - an issue seen in many action anime. For once, Nanbaka could have made this trope work in its favour by filling the narration with its usual zany jokes. Alas, it's just the usual filler dialogue to stretch out the no-longer-action while explaining attacks that didn't really need to be explained and/or stating things that are obvious to the viewer.\\n\\n\r\nDespite the action portion's weaknesses, the drama is where I find Nanbaka to be the least successful. At these points, the show suddenly takes on a more serious tone than the accompanying gag comedy and action. This results in a weird situation in which a viewer is simultaneously expected to take the show seriously while also not taking it seriously at all. It's not the tonal shifts that are the issue - rather, it's their frequency and the show's inability to sell them.\\n\\n\r\nFurthermore, compelling drama requires compelling characters - something Nanbaka does not have. Most of them come down to one-dimensional quirks or hobbies and maybe the occasional simple backstory. They're too simple to be interesting on their own, and it makes investment difficult.\\n\\n\r\nAnd this brings up what I believe to be Nanbaka's main weakness, and the source of nearly all its problems: it's characters. Even with its wildly differing subject matter, this show certainly wasn't doomed from the start. It simply lacked the tools needed to succeed. While there were several things that could have helped the show (improved action pacing and choreography, or a more memorable soundtrack to quickly and effectively shift tone), ultimately, I believe that characterization is the one key missing weapon it really needed to hit all its desired targets.\\n\\n\r\nStronger characters can create chemistry which helps to sell the comedy and elevate it from \"gag\" to \"riot\". In turn, these jokes can be a quick and effective way to show characterization. From there, these improved characters help to invest a viewer before the show switches to action, and when drama builds, the viewer will more readily buy into it. But without this depth of character, the act falls apart, undercut from its very foundations.\\n\\n\r\nDespite all my criticisms of Nanbaka, one positive I can mention is the show's art. It has a unique, sparkly, insanely colourful style that immediately draws attention. I'll admit, this alone made it easier for me to sit through Nanbaka's weakest points. The style, however, is not nearly enough to carry the show on its own against its many weaknesses.\\n\\n\r\nIn the end, Nanbaka gets a tad too ambitious for its own good, and misses the fundamentals as a result. What could have been a notable series sadly ends up as a disorganized, zig-zagging mess, with no clear identity beyond its visual style.\\n\\n\\n\r\n- FINAL SCORES -\\n\\n\r\n* Critical quality (includes story, characters, presentation, etc): 2.5/10 - Plagued with numerous crucial issues that hindered the show's success, but is slightly redeemed by its art.\\n\\n\r\n* Memorability: 3/10 - While Nanbaka's style sticks out, the complete lack of notable or unique substance and disorganized handling of its content makes it unlikely to be remembered in 6 months.\\n\\n\r\n* Enjoyment: 3/10 - In addition to Nanbaka's comedy not being my cup of tea, its lack of focus or characterization made this a chore to watch. Only the colours kept me from dropping it.\\n\\n\r\n* Overall: 3/10 - Of the Fall 2016 shows I watched, this was my least favourite for all the reasons described above, and I can't recommend it. It wears itself out quickly, and when it does manage to catch a rabbit, it's not a particularly tasty one.",
            "date": "2017-01-30T20:32:00+00:00",
            "helpful_count": 8,
            "mal_id": 239556,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450073.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Plasmatize",
                "username": "Plasmatize"
            },
            "url": "https://myanimelist.net/reviews.php?id=239556"
        },
        {
            "content": "If you want to try watching something different from what you usually watch, then this anime is perfect for you. I would recommend this anime to you 1000% \r\n~Spoiler Alert~ (Not much tho)\r\n~Read at your own Risk~\r\nStory(8)- It's about 4 guys who break out of prison with their special abilities and their desires. But after they find the things they desire for, they stop breaking out of prison and stay in the prison, because it provides them with the things they want (not all of them).It mostly focuses on Juugo (MC), who doesn't have something that he wants. \r\nArt(10)- I cannot explain how amazingthe characters and backgrounds are drawn. (The sparkles are everywhere) The prison is very beautifully drawn/ designed. The art in this anime matches perfectly with the situation. It's bright, vivid, colorful and stands out the most. The art is really different from the other anime we see. (THE CHIBI VERSION OF THEM- ITS TOO CUTE!!!)\\n\\n\r\nSound(10)- The characters sound really hot and the opening song and ending songs are very catchy. (I usually skip the opening songs but the opening song in this anime is so catchy and good that I don't skip it)\\n\\n\r\nCharacter(9)- Some of the characters are really weird but that's what good about it. The character are very recognizable because of their unique features. (Big hairs, huge body, strange scares or strange spots.)  \\n\\n\r\nEnjoyment(10)- This anime will cheer you up no matter how sad you are. (It worked for me C:) It also gives a message like \"It doesn't matter how skilled you are with a lack of desire.\" \\n\\n\r\nOverall(9)- I would give 9/10 overall because I really like how its funny but serious. The story is gives a mysterious yet joyful vibe which is very unexpected. What I am trying to say is that, this anime is very different from the Anime that we all usually watch.",
            "date": "2017-12-28T19:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 266692,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5651504.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animumbug",
                "username": "animumbug"
            },
            "url": "https://myanimelist.net/reviews.php?id=266692"
        },
        {
            "content": "Pretty good anime, at least good enough to watch without feeling bored. There were a few laughs to be had here and there. I like most of the characters, although I pretty much hate hajime the guard, that bastard can go and die somewhere. I also dislike the female boss, she just can't stop being lovestruck all the time and it pisses me off, especially since I hate the one she likes.\r\nThe story is so-so, kinda average, nothing special at all. The art is pretty nice, I like the style although the colors feels a bit too flamboyant. The sound is great, well, at leastthe opening song, I was really fond of that one. The characters are nice in some ways, at the very least they feel kinda unique, but I feel like too much effort was put into making them too extreme, the author should learn some moderation, medicine in great quantities becomes poison, that concept applies to pretty much everything in this world. Too much is never a good idea(well, at least in normal circumstances). Overall, my enjoyment was pretty nice for most of the anime.\\n\\n\r\nWhat annoyed me the most here is that the author chose to screw up big time because he wants to put serious stuff and drama into the anime. It just DIDN'T work at all, it ruined the entire anime. Maybe I should've lowered my score even more, giving it a 7/10 is very generous considering the huge flaws. This show was never meant to be serious, at least it shouldn't have. The only good part is the comedy and interaction between the characters, but the decision to put drama, tragedy and whatever else into it as well and drag it out for WAY too long was a horrible one, utterly horrible. The real tragedy here is that they felt it was a good idea and thus murdered a show that could've been so much better.\\n\\n\r\nThis is especially the case since I couldn't care less about these characters, I'm used to extreme tragedies after reading certain stuff and this shit can't even make me feel anything at all. If I wanted drama and tragedy, I wouldn't watch a screwed up anime like this. I would watch a proper serious anime or read a manga or novel like that. Putting stuff like that into a f*cked up anime like that? Come on. That's like putting a bloody beef into your sweet, creamy cake. Who would want to eat that crap then? It's incompatible, it's either one or the other. Changing styles suddenly is just bullsh*t and always ruins things. Not saying comedy and tragedy/drama is always incompatible, but when it's done like this, it indeed is.\\n\\n\r\nI saw that a lot of people say the second season is way worse and reduces the comedy a lot, well, I'll try to watch it and see if that's truly the case. If it is, I guess it's best to drop it fast because it's not worth watching. Well, to be fair, I guess that the manga version might actually be better. The serious parrts would be over quite quickly since you can speed read easily 10+ chapters in the time you watch one episode.",
            "date": "2018-10-19T17:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 292104,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=292104"
        },
        {
            "content": "Nanbaka is a prison comedy series. The manga was originally written by Futamata Shou. In late 2016, Satelight began airing an anime adaptation. You may remember them as the studio behind Heat Guy J & Sousei no Aquarion. So, how does this one compare to their other works I've reviewed? Let's take a gander. \r\nStory:\r\nNanba is, supposedly, the world's most formidable prison. With the toughest guards, the most inescapable perimeter, the sparkliest design and the finest dining and recreation services. We follow four prisoners, Juugo, Uno, Rock & Nico, who have escaped from prisons all over the world as they go about their lives andmake trouble for the guards. Insert shenanigans here. \\n\\n\r\nThe biggest issue with this series is that it attempts to blend zany, really over the top comedy, with some more serious back stories and an underlying plot about a certain character having serious enemies who may well pose a threat. This results in a pretty significant case of tonal clash. Then we have the humour itself. Honestly, it doesn't work a lot of the time. A lot of it is based around the characters being stupid or something over the top and random happening. I've talked about this before with a different less than good comedy, but randomness isn't funny. A good zany, absurd comedy will have some internal logic that will be largely consistent, being bent on rare occasions for a jape. Pure randomness is what you get when an eight year old tries to make up a joke. “So, a guy walks into a pub and asks the bartender for a pint. The bartender says, 'I can't serve you. I'm a cockatoo.' And the guy looks up and notices that he is.” And it's not funny but you give them a pity chuckle because they're eight. Problem is, this was written by an adult who should know better. \\n\\n\r\nThat being said, some of the goofs based around characters acting like idiots are pretty funny. There are times when those get executed well. I'll give it credit on that, it does have some funny bits. \\n\\n\r\nCharacters:\\n\\n\r\nThe major inmates in this series can all be described very simply. They have a tragic back story and very little personality. Now, I have maintained that a comedy doesn't need deep, complex characters. It needs characters with strong dynamics who can play off of one another really well to deliver the laughter. However, the whole tragic back stories element and the more serious stuff the series tries to do arguably makes this a series that should have more complex characters. Even putting that aside, the character dynamics are pretty underwhelming and don't generally lead to good comedic moments. A lot of the side characters suffer from one joke syndrome. Take the Warden. Her joke is that she has a crush on Hajime, the guard in charge of our protagonists, and people misinterpret her intense gazes. \\n\\n\r\nArt:\\n\\n\r\nThe art isn't very good, to put it nicely. While I will give it credit for having unique character designs, the backgrounds are pretty lazy. Additionally, Satelight made the perplexing decision to put everything in sparkle vision. I'm not kidding, the entire bloody anime is sparkly. Now, here's the thing. Sparkle vision can work when used in certain circumstances for comedic effect. Fullmetal Alchemist is a great example. However, putting everything in constant sparkle vision doesn't have any comedic effect. Instead, it just hurts your eyes. \\n\\n\r\nSound:\\n\\n\r\nThe cast in this is perfectly passable. I can't call them brilliant in this, or even good, but it's also one of those series where the acting can't make up for the lack of characterisation. The music was handled by Fujisawa Kenji and it's all right. Which may actually make it the strongest element of the series. \\n\\n\r\nHo-yay:\\n\\n\r\nThere's a bit. We have the gay stereotype character voiced by Kimeru. Juugo also mentions liking both guys and girls, and there are reasons to believe he was serious. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nNanbaka is a pretty weak comedy. It suffers from tonal problems, humour that falls flat more often than not, constant sparkle vision and dull characters. That being said, it does have its funny moments and I can't really say it was bad. If you're a fan of randomness and comedy stemming from characters being morons, you might enjoy it. For me, the final rating is going to be a 4/10. Next week I'll look at Osomatsu-san, which will hopefully be a better class of comedy.",
            "date": "2017-03-22T11:48:00+00:00",
            "helpful_count": 5,
            "mal_id": 243157,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=243157"
        },
        {
            "content": "If there's one thing about anime that I usually avoid, it's either slice of life or more spontaneous gag anime. The latter being the definition of this anime. I originally decided to watch it cause the character designs were interesting and as an aspiring character designer, I decided that I would give it a go and see what this show was really about.\r\nStory: 6\r\nSince this is a gag anime, usually the story isn't very serious or just has a basic scenario. However, similar to Katekyo Hitman Reborn ( originally a gag manga/anime that turned shounen after 20 eps), the story takes much darker turns hereand there, but never fully explores the darker parts of the story, as it always returns to the lighthearted comedy at some point. There are many questions left in the more dark parts of the story, so therefore the score is reasonable until S2.\\n\\n\r\nCharacter:7\\n\r\nFirst thing I would say is that the character designs in this show are rather unique. Each character is distinct, outrageous and has their own personalities, which fits the show well. The downfall of this however, is that only the main 4 plus random side characters got actual plot stories plus some character development. So there's that. My main problem was the random side characters that got development even though they served no purpose to the main story\\n\\n\r\nArt/Sound 10/9\\n\r\nFirst of all, this anime is BRIGHT. Flashy colors, and literally, sparkles EVERYWHERE. it fits the atmosphere perfectly, as the comedy is just as outrageous as the colors of the animation. In the darker parts of the show, the colors still maintain some brightness, but are slightly muted. My only slight problem is that there were sparkles in the serious parts of the show, which kinda ruined the atmosphere of the scene. The music is only really noticeable during the serious parts, with some nice opera in the background. It does its job. The OP is definitely a favorite though.\\n\\n\r\nOverall: 7\\n\r\nI actually enjoyed this show, and managed to binge watch all the episodes because I loved the outrageousness of it all. Despite the flaws it's still a nice show to watch for the comedy and the outrageousness of the characters. If you want some feel-good/crazy comedy, this is for you",
            "date": "2017-01-01T23:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 237235,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3269951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/xMissMelonx",
                "username": "xMissMelonx"
            },
            "url": "https://myanimelist.net/reviews.php?id=237235"
        },
        {
            "content": "If you came here looking for an immensely meaningful plot that will make you see the world in a completely different way and make you wonder what the purpose of life is, then I'm terribly sorry... you came to the wrong place. Though, if you came here for a short show that will keep you entertained on times when you purely want to watch something simple, but just aren't into those moe-blobs or harem shows, then... nope, not that one either.\r\nNanbaka offers you the typical gag-anime humor consisting of popular shounen anime \"special move\" exclamations and pointless comical moments in the middle of serious fights,but then there is some drama that makes the show seem as it were trying to make the plot deeper, thus make it look like it doesn't know what kind of series it actually wants to be. \\n\\n\r\nThe story is nothing special. Four young criminals with unpleasant pasts, known for always breaking out of every prison they're transferred to, end up in the world's most intimidating prison, where the story is set. That's pretty much the baseline, and while it wasn't that bad at all, the needless drama kicked in, and it ruined everything. Pointless overexaggerating drama, even though it could've stayed a fun and lighthearted series without any drama whatsoever.\\n\\n\r\nThe art is very nice and detailed, which I like a lot. Every single thing on a character, no matter how big or small, has a slight gradiation which makes the art look significantly more detailed. The animation seems pretty solid, as well. The colours are very bright and vivid; just what feels best for an action anime series. On the other hand, we always have those flashy stars around the character that seem kind of pointless. Also, all of the characters have these colourful characteristics, be it hair, eyes, clothes, or all of those together, and while it suits the carefree comedic side it had in the beginning, it quickly gives off the opposing effect when it has its identity crisis. Simply makes it look like a few rainbows fighting to death. Lovely.\\n\\n\r\nWhen it comes to sound, I didn't really notice anything astonishing during the actual show, but I do like the opening considerably. I might also add that the voices suit each character fairly well.\\n\\n\r\nThe characters might be a little cliché at times, but overall they're aren't that bad... that is before it goes up the hill with the drama and they become impossible to relate to, or even just enjoy.\\n\\n\r\nNow, there are still quite a few flaws in this anime, so let me just mention those right now.\\n\\n\r\nFor starters, the show is about 5 different individuals, the four inmates and their guard, so why is it that an episode ends with an intriguing cliffhanger and continues with an entire episode about the backstory of a character who barely even has any screen-time? In that case, a mere filler about just one of the main characters would've been a lot more entertaining. Generally, the show often gives off this rushed feeling, as if they tried developing the story at the last second. Which leads to my next point, what we've all been waiting for: The identity crisis. Typically, an action gag-anime has a lot of humor during fights and such moments, with slight drama here and there to add some spice, but here there's a supposedly serious fight, random humor all over the scene, and then suddenly everyone gets depressing. The anime proclaimed that it's a gag-anime during the show. It seems as though it just can't pick its mind on what it wants to be, a serious action drama show, or a comedic gag-anime. My guess is that it tries to be both, serious and funny, and balance that like other shows do, but it just seems to fail miserably. In my opinion, it would have been highly enjoyable without any drama, if it simply stayed the way it was in the first few episodes.\\n\\n\r\nThe only audience I could imagine Nanbaka for, the way it ended up, is the audience that has just watched a few mainstream shows, and doesn't really care about that story. The audience who just wants some action, which action is kind of unappealing, as well, because it barely has any.",
            "date": "2016-12-28T11:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 236765,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987684.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lefrave",
                "username": "Lefrave"
            },
            "url": "https://myanimelist.net/reviews.php?id=236765"
        },
        {
            "content": "To be blunt, Nanbaka was boring, lacking in plot, had boring characters, and wasn't funny. Lets start with the story: there are some convicts who are good at escaping from jail so they put them in a maximum security prison (all together of course, so that they can work as a team to escape whenever they want to). This idea has potential and if taken seriously it could have been worked into a great psychological thriller, so of course they did the exact opposite when making this show. It's so bright and colorful that there were moments where i thought I was on a badacid trip and was about as serious as the chances of a childhood friend in a rom-com, that is to say, not serious in the slightest. The art didn't want to make me actively bleach my eyes though so that's a plus. The songs were possibly the most vanilla songs I have ever heard in my life. In all honesty I was hoping that the characters would somehow die so that the series could end, I felt not an ounce of emotion for them. It was a mad dash to the third episode with this one watching it at 2 times speed so that it would be over faster. Overall, this anime was just a mess. Its like if Grand Blue wasn't funny at all, so essentially just a big heaping pile of nothing.",
            "date": "2019-04-01T15:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 305192,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7937974.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/IneffableBoredom",
                "username": "IneffableBoredom"
            },
            "url": "https://myanimelist.net/reviews.php?id=305192"
        },
        {
            "content": "Have you ever wondered what's a prison feels like? How about a happy prisoners trying to escape a prison? Sounds unrealistic right? Well, of course!!! This anime tells us that situation. It has a happy go lucky vibe like Beelzebub and Assassination Classroom while you are watching this. This kinda reminded me of the Impel Down Arc of One Piece while watching the first episode.\r\nThe comedy is very funny. Been laughing so hard. The art is amazing where it comes to the point that you can't tell a boy from a girl based from their appearance. The anime is action-packed and very entertaining to watch.The prisoners are funny as hell. The guards are badass, funny and powerful. You cannot predict what will happen next unless you will predict in your mind. \\n\\n\r\nHaving seen both Seasons 1 and 2, all I can say this is a gold comedy and a very entertaining anime. Lots of parodies here. A MUST-WATCH if you want a good time.  Not convinced? There's a hidden dark story here as you go further.\\n\\n\r\nCan't wait for Season 3.",
            "date": "2017-11-02T10:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 262349,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6583206.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Half-MagePrince",
                "username": "Half-MagePrince"
            },
            "url": "https://myanimelist.net/reviews.php?id=262349"
        },
        {
            "content": "Stoy\r\nI started this series off thinking it was just going to be a simple prison comedy and BOY WAS I WONG. \r\nYes, this is a prison comedy but there are times in this series were the mood completely changes. It will be loud bouncy and funny one second then turn to an intense or dramatic scene the next. I was sometimes confused whether I was watching a comedy or a drama because it would break from comedy to have these large emotional dramatic scenes and then go back to its normal bouncy comedy. Also, I sometimes hated the pacing because sometimes it was way toofast, to the point where I needed to pause just to comprehend what happened and other times where the pacing was way too slow and I wanted to bang my head against my keyboard. overall I give the story a 6 because I did enjoy the story but hated the pacing and sudden mood changes.\\n\r\nArt \\n\r\nI really did enjoy the art of this show. The loud bright colors and how practically everything sparkled. I thought the art style played really well into the show's comedy aspects and when they dulled the colors down for the show's drama aspects. the art wasn't breathtakingly beautiful but it was fun and enjoyable perfect for the show. \\n\r\nCharacters \\n\r\nI loved the characters of this show. I believe Nanbakas strongest attribute is the characters of the show. All the characters are enjoyable and each has their own interesting personality and goal.\\n",
            "date": "2017-02-08T14:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 240187,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5602598.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/trashlovee666",
                "username": "trashlovee666"
            },
            "url": "https://myanimelist.net/reviews.php?id=240187"
        },
        {
            "content": "Nanbaka is an action dramady that definitely excels at the comedy aspect, but failed to impress me with its more serious plot-building episodes; which seem to outnumber the mostly or strictly comedic ones. I was just in it for the laughs, but it got totally serious after the tournament arc, after which it dove head-first into hidden dark sides and tragic backstories galore. These were never BAD by any means, just kind of mediocre. This being the case, it was never so dull as to make it difficult for me to finish watching an episode, or several in a row.",
            "date": "2017-01-13T22:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 238243,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4164513.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/The_Ruise",
                "username": "The_Ruise"
            },
            "url": "https://myanimelist.net/reviews.php?id=238243"
        },
        {
            "content": "It's difficult to make a comedy series, mainly because sense of humor is subjective. Nanbaka's comedy was barely noticeable, and even if it was there, it wasn't really funny. But personally, the action and drama parts were better written than the comedy.\r\nThe story is mainly as the synopsis says. There's no story progression as such, and there's just a tournament arc filled with games at the beginning, mostly games where comedy can be introduced in. The action part was also mixed in there, the fights were well done, and the flashy artstyle did not interfere. The comedy part was mainly in the first half ofthe series, with some decent jokes, did not make me cringe, made me grin twice overall, was fairly enjoyable, so I'll take it; it was above average. The second half introduces character backstories, but they were really interesting to see. Tsukumo with his road to discover himself, Juugo and Musashi's story concerning the shackles, and how Juugo united the prisoners of Cell 13. The comedy became secondary here, but the backstories were more interesting than the comedy, so I did not have much complaints. Overall, a solid story.\\n\\n\r\nThe artstyle is seen to be flashy from the wallpaper itself, which is a feature of this anime. It looked good but it was excessive, even though I can understand that the manga used this style too, so props to Satelight for duplicating it and enhancing the character designs. Soundtracks were noticeable too and fit the scenarios, but I wouldn't call them memorable.\\n\\n\r\nI really liked the chemistry between the characters, and Hajime was a badass and Seki Tomokazu just made him look even cooler. Juugo was the most explored character, the others needed more focus but they were supportive of each other and that was nice to see. Even Musashi is great to see as he rebels against the person who ruined his life.\\n\\n\r\nAll in all, I would recommend Nanbaka, but not really for its comedy, unless I'm just not the type to watch this kind of comedy, since others seem to laugh at this.",
            "date": "2018-09-17T10:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 289252,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6612923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/animesscythe",
                "username": "animesscythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=289252"
        },
        {
            "content": "In a world where people are born with nail polish...\r\nStory:\r\nNanbaka is a complete mess. First it starts as a slice-of-life comedy, then it shifts to action shounen, then to drama, then back to comedy and eventually back to drama. I have no idea what the creators were trying to do, but it sure as hell wasn't entertaining the least bit. The main story (if you wanna call it that) is shortly mentioned early on, then forgotten for a good while, then brought back again all of a sudden. Maybe the episode writers should've talked to each other at some point.\r\n1/10\r\nArt:\r\nThe character design is a disaster.These guys are so flamboyant and feminine that it's ridiculous. And everything sparkles. Everything! This is what hell for the homophobic must look like. Animation is solid, the backgrounds look good, but I can't take my eyes off of these ladyboys.\\n\r\n3/10\\n\\n\r\nSound:\\n\r\nThe voice acting is good. Especially the chief warden sounds good, with her dual personality. Opening and ending were not very good however, especially the ending was more annoying than anything.\\n\r\n6/10\\n\\n\r\nCharacters:\\n\r\nMost of them are incredibly boring. The chief warden and her assistant are somewhat funny, Hajime is also pretty cool. But that's about it. Especially the main characters feel very empty.\\n\r\n4/10\\n\\n\r\nEnjoyment:\\n\r\nYou may have noticed that this review is pretty short, especially compared to my other recent ones. But there simply isn't much more for me to say about Nanbaka. It was boring most of the time, the storytelling was incoherent and most of the cast was completely uninteresting. It's not even been a week since I finished this anime and I have already forgotten most of it. If you ever feel the need to completely waste your time, feel free to give Nanbaka a shot.\\n\r\n2/10\\n\\n\r\nOverall:\\n\r\n3.2/10",
            "date": "2017-01-01T12:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 237186,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=237186"
        },
        {
            "content": "Hey folks, this will be a review for Nanbaka. I have mixed feelings about this show as a whole. The overall premise and layout was fun and enjoyable to watch. However the dramatic events that arise are really not that deep or extraordinary as some reviews have mentioned. Its those \"deep\" moments in the later part of the show that really kill the entire thing for me.\r\nThe story revolves around 4 prisoners in the most secure and top secret prison in the world. These four prisoners are well known for escaping prisons, Juugo especially. What seems to start off as a comedy show about escaping,and or making a home in this oddly comfortable super prison turns into a odd mix of mini stories. Each prisoner has some sort of semi tragic back story. However the main focus turns to Juugo as we discover a odd tangle of things involving modifications, super advanced technology, fantasy like super villains...etc.\\n\\n\r\nThe art is strange but very colorful and fun. The soundtrack was enjoyable to listen to as well.\\n\\n\r\nThe characters were a great mix. Juugo, the main character is only good at breaking out of prison. Nico is the otaku character who has the ability to steal peoples moves by observing them. Uno is the woman lover who is exceptional at cheating and has amazing intuition. Rock is the brawny guy who loves to fight, but more than anything loves food. Its a ragtag bunch and the first few episodes you watch as they attempt to escape, pick on the guards and make friends. \\n\\n\r\nMost of the characters are important and have their own back story. However most of the show revolves around the four prisoners.\\n\\n\r\nI enjoyed this show a good amount for the first half or so. It felt like a silly romp in an insane prison. However they derail that for some cheesy drama. The good news is the cheesy drama gets replaced with drama so game changing you are left thinking \"Wasn't this a show about 4 jail breakers trying to escape the worlds most impressive prison\". The deep moments everyone is yammering on about is nothing more than friendship, finding a home, and \"tragic pasts\"...the usual stuff. The friendship and finding a home elements get destroyed along side the comedy. The tragic pasts are poorly written drama fodder. \\n\\n\r\nThis show was like a small get together with a handful of friends. Its enjoyable, things are going alright, your having fun but you wouldn't mind being somewhere else. Then all of a sudden the person who had two mikes hard lemonades drunkenly stands up and begins spilling everyone's secrets. After a few well chosen swear words and some shouting they begin pissing on all of the snacks. They didn't spill any of your secrets so your not angry, but you had been eyeing that chocolate cake all evening. You wanted it, but it was clearly the last piece and you didn't want to be that guy. Now its being pissed on and the only thing you can think is \"damn, I really wanted that cake\". You look around to see how everyone else feels about the cake being ruined and they are all cheering him on. You look back at the cake confused and somewhat sad before you leave out into the world where you will find another cake or perhaps some Wendy's. \\n\\n\r\nTLDR: Decent start, poor and shallow ending(cliffhanger). Art and soundtrack pretty good.\\n",
            "date": "2016-12-28T20:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 236802,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=236802"
        },
        {
            "content": "This was one of those weird anime. The first episode did a really good job of grabbing you into the show, and I say is probably one of it's better episodes. Is it a masterpiece? No. Can it be entertaining? Yes.\r\nIs this a comedy anime?\r\nYes, but it gets turned into an action comedy anime in it's out of place tournament arc.\r\nAlso, be sure to take a shower, as fter watching this, you might have some glitter on you, because EVERYONE'S SPARKLING!\r\nSide note, if there is no sparkles, it's no longer a comedy anime F.Y.I.\r\nGive it a shot, it might tickle your fancy.",
            "date": "2017-07-16T12:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 253007,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6406417.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dovahgatr",
                "username": "Dovahgatr"
            },
            "url": "https://myanimelist.net/reviews.php?id=253007"
        },
        {
            "content": "So, one thing I hate is being promised chocolate but given steak. Let me explain: I love chocolate, and I love steak, but if you tell me you're gonna give me one thing, but I get the other, I'll still be disappointed. This is what Nanbaka did. I went in, having finished the first few episodes, being promised sweet comedy chocolate. I was primed to laugh at the goofy antics of Jyugo and crew, as they lay in a maximum security prison for petty crimes. And you know what? They accomplished what I thought they set out to do. The first few episodes may besome of my favorites from anime. The humor just resonated with me! It was goofy, witty, and most importantly, didn't take itself too seriously. Imagine my surprise when the main course was brought out. Lifting up the lid of the first half of the series, I found not my delicious chocolate comedy, but a battle-scarred, overly serious shounen steak. I was shocked but still resilient. With a sigh, I dug in. \"I will enjoy this anime.\" That was my mantra, episode after episode. I kept thinking, \"If I just get far enough in, it'll go back to being what I want.\" It didn't though. It was a show full of men with neon hair, covered in body glitter, pretending they were in the most serious of situations. It was painful, like watching a clown in a fist fight, the crowd yelling, \"You'll just hurt yourself! Go back to what you do well!\" I have to admit, though. It drew me in in the last episode or so. I was genuinely concerned for the characters, invested in the plot. For a minute, I forgot its betrayal. I flipped to the next season, having finished season 1, ready for more. The next episode was a slap in the face. The title? \"Nanbaka is a comedy anime\". The content? Mediocre. I was done. I AM done. Season one is the end of my life with Nanbaka. So ends the days where I would sit down every Tuesday, just to have a laugh. Truth be told, those days ended long ago. I didn't enjoy this anime, but in truth, I hope you can. This was my first review, and I hope it wasn't horrible... Anyways, if you've come this far, I give you my sincere thanks. Have a great day!",
            "date": "2017-06-06T19:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 249407,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5654094.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/protomug",
                "username": "protomug"
            },
            "url": "https://myanimelist.net/reviews.php?id=249407"
        },
        {
            "content": "Warning possible Spoilers\r\nThe only other prison anime I have seen is Prison School and we all know how that went so seeing this was a action/comedy it certainly caught my eye and I was definitely surprised by this.\r\nThe story focuses on the hilarious everyday lives of the Inmates and Guards of Nanba Prison, but not everyday is full of laughs and enjoyment.\r\nI thought this was just going to be another anime that is just full of random comedy with hints of action which it was at first, but by the halfway point the story turned into a dark thriller and this surprised me because youfind out more about some of the inmates who have their own secrets.\\n\r\nIt was also fun seeing the attics that the inmates get up to so they can annoy the guards who also have their own problems with each other.\\n\r\nThere was a few sections that really stood out for me like the new year tournament and pretty much the second half where the situation goes from comedy and action to dark thriller which was a unexpected twist of events.\\n\\n\r\nI thought the characters were very likeable and usually I don't watch a lot of anime's that mainly focus on male characters since pretty much all the Inmates and Guards are dudes apart from one character.\\n\r\nThe main Inmates are Juugo, Uno, Nico and Rock who for a band of prisoners work so well together they have good chemistry and are really funny plus they care for each other too since all they have is each other.\\n\r\nJuugo is pretty much the most interesting character since he has a dark backstory and has a secret ability that is shown later in the series, but is someone you will fell sorry for since he didn't have a choice in the matter.\\n\r\nThe other inmates Uno, Nico and Rock are also fun characters since each of them have specific feature that makes them stand out like for example Uno is a womaniser, Nico is a huge anime/manga fan and Rock just loves to eat food now even though these are pretty big cliches in the anime world these characters fit those personas really well and it keeps the show going for me.\\n\r\nThe Guard characters are also fun too because even though they are OP when fighting the prisoners and each other they actually do get some development and you go from seeing them as just adversaries for the prisoners to well rounded characters.\\n\r\nI also have to say there is a lot of trap characters like as of the end of the series there is probably 3 or 4 of them and that would catch a lot of guys off guard.\\n\\n\r\nOne thing I can definitely say about the Artstyle is that it is very colourful and sparkly yet for some reason it fits mainly because of the fun nature of the show and it's characters and it still somehow works when there is a serious moment going on I mean there is probably every colour of the Rainbow throughout the show. The same can be said for the characters because almost everyone has a very elaborate hair style or colour and it can be pretty distracting at times.\\n\\n\r\nNow the show does start off with Comedy and it really starts off strong because most of the stuff that happened during the first 3 episodes was pretty damn funny and then it turns into action at the halfway point which was the New Year Tournament and for a tournament or challenge type episode (or episodes) it was seeing how powerful the characters were and made you think that messing around with them is not the best idea.\\n\\n\r\nOverall I think this was a fun and colourful show if you're looking for funny characters and a surprising story then you might actually enjoy this anime.",
            "date": "2017-06-06T03:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 249367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=249367"
        },
        {
            "content": "The creators of Nanbaka looked like they didn't know where they wanted the show wanted to go, the story line went from lighthearted to serious and back to light-hearted before you even know it.\r\nArt:\r\nI absolutely loved the bright colors throughout the show. My only concern is the sparkles that float around throughout the show. These sparkles added a fun touch but when the series got more serious, these sparkles were out of place and took a toll on the dramatic effect.\r\nSound:\r\nI'm not a huge critic on voice acting but I can say that it sounded pretty good to me :3 \r\nI LOVED the opening andending songs, both are catchy and memorable. I never skipped the opening/ending when it came up like I do for most other shows. \\n\\n\r\nCharacter:\\n\r\nEach character is memorable and has a unique personality. You can really see the connection between characters and their development throughout the show. \\n\\n\r\nStory:\\n\r\nBasic plot, just the whole revenge cliche. I could have gone without the filler episodes after a cliff hanger on the previous episode. It really takes a toll on the tone of the scene. Although I enjoyed the filler episodes, they could have easily been placed in another part of the show and not smack in the middle of two dramatic episodes.\\n\\n\r\nOverall:\\n\r\nThe show is definitely a mess, but what made it enjoyable was the characters and art. I loved seeing the main characters interact with the guards and the other inmates. And the flamboyant colors, only when they are justified, however, added a special touch. I would not consider this a show to binge watch, but one or two episodes every now and then is just the right amount. The show gets an 8/10 for me :)",
            "date": "2017-03-18T00:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 242839,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4368315.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Denisecvo",
                "username": "Denisecvo"
            },
            "url": "https://myanimelist.net/reviews.php?id=242839"
        }
    ],
    [
        {
            "content": "A description of Nanbaka is probably going to make it sound real dumb. This is likey because it really, really is. But the fact it is dumb does not preclude it from being entertaining, and I assure you that it is nothing if not that. I 100% recommend watching it if you are:\r\nA.) In the mood for something funny.\r\nB.) Unbothered by something being really stupid.\r\nC.) Equally unbothered by anime being weird for weird's sake.\r\nStory:\r\nI can best sum up Nanbaka thusly: it is pretty much what would happen if you transformed the Looney Tunes into bishy anime twinks with FABULOUS hair and threw them into afacility that is simultaneously the worlds most secure prison and the worlds most liberal Montessori preschool. So like Tiny Toon Adventures meets Orange is the New Black. Specifically those two shows, because like Tiny Toon Adventures the characters seem to have the impulse control of infants and can pull seemingly whatever they want out of Hammerspace and like OITNB everybody is kinda compelling and pretty fabulous and kinda gay and in prison. If that doesn't sound fun to you, you probably won't like it. We would probably also not be friends, because it sounds like a whole bunch of fun to me.\\n\\n\r\nArt: OH MY GOD REALLY GOOD! It is a joy to look at. The color is hyper-saturated, lime green and hot pink and crazy in the best way possible. It is exciting and surreal, which helps you suspend your disbelief over the antics of the ridiculous plot and characters. The art puts me in the mood to have fun, which the show then offers. 10/10, this is what art should do for an animated show: inform you by design alone what kind of show you are watching.\\n\\n\r\nSound: Also awesome. The opening song is pretty cool: rocky J-Pop paired with some fun imagery indicative of the mood of the show. The ending, however, is the shit. It's more or less chibi versions of the characters running around escaping from prison while they all sing a song together. I love it and watch it every time. It is charming and funny, and always made me want to watch the next episode.\\n\\n\r\nCharacter: Over the top and too much, but so is the show and consequentially it more or less works. The main 4 are all pretty funny and engaging, although main guy (#15/Jyuugo) is kind of a sad sack these days. Everybody has more or less exactly one joke that they are used to tell over and over, but the joke seems to always land despite being repeated ad nauseam. They are either manic and adorably annoying, or unvarying serious to the point that they cannot themselves be taken seriously. Sometimes both at once (The Warden). Special shout out goes to Nico, the hyper kid who takes a bunch of drugs and is really into stupid anime, because he is basically me. I just wanted to hang out with him and smoke a blunt and watch G-Gundam (secretly the best Gundam despite what everybody else who has ever watched it beside me and Nico might say).\\n\\n\r\nEnjoyment: Loads. This show isn't going to teach you anything. It's not going to tell you anything profound, it will just make you laugh a bunch. If that is enough for you, give it a watch. I did and do not regret it in the slightest.",
            "date": "2016-12-31T10:20:00+00:00",
            "helpful_count": 94,
            "mal_id": 237096,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4983772.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jRad522",
                "username": "jRad522"
            },
            "url": "https://myanimelist.net/reviews.php?id=237096"
        },
        {
            "content": "NEVER TAKE THIS SHOW SERIOUSLY \r\nNow that that's out of the way, I found enjoyment in this show though the hilarious imagery and funny jokes. \r\nTHE STORY is mediocre at best, but it's a comedy, so there's not much you can expect. \r\nTHE ART is great. It's the main focus of the comedy element and sometimes is a bit too lenient on it. The art by itself  though colorful and wild is sometimes a bit eye bleeding.\r\nTHE CHARACTERS aren't varied. They are all just comic relief, which makes them seem  bland overall. \r\nOVERALL I liked this show, not to where I'll be recommendingit, but it made me laugh and I think a comedy shows goal is to make you laugh and this show accomplishes it's goal.",
            "date": "2016-12-30T06:17:00+00:00",
            "helpful_count": 33,
            "mal_id": 236958,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5814189.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/StrawberryEmmie",
                "username": "StrawberryEmmie"
            },
            "url": "https://myanimelist.net/reviews.php?id=236958"
        },
        {
            "content": "The action/comedy multi-genre is saturated with great shows and awful shows. The great shows are not only deliver brilliant action scenes through the quality of the technical aspects, they’re also hilarious and consistent with the comedy. The poor action/comedy shows either skimp on the quality of the art and sound involved or lack consistency in the comedy or both. Action/comedy shows are at their best when they’re funny or exciting but not when they drift off into needless drama.\r\nNanbaka falls between the two; it starts out great with an interesting premise and acceptable comedy. But it loses its focus along the way near the endof the series and slowly becomes boring.\\n\\n\r\n[Repeated prison escapists]\\n\r\nNanbaka is an action/comedy anime series based off a web manga originally created by Futamata Shou and his influence glows throughout the show. It is directed by Takamatsu Shinji, who’s directed brilliant comedy series like Gintama and The Daily Lives of Highschool boys. The series is revolves around the daily antics of four inmates in the self-proclaimed, most formidable prison in the world. The inmates of the infamous ward 13, Juugo, Uno, Rock and Nico, often try to escape the prison’s walls and are always stopped in their tracks by the fearsome guard, Sugoroku Hajime. But Juugo is also on the lookout for the man who gave him his unremovable shackles and his colleagues question their motives for trying to escape the prison.\\n\\n\r\n[An interesting premise abandoned]\\n\r\nNanbaka begins as a ‘gag’ comedy with an interesting premise: the main characters frequently try to escape from the prison. In the first few episodes, we see them break through several high security gates only to be caught and beaten by the head guard, Hajime. The hilarious execution of this premise coupled with the diverse skill set of the inmates makes these episodes interesting to watch. The premise also leaves a lot of room for creativity; the prison could be viewed as a dungeon, for example. As thin as the plot was, it was replaced by a pointless intra-prison arc.\\n\\n\r\nThe intra-prison arc was not boring by any chance; it was even more exciting than the initial episodes though less creative. The event introduced most of the cast of the show and showcased the abilities of the inmates and guards alike. It was hilarious and full of explosive battles with fluid animation and lots of special effects. It was pointless but still fun to watch. Unfortunately, the show slides into a series of dramatic sketches following the last battle in the arc.\\n\\n\r\nThe last few episodes seemed like the opposite of the first episodes; they had direction but were boring. They just seemed to tick off all the common tropes for drama present in an action show; a self-deprecating main character who learns to lean on his friends. It wasn’t awful; it just wasn’t what was sold by the show at the start. Also, the drama would have been better had there been more characters involved.\\n\\n\r\n[A diverse and wild cast]\\n\r\nNanbaka has a large cast of characters from various nationalities. Some are declared in the show like Juugo’s British and American fellow inmates. Others are inferred from their design like the inmates of ward 5. With this comes a variety in the design; some inmates wear their prison clothes while others do not. Unfortunately, the personalities aren’t as diverse. Almost all the characters, inmates and guards alike are hyperactive and aggressive; most of the inmates have no motives at all. Only the main characters seem to want other things hang out in prison.\\n\\n\r\nJuugo likes to break out of his cell, 13,  for the fun of it; it’s later revealed that it’s the only skill he has. He’s also in search of the man who placed shackles on him but this only becomes a focus of the show much later. Uno is the self-proclaimed pretty boy of his cell; Rock is the muscle who likes to eat and Nico is playful and immune to drugs. That’s about all there is to them although they reveal other skills that only last the duration of the intra-prison event arc. The other characters of note are ward 13’s head guard, Hajime, who’s a workaholic and the warden who has a crush on Hajime. Fortunately, what Nanbaka lacks in characterization, it makes up for in its art and character design.\\n\\n\r\n[Glitter, gloss and pretty boys]\\n\r\nThe art style of Nanbaka is distinct and loud. The background and character art is sharp and colourful; the colours are bold and bright; the characters are drawn with prominent outlines. It’s artstyle is similar to that of Jojo’s Bizarre Adventure but it’s recognizable for the tones of colour used. It’s uniqueness lies in its overall theme: femininity.\\n\\n\r\nIt’s difficult to miss the glitter that pervades the environment in the show. The characters glitter, the prison walls glitter, even the ocean that surrounds the prison glitters. In addition to the glitter is the gloss that’s also on everything, from hair to their clothing. The characters also tend to wear more jewellry than the average male and often have painted fingernails. Then there are characters that are effeminate in their appearance, voice and mannerisms. This art style, coupled with the jazzy themes, gives the show a 70s feel.\\n\\n\r\n[Jazzy with a spice of rock]\\n\r\nThe opening (Rin! Rin! Hi! Hi!) gives away the catchy jazz style that pervades the entire show. It’s a brilliant intro to the flamboyant show and one of the most memorable for me in the Fall season of 2016. Sadly, only Uno’s melody (a score that plays when he’s about to play a trick) comes close to being as memorable as the opening music. The rest of the scores are either gentle jazz tunes or generic rock music that’s designed for fight scenes in anime.\\n\\n\r\nI wouldn’t say I enjoyed Nanbaka in its entirety as some of the episodes were a chore to watch, often because of the obvious drama. The comedy grows less hilarious past the halfway point; it even loses its most popular running gag. The show was mostly enjoyable for its first few episodes and its flamboyant art style. It did get its technical aspects right and would have been a much better show had it stayed on course.",
            "date": "2016-12-29T09:40:00+00:00",
            "helpful_count": 28,
            "mal_id": 236860,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647223.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gnerkus",
                "username": "gnerkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=236860"
        },
        {
            "content": "Many have heard the old proverb, \"If you chase two rabbits, you will not catch either one\". By extension, the more rabbits one chases at once, the harder each is to catch. Nanbaka takes this a step further: it starts going after one rabbit, then gets distracted by a bird and later a fish. It unfortunately fails to catch any of them, but at least it looks cool trying.\r\nAt its core, Nanbaka is a zany, colourful gag comedy in a prison setting! ...Or is it an action shonen? No? A character drama? In practice, it frequently switches targets when it may have been wiser tostick to one.\\n\\n\r\nFrom the get-go, Nanbaka presents a fast-paced series of varied jokes, ranging from visual humour to ironic subversion to borderline non-sequitur. They weren't exactly original, and didn't get to me personally, but variety and quick pacing are handy tools for holding interest whenever a punchline doesn't quite hit the mark. At this point, I respected Nanbaka for what it was. It had a clear identity, and showed commitment to it.\\n\\n\r\nHowever, the show quickly lost its focus from there. In my eyes, a lack of focus is one of the fastest ways to kill viewer interest, and often a sign of poor writing. Nanbaka soon falls into this trap; rather than continuing its gag comedy roots, it tries to take on multiple identities at once. As soon as the action and drama arrive, the pacing slows considerably and the jokes become less varied or frequent. This would be fine if the new elements meshed well, or were at least strong additions to the series, but instead, they just make things messier.\\n\\n\r\nThe action elements suffer from weak choreography. This is expounded on by mid-action cuts to narration by onlooking characters - an issue seen in many action anime. For once, Nanbaka could have made this trope work in its favour by filling the narration with its usual zany jokes. Alas, it's just the usual filler dialogue to stretch out the no-longer-action while explaining attacks that didn't really need to be explained and/or stating things that are obvious to the viewer.\\n\\n\r\nDespite the action portion's weaknesses, the drama is where I find Nanbaka to be the least successful. At these points, the show suddenly takes on a more serious tone than the accompanying gag comedy and action. This results in a weird situation in which a viewer is simultaneously expected to take the show seriously while also not taking it seriously at all. It's not the tonal shifts that are the issue - rather, it's their frequency and the show's inability to sell them.\\n\\n\r\nFurthermore, compelling drama requires compelling characters - something Nanbaka does not have. Most of them come down to one-dimensional quirks or hobbies and maybe the occasional simple backstory. They're too simple to be interesting on their own, and it makes investment difficult.\\n\\n\r\nAnd this brings up what I believe to be Nanbaka's main weakness, and the source of nearly all its problems: it's characters. Even with its wildly differing subject matter, this show certainly wasn't doomed from the start. It simply lacked the tools needed to succeed. While there were several things that could have helped the show (improved action pacing and choreography, or a more memorable soundtrack to quickly and effectively shift tone), ultimately, I believe that characterization is the one key missing weapon it really needed to hit all its desired targets.\\n\\n\r\nStronger characters can create chemistry which helps to sell the comedy and elevate it from \"gag\" to \"riot\". In turn, these jokes can be a quick and effective way to show characterization. From there, these improved characters help to invest a viewer before the show switches to action, and when drama builds, the viewer will more readily buy into it. But without this depth of character, the act falls apart, undercut from its very foundations.\\n\\n\r\nDespite all my criticisms of Nanbaka, one positive I can mention is the show's art. It has a unique, sparkly, insanely colourful style that immediately draws attention. I'll admit, this alone made it easier for me to sit through Nanbaka's weakest points. The style, however, is not nearly enough to carry the show on its own against its many weaknesses.\\n\\n\r\nIn the end, Nanbaka gets a tad too ambitious for its own good, and misses the fundamentals as a result. What could have been a notable series sadly ends up as a disorganized, zig-zagging mess, with no clear identity beyond its visual style.\\n\\n\\n\r\n- FINAL SCORES -\\n\\n\r\n* Critical quality (includes story, characters, presentation, etc): 2.5/10 - Plagued with numerous crucial issues that hindered the show's success, but is slightly redeemed by its art.\\n\\n\r\n* Memorability: 3/10 - While Nanbaka's style sticks out, the complete lack of notable or unique substance and disorganized handling of its content makes it unlikely to be remembered in 6 months.\\n\\n\r\n* Enjoyment: 3/10 - In addition to Nanbaka's comedy not being my cup of tea, its lack of focus or characterization made this a chore to watch. Only the colours kept me from dropping it.\\n\\n\r\n* Overall: 3/10 - Of the Fall 2016 shows I watched, this was my least favourite for all the reasons described above, and I can't recommend it. It wears itself out quickly, and when it does manage to catch a rabbit, it's not a particularly tasty one.",
            "date": "2017-01-30T20:32:00+00:00",
            "helpful_count": 8,
            "mal_id": 239556,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450073.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Plasmatize",
                "username": "Plasmatize"
            },
            "url": "https://myanimelist.net/reviews.php?id=239556"
        },
        {
            "content": "If you want to try watching something different from what you usually watch, then this anime is perfect for you. I would recommend this anime to you 1000% \r\n~Spoiler Alert~ (Not much tho)\r\n~Read at your own Risk~\r\nStory(8)- It's about 4 guys who break out of prison with their special abilities and their desires. But after they find the things they desire for, they stop breaking out of prison and stay in the prison, because it provides them with the things they want (not all of them).It mostly focuses on Juugo (MC), who doesn't have something that he wants. \r\nArt(10)- I cannot explain how amazingthe characters and backgrounds are drawn. (The sparkles are everywhere) The prison is very beautifully drawn/ designed. The art in this anime matches perfectly with the situation. It's bright, vivid, colorful and stands out the most. The art is really different from the other anime we see. (THE CHIBI VERSION OF THEM- ITS TOO CUTE!!!)\\n\\n\r\nSound(10)- The characters sound really hot and the opening song and ending songs are very catchy. (I usually skip the opening songs but the opening song in this anime is so catchy and good that I don't skip it)\\n\\n\r\nCharacter(9)- Some of the characters are really weird but that's what good about it. The character are very recognizable because of their unique features. (Big hairs, huge body, strange scares or strange spots.)  \\n\\n\r\nEnjoyment(10)- This anime will cheer you up no matter how sad you are. (It worked for me C:) It also gives a message like \"It doesn't matter how skilled you are with a lack of desire.\" \\n\\n\r\nOverall(9)- I would give 9/10 overall because I really like how its funny but serious. The story is gives a mysterious yet joyful vibe which is very unexpected. What I am trying to say is that, this anime is very different from the Anime that we all usually watch.",
            "date": "2017-12-28T19:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 266692,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5651504.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animumbug",
                "username": "animumbug"
            },
            "url": "https://myanimelist.net/reviews.php?id=266692"
        },
        {
            "content": "Pretty good anime, at least good enough to watch without feeling bored. There were a few laughs to be had here and there. I like most of the characters, although I pretty much hate hajime the guard, that bastard can go and die somewhere. I also dislike the female boss, she just can't stop being lovestruck all the time and it pisses me off, especially since I hate the one she likes.\r\nThe story is so-so, kinda average, nothing special at all. The art is pretty nice, I like the style although the colors feels a bit too flamboyant. The sound is great, well, at leastthe opening song, I was really fond of that one. The characters are nice in some ways, at the very least they feel kinda unique, but I feel like too much effort was put into making them too extreme, the author should learn some moderation, medicine in great quantities becomes poison, that concept applies to pretty much everything in this world. Too much is never a good idea(well, at least in normal circumstances). Overall, my enjoyment was pretty nice for most of the anime.\\n\\n\r\nWhat annoyed me the most here is that the author chose to screw up big time because he wants to put serious stuff and drama into the anime. It just DIDN'T work at all, it ruined the entire anime. Maybe I should've lowered my score even more, giving it a 7/10 is very generous considering the huge flaws. This show was never meant to be serious, at least it shouldn't have. The only good part is the comedy and interaction between the characters, but the decision to put drama, tragedy and whatever else into it as well and drag it out for WAY too long was a horrible one, utterly horrible. The real tragedy here is that they felt it was a good idea and thus murdered a show that could've been so much better.\\n\\n\r\nThis is especially the case since I couldn't care less about these characters, I'm used to extreme tragedies after reading certain stuff and this shit can't even make me feel anything at all. If I wanted drama and tragedy, I wouldn't watch a screwed up anime like this. I would watch a proper serious anime or read a manga or novel like that. Putting stuff like that into a f*cked up anime like that? Come on. That's like putting a bloody beef into your sweet, creamy cake. Who would want to eat that crap then? It's incompatible, it's either one or the other. Changing styles suddenly is just bullsh*t and always ruins things. Not saying comedy and tragedy/drama is always incompatible, but when it's done like this, it indeed is.\\n\\n\r\nI saw that a lot of people say the second season is way worse and reduces the comedy a lot, well, I'll try to watch it and see if that's truly the case. If it is, I guess it's best to drop it fast because it's not worth watching. Well, to be fair, I guess that the manga version might actually be better. The serious parrts would be over quite quickly since you can speed read easily 10+ chapters in the time you watch one episode.",
            "date": "2018-10-19T17:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 292104,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=292104"
        },
        {
            "content": "Nanbaka is a prison comedy series. The manga was originally written by Futamata Shou. In late 2016, Satelight began airing an anime adaptation. You may remember them as the studio behind Heat Guy J & Sousei no Aquarion. So, how does this one compare to their other works I've reviewed? Let's take a gander. \r\nStory:\r\nNanba is, supposedly, the world's most formidable prison. With the toughest guards, the most inescapable perimeter, the sparkliest design and the finest dining and recreation services. We follow four prisoners, Juugo, Uno, Rock & Nico, who have escaped from prisons all over the world as they go about their lives andmake trouble for the guards. Insert shenanigans here. \\n\\n\r\nThe biggest issue with this series is that it attempts to blend zany, really over the top comedy, with some more serious back stories and an underlying plot about a certain character having serious enemies who may well pose a threat. This results in a pretty significant case of tonal clash. Then we have the humour itself. Honestly, it doesn't work a lot of the time. A lot of it is based around the characters being stupid or something over the top and random happening. I've talked about this before with a different less than good comedy, but randomness isn't funny. A good zany, absurd comedy will have some internal logic that will be largely consistent, being bent on rare occasions for a jape. Pure randomness is what you get when an eight year old tries to make up a joke. “So, a guy walks into a pub and asks the bartender for a pint. The bartender says, 'I can't serve you. I'm a cockatoo.' And the guy looks up and notices that he is.” And it's not funny but you give them a pity chuckle because they're eight. Problem is, this was written by an adult who should know better. \\n\\n\r\nThat being said, some of the goofs based around characters acting like idiots are pretty funny. There are times when those get executed well. I'll give it credit on that, it does have some funny bits. \\n\\n\r\nCharacters:\\n\\n\r\nThe major inmates in this series can all be described very simply. They have a tragic back story and very little personality. Now, I have maintained that a comedy doesn't need deep, complex characters. It needs characters with strong dynamics who can play off of one another really well to deliver the laughter. However, the whole tragic back stories element and the more serious stuff the series tries to do arguably makes this a series that should have more complex characters. Even putting that aside, the character dynamics are pretty underwhelming and don't generally lead to good comedic moments. A lot of the side characters suffer from one joke syndrome. Take the Warden. Her joke is that she has a crush on Hajime, the guard in charge of our protagonists, and people misinterpret her intense gazes. \\n\\n\r\nArt:\\n\\n\r\nThe art isn't very good, to put it nicely. While I will give it credit for having unique character designs, the backgrounds are pretty lazy. Additionally, Satelight made the perplexing decision to put everything in sparkle vision. I'm not kidding, the entire bloody anime is sparkly. Now, here's the thing. Sparkle vision can work when used in certain circumstances for comedic effect. Fullmetal Alchemist is a great example. However, putting everything in constant sparkle vision doesn't have any comedic effect. Instead, it just hurts your eyes. \\n\\n\r\nSound:\\n\\n\r\nThe cast in this is perfectly passable. I can't call them brilliant in this, or even good, but it's also one of those series where the acting can't make up for the lack of characterisation. The music was handled by Fujisawa Kenji and it's all right. Which may actually make it the strongest element of the series. \\n\\n\r\nHo-yay:\\n\\n\r\nThere's a bit. We have the gay stereotype character voiced by Kimeru. Juugo also mentions liking both guys and girls, and there are reasons to believe he was serious. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nNanbaka is a pretty weak comedy. It suffers from tonal problems, humour that falls flat more often than not, constant sparkle vision and dull characters. That being said, it does have its funny moments and I can't really say it was bad. If you're a fan of randomness and comedy stemming from characters being morons, you might enjoy it. For me, the final rating is going to be a 4/10. Next week I'll look at Osomatsu-san, which will hopefully be a better class of comedy.",
            "date": "2017-03-22T11:48:00+00:00",
            "helpful_count": 5,
            "mal_id": 243157,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=243157"
        },
        {
            "content": "If there's one thing about anime that I usually avoid, it's either slice of life or more spontaneous gag anime. The latter being the definition of this anime. I originally decided to watch it cause the character designs were interesting and as an aspiring character designer, I decided that I would give it a go and see what this show was really about.\r\nStory: 6\r\nSince this is a gag anime, usually the story isn't very serious or just has a basic scenario. However, similar to Katekyo Hitman Reborn ( originally a gag manga/anime that turned shounen after 20 eps), the story takes much darker turns hereand there, but never fully explores the darker parts of the story, as it always returns to the lighthearted comedy at some point. There are many questions left in the more dark parts of the story, so therefore the score is reasonable until S2.\\n\\n\r\nCharacter:7\\n\r\nFirst thing I would say is that the character designs in this show are rather unique. Each character is distinct, outrageous and has their own personalities, which fits the show well. The downfall of this however, is that only the main 4 plus random side characters got actual plot stories plus some character development. So there's that. My main problem was the random side characters that got development even though they served no purpose to the main story\\n\\n\r\nArt/Sound 10/9\\n\r\nFirst of all, this anime is BRIGHT. Flashy colors, and literally, sparkles EVERYWHERE. it fits the atmosphere perfectly, as the comedy is just as outrageous as the colors of the animation. In the darker parts of the show, the colors still maintain some brightness, but are slightly muted. My only slight problem is that there were sparkles in the serious parts of the show, which kinda ruined the atmosphere of the scene. The music is only really noticeable during the serious parts, with some nice opera in the background. It does its job. The OP is definitely a favorite though.\\n\\n\r\nOverall: 7\\n\r\nI actually enjoyed this show, and managed to binge watch all the episodes because I loved the outrageousness of it all. Despite the flaws it's still a nice show to watch for the comedy and the outrageousness of the characters. If you want some feel-good/crazy comedy, this is for you",
            "date": "2017-01-01T23:02:00+00:00",
            "helpful_count": 5,
            "mal_id": 237235,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3269951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/xMissMelonx",
                "username": "xMissMelonx"
            },
            "url": "https://myanimelist.net/reviews.php?id=237235"
        },
        {
            "content": "If you came here looking for an immensely meaningful plot that will make you see the world in a completely different way and make you wonder what the purpose of life is, then I'm terribly sorry... you came to the wrong place. Though, if you came here for a short show that will keep you entertained on times when you purely want to watch something simple, but just aren't into those moe-blobs or harem shows, then... nope, not that one either.\r\nNanbaka offers you the typical gag-anime humor consisting of popular shounen anime \"special move\" exclamations and pointless comical moments in the middle of serious fights,but then there is some drama that makes the show seem as it were trying to make the plot deeper, thus make it look like it doesn't know what kind of series it actually wants to be. \\n\\n\r\nThe story is nothing special. Four young criminals with unpleasant pasts, known for always breaking out of every prison they're transferred to, end up in the world's most intimidating prison, where the story is set. That's pretty much the baseline, and while it wasn't that bad at all, the needless drama kicked in, and it ruined everything. Pointless overexaggerating drama, even though it could've stayed a fun and lighthearted series without any drama whatsoever.\\n\\n\r\nThe art is very nice and detailed, which I like a lot. Every single thing on a character, no matter how big or small, has a slight gradiation which makes the art look significantly more detailed. The animation seems pretty solid, as well. The colours are very bright and vivid; just what feels best for an action anime series. On the other hand, we always have those flashy stars around the character that seem kind of pointless. Also, all of the characters have these colourful characteristics, be it hair, eyes, clothes, or all of those together, and while it suits the carefree comedic side it had in the beginning, it quickly gives off the opposing effect when it has its identity crisis. Simply makes it look like a few rainbows fighting to death. Lovely.\\n\\n\r\nWhen it comes to sound, I didn't really notice anything astonishing during the actual show, but I do like the opening considerably. I might also add that the voices suit each character fairly well.\\n\\n\r\nThe characters might be a little cliché at times, but overall they're aren't that bad... that is before it goes up the hill with the drama and they become impossible to relate to, or even just enjoy.\\n\\n\r\nNow, there are still quite a few flaws in this anime, so let me just mention those right now.\\n\\n\r\nFor starters, the show is about 5 different individuals, the four inmates and their guard, so why is it that an episode ends with an intriguing cliffhanger and continues with an entire episode about the backstory of a character who barely even has any screen-time? In that case, a mere filler about just one of the main characters would've been a lot more entertaining. Generally, the show often gives off this rushed feeling, as if they tried developing the story at the last second. Which leads to my next point, what we've all been waiting for: The identity crisis. Typically, an action gag-anime has a lot of humor during fights and such moments, with slight drama here and there to add some spice, but here there's a supposedly serious fight, random humor all over the scene, and then suddenly everyone gets depressing. The anime proclaimed that it's a gag-anime during the show. It seems as though it just can't pick its mind on what it wants to be, a serious action drama show, or a comedic gag-anime. My guess is that it tries to be both, serious and funny, and balance that like other shows do, but it just seems to fail miserably. In my opinion, it would have been highly enjoyable without any drama, if it simply stayed the way it was in the first few episodes.\\n\\n\r\nThe only audience I could imagine Nanbaka for, the way it ended up, is the audience that has just watched a few mainstream shows, and doesn't really care about that story. The audience who just wants some action, which action is kind of unappealing, as well, because it barely has any.",
            "date": "2016-12-28T11:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 236765,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4987684.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lefrave",
                "username": "Lefrave"
            },
            "url": "https://myanimelist.net/reviews.php?id=236765"
        },
        {
            "content": "To be blunt, Nanbaka was boring, lacking in plot, had boring characters, and wasn't funny. Lets start with the story: there are some convicts who are good at escaping from jail so they put them in a maximum security prison (all together of course, so that they can work as a team to escape whenever they want to). This idea has potential and if taken seriously it could have been worked into a great psychological thriller, so of course they did the exact opposite when making this show. It's so bright and colorful that there were moments where i thought I was on a badacid trip and was about as serious as the chances of a childhood friend in a rom-com, that is to say, not serious in the slightest. The art didn't want to make me actively bleach my eyes though so that's a plus. The songs were possibly the most vanilla songs I have ever heard in my life. In all honesty I was hoping that the characters would somehow die so that the series could end, I felt not an ounce of emotion for them. It was a mad dash to the third episode with this one watching it at 2 times speed so that it would be over faster. Overall, this anime was just a mess. Its like if Grand Blue wasn't funny at all, so essentially just a big heaping pile of nothing.",
            "date": "2019-04-01T15:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 305192,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7937974.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/IneffableBoredom",
                "username": "IneffableBoredom"
            },
            "url": "https://myanimelist.net/reviews.php?id=305192"
        },
        {
            "content": "Have you ever wondered what's a prison feels like? How about a happy prisoners trying to escape a prison? Sounds unrealistic right? Well, of course!!! This anime tells us that situation. It has a happy go lucky vibe like Beelzebub and Assassination Classroom while you are watching this. This kinda reminded me of the Impel Down Arc of One Piece while watching the first episode.\r\nThe comedy is very funny. Been laughing so hard. The art is amazing where it comes to the point that you can't tell a boy from a girl based from their appearance. The anime is action-packed and very entertaining to watch.The prisoners are funny as hell. The guards are badass, funny and powerful. You cannot predict what will happen next unless you will predict in your mind. \\n\\n\r\nHaving seen both Seasons 1 and 2, all I can say this is a gold comedy and a very entertaining anime. Lots of parodies here. A MUST-WATCH if you want a good time.  Not convinced? There's a hidden dark story here as you go further.\\n\\n\r\nCan't wait for Season 3.",
            "date": "2017-11-02T10:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 262349,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6583206.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Half-MagePrince",
                "username": "Half-MagePrince"
            },
            "url": "https://myanimelist.net/reviews.php?id=262349"
        },
        {
            "content": "Stoy\r\nI started this series off thinking it was just going to be a simple prison comedy and BOY WAS I WONG. \r\nYes, this is a prison comedy but there are times in this series were the mood completely changes. It will be loud bouncy and funny one second then turn to an intense or dramatic scene the next. I was sometimes confused whether I was watching a comedy or a drama because it would break from comedy to have these large emotional dramatic scenes and then go back to its normal bouncy comedy. Also, I sometimes hated the pacing because sometimes it was way toofast, to the point where I needed to pause just to comprehend what happened and other times where the pacing was way too slow and I wanted to bang my head against my keyboard. overall I give the story a 6 because I did enjoy the story but hated the pacing and sudden mood changes.\\n\r\nArt \\n\r\nI really did enjoy the art of this show. The loud bright colors and how practically everything sparkled. I thought the art style played really well into the show's comedy aspects and when they dulled the colors down for the show's drama aspects. the art wasn't breathtakingly beautiful but it was fun and enjoyable perfect for the show. \\n\r\nCharacters \\n\r\nI loved the characters of this show. I believe Nanbakas strongest attribute is the characters of the show. All the characters are enjoyable and each has their own interesting personality and goal.\\n",
            "date": "2017-02-08T14:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 240187,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5602598.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/trashlovee666",
                "username": "trashlovee666"
            },
            "url": "https://myanimelist.net/reviews.php?id=240187"
        },
        {
            "content": "Nanbaka is an action dramady that definitely excels at the comedy aspect, but failed to impress me with its more serious plot-building episodes; which seem to outnumber the mostly or strictly comedic ones. I was just in it for the laughs, but it got totally serious after the tournament arc, after which it dove head-first into hidden dark sides and tragic backstories galore. These were never BAD by any means, just kind of mediocre. This being the case, it was never so dull as to make it difficult for me to finish watching an episode, or several in a row.",
            "date": "2017-01-13T22:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 238243,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4164513.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/The_Ruise",
                "username": "The_Ruise"
            },
            "url": "https://myanimelist.net/reviews.php?id=238243"
        },
        {
            "content": "It's difficult to make a comedy series, mainly because sense of humor is subjective. Nanbaka's comedy was barely noticeable, and even if it was there, it wasn't really funny. But personally, the action and drama parts were better written than the comedy.\r\nThe story is mainly as the synopsis says. There's no story progression as such, and there's just a tournament arc filled with games at the beginning, mostly games where comedy can be introduced in. The action part was also mixed in there, the fights were well done, and the flashy artstyle did not interfere. The comedy part was mainly in the first half ofthe series, with some decent jokes, did not make me cringe, made me grin twice overall, was fairly enjoyable, so I'll take it; it was above average. The second half introduces character backstories, but they were really interesting to see. Tsukumo with his road to discover himself, Juugo and Musashi's story concerning the shackles, and how Juugo united the prisoners of Cell 13. The comedy became secondary here, but the backstories were more interesting than the comedy, so I did not have much complaints. Overall, a solid story.\\n\\n\r\nThe artstyle is seen to be flashy from the wallpaper itself, which is a feature of this anime. It looked good but it was excessive, even though I can understand that the manga used this style too, so props to Satelight for duplicating it and enhancing the character designs. Soundtracks were noticeable too and fit the scenarios, but I wouldn't call them memorable.\\n\\n\r\nI really liked the chemistry between the characters, and Hajime was a badass and Seki Tomokazu just made him look even cooler. Juugo was the most explored character, the others needed more focus but they were supportive of each other and that was nice to see. Even Musashi is great to see as he rebels against the person who ruined his life.\\n\\n\r\nAll in all, I would recommend Nanbaka, but not really for its comedy, unless I'm just not the type to watch this kind of comedy, since others seem to laugh at this.",
            "date": "2018-09-17T10:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 289252,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6612923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/animesscythe",
                "username": "animesscythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=289252"
        },
        {
            "content": "In a world where people are born with nail polish...\r\nStory:\r\nNanbaka is a complete mess. First it starts as a slice-of-life comedy, then it shifts to action shounen, then to drama, then back to comedy and eventually back to drama. I have no idea what the creators were trying to do, but it sure as hell wasn't entertaining the least bit. The main story (if you wanna call it that) is shortly mentioned early on, then forgotten for a good while, then brought back again all of a sudden. Maybe the episode writers should've talked to each other at some point.\r\n1/10\r\nArt:\r\nThe character design is a disaster.These guys are so flamboyant and feminine that it's ridiculous. And everything sparkles. Everything! This is what hell for the homophobic must look like. Animation is solid, the backgrounds look good, but I can't take my eyes off of these ladyboys.\\n\r\n3/10\\n\\n\r\nSound:\\n\r\nThe voice acting is good. Especially the chief warden sounds good, with her dual personality. Opening and ending were not very good however, especially the ending was more annoying than anything.\\n\r\n6/10\\n\\n\r\nCharacters:\\n\r\nMost of them are incredibly boring. The chief warden and her assistant are somewhat funny, Hajime is also pretty cool. But that's about it. Especially the main characters feel very empty.\\n\r\n4/10\\n\\n\r\nEnjoyment:\\n\r\nYou may have noticed that this review is pretty short, especially compared to my other recent ones. But there simply isn't much more for me to say about Nanbaka. It was boring most of the time, the storytelling was incoherent and most of the cast was completely uninteresting. It's not even been a week since I finished this anime and I have already forgotten most of it. If you ever feel the need to completely waste your time, feel free to give Nanbaka a shot.\\n\r\n2/10\\n\\n\r\nOverall:\\n\r\n3.2/10",
            "date": "2017-01-01T12:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 237186,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 3,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=237186"
        },
        {
            "content": "Hey folks, this will be a review for Nanbaka. I have mixed feelings about this show as a whole. The overall premise and layout was fun and enjoyable to watch. However the dramatic events that arise are really not that deep or extraordinary as some reviews have mentioned. Its those \"deep\" moments in the later part of the show that really kill the entire thing for me.\r\nThe story revolves around 4 prisoners in the most secure and top secret prison in the world. These four prisoners are well known for escaping prisons, Juugo especially. What seems to start off as a comedy show about escaping,and or making a home in this oddly comfortable super prison turns into a odd mix of mini stories. Each prisoner has some sort of semi tragic back story. However the main focus turns to Juugo as we discover a odd tangle of things involving modifications, super advanced technology, fantasy like super villains...etc.\\n\\n\r\nThe art is strange but very colorful and fun. The soundtrack was enjoyable to listen to as well.\\n\\n\r\nThe characters were a great mix. Juugo, the main character is only good at breaking out of prison. Nico is the otaku character who has the ability to steal peoples moves by observing them. Uno is the woman lover who is exceptional at cheating and has amazing intuition. Rock is the brawny guy who loves to fight, but more than anything loves food. Its a ragtag bunch and the first few episodes you watch as they attempt to escape, pick on the guards and make friends. \\n\\n\r\nMost of the characters are important and have their own back story. However most of the show revolves around the four prisoners.\\n\\n\r\nI enjoyed this show a good amount for the first half or so. It felt like a silly romp in an insane prison. However they derail that for some cheesy drama. The good news is the cheesy drama gets replaced with drama so game changing you are left thinking \"Wasn't this a show about 4 jail breakers trying to escape the worlds most impressive prison\". The deep moments everyone is yammering on about is nothing more than friendship, finding a home, and \"tragic pasts\"...the usual stuff. The friendship and finding a home elements get destroyed along side the comedy. The tragic pasts are poorly written drama fodder. \\n\\n\r\nThis show was like a small get together with a handful of friends. Its enjoyable, things are going alright, your having fun but you wouldn't mind being somewhere else. Then all of a sudden the person who had two mikes hard lemonades drunkenly stands up and begins spilling everyone's secrets. After a few well chosen swear words and some shouting they begin pissing on all of the snacks. They didn't spill any of your secrets so your not angry, but you had been eyeing that chocolate cake all evening. You wanted it, but it was clearly the last piece and you didn't want to be that guy. Now its being pissed on and the only thing you can think is \"damn, I really wanted that cake\". You look around to see how everyone else feels about the cake being ruined and they are all cheering him on. You look back at the cake confused and somewhat sad before you leave out into the world where you will find another cake or perhaps some Wendy's. \\n\\n\r\nTLDR: Decent start, poor and shallow ending(cliffhanger). Art and soundtrack pretty good.\\n",
            "date": "2016-12-28T20:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 236802,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=236802"
        },
        {
            "content": "This was one of those weird anime. The first episode did a really good job of grabbing you into the show, and I say is probably one of it's better episodes. Is it a masterpiece? No. Can it be entertaining? Yes.\r\nIs this a comedy anime?\r\nYes, but it gets turned into an action comedy anime in it's out of place tournament arc.\r\nAlso, be sure to take a shower, as fter watching this, you might have some glitter on you, because EVERYONE'S SPARKLING!\r\nSide note, if there is no sparkles, it's no longer a comedy anime F.Y.I.\r\nGive it a shot, it might tickle your fancy.",
            "date": "2017-07-16T12:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 253007,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6406417.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Dovahgatr",
                "username": "Dovahgatr"
            },
            "url": "https://myanimelist.net/reviews.php?id=253007"
        },
        {
            "content": "So, one thing I hate is being promised chocolate but given steak. Let me explain: I love chocolate, and I love steak, but if you tell me you're gonna give me one thing, but I get the other, I'll still be disappointed. This is what Nanbaka did. I went in, having finished the first few episodes, being promised sweet comedy chocolate. I was primed to laugh at the goofy antics of Jyugo and crew, as they lay in a maximum security prison for petty crimes. And you know what? They accomplished what I thought they set out to do. The first few episodes may besome of my favorites from anime. The humor just resonated with me! It was goofy, witty, and most importantly, didn't take itself too seriously. Imagine my surprise when the main course was brought out. Lifting up the lid of the first half of the series, I found not my delicious chocolate comedy, but a battle-scarred, overly serious shounen steak. I was shocked but still resilient. With a sigh, I dug in. \"I will enjoy this anime.\" That was my mantra, episode after episode. I kept thinking, \"If I just get far enough in, it'll go back to being what I want.\" It didn't though. It was a show full of men with neon hair, covered in body glitter, pretending they were in the most serious of situations. It was painful, like watching a clown in a fist fight, the crowd yelling, \"You'll just hurt yourself! Go back to what you do well!\" I have to admit, though. It drew me in in the last episode or so. I was genuinely concerned for the characters, invested in the plot. For a minute, I forgot its betrayal. I flipped to the next season, having finished season 1, ready for more. The next episode was a slap in the face. The title? \"Nanbaka is a comedy anime\". The content? Mediocre. I was done. I AM done. Season one is the end of my life with Nanbaka. So ends the days where I would sit down every Tuesday, just to have a laugh. Truth be told, those days ended long ago. I didn't enjoy this anime, but in truth, I hope you can. This was my first review, and I hope it wasn't horrible... Anyways, if you've come this far, I give you my sincere thanks. Have a great day!",
            "date": "2017-06-06T19:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 249407,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5654094.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/protomug",
                "username": "protomug"
            },
            "url": "https://myanimelist.net/reviews.php?id=249407"
        },
        {
            "content": "Warning possible Spoilers\r\nThe only other prison anime I have seen is Prison School and we all know how that went so seeing this was a action/comedy it certainly caught my eye and I was definitely surprised by this.\r\nThe story focuses on the hilarious everyday lives of the Inmates and Guards of Nanba Prison, but not everyday is full of laughs and enjoyment.\r\nI thought this was just going to be another anime that is just full of random comedy with hints of action which it was at first, but by the halfway point the story turned into a dark thriller and this surprised me because youfind out more about some of the inmates who have their own secrets.\\n\r\nIt was also fun seeing the attics that the inmates get up to so they can annoy the guards who also have their own problems with each other.\\n\r\nThere was a few sections that really stood out for me like the new year tournament and pretty much the second half where the situation goes from comedy and action to dark thriller which was a unexpected twist of events.\\n\\n\r\nI thought the characters were very likeable and usually I don't watch a lot of anime's that mainly focus on male characters since pretty much all the Inmates and Guards are dudes apart from one character.\\n\r\nThe main Inmates are Juugo, Uno, Nico and Rock who for a band of prisoners work so well together they have good chemistry and are really funny plus they care for each other too since all they have is each other.\\n\r\nJuugo is pretty much the most interesting character since he has a dark backstory and has a secret ability that is shown later in the series, but is someone you will fell sorry for since he didn't have a choice in the matter.\\n\r\nThe other inmates Uno, Nico and Rock are also fun characters since each of them have specific feature that makes them stand out like for example Uno is a womaniser, Nico is a huge anime/manga fan and Rock just loves to eat food now even though these are pretty big cliches in the anime world these characters fit those personas really well and it keeps the show going for me.\\n\r\nThe Guard characters are also fun too because even though they are OP when fighting the prisoners and each other they actually do get some development and you go from seeing them as just adversaries for the prisoners to well rounded characters.\\n\r\nI also have to say there is a lot of trap characters like as of the end of the series there is probably 3 or 4 of them and that would catch a lot of guys off guard.\\n\\n\r\nOne thing I can definitely say about the Artstyle is that it is very colourful and sparkly yet for some reason it fits mainly because of the fun nature of the show and it's characters and it still somehow works when there is a serious moment going on I mean there is probably every colour of the Rainbow throughout the show. The same can be said for the characters because almost everyone has a very elaborate hair style or colour and it can be pretty distracting at times.\\n\\n\r\nNow the show does start off with Comedy and it really starts off strong because most of the stuff that happened during the first 3 episodes was pretty damn funny and then it turns into action at the halfway point which was the New Year Tournament and for a tournament or challenge type episode (or episodes) it was seeing how powerful the characters were and made you think that messing around with them is not the best idea.\\n\\n\r\nOverall I think this was a fun and colourful show if you're looking for funny characters and a surprising story then you might actually enjoy this anime.",
            "date": "2017-06-06T03:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 249367,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=249367"
        },
        {
            "content": "The creators of Nanbaka looked like they didn't know where they wanted the show wanted to go, the story line went from lighthearted to serious and back to light-hearted before you even know it.\r\nArt:\r\nI absolutely loved the bright colors throughout the show. My only concern is the sparkles that float around throughout the show. These sparkles added a fun touch but when the series got more serious, these sparkles were out of place and took a toll on the dramatic effect.\r\nSound:\r\nI'm not a huge critic on voice acting but I can say that it sounded pretty good to me :3 \r\nI LOVED the opening andending songs, both are catchy and memorable. I never skipped the opening/ending when it came up like I do for most other shows. \\n\\n\r\nCharacter:\\n\r\nEach character is memorable and has a unique personality. You can really see the connection between characters and their development throughout the show. \\n\\n\r\nStory:\\n\r\nBasic plot, just the whole revenge cliche. I could have gone without the filler episodes after a cliff hanger on the previous episode. It really takes a toll on the tone of the scene. Although I enjoyed the filler episodes, they could have easily been placed in another part of the show and not smack in the middle of two dramatic episodes.\\n\\n\r\nOverall:\\n\r\nThe show is definitely a mess, but what made it enjoyable was the characters and art. I loved seeing the main characters interact with the guards and the other inmates. And the flamboyant colors, only when they are justified, however, added a special touch. I would not consider this a show to binge watch, but one or two episodes every now and then is just the right amount. The show gets an 8/10 for me :)",
            "date": "2017-03-18T00:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 242839,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4368315.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Denisecvo",
                "username": "Denisecvo"
            },
            "url": "https://myanimelist.net/reviews.php?id=242839"
        }
    ],
    [
        {
            "content": "This review encompasses season 1 and 2.  \r\nI want like Nanbaka a lot.  The biggest positive is without a doubt the style of the show.  The \"content\" itself is just ok.\r\nI love the way everything looks in this show.  All of the character designs are super distinct.  This makes a huge difference for me, as theres nothing more I hate then trying to figure out which high school girl is which by the color of their hair alone.  These guys are vastly different heights and sizes, with transitional hair, different teeth styles, uniforms, eyes, number placements, accessories, etc.Its undoubtedly the best part of the show.  So if youre interested, just google search the characters and if you think they look cool, then watch it.  \\n\\n\r\nThe comedy part of Nanbaka is fine.  I was never rolling on the ground, but some of the jokes were pretty good.  The show unfortunately falls into a typical, shounen plot line by the end of season 2, which it leaves on a massive fucking cliffhanger.  \\n\\n\r\nI enjoyed my time watching Nanbaka, but past the style and a few jokes, its just alright.",
            "date": "2018-07-24T22:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 284720,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5854565.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dnny99",
                "username": "Dnny99"
            },
            "url": "https://myanimelist.net/reviews.php?id=284720"
        },
        {
            "content": "Now...How the dickens did I find out about this anime called Nanbaka? Well, let me explain. A Mimimi AMV on youtube. I really liked the art style, but I only watched about 30 seconds of it, because I didn't want to look at that many spoilers. It looked like quite the enjoyable comedy anime, which it was for about...6 episodes or so? 8? I don't know. But at one point in the series it went from this: :O \r\nTo this: :/\r\nThat was because of the (to me) cliche dialogues which hardcore roleplayers would die for, and the lack of comedy. There was a gag hereand there, but that was it. I litteraly no other comments about this anime, because the first half were worth an 8 or even a 9.",
            "date": "2018-05-22T12:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 281184,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7202731.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JustProud",
                "username": "JustProud"
            },
            "url": "https://myanimelist.net/reviews.php?id=281184"
        },
        {
            "content": "I’ll put it simply: this is one of the most fantastic anime I’ve ever seen. I’d even go so far as to put it in my all-time favourite top three. It’s a rollercoaster ride that takes you from comedy to drama to mystery, and grips you from start to finish. The story is at times so ridiculously comical that it’s obviously a parody of the genre, and at other times so deep and heart-wrenching that you’ll wonder if you’re even watching the same anime as moments before. \r\nThat’s not to mention the sheer fabulousness of all the characters, and the setting. Steer far away fromthis if you don’t like sparkles, because Nanbaka does not stop sparkling. Ever. Even at the climax of the story each character is surrounded by glitter and bright colours. Some people won’t like the stark contrast between the content and the setting, but I think it summed up the tone of Nanbaka perfectly. The series isn’t meant to be realistic, even though the characters are some of the most relatable I’ve seen in anime. The entire show is a parody, and the fact that it can be both satirical and emotional at the same time – successfully – just shows me how brilliantly it was done.\\n\\n\r\nThe story starts off as a lot of nonsensical fun; a bunch of wacky inmates who constantly try to escape from the most secure prison in the world. This is an arc that’s purely comedy, you’re introduced to the characters and the setting, and get a taste of their daily life. The type of comedy is something I would describe as similar to Gintama or Nichijou, it’s very self-aware and basically just random. There are a lot of references, the gag humour is hilarious, and there’s a lot of witty dry humour too. It caters to most areas of comedy at one point or another (although it doesn’t tend to be crude). It’s awesome if you like that kind of thing.\\n\\n\r\nThe second arc veers off topic slightly, dealing with special events in the prison. The tone starts off similar to the first – very heavy focus on pure comedy - but shifts near the end and becomes altogether more serious. \\n\\n\r\nThis leads into the third arc, which is a masterful depiction of the main character’s mental state. There’s some amazing character development in this arc, and it’s what cemented this anime as a favourite for me. Sure, it’s very different to the previous arcs, but the shift was actually needed at about this time – it’s just when the audience starts to get tired of the endless humour and want a more fleshed-out story. The mystery element was also expanded on here, and was quite frankly unusual and really intriguing. It provided an understandable explanation of the MC’s reasons for his actions, and served another purpose in that it allowed for some meaningful interactions between the inmates and the guards which added more depth to all their characters and the story. \\n\\n\r\nAlmost all of the characters are good. And I don’t mean that in like a ‘righteous’ kind of way. I mean that they’re done really well. Each and every character has some sort of ridiculous but memorable design and quirk, which makes watching them really fun and ensures you don’t constantly have to check who’s who by referring to previous episodes. Minor characters get development that can change your whole view of them, each challenge plays a major part in understanding or developing a character, and no one is introduced and then never seen again. \\n\\n\r\nJuugo, Nico, Uno and Hajime felt like real people, despite how exaggerated their characters were. The way they cared about each other was strangely relatable, and very touching to watch. The concept of family was presented beautifully. Forget Fairy Tail and the power of Nakama, this anime shows how a group of misfits can become family in an incredibly heart-warming way which somehow still seems realistic. (Odd, considering that it’s meant to be a parody and all, but that’s part of what was nice about it.)\\n\\n\r\nThe art is…flashy. All the characters have these elaborate multicoloured hairstyles, long painted nails and weird eye colours. If you can get used to that, or find it entertaining, you’ll enjoy the anime much more, because bear in mind the art is a big part of this anime. It’s a part of the anime’s identity – Nanbaka wouldn’t be Nanbaka without the art. \\n\\n\r\nThe animation is captivating, particularly around the action scenes, and the sound is superb. I absolutely loved the opening, ending, seiyuus, and sound effects. They added so much to the anime. \\n\\n\r\nOkay, hold up. So I’m aware that I haven’t been strictly objective. It’s hard to remain unbiased in a review when I actually love the show so much. So now I’ll try and list a few of the things the anime could have done better in, for the sake of being fair.\\n\r\n•\tRock really needed some more development; all the other characters were explored beyond their basic hobbies but he stayed a one-dimensional foodie to the end.\\n\r\n•\tThe mood shifts – I personally liked this but it could be confusing at times, and the heavy parts were a big leap from the comedy it proclaimed itself to be. The sparkles also really shouldn’t have been in at the more emotional points.\\n\r\n•\tThe warden’s crush was irritating after a while, too much time was spent on it without any progress.\\n\r\n•\tThere were a lot of unanswered questions at the end (although there is a second season which I’m assuming resolves this).\\n\\n\r\nSo, what do I think about Nanbaka? \\n\r\nIt’s wacky. It’s zany. It’s sparkly. It’s utterly ridiculous at some points, and deep and thought-provoking at others. It will make you chuckle, snort, laugh and show other expressions of joy. It might also make you smile sadly, clutch your heart and wipe away a tear or two (although the last is unlikely).\\n\\n\r\nOverall, it’s a reminder of why anime is a medium unto itself; for better or for worse. Where else would you find something like this? I can’t recommend it highly enough. XD\\n\\n\r\nNB: Obviously, I’m talking to fans of comedy and the like here. Don’t come hear looking for a realistic slice-of-life, romance or thriller. Duh. 😊\\n",
            "date": "2018-02-15T20:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 271605,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=271605"
        },
        {
            "content": "TLDR:\r\nNanbaka really shines in its art and its characters, the story is alright and the sound design is forgetable\r\nFirst off, the art. The bright and vibrant colours used for the show really emphasise the lighthearted fun nature of the show, the fact that everything sparkles is immensely comical and I still find great amusement in that simple fact at the end I never think it gets old. Secondly the art contrasts with the setting to allows the shows tonal shifts to not feel jarring.\r\nCharacters. The Characters a the single best thing about the show, I believe that all of the supporting cast in this showcan stand toe to toe with a most protagonists in other anime. Each person has such a large amount of personality and nuance makes it truly interesting to watch their reactions play out.\\n\\n\r\nThe Story is... passable. It's interesting don't get me wrong, but it doesn't have a large presence, ultimately while it does not take anything away from the show, if you are looking for an in depth story with lots of nuance and originality, you won't find it here. One thing the story does do, is it allows the show the ability to feel it is continuing to move\\n\\n\r\nOverall, I think this is a very solid show that lets you have a fun time, its comedy segments are all well done and amusing, and the story with the more serious elements serves its purpose in continuing to evolve the setting and have the characters change in meaningful ways",
            "date": "2018-01-02T02:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 267175,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5248390.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Vongrak",
                "username": "Vongrak"
            },
            "url": "https://myanimelist.net/reviews.php?id=267175"
        },
        {
            "content": "Quick disclaimer before I start this review. Is Nanbaka one full season, or is there two seasons. Because Crunchyroll advertised it as one season with 25 episodes while Myanimelist treated it as two separate seasons. Either way, as of this review I will be reviewing Nanbaka based on the 25 episodes that I watched. And by god, what a load of crap this was in the end. You know if I ever had to make a comparison to Nanbaka, I would compare it to the Sonic The Hedgehog franchise. It was praised at birth, went through a horrible phase at one point, became good againand then turned into absolute shit yet again. I got the impression that this was a comedy, however when you search for Nanbaka under the comedy section in Crunchyroll, it doesn't appear. So what is this anime? Is it actually a comedy? The show states multiple times that it is a comedy, but most episodes had more action than comedy inserted. Even then, I didn't particularly enjoy Nanabaka when it was an action adventure, it worked better as a comedy and thats the way it should've stayed! That's what Nanbaka shines at the most if you ask me, its the comedy. Around 75%, the jokes that were presented to me made laugh and giggle and it matched with the tone of the anime. For the most part. I love it when the characters break the fourth wall and when the art style changes to a more cutie approach. Something I haven't really seen from any anime that Ive watched at this moment. But Im sorry to say, this is all the good things I have to say about this anime. So here are my negatives.\\n\\n\r\nWhats the story of this anime again? I didn't even think there was a story in the first half of Nanbaka. It was more or less an insight as to what the inmates got up to in there daily lives at Nanba. The main prisoners get forced into a tournament with the Nanba guards, so for around five episodes the prisoners are trying to compete against each other. You may be asking yourself, why is a prison holding a tournament when they should be cleaning up the lavatories or at least mowing the lawns. You can ask yourself that, but Im afraid you won't get a definitive answer. There were times during this show where I legitimately asked myself \"Hey is this even a prison?\". It sure doesn't feel like one sometimes. After a certain point in the tournament, the main character Juyugo gets into a little fight with Musashi as they had some previous rivalry in the past. However this little fight turns into what I can only say feels like a Pokemon battle. Musashi becomes Charizard and starts shooting fire balls and Juygo evolves into Heracross and grows these giant swords from his arms. When this scene occurred, I was so bewildered. It nearly turned me off from watching any more episodes, because the show was trying to be something that it clearly was not meant to be in the first place. I get that the show is not meant to be taking itself seriously, but i thought this was a show about normal prisoners trying to escape prison. But no, they can perform hadokens and weird anime shit. The next few episodes after that are filler until the 13th episode where things start to get interesting which then ultimately leads onto the second half. So if you didn't like the first half, then I think your asking a lot of yourself to go ahead and watch the second half.\\n\\n\r\nThankfully the second half is better, but not by that much. There is more of a story, not that its climatic or anything. But like the first half we get filler that adds nothing to the story and characters that get introduced and are never bought up again. Ontop of that the main villain in the second half does absolutely NOTHING!!! He more or less stands around saying that he's going to kill off Juyugo but does nothing about it. We get four episodes dedicated to fighting the same guard who can't seem to understand how to fucking die. Btw that Prison guard would make a great Kitana skin in Mortal Kombat X. These episodes are clearly filler and there is obviously no structure to the story whatsoever. The second arc doesn't even bloody finish, it leaves you on a cliffhanger hoping that you wait another year to watch the 3rd half. And i thought people complained about Mob Psycho 100s ending.\\n\\n\r\nI struggled to find any connection with the cast members. I don't know why I should care for Juygo, Uno, Rock and Nico at the end of the day because they are prisoners. Even so, they are nice prisoners which makes you wonder why they were put in prison in the first place. I was really looking forward to seeing the character interaction between the main prisoners, but they get split up most of the time in later episodes, so I was really disappointed in the end. Its really hard to actually understand there motivations and goals, because aside from Juyugo, the other prisoners have already met their goals despite how childish they may seem. Juyugo doesn't even know what he wants in life, so thats a massive problem which doesn't get expanded upon. Moving onto Haijme, he's the character I actually got the most enjoyment out of. Mainly because he's just a big bully that doesn't want his workload to increase, and along with supporting character Seitarou, I got the most laughs from both of these characters. There is more character interaction between the prison guards rather than the inmates.\\n\\n\r\nLets move onto the art style! Now this anime is colorful and the crazy character designs are absolutely gorgeous. But Nanbaka is set in a prison after all and aside from Haijme and then four main prisoners, none of the cast members actually look like they belong in a prison let alone work for one. But the biggest offence that I found from the art style was the backgrounds. On more than a couple of occasions you'll be looking at backgrounds that look like they could've been made in Photoshop. Orange triangles, pink and white polka dots and blue and purple zigzags, and you see this more than the prisons architect itself. Which is a shame because the Prison Nanba is beautiful to look at. However when your not looking at these colourful backgrounds, your mainly limited to grey and boring prison cells. When you boil it down, it looks like to me that this was a budgeted decison. Did I also mention about how unimportant cast members just get turned into blue and lifeless stick figures? Whats up with that?\\n\\n\r\nThe music wasn't really memorable either. Rin Rin Hi Hi was the only decent track that I got some enjoyment out of. However when you watch the second half of the show, the band who sings the song sound like they snorted a bag of cocaine and then sung the song again. Except this time, it sounds like utter shit.\\n\\n\r\nIn short I refer to the quote that I made back at the very beginning. But Nanbaka is just like Sonic The Hedgehog at the end of the day. An anime that I was honestly interested to see left me with a feeling that I didn't get with other anime such as Mob Psycho 100 or Gurren Lagann. You know what, go watch that instead because its consistently funny and those shows establish itself as a action and a comedy from the beginning. Nanbaka starts off as a comedy then turns into an action midway. Like Twin Star Exorcists, the show has a hard time trying to understand what it wants to be. Don't watch this anime, if you want to go and watch a couple of episodes go ahead. But take my word for it, this is nothing special by any means.",
            "date": "2017-09-02T06:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 256719,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5766677.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DarkLewis99",
                "username": "DarkLewis99"
            },
            "url": "https://myanimelist.net/reviews.php?id=256719"
        },
        {
            "content": "Overall: 4/10\r\nNanbaka had vast potential as a pure comedy anime. The animation and characters were stellar, and all the anime needed to do in order for this to be a hilarious and entertaining watch was to follow the everyday life of these guys and observe how they interact with each other. But whoever is responsible for writing this managed to screw that up. By the end of the season, I felt as disappointed as I've ever been by an anime, which says something considering I've seen Gantz.\r\nStory: 1/10\r\nWatching this anime, I got the feeling that whoever wrote the material thought it was critically necessary toadd some degree of a serious plot in order to make a good anime. The plot shows up about halfway through the season, and shatters everything that was good about the anime up until that point. The first six episodes were funny, lighthearted, and pure. There wasn't any plot to speak of, just a series of minor arcs unrelated to any kind of bigger picture, and that was just what this anime needed. Then, all of a sudden, the most forced plot I've ever seen came up out of nowhere and dragged the mood, experience, and humor down to rock bottom. It ran completely against everything that had made this anime great, stomped it out and took it over. Even putting that aside, it was just a terrible plot. It didn't make any sense, and just felt fake and forced, as if it was only there to fulfill some sort of requirement. \\n\\n\r\nArt: 8/10\\n\r\nThe art style of this anime was unique, vibrant and quirky, matching the characters and setting perfectly. Everything was crazy brightly colored, the characters were all given flamboyant styles to match their personalities, and every line drawn was crisp and sharp. The characteristic style of this anime, in which the foreground objects (characters and the bare minimum of props) were isolated from the rest of the setting and drawn against a conspicuously colorful patterned backdrop, was used to great effect in most scenes where two characters were interacting with each other, highlighting the action and accentuating the comedy. Normally, this would merit a 9/10 score from me, but the art stopped matching the mood when the plot kicked in.\\n\\n\r\nSound: 5/10\\n\r\nThe soundtrack in general was pretty average. I took off one point because there was at least one scene where the music did clash with the atmosphere and detract from the experience. However, I really liked the outro, which is worth about half a point to me, and I partially counted the announcer-guy as a component of the soundtrack, who added another half point to bring the score back to average.\\n\\n\r\nCharacter: 7/10\\n\r\nAside from Jyugo and the other characters related to the \"plot\", every character in this anime is amazing. They all have very distinct, very flamboyant personalities, that show so prominently that none of them really needed any backstory or specially dedicated screentime in order for the viewer to understand them thoroughly. They complement each other perfectly, and the natural interactions between these eccentric people would have been more than enough to make for a thoroughly entertaining watch without any semblance of a story whatsoever. Like with the art, this would normally elicit a 9/10 from me, but I have to take one point off for Jyugo's forced backstory and another point off for the rushed introductions of the other prisoners in the first couple episodes.\\n\\n\r\nEnjoyment: 2/10\\n\r\nBy the second episode, I was cautiously optimistic for this anime. By the fifth episode, I was having a blast watching this. But once episode 7 rolled around, it dove downhill fast. I think I've already addressed why in the overall and story sections. The feeling of utter disappointment by the end almost completely drowns out any enjoyment I had earlier on, but I will give it one point above rock bottom.",
            "date": "2018-06-19T15:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 281597,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/mvhcmaniac",
                "username": "mvhcmaniac"
            },
            "url": "https://myanimelist.net/reviews.php?id=281597"
        }
    ]
]