[
    [
        {
            "content": "First of all, I'd like to say that I'll be giving a normal review this time, no more weird ass insights and comments.\r\n  HELL WHO AM I KIDDING, here we go, so Boku wa Tomodachi Ga Sukunai NEXT, or I Don't Have Many Friends. From the name alone you'd think, damn is this some weird ass anime about finding friends? Well, it is, for the most part anyway. For those that haven't read the damn synopsis - lazy bastards, Haganai NEXT is about our good friends from the neighbors club, namely Sena, Yozora, Rika, Yukimura and the only guy - Kodaka, who think theydon't have friends (or so they believe) so they stick together and \"practice\" things that normal buddies would do -they totally have no friends. Now that I've got that out of my way, ONTO THE REVIEW!\\n\\n\r\nStory: 9/10\\n\r\n So like, Kodaka, as you should already know is part of the Neighbors Club, they're always embarking on funny -and sometimes extremely weird adventures with each other. The story itself seems pretty normal, but the way it's shown is NOT, it has enough comedy in it to keep me entertained the whole time, laughing my ass off, yet enough plot to keep me hooked on the damn show - something a lot of animes fail at. Horse Heads, Blonde Wigs, Meat, Bald Wig-thingy, and even a Mayo Chiki! references are all included in this anime, I'd say that with all of these things it really, REALLY deserves a 9/10\\n\\n\r\n  In Short: Great laughs all around but enough plot to keep a viewer hooked.\\n\r\n  \\n\r\nArt: 10/10\\n\r\n What can I say, I loved the first season, and the second season's art is even better. No shit I'd give it a 10, the colors provide for a vivid and enjoyable anime watching experience, they blend well and really show the character's personality off. Just viewing it makes my eyes feel nice, it's eyecandy bro.\\n\\n\r\n  In Short: Shit dude, just read the actual Art rating, it's pretty short - Vivid and Enjoyable.\\n\\n\r\nSound: 9/10\\n\r\n This is probably because I've grown too used to the voice actors, but I'd say they make the characters sound the same as they look. The chatter between characters is a pretty big thing here, and the voices of the characters really play a large role in the comedic scenes, like \"voice imitations\" and sound effects. I don't skip the intro, meaning it's pretty good. I would have given it a 10/10, but I feel that it's lacking something, so for now the best I can do is a 9.\\n\\n\r\n  In Short: The voice actors were chosen well and the sound effects really aid in comedic scenes.\\n\\n\r\nCharacter: 10/10\\n\r\n Now, for me, there are a lot of things that make a comedy better, one would be perverts. They're the butter (bread and butter, it's the butter) of comedy, whether it be Nikaidou Arashi from OniAi, or Kirche from Zero no Tsukaima, they always provide for a lot of laughs, that's where our resident perv-I mean scientist comes in. Boobs, would then be the bread, allowing jokes to be made about how large the characters mea- I mean breasts are, or how small and neglected they look. Obviously, we're missing an integral part of a harem - the childhood friend, but have no fear, because Yozora appears! Yozora, (one of my favorite) the weirdest of the club, is also Kodaka's childhood buddy (Season 1), and also creates most of the jokes/parodies that appear in the anime. Being the only guy, Kodaka would obviously be the center of attention - A.K.A. the harem boy, and as usual he doesn't even notice (lucky asshole). Lastly, what would a comedy be without the\\n\r\n unsure-gender-person Yukimura!, (well it gets solved but whatever). The large amount of  comedic potential in these characters are MASSIVE, and they're, well in my opinion used properly, not just throwing in excess characters that would usually make things funnier, but actually make things worse.\\n\\n\r\n  In Short: All the characters you would expect from a Harem-Comedy anime, the perv, the boobs, the guy, the childhood friend and the gender bender, but used to their maximum potential.\\n\\n\r\nEnjoyment: 10/10\\n\r\n  Friday, friday gotta go home on fridays. Extremely hilarious, amazing characters, there was never any doubt that I would give it a 10 in enjoyment was there, I mean I did mention how funny I found this anime, didn't I? Finishing each new episode leaves me craving for more, what's the new skit? what's happening next?\\n\\n\r\n  In Short: wake me up when the next episode airs\\n\\n\r\nOverall: 10/10\\n\r\n Now, before you go on blabbering about how it doesn't deserve a 10, I'd like to say that THIS IS A REVIEW, by ME, not by YOU, god damn it people. Boku wa Tomodachi Ga Sukunai NEXT, overall is an amazing show, it may have some minor errors here and there, but it's still an enjoyable watch. I recommend you pick this series up and follow it as it goes. cheers",
            "date": "2013-02-13T05:53:00+00:00",
            "helpful_count": 255,
            "mal_id": 86695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1663151.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DammitAgain",
                "username": "DammitAgain"
            },
            "url": "https://myanimelist.net/reviews.php?id=86695"
        },
        {
            "content": "Édit: Honestly I don't like this show that much like I used to, But I leave my thoughts on how I liked it back then. \r\nBoku Wa Tomodachi Ga sukunai NEXT or Haganai Next,  abbreviated, is one of those anticipated sequels almost everyone who saw the last season was waiting. After the amusing and fun time at the Neighbors Club we get a new season full of laughter, emotions, confessions and more. In which really I wasn't expecting to be more developed in that way than last season. which it is one of the main parts that are going to be analyzed here.\r\nSTORY =8\\n\\n\r\nThe story continues were the first season left. A new year at the Neighbor's Club in which we see the 7 members of the club sharing and spending time together trying to make friends. The story in this season is very developed in the way that the characters seem to mature more. At the beginning we encounter the sillyness in which the first season characterized the show, DOING ACTIVITIES AS A GROUP! But as we get going with the show we see that the characters are trying to fullfill the purpose of the club and trying to actually be friends and not just being a group of people in a school room. \\n\\n\r\nThe story, to describe it, is not that epic or amusing. Yet it is very intense with the truths and face to face confrontations in which everyone gets into. Also to add that it is more realistic to demostrate the feelings towards each other. Instead of only making fun of them and doing this great use of innuendo, sexual jokes and harrasment in which  the first season showed A LOT.  Also that the story really progresses and doesn't stay as an episodic anime as it was demostrated last year. It is fun and you can get caught into it. Making it  very easy to absorb.\\n\\n\\n\r\nART = 9\\n\\n\r\nThe art is admirable. The touches of bright colors give great effect in the series' presentation. It gives the impression that is alive and vivid seeming almost real. Specially the touch for the design of the characters, the main parts. For example the eyes of every character specially Sena, Maria, Rika. It feels that they can watch into your soul. Also the hair  color for Kodaka, Kobato and Yozora make the reflection is given to their hair. Plus the color for the characters' skin, cloth and every trait that they have, it is outstanding. But also the important fact of where is taking, the scenario. The scenarios are a real portrait of the real live theme parks, parks, schools and even the room seem to be taking with exact detail to be animated. It is really gorgeous.\\n\\n\\n\r\nSOUND = 5\\n\r\nThe instrumental pieces are not that good for me. Starting with the opening and ending. Both I found them very childish and just really annoying. Making it sound very irritating to the ear. But if we see the series of how it is, they are well incorporated to story that they want to tell. \\n\\n\r\nThe Ost isn't also that outstanding. It is very common for a series and doesn't have any instrumental piece that I could be hearing over and over to remember that it is from Haganai. It is very standard. Maybe the only exception would be the ''YOU GOT MAIL'' Ringtone of Kodaka's phone. But the rest of it is just average.\\n\\n\r\nThe voice acting is incredible. The actors give real life portrait to the characters and match with their personalities very well. Specially Sena and Rika whose voice actresses talk and they bring them to live. The one that I hate is Maria's actress which is very stressful with that pitch voice. \\n\\n\r\nCHARACTER = 9\\n\\n\r\nThis is the part that admire the most of Haganai Next.\\n\r\nThe characters are very well developed in this season. They give them something that was left in the first series and it was character and personality. Because on the first series they were very cliche characters and fight against each other for that reason. But here they have grown up and try to make their desire and club purpose together.\\n\\n\r\nStarting with Kodaka Hasegawa, the  often mistaken delinquent. It is very conservative, serious and easy going. One of the founders of the club. Here, he continues with the same characteristics but he develops himself very well, until the end of the series. Because of this he doesn't confront anyone but for this trait he loses a lot with their mates, because it turns himself into a coward and running away from others. This character I find him just normal and very average, it doesn't add something but with some series like this, there must be a guy.\\n\\n\\n\r\nThen we have Yozora Mikazuki. She has changed in many ways first with their hair and then with the discovery of her childhood friend. She is very aggresive and a tomboy. This character is very complete and she'll give the spectator good reasons to laugh and follow her track. This character I found her very well done characterized  by the producers. Because with the discovery of his friend she tries to keep going althought at the same time being inmature for only that reason. \\n\\n\\n\r\nSena Kashiwazaki has to be my favorite character of the series. She isn't just your typical stereotype of Blond and Giant boobs that almost every anime contains. She is a character with  intelligence, rich and mature girl. She  portraits her desires to be strong and be together with everyone, except Yozora. This character is of my taste because is determinated to accomplish her goals with courage and hard work. In this series we see how her father is very influential in her life and a daddy's girl. But what I love most of her is her ''AHO'' yelling to Yozora in their fight without a doubt. Without both of them the show is nothing.\\n\\n\r\nRika Shiguma. She is one of  the characters that outcast the most. Her development is very rich. Also she doesn't stay as the nerdgeekfreak of sexual thoughts and yaoi mind. She is self-centered in the things that she has to do and also she focus to find friends among herself. She is very distinguished in this series because she changes her clothes and uses a different look in every situation not like most characters in series.\\n\\n\r\nThen our Male/Female character Yukimura. Very Cooperative and Loyal to Kodaka. (I use ''it'' for the review because I know what gender is) It is another character whose real self will be discovered but will keep the same affection to its room mates. It is a flat character with almost the same expression and voice tone to everyone.\\n\\n\\n\r\nAnd finally our two lolis, Maria and Kobato, the fight of good and evil, well not exactly. But those almost make my day with their Heaven vs Demon's Brawl and fight for whose belief is better. They are very entertaining and sometimse they demostrate their cuteness. ~ku ku ku~\\n\\n\\n\r\nENJOYMENT = 8\\n\\n\r\nHaganai Next is very entertaining against its prequel. It simply grows up as a show. Taking away the overuse fan service that almost make me puke and don't watch this one. But here I enjoyed it because I laugh with cute sillyness and not dirty mind and double sense jokes like its predecessor. \\n\\n\r\nThe confrontations of the characters give  good drama going. Plus reveals and puts us on the characters shoes and we feel their empathy. \\n\\n\r\nAlso with the inclusion of the characters such as Kate and Aoi give a nice touch to the series.\\n\\n\r\nThe only bad parts that I found are the characters' past not yet shown. Just Yozora-Kodaka childhood but others not. Like why Yukimura is like that? or what did Yozora did after she left in her childhood? Those answers that are unknown. The other one the ending of the series is just very abrupt the ending for the way it is. But I hope and pray for a 3rd season to come out to clear this up as soon as possible. This 2 things are what I have problems with, the rest is enjoyable. Although I don't see it that strong to be classified R+.\\n\\n\\n\r\nOVERALL = 8\\n\r\nI recommend it, if you survived the first season as I did. It is funny, dramatic with a good presentation, very well animated with great voice acting, and story. So you will really enjoy it if you are looking for a short show.\\n\\n\\n\r\nThanks a lot for those who have read this review and sorry if I had  grammar issues. English isn't my mother language.\\n\\n\r\nMEAT~MEAT~MEAT.",
            "date": "2013-03-29T11:06:00+00:00",
            "helpful_count": 204,
            "mal_id": 91461,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KevSan",
                "username": "KevSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=91461"
        },
        {
            "content": "From friendship to romance, things get a little more serious on Haganai NEXT. As the relationship between Kodaka and all other girls reaches another level, new feelings are shown... It's love... But how can Kodaka deal with that? Afterall, he never stood in a situation like this before, where someone actually falls for him... Would he be able to face it and tell what he really thinks about that?\r\nUsual activities from Neighbour's Club still occur and it's main objective didn't change, at least, for Yozora... If it was really accomplished, there would be no reason to keep the club active... None of them wished that,so acting like they haven't made any friends yet seemed the best choice...\\n\\n\r\nBut would this be the only way to end it all? Yozora, Sena and Rika slowly begin to fall in love for Kodaka... Sudenly, it turns out to be a romantic comedy! As a girl and a boy become friends, there is no reason for both to get closer and be more than that. A real couple should care for each other and having a normal relationship is the first step on approaching someone you like... However, other friends may not know how to react or  may have feelings they also wanted to show... Things can get weird and everything can fall apart instantly... Haganai NEXT is deeply related to real life by handling all this frindship X love subject...\\n\\n\r\nThe small group of friends from Neighbour's Club remained untouched, as no new additions were made. Yet, new characters are introduced, despite those only relating with Kodaka. Yozora, Sena, Rika and Yukimura also start to aim on being alone with Kodaka... He pretends not getting what they all really meant... He's affraid of having a deeper relationship with any of them...\\n\\n\r\nEnding was left open, so we can expect a new season coming out soon! Cheerful OP, like the last one, but I liked first season's ED better. All this friendship stuff is complicate... Mixing it with love is way worse... Obviously, it's almost certain that dating someone will hurt another one's feelings... That's what we should watch out for... So let's just have fun, as friends!",
            "date": "2013-10-14T06:08:00+00:00",
            "helpful_count": 91,
            "mal_id": 116809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=116809"
        },
        {
            "content": "Ah, another season. It's been over a damn year since the original Boku wa Tomodachi ga Sukunai debuted and seemingly, I almost forgot some of the events and giggles from season 1. Well, I remember some memorable moments but let's cut to the case here. Season 2 of  Boku wa Tomodachi ga Sukunai is here at last. It's time to once again see what the Neighbor's Club like to do during their every day lives.\r\nAnd I know that there are a lot of ways people like to enjoy during their leisure time. Some people likes to watch anime or read manga. Some people likesto discover a new hobby. Some people likes to hang out with friends. Some people likes to go travel. Then, then are some people who lacks friends and wants to make some in order to live out their short and miserable lives It's especially not easy to make friends when the look on your face represents one that looks like a delinquent. It feels like you're the new kid at the block and everyone holds some sort of aversion towards you. Luckily though, there's this club that can remedy your alienation. It's called the Neighbors Club.\\n\\n\r\nYes, it's back! It's season 2 of Boku wa Tomodachi ga Sukunai (also known as Haganai)  This is the direct sequel of the original season that debuted in Fall of 2011. It's been over a year and here it is once again with the Neighbors Club. The series is based on the light novel of the same name written by Yomi Hirasaka. The series details the activities of the Neighbors Club and how they live their every day boring lives. They don't have friends but they do have themselves and each other. With that, let their days of fun begin.\\n\\n\r\nFirst of all, what is the Neighbor's Club?\\n\\n\r\nGenerally, the Neighbor's Club is a group of people founded with the purpose of making friends at St. Chronica's Academy. The academy is located at Catholic School and many of the students there views the main male protagonist as a foreigner, a delinquent, and generally someone who seems to be a troublemaker. Of course, this is a misconception and misjudgement. In fact, Kodaka isn't there to make trouble. He's there to make friends and with the Neighbor's Club, it makes the purpose of just that.\\n\\n\r\nThe series retains its small cast of main characters who are all members of the Neighbor's Club. Besides Kodaka, the main male protagonist of the series, there is Yozora Mikazuki. She is seen as a girl who is egoistic, bitter, and a degenerate who seems to enjoy the idea of bullying. With her cold blooded personality, she lacks friends. It is not until she meets Kodaka and the other members of the Neighbor's Club that she decides to open herself more. Yet of course, she retains not only her shorter hair (from the first season) but also that dangerous and manipulate personality of her's. As a matter of fact, she is able to twist events, dialogues, and certain circumstances to fit within her liking. This is especially true to Sena, Maria, and most of the other members of the club.\\n\\n\r\nSpeaking of which, Sena retains her personality as well. Although not seen as manipulative or cruel as Yozora, her arrogant attitude makes it difficult for Sena to make true friends. And of course, that's why she's a member of the Neighbor's Club! Nicknamed as “meat” by Yozora, Sena continues to enjoy the habit of playing ero games (sometimes with others). Her rivalry with Yozora still retains its amusement as the duo often battles it out in many outrageous contests that has mixed results. (usually in Yozora's favor) \\n\\n\r\nAmong other members of the club includes the lovely self-proclaimed mad scientist Rika. Her physical appearance takes a delightful change for fans but behind that lab coat is still a girl of the same personality. Rika's love for eroticism and her own perverseness often gets her into many strange circumstances. In fact, her strange personality even becomes an hassle for Yozora to handle at many occasions. Odd one out, she's the most peculiar member of the club.\\n\\n\r\nThen of course, there's Yukimura who acts like a girl, behaves like a girl, and is... a member of the Neighbor's Club who adorably addresses Kodaka as “aniki”. Yukimura plays the role of a very feminine person, one who wishes to bring out the womanly side with the help of the Neighbor's Club. It's quite amusing to watch especially as Yukimura seems to be the most ordinary member of the group as well.\\n\\n\r\nThe remaining two members of the club makes their appearances occasionally but every chance they encounter each other turns into a war of debate and argument. On one side, there's Kobato (Kodaka's younger sister) who often co-splays as a vampire with heterochromia. Then on the other hand, there's Maria who portrays the role of a nun at the very Catholic School the club is founded in. That's about as clear as oil mixed with water. In fact, the duo never seems to get along and gets into countless brawls. Yet at times, they seem to enjoy the fun of the Neighbor's Club because what do you know..they're also there to make some friends. Hopefully.\\n\\n\r\nThe series follows its traditional episodic format. In fact, some of the episodes have two different stories that are divided between each other. Nonetheless, the story maintains its lighthearted atmosphere and what it's like to have fun with the daily activities. Some of the activities in the show is portrayed to bring out comedy and laughter while others seems to bring the club members closer together. Among some of these activities often includes some sort of way a member can manipulate events and strategically allow them to reach certain desired outcomes. Of course though, there are also fun activities the group enjoys altogether and hopefully get some of the same feelings of hanging out with 'friends'.\\n\\n\r\nUnfortunately, the series still suffers various problems. The characters themselves may be seen as fun and interactive to watch but lacks any sort of real development. In fact, there is not much development at all. The continued repetitive gags and rivalry between some of the characters also becomes a bit bothersome to watch. Then, there's that whole debate among fans on which girl is the “best”. Otherwise, the series seems to continue to avoid some serious drama related to events from the past regarding Yozora. In fact, at times, it seems the series just wants to have fun rather than extending the reality of story. Well, the series isn't realistic anyways since the show itself is based on this Neighbor's Club with such events in real life that makes it seem impossible for a group of students to hang around like that. The gap between fiction and reality here is just too large to fill. Among other problems, the series seems to have this unsettling mood involving many of the overused tropes. It takes its main theme of 'making friends' and turns it into a way that lacks real development. At times, the mood of the series becomes serious while other times immediately shifts to its typical mood. Although Kodaka and Rika received decent personalities from this sequel from my point of view, the rest of the cast also seemed a bit off balance.\\n\\n\r\nThe animation retains its original cutting edges and presentation. There's not many change except for a few twists involving the physical appearances of the club members. In fact, one of the club members isn't the gender who you may originally predicted. AIC (Anime International Company) does their job at mediocre for this sequel, the same way they have done for some its other works involving the school life theme.\\n\\n\r\nAs for soundtrack, the series makes it balance with the lighthearted rhythms. Tom-H@ck who demonstrates some of its skills makes the series' music in a way that is fun. Yet at times, the music is almost like a child's play for viewers' ears because of its repetition and stereotypes. The way the OP song plays the lyrics “Be my Friend” is a parody of the club as none of the members seems to be actual friends. Rather, it seems that they are just there to make their miserable lives a little better. However, I will say that it is quite catchy. BE MY FRIEND. Three words that can sum up the major theme of the series.\\n\\n\r\nOverall, this anime is an amusing watch although there are many times when things don't connect together. For now, I'll give the score of a “8”. With the weak plot progress as well as characters' development, this sequel seems to sway away some of the audience. Despite this though, Boku wa Tomodachi ga Sukunai NEXT still has its fun touches. Of course, in real life, having fun with your friends is one of the most enjoyable moments youths will experience. Whether at school or at home, friends are treasures that are valuable. It is this series that gives them a fun meaning and seeing the club members of the Neighbor's Club does that. At many other circumstances, the Neighbor's Club gets into those bitter arguments that makes its member seem more like enemies rather than friends. Well are they actually friends deep down by heart? Hmm, I hope so.\\n",
            "date": "2013-03-28T14:19:00+00:00",
            "helpful_count": 79,
            "mal_id": 91315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=91315"
        },
        {
            "content": "Yes, yes yes you better believe it, almost all the reviewers of this anime give this a 10/10.\r\nJust to give you the reader a hint of how popular this 2nd season of \"Boku\" is...\r\nJust earlier today (at the time of writing), at a certain anime streaming site. In less than 24 hours since the subbed version was uploaded to the site. Episode 11 received more than 100 fan comments on the page, AND almost 200,000 views, all in LESS THAN 24 hours from 1 SINGLE anime streaming site.\r\nThat is simply the most number of views I had ever seen happen on an anime that quickly.For the haters of harem comedy, I really hope they can check this vastly popular anime out.\\n\\n\r\n-----------------------------Story (10/10)---------------------------------\\n\r\n\"Next\" is the 2nd season of the \"Boku wa Tomodachi ga Sukunai\" anime series, not only is it way better than the 1st season, it is the BEST harem anime I have seen to date. Story continues from the first season as Kodaka carries on the day to day adventures with his friends from the neighbour's club in school. However through brillant writing and character development every single day of the neighbour's club is a absolute riot to watch. You'll always be laughing and giggling at the characters conversations, happenings and adventures.\\n\\n\r\n-----------------------------Characters (10/10)---------------------------------\\n\r\nA HUGE charm factor of this anime has to be the female cast, especially in this 2nd season. Not only is there a new addition of a charming sister in Kate. The hairstyle changes to two characters, Yozora and Rika. As well as constant costume changes to Yozora, Rika and Yukimura, bring out so much appeal and \"moe\" to the screen that it is almost impossible not to get dumbstruck each time one of their new \"looks\" debuts on screen.\\n\\n\r\nPart of the charm of the female cast this season also came from the deeper connections that the male lead (Kodaka) develops with the girls. Like in any harem anime, the girls start to discover that they love the main guy character. And since the guy is trying to be oblivious to their feelings, each of the girls try to appeal to him with cuter outfits and more feminine gestures to get his attention. You get shy wayward glances, tsundere type embarassed denials, extended eye contact with puppy eyes, everything that can make a guy gulp and hold his breath in his throat. So much romantic tension builds up throughout this anime that even his own younger sister gets swept up into the flow.\\n\\n\r\n-----------------------------Art (9/10)---------------------------------\\n\r\nPart of the \"moeness\" of this anime comes from the amazing animation work done on the female characters. The new costumes, hairstyle and colours look absolutely stunning on the girls. With the standout example being Rika, changing into yet another breathtaking look almost every episode.\\n\\n\r\n-----------------------------Enjoyment (10/10)------------------------------\\n\r\nWhat are you waiting for? \"Boku wa Tomodachi ga Sukunai NEXT\" is a masterpiece of a harem anime that cannot be missed. Millions of viewers around the internet are waiting eagerly every week to catch the latest subbed version of this anime. Saying this anime is simply popular would be a HUGE UNDERSTATEMENT. I highly doubt there will be many viewers who remain not entertained after watching all 12 episodes of this anime :)",
            "date": "2013-03-22T10:57:00+00:00",
            "helpful_count": 44,
            "mal_id": 90495,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fate25",
                "username": "Fate25"
            },
            "url": "https://myanimelist.net/reviews.php?id=90495"
        },
        {
            "content": "OMG just like the first season i love it. Every-time i watch this show it gets funnier and funnier.\r\nGenres: Comedy, Ecchi, Harem, Romance, school life\r\nStory: the story pretty much takes place right after the first season. \r\nEveryone is in a club called the Neighbor's Club, and its were they try to make new friends and hang out with each other and learn social life skills. Kodaka ( a main character) still goes there to meet his four other club members to start there day and have new adventures everyday. \r\nArt: the animation are really good the characters really look nice with great art work.\r\nSound: theopening and ending song are nice. they did really well on the sound effects.\\n\\n\r\nCharacters: Kodaka Hasegawa, Sena Kashiwazaki, Yozora Mikazuki , who are mostly the main characters with 4 more supporting characters \\n\\n\r\nThis anime is great and funny cant wait to finish it off... for the people who haven't seen it I really recommend this one. Like always if this review help please like and let me know how i can make my reviews better.",
            "date": "2013-02-21T20:16:00+00:00",
            "helpful_count": 37,
            "mal_id": 87511,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1962098.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sora760",
                "username": "Sora760"
            },
            "url": "https://myanimelist.net/reviews.php?id=87511"
        },
        {
            "content": "Be My Friend Shiranai furi shitatte \r\nBe My Side Zenbu kidzui teta yo \r\nHaganai NEXT......Finished, frankly I don't know what to say about this anime's last episode and it was quite a disappointing that it ended in a cliffhanger, ok, so no more beating around the bush, how do I rate this anime, well, here's how:\r\nStory: Good 7.\r\nSince this was the continuation of the previous season, it still follows the same plot but with a couple of revelations along the way. Except of course with the romance genre, things are starting to heat up as the members of the \"Neighbor's Club\" are now competing forthe guy's affection be it directly or indirectly, which btw studio AIC Build has left us wondering as to what happens next, now that 2 new competition has arrive in the anime........ a little bit late that is. \\n\\n\r\nArt: Good 7.\\n\\n\r\nOk, for the most part, there seems to have been some changes with the character's illustrations, ok so Yozura's hair is short given that she had it cut from the previous season. But, the changes I see has something to do with the uniforms, from the previous season the girls wore the a matching green skirt and green blazer, now they don a plait skirt and cardigans , well for the main cast the this. It would have been nice if this anime's illustrator be consistent, since the girls do go to St. Chronica Academy, instead of cardigans, maybe they should've wore the school's standard green blazer and it would have been nice for once to see Kobato in her compete middle school uniform, also, I don't dig as to why Yukimura now that she was confirmed to be girl would still be in a boy's uniform. The consolation here is that we get to see Rika in a whole new different  form from a geeky girl to a hot babe and we also get to see Yozura's more hotter in plain clothes, only to change into wearing a track suit. But what make this anime's art good was the seemly part where the female cast are going commando.\\n\\n\r\nOh, I still hate the way how Kodaka was illustrated, pretty obvious that illustrator  Shōichi Taguchi has no idea what a typical western delinquent would look like. Frankly, Kodaka looks more like a dork than a bad boy.\\n\\n\r\nSound: fair 6.\\n\\n\r\nI simply like the opening theme, but for Kate's voice doesn't seem to match her character, since according to info she's 15, but her seiyu sounded like 20, in that case director Toru Kitahata should've cast her as a twenty something adult, instead of a teenager which make it difficult to understand why someone in her age is a nun.\\n\\n\r\nCharacter and enjoyment: Good 7.\\n\\n\r\nThe characters still maintains their usual roles except that we don't get to see anymore of Sena do the usual Parting Shot Fit....you know where she would say \"AHO, AHO, YOZURA, AHO, BAKA , BAKA WAAAAAAAA!!!!!!!!\" and then she dashes out, you have to admit it was very funny, in fact episode 8, I've wish that Yozura would have done the same thing when she dashes out of the room and saying \"AHO, AHO, SENA AHO, BAKA, BAKA, WAAAAAAAA!!!!!!!!.\" Also, it was very funny that Yozura get her share of getting grilled and we see that Sena was getting the upper-hand and that's what makes it enjoyable.\\n\\n\r\nOverall: Fair 6.\\n\\n\r\nThought for the most part, this anime did provide the laughs and the gags, though I would have like to give this anime a 7, was the fact that it has an open ending it left us audience hanged and wondering if there will be another season or does writer Yomi Hirasaka and Misaki Harukawa  wants us to focus on the manga, either way it is up to us audience to wait and see.\\n\\n\\n",
            "date": "2013-04-01T13:24:00+00:00",
            "helpful_count": 32,
            "mal_id": 91969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=91969"
        },
        {
            "content": "Let's make this short. After the first season I thought that it's going in the right direction, but it's not. As to plot, in the first season there was SOME plot and overall end goal, but now it's all gone. It's basically series of random events, themes, cliché stuff based on other chinese cartoons, put together for the sole sake of finding friends. And dude, it's not even funny anymore. Characters are as flat as it's possible just like the plot. As to art and sound they are on a very decent level. To keep this short I'll just add that I don't know howcould I go through 6 eps doing my best no to fast forward them all the time. There are many better shows to watch, but I guess it's watchable if you find yourself having lots of spare time.",
            "date": "2013-02-17T13:55:00+00:00",
            "helpful_count": 22,
            "mal_id": 87063,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/I_Fear_Nades",
                "username": "I_Fear_Nades"
            },
            "url": "https://myanimelist.net/reviews.php?id=87063"
        },
        {
            "content": "Well, this is my first review. So.. uh.. here goes.\r\nI've watched the first season and the second season today. (Well, I became addicted with the series actually.) Haganai NEXT stands as the improvement of the first season, but the ending of the season wasn't really what I had in mind... and pretty much, for those who watched this. \r\nThe storyline was going so well for me, and I hate it when the episodes I watch buffer. However, the thing that stood out was the ending. Like I said, it wasn't the best ending. Abrupt, so I'm expecting a third season right around the corner. Icould've given a 9 to the story, but the ending was a downer. Positively, a harem romantic comedy where the main character is dense. That isn't new in anime. But, he changed at the end. He ain't the Taka everyone once knew, and I liked it. \\n\\n\r\nThe characters were the standouts of the this season. At the first season, I haven't seen the potential of the characters. This season, we see the evolution of the Good Neighbors Club. The bond is stronger, and a harem formed in this season. Last season, it was more of just Sena and Sora. Yukimura, from the maid to being a butler (guess the reference), and Rika finally brings Taka to his senses (no more dense MC). The standouts of this season were Rika and Sena.\\n\\n\r\nI enjoyed the series. I stopped watching the first season because I found another anime that stood out (Nisekoi). After watching, I tried other anime such as Mayo Chiki, The Pet Girl of Sakurasou, and other kinds of Romantic Comedic anime. I watched the first episode of the first season, and after about 10 hours, I finished watching both seasons. I hate it when the video buffers and there were laughs, especially during their amusement park ride. There were happy and sad moments, but it never failed to enjoy me.\\n\\n\r\nOverall, I liked it. Like the first season, the anime had an abrupt ending. Haganai Next is the improvement and evolution of not only the characters but the series as well. Since it ended that way, hopefully, we see the 3rd season. A lot of questions are already on my mind regarding what will happen with the club and I'm looking forward to the day the next season will be released. I hope the anime improves more, and so far, it has been one of the best harem series I've seen. That's a plus.",
            "date": "2015-05-25T05:37:00+00:00",
            "helpful_count": 21,
            "mal_id": 188771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635020.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SeiIsFab",
                "username": "SeiIsFab"
            },
            "url": "https://myanimelist.net/reviews.php?id=188771"
        },
        {
            "content": "Who would of thought making friends is hard? Other than that, there's a club for that! Boku wa Tomodachi ga Sukunai Next also known as Haganai Next is the second season of Haganai. For those who haven't seen Haganai, you should consider it. Haganai is a great rom-com. Haganai focuses more on comedy rather than romance, but the two mix very well. A brief summary for those who wants a recap without spoilers: Kodaka just wanted to make friends during his high school year, but he struggles to make friends in his first few month in school.  What can Kodaka possibly face? There isno problem when there is supposedly one guy and a bunch of girls together in a club right!\\n\\n\r\nAnother great year for The Neighbor's Club! Would Kodaka ever achieve his goal? Forget that, The Neighbor's Club will fix that. The Neighbor's Club started small, but it grew into a big active club. Kodaka is surprisingly popular with the girls! He is the only guy in the club with six other girls. As everybody in the group wants to make friends, the girls started to have feelings for Kodaka. \\n\r\nThe shift from season one to season two made Haganai enjoyable. There are more spotlight of other characters rather than Sena and Yozora. We still have the same comedy, but this time around, there will be more of romance. What I like the most from Haganai is the jokes they use. They may be common, but the staff put the jokes in perfect timing with the scenario. A good example would be... instead of explaining it in words, have a picture: http://imgur.com/a/25P25 . Other than that, I wonder who would win in this harem genre? \\n\\n\r\nThe art style is pretty. I may be biased, but I do love characters that are well drawn with beautiful eyes. Anime has changed throughout the years, and I have to say that I prefer the art style now (modern times). The colors they used is thoughtful too (http://i.imgur.com/0GAJfBH.gif). Each character is unique in terms of art style. You have Kodaka, a dirty blonde hair color. In Japan, a boy with that hair style would be shown as a delinquent. It gives insight rather than having those out of color hairstyles like pink, blue or green (not saying that I hate them, but I do love pink hair). There are also characters that are lolis and moe is definitely included (https://www.youtube.com/watch?v=2fsHFTZLxYM).\\n\\n\r\nThe opening and ending is pretty good. They have a catchy tone to it. The opening is significant because it foreshadows what is going to happen in season two. The ending is what I enjoy the most. I watched it during when the anime was airing, and I just had to watch the ending and then the preview. I just couldn't skip it. The ending is just cute or kawaii in it's own way. Other than the OP/ED, I didn't enjoy the audio too much. The OST isn't amazing. If I were to compare it to Shingeki no Kyojin, their OST is better by far.\\n\\n\r\nThe character are all likeable. People just have strong grounds to have a best girl. My favorite would be Kobato because she is the best. There is no need trying to argue over me. Just kidding; everybody have their own personal preferences. The character development from season one to season two got better. It shows more of who the character is and their objective in the anime. There are also gags in the anime which is pretty good considering that Yozora and Sena are rivals. Sena has the attitude of being the best, but Yozora tries to confront that attitude. Other than the main characters, the other club members are Rika, Maria, Kobato and Yukimura. Kobato and Maria are the lolis of the show. Rika is the mad scientist and Yukimura is the loyal servant. Rika wants to make friends at the club, while Yukimura wants to fulfill the samurai's code.\\n\\n\r\nTo end this review, I have enjoyed the anime and believe other people should watch Haganai. There are many other great rom-com, but Haganai is somewhere in the top 50. The enjoyment throughout this anime is pretty good. I watched it straight away once it got subbed. The jokes that were used were clever. I would recommend watching Yahari Ore no Seishun Love Come wa Machigatteiru (or known as OreGairu) and Ore no Kanojo to Osananajimi ga Shuraba Sugiru (or known as Oreshura). These anime are all similar as having a guy in a club full of girls. Other than that, there are clever jokes in each anime. All of them also have a romance feel to it. See you next time!~\\n\\n\r\nRandom bonus: http://i.imgur.com/CGBYLgT.jpg . \\n\\n\\n\\n",
            "date": "2013-06-20T08:48:00+00:00",
            "helpful_count": 18,
            "mal_id": 101699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191107.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chocosword",
                "username": "Chocosword"
            },
            "url": "https://myanimelist.net/reviews.php?id=101699"
        },
        {
            "content": "It's difficult to rate this, because I lost interest in this anime years ago, and just now finally swung around to finish the last several episodes.  I think that, in and of itself, speaks volumes about the problem with Haganai NEXT and it's final episodes.  I'm not exactly sure why they decided to completely change the format they had going from the first season and first half of NEXT, but it was a big mistake.  \r\nHaganai, at its best, was wildly hilarious.  It managed to blend the typical harem anime with some really solid humor, with a slight touch of raunchinessto it.  The characters were also very likable, outside of Yozora.  I didn't hate Yozora, but I didn't like her all that much, either.  Everyone else, however, I really enjoyed.  Even the straight man MC Kodaka, which is rarely the case.  \\n\\n\r\nBut, for some reason, they sucked almost all of the humor out of the anime in the second half.  Haganai NEXT suddenly tries to get serious in the second half, and it completely fails for a multitude of reasons.  The biggest of which is the paradigm shift the characters suffer.  Yozora goes from being Tsundere to just being a total jerk.  Rika shifts from being an irredeemable pervert to some kind of a emotionally wise sage.  Sena bizarrely goes from being a spoiled goof ball who is the butt of the jokes, to pretty much just staying glued to her games, until it's time for the finale.  The others, including my two favorite girls, Maria and Yukimura both see their lines dramatically reduced.  \\n\\n\r\nBut, worst of all, was the finale.  It's bad and unsatisfying. The entire build up to the finale was weak. What should have been the most intriguing episodes turned out to be the most droll and meandering storyline wise. \\n\\n\r\nOverall, I feel like I could've just dropped this anime instead of keeping it around to watch later for the last 4 years.  It's a truly disappointing ending to what was a hilarious anime series.  \\n\\n\r\nStory: 5\\n\r\nArt: 8\\n\r\nSound: 6\\n\r\nCharacter: 8\\n\r\nEnjoyment: 6\\n\r\nOverall: 5\\n",
            "date": "2017-12-04T06:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 264503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=264503"
        },
        {
            "content": "Boku Wa Tomodachi Ga Sukanai. Yes he didnt have any friends at first, but now i dont know if i can call this as friends or in harem mode, but he is oblivious to relationship anyways. Will make my review short.\r\nStory 7/10: It's funny as usual, far better than season 1. Swear words are back, some indecent scenes are shown, wow. But what brings me down is the last episode, what a cliffhanger ending.\r\nArt 8/10: I say it's acceptable to the viewers.\r\nSound 8/10 : What? I just like the OP. It's so catchy though everyone might not agree on this. OP song composed by Tom-H@ckwho also composed on K-on!\\n\\n\r\nCharacter 7/10: If you watch this series, you will know how they behave.\\n\\n\r\nEnjoyment 10/10 : Watch after you watch some sad,feels anime series, this will brighten your mood fast like me. Well maybe recommended to those who already watch season 1.\\n\\n\r\nRecommended: Those who love fanservices and bigboobs and harem ;)\\n\r\nNot Recommended: Opposite as what i stated above\\n\\n\r\nOverall: 8/10",
            "date": "2015-05-02T01:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 186945,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=186945"
        },
        {
            "content": "How to write this as spoiler free as possible. If you haven't seen season 1 yet, don't read this, will probably spoil alot of season 1. \r\nWhat Boku wa Tomodachi ga Sukunai Next does, is really just speed up the tempo of the series. It's in depth a harem series, but it's also depicting the more sad part about the harem series genre. The fact how the boy in the series, is eventually burdened with being forced to break up his group of friends, to make a choice. Who do he choose? \r\nDo he choose the totally beatiful Kashiwazaki Sena, who brings his family greaterrespect, who has been a friend even from a very young age. With her strange interesting hobby's, and her skill of using her powerful family name to break enemies. \\n\\n\r\nDo he choose his best known childhood friend Mikazuki Yozora, who he has had hard time adapting to as a potential love interest, but still give him some moments where he truly see's her beauty. \\n\\n\r\nDo he choose Higuma Rika, the nutty professor, with all her charming quirks and obsession with boy's love. Cause hello, who doesn't think she is perverted in such a way, that you just can't laugh. \\n\\n\r\nDo he choose Kusunoki Yukimura, the boy, girl, something, that just begs for his recognisition. For him to be her, \"samurai master\" or husband if you prefer. \\n\\n\r\nThis is what makes me love ga Sukunai. It's so hard to tell who to choose, and that makes it exciting all the way until the end. \\n\\n\r\nIn general not a must watch per se, but if you want a harem anime. Then it's a must watch. \\n\\n\r\nThanks for reading my short synopsis.",
            "date": "2013-03-22T04:30:00+00:00",
            "helpful_count": 12,
            "mal_id": 90467,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2228403.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ranthir",
                "username": "Ranthir"
            },
            "url": "https://myanimelist.net/reviews.php?id=90467"
        },
        {
            "content": "I really enjoyed this sequel but just know that it has a somewhat ridiculous ending.  My Girl Friend and myself watched both the first and second season of this show and we loved it.  I am a much more serious business man, and she a nurse.  Her favorite thing in life is a good laugh, which can stop so many fights.  Sadly I have never been one for humor, I take everything and break it down logically.  Even with that when we watched this together I was on the ground laughing.  If you or your significant other are biginto humor and you want a cute date night anime this serious is amazing.  My only real complaint is the ending.  It does end in a cliff hanger, and like so many other anime that end in cliff hangers I had to start suffering a couple episodes before the end because I started to tally up all the things they needed to wrap up and realized their was not enough time.  Not only do they not wrap up those things but throw a lot more questions on top as they end.  A pretty big one 15 seconds before the end too.  But I would still give it a 9/10 because of how damn funny watching these was, even to the end it still had some funny parts when it got serious.",
            "date": "2015-03-13T20:12:00+00:00",
            "helpful_count": 12,
            "mal_id": 182297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Harizak",
                "username": "Harizak"
            },
            "url": "https://myanimelist.net/reviews.php?id=182297"
        },
        {
            "content": "So let me start off by saying that I really enjoyed the first season of Boku wa Tomodachi ga Sukunai and came to this season with roughly the same expectations. I'm sad to say it but this second season was a real disappointment. For those that have already watched the first season already and are continuing to the second, I won't tell you not to watch it, just remember to keep your expectations low.\r\nStory (5/10)\r\nWell the story was never really a main point for the series anyways. The goal of the club was to make friends yet it's obvious that they aren't even trying toaccomplish that. What usually happens in every episode is they'll \"try out things that popular people would do\" as practice for real life situations. While I was never really interested in the story, I'm glad that this season still retains its bits of comedy which really sold the first season for me. One of the annoying points of the story was the fact everyone in the club refused to acknowledge each other as friends. Kodaka repeatedly brings up the fact he \"has no friends\" throughout the series. Seriously? After all you've been through in the club, you don't consider them your friends? \\n\\n\r\nArt (8/10)\\n\\n\r\nNothing to complain about from me here. The art is still of the same quality as last season. \\n\\n\r\nSound (8/10)\\n\\n\r\nSo I really liked the opening and ending songs enough that I listened to them most of the time and wouldn't skip them, which is what I usually do when I watch anime. Not sure why I liked them so much, but they're really catchy and upbeat. It feels like they compliment with the feelings the show brings out. \\n\\n\r\nCharacters (5/10)\\n\\n\r\nThis is where a lot of my problems lie so I'll start off with the positive points first. The three new characters introduced didn't get much time in the series but I thought they were all likeable. Kate plays the part of Maria's overly protective and siscon older sister. Aoi is Sena's class rival who always comes 2nd to her in exams and she is extremely jealous of Sena but Sena never notices her. Hinata is the kindhearted and popular class president who Yozura despises for being the epitome of a popular person. Yukimura is still Yukimura, as devoted and likeable as ever. As usual Maria and Kobato fight with each other like little kids which can get kind of annoying at times, but towards the end of the series you can see that they really like each other. \\n\\n\r\nThere were quite a few negative points to the characters as well. Rika constantly making passes at Kodaka and getting rejected gets pretty overdone and bland as the series goes on. Sena and Yozura's fighting continues throughout the entire season and every time they fight one of them ends up almost crying. I can kind of tell that Sena doesn't really hate Yozura all that much but Yozura seems like she's driven out of pure malice. Kodaka continues to blatantly ignore anyone in the club that tries to ask him out because he doesn't want things to get awkward in the club. While I can sympathize for him, I feel he should just flat out tell them his feelings cause ignoring all of them isn't gonna work forever (as you'll see). Overall its obvious that there was hardly any character development and they act the almost the same way to each other as they did in season one. \\n\\n\r\nEnjoyment (5/10)\\n\\n\r\nSo I had a hard time enjoying this season for reasons given above. It feels like in every episode the characters just repeat the same arguments and actions over and over again. While there were bits of comedy mixed in that added some enjoyment to the show it couldn't make up for how annoying the story and character interactions were. If I hadn't watched the first season of Boku wa Tomodachi ga Sukunai then I certainly wouldn't have had it in me to finish this season since it was so painful to watch. \\n\\n\r\nOverall (6/10)\\n\\n\r\nSo I'm not happy about it but I'd have to give this season a 6. The story picked up straight from season one but it just wasn't able to give me the same level of enjoyment that I experienced from its first season. The character interactions got to be really annoying to the point I want to scream at them to just shut up and get along with each other. While the Art and Sound were of the same quality as the last season, the Story and Characters just fell flat and left me seriously disappointed. If you've already watched the first season I feel you should know what you're getting into and buckle up because its gonna be a bumpy ride. \\n\\n\\n\\n",
            "date": "2013-07-25T12:09:00+00:00",
            "helpful_count": 12,
            "mal_id": 106761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2921143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mooneeve",
                "username": "mooneeve"
            },
            "url": "https://myanimelist.net/reviews.php?id=106761"
        },
        {
            "content": "Personally I think this anime took a turn in the right direction. It went from this hilarious \"romantic\" comedy that was pretty ridiculous in the first season, to a real romantic comedy that toned down some of the ridiculousness in favor of plot and character development. It still has the same comedy and all of the same assets as the first season, but with more seriousness and just overall progress. Which I Love.....except for that ending.\r\nStory- The story is alot better in the second season than the first season, because it actually has a \"story\". In the first season it feel too episodic, meaning thatit didn't feel like it had a direction or set path, almost like the episodes could be viewed in any random order and you wouldn't notice it. However the second season is nothing like that. I really like this change of pace, because the characters seem alot more dynamic and less linear, and there is actual progression between all of the characters. It feels like it has alot more romance in it and just feels alot more thought was put into it than the first season. My one and pretty much only gripe about the second season is the ending it has. It had everything going in it's favor and then that massive disappointment of an ending. The third season is definitely where everything will really go down, and you get a peak of that, but it feels way too much like a cliffhanger. If I had to compare the ending to another ending I would compare it to rosario+vampire, which is now in second place for worst cliffhanger ever. I really loved the story line and how it was compose, and I love the new direction this anime is taking, but I feel that cliffhanger ending is holding it back from being better. As of now it's a 7/10 as a whole for me, but if a third season does come out (oh please god let one be on the way!) then it will easily go up to an 8/10 or possibly even a 9/10 if it plays it's card right.\\n\\n\r\nArt- The art style is the same as ever. If you liked the art style of the first style then you will love the art style of the second season.\\n\\n\r\nSound- The sound is great in this anime. The opening really fits the overall theme and just syncs with what the anime is all about, as well as the ending theme.\\n\\n\r\nCharacter- The characters were already really good in the first season, but after the end of the second season they are on a whole different level. The characters really do change alot during this season and really seem to grow for the better, except maybe one person which is left unclear whether or not it was bad or good what she done. By the end of the third season the characters will be the same, and yet drastically different in key areas.\\n\\n\r\nEnjoyment- To be honest I wasn't expecting much out of this anime when I first started watching it. I was expecting it to be in the same format as the first season with no real progression and just more hijinks, but I was presently surprised with how it started going and was hoping for it to end good, and that wish was half granted. It's still as funny as ever, but it seems to have more direction and character development now, and seems to be taking itself more seriously. With alot of anime i've watched that where in the same category as this, they always seemed to get worse in the second season and the overall quality of the anime would lessen, but not with Boku wa Tomodachi ga Sukunai. It seems like they wanted to be taken more seriously, but stay the same somehow, and they definitely accomplished that. It was extremely enjoyable for me and I am eagerly awaiting the third season to come out. I haven't been this hyped for another season of an anime in, well forever.\\n\\n\r\nOverall-Overall the second season was a huge surprise to me, in a good way. I'm so glad it decided to take the direction and tone it took now, personally I think it's for the best. I'm having high hopes for the third season which is where I think all the really important stuff is going to happen. It was a really fun ride with a rather abrupt stop that I think wasn't executed all that well, if it wasn't for that sour and distasteful ending it would have easily been ranked an 8, but it just left a sour taste in my mouth. If you watched the first season and aren't sure whether you should watch this season then I highly recommend you do. Alot does happen in the second season and the characters change quite a bit, but if you can't handle a major cliffhanger then you might want to wait until the third season comes out and finishes.",
            "date": "2013-04-05T04:27:00+00:00",
            "helpful_count": 11,
            "mal_id": 92477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1057253.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dabagonsmith",
                "username": "dabagonsmith"
            },
            "url": "https://myanimelist.net/reviews.php?id=92477"
        },
        {
            "content": "Since this is my 1st ever review, lets make this short...\r\nSomething made me not to watch this anime up till 8th episodes and I really regret it now... Yep, waiting for another week for this anime is one of the enjoyment because it give me chance to talk about one episode each week with my buddies.\r\nNow then, enough about my regret, here comes the review:\r\nStory : 9/10\r\nWell, read the synopsis... The story worth 9/10.\r\nArt : 9/10\r\nThe art is totally nice. Not perfect, but it does deserve 9/10.\r\nSound : 9/10\r\nThe OP & ED fits the anime perfectly, the background sounds help brings out the comedy, thevoice actors are perfectly fit the characters and there's Hanazawa Kana voicing our cute little Koba-... *ahem*, anyway, 9/10.\\n\\n\r\nCharacter : 10/10\\n\r\nNow, this is not an anime with auto generate usual characters. There's a blonde tsundere!! Totally different from any other tsundere out there, the tsundere here does have tsun-tsun and dere-dere characteristic, but also kinda honest (huh??) and actually not that tsun-tsun (wait, what?). Not to mention her holy big mountains!! Her loli version, a chuunibyou infected middle schooler with twin tails and trying to act like a cool vampire but ended up looks too overwhelmingly cute (well, I'm not a lolicon or something, but this one totally pwned me with her cuteness). A childhood friend. Now, that's a new type of osananajimi...  Evil, bully and dere-dere... ah, and flat. But cute. A gender-unsure-character like, oh well... this will got some Mayo-Chiki references. A mad, I mean a perverted scientist, with cuteness that destroy the density barrier of the main character(especially in this 2nd season). And a loli nun... uhh... you should've already watched the 1st season so this character review mustn't that usefull.\\n\\n\r\nEnjoyment : 10/10\\n\r\nSee you next week??? OF COURSE I WILL!! There's plenty anime like Psycho-Pass, Little Buster, Robotics;Notes, etc that I'll happily wait for a whole week, but this one absolutely on the top lists of mine. The comedy is killing me with laughter and more than that so it really deserve 10/10 for its enjoyment.\\n\\n\r\nOverall, its 9/10\\n\r\nNOW THAT'S MY REVIEW!! If you think this anime is bad, then don't watch. And don't blame anything to me because I give a rating this high... Actually I want to give 10/10, but I though something is missing, so for now 9/10.",
            "date": "2013-03-05T15:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 88803,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2223385.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kueapel",
                "username": "kueapel"
            },
            "url": "https://myanimelist.net/reviews.php?id=88803"
        },
        {
            "content": "Great anime. The characters are pretty defined and they all have their own story and distinct personality. I loved the jokes, the artstyle, the fanservice without it being too much or too obvious, good stuff. \r\nOne thing to get off my chest though, I'm really tired of the whole *girl mumbles something* *guy asks what she said 'what was that? what did you say?'* *girl says 'nothing, never mind!'* bit. Especially in this second season, the girls always say stuff that clearly show their interest in Kodaka, and he NEVER hears their mumbling and they always make up excuses as soon as they realize hedidn't hear them. \\n\\n\r\nIt's fine once or twice, but this happened all the freaking time. As usual, the guy is completely and utterly oblivious to the advances of the girls. I guess the bit before a relationship is always more interesting, and the plot of the show is making friends, but it got a little annoying in the end. \\n\\n\r\nRegardless, this show was hilarious almost all the time, loved it!",
            "date": "2014-08-25T14:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 157903,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3625573.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Alittan",
                "username": "Alittan"
            },
            "url": "https://myanimelist.net/reviews.php?id=157903"
        },
        {
            "content": "This show is a really nice anime to watch when you want something light and relatively cheerful. The characters are built out well, and they each have different personalities. The conflict between Sena and Yozora is well done, and you can clearly see their personality contrasts. In addition to this, it's nice to see how the group bonds over time - despite them not realising it, they are in fact becoming friends and achieving the groups goals.\r\nThere are also good parts of humor, especially in the special at the end of season 1, and scattered throughout the anime. Whilst some of it did fall flat,there was enough of it to give me a chuckle every now and then.\\n\\n\r\nI love the soundtracks of this anime, especially the end one. They are really well done, and if I could listen to them on Spotify, I would. I rarely watch outros and intros, however I found myself listening to the outro on multiple occasions as I liked it so much.\\n\\n\r\nThe second season was certainly my favourite - the character development had been done, and here, it was exploring the characters in a deeper way, as well as improving the bond between Kodaka, Sena and Yozora.\\n\\n\r\nAll in all, a good watch if you want something light and fun, and in the classic 'main character doesn't notice all the adoring girls around him' harem style.\\n\\n\r\nI'm certainly going to pick up the manga, and hope for a third season of the anime.\\n\\n\r\nWould recommend.",
            "date": "2019-03-14T13:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 303516,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7857608.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dipperdolphin",
                "username": "dipperdolphin"
            },
            "url": "https://myanimelist.net/reviews.php?id=303516"
        },
        {
            "content": "Im writing this review because Im disappointed how the whole thing ended. In a nutshell the series is very good, and I mean VERY good. You will basically laugh from start to end mainly because masterly written characters. BUT there are two things I cannot forgive which in the end droped this sezon score down the on the bottom.\r\n***Minor spoilers ahead***\r\nFirst thing is the ending. I mean.. WHAT? So bad and opened ending is not acceptable even if the story still isnt completed (manga is still ongoing). The last episode seems like \"filling\". Yes, there is this awesome fight on the roof with really emotionalconclusion, but otherwise?? EH no good I tell you, no good. It seems like our main character Yozora is no more important, so we can just dump her with no explanation and final headlines. END.\\n\r\nI can thing only of one anime which had worse last episode and it was Mayo Chiki! It is funny that in this anime there is even reference on Mayo, so maybe the author inspired himself and did some crappy ending in the favor of that also unfinished romance.\\n\\n\r\nI mean what is the point of watching this series really? It only drives you mad in the end. You will love the characters, love the setting and suddenly it all ends .. ends.. nothing more.\\n\\n\r\nSecond thing I hated was this indecisiveness of the main protagonist Kodaka. I mean really? He has only TWO phrases to response to a girl who tries to help him or say she has crush on him, and with that I mean: Oh sorry didnt hear ya, the game is too loud. OR even worse He simply runs away. So dissipointed. In the first season was Kodaka so much better of a character, his deliquesnt like approach even if he didnt want it, and now he is crybaby who runs away in the slightest hint of emotions.\\n\r\nI will again use reference to another anime - the only worse protagonist in his stupidity is Raku from Nisekoi.\\n\r\nSo in conclusion, what is the meaning of this I ask?? Why those characters who are so much fun and well writen in casual situations so much suck in the emotional moments which should be main part of this anime. I can thing only of one thing . Author is really bad and dont know how to deal with it. He is not able to write deeper emotional moments but he wants to have it in the show.\\n\\n\r\nWELL, overall score will be 7 because I really laugh my ass out almost during the whole series BUT I cannot go higher due to described reasons.\\n\r\nFor the characters I wanted to give straight ten due to Rikas awesome progress and overall good char settings but Kodaka blew it last few episodes. 8/10.\\n\\n\r\nPS: If the rest of the manga will be converted into anime we will all cry, because the ending and final desicion of main hero (who will be his love??) is mindfuck. It only confirms my statement that the author dont what what he is doing.",
            "date": "2015-01-19T01:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 178475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4229129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/qub4honor",
                "username": "qub4honor"
            },
            "url": "https://myanimelist.net/reviews.php?id=178475"
        }
    ],
    [
        {
            "content": "First of all, I'd like to say that I'll be giving a normal review this time, no more weird ass insights and comments.\r\n  HELL WHO AM I KIDDING, here we go, so Boku wa Tomodachi Ga Sukunai NEXT, or I Don't Have Many Friends. From the name alone you'd think, damn is this some weird ass anime about finding friends? Well, it is, for the most part anyway. For those that haven't read the damn synopsis - lazy bastards, Haganai NEXT is about our good friends from the neighbors club, namely Sena, Yozora, Rika, Yukimura and the only guy - Kodaka, who think theydon't have friends (or so they believe) so they stick together and \"practice\" things that normal buddies would do -they totally have no friends. Now that I've got that out of my way, ONTO THE REVIEW!\\n\\n\r\nStory: 9/10\\n\r\n So like, Kodaka, as you should already know is part of the Neighbors Club, they're always embarking on funny -and sometimes extremely weird adventures with each other. The story itself seems pretty normal, but the way it's shown is NOT, it has enough comedy in it to keep me entertained the whole time, laughing my ass off, yet enough plot to keep me hooked on the damn show - something a lot of animes fail at. Horse Heads, Blonde Wigs, Meat, Bald Wig-thingy, and even a Mayo Chiki! references are all included in this anime, I'd say that with all of these things it really, REALLY deserves a 9/10\\n\\n\r\n  In Short: Great laughs all around but enough plot to keep a viewer hooked.\\n\r\n  \\n\r\nArt: 10/10\\n\r\n What can I say, I loved the first season, and the second season's art is even better. No shit I'd give it a 10, the colors provide for a vivid and enjoyable anime watching experience, they blend well and really show the character's personality off. Just viewing it makes my eyes feel nice, it's eyecandy bro.\\n\\n\r\n  In Short: Shit dude, just read the actual Art rating, it's pretty short - Vivid and Enjoyable.\\n\\n\r\nSound: 9/10\\n\r\n This is probably because I've grown too used to the voice actors, but I'd say they make the characters sound the same as they look. The chatter between characters is a pretty big thing here, and the voices of the characters really play a large role in the comedic scenes, like \"voice imitations\" and sound effects. I don't skip the intro, meaning it's pretty good. I would have given it a 10/10, but I feel that it's lacking something, so for now the best I can do is a 9.\\n\\n\r\n  In Short: The voice actors were chosen well and the sound effects really aid in comedic scenes.\\n\\n\r\nCharacter: 10/10\\n\r\n Now, for me, there are a lot of things that make a comedy better, one would be perverts. They're the butter (bread and butter, it's the butter) of comedy, whether it be Nikaidou Arashi from OniAi, or Kirche from Zero no Tsukaima, they always provide for a lot of laughs, that's where our resident perv-I mean scientist comes in. Boobs, would then be the bread, allowing jokes to be made about how large the characters mea- I mean breasts are, or how small and neglected they look. Obviously, we're missing an integral part of a harem - the childhood friend, but have no fear, because Yozora appears! Yozora, (one of my favorite) the weirdest of the club, is also Kodaka's childhood buddy (Season 1), and also creates most of the jokes/parodies that appear in the anime. Being the only guy, Kodaka would obviously be the center of attention - A.K.A. the harem boy, and as usual he doesn't even notice (lucky asshole). Lastly, what would a comedy be without the\\n\r\n unsure-gender-person Yukimura!, (well it gets solved but whatever). The large amount of  comedic potential in these characters are MASSIVE, and they're, well in my opinion used properly, not just throwing in excess characters that would usually make things funnier, but actually make things worse.\\n\\n\r\n  In Short: All the characters you would expect from a Harem-Comedy anime, the perv, the boobs, the guy, the childhood friend and the gender bender, but used to their maximum potential.\\n\\n\r\nEnjoyment: 10/10\\n\r\n  Friday, friday gotta go home on fridays. Extremely hilarious, amazing characters, there was never any doubt that I would give it a 10 in enjoyment was there, I mean I did mention how funny I found this anime, didn't I? Finishing each new episode leaves me craving for more, what's the new skit? what's happening next?\\n\\n\r\n  In Short: wake me up when the next episode airs\\n\\n\r\nOverall: 10/10\\n\r\n Now, before you go on blabbering about how it doesn't deserve a 10, I'd like to say that THIS IS A REVIEW, by ME, not by YOU, god damn it people. Boku wa Tomodachi Ga Sukunai NEXT, overall is an amazing show, it may have some minor errors here and there, but it's still an enjoyable watch. I recommend you pick this series up and follow it as it goes. cheers",
            "date": "2013-02-13T05:53:00+00:00",
            "helpful_count": 255,
            "mal_id": 86695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1663151.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DammitAgain",
                "username": "DammitAgain"
            },
            "url": "https://myanimelist.net/reviews.php?id=86695"
        },
        {
            "content": "Édit: Honestly I don't like this show that much like I used to, But I leave my thoughts on how I liked it back then. \r\nBoku Wa Tomodachi Ga sukunai NEXT or Haganai Next,  abbreviated, is one of those anticipated sequels almost everyone who saw the last season was waiting. After the amusing and fun time at the Neighbors Club we get a new season full of laughter, emotions, confessions and more. In which really I wasn't expecting to be more developed in that way than last season. which it is one of the main parts that are going to be analyzed here.\r\nSTORY =8\\n\\n\r\nThe story continues were the first season left. A new year at the Neighbor's Club in which we see the 7 members of the club sharing and spending time together trying to make friends. The story in this season is very developed in the way that the characters seem to mature more. At the beginning we encounter the sillyness in which the first season characterized the show, DOING ACTIVITIES AS A GROUP! But as we get going with the show we see that the characters are trying to fullfill the purpose of the club and trying to actually be friends and not just being a group of people in a school room. \\n\\n\r\nThe story, to describe it, is not that epic or amusing. Yet it is very intense with the truths and face to face confrontations in which everyone gets into. Also to add that it is more realistic to demostrate the feelings towards each other. Instead of only making fun of them and doing this great use of innuendo, sexual jokes and harrasment in which  the first season showed A LOT.  Also that the story really progresses and doesn't stay as an episodic anime as it was demostrated last year. It is fun and you can get caught into it. Making it  very easy to absorb.\\n\\n\\n\r\nART = 9\\n\\n\r\nThe art is admirable. The touches of bright colors give great effect in the series' presentation. It gives the impression that is alive and vivid seeming almost real. Specially the touch for the design of the characters, the main parts. For example the eyes of every character specially Sena, Maria, Rika. It feels that they can watch into your soul. Also the hair  color for Kodaka, Kobato and Yozora make the reflection is given to their hair. Plus the color for the characters' skin, cloth and every trait that they have, it is outstanding. But also the important fact of where is taking, the scenario. The scenarios are a real portrait of the real live theme parks, parks, schools and even the room seem to be taking with exact detail to be animated. It is really gorgeous.\\n\\n\\n\r\nSOUND = 5\\n\r\nThe instrumental pieces are not that good for me. Starting with the opening and ending. Both I found them very childish and just really annoying. Making it sound very irritating to the ear. But if we see the series of how it is, they are well incorporated to story that they want to tell. \\n\\n\r\nThe Ost isn't also that outstanding. It is very common for a series and doesn't have any instrumental piece that I could be hearing over and over to remember that it is from Haganai. It is very standard. Maybe the only exception would be the ''YOU GOT MAIL'' Ringtone of Kodaka's phone. But the rest of it is just average.\\n\\n\r\nThe voice acting is incredible. The actors give real life portrait to the characters and match with their personalities very well. Specially Sena and Rika whose voice actresses talk and they bring them to live. The one that I hate is Maria's actress which is very stressful with that pitch voice. \\n\\n\r\nCHARACTER = 9\\n\\n\r\nThis is the part that admire the most of Haganai Next.\\n\r\nThe characters are very well developed in this season. They give them something that was left in the first series and it was character and personality. Because on the first series they were very cliche characters and fight against each other for that reason. But here they have grown up and try to make their desire and club purpose together.\\n\\n\r\nStarting with Kodaka Hasegawa, the  often mistaken delinquent. It is very conservative, serious and easy going. One of the founders of the club. Here, he continues with the same characteristics but he develops himself very well, until the end of the series. Because of this he doesn't confront anyone but for this trait he loses a lot with their mates, because it turns himself into a coward and running away from others. This character I find him just normal and very average, it doesn't add something but with some series like this, there must be a guy.\\n\\n\\n\r\nThen we have Yozora Mikazuki. She has changed in many ways first with their hair and then with the discovery of her childhood friend. She is very aggresive and a tomboy. This character is very complete and she'll give the spectator good reasons to laugh and follow her track. This character I found her very well done characterized  by the producers. Because with the discovery of his friend she tries to keep going althought at the same time being inmature for only that reason. \\n\\n\\n\r\nSena Kashiwazaki has to be my favorite character of the series. She isn't just your typical stereotype of Blond and Giant boobs that almost every anime contains. She is a character with  intelligence, rich and mature girl. She  portraits her desires to be strong and be together with everyone, except Yozora. This character is of my taste because is determinated to accomplish her goals with courage and hard work. In this series we see how her father is very influential in her life and a daddy's girl. But what I love most of her is her ''AHO'' yelling to Yozora in their fight without a doubt. Without both of them the show is nothing.\\n\\n\r\nRika Shiguma. She is one of  the characters that outcast the most. Her development is very rich. Also she doesn't stay as the nerdgeekfreak of sexual thoughts and yaoi mind. She is self-centered in the things that she has to do and also she focus to find friends among herself. She is very distinguished in this series because she changes her clothes and uses a different look in every situation not like most characters in series.\\n\\n\r\nThen our Male/Female character Yukimura. Very Cooperative and Loyal to Kodaka. (I use ''it'' for the review because I know what gender is) It is another character whose real self will be discovered but will keep the same affection to its room mates. It is a flat character with almost the same expression and voice tone to everyone.\\n\\n\\n\r\nAnd finally our two lolis, Maria and Kobato, the fight of good and evil, well not exactly. But those almost make my day with their Heaven vs Demon's Brawl and fight for whose belief is better. They are very entertaining and sometimse they demostrate their cuteness. ~ku ku ku~\\n\\n\\n\r\nENJOYMENT = 8\\n\\n\r\nHaganai Next is very entertaining against its prequel. It simply grows up as a show. Taking away the overuse fan service that almost make me puke and don't watch this one. But here I enjoyed it because I laugh with cute sillyness and not dirty mind and double sense jokes like its predecessor. \\n\\n\r\nThe confrontations of the characters give  good drama going. Plus reveals and puts us on the characters shoes and we feel their empathy. \\n\\n\r\nAlso with the inclusion of the characters such as Kate and Aoi give a nice touch to the series.\\n\\n\r\nThe only bad parts that I found are the characters' past not yet shown. Just Yozora-Kodaka childhood but others not. Like why Yukimura is like that? or what did Yozora did after she left in her childhood? Those answers that are unknown. The other one the ending of the series is just very abrupt the ending for the way it is. But I hope and pray for a 3rd season to come out to clear this up as soon as possible. This 2 things are what I have problems with, the rest is enjoyable. Although I don't see it that strong to be classified R+.\\n\\n\\n\r\nOVERALL = 8\\n\r\nI recommend it, if you survived the first season as I did. It is funny, dramatic with a good presentation, very well animated with great voice acting, and story. So you will really enjoy it if you are looking for a short show.\\n\\n\\n\r\nThanks a lot for those who have read this review and sorry if I had  grammar issues. English isn't my mother language.\\n\\n\r\nMEAT~MEAT~MEAT.",
            "date": "2013-03-29T11:06:00+00:00",
            "helpful_count": 204,
            "mal_id": 91461,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482029.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KevSan",
                "username": "KevSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=91461"
        },
        {
            "content": "From friendship to romance, things get a little more serious on Haganai NEXT. As the relationship between Kodaka and all other girls reaches another level, new feelings are shown... It's love... But how can Kodaka deal with that? Afterall, he never stood in a situation like this before, where someone actually falls for him... Would he be able to face it and tell what he really thinks about that?\r\nUsual activities from Neighbour's Club still occur and it's main objective didn't change, at least, for Yozora... If it was really accomplished, there would be no reason to keep the club active... None of them wished that,so acting like they haven't made any friends yet seemed the best choice...\\n\\n\r\nBut would this be the only way to end it all? Yozora, Sena and Rika slowly begin to fall in love for Kodaka... Sudenly, it turns out to be a romantic comedy! As a girl and a boy become friends, there is no reason for both to get closer and be more than that. A real couple should care for each other and having a normal relationship is the first step on approaching someone you like... However, other friends may not know how to react or  may have feelings they also wanted to show... Things can get weird and everything can fall apart instantly... Haganai NEXT is deeply related to real life by handling all this frindship X love subject...\\n\\n\r\nThe small group of friends from Neighbour's Club remained untouched, as no new additions were made. Yet, new characters are introduced, despite those only relating with Kodaka. Yozora, Sena, Rika and Yukimura also start to aim on being alone with Kodaka... He pretends not getting what they all really meant... He's affraid of having a deeper relationship with any of them...\\n\\n\r\nEnding was left open, so we can expect a new season coming out soon! Cheerful OP, like the last one, but I liked first season's ED better. All this friendship stuff is complicate... Mixing it with love is way worse... Obviously, it's almost certain that dating someone will hurt another one's feelings... That's what we should watch out for... So let's just have fun, as friends!",
            "date": "2013-10-14T06:08:00+00:00",
            "helpful_count": 91,
            "mal_id": 116809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3119789.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DreamyGhost",
                "username": "DreamyGhost"
            },
            "url": "https://myanimelist.net/reviews.php?id=116809"
        },
        {
            "content": "Ah, another season. It's been over a damn year since the original Boku wa Tomodachi ga Sukunai debuted and seemingly, I almost forgot some of the events and giggles from season 1. Well, I remember some memorable moments but let's cut to the case here. Season 2 of  Boku wa Tomodachi ga Sukunai is here at last. It's time to once again see what the Neighbor's Club like to do during their every day lives.\r\nAnd I know that there are a lot of ways people like to enjoy during their leisure time. Some people likes to watch anime or read manga. Some people likesto discover a new hobby. Some people likes to hang out with friends. Some people likes to go travel. Then, then are some people who lacks friends and wants to make some in order to live out their short and miserable lives It's especially not easy to make friends when the look on your face represents one that looks like a delinquent. It feels like you're the new kid at the block and everyone holds some sort of aversion towards you. Luckily though, there's this club that can remedy your alienation. It's called the Neighbors Club.\\n\\n\r\nYes, it's back! It's season 2 of Boku wa Tomodachi ga Sukunai (also known as Haganai)  This is the direct sequel of the original season that debuted in Fall of 2011. It's been over a year and here it is once again with the Neighbors Club. The series is based on the light novel of the same name written by Yomi Hirasaka. The series details the activities of the Neighbors Club and how they live their every day boring lives. They don't have friends but they do have themselves and each other. With that, let their days of fun begin.\\n\\n\r\nFirst of all, what is the Neighbor's Club?\\n\\n\r\nGenerally, the Neighbor's Club is a group of people founded with the purpose of making friends at St. Chronica's Academy. The academy is located at Catholic School and many of the students there views the main male protagonist as a foreigner, a delinquent, and generally someone who seems to be a troublemaker. Of course, this is a misconception and misjudgement. In fact, Kodaka isn't there to make trouble. He's there to make friends and with the Neighbor's Club, it makes the purpose of just that.\\n\\n\r\nThe series retains its small cast of main characters who are all members of the Neighbor's Club. Besides Kodaka, the main male protagonist of the series, there is Yozora Mikazuki. She is seen as a girl who is egoistic, bitter, and a degenerate who seems to enjoy the idea of bullying. With her cold blooded personality, she lacks friends. It is not until she meets Kodaka and the other members of the Neighbor's Club that she decides to open herself more. Yet of course, she retains not only her shorter hair (from the first season) but also that dangerous and manipulate personality of her's. As a matter of fact, she is able to twist events, dialogues, and certain circumstances to fit within her liking. This is especially true to Sena, Maria, and most of the other members of the club.\\n\\n\r\nSpeaking of which, Sena retains her personality as well. Although not seen as manipulative or cruel as Yozora, her arrogant attitude makes it difficult for Sena to make true friends. And of course, that's why she's a member of the Neighbor's Club! Nicknamed as “meat” by Yozora, Sena continues to enjoy the habit of playing ero games (sometimes with others). Her rivalry with Yozora still retains its amusement as the duo often battles it out in many outrageous contests that has mixed results. (usually in Yozora's favor) \\n\\n\r\nAmong other members of the club includes the lovely self-proclaimed mad scientist Rika. Her physical appearance takes a delightful change for fans but behind that lab coat is still a girl of the same personality. Rika's love for eroticism and her own perverseness often gets her into many strange circumstances. In fact, her strange personality even becomes an hassle for Yozora to handle at many occasions. Odd one out, she's the most peculiar member of the club.\\n\\n\r\nThen of course, there's Yukimura who acts like a girl, behaves like a girl, and is... a member of the Neighbor's Club who adorably addresses Kodaka as “aniki”. Yukimura plays the role of a very feminine person, one who wishes to bring out the womanly side with the help of the Neighbor's Club. It's quite amusing to watch especially as Yukimura seems to be the most ordinary member of the group as well.\\n\\n\r\nThe remaining two members of the club makes their appearances occasionally but every chance they encounter each other turns into a war of debate and argument. On one side, there's Kobato (Kodaka's younger sister) who often co-splays as a vampire with heterochromia. Then on the other hand, there's Maria who portrays the role of a nun at the very Catholic School the club is founded in. That's about as clear as oil mixed with water. In fact, the duo never seems to get along and gets into countless brawls. Yet at times, they seem to enjoy the fun of the Neighbor's Club because what do you know..they're also there to make some friends. Hopefully.\\n\\n\r\nThe series follows its traditional episodic format. In fact, some of the episodes have two different stories that are divided between each other. Nonetheless, the story maintains its lighthearted atmosphere and what it's like to have fun with the daily activities. Some of the activities in the show is portrayed to bring out comedy and laughter while others seems to bring the club members closer together. Among some of these activities often includes some sort of way a member can manipulate events and strategically allow them to reach certain desired outcomes. Of course though, there are also fun activities the group enjoys altogether and hopefully get some of the same feelings of hanging out with 'friends'.\\n\\n\r\nUnfortunately, the series still suffers various problems. The characters themselves may be seen as fun and interactive to watch but lacks any sort of real development. In fact, there is not much development at all. The continued repetitive gags and rivalry between some of the characters also becomes a bit bothersome to watch. Then, there's that whole debate among fans on which girl is the “best”. Otherwise, the series seems to continue to avoid some serious drama related to events from the past regarding Yozora. In fact, at times, it seems the series just wants to have fun rather than extending the reality of story. Well, the series isn't realistic anyways since the show itself is based on this Neighbor's Club with such events in real life that makes it seem impossible for a group of students to hang around like that. The gap between fiction and reality here is just too large to fill. Among other problems, the series seems to have this unsettling mood involving many of the overused tropes. It takes its main theme of 'making friends' and turns it into a way that lacks real development. At times, the mood of the series becomes serious while other times immediately shifts to its typical mood. Although Kodaka and Rika received decent personalities from this sequel from my point of view, the rest of the cast also seemed a bit off balance.\\n\\n\r\nThe animation retains its original cutting edges and presentation. There's not many change except for a few twists involving the physical appearances of the club members. In fact, one of the club members isn't the gender who you may originally predicted. AIC (Anime International Company) does their job at mediocre for this sequel, the same way they have done for some its other works involving the school life theme.\\n\\n\r\nAs for soundtrack, the series makes it balance with the lighthearted rhythms. Tom-H@ck who demonstrates some of its skills makes the series' music in a way that is fun. Yet at times, the music is almost like a child's play for viewers' ears because of its repetition and stereotypes. The way the OP song plays the lyrics “Be my Friend” is a parody of the club as none of the members seems to be actual friends. Rather, it seems that they are just there to make their miserable lives a little better. However, I will say that it is quite catchy. BE MY FRIEND. Three words that can sum up the major theme of the series.\\n\\n\r\nOverall, this anime is an amusing watch although there are many times when things don't connect together. For now, I'll give the score of a “8”. With the weak plot progress as well as characters' development, this sequel seems to sway away some of the audience. Despite this though, Boku wa Tomodachi ga Sukunai NEXT still has its fun touches. Of course, in real life, having fun with your friends is one of the most enjoyable moments youths will experience. Whether at school or at home, friends are treasures that are valuable. It is this series that gives them a fun meaning and seeing the club members of the Neighbor's Club does that. At many other circumstances, the Neighbor's Club gets into those bitter arguments that makes its member seem more like enemies rather than friends. Well are they actually friends deep down by heart? Hmm, I hope so.\\n",
            "date": "2013-03-28T14:19:00+00:00",
            "helpful_count": 79,
            "mal_id": 91315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=91315"
        },
        {
            "content": "Yes, yes yes you better believe it, almost all the reviewers of this anime give this a 10/10.\r\nJust to give you the reader a hint of how popular this 2nd season of \"Boku\" is...\r\nJust earlier today (at the time of writing), at a certain anime streaming site. In less than 24 hours since the subbed version was uploaded to the site. Episode 11 received more than 100 fan comments on the page, AND almost 200,000 views, all in LESS THAN 24 hours from 1 SINGLE anime streaming site.\r\nThat is simply the most number of views I had ever seen happen on an anime that quickly.For the haters of harem comedy, I really hope they can check this vastly popular anime out.\\n\\n\r\n-----------------------------Story (10/10)---------------------------------\\n\r\n\"Next\" is the 2nd season of the \"Boku wa Tomodachi ga Sukunai\" anime series, not only is it way better than the 1st season, it is the BEST harem anime I have seen to date. Story continues from the first season as Kodaka carries on the day to day adventures with his friends from the neighbour's club in school. However through brillant writing and character development every single day of the neighbour's club is a absolute riot to watch. You'll always be laughing and giggling at the characters conversations, happenings and adventures.\\n\\n\r\n-----------------------------Characters (10/10)---------------------------------\\n\r\nA HUGE charm factor of this anime has to be the female cast, especially in this 2nd season. Not only is there a new addition of a charming sister in Kate. The hairstyle changes to two characters, Yozora and Rika. As well as constant costume changes to Yozora, Rika and Yukimura, bring out so much appeal and \"moe\" to the screen that it is almost impossible not to get dumbstruck each time one of their new \"looks\" debuts on screen.\\n\\n\r\nPart of the charm of the female cast this season also came from the deeper connections that the male lead (Kodaka) develops with the girls. Like in any harem anime, the girls start to discover that they love the main guy character. And since the guy is trying to be oblivious to their feelings, each of the girls try to appeal to him with cuter outfits and more feminine gestures to get his attention. You get shy wayward glances, tsundere type embarassed denials, extended eye contact with puppy eyes, everything that can make a guy gulp and hold his breath in his throat. So much romantic tension builds up throughout this anime that even his own younger sister gets swept up into the flow.\\n\\n\r\n-----------------------------Art (9/10)---------------------------------\\n\r\nPart of the \"moeness\" of this anime comes from the amazing animation work done on the female characters. The new costumes, hairstyle and colours look absolutely stunning on the girls. With the standout example being Rika, changing into yet another breathtaking look almost every episode.\\n\\n\r\n-----------------------------Enjoyment (10/10)------------------------------\\n\r\nWhat are you waiting for? \"Boku wa Tomodachi ga Sukunai NEXT\" is a masterpiece of a harem anime that cannot be missed. Millions of viewers around the internet are waiting eagerly every week to catch the latest subbed version of this anime. Saying this anime is simply popular would be a HUGE UNDERSTATEMENT. I highly doubt there will be many viewers who remain not entertained after watching all 12 episodes of this anime :)",
            "date": "2013-03-22T10:57:00+00:00",
            "helpful_count": 44,
            "mal_id": 90495,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Fate25",
                "username": "Fate25"
            },
            "url": "https://myanimelist.net/reviews.php?id=90495"
        },
        {
            "content": "OMG just like the first season i love it. Every-time i watch this show it gets funnier and funnier.\r\nGenres: Comedy, Ecchi, Harem, Romance, school life\r\nStory: the story pretty much takes place right after the first season. \r\nEveryone is in a club called the Neighbor's Club, and its were they try to make new friends and hang out with each other and learn social life skills. Kodaka ( a main character) still goes there to meet his four other club members to start there day and have new adventures everyday. \r\nArt: the animation are really good the characters really look nice with great art work.\r\nSound: theopening and ending song are nice. they did really well on the sound effects.\\n\\n\r\nCharacters: Kodaka Hasegawa, Sena Kashiwazaki, Yozora Mikazuki , who are mostly the main characters with 4 more supporting characters \\n\\n\r\nThis anime is great and funny cant wait to finish it off... for the people who haven't seen it I really recommend this one. Like always if this review help please like and let me know how i can make my reviews better.",
            "date": "2013-02-21T20:16:00+00:00",
            "helpful_count": 37,
            "mal_id": 87511,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1962098.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sora760",
                "username": "Sora760"
            },
            "url": "https://myanimelist.net/reviews.php?id=87511"
        },
        {
            "content": "Be My Friend Shiranai furi shitatte \r\nBe My Side Zenbu kidzui teta yo \r\nHaganai NEXT......Finished, frankly I don't know what to say about this anime's last episode and it was quite a disappointing that it ended in a cliffhanger, ok, so no more beating around the bush, how do I rate this anime, well, here's how:\r\nStory: Good 7.\r\nSince this was the continuation of the previous season, it still follows the same plot but with a couple of revelations along the way. Except of course with the romance genre, things are starting to heat up as the members of the \"Neighbor's Club\" are now competing forthe guy's affection be it directly or indirectly, which btw studio AIC Build has left us wondering as to what happens next, now that 2 new competition has arrive in the anime........ a little bit late that is. \\n\\n\r\nArt: Good 7.\\n\\n\r\nOk, for the most part, there seems to have been some changes with the character's illustrations, ok so Yozura's hair is short given that she had it cut from the previous season. But, the changes I see has something to do with the uniforms, from the previous season the girls wore the a matching green skirt and green blazer, now they don a plait skirt and cardigans , well for the main cast the this. It would have been nice if this anime's illustrator be consistent, since the girls do go to St. Chronica Academy, instead of cardigans, maybe they should've wore the school's standard green blazer and it would have been nice for once to see Kobato in her compete middle school uniform, also, I don't dig as to why Yukimura now that she was confirmed to be girl would still be in a boy's uniform. The consolation here is that we get to see Rika in a whole new different  form from a geeky girl to a hot babe and we also get to see Yozura's more hotter in plain clothes, only to change into wearing a track suit. But what make this anime's art good was the seemly part where the female cast are going commando.\\n\\n\r\nOh, I still hate the way how Kodaka was illustrated, pretty obvious that illustrator  Shōichi Taguchi has no idea what a typical western delinquent would look like. Frankly, Kodaka looks more like a dork than a bad boy.\\n\\n\r\nSound: fair 6.\\n\\n\r\nI simply like the opening theme, but for Kate's voice doesn't seem to match her character, since according to info she's 15, but her seiyu sounded like 20, in that case director Toru Kitahata should've cast her as a twenty something adult, instead of a teenager which make it difficult to understand why someone in her age is a nun.\\n\\n\r\nCharacter and enjoyment: Good 7.\\n\\n\r\nThe characters still maintains their usual roles except that we don't get to see anymore of Sena do the usual Parting Shot Fit....you know where she would say \"AHO, AHO, YOZURA, AHO, BAKA , BAKA WAAAAAAAA!!!!!!!!\" and then she dashes out, you have to admit it was very funny, in fact episode 8, I've wish that Yozura would have done the same thing when she dashes out of the room and saying \"AHO, AHO, SENA AHO, BAKA, BAKA, WAAAAAAAA!!!!!!!!.\" Also, it was very funny that Yozura get her share of getting grilled and we see that Sena was getting the upper-hand and that's what makes it enjoyable.\\n\\n\r\nOverall: Fair 6.\\n\\n\r\nThought for the most part, this anime did provide the laughs and the gags, though I would have like to give this anime a 7, was the fact that it has an open ending it left us audience hanged and wondering if there will be another season or does writer Yomi Hirasaka and Misaki Harukawa  wants us to focus on the manga, either way it is up to us audience to wait and see.\\n\\n\\n",
            "date": "2013-04-01T13:24:00+00:00",
            "helpful_count": 32,
            "mal_id": 91969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=91969"
        },
        {
            "content": "Let's make this short. After the first season I thought that it's going in the right direction, but it's not. As to plot, in the first season there was SOME plot and overall end goal, but now it's all gone. It's basically series of random events, themes, cliché stuff based on other chinese cartoons, put together for the sole sake of finding friends. And dude, it's not even funny anymore. Characters are as flat as it's possible just like the plot. As to art and sound they are on a very decent level. To keep this short I'll just add that I don't know howcould I go through 6 eps doing my best no to fast forward them all the time. There are many better shows to watch, but I guess it's watchable if you find yourself having lots of spare time.",
            "date": "2013-02-17T13:55:00+00:00",
            "helpful_count": 22,
            "mal_id": 87063,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/I_Fear_Nades",
                "username": "I_Fear_Nades"
            },
            "url": "https://myanimelist.net/reviews.php?id=87063"
        },
        {
            "content": "Well, this is my first review. So.. uh.. here goes.\r\nI've watched the first season and the second season today. (Well, I became addicted with the series actually.) Haganai NEXT stands as the improvement of the first season, but the ending of the season wasn't really what I had in mind... and pretty much, for those who watched this. \r\nThe storyline was going so well for me, and I hate it when the episodes I watch buffer. However, the thing that stood out was the ending. Like I said, it wasn't the best ending. Abrupt, so I'm expecting a third season right around the corner. Icould've given a 9 to the story, but the ending was a downer. Positively, a harem romantic comedy where the main character is dense. That isn't new in anime. But, he changed at the end. He ain't the Taka everyone once knew, and I liked it. \\n\\n\r\nThe characters were the standouts of the this season. At the first season, I haven't seen the potential of the characters. This season, we see the evolution of the Good Neighbors Club. The bond is stronger, and a harem formed in this season. Last season, it was more of just Sena and Sora. Yukimura, from the maid to being a butler (guess the reference), and Rika finally brings Taka to his senses (no more dense MC). The standouts of this season were Rika and Sena.\\n\\n\r\nI enjoyed the series. I stopped watching the first season because I found another anime that stood out (Nisekoi). After watching, I tried other anime such as Mayo Chiki, The Pet Girl of Sakurasou, and other kinds of Romantic Comedic anime. I watched the first episode of the first season, and after about 10 hours, I finished watching both seasons. I hate it when the video buffers and there were laughs, especially during their amusement park ride. There were happy and sad moments, but it never failed to enjoy me.\\n\\n\r\nOverall, I liked it. Like the first season, the anime had an abrupt ending. Haganai Next is the improvement and evolution of not only the characters but the series as well. Since it ended that way, hopefully, we see the 3rd season. A lot of questions are already on my mind regarding what will happen with the club and I'm looking forward to the day the next season will be released. I hope the anime improves more, and so far, it has been one of the best harem series I've seen. That's a plus.",
            "date": "2015-05-25T05:37:00+00:00",
            "helpful_count": 21,
            "mal_id": 188771,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635020.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SeiIsFab",
                "username": "SeiIsFab"
            },
            "url": "https://myanimelist.net/reviews.php?id=188771"
        },
        {
            "content": "Who would of thought making friends is hard? Other than that, there's a club for that! Boku wa Tomodachi ga Sukunai Next also known as Haganai Next is the second season of Haganai. For those who haven't seen Haganai, you should consider it. Haganai is a great rom-com. Haganai focuses more on comedy rather than romance, but the two mix very well. A brief summary for those who wants a recap without spoilers: Kodaka just wanted to make friends during his high school year, but he struggles to make friends in his first few month in school.  What can Kodaka possibly face? There isno problem when there is supposedly one guy and a bunch of girls together in a club right!\\n\\n\r\nAnother great year for The Neighbor's Club! Would Kodaka ever achieve his goal? Forget that, The Neighbor's Club will fix that. The Neighbor's Club started small, but it grew into a big active club. Kodaka is surprisingly popular with the girls! He is the only guy in the club with six other girls. As everybody in the group wants to make friends, the girls started to have feelings for Kodaka. \\n\r\nThe shift from season one to season two made Haganai enjoyable. There are more spotlight of other characters rather than Sena and Yozora. We still have the same comedy, but this time around, there will be more of romance. What I like the most from Haganai is the jokes they use. They may be common, but the staff put the jokes in perfect timing with the scenario. A good example would be... instead of explaining it in words, have a picture: http://imgur.com/a/25P25 . Other than that, I wonder who would win in this harem genre? \\n\\n\r\nThe art style is pretty. I may be biased, but I do love characters that are well drawn with beautiful eyes. Anime has changed throughout the years, and I have to say that I prefer the art style now (modern times). The colors they used is thoughtful too (http://i.imgur.com/0GAJfBH.gif). Each character is unique in terms of art style. You have Kodaka, a dirty blonde hair color. In Japan, a boy with that hair style would be shown as a delinquent. It gives insight rather than having those out of color hairstyles like pink, blue or green (not saying that I hate them, but I do love pink hair). There are also characters that are lolis and moe is definitely included (https://www.youtube.com/watch?v=2fsHFTZLxYM).\\n\\n\r\nThe opening and ending is pretty good. They have a catchy tone to it. The opening is significant because it foreshadows what is going to happen in season two. The ending is what I enjoy the most. I watched it during when the anime was airing, and I just had to watch the ending and then the preview. I just couldn't skip it. The ending is just cute or kawaii in it's own way. Other than the OP/ED, I didn't enjoy the audio too much. The OST isn't amazing. If I were to compare it to Shingeki no Kyojin, their OST is better by far.\\n\\n\r\nThe character are all likeable. People just have strong grounds to have a best girl. My favorite would be Kobato because she is the best. There is no need trying to argue over me. Just kidding; everybody have their own personal preferences. The character development from season one to season two got better. It shows more of who the character is and their objective in the anime. There are also gags in the anime which is pretty good considering that Yozora and Sena are rivals. Sena has the attitude of being the best, but Yozora tries to confront that attitude. Other than the main characters, the other club members are Rika, Maria, Kobato and Yukimura. Kobato and Maria are the lolis of the show. Rika is the mad scientist and Yukimura is the loyal servant. Rika wants to make friends at the club, while Yukimura wants to fulfill the samurai's code.\\n\\n\r\nTo end this review, I have enjoyed the anime and believe other people should watch Haganai. There are many other great rom-com, but Haganai is somewhere in the top 50. The enjoyment throughout this anime is pretty good. I watched it straight away once it got subbed. The jokes that were used were clever. I would recommend watching Yahari Ore no Seishun Love Come wa Machigatteiru (or known as OreGairu) and Ore no Kanojo to Osananajimi ga Shuraba Sugiru (or known as Oreshura). These anime are all similar as having a guy in a club full of girls. Other than that, there are clever jokes in each anime. All of them also have a romance feel to it. See you next time!~\\n\\n\r\nRandom bonus: http://i.imgur.com/CGBYLgT.jpg . \\n\\n\\n\\n",
            "date": "2013-06-20T08:48:00+00:00",
            "helpful_count": 18,
            "mal_id": 101699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191107.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chocosword",
                "username": "Chocosword"
            },
            "url": "https://myanimelist.net/reviews.php?id=101699"
        },
        {
            "content": "It's difficult to rate this, because I lost interest in this anime years ago, and just now finally swung around to finish the last several episodes.  I think that, in and of itself, speaks volumes about the problem with Haganai NEXT and it's final episodes.  I'm not exactly sure why they decided to completely change the format they had going from the first season and first half of NEXT, but it was a big mistake.  \r\nHaganai, at its best, was wildly hilarious.  It managed to blend the typical harem anime with some really solid humor, with a slight touch of raunchinessto it.  The characters were also very likable, outside of Yozora.  I didn't hate Yozora, but I didn't like her all that much, either.  Everyone else, however, I really enjoyed.  Even the straight man MC Kodaka, which is rarely the case.  \\n\\n\r\nBut, for some reason, they sucked almost all of the humor out of the anime in the second half.  Haganai NEXT suddenly tries to get serious in the second half, and it completely fails for a multitude of reasons.  The biggest of which is the paradigm shift the characters suffer.  Yozora goes from being Tsundere to just being a total jerk.  Rika shifts from being an irredeemable pervert to some kind of a emotionally wise sage.  Sena bizarrely goes from being a spoiled goof ball who is the butt of the jokes, to pretty much just staying glued to her games, until it's time for the finale.  The others, including my two favorite girls, Maria and Yukimura both see their lines dramatically reduced.  \\n\\n\r\nBut, worst of all, was the finale.  It's bad and unsatisfying. The entire build up to the finale was weak. What should have been the most intriguing episodes turned out to be the most droll and meandering storyline wise. \\n\\n\r\nOverall, I feel like I could've just dropped this anime instead of keeping it around to watch later for the last 4 years.  It's a truly disappointing ending to what was a hilarious anime series.  \\n\\n\r\nStory: 5\\n\r\nArt: 8\\n\r\nSound: 6\\n\r\nCharacter: 8\\n\r\nEnjoyment: 6\\n\r\nOverall: 5\\n",
            "date": "2017-12-04T06:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 264503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=264503"
        },
        {
            "content": "Boku Wa Tomodachi Ga Sukanai. Yes he didnt have any friends at first, but now i dont know if i can call this as friends or in harem mode, but he is oblivious to relationship anyways. Will make my review short.\r\nStory 7/10: It's funny as usual, far better than season 1. Swear words are back, some indecent scenes are shown, wow. But what brings me down is the last episode, what a cliffhanger ending.\r\nArt 8/10: I say it's acceptable to the viewers.\r\nSound 8/10 : What? I just like the OP. It's so catchy though everyone might not agree on this. OP song composed by Tom-H@ckwho also composed on K-on!\\n\\n\r\nCharacter 7/10: If you watch this series, you will know how they behave.\\n\\n\r\nEnjoyment 10/10 : Watch after you watch some sad,feels anime series, this will brighten your mood fast like me. Well maybe recommended to those who already watch season 1.\\n\\n\r\nRecommended: Those who love fanservices and bigboobs and harem ;)\\n\r\nNot Recommended: Opposite as what i stated above\\n\\n\r\nOverall: 8/10",
            "date": "2015-05-02T01:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 186945,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4094591.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/malikkkk27_",
                "username": "malikkkk27_"
            },
            "url": "https://myanimelist.net/reviews.php?id=186945"
        },
        {
            "content": "How to write this as spoiler free as possible. If you haven't seen season 1 yet, don't read this, will probably spoil alot of season 1. \r\nWhat Boku wa Tomodachi ga Sukunai Next does, is really just speed up the tempo of the series. It's in depth a harem series, but it's also depicting the more sad part about the harem series genre. The fact how the boy in the series, is eventually burdened with being forced to break up his group of friends, to make a choice. Who do he choose? \r\nDo he choose the totally beatiful Kashiwazaki Sena, who brings his family greaterrespect, who has been a friend even from a very young age. With her strange interesting hobby's, and her skill of using her powerful family name to break enemies. \\n\\n\r\nDo he choose his best known childhood friend Mikazuki Yozora, who he has had hard time adapting to as a potential love interest, but still give him some moments where he truly see's her beauty. \\n\\n\r\nDo he choose Higuma Rika, the nutty professor, with all her charming quirks and obsession with boy's love. Cause hello, who doesn't think she is perverted in such a way, that you just can't laugh. \\n\\n\r\nDo he choose Kusunoki Yukimura, the boy, girl, something, that just begs for his recognisition. For him to be her, \"samurai master\" or husband if you prefer. \\n\\n\r\nThis is what makes me love ga Sukunai. It's so hard to tell who to choose, and that makes it exciting all the way until the end. \\n\\n\r\nIn general not a must watch per se, but if you want a harem anime. Then it's a must watch. \\n\\n\r\nThanks for reading my short synopsis.",
            "date": "2013-03-22T04:30:00+00:00",
            "helpful_count": 12,
            "mal_id": 90467,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2228403.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ranthir",
                "username": "Ranthir"
            },
            "url": "https://myanimelist.net/reviews.php?id=90467"
        },
        {
            "content": "I really enjoyed this sequel but just know that it has a somewhat ridiculous ending.  My Girl Friend and myself watched both the first and second season of this show and we loved it.  I am a much more serious business man, and she a nurse.  Her favorite thing in life is a good laugh, which can stop so many fights.  Sadly I have never been one for humor, I take everything and break it down logically.  Even with that when we watched this together I was on the ground laughing.  If you or your significant other are biginto humor and you want a cute date night anime this serious is amazing.  My only real complaint is the ending.  It does end in a cliff hanger, and like so many other anime that end in cliff hangers I had to start suffering a couple episodes before the end because I started to tally up all the things they needed to wrap up and realized their was not enough time.  Not only do they not wrap up those things but throw a lot more questions on top as they end.  A pretty big one 15 seconds before the end too.  But I would still give it a 9/10 because of how damn funny watching these was, even to the end it still had some funny parts when it got serious.",
            "date": "2015-03-13T20:12:00+00:00",
            "helpful_count": 12,
            "mal_id": 182297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Harizak",
                "username": "Harizak"
            },
            "url": "https://myanimelist.net/reviews.php?id=182297"
        },
        {
            "content": "So let me start off by saying that I really enjoyed the first season of Boku wa Tomodachi ga Sukunai and came to this season with roughly the same expectations. I'm sad to say it but this second season was a real disappointment. For those that have already watched the first season already and are continuing to the second, I won't tell you not to watch it, just remember to keep your expectations low.\r\nStory (5/10)\r\nWell the story was never really a main point for the series anyways. The goal of the club was to make friends yet it's obvious that they aren't even trying toaccomplish that. What usually happens in every episode is they'll \"try out things that popular people would do\" as practice for real life situations. While I was never really interested in the story, I'm glad that this season still retains its bits of comedy which really sold the first season for me. One of the annoying points of the story was the fact everyone in the club refused to acknowledge each other as friends. Kodaka repeatedly brings up the fact he \"has no friends\" throughout the series. Seriously? After all you've been through in the club, you don't consider them your friends? \\n\\n\r\nArt (8/10)\\n\\n\r\nNothing to complain about from me here. The art is still of the same quality as last season. \\n\\n\r\nSound (8/10)\\n\\n\r\nSo I really liked the opening and ending songs enough that I listened to them most of the time and wouldn't skip them, which is what I usually do when I watch anime. Not sure why I liked them so much, but they're really catchy and upbeat. It feels like they compliment with the feelings the show brings out. \\n\\n\r\nCharacters (5/10)\\n\\n\r\nThis is where a lot of my problems lie so I'll start off with the positive points first. The three new characters introduced didn't get much time in the series but I thought they were all likeable. Kate plays the part of Maria's overly protective and siscon older sister. Aoi is Sena's class rival who always comes 2nd to her in exams and she is extremely jealous of Sena but Sena never notices her. Hinata is the kindhearted and popular class president who Yozura despises for being the epitome of a popular person. Yukimura is still Yukimura, as devoted and likeable as ever. As usual Maria and Kobato fight with each other like little kids which can get kind of annoying at times, but towards the end of the series you can see that they really like each other. \\n\\n\r\nThere were quite a few negative points to the characters as well. Rika constantly making passes at Kodaka and getting rejected gets pretty overdone and bland as the series goes on. Sena and Yozura's fighting continues throughout the entire season and every time they fight one of them ends up almost crying. I can kind of tell that Sena doesn't really hate Yozura all that much but Yozura seems like she's driven out of pure malice. Kodaka continues to blatantly ignore anyone in the club that tries to ask him out because he doesn't want things to get awkward in the club. While I can sympathize for him, I feel he should just flat out tell them his feelings cause ignoring all of them isn't gonna work forever (as you'll see). Overall its obvious that there was hardly any character development and they act the almost the same way to each other as they did in season one. \\n\\n\r\nEnjoyment (5/10)\\n\\n\r\nSo I had a hard time enjoying this season for reasons given above. It feels like in every episode the characters just repeat the same arguments and actions over and over again. While there were bits of comedy mixed in that added some enjoyment to the show it couldn't make up for how annoying the story and character interactions were. If I hadn't watched the first season of Boku wa Tomodachi ga Sukunai then I certainly wouldn't have had it in me to finish this season since it was so painful to watch. \\n\\n\r\nOverall (6/10)\\n\\n\r\nSo I'm not happy about it but I'd have to give this season a 6. The story picked up straight from season one but it just wasn't able to give me the same level of enjoyment that I experienced from its first season. The character interactions got to be really annoying to the point I want to scream at them to just shut up and get along with each other. While the Art and Sound were of the same quality as the last season, the Story and Characters just fell flat and left me seriously disappointed. If you've already watched the first season I feel you should know what you're getting into and buckle up because its gonna be a bumpy ride. \\n\\n\\n\\n",
            "date": "2013-07-25T12:09:00+00:00",
            "helpful_count": 12,
            "mal_id": 106761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2921143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mooneeve",
                "username": "mooneeve"
            },
            "url": "https://myanimelist.net/reviews.php?id=106761"
        },
        {
            "content": "Personally I think this anime took a turn in the right direction. It went from this hilarious \"romantic\" comedy that was pretty ridiculous in the first season, to a real romantic comedy that toned down some of the ridiculousness in favor of plot and character development. It still has the same comedy and all of the same assets as the first season, but with more seriousness and just overall progress. Which I Love.....except for that ending.\r\nStory- The story is alot better in the second season than the first season, because it actually has a \"story\". In the first season it feel too episodic, meaning thatit didn't feel like it had a direction or set path, almost like the episodes could be viewed in any random order and you wouldn't notice it. However the second season is nothing like that. I really like this change of pace, because the characters seem alot more dynamic and less linear, and there is actual progression between all of the characters. It feels like it has alot more romance in it and just feels alot more thought was put into it than the first season. My one and pretty much only gripe about the second season is the ending it has. It had everything going in it's favor and then that massive disappointment of an ending. The third season is definitely where everything will really go down, and you get a peak of that, but it feels way too much like a cliffhanger. If I had to compare the ending to another ending I would compare it to rosario+vampire, which is now in second place for worst cliffhanger ever. I really loved the story line and how it was compose, and I love the new direction this anime is taking, but I feel that cliffhanger ending is holding it back from being better. As of now it's a 7/10 as a whole for me, but if a third season does come out (oh please god let one be on the way!) then it will easily go up to an 8/10 or possibly even a 9/10 if it plays it's card right.\\n\\n\r\nArt- The art style is the same as ever. If you liked the art style of the first style then you will love the art style of the second season.\\n\\n\r\nSound- The sound is great in this anime. The opening really fits the overall theme and just syncs with what the anime is all about, as well as the ending theme.\\n\\n\r\nCharacter- The characters were already really good in the first season, but after the end of the second season they are on a whole different level. The characters really do change alot during this season and really seem to grow for the better, except maybe one person which is left unclear whether or not it was bad or good what she done. By the end of the third season the characters will be the same, and yet drastically different in key areas.\\n\\n\r\nEnjoyment- To be honest I wasn't expecting much out of this anime when I first started watching it. I was expecting it to be in the same format as the first season with no real progression and just more hijinks, but I was presently surprised with how it started going and was hoping for it to end good, and that wish was half granted. It's still as funny as ever, but it seems to have more direction and character development now, and seems to be taking itself more seriously. With alot of anime i've watched that where in the same category as this, they always seemed to get worse in the second season and the overall quality of the anime would lessen, but not with Boku wa Tomodachi ga Sukunai. It seems like they wanted to be taken more seriously, but stay the same somehow, and they definitely accomplished that. It was extremely enjoyable for me and I am eagerly awaiting the third season to come out. I haven't been this hyped for another season of an anime in, well forever.\\n\\n\r\nOverall-Overall the second season was a huge surprise to me, in a good way. I'm so glad it decided to take the direction and tone it took now, personally I think it's for the best. I'm having high hopes for the third season which is where I think all the really important stuff is going to happen. It was a really fun ride with a rather abrupt stop that I think wasn't executed all that well, if it wasn't for that sour and distasteful ending it would have easily been ranked an 8, but it just left a sour taste in my mouth. If you watched the first season and aren't sure whether you should watch this season then I highly recommend you do. Alot does happen in the second season and the characters change quite a bit, but if you can't handle a major cliffhanger then you might want to wait until the third season comes out and finishes.",
            "date": "2013-04-05T04:27:00+00:00",
            "helpful_count": 11,
            "mal_id": 92477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1057253.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dabagonsmith",
                "username": "dabagonsmith"
            },
            "url": "https://myanimelist.net/reviews.php?id=92477"
        },
        {
            "content": "Since this is my 1st ever review, lets make this short...\r\nSomething made me not to watch this anime up till 8th episodes and I really regret it now... Yep, waiting for another week for this anime is one of the enjoyment because it give me chance to talk about one episode each week with my buddies.\r\nNow then, enough about my regret, here comes the review:\r\nStory : 9/10\r\nWell, read the synopsis... The story worth 9/10.\r\nArt : 9/10\r\nThe art is totally nice. Not perfect, but it does deserve 9/10.\r\nSound : 9/10\r\nThe OP & ED fits the anime perfectly, the background sounds help brings out the comedy, thevoice actors are perfectly fit the characters and there's Hanazawa Kana voicing our cute little Koba-... *ahem*, anyway, 9/10.\\n\\n\r\nCharacter : 10/10\\n\r\nNow, this is not an anime with auto generate usual characters. There's a blonde tsundere!! Totally different from any other tsundere out there, the tsundere here does have tsun-tsun and dere-dere characteristic, but also kinda honest (huh??) and actually not that tsun-tsun (wait, what?). Not to mention her holy big mountains!! Her loli version, a chuunibyou infected middle schooler with twin tails and trying to act like a cool vampire but ended up looks too overwhelmingly cute (well, I'm not a lolicon or something, but this one totally pwned me with her cuteness). A childhood friend. Now, that's a new type of osananajimi...  Evil, bully and dere-dere... ah, and flat. But cute. A gender-unsure-character like, oh well... this will got some Mayo-Chiki references. A mad, I mean a perverted scientist, with cuteness that destroy the density barrier of the main character(especially in this 2nd season). And a loli nun... uhh... you should've already watched the 1st season so this character review mustn't that usefull.\\n\\n\r\nEnjoyment : 10/10\\n\r\nSee you next week??? OF COURSE I WILL!! There's plenty anime like Psycho-Pass, Little Buster, Robotics;Notes, etc that I'll happily wait for a whole week, but this one absolutely on the top lists of mine. The comedy is killing me with laughter and more than that so it really deserve 10/10 for its enjoyment.\\n\\n\r\nOverall, its 9/10\\n\r\nNOW THAT'S MY REVIEW!! If you think this anime is bad, then don't watch. And don't blame anything to me because I give a rating this high... Actually I want to give 10/10, but I though something is missing, so for now 9/10.",
            "date": "2013-03-05T15:39:00+00:00",
            "helpful_count": 11,
            "mal_id": 88803,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2223385.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kueapel",
                "username": "kueapel"
            },
            "url": "https://myanimelist.net/reviews.php?id=88803"
        },
        {
            "content": "Great anime. The characters are pretty defined and they all have their own story and distinct personality. I loved the jokes, the artstyle, the fanservice without it being too much or too obvious, good stuff. \r\nOne thing to get off my chest though, I'm really tired of the whole *girl mumbles something* *guy asks what she said 'what was that? what did you say?'* *girl says 'nothing, never mind!'* bit. Especially in this second season, the girls always say stuff that clearly show their interest in Kodaka, and he NEVER hears their mumbling and they always make up excuses as soon as they realize hedidn't hear them. \\n\\n\r\nIt's fine once or twice, but this happened all the freaking time. As usual, the guy is completely and utterly oblivious to the advances of the girls. I guess the bit before a relationship is always more interesting, and the plot of the show is making friends, but it got a little annoying in the end. \\n\\n\r\nRegardless, this show was hilarious almost all the time, loved it!",
            "date": "2014-08-25T14:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 157903,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3625573.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Alittan",
                "username": "Alittan"
            },
            "url": "https://myanimelist.net/reviews.php?id=157903"
        },
        {
            "content": "This show is a really nice anime to watch when you want something light and relatively cheerful. The characters are built out well, and they each have different personalities. The conflict between Sena and Yozora is well done, and you can clearly see their personality contrasts. In addition to this, it's nice to see how the group bonds over time - despite them not realising it, they are in fact becoming friends and achieving the groups goals.\r\nThere are also good parts of humor, especially in the special at the end of season 1, and scattered throughout the anime. Whilst some of it did fall flat,there was enough of it to give me a chuckle every now and then.\\n\\n\r\nI love the soundtracks of this anime, especially the end one. They are really well done, and if I could listen to them on Spotify, I would. I rarely watch outros and intros, however I found myself listening to the outro on multiple occasions as I liked it so much.\\n\\n\r\nThe second season was certainly my favourite - the character development had been done, and here, it was exploring the characters in a deeper way, as well as improving the bond between Kodaka, Sena and Yozora.\\n\\n\r\nAll in all, a good watch if you want something light and fun, and in the classic 'main character doesn't notice all the adoring girls around him' harem style.\\n\\n\r\nI'm certainly going to pick up the manga, and hope for a third season of the anime.\\n\\n\r\nWould recommend.",
            "date": "2019-03-14T13:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 303516,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7857608.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dipperdolphin",
                "username": "dipperdolphin"
            },
            "url": "https://myanimelist.net/reviews.php?id=303516"
        },
        {
            "content": "Im writing this review because Im disappointed how the whole thing ended. In a nutshell the series is very good, and I mean VERY good. You will basically laugh from start to end mainly because masterly written characters. BUT there are two things I cannot forgive which in the end droped this sezon score down the on the bottom.\r\n***Minor spoilers ahead***\r\nFirst thing is the ending. I mean.. WHAT? So bad and opened ending is not acceptable even if the story still isnt completed (manga is still ongoing). The last episode seems like \"filling\". Yes, there is this awesome fight on the roof with really emotionalconclusion, but otherwise?? EH no good I tell you, no good. It seems like our main character Yozora is no more important, so we can just dump her with no explanation and final headlines. END.\\n\r\nI can thing only of one anime which had worse last episode and it was Mayo Chiki! It is funny that in this anime there is even reference on Mayo, so maybe the author inspired himself and did some crappy ending in the favor of that also unfinished romance.\\n\\n\r\nI mean what is the point of watching this series really? It only drives you mad in the end. You will love the characters, love the setting and suddenly it all ends .. ends.. nothing more.\\n\\n\r\nSecond thing I hated was this indecisiveness of the main protagonist Kodaka. I mean really? He has only TWO phrases to response to a girl who tries to help him or say she has crush on him, and with that I mean: Oh sorry didnt hear ya, the game is too loud. OR even worse He simply runs away. So dissipointed. In the first season was Kodaka so much better of a character, his deliquesnt like approach even if he didnt want it, and now he is crybaby who runs away in the slightest hint of emotions.\\n\r\nI will again use reference to another anime - the only worse protagonist in his stupidity is Raku from Nisekoi.\\n\r\nSo in conclusion, what is the meaning of this I ask?? Why those characters who are so much fun and well writen in casual situations so much suck in the emotional moments which should be main part of this anime. I can thing only of one thing . Author is really bad and dont know how to deal with it. He is not able to write deeper emotional moments but he wants to have it in the show.\\n\\n\r\nWELL, overall score will be 7 because I really laugh my ass out almost during the whole series BUT I cannot go higher due to described reasons.\\n\r\nFor the characters I wanted to give straight ten due to Rikas awesome progress and overall good char settings but Kodaka blew it last few episodes. 8/10.\\n\\n\r\nPS: If the rest of the manga will be converted into anime we will all cry, because the ending and final desicion of main hero (who will be his love??) is mindfuck. It only confirms my statement that the author dont what what he is doing.",
            "date": "2015-01-19T01:25:00+00:00",
            "helpful_count": 8,
            "mal_id": 178475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4229129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/qub4honor",
                "username": "qub4honor"
            },
            "url": "https://myanimelist.net/reviews.php?id=178475"
        }
    ],
    [
        {
            "content": "This is easily one of the most frustrating anime's you'll end up watching. For the whole two seasons you'll be groaning in frustration at how obstinate these people are. For the sake of my finger muscles, please take this as  review of season 1 as well as they are extremely similar in nature.\r\nStory - 7 \r\nDon't expect anything in the way of deep insights and profound statements in this. It is brutally honest, in that it does exactly what it says on the tin. It is simply a show about a bunch of misfits who want to make friends. Of course there is theodd twist and turn here and there but nothing that deflects the story too dramatically. \\n\\n\r\nArt - 9\\n\r\nI enjoyed the visuals of this anime. It produced a nice blend of color and clarity. The only problem I had was it made everyone's head look rather fat.\\n\\n\r\nSound - 9 \\n\r\nNot sure whether this ought to come under sound or character but I particularly enjoyed the vocal performances of this anime. Especially Rika and Kobato. I can't comment on the intro and end theme's as I've only recently got into the habit of listening to them and I watched this before then.\\n\\n\r\nCharacters - 9\\n\r\nThe characters of Haganai (short for the full title, if you're wondering), are..... interesting to say the least. They all seem to have some sort of fetish or another. And psychologically they're all a bunch of oddballs as well. Except for the main, who has the misfortune of being ostracized through a combination of really bad luck and a tendency to be misunderstood. It's a strange ensemble but nevertheless they make for an entertaining bunch to watch. One mans pain is another mans pleasure, so they say. Though, thankfully, its not too serious in this.\\n\\n\r\nEnjoyment - 9 \\n\r\nThe enjoyment of this anime is the fact that, being humans, we all probably have some parts of us we are ashamed of. Maybe we are (unintentional) bullies or maybe we have a bit of a superiority complex. Watching this is a nice way to find out which one you are because you'll probably end up relating to the character who is similar to you. Me? Well I ended up relating the one with a fetish for doujinshi featuring robots..... Yeah... oh, wait..... excuse me a sec, my therapist is calling.\\n\\n\r\nOverall - 9 \\n\r\nLike I said, this anime is uber uber frustrating. A lets-make-friends club. Well lock up a bunch of teenagers and a couple of pre-pubescent's, force them into doing activities together..... you can guess the outcome. Asides from the cast simply refusing to state the obvious, the sheer comedic value more than makes up for this animes shortcomings. \\n",
            "date": "2013-06-03T08:02:00+00:00",
            "helpful_count": 8,
            "mal_id": 99647,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2624431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Manganese",
                "username": "Manganese"
            },
            "url": "https://myanimelist.net/reviews.php?id=99647"
        },
        {
            "content": "Story\r\nHaganai NEXT is everything you loved about Haganai…minus everything you loved about Haganai. Rather than focusing on the Neighbor Club doing fun things like the first season did, this twelve episode fiasco decides that the club room is way more fun. So what we get is a slog of an anime with no redeeming qualities aside from the fact it ends.\r\nIf I were to rate the story, I’d give it a nonexistent out of five. The beginning of this season is nothing but episodic garbage where Sena likes Kodaka, Yozora likes Kodaka, Rikka likes Kodaka; so on and so forth. There’s some humor tobe found, especially in the club’s one outing to an amusement park, but what little is there is not enough to sate even the biggest fans thirst. Later on there’s a minor plot about making a film for the cultural festival (a la Haruhi Suzumiya) but that only leads to an anticlimax and then segues to the worst ending I can possibly imagine a harem having.\\n\\n\r\nI’ve bitched about bad harem main characters before. The idea of the character not picking a girl is tied to the whole “fantasy” thing where you as the viewer need to put yourself in his shoes and decide. That’s the essence of many visual novels and I don’t think the folks who make anime understand that story telling in a visual novel works because, in the end, you’ve picked a girl to go with after being ambiguous and deciding for a while. In an anime, you cannot stay at that ambiguous phase. It’s annoying to have a show that boils down to a guy needing to decide on the girl he wants to date and then the show says “Nope”. Then what’s the point? Is the point of having a harem to have a bunch of platonic relationships that go nowhere and mean nothing? As a viewer, it’s boring. I’ve put myself in his shoes and obviously he needs to be dating Sena! I decided that, like, the first episode.\\n\\n\r\nWhat pisses me off even further is that Kodaka is betrothed to Sena. Yeah, they were childhood friends before he met Yozora. And Sena wants to marry him; she’s in love. And what does he do? He fucking runs away! This leads to Rika confronting him on the rooftop of the school in one of the most meta/stupid scenes I’ve ever seen. Rika is controlling metal balls with her mind and telling Kodaka what a pussy he is. It leads to a huge action scene that you’d think would end with Kodaka realizing that, while dating one of them would break up the club dynamic, who gives a shit when you’re hurting more people than you’re helping?\\n\\n\r\nNope, instead we end with Kodaka approaching Sena, possibly to decide to be with her, probably not. It doesn’t matter because we get a stupid goddam interruption by their phones. Did I mention this series likes to end scenes where we could see development by abruptly having a phone ring or a rush of air breeze by?\\n\\n\r\nIn the end, Yozora has run away after Sena’s confession and all I can say is good riddance. With her out of the way, why not FUCKING MARRY SENA?\\n\\n\r\nOr don’t and instead wait for the third season…that never came thank God.\\n\\n\r\nCharacters\\n\\n\r\nOne of my biggest problems with NEXT comes from Kodaka and Rikka, both of whom have obviously changed a little between season one and two. Kodaka is more perverted now, while Rikka is kind of a yandere. It’s a minor thing but very noticeable when you watch both seasons back to back.\\n\\n\r\nIf you want to see more about the characters, read my review of the first season. What they boil down to is Yozora’s a bitch, Sena is awesome, Rika is funny but nuts, Kodaka is a pussy, Maria is an annoying loli, Kobato is just kinda there and Yukimura the he/she maid is actually a she but wants to be a he.\\n\\n\r\nAlso, I want to mention Kate, Maria’s big sister. She’s a nun who drinks a lot of cola and is ridiculously hot…until the first anime fart joke I’ve heard since Naruto. She walks away after ripping ass and says “Oh, that’s a wet one!”.\\n\\n\r\nAnd the Lord said, let your boner recede into you and come out the other side like a tail. And it did.\\n\\n\r\nThere are also a couple new characters in the student council but they make such minor appearances and have so little character I won’t even worry about it.\\n\\n\r\nAnimation\\n\\n\r\nOn top of everything else being a downgrade, the animation has also taken a plunge. It’s not bad at all but the crispness and beauty of season one has given way to cheaper looking animation.\\n\\n\r\nSound\\n\\n\r\nThe opening and ending are pretty average. The English dub continued to be a decent substitution for the Japanese version, though Kodaka’s voice actor annoys me, and not just because of Kodaka. He sounds so dumb and the whole performance is phoned in. At least everyone else seems to be enjoying what little the script has to offer.\\n\\n\r\nEntertainment\\n\\n\r\nIf forcing your way through something is entertaining for you, then go ahead and be my guest. But Haganai NEXT was nothing new or interesting, it was a painful downgrade from the first season. I think the most entertainment I had was watching my friend burst a fucking vein in his forehead at how pissed he was at Kodaka. Though I think I burst one as well.\\n\\n\r\nOverall\\n\\n\r\nIf you watched Haganai and wanted to see the further adventures of the cute cast, then you’re going to be pissed with what is presented here. It’s a downgrade in every department, has no redeeming qualities aside from an occasional laugh, and fails on every front to provide you with a satisfactory romance, nor a satisfactory slice-of-life experience. It’s plainly obvious this was made to cash in on the success of the first season with no care given to anything about it.\\n\\n\r\nIt’s the worst sequel I’ve watched in a long time and one of the most disappointing anime of the past couple years. Do yourself a favor and neglect its existence.",
            "date": "2015-05-22T09:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 188410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188410"
        },
        {
            "content": "Just finished season 2 so I'll review this one.\r\nCompared to the first season there were less jokes. Now besides Yozora and Sena, Rika enters the spotlight to compete for Kodakas affection. It's a full makeover and transformed from a nerdy labcoat scientist to a cute girl and now looks just like the others. It's nice to look at but takes personality out of her.\r\nShe doesn't look special anymore, just another cutie that wouldn't stand out if it were only for the looks.\r\nMaria and Kobata lost a bit of screen time but I'm ok with this as they're only the supporting characters and too young toplay a meaningful role in this love triangle/square or should I even say pentagon. \\n\\n\r\nThe Arguments between Sena and Yozura are not that one sided anymore. It became like a 60-40 or 70-30 ratio in favor of Yozura. Before it was like 99% chance that Sena would be running out crying. It was important for me to point out the change because it really annoyed me in season 1.\\n\\n\r\nIt took aeons until we finally could see more relationship development between Yozora, Sena and Kodaka. Im not sure how I should rate Kodakas passiveness towards relations. Maybe he's so passive for the same reason as Yozora, in order to prevent hurt when the bond is broken, but then he should at least feel something for Yozora but this guy... We ll probably find out in season 3.\\n\\n\r\nFor me it still lacks the depth I wanted to see between those 3. The last episodes also tend to let you root for Sena because she gets all these special relations with Kodaka while Yozora gets left out and Rika isn't even worth mentioning cause she's way out of the competing range.\\n\\n\r\nKodaka \"was no protagonist \" until the very end of season2 but everything revolves around his perspective. Another Yozora point of view episode would\\n\r\nnicely fit in as the first episode of season 3 or a Sena POV for a change.\\n\r\nWe dont really get into her mind and feelings at all.\\n\\n\r\nSpoiler:\\n\\n\r\nAbout Kodaka *inserts You Dense Mother#§% Meme*\\n\r\nThe Creators really let us suffer on their hook. When will this guy finally open himself up. Obviously in season 3. But you can't wait 3 seasons for that. \\n\r\nThere should have been a glimmer of hope to see reactions in either Sena or Yozoras direction. \\n\\n\\n\\n\\n",
            "date": "2016-01-02T19:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 207607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mtvu",
                "username": "mtvu"
            },
            "url": "https://myanimelist.net/reviews.php?id=207607"
        },
        {
            "content": "Boku wa tomodachi ga sukunai NEXT. Well, I have seen both seasons of bokusuku and after finishing this one I would say I liked it a lot better than the first season. In this season I think we get a much better understanding of the characters and what the story is all about. In the first season I feel the story was lost and the \"we have to prepare ourselves for the world of friends\" aspect was just an excuse for the writers to make up situations that added no real value to the show's overall theme. Bokusuku NEXT however was, I'm glad to say,much more focussed on both characters and story. \\n\\n\r\nWhat I keep asking myself as I write this review is -\"what would I want to know if I was considering watching this show\", well I guess I would have liked to know that this anime really explores its characters, showing us their flaws and struggles as the show progresses. That it focusses alot more on young love and a fear of love than the first season did. I also thought that bokusuku NEXT was alot funnier than the original too and I put this down once again to the familiarity we gain with the characters. \\n\\n\r\nLastly I would ask, \"would I recommend this anime?\"\\n\r\nFor slice-of-life lovers I would have to say yes. For comedy lovers, also yes. For people who are just in it for the fan service I would say yes again because it rarely isn't present (also something you may want to keep in mind if you're not comfortable with that stuff), but for any other people, people who like romance or drama or harem, I would say no. This anime, in my opinion isn't really main stream. Its not going to please everybody and not everybody is going to enjoy it. For a final statement I would have to advise that apart from the genres I listed before, comedy, slice-of-life and ecchi, this anime has little else to give.",
            "date": "2013-09-19T08:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 113401,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1910014.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lyon-Lark",
                "username": "Lyon-Lark"
            },
            "url": "https://myanimelist.net/reviews.php?id=113401"
        },
        {
            "content": "Story: For anyone that likes comedy, harem, and some Ecchi type anime then this show offers all that. I loved this anime because every episode was very funny, whether it was from the Ecchi scenes, to the harem, or because one of the characters was just being funny. Aside from that the message sent from this anime was said directly to the main character. I like how the story wasn't the typical \"love drama\" type anime. Sure there were moments where it showed that but for the most part this anime focused on the comedy rather that the love because the ending left a lotto be desired in the love aspect. \\n\\n\r\nArt: Well what's there to not like. The art was very good, the character designs were not plain or overused it was just amazing. Also the hair color for each character looked realistic compared to the other animes where characters have green, blue, purple hair. This one focuses on keeping the art realistic yet enjoyable. I have to say black or brown is not my ideal color for a character's hair color, but in this anime it was very well done since it fit each character's personalities.\\n\\n\r\nSound: The opening as always followed the theme of the story. Not much to say about sound because it was also very well done.\\n\\n\r\nCharacter: I don't mind Yozora's personality, she's just like that it can't be helped. Her actions taken do seem rather impulsive and rash at times, but seeing her personality as reserved I can relate to her. Every character's personalities matched their appearance even if some say they hated it. Sena well we all know how she's like, but honestly she's the reason why this anime has so much comedy. She was the character that brought out the comedy in the anime along with Rika. I think to further strengthen this review a third season would be nice because I would be able to give a more broad analysis about Yozora and Sena seeing as how those two seemed to be the focus in the 2nd season. \\n\\n\r\nEnjoyment: Ecchi, Comedy, Harem, School, this anime provides that. I enjoyed every second of it event despite the content showed. There were no boring episodes but I do have to say the ending was rather weak in my opinion because it looked rushed to me.\\n\\n\r\nOverall: I hope Boku Wa Tomadachi gets a 3rd season because it honestly needs one because of the way it ended. I feel as if Yozora needs some more character development because she was rather cautious or reserved from my point of view. \\n",
            "date": "2013-05-24T12:09:00+00:00",
            "helpful_count": 7,
            "mal_id": 98243,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2084755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SweetKiichigo",
                "username": "SweetKiichigo"
            },
            "url": "https://myanimelist.net/reviews.php?id=98243"
        },
        {
            "content": "So, let's talk about incest.\r\nI'm not from Japan, I'm from a puritanical backwater where everything outside of prayer in a dark room is considered taboo; that said, I honestly can't picture it being commonplace anywhere in the world for adolescent girls to routinely have sexual/romantic crushes on their brothers--not to mention frequently running into their brothers' arms completely naked and sleeping in their beds. I firmly believe anything two consenting adults do together is 100% acceptable under any circumstances, but a teenage boy and his barely-pubescent sister is just fuckin' weird, man. And it's in a *lot* of anime.\r\nAnyway, this show is great. It's oneof the few \"comedies that dive into drama\" I've been able to tolerate. Why? Because all the characters except one are just so good. They're cliche, for sure, but they're all designed well from animation to voice acting. Personalities are strong, and the conflicts between them feel natural and in no way forced. Rich straight-A bimbo with no friends who secretly plays porn games? Sure, why not. The genius inventor who has an exhausting fetish for gay robot manga? I'll buy it. The probably-mentally-ill sister who cosplays as an anime character 24/7 and wants to bang her older brother? Well, maybe not so much, but besides the incest thing she's actually kind of likeable. Even the emo roodgrill is very charming. The harem-that-isn't-really-a-harem is the complete package.\\n\\n\r\nHmm, who does that leave? Oh yeah, the harem owner. (Is that the correct terminology? Harem king? Harem general? Harem president?) I watch dubbed anime because god would curse me to an eternity of hellfire if I kowtowed to filthy infidel languages, so I've definitely encountered bad dubbing before. What really stands out here is that every single character is voiced to perfection *except* the harem guild master. His voice makes me want to scoop out my ear bones with a dead squirrel; his voice makes me want to deafen myself my blasting Tool through a tuba; his voice makes me want to stab my eardrums with a blender. It's so unbearable I almost committed a sin by switching over to the original version. I can't stress enough how fingernails-on-chalkboard his voice is. Even worse, though, is how undeveloped and soulless he is even besides that. For example, at one point he confronts a group of bullies and appears to demonstrate some combat prowess, but this is never mentioned again inside the story. How did he do it? Did his dad teach him? Did he train with someone? Why did that just happen? Is he secretly a libido ninja? What the hell?\\n\\n\r\nBut I can tolerate him because the supporting cast of harem participants (harem club members? harem nymphos? harem princesses?) is just so well done. It should also be noted that this isn't *really* a harem series because there's barely any \"plot\" to be seen, and overall the narrative is about friendship rather than romance/sex. The sole undeniable, objective negative about this series is that it just ends. The final episode clearly sets up a third season that never happened for whatever reason. In a way that's fine because it avoids concluding on a downer, but honestly it just leaves 100% of the plot strings unfinished. What a bummer.\\n\\n\r\nI still highly recommend watching this. Even if you're as drama-phobic as me, the moments here are heartfelt and the comedy is done tastefully.",
            "date": "2019-03-03T21:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 302864,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=302864"
        },
        {
            "content": "Just reviewing the second season in this go, I have to say I still really appreciate the story for Boku wa Tomodachi.   I don't think anyone was trying to change the universe with this tale,  but if they were they fell short leaving a wonderfully simple entertaining story in the aftermath.   I did enjoy this series at the beginning of 2019,  so let it be said at the time it has aged well in its short life.I was also so tickled with one particular scene that it will probably go down in my top 20 greatest moments in anime list, with foreshadowing praise like that, you know it has to be good.   The story is just a trope buffet of outcast hearts learning to find enjoyment in each others company with a fantastic world of supporting  characters helping them grow.   The laughs never stop, and I was left at the finish only wanting more.\\n\\n\r\n             Being a bit older the animation doesn't show its age,  its still clean enough with little to no noise in the coloring as it is still on the \"newer\" side of anime quality.   The audio choice for me on this is gonna be the subbed or raw format,   I sometimes sound like a purist,  but the dub for this show is pretty terrible.   If the dub format is your preference,  don't rob yourself the experience,  and give Tomodachi Next a proper go in the subs.   \\n\\n\r\n         Each one of the characters in Tomodachi Next has unique and comedic quirks to over the top levels.  With that in your face level of identity,  its probably a given you will end up picking your own favorites based on personal preference.  Their massive amounts of afflicted individuality aside,  they still have enough in common with one another to make the show work well,  and have just the right amount of awkward tension for this story to go on without going off the rails.  \\n\\n\\n\r\n                 Is it the greatest anime of all time?   Not even close,  but I surely didn't regret the time invested.  Grizzziff Kingsbeard stands by this squeal season on the viewing battlefield flying a banner that reads [7 /10], indicating safe passage for all anime warriors.",
            "date": "2019-01-03T22:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 297985,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7451027.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Grizzziff",
                "username": "Grizzziff"
            },
            "url": "https://myanimelist.net/reviews.php?id=297985"
        },
        {
            "content": "Haganai NEXT is representative of what a sequel should be. The comedy from last season is still in full force, but the tone of the series starts to become more serious as Kodaka has to deal with his friendships - having to decide if they should remain the way they are, or progress into something further. Kodaka's actions as a protagonist might be seen as cowardly, but the decisions he has to make are certainly realistic. Whilst the first season of Haganai did not have much to tell in terms of story progression, NEXT is adamant about shaking things up. Secrets will be revealed andbombshells will be dropped as Kodaka struggles with his inevitable choices. \\n\\n\r\nThis season's biggest fault is that it does not have a conclusive ending. At all. If you want to know what happens next you'll have to find a translated version of the light novels as not even the manga adaptation has surpassed the anime (yet). If you think the season ends with a girl being chosen, you'd be wrong. The ending unfortunately makes it feel as though the progression of the characters was all for naught, despite a very intense confrontation. \\n\\n\r\nIf you enjoyed the first season and are looking for more, Haganai NEXT hits all bases. If you enjoyed the first season but wanted some more substance, there is plenty of that too. Fanservice is still present unfortunately but after the first season you should hopefully be used to it, even if it does still get in the way of the story.",
            "date": "2017-09-04T00:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 256856,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3310357.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Green_Gecko",
                "username": "Green_Gecko"
            },
            "url": "https://myanimelist.net/reviews.php?id=256856"
        },
        {
            "content": "You see, this second season really disappointed me. \r\nNow, let me explain that I loved the first season. The original material was funny and lighthearted. I enjoyed it very much.\r\nHowever, the second season felt like it was dragged through a bucket of \"dark story writing.\" All of a sudden, the lighthearted atmosphere disappeared and the story got way to serious way to fast. \r\nAs a result, I really struggled to enjoy this second season as much as the first. It was a good attempt, but the ridiculous ending battle just lost all my interest. Why can't they all talk through their problems like they didin the first season. I don't want to see the Neighbor's club fall apart, but if there's a third season, that seems to be the path it will take.",
            "date": "2016-02-28T19:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 211925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4714449.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/eqazec",
                "username": "eqazec"
            },
            "url": "https://myanimelist.net/reviews.php?id=211925"
        },
        {
            "content": "Continuing on from where the first season left, season two continues with the activities of the Neighbors Club. However this season steers away their role within the school and just focuses on the character development and relationships of the clubs members.\r\nThe story at first doesn't seem to have much of a plot line, with episodes you can tell if are fillers or not until later on or they throw in a big scene where even the thickest people cant miss that it's a major story line flag. Regardless of that fact, it can still leave you wonder what the anime is really even about withhow much it doesn't stick to a liner plot line. While this is by all means not a bad thing, it can cause some to dislike it because of this factor.\\n\\n\r\nArt is nothing new. Those fresh to this anime may find its art style displeasing to the eye and somewhat off putting at first but these are quickly disregard if they continue on as its very easy to get used to. With the standard cell shading for main part of the art and animation while using gradients to some objects to add some eye catching effects. Then when setting a scene or environment mood is where this anime shines. Using lighting to its utmost fullest to give major impact scenes, the right feel and flow with the rest of the anime. At the same time when the environment lighting used to make an engulfing scene it's an obvious billboard in the viewers face saying its a key story line point.\\n\\n\r\nA minimal use of music and sounds  some may consider a downfall, however this anime seems to take that fact and make a statement that you don't need music every scene to make a good plot line. The only times it does use music in the scene is, much like the lighting an obvious key point in the story. This being said it wouldn't hurt anything if the anime did have more music in some scenes as there are points where you welcome the opening and endings simply because of their music which is actually well made. The producer of the intro seemed to go a little trigger happy with the sound effects though.\\n\\n\r\nThe one single, biggest and most amazing part of this anime is the character development. The first season was mostly character development and the second season is that ten fold. A few filler pieces near and far apart but almost every little thing adds up and is recalled upon in the end with how a few of the characters react in some situations that's causes the current scenes predicament, what ever it may be. Ever characters gets their fair share in progressing their relationships. Some in was you see a mile away, others take a turn that cause you pause the current episode and have to take a few minute to just realize that just happened.\\n\\n\r\nOne cannot help but love the anime. Its points of humor almost always pull a laugh, some even for a few minutes. It has a way of either making a really good joke and then killing it with blatant insults or a deep emotional scene and then kills it with a ridiculous out of place joke. Even with these points, it still seems to redeem itself in the end with a few pieces towards the end that no one cannot be unhappy with.",
            "date": "2014-04-20T03:23:00+00:00",
            "helpful_count": 6,
            "mal_id": 140599,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=140599"
        },
        {
            "content": "Here we go again with the Neighbour's club!\r\nBoku wa Tomodachi Ga Suknai NEXT immediately picks up the pieces from Season 1 with Yozora's hair cut off and the, \"BIG reveal\" between the protagonist, Kodaka and Yozora, which was the climax from that season. The wacky bunch endure more social events such as organizing a birthday party, watching a yaoi, going to an amusement park, setting up a booth for the school festival, and making a movie to get themselves out there in, \"da outside world.\" \r\nIn comparison to Season 1, which was all fun and games, Season 2, yes, there were some funny moment, thatwere NOT over the top, with some, \"intended fan service,\" but there were also hard moments  that really lets us see the ups and downs of a friendship. I believe that was the true success of this season.\\n\\n\r\nBut can I just say it's a small world eh? In addition to the changes to everyone's relationship as the season progresses, it looks like the 2 frenemies, Sena and Yozora have something in common with Kodaka...*SPOILER*\\n\\n\r\nAnyways, so far in terms of the series, I feel that there is progression, but it's not fully there yet. There are still some unanswered things such as the back story of Yukimura, the so-called boy trapped in a girl's body, who remained static throughout the season and the ending of the Season 2, which left me speechless as I never expected that to happen, but hey, I'm assuming a Season 3, right?\\n\\n\r\nIf you like an anime that is able to grasp both sides of a friendship with some intended fanservice and a lot of cute girls, this is the anime for you. \\n\\n\r\nALL I WANT IS (hoping for) SEASON 3!",
            "date": "2013-04-25T19:19:00+00:00",
            "helpful_count": 6,
            "mal_id": 94923,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dagengarmaster92",
                "username": "dagengarmaster92"
            },
            "url": "https://myanimelist.net/reviews.php?id=94923"
        },
        {
            "content": "In order for a harem rom-com to work, you have to have good characters. In the first season of this show, there wasn't much to like aside from Sena (in my humble opinion). Not only the male lead, but the girls were pretty generic and stereotypical, and the show relied a lot on fanservice. For some reason, I chose to watch this season. I was surprised to see some heavy moments and actual character development, with funny self-aware jokes and wonderful voice acting (kudos to the English dub cast). The story, sound track, and art were pretty weak, but it was an okay show. Eventhough I only give it an overall score of 7, I figured it deserved a review for keeping me watching to the very end when I thought it would let me down.",
            "date": "2018-05-08T21:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 280095,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6656163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheSteelSamurai",
                "username": "TheSteelSamurai"
            },
            "url": "https://myanimelist.net/reviews.php?id=280095"
        },
        {
            "content": "The second season continues the story about a group of misfits who congregate in the Neighbors Club to supposedly learn how to make friends. All the character backgrounds are thoroughly discussed in the first season so the second season is all about exploiting the intriguing character personalities through various situations. From slumber parties to the Kings game, expect some funny interactions at a mildly ecchi level. I found it a pretty good season and, though still feeling like an unfinished work, a worthwhile watch for those still interested after the non-existent conclusion of the first season.\r\nAnimation:\r\nThere have been some superficial changes with the animation stylesince the first season. The overall color scheme is a bit softer/less saturated and drawing lines are thinner. Detail levels are comparable with the first season and overall the series still looks very good and crisp. Characters are all readily identifiable from the first season although Yozora has apparently dyed her hair and Rika ditches her fake eyeglasses and changes her hairstyle daily. A lot of activities take place outside of school and thus there are a lot of outfits/character compared to your typical slice of life school series.\\n\\n\r\nThere is very little action here except for a small scuffle at the climax. There is also less ecchi/nudity than the first season. The majority of the ecchi is just bouncy and through conversations (as well as a few galge scenes). Overall this is relatively \"clean\" compared to true ecchi-based shows. Though to be hones I am quite thankful that they didn't resort to upskirt cameras and accidental gropings.\\n\\n\r\nSound:\\n\r\nEverything sounds appropriately in sync with the original show. I don't particularly like the new OP. The ED is a bit better with a lighter rock and more tangible melody. As with the first season, the BGM is light and fitting.\\n\\n\r\nThe VAs all return from the original season and give likewise great performances. Kanae Itou, Kana Hanazawa, and Marina Inoue all do outstanding in their respective rolls, especially kanahana who usually voices softer roles.\\n\\n\r\nStory:\\n\r\nThis section is going to be fairly subjective for once. If a viewer is looking for progress from the ending of the original haganai, then one can say that the story is practically non-existent; the story is, for the most part, a sequence of half-episode long comic shorts. If a viewer is looking for small but interesting additional character facts and potentially a bit of tension, then the story isn't all that bad at all. I fit a bit more into the latter category as (given the ending of haganai 1) I wasn't expecting any significant progress.\\n\\n\r\nWhat makes this second season enjoyable is the execution of the short segments. One of my favorites would definitely be the theme park scene where everyone taunts the roller coaster in character before being thrown around in absolute terror. The episodes don't really build on each other much until the second half of the show beginning with a preparation for a school fair. This then builds up to an eventual climax where Kodaka is forced to confront the fact that he essentially has established a harem. Though the conclusion is just as unsatisfactory as the first, at least we knew it was coming this time.\\n\\n\r\nCharacter:\\n\r\nThough all characters have been established in the first season, each character is either further developed or given additional background. Throughout the show, all characters remain true to their original characterizations; for example Yozora is still a tomboyish, sadistic schemer and Sena is still the two-faced galge-loving, aloof bijin. Many of the character interactions are very entertaining and the eventual development between Kodaka and the girls is royally overdue.\\n\\n\r\nIf there's any negative, lingering aftertaste with the show, it's definitely with Kodaka and his unusual and (imo) tasteless means of avoiding the situation that he essentially created.\\n\\n\r\nValue:\\n\r\nIf anything, I think Haganai Next takes the best of the original series and amplified the quantity. Though an actual story would be nice, the execution of the existing pieces worked well. An entertaining watch for those who liked the characters in the first season.",
            "date": "2015-11-02T22:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 202548,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202548"
        },
        {
            "content": "This is really one slice of life comedy which I like. The music they play is very funny and enjoyable to watch. I actually liked all the characters because they are very amusing and even though they have few friends, they still managed to understand one another and trust one another. \r\nThe art and animation was very fantastic, not dull or boring but bright and lively. Some more, they also play some video games which I have never seen before. By the way, I used to play computer games but I got bored by it. \r\nI really wished I could rewatch this show in episode2 where the nun meets Kodaka (my favorite character). This is actually the best part. It also reminds me of my school days where I never make any friends but I found friends who are trustworthy and who understand me better. \\n\\n\r\nI believe that I found few people who understand and appreciate me in what I have done. I really hope this review is useful to all people. It is ok if you find that this review does not help at all. But I believe that watching this anime will help to keep depression away and find true friends.\\n\\n\r\nSo overall I give it a perfect score of 10.",
            "date": "2013-05-24T05:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 98221,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=98221"
        },
        {
            "content": "Before you take a look at my review keep in mind that I just recently joined MAL and I'm not a hardcore otaku (I'm not even sure I'm a regular otaku). I'm not gonna right you a novel about why you should watch this so I'm gonna keep it short (at this point it probably isn't going to be short haha), sweet, and chockfull of shit that I loved about this anime.\r\nStory=9\r\nBoy with awkward hair who is a delinquent in everyone's eyes and is the only guy in the Neighbors Club. Lucky ass dude right? We get even deeper into the romcom stories of Senaand Yozora while Rika is just as perverted as ever.\\n\\n\r\nArt=8\\n\r\nWhat can I say? I like the way it's drawn and animated. Although the females all have the same facial qualities cept for their hair (is that a facial quality??)\\n\\n\r\nSound=6\\n\r\nThe opening could be better cause it spoiled 2 episodes for me and the You've Got Mail tone annoyed me.\\n\\n\r\nCharacter=8\\n\r\nEach female character was portrayed pretty damn well. They were all cute in their own ways. Only reason I gave an 8 and not a 9 or 10 was cause of Kodaka. Sometimes he needs to strap on a pair.\\n\\n\r\nEnjoyment=9\\n\r\nWhy? Cause I enjoyed it!!! Watch any episode and it'll take a doctor to get you to stop laughing (maybe I over exaggerated). And there are also those scenes that just punch you right in the feels. Such a good romcom comes once in a while.\\n\\n\r\nOverall=8\\n\r\nIf you're into good...no, awesome romcoms, then this is your type of anime to see but even if it isn't give it a try and I'm positive you'll want more!",
            "date": "2013-06-25T22:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 102457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2752095.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kami_Nii-Sama",
                "username": "Kami_Nii-Sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=102457"
        },
        {
            "content": "When i know there was a second season of this franchise, i actually don't get hyped or excited, i dunno why, so i decided to Watch it after it's finished airing, my plan to watch it at once is destroyed in seconds, when i saw so many Screencaps and stuff at my Facebook newsfeed, so i decided to take a look.\r\nThe Story is just like the first season, just a typical comedy and casual story, but this time, it's get deeper with Flashbacks and shit, and don't forget the Parody, it's making my sides hurt pretty bad\r\nThe Art is good actually, the color is soft,not sharp like the first season, Kodaka's pale yellow hair combined with his brown hair.... it's something actually, but it's fine...\\n\\n\r\nSounds is pretty good, no sweat about it, and now, the ED is using Rijinbu girls voice, the OP song is pretty good.\\n\\n\r\nCharacters is still outstanding, because there's no changing things, except for Rika's Hair and Personality, Rika's is more cracked up in this season....\\n\\n\r\nSo far, i enjoyed this anime...\\n\\n",
            "date": "2013-02-18T06:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 87131,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2186173.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OrangLewat",
                "username": "OrangLewat"
            },
            "url": "https://myanimelist.net/reviews.php?id=87131"
        },
        {
            "content": "I just can't get why people give 10/10s to this anime. I hate it with a passion, for the last 2 episodes ruining the entire flow and just making me mad again (boy I am on a streak with anime that has a shitty ending). Here are my reasons why : \r\nStory 7/10 : If you are reading this review there is probably no point in giving a summary of the story since there is a season 1. The story is good, funny and enjoyable, having little to no bad moments. Now for why I hate the guts out of this anime :\r\n[SPOILERS, YOU HAVEBEEN WARNED] The last episodes ends by Yozora running away, Kodaka \"confessing\" to Sena, right after a shitty pep talk from Rika. I put \"confessing\" because it is interrupted by a phone message, which was complete bullshit and would have been better just straight out confessing. Why is this ending or the last 2 episodes bad? Cause we got a funny Comedy Ecchi anime that turns into failed emotional shit in 2 episodes. This anime would have been perfect if It would have been RomCom all along. SO yes, my reason for giving this anime a bad rating is because of the ending, which was complete crap.\\n\\n\r\nArt 8/10 : Nothing special here. Good art, nothing outstanding.\\n\\n\r\nSound 8/10 : Again, nothing special here. The opening is.. meh. Voice acting is on point .\\n\\n\r\nCharacter 7/10 : This is where the anime lacks for me. Kodaka is one of those \"badass\" MCs, he is basically Ryuuji from Toradora, he has nothing special, and is not relatable. Sena is one of the best characters in the anime, we know what she is supposed to be, and has the same personality all along. Yozora is bad to being hate-able. I never understood if she is supposed to be a Kuudere or a Tomboy with feelings. Rika is one of the weirdest characters again. She gets a giant personality change in the end of the anime where the author decides \"Hey let's make this anime a RomCom\". I could go on, but it's really the same thing for everyone. The only other good character is Kobato, being adorable as hell and a clear \"little sister\" type. The characters are not bad on Toradora level, but still pretty bad.\\n\\n\r\nEnjoyment 5/10 : Because of last 2 episodes.... This mark would have been 9/10 if not for that.\\n\\n\r\nOverall 6/10 : I would not recommend this to anyone. I hated myself for watching is because of the ending. Then again, it is my opinion. There be people giving 10/10 to this.",
            "date": "2015-08-29T00:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 197347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4634819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Piezuri",
                "username": "Piezuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=197347"
        },
        {
            "content": "Good: The characters are really likable. great animation, funny with an interesting story, and I enjoyed emery single episode!\r\nBad: There were a few characters I wish got a little more love/a bit more screen time, and the ending is one those endings. (Not finished)\r\nVerdict: This show is really awesome. It's now one of my favorite anime's...BUT The ending is so AWFUL... They almost ruined 24 episodes worth of content with just the last minute...I can't even explain my anger after finishing the last episode. It made me regret watching the entire show for a minute. I still love the anime and can recommend it. Butagain be warned, because this ending is so awful and after some research I highly doubt the show will get a season 3 and if it does, the manga ending (I've heard) is also really bad. So the only way i'd be interested in a new season, is if there will be a new anime only ending. \\n\\n\r\nThis anime would have been a 10/10 but the ending drops it to an 8.5 rounded up to a 9",
            "date": "2018-01-28T15:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 269946,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6505357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheRealNormie",
                "username": "TheRealNormie"
            },
            "url": "https://myanimelist.net/reviews.php?id=269946"
        },
        {
            "content": "I am not a man with high standards. I am not a high maintanence viewer. I usually watch and that's that. So far I have never seen an anime I outright didn't like, at worst Its jus meh enough and I'll drop it.\r\nWhat. The. Hell. is with this ending?! I know the light novel apparently has a shit ending to according to others, but what the hell?! Like, wouldn't mind it, but I don't necessarily need a season three. But for the love of god this season needs a 13th episode to wrap this shit up a little because this was not okay.\r\nThis was likeending the Lord of the Rings trilogy right after the rings sinks in into the lava; Frodo passing out, fade to black, roll credits. \\n\\n\r\nHonestly, i'm just pissed about this. Not even the rest of the anime, that was all fine, worst thing i could think of was Kodaka just letting Yozora act like such an asshole, like bro, say something about it. It's borderline fullblown abuse. but just that last scene. why? What were you thinking? Were you thinking at all? A damn brick could wrap this up way better.",
            "date": "2017-12-09T17:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 264871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6624678.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/somewaifulaifubs",
                "username": "somewaifulaifubs"
            },
            "url": "https://myanimelist.net/reviews.php?id=264871"
        },
        {
            "content": "While I did not expect anything in particular, my face still fell down, and for this review I''ll be focusing on what's positive and what's negative. this might be personal but this is a review\r\nPositive.\r\n1. of course the art is still good, the sound is decent but the art really caught my eye. of course I like Sena's design, and the same with Yozora, the same goes with the rest.\r\n2. the characters are still likable though they are not really that developed (I guess for me) I still find them entertatining, Rika for example, I like how she has matured from your typical pervert tosomeone who is aware of her surroundings however I like more the fact that she's getting more and more entertaining becuase of her different styles.\\n\\n\r\nThe same goes with the rest of the cast because as expected,  Friendship is the heart of the series.\\n\\n\r\nI also like the love hate relationship of sena and Yozora. and Maria and Kobato's relationship has improved\\n\\n\r\n3. of course despite saying that my face fell I still find it enjoyable, \\n\\n\r\nalas though these are the negatives\\n\r\n1. My biggest Problem in the series is that plot and Romance is getting nowhere and was rushed.\\n\r\nex: Yozora finally has the balls to say that she and kodaka we're childhood friends, the next day.....nothing happens.\\n\r\nthe same goes with Yukimura's gender reveal.\\n\\n\r\n2. A follow up of number 1, the story seems to be SENA-CENTRIC and Yozora in this season was totally BURIED, first let's start with Sena.\\n\r\nher relatioship with kodaka is just...idk out of nowhere, and she won't gain anything, I mean, she's hot she's rich she's smart she's athletic and now she is the main heroine in which I find boring.\\n\r\nTheir relationship seems retarded sorry, I mean from an interesting dynamic they're relationship becomes TOO PREDICTABL, an MC who has the perfect heroine fall head over heels for her for no real reason aside from his personality, on top of that they're engaged woo hoo alright.\\n\\n\r\nnow for Yozora, first of all don't get me wrong I like Sena but she's just in the spotlight for too much, after watching the series I ended up reading the wikia which makes me love and pity her character more, anyways what I don't like though is the fact that she's been pushed aside, all her build ups became pointless, especially when she too fell in love for kodaka for no apparent reason (I guess the childhood encounter counts, but still I think they are more bro's a that time) \\n\\n\r\nOn top of that It's not sour grapes but the fact that Sena has more screentime than Yozora makes me sick.  (CM PUNK !!!!!!)\\n\\n\r\nShe's a potential love interrest with an interesting background and relationship to Kodaka  but she was pushed aside.\\n\\n\r\n3. While the character is enjoyable, I find the humore getting duller and duller as they just copy and paste every jokes and follows the same routine always.\\n\r\n4. Some Characters are pointless, lik Yukimura, I like the girl but take her out of the story and nothing will happen, the same goes to Kate and the Chairman.\\n\\n\r\nDon't take peronal but I think Majority of the fans just liked the show because It has great design and fan serivice characters, fanserivice FYI is not just boobs and stuffs\\n",
            "date": "2017-10-11T04:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 260477,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=260477"
        }
    ],
    [
        {
            "content": "This is my first review and this is probably the second most fitting anime for it (the first being Sakurasou no pet na kanojo).   The reason for this is the ending I both loved and hated.  \r\nCliffhangers are very common in American television shows and they work very \r\nwell because of the fact that in  few short months there will be another season and we will get to see what happens.  They keep us emotionally interested.  However this does not work very well for anime's due to the fact that there are HUGE time gaps between seasons. \r\n WhenI saw episode 11 of this anime I knew it in my heart but I didn't want to accept that there was going to be a cliffhanger to close out the season.  I love where the story was going because we have far too many romantic comedy harem anime's that close with an open ending so you as the fan can choose what happens next.  I love anime's that have the closure where they choose for you because sometimes (at least most of the time) the guy ends up with your 'best girl' and you get to see the happy ending that you envision in the harem comedies that leave it open ended.  \\n\\n\r\nIt is hard not to spoil when the frustration is fresh in my mind but I think that the anime creators made a mistake with how things ended up with this anime.  I believe this simply because of the fact that the delay due to the release of the novels and the production of a third season is too long of a wait to stay invested in the show emotionally.  Despite the fact that I am looking forward to the next season right now, I will lose interest in a couple of months and the new season wont be coming out for another year at least.  \\n\\n\r\nIn conclusion, the story was getting very good near the end and honestly could've closed right then and there and there wouldn't be any need for a third season.  However the cliffhanger on the least episode was a poor choice due to the delay cause by the novel's production speed.  I am looking forward to and will watch the third season when it is released, however I am very frustrated that I have to wait so long.",
            "date": "2015-07-11T12:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 193086,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731177.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheZombieSora",
                "username": "TheZombieSora"
            },
            "url": "https://myanimelist.net/reviews.php?id=193086"
        },
        {
            "content": "Very disappointing, especially when compared to the first season. There is very little character development. Nothing really occurs that changes these characters until the last couple episodes. The characters are so frustrating that it took everything I had to keep from throwing my iPad. \r\nI have not read the light novel, but if this season is even a little bit faithful to the LN, then the writer has some serious problems. From what I gather, the first two seasons cover eight volumes of the book. EIGHT volumes, and the only real character development takes place at the end of season one and the end ofseason two. 25 episodes is too many for your characters to barely change and grow. \\n\\n\r\nAnother problem, in my opinion, is that this show is a harem, yet its pretty clear which girl the creators favor (Sena). It would have had a lot more heart if Kodaka had connected with all of the characters, especially Yozora. The show should be about their relationship, whether or not it becomes romantic or stays platonic. \\n\\n\r\nAnother issue is that the finale really feels like just another episode. I understand that they just adapted what was in the books, but to end it the way they did, which no indication of a future season or at least an OVA to tie things up, is disappointing, and a problem I think a lot of Anime has lately. \\n\\n\r\nThe one good thing I can say is that there doesn't seem to be any unnecessary nudity, especially when it comes to the younger characters like Kobato and Maria. Though I watched Funimation's version, which I believe is based on the already-edited Japanese broadcast. \\n\\n\r\nIf you watched the first season and really enjoyed it, and you have the time, give this a watch. There may not be a lot of plot or character development, and it may feel like a rehash of the first season a lot of the time, but there are still some good laughs. Otherwise, wait until they (hopefully) announce a third season or OVA that brings the series to a satisfying conclusion. Volume nine of the Light Novel is out in Japan, and from what I've heard, there is way more plot and character development in those first few chapters than there is in the rest of the series.",
            "date": "2014-04-23T16:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 141059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3724853.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/smokeyjoey8",
                "username": "smokeyjoey8"
            },
            "url": "https://myanimelist.net/reviews.php?id=141059"
        },
        {
            "content": "Story: So the story begins well where the first season left of with Yozora and Kodaka ended up remembering each other when they met 10 years ago but other than that the club basically goes back to doing with trying to make friends while also doing fun stuff like making a film, going to a school festival also doing a bunch of other stuff like that. \r\nArt: art is really well done here just like the first season so the art is done very well.\r\nSound: the OP i really loved and will download it when i can but the ED eh didn't really care forit honestly otherwise i watched the dub but it was really good.\\n\\n\r\nCharacter:  Kodaka is the main male lead of the anime and well hes a pretty good and chill male lead just trying to make friends again a pretty cool and just overall chill guy. Yozora is one of the female leads and she is well she acts really tough but she also is a pretty good person again though she really can get at a lot of the member's but a good character. Sena is the other female lead and well she really thinks all high and mighty of herself but she kinda is a airhead sometimes but she is a pretty sweet person. Kobato is the sister to Kodaka and well she really likes really bother and also has a persona that she does otherwise pretty odd but good character. Yukimura so it turns out he is well actually a she otherwise again another sweet person overall. Rika is scientist and well she is a really perverted person and really out there with the perv stuff like that but she can be really cool and stuff but a perv at best. Maria is the priest of this anime and well after awhile she gets the affection towards Kodaka like the other girls but she is a complete airhead to a lot of stuff also the fact she falls for stuff so easily otherwise a nice character. (just copying and pasting form my review from the 1st season sense they dont really change well expect for the fact the Yukimaura is a actual girl).\\n\\n\r\nEnjoyment: Things that i liked: i personally LOVED this 2nd season everything about i liked. it had a comedy that was really good maybe even a bit better than the 1st season, the fact that this anime had its moments of real drama in this (personally wont spoil but it will really happen with yozora and sena and the whole club), and also the characters are really good in this season maybe even better in some way. Things that i didn't like: honestly id say the ending the ending left up so much that a third season could happen by just how it ended but still a good anime.\\n\\n\r\nOverall: im giving this a 9 for sure like the comedy was good maybe even better than the 1st season the character do develop more has it goes and the drama in this is a nice touch also not alot of ecchi but yeah the second was everything better than the 1st for sure the comedy was better the characters got better and the good moments of drama were good to easily a anime worth the watch as a whole and a damn good one at that. \\n\\n",
            "date": "2017-08-17T22:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 255710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=255710"
        },
        {
            "content": "At the risk of stating a cliché, I have come to find the second series of any given anime, particularly slice of life, to be remarkably disappointing compared to the first. Often apparently milking the success of the original story's last sour dribbles of entertainment (and monetary) value than anything intentionally planned in to offer necessary closure(s). The trouble with continuing a series of the slice of life variety is often all the most fun and dramatic scenes, such as the introduction of new characters and the development of their interactions and relationships have already been covered sufficiently and what is left is essentially justa continuation of what was generally occurring, rarely with any notable improvement in story telling and frequently stagnant of anything dynamic. So a mark of an engaging story overall, I find, is if the interest can be maintained through suitably decent writing in the latter stages of any given narrative.\\n\\n\r\nFortunately Haganai is able maintain said level of interest by having a decent array of characters, enough in quantity that some are kept back until the second season, but also that these initial characters continue to develop in some way as the story progresses; instead of becoming mere devices for slap stick jokes as often is the case. With the ironic exception of the male lead protagonist who begins to show the most abrasive traits of a typical harem lead (dense). Thankfully, rather than acting coy, the other characters act up in various attempts to force his hand rather than let some ambiguous harem continue unresolved.\\n\\n\r\nStill, the series ends on a rather sour cliff hanger to be addressed in a third (confirmed) series. At the very least we can expect some drama to unfold and drive the story forwards rather than allowing it to stagnate; hopefully the narrative can avoid some of the most offensive romcom cliché's. But finally the characters are beginning to get territorial over the groups token male which has its own element of satisfaction for the male viewership.\\n\\n\r\nStill, as an adult with mature tastes it would be nice if there was a decent harem out there similar to this where the main male lead actually acted somewhat like a normal person would rather than some impossible to relate to, holier than though libido-less teen. IE Instead of making completely unrealistic outright rejections of forward confessions of lust, to at least experience some confliction beyond turning their face away out of embarrasment. Basically a non-fantasy version of Kono Subarashii Sekai ni Shukufuku wo! But I Digress.\\n\\n\r\nThis show manages to maintain it's overall quality despite having most of the easiest to produce suspenseful moments out of the way. The Humour remains on point and the characters, male lead aside, become even more endearing/enjoyable to watch.",
            "date": "2017-07-07T08:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 252187,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5840782.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/grazr",
                "username": "grazr"
            },
            "url": "https://myanimelist.net/reviews.php?id=252187"
        },
        {
            "content": "Warning possible Spoilers\r\nWhen it comes to anime's getting sequel's it always makes me nervous depending on what it does to expand the story, luckily this is one of those sequels that was well worth it.\r\nThe story continues with the Neighbours Club endless crusade to make friends and after the incident from the end of last series things have quickly gone back to normal, but more developments are in store for our dysfunctional club members.\r\nNow the story pretty much expands upon the first season as the club members continue to do activities that will hopefully make them acquire friends in the future and it obviously leadsto more disputes and funny outcomes of those disputes, but the tone of this series is a little bit more serious especially when we get closer to the end this series because now the club members have gotten acquainted with each other and know more about each other which this series shows how much the bond between them has grown, that being said it concentrates more on the relations between Kodaka and the girls as they have gotten to the point where they have some form of attraction for him especially Sena and Yozora.\\n\\n\r\nThe characters definitely get more development in this series as their relationship has grown so have their feelings for each other.\\n\r\nKodaka continues to be the blandish guy, but you see the reason for why he acts the way he is around the girls and why he continuously knocks down their advances on him because all he wants right now is friendship.\\n\r\nYozora and Sena continue to be at each other's throats with the pranks and arguments they pull on each other, the first season mainly picked on Sena during the argument, but in this season the tables have turned and whenever Yozora tries to do something to get closer to Kodaka it always blows back into her face which gave the chance for Sena to make her move, you also see that these two have gotten more used to each other as their relations with the other girls improves too.\\n\r\nThe other girls of the group get their own chances too, Kobato and Maria also improve their own relationship while Yukimura continues her journey of being manly.\\n\r\nRika actually has a bigger role this season as her technical skills help to create a movie the club was working on and you really see her true self during the final episodes when Kodaka wa avoiding the club for a certain amount of time.\\n\r\nThere is even new characters introduced like Kate who is Maria's older sister, she is more of a tomboy and acts pretty vulgar around Kodaka although despite acting like this she does care for her younger sister even though she won't admit it.\\n\r\nAoi Yusa is mainly a supporting character and isn't shown a lot, but she is Sena's rival when it comes to the test scores and hates how smart she is even to the point where she tries to shut the club down which luckily Sena steps in and stops it.\\n\\n\r\nThe artstyle is actually a little different compared to the last season and the differences are apparent from some small details like Kodaka's hair has actually changed a little and everything looks smoother too, we also get to see the girls in more different outfits that continue to make them look good too.\\n\\n\r\nThe fanservice in this series is also cut down a little bit compared to the last season which is a little disappointing since there are new longer any cheeky nip slips or exposed breasts and it instead goes for the option of using hair or objects to cover up the girls, but it doesn't impact the show a lot to be honest.\\n\\n\r\nThe comedy was just as good this season as it was the last one hell I think the pranks on Sena went to new levels as the first episode literally started with Sena having a monstrous hairstyle just because the others said it would improve her character and the fact they were the ones who made her hair look like that in the first place.\\n\r\nThe Romance increased more in this series since the relations between the girls and Kodaka has obviously grown it mainly focuses on Sena and Yozora particularly Sena since it is revealed that she is an even earlier childhood friend of Kodaka's than Yozora was and because of this we see the development in their characters on how much Kodaka has impacted their lives and how much they care for him.\\n\\n\r\nOverall this was a fun second series and maybe there''ll be a third season to close it off hopefully considering the ending for this season, but from what I've heard in the light novels I think it's best to leave it as it is or maybe a Movie to close the story.",
            "date": "2017-07-06T12:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 252122,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=252122"
        },
        {
            "content": "I really liked the first season, but during the second season it started getting boring. I really missed romance here. Every time I saw Kodaka, Yozora or Sena being shy I was like: „OH I hope the fell-in-love despair, confess stuff will go on now!“..but it didn't. Both girls being in love with Kodaka not doing any steps. And he's stoned. Someone would like it but high school comedy that isn't Ecchi nor Romance is just too low for me. Where is the younger sis incest love thing? The anime is good but I'm just used to characters showing their feelings in anime. It's justpity, it would have been 9.",
            "date": "2016-08-30T04:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 227935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5417256.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Galactus159",
                "username": "Galactus159"
            },
            "url": "https://myanimelist.net/reviews.php?id=227935"
        },
        {
            "content": "Well, here we go, Boku wa Tomodachi ga Sukunai Next. At the end of this one we'll find out more about the interests of our protagonists, I'm looking forward to it! Or that's what I originally thought when I started watching this anime.\r\nComing from season one, I didn't expect anything revolutionary, but I hoped for a bit more development. Development which never came. The show pretends to move forward, which never really happens until the last episode, where they suddenly jump forward two miles in plot, and therefore make it feel extremely rushed.\r\nThere is basically no character development, and therefore you wouldn't expect any choiceto happen, which saddened me, all the whilst knowing it was a harem, so I shouldn't expect anything in terms of plot movement at all, really. But then suddenly they make a conclusion based on nothing, because nothing really happened, and you're left with the feeling as if you missed something.\\n\\n\r\nMaybe I did, maybe it's not rushed and I haven't been paying enough attention, but when I said that I wasn't expecting anything special, I didn't mean for something like the last episode to happen. Oh well, it's still fairly enjoyable, but I can't take this one seriously anymore, not that I should've, maybe that was my mistake.",
            "date": "2017-04-02T09:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 244355,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4819065.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Seidai",
                "username": "Seidai"
            },
            "url": "https://myanimelist.net/reviews.php?id=244355"
        },
        {
            "content": "Oh yeah you should probably only look at this review if you've finished both seasons or else I may spoil something.\r\nKeep in mind this review I'm making is solely my opinion, so don't get fucking crazy.\r\nAlright, so I watched the first season of Haganai and I really liked it, Although this next season makes me have mixed feelings. Kodaka is in a situation where every girl in the club likes him and if he were to choose a girl to date then the club would fall apart, he is also not interesting in dating any of the girls at all. Basically it's your average harem.The girls obviously like him, whenever they say something that shows they like him he doesn't hear it and the never ending cycle of this continues forever. This really makes me dislike this anime because it's just the same thing over and over and over again. Although, I have to admit it is not a bad anime. The art is good, the sound is good, the story is good, I just really hate the MC.\\n\\n\r\ntl;dr This is like Nisekoi.",
            "date": "2015-08-13T11:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 196044,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4783533.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rambo908",
                "username": "Rambo908"
            },
            "url": "https://myanimelist.net/reviews.php?id=196044"
        },
        {
            "content": "well this anime goes into my worst animes ever list.\r\nI liked most characters but that's about it...\r\nIf you aren't depressed already you will be after watching this 2 seasons..\r\nBunch of people hanging around almost everyday not acknowledging they are friends and not having friends. just a club which does events trying to make friends but put zero effort into anything.\r\nit is just a very bad soap filled with lies , sneaky backstabbing and worst romance if there even was any.\r\nbtw irl a group of 6 girls and 1 guy would not even be a thing ever unless it is a gayboy or someone that hasno feelings for man or woman. and to be fair even if you would see this as a example for people that have any sort of disable or just a hard time finding friends  ,  if you have a club based on finding friends and you don't see the others as friends you deserve to be alone cause nobody would be that fkn stupid it is just sad",
            "date": "2018-09-10T11:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 288683,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7408570.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/captainspamalot",
                "username": "captainspamalot"
            },
            "url": "https://myanimelist.net/reviews.php?id=288683"
        },
        {
            "content": "Disclaimer I would like to give about the first 1 and 3/4 (it's really quite unclear where the series lost all seeming aspects of hope) of the the series a 6-7/10 but unfortunately the last quarter of the series was so unspeakably bad that it practically negated the enjoyment i felt for the rest of it and made it somehow unrateable so I give it a -/10. I know its stupid and if I did the rating objectively it would be different but I need to do this.\r\n I'm going to try and make it not too rambly but I havn't been quite able toisolate and condense my main problem/feeling with the show into words (so I really shouldnt be writing this), but without further ado here is the review. Of course the show hadmajor major issues from the start since it is/was a generic school romcom harem ( though it had a few problems even for the genre that just happened to be cancelled out by a few plusses), but I was completely ready to accept it for what it was overlook its flaws and just have fun watching it. But then starting with the beginning of the second season but never truly manifesting until the very end, the show started to take itself seriously and become a truly meaningful/impactful show. This wouldn't have been bad, in fact if it had succeeded it would have been one for the record books a gem and an instant hit, the eighth wonder of the anime world. However it failed horribly as it had no foundation and didn't give itself enough time in the second season to create a makeshift foundation to rise upon. And somehow as it plummeted down it managed to ruin all its good parts and accentuate all its bad parts that much more. I really dont know how to explain it other than this. It wasn't some anime that I had high expectations for and failed me, In fact I had low to no expectations for the piece and yet it still dashed those. It is somehow better yet at the same time way worse than straight garbage and failed potential anime. I guess I just didn't think it could go lower. Fianlly after writing this I have come to the conclusion that this anime is the very bottom threshold, the worst something can be without me completely regretting watching it or denouncing it as even being watchable anime.",
            "date": "2017-10-21T23:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 261376,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399062.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MK_Alex",
                "username": "MK_Alex"
            },
            "url": "https://myanimelist.net/reviews.php?id=261376"
        },
        {
            "content": "Overall it was just more than a usual harem comedy anime. It went into depth with the characters and their reasoning. This season was much deeper and complex than the first one. Rika really shined in this season as well. However, I was sad to see Yozora get pushed away a bit from Kodaka, as I want him to be with her. But that's just personal preference. A next season of Boku wa Tomodachi ga Sukunai is most definitely needed for closure. But it may be a year or two until the LN has enough material...",
            "date": "2013-03-29T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 91391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1954468.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZangetsuLelouch",
                "username": "ZangetsuLelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=91391"
        },
        {
            "content": "Okay this show is great! The first season I was a little skeptical about it but once it got towards the ending and then the second season I was totally into it! I know people been asking about the third season and what I know is as long as we watch it and the popularity of the show rises the more money they make the more episodes we get! I will be very sad if they do not come up with the third season because the second season has a terrible ending if it doesn't! For all the Anime shows that end in the secondseason with room for a whole three more seasons is completely ludicrous! I've watched the entire two seasons in two days and I am fond and I am fascinated with what I watched! Let's give the Japanese a wake up call and send him a shit load of shit so we can get more seasons involved, I mean, I was fucking interested and the ending ended like that and I was like WTF! But it's okay because I know how the ratings went in the city tonight and I have done some very deep research and if the ratings keep going up we will be good at the end.",
            "date": "2014-10-02T12:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 163299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jay0559",
                "username": "Jay0559"
            },
            "url": "https://myanimelist.net/reviews.php?id=163299"
        },
        {
            "content": "My first review, but after watching Boku Wa Tomadachi ga Sukunai NEXT, or Haganai NEXT, I was compelled to write this.\r\nLet me start off by saying that this series messed with me so much to no end. It was a completely different experience from watching the prequel.\r\nThe story: It was a continuation from the prequel in which they are still in The Neighbor's Club trying to achieve the common goal of becoming popular and making friends. However, the story for this sequel had more depth to it. Overall, I felt that it had a completely different feel to it. As expected from the prequel, Ilaughed so hard from their crazy antics, the way they expressed themselves, and overall the way they carried on with the plot along the show. What I believed to be great about this was that however unrealistic the scenarios might have been, the feelings portrayed were completely relatable. \\n\\n\r\nWith this series, it left me wanting more, that's for sure. Which is a different reaction from the first series because I only wanted more because I knew that there was a second season. \\n\\n\r\nOverall I can say I really liked how the story progressed here.\\n\\n\r\nArt: I think it was pretty good, I liked the way they were drawn and it was very appealing to the eye.\\n\\n\r\nSound: I love the voices and the sound effects and everything else, it was great.\\n\\n\r\nCharacter: I absolutely love all the characters in this series. I only have an issue with Yozora sometimes because of her stubborn manner and the way she bullies Sena, but overall she makes me laugh so much so I really appreciate her character in this series and that goes for the other characters as well. \\n\\n\r\nI very much enjoyed this anime and that's why I gave it a 10, it think it truly deserved it, and it was such a nice continuation of the first installment of the series. Can't wait for more.",
            "date": "2013-04-06T21:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 92785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2249783.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Etoile_sama",
                "username": "Etoile_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=92785"
        },
        {
            "content": "SPOILER AHEAD \r\nThis is my first review i have ever made. I rated 7 for the first season of this series, which i do rly find enjoyable to watch , a SoL harem(kinda) comedy with no real plot \r\nThen the season 2 everything just went downfall to me . The early episode is ok , the anime actually has a plot now. But the character development somehow didnt make sense to me . Starting from kodaka , season 1 hes ok , a usual protagonist which i thought handle everything in a way that make sense, but season 2 just wanna make me wannapunch him in the face (the way he handle things by being a fking deaf person)\\n\\n\r\nThen the conflict between sena and yozora , yozora end up screwing up thing by saying smth she doesnt suppose to say , end up hurting sena. But then again , what happen next? NOTHING . Kobato show up , Sena went as her usual self like nothing has happened. Conflict is made to be solved , if u just end up not solving it at all and ignore it maybe the conflict should have NEVER been there which this show i feel screwed up the most.\\n\\n\r\nThe ending is also really bad , not a thing you could actually said finished, except mb the relationship between rika and kodaka which i think is kinda meh. They literally left us hanging with  kodaka and sena relationship, nothing is really shown about how kodaka and yozora relationship turned out.\\n\\n\r\nOverall i still actually like the 2nd season a lot , but i kinda leave a bitter taste in my mouth. I would love  a sequel explaining the things above mb a movie or ova or smth \\n",
            "date": "2017-06-21T07:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 250540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3662295.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/feddrick38",
                "username": "feddrick38"
            },
            "url": "https://myanimelist.net/reviews.php?id=250540"
        },
        {
            "content": "Boku wa Tomodachi ga Sukunai is one of the many light novels to there which is receiving a lot less acclamation than it deserves. While this is not unusual, it still is shocking to realize a majority of anime fans out there are missing out on such a great work of art and cannot truly appreciate its’ existence. In the anime world, light novels are often looked down upon for their brevity, many viewers seems to have the notion that due to the shortness of light novels, the character and plot development cannot be that great, they also commonly assume that there would be manyholes in the story line. While it is true that many light novels seems to fall under this category, such as Kore wa Zombie desu ka, it is also undeniable that there are others which, for some inexplicable reason, the manga-ka chose not to prolong the series, Club to Death Angel comes to mind, and it truly is a shame that such anime are not recognized for their sheer amazingness. Personally, I have nothing against popular manga and anime, I am a big fan of One Piece and Fairy Tail, and I agree that new viewers introduced to the world of anime should start with those, however they should also realize that Big-Timers are not the only anime that they need to grab popcorn and lock themselves up 25/8 for. Some light novels, such as SAO and K-ON, are appraised for their ingenuity despite their shortness, but it bothers me that people should not look deeper for equally great anime, and this is why I am writing a review for Boku wa Tomadachi ga Sukunai.\\n\\n\r\nStory\\n\r\n\tOn the most basic level, this series is about a teenage boy named Kodaka who has moved back to his hometown after 10 years and tries to make new friends, but because of the colour of his hair, people generally mistake him for a delinquent and avoid him, thus the name of the piece (literally: I don’t have many friends, which I am now going to refer as Haganai). Until he meets a girl named Yozora, who also is a bit of a loner (seeing as how she was talking to “an air friend”), and together they create the Neighbour’s Club, with intentions of learning how to interact and make friends, “A place where outcasts could just be themselves and not care”. The setting and plot is a complete slice-of-life, with nothing seemly out of the ordinary (besides Rika nearly killing Kodaka with flying metal balls near the end of the second season, but that’s beside the point), as Hirasaka evidently wanted viewers to be able to relate to certain events in the storyline. While this is a Harem, with Kodaka being our male protagonist with many adorable female characters revolving around him, it is not just your typical, generic fan service series, the story actually has deeper meaning and legit purpose for all of them being in the same club (in this case making friends), as opposed to the other harems out there where characters stay together for the sake of being together. Sure, there are some eye-candy screens which will arouse some excitement within our male demographic, but the story is also trying to teach us something, which is to value our friendship. We do not truly appreciate the friends we make, but as we watch Kodaka and the others struggle for the desire of friendship, it makes us think. What is friendship? IS it formed simply by being members of the same club? Through the interactions of our characters, we slowly begin to comprehend these values. The irony being that they are learning to make friends, all the process becoming friends within the club. These things are a part of what makes this series so great, as you would not expect such questions to come out of a series of just 25 episodes. The cast of this story is a colourful bunch: we have Kodaka, the cool-headed yet dense protagonist, we have Yozora, lacking in every aspect except for her looks, as well as Sena, the other female lead, self-proclaimed goddess and perfect at everything besides her personality, and others including Yukimura, Maria, Rika, and Kobato, all of whom have a distinctive character and defining trait. With a bunch of misfits such as these coming together, the romance which brews and relationships which follows is pure gold. Many of the events which take place with the Neighbour’s Club are just normal activities, ranging from Karaoke to a training camp at the beach, but the development of said relationships is what makes it so intriguing. Are there any flaws to the story line? Sure, while the cast is wonderful, we don’t know much about their backgrounds besides a general outline. Also, while the drama of some confrontations leaves you on the edge of your seat, Kodaka usually ends up ruining the emotional build-up by being his ignorant self. However, considering this as opposed to, say, Zombie desu ka where the plot line is completely disjointed and half the time your are trying to figure out what is going on, I would give this a try any day. \\n\\n\r\nArt\\n\r\n\tA strong point which I precieved of Haganai, is its’ artwork. Originally, I had picked up this series seeing as how the characters looked cute, not realizing I would be getting so much more out of it. Not much to say about it, just that the artwork is amazing, even going so far as to say the best I’ve seen in anime by far. The way FunAnimation was able to give life into the character’s eyes to the point where they seem to come to life, especially Sena and Yozora, is just intriguing. Also Maria’s child-like face, Kobato’s shyness, and Rika’s eccentreicity are all depicted so well to portray the various personalities. While most of us would just be enjoying Sena’s fan service, other things sucha s the detailsof the background and even no-name characters, the fact is that the artwork never fails to surprise, and viewers could easily tell the amount of effort put into make the anime aesthetically pleasing.\\n\\n\r\nCharacters\\n\r\n\tThis, in my opinion, is the most prominent asset to Haganai. As mentioned earlier, Haganai is a story that circulates around a group of social outcasts who seek to make friends, and the on going development of relationships is what makes this anime so enjoyable. Each character has different life problems and conditions which opts them from making friends, whether this be being an isolated genius, child prodigy, a girl who believes she’s a guy, or an arrogant idol, the Neighbour Club brings them all together with the purpose of making friends, and the interactions are hilarious. The characters do not seem to all be held together by Kodaka, but instead develop their own relationships. A central focus would be the constant discrepancies between Yozora and Sena, as they disagree and compete in next to everything (besides Sena’s Girl’s Love games). From multiplayer video games to a roller coaster in an amusement park, there seems to be a constant unsettled animosity between them. This could be due to Yozora’s dislike for popular people such as Meat (Yozora’s nickname for Sena), but either way it’s funny. Similarly, Kobato and Maria are seen often fighting for “Onni-san’s” (Kodaka’s) brotherly affections. Being the two youngest members, Kobato and Maria could most relate to each other, and due to their credulity both believing that Kobato is a vampire while Maria being a nun, thus the allusion to conflict between light and dark. Among this, other relationships develop, such as Meat’s creepy obsession over Kobato due to her resembling characters from Meat’s eroge games, or Rika’s open perverseness towards Kodaka, all lead for great laughs. In terms of love relationships, seeing as how this is a harem, the feelings from the girls develop gradually, and the confrontations are all very realistic, while dense Kodaka either doesn’t understand or chooses to ignore the emotions involved and continues to treat everyone as “just club members”. Unlike its counterparts, Haganai treats the situations realistically, and it isn’t just some slug fest due to Kodaka being the only male character, Rika being the only one who openly expresses her feelings (which Kodaka chooses to ignore). In season 2, our cast seems to have mature more, with the exception of Kobato and Maria, and thus acts as such. While on the surface, these characters are just here to offer enjoyment to the viewers, however Hirasaka actually offers a deeper in look of our characters. While Kodaka is your typical male protagonist with “a bad-boy look” and a seeming tsundre attitude, at heart he is really a kind teenage boy who cares for the people around him. Kodaka is not just your unoriginal, cliché harem male, through him, Hirasaka is telling us to be who we are and to not judge by appearance, seeing as how Kodaka is bullied due to his naturally blonde hair but despite this refuses to dye it. It truly is amazing to see how well the characters are developed and their relationships within such a short series.\\n\\n\r\nSound/Music\\n\r\n\tAgain, not much to say about this besides the fact that the developer, FunAnimation, incorporated the perfect OST into this anime. The OP of both season 1 and 2 are extremely fun to listen to, and one could sit there for hours listening to them as they sit in their room alone playing chess by themselves (not like I’m telling from personal experience, no never). There’s just one thing that bothers me with the music, and for the fact this goes with most Japanese anime music, and that is the inclusion of English words. Sure, “friend” and “bend” rhymes, but that does not always great song make. Also, the Japanese dub is excellent, wit the voice casting of each character perfectly suited to their personalities.\\n\\n\r\nEnjoyment\\n\r\n\tGreat character foils? Check. Adorable and realistic art? Check. Comic relief? Check. Sena running nude and making erotic poses? Check. Haganai has got it all. I have already watched and rewatched this series, and would go for it again, that in itself should speak for enjoyment. The comedic relationships on its own should serve as a purpose to watch this. If you’re looking for arousing screens, Sena says hi. While not as fan service heavy as FunAnimations’s last work, Heaven’s Lost Property, Haganai has got its own fair share of eye candies to gawk over.\\n\\n\r\nOverall\\n\r\n\tAs I said previously, I often feel that light novels are underrated and just aren’t receiving as much attention as it deserves. Viewers often perceive short series as mini-mangas/anime and treat it as such. Many don’t take them seriously, and most tend to read a couple of the crappy ones out there before coming to the conclusion that all light novels suck, and decide to stick to only the popular series. However, comparing light novels to longer series would be like comparing an old man at the park to rainbows; they’re just totally different entities. For this reason, and considering how short the series is, I strongly recommend anime viewers, both armatures and seasoned viewers, to give Haganai a try, and decide for themselves.\\n",
            "date": "2014-07-07T22:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 150987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3881887.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jiajia1239870",
                "username": "jiajia1239870"
            },
            "url": "https://myanimelist.net/reviews.php?id=150987"
        },
        {
            "content": "I made a video review of this: https://www.youtube.com/watch?v=YIZZH_qZFJc but for those who want to read the script, here goes nothing:\r\n *Japanese accent* BOKU WA TOMODACHI GA SUKUNAI!!!! GOD DAMN THIS SHOW HAS A LONG TITLE. This show also goes by haganai and has the english title \"I don't have many friends\". Okay I'm sorry but TITLES ARE SUPPOSE TO BE CATCHY!!! I don't get why animes have such a fetish FOR TITLES LONGER THAN MY COLLEGE ADMISSION ESSAY!  watashi ga motenai no wa dou kangaetemo omaera ga waruiFUCK IT I DON'T SPEAK WEEABOO! SO recently I learned why light novels have long ass titles.It's is because PEOPLE BE TOO DAMN LAZY TO READ THE BACK OF THE BOOK FOR THE SUMMARY! To counter that, authors make the title the synopsis. CLEVER MARKETING STRATEGY!!! So what exactly does the title \"I don't have many friends\" even mean?\\n\\n\\n\r\nBasically, this show follows around some dopey blonde \"delinquet\" kid. Who goes to this club called the neihbors club. A club for people with no friends.... FINALLY A CLUB MEANT FOR M- ANYWAYS. Thing is, this premise REALLY BOTHERS ME. YOU CONSTANTLY SEE THE MAIN CHARACTERS IN THE CLUB HANG OUT AND BOND OVER HENTAI GAMES AND SHIT! Listen, you KNOW you're friends with someone if you play porn games together! But in all seriousness, these guys CONSTANTLY hang out with each other. Even on the WEEKENDS!  But ALL of them talk about how they don't have any friends. Uh WHAT!? ALSO, Remember this is a harem show. So, they are more than just friends, if you get what I'm laying down. cuz' ya know,  all the girls want to hop on this deadheads dick! *horse noises* These characters get pretty close with K-pop wannabe but NOPE. He apparently has no friends.\\n\\n\\n\r\nThis anime doesn't seem to be that well revived as it's not even ranked in the top 1000s. So do I like it? YES, ACTUALLY! Despite all the complaints I have for this show, I would say that I not only like it BUT LOVE IT! This show made it on my top 25 favorite anime! Take school rumble a fairly well revived romcom that fans of the genre tend to love. I legitimately love that show DESPITE THE DICK TEASING (nisekoi, I'm also looking at you!) However with this show. It honestly seems more like a guilty pleasure. Honestly this show was so fucking dumb and retarded at times it was laughable! From the excessive loli fanservice.To the ironically funny main characer whos so generic it's laughable. To the weird and somewhat unlikable girls in a freaking harem. And the LAUGHABLY terrible romance. This anime is so stupid it's fucking genius! And the weird thing is, At first I almost thought this anime's stupidity was intentional. Because the show was so obviously terrible that it was hilarious. However PROTOTWISTU!!!! The show tried to pass off itself as being  fucking retarded. But it turns out it's actually a deconstruction anime! The show HIDES the fact that it's a deconstruction show. You see the deconstruction element of this anime foreshadowed from the very beginning. I was naive to call this show a guilty pleasure. Because the deconstruction elements TOTALLY SLIPPED PAST ME! The first 22 episodes of this anime play out like a shitty romcom but foreshadow the deconstruction elementsBUT BAM the last 3 episodes where genius! FACKIN' GENIUS! The last 3 episodes is when this show becomes a deconstruction anime! The show pretty much points out it's own stupid flaws and breaks down why the show itself is stupid.\\n\\n\\n\r\nTo give you the most primary example of this anime being a deconstruction.Take the main character, kotoka. This guy's defining personality trait is his lack of one! I'm not joking this guy is FUCKING BLAND BORING AND STOIC! He just has the typical cliche \"Oblivious nice guy that likes helping people\". AND YOU SEE THIS TYPE OF CHARACTER IN EVERY ROMCOM ANIME! *crying voice* Why can't all romcom characters be as cool as harima! He sees yozora be a sadistic bitch, he sees see rika be a HUGE creepy perv, and he sees loli's get freaking naked. And this guy NEVER HAS A REACTION! He's so apathetic I find it almost amusing, kind of similar to how yu narukami from persona 4 the animation is. However. PROTOTWITERU the main character actually does have a personality! You see this with the last three episodes as you learn he just PRETENDS to be a generic main character. It's all just an act! *gilgamesh* faker. But really the reason he acts so apathetic is because he's SELF AWARE that he's in a harem. He doesn't want to show favoritism towards one girl because he doesn't want to hurt any of there feelings. YEA HOLY FLIPPIN' PIZZAS! That's pretty interesting! So this guy just PRETENDS to be your generic romcom character when deep down, he actually does have a personality! Inside that lifeless shell of a generic main character THERE IS A PERSONALITY!!!! If that's not deconstruction slapping you across the face with a wet noodle I don't know what is.\\n\\n\\n\r\nThis isn't the only character that would be considered a \"deconstruction character\". So you think of a harem anime. You expect two things. NUMBER 1 CHICKS WITH HUGE TITIES and also chicks with cute and likable personalities. In contrast yozora, the main girl of this show is FLAT A BOARD! Also she's a fucking sadistic cunt and I can't see how anyone could call this BITCH a waifu! However that's the point. I mean the cast consists of a the most loyal chick ever, two girls with a big brother fetish, a girl who wants to ride your dick, and MEAT! *Insert mooing sound* Honestly even IF yozora was a half decent person she couldn't even compare to these other chicks. And that's what makes it so interesting! The main girl was childhood friends with the main charachter and CREATED the neighbors club just as an excuse to spend time with him. But as more chicks came into the club, ALL MORE APPEALING THAN HER really makes yozora not even a competitor for \"best girl\". Due to her sadism and pessimistic nature she is in almost every way \"the worst girl\". In most shows having the \"worst girl\" be the MAIN GIRL would suck massive giraffe dick *wisper* and we all know giraffe have big dicks...actually only I know that.ANYWAYS. as interesting as yozouras dilemma is, do I like it. eh!? I mean it's interesting and unique but the problem is. The writers did such a good job at making yozora dislikable THAT I FUCKING HATE HER! She's a bitch, she's a cunt, she's a bully, she's literally cancer embodied as an anime girl! Thing is, she's so dislikable that I can't even sympathize with her.\\n\\n\\n\r\nIn the 25 episodes we've watched we've never seen her show any likable or sympathetic traits. Her character concept is great but the execution was done poorly! At least give her a sympathizing backstory or give her, you know, CHARACTER DEVELOPMENT! She's a bitch from episode 1 to episode 25 and isn't willing to change. Like maybe if we saw her have the willingness to change and TRY to be nice I'd be like, OH, I feel bad and want to route for you to be a better person. So maybe we could see her work her way up to being the \"best girl\"BUT NO, SHE'S A MEENIE WEENIE THE ENTIRE SHOW.\\n\\n\\n\r\nHonestly, these aren't the only two characters in this anime that are interesting and unique. You got Senna who basically is what created the \"kamidere\" architype. Senna, is in my opinion the best girl, as you see she's happy go lucky, pretty chill, like's hentai games and also TITIES!!! She also has a whole god complex as in, she's arrogant as fuck. But to be honest, when you're about as perfect in every way as she is her arrogance might be justified. I mean, Being rich, being the top in her classes, being overly attractive and on top of all that having a likable personality, everything about this girl, screams \"best girl\". And what makes me hate yozora even more is because you constantly see her bully senna throughout the show. All due to her being a jealous ass bitch. And this is the BIGGEST reason as to why I FUCKING HATE yozora! While some of the yozora bulling senna moments where funny. ALL OF THEM MADE ME WANT TO KILL YOZORA! How can I sympathize with someone as cruel as her. I might sympathize with flowey before I sympathize with yozora!\\n\\n\\n\\n\r\nNext off, you got rika, not much to say other than SHE REALLY LIKES SEX. I'm not joking this is the whole joke her character is based off of...AND IT'S HILARIOUS. Unfortunately she looks kinda creepy but when she takes off those glasses DAAAAAAAAAAAAAAAAYYYYYMMMN GURL! Honestly, this show despite being a romcom doesn't have good romance. Because I don't care for the main character so I don't care for his romance. HOWEVER, in the last 3 episodes, Rika was the one that pointed out the fact that kotoka is a faker. Rika has the desire to learn who kotoka REALLY is deep down. Her relationship and romance is by far more interesting than the main two girls. As she really brings out the best in our boring main guy. I easily ship these two. Unfortunate that she's not one of the two main girls of this show. So I highly doubt we'll see these two end up together.\\n\\n\\n\r\nNext off. You got two loli's. One of them is the main characters little sister. Ok first off, the legal age in japan is 13 and she's 11 SO EVEN BY JAPANS STANDARDS THIS IS CREEPY! Not to mention the whole incest thing. Yea I don't need to get into that. Next off you got the nun girl. Take index from a certain magical index and imagine her being a 10 year old and KABAM. you get what is THE WORST GIRL. I might have said yozora was the worst girl, but I'm not including loli's into the mix. Because, I kinda don't want to picture kotoka as a incestuous pedofile. Nun girl is an obnoxious spoiled little brat! It's creepy to think that this KID is a part of the harem. What's even more creeps is that there is FANSERVICE OF THESE CHARACTERS! WHY! THEY AREN'T EVEN IN HIGHSCHOOL YET! AND ONE OF THEM ISN'T EVEN IN MIDDLE SCHOOL!!!\\n\\n\\n\r\nThen you got some trans guy. He's biologically a female but in spite of that want's to be a SUPER MANLY MAN! The whole trans thing is played off for laughs and created alot of amzing cringe humor. We don't even learn he has a fucking VAGINA till season 2!When the main character found out he biologically wasn't a dude. I died of laughter man. Also, does anyone else think he looks alot like mikoto misaka?\\n\\n\\n\r\nHonestly, overall I would say that the BIGGEST strength of this show is it's character interactions. All the characters have a  unique personality. Seeing these characters interact with one another was hilarous. I found alot of yozora's sadism to be funny. (but also painful to watch at times), Then you got all the weird trans jokes that came with the dude who looks like misaka, and with rika you got a bunch of weird gundam sex innuendos. The comedy in this show due to the amazing chemistry the cast has is great as all of them play off each other very well.\\n\\n\\n\r\nA Lot of people say that this show needs a season 3. AND I AGREE. The last 3 episodes where SO interesting as we learned that this show was secretly a deconstruction anime! The show forshaddows the fact that it's a deconstruction really well. But now we finally get to see the show's deconstruction in FULL FORCE.So yea everyone should contact AIC BUILD STUDIO TO MAKE A SEASON 3! Also, what is it with animes never getting a season 3. You got a certain magical index, Baka and test, school rumble, a certain scientific railgun, HARUHI! Seriously, WHY CAN'T WE GET SEASON 3'S!!!\\n\\n\\n\r\nOverall despite this anime being both REALLY FUCKING STUPID and oddly intellectual at the end. I give this show a 7/10. To anyone who is a fan of the romcom genre I would HIGHLY recommend this show as it might be a different watch. As it deconstructs popular trends in the very cliched romantic comedy genre. This has been your host mightypie, Subscribe for more SEXY reviews. And as always, good night good bye and big balls.\\n\\n\\n",
            "date": "2016-03-11T12:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 212695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3087283.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/johnnyodyssey",
                "username": "johnnyodyssey"
            },
            "url": "https://myanimelist.net/reviews.php?id=212695"
        },
        {
            "content": "Okay let's start from the beginning , i mean the story ! \r\nActually , i wanted to give it 7 or 8 at least but as always the ending sucks!\r\nI mean OH GOD , i wasted my time to watch two seasons to see a good ending not such a stupid ending !\r\nif there's another season then i will change my review :)\r\nArt .. such an amazing drawing , effect , backgrounds , .. etc , i gave it 8\r\nthe same for sounds \r\nAbout the characters , well i liked all the characters except one character so i gave it 7 >.>\r\nEnjoyment .. \r\nI reallyenjoyed while i was watching this anime , it contains a lot of comedy , romance , funny moments .. etc , but as i said before because of the ending i gave it 6 \\n\\n\r\nSo if you ask me if i recommend this anime or not ?!\\n\r\nI will say , if you're the type of person who doesn't care a lot about the ending then watch it ! \\n\r\nIt has a lot of funny things , but as i said (i know i repeated myself) the ending ruined everything for me ;(\\n\\n\r\nI hope they'll make a new season so i can change my review! \\n\r\nI know a lot of you guys will disagree with me , but this my opinions about this show \\n\\n\r\nWith all my respect ♥",
            "date": "2014-02-03T20:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 131335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/qsqw",
                "username": "qsqw"
            },
            "url": "https://myanimelist.net/reviews.php?id=131335"
        },
        {
            "content": "This is my first anime review, compared to the first season, season 2, anime is more attractive in terms of cuteness stories, romantic ... interesting things were like when the neighbor's club when making a movie, Sena express his feelings to Kodaka.\r\nAlthough the completion of very hung, (there may be a next season). I value this anime with a value of 8.",
            "date": "2013-10-17T19:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 117303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2609935.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/castiel77",
                "username": "castiel77"
            },
            "url": "https://myanimelist.net/reviews.php?id=117303"
        },
        {
            "content": "Unfortunately all I can say is that I was utterly disappointed. I love animes that have closure and deliver some sort of ending that can be tolerated. Unless there is a season 3 in the workings I am un-aware of, this anime feels un-finished at best. I loved the characters, but I HATE IT BEYOND ALL WORDS WHEN THERE IS NO CLOSURE. HATE. I would have given it a 9, it got a 6. I feel entitled to warn you that if you like romance or actual relationship building (aka more than just friends) you will want to look elsewhere, especially if you just finishedseason 1 saying WHAT THE HECK?? like I did.",
            "date": "2013-07-14T03:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 105273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1108991.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kikoredog",
                "username": "kikoredog"
            },
            "url": "https://myanimelist.net/reviews.php?id=105273"
        },
        {
            "content": "Story-6\r\n-----------\r\nEasy slice of life premise. Too easy. The premise is almost the reason I skipped this but I have been pleasantly surprised by the journey through the show. It has plenty of good qualities.\r\nArt-7\r\n---------\r\nWhile not the best, still well done. Good character designs and art.\r\nSound-8\r\n--------------\r\nGreat opening song. ok ending song. Great voice actors.\r\nCharacter-6\r\n-----------------\r\nWe have here a harem of very typical archetypes. Not to say they aren't enjoyable, but they are predictable.\r\nEnjoyment-7\r\n------------------\r\nVery enjoyable. I know the above scores might not reflect it but this was one of my favorite shows to come back to each week.\r\nOverall-7\r\n---------------\r\nWell this is anime, and I love it. Quite a funshow that I hope is revisited in the future.\\n",
            "date": "2013-04-02T07:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 92061,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519203.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Newnono",
                "username": "Newnono"
            },
            "url": "https://myanimelist.net/reviews.php?id=92061"
        }
    ],
    [
        {
            "content": "It seemed like this anime doesn't have many reviews so I thought I might just add one to its number. And so Boku wa Tomodachi ga Sukunai NEXT is... Well it's been a while since I finished it. Sometimes I go to my D drive to fish it out just to watch one episode so I still have fond memories of it and here are my personal thoughts.\r\nStory wise, it has practically none. You probably wouldn't be too hurt watching the anime jumping episodes (I never jump episodes. NEVER. Except with Suzumiya. They saw it coming.) There are small little parts of the story thatreally got me and it makes me super excited for a sequel. But of course, the story doesn't compare to it comedy (or at least I think that's how they planned it to be). Thoroughly funny for me I must say.\\n\\n\r\nMoving on to the art and sound, where there isn't much to say, it was good. Just good I guess. Art was above average but then again it's pretty new and can't compare to stuff like Kimi ni Todoke. Music was unmemorable. I probably skipped through the songs like most other animes but this anime left hardly any recollections of how it's like. I can only remember some slap bass lines and that's it. Tada.\\n\\n\r\nFor characters... Well this can be quite a love hate thing. I've read other reviews saying how they hate Maria sensei who say poop every episode but I'm like... WHAT. I LOVED THAT KID. Her irritating voice kept me smiling and laughing always. She's crazy. And then the main characters are... Well the guy is hard to understand to be honest. Like most of them. You've gotta keep this in mind that hey, they got no friends yo! Not till the formation of the club. Do you know what it's like? I don't >.< Some might call Kodaka a spineless idiot, but I think he's really just genuinely scared and scarred. He's just playing dumb mostly... As for the girls... Again you've gotta try to understand where they are coming from... I love Rika. Period. She works hard, she plays hard and she's smart. And perverted. Bonus there. :D\\n\\n\r\nI enjoyed it. Thoroughly. It was good, but then that's me. But anyway, since you've watched (I'm assuming) the prequel, finish it. Especially if you didn't think it was bad. They wrote it well, that the prequel ends with Taka meeting Sora and that you've gotta catch the sequel to find out what's up. So please do! \\n\\n\r\nThanks for reading my elaborate review. I'm trying to be really to the point and not poetic like some people. It doesn't serve the people man. Write your poems somewhere else >.<",
            "date": "2013-06-13T04:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 100899,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2368935.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/aloysiuskwok",
                "username": "aloysiuskwok"
            },
            "url": "https://myanimelist.net/reviews.php?id=100899"
        },
        {
            "content": "After finishing this series I was immediately swept over by a wave of disappointment due to the lackluster and, frankly, horrid way this series decides to end itself. The anime adaption does not cover all the events of the original work, though the ending there is even more disappointing I dare say.\r\nFirst of all, this series is listed as a \"harem\" but that's not true at all. The MC is cockblocking himself from what seems like a would-be harem. I strongly believe the story would've been much more coherent had they not tried going down the harem route and limited the number of romanticinterests to two. Now I get the feeling they tried to do harem but gave up halfway through, ending up with this confused mess.\\n\\n\r\nThe animation itself is nothing of particular note, openings and endings were nothing memorable as far as I'm concerned and VAs got their job done.\\n\\n\r\nI rate this a 5/10 due to how bad the ending is; it makes a lot of the plot and character development from the previous season plus this season meaningless.",
            "date": "2018-08-03T07:32:00+00:00",
            "helpful_count": 0,
            "mal_id": 285460,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6790036.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZenZen7",
                "username": "ZenZen7"
            },
            "url": "https://myanimelist.net/reviews.php?id=285460"
        },
        {
            "content": "The sequel of the beautiful yet perverted anime Boku wa Tomodachi ga Sukunai comes Boku wa Tomodachi ga Sukunai Next. The sequel becomes more serious when jealousy appears in this expected harem comedy. The comedy was done magnificently and the storyline is great. \r\nThis emphasizes each character and their character which i found awesome. You start seeing the potention in each character and the anime becomes more funny with its perverted plots.\r\nOverall i loved this anime, it comes with great storyline and i still love how they keep the original idea \"Making Friends\" intact",
            "date": "2014-01-10T04:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 128077,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3412321.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ShipdaNALU",
                "username": "ShipdaNALU"
            },
            "url": "https://myanimelist.net/reviews.php?id=128077"
        },
        {
            "content": "(MODERATE SPOILERS)\r\nSurprisingly, here I am again writing another review of this anime. And no, I did not binge it. I actually just wrote the other one a little late, so I figured I would tackle two birds at the same time, having just finished this season today. Only this time, I feel I should be a little less negative, even though that's kind of hard to do due to the new atmosphere of this season. I really don't have much to write here, though, since it follows most of the same tropes you saw previously.\r\nBy now, you're familiar with everyone. The club now has atotal of seven members, two of which are the little girls I mentioned before. And you are also aware that Yozora now has her original look back from when she was a kid. Surprisingly, they don't go over this very much. Yozora has short hair and, well, that's it. Besides Yozora, Rika is the only other girl to undergo a major change in design, which she does every episode. Oh, is there a lot I want to say Rika, but I will save that for later.\\n\\n\r\nPositives! I wanted to be positive first, so here we go. Remember the little nun? Well, she is fleshed out quite a bit this time around. In fact, remember that nun that saw Maria running around nude last season? She debuts here and is revealed to be her sister! And like her sister, she goes by a common name, Kate. Funny thing is that both Maria and Kate can be spelled in Japanese (まりあ or ma-ri-a and かて or ka-te) and the differences overseas are simply how they are pronounced. Despite her rather crude personality, Kate is a character that you may see yourself liking a lot near the end because she has the most common sense among the other teenagers.\\n\\n\r\nShe is also probably the most attractive, even more than Sena, because she has a curvy body and possesses more common sense. Yeah, one thing I think I forgot to mention was that Sena is actually a genius, despite how I described her before. She gets top of her grades and is very athletic. That's why I could never really see anyone hating her is because she is just herself when she does the things that she does, as opposed to thinking she had average grades like everyone else.\\n\\n\r\nSadly, the screen time for Kate is not very long beyond her debut and leading episodes. She is regulated to a minor character quite quick, but for the few times she does appear, she will certainly entertain the viewer. Oh, and just a little warning. Like Sena, fan service has to strike her as well, so she does appear fully nude one time. The scene is fairly obvious, though, so I don't consider this a spoiler.\\n\\n\r\nOne thing I will note, however, is that when Kodaka sees her (who else would it be) on accident, she actually accepts the situation as an accident. And I am sure you guys are familiar by now with how much I consider this a rarity in anime. I just wrote about one that did the same thing a little while ago, but I think this one surpasses that moment by far since it was a far worse situation than the last one. Even better, she jokingly said he would be punished, but then says she was kidding and that it's fine. Yes, she actually used the typical overreaction as a joke. Something I really wish more anime did because I still stand by what I said before that most \"punishments\" for the, again, accidental encounters are far worse than the encounter itself. Will probably be the last time I bring this up for a while, though, since even I am noticing this to be a running gag in my writing. Comically, she also asks him to go to confession afterwards. Thought that was pretty funny with the whole nun thing and all.\\n\\n\r\nSo, after the new character, the anime gets pretty low on them for a while. Strangely, the atmosphere is way more serious this time around. Heck, I don't think I can be positive about it anymore, so get ready. I will start with Rika. Firstly, I did not expect her to get so brutal in this season, but she did. If you thought the other girls were mean to Kodaka, take all of their hatred combined and you have Rika. She doesn't necessarily consider him a bad person, but she does treat him quite poorly. One episode in particular had her acting as a \"tsundere maid\" for a school festival idea and she was literally beating him up. Mostly by kicking, but that's what it was. She was also calling him everything that he hates and disrespecting him horribly for a few minutes of the episode. Any viewer's heart would go out to Kodaka after witnessing it as well. Well she did do it as an act, anyone would consider it overkill on her end since, surprisingly, the other girls felt uncomfortable well watching.\\n\\n\r\nOh, and remember what I said before about how everyone always has a general disrespectful attitude towards Kodaka? This is why I said you would grow to like Kate, because every new character that isn't from the Neighbors Club respects Kodaka more than, well, any of the teenagers from the Neighbors Club. Some of their disagreements this time around could give you a bit of pain because you can't really figure out why, even the nicer characters such as Yukimura, agree with Kodaka being a rude person. And to add insult to injury, Kodaka has even admitted that he's a weak person, but wants to grow into someone respectable.\\n\\n\r\nSo, his own self-loathing results in him usually never fighting back and there's really nobody to comfort him besides Kobato and Maria, the youngest members of the club. Doesn't happen often, though. Also, one thing you will find interesting about one of them, Kobato, is that she is actually the most popular girl in her school. She is just a sociopath and can't make friends with any of her classmates, only being able to truly interact with Kodaka and now mildly gets along with Maria as a friend. Pretty sad, actually. All the more reason why she is befitting to be in the club.\\n\\n\r\nYou know, I have just about made a paragraph for every member of the club besides Yukimura, though there's not much to say about her. She has always been a recurring character, though the standout of her character is that she thinks she is a man. The anime won't tell you this, but her family actually wanted a boy and so they treated her as such. Funnily enough, she always went into the mens' section of any place with Kodaka and so he genuinely believed her to be a man as well for a while. It was not really until one day in the male washroom where Maria joins them as well (not really being old enough where it matters) that she looks down at the (...) of Kodaka and asks why Yukimura does not have one as well. Naturally, Kodaka glances over and, well, he finally saw the full body of a woman that also saw the full body of him. Not how he wanted to do it, I'm sure, but there you go.\\n\\n\r\nOne last character I should go over is Aoi, one of the members of the student council. She appears very late in the anime, so much so that she barely has any real development, but does have a couple episodes centered around her for little bit of anime that is left. In what I consider one of the most bizarre ways to save a club, Yozora basically tells Aoi that their club is legitimate since they are not breaking any of the rules. All goes fine until Aoi reports Maria for not being the official staff of the school and Sena decides to just call in for her to be recruited, despite her age, and then very frighteningly threatens Aoi not to report anything false ever again.\\n\\n\r\nOf course, the viewer would naturally know that they were breaking the rules from the very beginning, but their dark threats scare Aoi off and their club continues on, despite them breaking the rules for quite a while by being unmoderated for several weeks. If you like really dark humor, this scene may make you laugh a lot. Aoi does indeed bring up how they were unmoderated for a while as well. Sena later goes on to say that power solves everything and, well, I hope nobody young is watching this anime. It is very impressionable in more ways than one if this is their first harem, much less first anime altogether. Could very well ruin the whole medium for them.\\n\\n\r\nOh, and I actually like the design of Aoi as well. Something about the characters with red hair always spark my interest. She is also the only girl that is Kodaka's age to also respect him, so if there are a lot of viewers disappointed by his treatment up to that point, it feels like the writers wanted to give the poor guy a break. Even the student council president, Hinata, says not to judge a book by its cover, much to the relief of Kodaka whose voice breaks from hearing those words from someone else. Hinata actually does not play a major role in the anime at all, being thrown in near the ending of it all and only serving as a plot device. She actually even tries to clear Kodaka's reputation, but it obviously fails and all the students do is praise her for her efforts. Hinata is very aspiring, though, as she mentions that she did not care at all about how the other students would see her if she decided to let Kodaka assist her and said she would refer to them as students she would not associate her time with if they ever teased her.\\n\\n\r\nIf you liked this anime before, this season will only disappoint you in the way they chose to suddenly take away the nonchalant feel of the last and turn it into a bit of a drama. Oh, and it disappointingly ends on a cliffhanger. I never feel like I am spoiling anything when saying this, but rather trying to warn you just so you don't invest your time into it. All I can say is good luck and I hope you have a high tolerance for torture porn, cause Kodaka gets the bad end of the stick quite often.",
            "date": "2017-08-28T17:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 256442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=256442"
        }
    ]
]