[
    [
        {
            "content": "This is one of those series that finish so fast once you start watching, because it is just so relaxing and nothing too serious happens, which also makes it so relatable and reminiscent of our high school days (well, for those that have graduated at least!) or how it could be. If you are looking for an easy-going series filled with the power of youth, this is a good example.\r\nStory-wise, there is nothing specific as it is their everyday life, but the overall feel is focused on the romance part; 4 friends who tease each other and their romantic interests. We see everyone’s view (notjust the main quartet) and how they interact and the silly problems they have that seem huge at the time and the silly adventures they take part in and various small parts of their personality. Is it that great? No, it is not, but that does not mean it is not enjoyable. It provides sufficient pleasure and comfort when watching, since it is doing a good job at keeping it simple and not overdoing it most of the time. It is a slice of life work through and through and it does not have enough time to get tiring, thankfully. Comedy is of course also present, but it blends in with romance pretty well, without trying too hard as everything seem realistic enough for an ideal high school life!\\n\\n\r\nEveryone has pretty distinct personalities and most of them are so adorable, but most of all at least half of them are relatable to a good degree if we just minimize their dominant trait a bit. There is the sadistic friend (but who does not have one, really?), the naïve and so transparent friend, the playboy and the silent, aloof guy whose traits do not stop him from having a great time. The girls have their own distinct traits too, but one specific girl, the violent one, sticks out for being the worst. While everyone seems to have their own pretty much normal circumstances, she is just very obsessed and screaming all the time without any sufficient character background or development, unlike the rest who may not be developing all that much either, but they do not really need to as they fit in the story just fine.\\n\\n\r\nThe art is nothing too complicated; very simple drawings, but with many many colors and although generally it can be considered generic, the characters were easily recognizable. The hair aspect is the one true point that makes this so unrealistic, considering one could have purple or fuchsia hair, but there is nothing too extreme on hairstyles to put off someone. Animation is pretty decent, since there are not many scenes demanding of special attention. The sound is also good enough with catchy soundtracks and the voice actors did a decent enough job (that good that I wanted to hit the violent girl with so much screaming), but nothing memorable. It is just one of these series you will watch and like for their art and sound, but forget the next day.\\n\\n\r\nAll in all, if you are looking for an easy watch, this is a great choice and although there is no definite ending which can make you want more right then, it still manages to fulfill its goal. I liked it enough and it may not be an original story, but it is one of those that do not tire you out at all and could continue for a good while, as long as it does not start repeating itself.",
            "date": "2016-06-26T12:21:00+00:00",
            "helpful_count": 46,
            "mal_id": 222056,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5352.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Maffy",
                "username": "Maffy"
            },
            "url": "https://myanimelist.net/reviews.php?id=222056"
        },
        {
            "content": "At first glance, one would think that this is a yaoi anime, but even without the \"shounen-ai\" tag, it's not. It's one of those rare romance anime where the main characters are the same gender, but the romance is heterosexual. When I first saw this anime, I thought probably the same thing as anyone else who was unfamiliar with this anime before it aired, \"This is going to be another borderline-yaoi anime, is it?\" Then, I read the description, and my curiosity was piqued. For that reason, I ended up watching it when it premiered, and I must say that it was a fun animeto watch.\\n\\n\r\nLadies and gentlemen, here is my review of \"Nijiiro Days\".\\n\\n\r\nNijiiro Days follows four high school boys, Natsuki Hashiba, Tomoya Matsunaga, Keiichi Katakura, and Tsuyoshi Naoe, as they go through their high school lives. One Christmas Eve, Natsuki gets dumped by his girlfriend, and as he is crying about it, he is handed some tissues by a girl wearing a Santa outfit; at that moment, he falls for that girl. He later runs into the girl, Anna Kobayakawa, at school, and he tries to get closer to her while his friends try to meddle in their relationship. Every once in a while, the focus shifts from Natsuki to one of the other three boys as they deal with their own love-related problems; Mari Tsutsui is Anna's man-hating best friend who Tomoya ends up liking, Nozomi Matsunaga is Tomoya's younger sister who has feelings for Keiichi (while Tomoya does not approve), and Yukiko Asai is Tsuyoshi's cosplaying girlfriend.\\n\\n\r\nIt's a rather easygoing story with comedic moments sprinkled in here and there. It's really a breath of fresh air, though; after all, all of the main characters are male, but since all of their love interests are female, there is no way one can consider this a \"borderline-yaoi\" anime at all. Luckily, these heterosexual relationships are, for the most part, believable. The one exception may be the one between Tomoya and Mari; I honestly felt more \"hate\" than \"love\" in their relationship, but at the very least, it was given a bit of development. I really liked Natsuki and Anna's relationship, though; it was fun to watch as their relationship grew. However, I really would have liked some more development on the relationships between Keiichi and Nozomi and Tsuyoshi and Yukirin; however, I guess what we get is what we have. (Hopefully, there is more development to those two relationships in the manga....)\\n\\n\r\nThe animation, done by Production Reed, wasn't anything too ground-breaking, but for an anime as simple as this one, it's more than acceptable. It definitely had bright colors, and with a title that translates to \"Rainbow Days\", I think that fits quite well. As for the voice acting, the voice actors did a great job with their respective characters. The music was also great, too; I liked every single one of the opening and ending themes. The best one, however, was the third ending theme, \"'I Wanna Be Your Knight\" by Takuya Eguchi, Tomoya's voice actor; it just sounds so cool with an amazing singer to boot!\\n\\n\r\nOverall, Nijiiro Days was a good anime. If you're in the mood for an easygoing slice-of-life anime with romance sprinkled in, this is the anime for you. These rainbow-colored days cannot be forgotten about!",
            "date": "2016-06-26T10:25:00+00:00",
            "helpful_count": 25,
            "mal_id": 222041,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=222041"
        },
        {
            "content": "Prewarning: If you want something intellectually challenging, or awe-inspiring, this isn't for you. If you don't mind stereotypical plots, a bit of laughter, and are looking for something simple to watch and not think too much about: Sure, go watch this, knock yourself out and have some fun fawning over cute characters.\r\nI really enjoyed this show at the start, and had it ended after one cour I'd probably have given it an 8. To begin with the characters are fun and there was no major drama. Sure it played on typical relationships and character types, but in a light-hearted and happy-go-lucky manner. What was alsogreat was how the story looked into the side characters almost as much as the main... The art is cute, sound is appropriate but nothing inspiring, characters are fun and fairly simple. It was a great de-stress anime. Unfortunately, the anime seriously flat lined towards the end. The last few episodes were over-dramatic, uncalled for, and seriously boring as the heroine struggles to find her own emotions in an unrealistically lengthy manner. Side characters lose their screen time and it ends up being lengthy, repetitive monologues with a tag line of 'I don't know what to do' 'I am so confused'. The ending lacks climax and denounment, I've heard this is getting a second season but honestly if they'd just put some work into the last 3 or 4 episodes it could have been a perfect stand-alone anime.",
            "date": "2016-06-28T05:32:00+00:00",
            "helpful_count": 17,
            "mal_id": 222240,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/916849.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CherryChan98",
                "username": "CherryChan98"
            },
            "url": "https://myanimelist.net/reviews.php?id=222240"
        },
        {
            "content": "What Norn9: Norn+Nonet couldn't do, Nijiro Days did better with LESS screentime, ohh well ok nearly the same screentime but whatever.\r\nNijiro Days being an anime short consisting of 24 episodes with only 10 minutes is about the 4 differing relationships of the four main boys of the anime short. As such LA is very thankful that this anime short has this kind of screentime let alone episode count as it would have been rushed to all hell, nonetheless due to this the majority of the relationships go in depth to.\r\nThough LA says this, the majority of the focus goes to Natsuki \"Na-chan\" Hashiba voiced byYoshitsugu Matsuoka and Anna Kobayakawa voiced by Minami Tsuda's relationship from friends to a couple. The other closest relationship with this kind of focus goes to the incredibly shaky relationship of Tomoya \"Mat-tsun\" Matsunaga voiced by Takuya Eguchi and Anna's best friend Mari Tsutsui voiced by Yumi Uchiyama. Unfortunately the other two relationships of Yukiko Asai voiced by Shizuka Ishigami and Tsuyoshi \"Tsuyo-pon\" Naoe voiced by Kouki Uchiyama as well as Keiichi \"Kei-chan\" Katakura voiced by Nobunaga Shimazaki and Tomoya's little sister, Nozomi Matsunaga voiced by Ai Kayano gets *ahem* pushed aside for the other two more focused relationships and are more or less B plot relationships with Tsuyoshi and Yukiko's relationship was already formed before the anime thus didn't have enough meat and Keiichi and Nozomi's relationship started rather late to get a proper focus respectively. LA's favourite relationship oddly enough however goes to Tomoya and Mari's relationship, yes LA could say that Mari's constant bickering to Tomoya got annoying rather quickly but their development helped a bit more especially with Mari's defrosting and deredere moments.\\n\\n\r\nThe animation by Production Reed at best is above average for an anime short and LA had really no problem with the animation at all.\\n\\n\r\nVoice acting wise, there was an annoying voice acting mainly from Yumi Uchiyama who voiced Mari but she got better over time (away from her bitchy vocals anyways), however LA's favourite voice actor in Nijiro Days would actually be Shizuka Ishigami who voiced Yukiko and really LA wanted to see more of Yukiko but again for her character' circumstances, LA could see why she couldn't.\\n\\n\r\nThe ending for Nijro Days gave us something of an \"ok\" ending as the entire focus for the final few episodes went to Anna Kobayakawa's revelation about her relationship to Hashiba and really it's the typical \"can't spit it out\" by the end of the anime, ohh Anna finally gets her revelation about her growth to her relationship to Hashiba but she just doesn't take the move to grow it even further, nonetheless, the sentiment was nice, the ending also the narrow focus, all the other relationships are put in limbo to give the focus to the main couple of Hashiba and Anna, it's a bit of compensation at least but LA wished the focus was split a bit more to the rest of cast and their relationship. The ending is really a double-edged sword but LA overall was slightly satisfied with this ending.\\n\\n\r\nNijiro Days is a great romance anime short to the anime short medium that looks at many stages of a relationship with lots of growth to the multiple relational developments, sure the focus tends to go to Mari and Tomoya and especially Anna and Hashiba while the other two relationships turned into a pseudo-growth/supporting characters to the above relationships. Nonetheless Nijiro Days is a soft-fluffy puppy-love anime short with some good payoff of relationship growth here and there.",
            "date": "2016-06-26T17:32:00+00:00",
            "helpful_count": 17,
            "mal_id": 222090,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=222090"
        },
        {
            "content": "True definition of a rom-com, that portrays amazingly what friendship between guys is.\r\n                         Story 8 I Art 8 I Sound 8 I Character 9 I Enjoyment 8 I Overall: 8\r\nWhats good about this anime?\r\n+Amazing chemistry among characters, this aspect of the show is just amazing how even though the main characters are really different from each other they feel so close, just amazing.\r\n+Good Art style, not kyoto animation kind of art but beautiful when ithas to be.\\n\\n\r\n+A rom-com thats actually funny\\n\\n\r\n+Voice Actors are just perfect in this anime, really good cast\\n\\n\r\nWhats bad?\\n\\n\r\n-Dont expect to much story from it, it started really good with the first episodes, then it turns okay\\n\\n\r\n- Heroine was just meh, I mean it was just right but it could ve been better\\n\\n\r\nSo I reccommend this series if you are looking for a heartwarming love and comedy experience, don't expect it to be intelectually challanging or difficult plots, its just what it is, a lighthearted rom-com, \\n\\n\r\nBest aspect of this show are the characters, they carried all the kind of cliche story and make it actually really good\\n\\n\\n\\n\\n",
            "date": "2018-02-11T21:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 271320,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6538337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/netosolano98",
                "username": "netosolano98"
            },
            "url": "https://myanimelist.net/reviews.php?id=271320"
        },
        {
            "content": "Nijiro Days is as fulfilling as watching someone else eat delicious cake. It's taunting you with something amazing, something that you could have. But ultimately you're let down.\r\nThis anime had so many problems. I can't help but get angry because of it. On the surface, it's a quick, fluffy romance anime with male leads instead of female ones. This is a unique twist on the shoujo romance genre, but this twist is wasted on Nijiro Days. This is no better than a boring shoujo with female leads.\r\nMy major problem with the series is the characters. They are a lackluster, meaningless cast, and I felt noattachment to any of them, even though I've gone through the hardships of crushes and unrequited love before.\\n\\n\r\nLet's go down the list of couples, analyzing each.\\n\\n\r\nThe Main Couple is Bland Anna Kobayakawa and Typical Shoujo Girl Natsuki Hashiba. \\n\r\nAnna is a typical Mary Sue. She doesn't figure out her feelings for Natsuki until the last moment. She has little to no emotions; one of the four main characters even mentions her emotionless face. I rarely got to see her smile. I can deal with detached characters, but she really was empty. Her character had no depth. She was nice but in the way that everyone is nice. She works at a karaoke place. Other than that, I can't tell you a single one of her likes or traits. She was a boring character; that's it.\\n\r\nAnd Natsuki...sigh. He had real potential, you know? He could have been a heart-on-your-sleeve, comedic relief, lovable guy. What we got was less than average. He was more like the typical shoujo manga girl. As if the creators wanted to make him relatable to the females in the audience. I've met guys who have unrequited crushes on girls. They don't act like that. They're defensive at times and make jokes. Natsuki ended up being more of a squealing typical shoujo character. I liked that the main characters were guys crushing on girls; I thought that had real promise, but Natsuki ended up way too stereotypical for me to care about him.\\n\r\nAnd the romance between the two is innocent and kinda cute, but Anna takes way too many hints and throws them out of the window. It took way too long for the main romance to even become a thing in her eyes. Way too long.\\n\\n\r\nRead my full review here:\\n\r\nhttp://thelitaku.blogspot.com/2017/06/i-have-no-crush-on-nijiro-days-review.html",
            "date": "2017-06-16T16:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 250048,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3573547.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/wrenflyingaway",
                "username": "wrenflyingaway"
            },
            "url": "https://myanimelist.net/reviews.php?id=250048"
        },
        {
            "content": "Budget issues and the purpose of an anime can hinder it's meaning a lot and can affect the fanbase if an anime series as well. That's what the quite controversial sudden ending of Nijiiro Days brought upon us. I won't spoil it, but to some it was disappointing since it didn't give proper closure but to manga readers like me, it was perfectly fine and understandable, especially since the show was a low budget manga sales booster in the first place.\r\nYouthful and cute, Nijiiro Days is all about exploring and reminding people of how beautiful youth is and what better way to show it thanthrough the eyes of a high school group of friends and throw in some lovely romance in between as well? It's result? A super cute and fun to watch slice of life that just can't stop giving me these sweet moments. Since it's a slice of life the story was given less priority so it was quite understandable to see that little to no plot progression was seen as that's definitely not the focus of a slice of life. Apart from that it's plot scenarios were already seen before by many but were made even cuter by the amazing and cute characters. Since I'm repeating this a lot, I'll say it now itself and continue, Nijiiro Days is an anime that isn't the type which is serious and thick-headed. Nijiiro Days is an anime that you watch to relax and reminisce your youth if you're an adult or regret the fact that you didn't do anything in high school because you're too busy watching anime (ouch, that went personal). Nonetheless, Nijiiro Days is a cute and funny intake on the beauty of youth and is definitely worth the watch if you're looking for a nice slice of life to watch and enjoy and leave the show with a smile.\\n\\n\r\nWith that out of the way let's move on to the best the show has to offer: adorable characters. I've said this a lot before and I'll say it again: characters aren't just personalities, they give the show itself a personality and it's important that they are done well, which I'm happy to say was captured by Nijiiro Days perfectly. It had a Flustery non-dense MC for once which I felt was a breeze since romance anime nowadays are filled with dense MCs who don't know anything. This time the roles got pretty much reversed. Then we had a masochist (Matsunaga) and a Tsundere (Tsutsui?) who were adorable and hilarious to watch. Keichi got less focus on romance but he was a joy to watch, not to mention Nozomi who just so happens to be one of my favorite cutest characters from the show. She was adorbs! Everyone was!!! And did I forget to mention the best couple? Naoe and Yukirin were goals! I rarely use such Instagram-my language but I've got to say Nijiiro Days just brings it all out of you. \\n\\n\r\nIt wasn't just how amazing these characters were alone, what made them so awesome was that they all were intertwined so well in their interactions and the way they interacted was just so fun and at many times relatable to watch. I won't be surprised if my final score leads up to be my highest rated slice of life. It's just that good (said that twice now). Frankly I was surprised that Nijiiro Days had such amazing art with a low budget and so it felt doubly impressive. All the characters looked beautiful as well as vibrant. The color palette used was excellent since it was bright and fit in with the theme of youth perfectly and I'm sure the palette also fit in with your 4k monitor to you PC fans out there. Meanwhile Sonar Pocket did so well with both the OPs that its hard to imagine I still haven't downloaded their songs yet. I will definitely search for more of their songs now since their current selection for Nijiiro was so youthful and nostalgic. \\n\\n\r\nAfter seeing all this positivity and seeing no negativity you might guess I enjoyed this show to the max and yes you're absolutely right. Such slice of life anime are hard to come by so I was glad I came across the manga which ultimately led to me watching this beauty as well so it was all good. Yet questions remain. Why wasn't this full length? Why isn't the show getting a second season? Why did we get a non-closure ending? The reason for all three might lie in the fact that the show's budget was pretty less. Lesser than usual. Why? The purpose of the anime wasn't anything like other anime, the purpose of this anime in particular was to raise awareness and boost dropping manga sales for the manga and frankly the show helped the manga set it back on track and to be honest I couldn't be happier since this meant the show achieved it's target. Yes I do feel a slight regret we didn't get to see more but since I already read the manga there's no use fretting over it. Another possible reason why they didn't give the show an anime exclusive ending might as well be for the second season itself, since if they don't give closure that would mean they'd be able to do a season 2 soon but that seems unlikely since sequel seasons are hard to come by for slice of life anime simply because they don't need them to raise sales. Which is why I'm satisfied with what I have (still, I won't be forgiving them so easily in the story section). \\n\\n\r\nIn the end Nijiiro Days is an excellent testament to the slice of life genre and the spirit of friendship, youth and love itself. Its only downfall being the sudden ending Nijiiro Days checks a lot of the boxes which make it great and overall it's definitely worth a watch especially if you love slice of life like I do. So? Will you give the show a try? I don't see much loss since if you're watching for the cuteness and the laughs you won't be disappointed. And you could always read the manga if you wanted ;)\\n\\n\r\nOverall Rating: 9.0\\n\\n\r\nP.S: Tsutsui and Nozomi were basically the cutest characters!!! Tsutsui would have been better if she wasn't pissed all the time but Nozomi was so so cute! Especially when Keichi was around >.< As for Naoe and Yukirin they were the cutest couple ever. Natsuki and Anna were you could say juvenile? As for Matsunaga and Tsutsui all I can say is they looked like an old couple and were hilarious to watch. To the OVA we go!",
            "date": "2018-03-30T12:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 275759,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=275759"
        },
        {
            "content": "This anime just kinda makes you wanna go \"ah, youth.\" I'm really surprised I ended up liking it this much, actually. \r\nSo, as far as the art and sound go, I'd say it was pretty average. Honestly, there could've been some really awesome sound design done with this anime that wasn't 100% there, but I really don't get too picky about that sort of stuff, so it doesn't matter.\r\nThe story itself was decent. It was a little bit cliche, but I think that it was done well. I like that the story followed four romances (or beginnings of a few romances) without it being segmented.It wasn't like each character got their own set of episodes; it was all connected together like a normal story would be. I do think that the story was maybe a little too eager with the romance aspects because it felt like the characters fell in love a bit too quickly. I don't necessarily think it's a bad thing for characters to realize it quickly, but it still would've been nice to have a bit of lead-up for a couple of them. \\n\\n\r\nOkay, so characters. My motto is: give me a crappy story all you want, but you better give me dynamite characters. This anime pretty much delivered. Again, there are cliched character relationships and character personalities, but this anime presented them so well so that they seemed funny and interesting. Part of that is probably because every seiyuu is awesome, but I think a lot of it is also because you get to watch these characters be authentic. Also, the main girl isn't an idiot like a lot of main female characters are in romance anime. Not as in stupid, but as in someone who doesn't even know that romantic love is a thing that exists and they probably just blush when they're around a certain person because they have a cold. So, I'm happy that she isn't one of those because I would've been turned off right away. \\n\\n\r\nAll in all, it isn't a perfect story, but the characters especially made it comforting and peaceful to watch. I'd definitely recommend it, and now I'm gonna read the manga, because something tells me it's gonna be even better.",
            "date": "2019-03-31T21:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 305106,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=305106"
        },
        {
            "content": "This was one of the greatest shows I have ever watched, it had a great story, and it wasn't that rude, seriously I could go on and on about how great this show is but I must explain why I have wrote this review.\r\nI am quite annoyed that you would end the series like this, I mean are you going to make more or not, because this was just the worst ending ever, I mean sure the main character ends up loving the other main character, but the other main character doesn't know that, and so many people don't end up with the people thatthey have been crushing on the whole series. It is very annoying and there are so many cliffhangers and loose ends, it gets me really really annoyed, I loved the show so much but I hate that you would leave it on that note, it is so annoying and stupid, now please consider making more episodes and make them go for longer and as you can tell I am English so this just proves that people all around the world love your show sooooo much, so please please make more, just a few more episodes for all the shippings that everyone has had for every character, JUST FREAKING SOLVE THEM!",
            "date": "2016-08-20T10:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 227199,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ryan53321",
                "username": "Ryan53321"
            },
            "url": "https://myanimelist.net/reviews.php?id=227199"
        },
        {
            "content": "Nijiiro Days is anime based on shoujo manga\r\nFirst impression: At first, I thought this anime is homo (in MAL cover guy of all) the duration is only 13 minutes away. plus I do not like shoujo.\r\nBut because of the holidays, I'm in short of anime, so I tried it watching this anime (as I see in genre there have romance , I like anime romance, and the graphics do not disappoint) and then, in 5 episode,, the anime is not in line with my first impression: D\r\nAfter watch: Anime is not a fag in my opinion. for each of the main characters has their respectivespouses (female of course). moreover the point of view often to men (so similarto shounen even though the source is an anime shoujo) so even though I do not really like to watch shoujo, interest on watching it.\\n\r\nThe story is also not boring (every episode at least there is a scene of her romance) no Ntr so safe in heart. comedynya not so crisp. try it\\n\\n\r\nStory : 8/10\\n\r\ni like the love story on each character. comedy is not boring. Nijiiro's anime left the story on the end of chapter 24 on manga.\\n\r\nbut i bit dissapointed on the ending. \\n\\n\r\nArt : 9/10\\n\r\nThe Art on Nijiiro days anime as good as manga art. character graphic are smooth and interest to watch.\\n\\n\r\nSound: 7/10\\n\r\nDubber on this anime are : Eguchi takuya (hachiman oregairu), yoshitsugu matsuoka (Bell Danmachi) and many more. but i like kobayakawa anna voice, cute <3\\n\\n\r\nCharacter :8/10\\n\r\nThe character development are good. every main haracters has their respective spouses. and i still like the character graphic and of course, anna <3\\n\\n\r\nEnjoyment : 9/10\\n\r\nNijiiro days can bring me to watch 12 episode in one day (because it just 13 minutes per episode) and make me feel like fallen in love on the episode 19-24 :D\\n\\n\r\nOverall : 8/10\\n\r\nshould i recomend you to watch :\\n\r\nYes, if you love serious romance stories.\\n\\n\r\ni hope this review useful :D thankyou for reading",
            "date": "2016-06-28T03:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 222230,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5334233.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nakayo-kun",
                "username": "Nakayo-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=222230"
        },
        {
            "content": "The story revolved around a group of four students; the hopeless romantic guy Natsuki Hashiba (Natcchan), Tomoya Matsunaga (Mattsun) who is the playboy type, the cheerful and sadistic guy, Keiichi Katakura (Kei-chan) and Tsuyoshi Naoe (Tsuyopon), the one  with the least words and also the smartest in the group. This anime begins with the encounter of Natcchan with a girl named Anna Kobayakawa on Christmas eve. He fell in love at first sight and since then he tried to get closer to her. Together with the main plot, it also tells the love story of the other three and how they support each otheras a group of friends. Many had said, at first glance, people may think that this is a yaoi anime, but actually a comedy, slice of life and not to forget a normal romance.\\n\\n\r\nStory: \\n\r\nThis anime has been one of my choices whenever I am not in the mood for heavy theme. However, at some point it is too plain and predictable until it becomes a bit boring. The comedy seems natural, appropriate and not overly done.\\n\\n\r\nArt and animation:\\n\r\nThe arts are okay and acceptable. One thing that is worth mentioning here is the characters' hair color that are very stand out. This is to enhance the characters' personality. For example, mattsun's hair is red and it suits his personalities, a boy who is confident and popular while tsuyopon's hair is blue showing his reserve and calm character. All the ridiculous colorful hair serve as the mood lifter and strengthen the characters.\\n\\n\r\nsounds: \\n\r\nThe opening and the ending theme songs are not the 'ear-bugging' type but still enjoyable and reflecting the theme of the anime.\\n\\n\r\nCharacters: \\n\r\nThe strongest point of the anime is the characters. They are well defined and well developed from the very start of the series except for Anna. Anna seems emotionless rather than being shy and kind girl. A part from that, I love how different the characters are make from each other. They are all unique. To be honest, the most out-standing couple is mattsun and mari-chan. \\n\\n\r\nEnjoyment: \\n\r\nIn terms of enjoyment, the highest score that can be given is 7. As said previously, the story is too simple. The outcome of each of the conflict in the anime can also be predicted thus limiting the adrenaline rush. The love story however, is as sweet as a cherry pie and become the saviour of the series.\\n\\n\r\nOverall:\\n\r\nThe series is considered as fun if you are in relaxed mode. If ypu are looking for something that is fast paced and challenging, this is not the one for you. The overall score is 7. Many had said that the manga is better than the anime. This review however is solely based  on the anime thus comparison can't be made. \\n",
            "date": "2016-06-29T03:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 222329,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kennyssaa_cyrae",
                "username": "kennyssaa_cyrae"
            },
            "url": "https://myanimelist.net/reviews.php?id=222329"
        },
        {
            "content": "Shoujo romance.  The penultimate genre of romance where everything is sappy and the journey to love is a slow, arduous, and sometimes painful one.  So, what better way to give us everything that Shoujo romance has to offer in one series?  That my friends, is Niijiro days.  \r\nStory: Our story begins on Christmas Eve with Nat-chan, who is sitting under the town's giant christmas tree in disappointment.  After breaking up with his girlfriend due to her being a gold digger (This was never a part of the anime, but it's the context that gave way to the rest of theseries), Nat-chan is given a tissue by a passerby Santa girl with whom he falls smitten to.  This girl's name is Kobayakawa Anna, a girl of the same grade in the same school as Nat-chan, thus starting another season of romance.\\n\\n\r\nNiijiro Days is a very...complete kind of shoujo Romance.  (And yes, I am aware that doesn't make much sense, but keep reading.)  The main draw of the series is the fact that the show has not one, not two, not three, but FOUR different ships/romances that are going on at the same time with each of them pertaining to a different kind of romance that you would normally have with shoujo romances.  The show doesn't really have much beyond just focusing on these relationships, as the majority of the screentime is just the characters hanging out and/or attempting to get their love-saturated plotline moving at a snail's pace.\\n\\n\r\nWith this setup, there're a few problems that come into play.  For starters, because the show focuses on so many couples at once that the show only inches its way towards the inevitable conclusions without actually getting there.  (Not like we were actually going to get any endings, but my point still stands)  Second of all, the imbalance of screentime makes it so that some couples, particularly the main couple, gets more screentime than any other couple and as such we don't get to see everyone get as much attention as they should get.  These are really minor problems in the grand scheme of things, but they're still inherent issues that the series has.\\n\\n\r\nOverall, Niijiro Days is more or less every single shoujo trope smacked together into one show.  Its execution is inherently flawed due to the show being only technically a full-length one cour series due to each of its 24 episodes only being 13-15 minutes long and because the manga is still on-going and as of today, has not reached much of a conclusion either. Still, there's nothing particularly bad about this series despite it being somewhat generic in terms of what they're presenting for their story.   \\n\\n\r\nOverview:\\n\r\n+ Four distinct stories/couples to follow\\n\r\n+/-  Stories contain mainly shoujo tropes\\n\r\n-  Typical with many shoujo, no clear conclusion\\n\\n\r\nCharacters:  As mentioned before, the characters in Niijiro Days are split into four distinct couples, with each character more or less having a defined trait that makes up their character, usually opposite to their opposite sex counterpart.  As such, I'll be going over each relationship rather than each character.  (I will also be using the nicknames for the male characters rather than their ACTUAL names because hell, if the show does it, I will too.)\\n\\n\r\nFirst there's Nat-chan and Anna, the main couple of the series.  Nat-chan can be easily described as the 'shoujo heroine' type of character.  He acts very often like your typical shoujo heroine as he is this bright, energetic, and extremely easy to read character that doesn't have an evil bone in his body.  Anna on the other hand is a softspoken, mostly quiet individual who starts to open up as the series goes along.  This couple in particular soaks up most of the series's screentime and is the one relationship that the series tries to put together the most.  Despite that, the show doesn't really...do much to actually put them together.  Anna is a very oblivious character and is easily influenced to the point it's actually quite dangerous to leave her alone due to how easily she could be picked up, and Nat-chan is very shy and flustered about his own feelings to the point that he can't confess and most of his attempts crash and burn.  They're pretty typical in terms of generic shoujo romances, so as a relationship, they're not really all that progressive or unique.\\n\\n\r\nThen there's Mat-tsun and Mari, the secondary couple of the series.  Mat-tsun is a playboy type character while Mari is Tsun.  No dere, just tsun.  (Her last name is Tsutsui, but I think it should be Tsuntsun instead).  These two...are somewhat aggravating if I'll be completely honest.  Particularly Mari.  The majority of their 'relationship' is more or less a game of cat and mouse, where Mat-tsun tries to chase down the annoying and shrill tsun child without really getting any results.  They have a few episodes that are devoted to them and their relationship, but similar to most of the other couples, the end result doesn't really prove to be in any way progressional.  In fact, Mari exists more as an obstacle to the series if anything.  Her characteristics are of being this man hating girl who solely just wants Anna to stay by her side and no one else, constantly complaining if someone 'takes her away' and for the majority of the series, despising the idea of the male characters even coming into the picuture.\\n\\n\r\nThen there's Kei-kun and Nozomi.  Kei-kun is a sadist who carries a whip around with him because hey why not?  While Nozomi is Mat-tsun's younger sister who is quite literally the definition of lovesick.  This couple probably gets the least amount of attention out of everyone.  Hell, they get the least amount of screentime compared to everyone else.  The brunt of their relationship is the girl chasing the guy while also playing the waiting game due to Nozomi's dedication despite getting rejected.  There's not really much to say about them and this just shows how unbalanced the show is in the way of exploring these individual romantic relationships.\\n\\n\r\nAnd finally we have the one OTP that actually exists in the series, Tsuyoponnu and Yukirin.  As the gaming/otaku couple of the group, these are the only two characters that actually are dating.  (Ya gotta cover all bases)  Their screentime is mostly devoted to starting some plotlines as well as giving advice to some of the other couples because well, they're the successful ones.  Aside from that, they have their fair share of lovey dovey moments and that's pretty much their purpose in the series.  They're a cute couple but since they've already 'succeeded', there's not really much else the series could do for them.\\n\\n\r\nSide characters are practically non-existent.  The few that are in the series fade away very quickly and only show up for 1 episode, maybe 2 max.  As such, there's nothing to really say for the side characters good or bad, so we're moving on.\\n\\n\r\nOverview:\\n\r\n+ Some unique couples\\n\r\n+ Couples showcase different forms of romance (Or stages)\\n\r\n-  Some generic couples\\n\r\n-  Side characters are worthless\\n\\n\r\nArt: Made by Production Reed, the animation for Niijiro days is a rather standard form of animation that doesn't particularly stand out.  The quality is good, the colors are bright and colorful, but there's nothing particularly unique about it.  \\n\\n\r\nThe show's comedic stylings are more geared towards the comedic face changes to show exaggeration or any other emotion, which is mainly used just to show us the kinds of feelings or tension that are going on at the moment.  They're not overused so that's a good thing.\\n\\n\r\nOverview:\\n\r\n+ Good quality art\\n\r\n+ No overuse of its comedic artwork\\n\\n\r\nSound: The tracks for Niijiro...they're not really all that special.  The tracks for the 2 OPs and EDs of the series are songs sung by the four main male characters that actually don't have much merit to them.  They sound so bland and uninspiring that it wasn't really worth listening to.  \\n\\n\r\nIn addition...Uchiyama Yumi, Tsutsui Mari's seiyuu, did a very...annoyingly good job at playing her character.  I have to point this out specifically because her performance is so annoyingly good that my distaste towards this character only elevated.  Just this shrill, ear-piercing voice shouting \"Anna!\" is a performance I have to commend despite my negativity towards this character.\\n\\n\r\nOverview:\\n\r\n+/- That annoyingly good tsundere performance\\n\r\n-  Soundtrack was rather generic\\n\\n\r\nPersonal Enjoyment: Niijiro was a shoujo romance that peaked my interest.  I mostly thought when I first saw it that it was gonna revolve around only one guy trying to get his romance going while his friends poked him and laughed at him for his attempts.  Bit mean, I admit, but that's what I thought before I read the manga and started to watch this show.  Niijiro is a series that I don't particularly hate, but at the same time, there's nothing about it that remotely screams originality or interesting.\\n\\n\r\nDid I like this series?\\n\\n\r\nIt was fine.  Nothing really stood out about it and I don't really hate much of what they did.  I went into this expecting to have no progress, and as expected, nothing except maybe the spark actually occurred.  I also find Nozomi to be a very...interesting character.  \\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nMari.  Mari is by far the most irritating character in this entire show and I will not stand to have her shout Anna in my ears anymore.  There's nothing even cute about her because she always seems uncomfortable with the current situation and that there's always a stick up her ass.  \\n\\n\r\nWould I recommend this series?\\n\\n\r\nNiijiro Days isn't really all that special in comparison to other shoujo romances.  Its only draw comes from the fact that the show has 4 couples so you don't have to just root for one.  Aside from that, there's nothing unique or special about it.  So if you're looking for a shoujo romance, then this is worth a pick up.  If not, then I would suggest to not watch this.",
            "date": "2016-06-26T15:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 222078,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=222078"
        },
        {
            "content": "\"Rainbow Days\" is one of those candy animes for people who like just a little bit of relationship drama and realism, but don't really want a soap opera or gritty drama. As seems to be the trend with shoujos, the main characters are boys, in this case four close friends who avoid club activities. All of them are in varying stages of dating (or trying to date) their respective girlfriend, and they help (or tease) each other as they go through their trials and tribulations. That's pretty much the entire anime, some people will obviously not want anything to do with it, but it doeshave a certain appeal to many of us.\\n\\n\r\nIt will not win any originality award, but at the same time it is not just one cliche after the other, the main characters all have distinct personalities and some are a bit fresh. They go through many of the relationship anime standard plot devices but don't really dwell too much on generic drama like the cocky rival love interest who appears just as things were starting to go okay for the main couple. Mostly each episode is a little romp at the usual places - karaoke bar, the beach, the hot springs hotel, etc.\\n\\n\r\nIt actually works pretty well with the short format, although I found myself getting behind on purpose and enjoying it a lot more to watch several of these in one session. Since it's such a breezy show it's hard to maintain your concern over the romantic cliffhangers for an entire week sometimes. \\n\\n\r\nThe characters are not hyper-realistic but they're not cartoon version of high schoolers that you can't relate to at all. When the guys learn their buddy's girlfriend's pet name for him and tease him for the rest of the series about it, or when the thorny Mari-chan makes her many appearances to disrupt the easy-going flow of the other characters, this is all stuff that can fondly remind me of my own \"rainbow days\". \\n\\n\r\nShorts always get under-rated on MAL for some reason, I really think if you like fun (but not silly) relationship drama animes, this is a must watch even despite the rating and it being shorts.",
            "date": "2016-06-15T07:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 220808,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/doc_awesome",
                "username": "doc_awesome"
            },
            "url": "https://myanimelist.net/reviews.php?id=220808"
        },
        {
            "content": "Nijiiro Days was basically any romance anime you've ever seen, except the episodes literally last 10 minutes - which is kind of annoying to have to constantly switch episodes if you're binging it like I did (at least it's not Sweet Love Patisserie with five minute content), but on the better side, there's 24 episodes, making it last just as long as any other 20 minute series with 12 episodes. \r\nMoving aside from the episode length, we should begin with the story. Like any other synopsis will give, the series begins with high school student Natsuki Hashiba heartbroken from a harsh parting from his exon Christmas night, along with his love interest Anna Kobayakawa coming to his aid. Soon after, Natsuki discovers she goes to her school and a romance \"blossoms\". I don't have too much to say about this beginning aside from it's clicheness being kind of tacky but not the worst I've seen.\\n\\n\r\nLater on in the series, each of Natsuki's three best friends end up getting paired with other girls, and the eight of them end up becoming good friends. It was pretty coincidental it ended up like that, though - four guys, and four girls to match. (One of the pairs was already a couple before this happened though.)\\n\\n\r\nEach character was unique and I enjoyed seeing the variety in the friend group; there was everything from a frantic cosplayer, to an accused sister complex. It was interesting, to say the least.\\n\\n\r\n(slight spoilers)\\n\r\nOne character I will comment on would definitely be Anna. \\n\\n\r\nI get that she's supposed to be really quiet and shy, but aside from this, she has 0 personality, which made me upset because Natsuki was such a great character who fell in love with such a mundane girl, which lead to me not caring an ounce about their relationship. They managed to get Tsuyoshi (another shy character) to be really intriguing because of his feelings toward Yukirin (his girlfriend), so why didn't they just add more emotion in her dialogue? I get she's to \"discover her feelings\" or whatever, but she became boring. I didn't even focus on the main couple because of this. What the fuck?\\n\\n\r\nIt really got my hopes up to see the four pairs get put together, but because of Anna eating up all the screentime with \"whY Do I feEl tHIs WaY?\" none of the relationships actually went anywhere. \\n\\n\r\nSpeaking of, the art and sound were all generic. Nothing jumped out to me, and it was the same as any other anime. I only kept going because of how adorable and good the characters were; they were what saved the show.\\n\r\nThis series could've been really enjoyable, but instead was boringly average. Overall, Nijiiro Days is not a bad show - yet, it is far from good. It did the purpose of any other anime, to entertain.",
            "date": "2018-12-31T15:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 297617,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7678344.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/felnorii",
                "username": "felnorii"
            },
            "url": "https://myanimelist.net/reviews.php?id=297617"
        },
        {
            "content": "What's my problem with Nijiro Days? I'll tell you what...\r\nTHE FUCKING EPISODE LENGTH. I mean come on, twelve minutes episodes, what sort of bullshit is this?\r\nWell whatever, let me get to the review. Nijiro Days is a shoujo anime and I can tell you it does it's job well. However I particularly hated the ending of Nijiro Days and I think that if the makers had made the episodes the full length, and actually FINISHED the story instead of leaving it halfway completed, I think Nijiro Days could've been a masterpiece. All things said let me get to what I enjoyed about this anime. \r\nThestory, the story truly is an incredibly good one. For one reason, the story is incredibly realistic and believable. The story has the right amount of melodrama mixed into it and realism as well. I particularly enjoyed the story and I seriously think that this anime deserves a season 2 to serve justice to the characters. \\n\\n\r\nThe artwork is also particularly clean and pleasant to look at, a typical shoujo manga style of art and the characters look well composed. The animation is a bit below par but it still looks good. I like the fact at how the stories of the characters are intertwined and how each character's love life fits in with everybody else's. Not like the characters are in separate worlds. The story does feel like a classic school shoujo romance. Overall I certainly did enjoy it quite a bit. \\n\\n\r\nNow time for the downsides, one thing I did not like about this anime was the fact that they tried splitting four love lives among the duration of about 280 minutes of viewing time. There wasn't nearly enough time to fully bond with the individual characters even though many of the scenes constituted multiple individuals. The character's backstories literally don't exist and the characters do not experience much development. The only character where I saw appreciable development was with the heroine Anna Kobayakawa, she develops beautifully through the anime.\\n\\n\r\nThe art in my opinion like I said was good but I feel like it was a bit too cartoony. The animation could've been done better. \\n\\n\r\nThe music is my problem, the music doesn't portray the motions effectively throughout the anime which I feel is a huge problem as music is incredibly important to set the tone of a scene. \\n\\n\r\nOverall, this anime has it's problems and I would rate it somewhere around 7.6-7.8. Overall I feel like this anime is a very satisfying watch for shoujo anime lovers and it's a great anime to watch in your spare time. Every episode is short which is convenient and you'll practically fall in love with the heroine. She's kawaii.",
            "date": "2018-09-05T07:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 288165,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ABDoesThings",
                "username": "ABDoesThings"
            },
            "url": "https://myanimelist.net/reviews.php?id=288165"
        },
        {
            "content": "Wow! This series is amazing. I'll be honest with you all I found about it when this years spring anime have ended and I was kind of sad because there was nothing new for me to watch. Somehow I missed this gem and now I'm really happy to say that this was one of best binge-watches in my life! \r\nStory can look simple and easy but characters are bringing the joy and fun. This is great mix of different personalities and we've got here what we love most. School, love, friendship, good days, bad days, happiness and sadness. It's all here and it's all wellpacked making Nijiiro Days totally great slice of life anime. I hope it will get more recognition and will be rated even higher.",
            "date": "2018-06-25T13:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 282206,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6677471.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/junmisugi",
                "username": "junmisugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=282206"
        },
        {
            "content": "First of all let me say that i personally really enjoyed watching it.\r\nNow then let's get into the review. This anime is short, and honestly it crams so much stuff into it and it turns out really good. The characters are interesting and likeable. The story is kind of there but it's mostly like everyday life in school so don't expect some next level drama, romance story where s**t is about to go down. This is one of those anime where you watch it for the sole purpose of being entertained.\r\nOver all i rated the story 6, it's there but it's not really something.\r\nArt get'sa solid 7 since it's quite nice.\\n\r\nSound get's a bare 6 it's not really the strong point of this anime.\\n\r\nCharacters get an 8 i really liked them.\\n\r\nEnjoyment get's a 9 from me, i really killed it in one day :D.\\n\r\nOverall a 7 if you are into spending some time for a school like romance buddy entertainment.",
            "date": "2018-03-05T05:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 273078,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4999571.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nisekoichitoge",
                "username": "nisekoichitoge"
            },
            "url": "https://myanimelist.net/reviews.php?id=273078"
        },
        {
            "content": "I have to admit I thought this anime was going to suck but I was wrong. I REALLY liked it. It's a very chill show. Just your average high school kids going to school and hanging out with friends. Each character has their own quirk which makes them interesting. My favorite was Keiichi Katakura though. He was hilarious and made the show ten times better. \r\nHowever, there were two things that I didn't like. \r\n1.) I didn't like Anna Kobayakawa which is the main girl in the show. She was so bland and boring. Sure, she was sweet but she has no personality. Just plainand dull. Her voice even made me sleepy. That's how boring she was. I still don't get why Natsuki was so into her. \\n\\n\r\n2.) I didn't like the ending. I mean seriously IT WAS SO BAD. It just made no sense. However, you should still watch the show because it's still good. Although the ending might piss you off so beware!\\n\\n\r\nOVERALL, \\n\\n\r\nThere's no big plot so if that's what you're looking for then don't watch this. Each episode is ten minutes which kind of sucks. It's still a fun show and I do recommend it if you're looking for a funny romantic show.",
            "date": "2018-01-22T21:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 269391,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919522.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JoyJoyJoy",
                "username": "JoyJoyJoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=269391"
        },
        {
            "content": "DOES NOT INCLUDE ANY LIFECHANGING SPOILERS, THEY ARE PRETTY OBVIOUS\r\nWhy I didn't like it that much: This is a very relaxing anime, nothing much happens, but come on! The ending is so unsatisfying! And every episode end is a total cliffhanger. \r\nBut I liked it because it didn't have any violence or nudity. Very family friendly and even a 7 year old (actually it depends on the person watching) can watch it if some situations or actions by some characters are explained. Also I feel like there are some stereotypes but I'm not 100% sure...\r\nRecommend for people who want to watch something \"easy\" or don'twant any nudity or violence. (Excluding some characters being a little creepy and such but basically every other kids cartoon has these moments. I also want to add that most of the time characters are acting nice and caring).\\n\\n\r\nIn my opinion, my every male classmate (sorry but they are in this age) should watch this, because it gives a good examlpe how a gentelman should act towards girls. (Except some scenes by some certain characters but the scenes are only like 5 minutes in the whole anime. (Girls? Not so much))\\n\\n\r\nI apologize if you read this and you totally disagree with everything, but this is how I see it.",
            "date": "2016-07-15T11:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 224104,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493985.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/B-FOUR",
                "username": "B-FOUR"
            },
            "url": "https://myanimelist.net/reviews.php?id=224104"
        },
        {
            "content": "The story was nothing too complicated and not so much annoying drama, which is great. It's not a slice of life but more to romance and friendship, and I like it especially the bond between the boys. The art is simple and okay. But, I love the soundtrack the most, well I don't expect less from Sonar Pocket, I like their song as always :)\r\nCharacters are great, they've got simple personalities with not too much complicated going on within themselves. I like how they are honest with others and themselves. Just for that one character, if this anime/manga doesn't have that annoying-disturbing girl (why authorloves to put this kind of personality?), I would give 8/9 for character wise.\\n\\n\r\nI like this anime a lot, because it's easy to watch, and relaxing to get a rest from many intense-themed anime. I recommend this anime because this anime is simple and comforting. Though the ending could be better, but I hope that's just because they'll give another season? If not, then.. go read the manga, even though it's not ending yet.",
            "date": "2016-07-07T00:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 223363,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3205263.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/babiettangkoma",
                "username": "babiettangkoma"
            },
            "url": "https://myanimelist.net/reviews.php?id=223363"
        }
    ],
    [
        {
            "content": "This is one of those series that finish so fast once you start watching, because it is just so relaxing and nothing too serious happens, which also makes it so relatable and reminiscent of our high school days (well, for those that have graduated at least!) or how it could be. If you are looking for an easy-going series filled with the power of youth, this is a good example.\r\nStory-wise, there is nothing specific as it is their everyday life, but the overall feel is focused on the romance part; 4 friends who tease each other and their romantic interests. We see everyone’s view (notjust the main quartet) and how they interact and the silly problems they have that seem huge at the time and the silly adventures they take part in and various small parts of their personality. Is it that great? No, it is not, but that does not mean it is not enjoyable. It provides sufficient pleasure and comfort when watching, since it is doing a good job at keeping it simple and not overdoing it most of the time. It is a slice of life work through and through and it does not have enough time to get tiring, thankfully. Comedy is of course also present, but it blends in with romance pretty well, without trying too hard as everything seem realistic enough for an ideal high school life!\\n\\n\r\nEveryone has pretty distinct personalities and most of them are so adorable, but most of all at least half of them are relatable to a good degree if we just minimize their dominant trait a bit. There is the sadistic friend (but who does not have one, really?), the naïve and so transparent friend, the playboy and the silent, aloof guy whose traits do not stop him from having a great time. The girls have their own distinct traits too, but one specific girl, the violent one, sticks out for being the worst. While everyone seems to have their own pretty much normal circumstances, she is just very obsessed and screaming all the time without any sufficient character background or development, unlike the rest who may not be developing all that much either, but they do not really need to as they fit in the story just fine.\\n\\n\r\nThe art is nothing too complicated; very simple drawings, but with many many colors and although generally it can be considered generic, the characters were easily recognizable. The hair aspect is the one true point that makes this so unrealistic, considering one could have purple or fuchsia hair, but there is nothing too extreme on hairstyles to put off someone. Animation is pretty decent, since there are not many scenes demanding of special attention. The sound is also good enough with catchy soundtracks and the voice actors did a decent enough job (that good that I wanted to hit the violent girl with so much screaming), but nothing memorable. It is just one of these series you will watch and like for their art and sound, but forget the next day.\\n\\n\r\nAll in all, if you are looking for an easy watch, this is a great choice and although there is no definite ending which can make you want more right then, it still manages to fulfill its goal. I liked it enough and it may not be an original story, but it is one of those that do not tire you out at all and could continue for a good while, as long as it does not start repeating itself.",
            "date": "2016-06-26T12:21:00+00:00",
            "helpful_count": 46,
            "mal_id": 222056,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5352.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Maffy",
                "username": "Maffy"
            },
            "url": "https://myanimelist.net/reviews.php?id=222056"
        },
        {
            "content": "At first glance, one would think that this is a yaoi anime, but even without the \"shounen-ai\" tag, it's not. It's one of those rare romance anime where the main characters are the same gender, but the romance is heterosexual. When I first saw this anime, I thought probably the same thing as anyone else who was unfamiliar with this anime before it aired, \"This is going to be another borderline-yaoi anime, is it?\" Then, I read the description, and my curiosity was piqued. For that reason, I ended up watching it when it premiered, and I must say that it was a fun animeto watch.\\n\\n\r\nLadies and gentlemen, here is my review of \"Nijiiro Days\".\\n\\n\r\nNijiiro Days follows four high school boys, Natsuki Hashiba, Tomoya Matsunaga, Keiichi Katakura, and Tsuyoshi Naoe, as they go through their high school lives. One Christmas Eve, Natsuki gets dumped by his girlfriend, and as he is crying about it, he is handed some tissues by a girl wearing a Santa outfit; at that moment, he falls for that girl. He later runs into the girl, Anna Kobayakawa, at school, and he tries to get closer to her while his friends try to meddle in their relationship. Every once in a while, the focus shifts from Natsuki to one of the other three boys as they deal with their own love-related problems; Mari Tsutsui is Anna's man-hating best friend who Tomoya ends up liking, Nozomi Matsunaga is Tomoya's younger sister who has feelings for Keiichi (while Tomoya does not approve), and Yukiko Asai is Tsuyoshi's cosplaying girlfriend.\\n\\n\r\nIt's a rather easygoing story with comedic moments sprinkled in here and there. It's really a breath of fresh air, though; after all, all of the main characters are male, but since all of their love interests are female, there is no way one can consider this a \"borderline-yaoi\" anime at all. Luckily, these heterosexual relationships are, for the most part, believable. The one exception may be the one between Tomoya and Mari; I honestly felt more \"hate\" than \"love\" in their relationship, but at the very least, it was given a bit of development. I really liked Natsuki and Anna's relationship, though; it was fun to watch as their relationship grew. However, I really would have liked some more development on the relationships between Keiichi and Nozomi and Tsuyoshi and Yukirin; however, I guess what we get is what we have. (Hopefully, there is more development to those two relationships in the manga....)\\n\\n\r\nThe animation, done by Production Reed, wasn't anything too ground-breaking, but for an anime as simple as this one, it's more than acceptable. It definitely had bright colors, and with a title that translates to \"Rainbow Days\", I think that fits quite well. As for the voice acting, the voice actors did a great job with their respective characters. The music was also great, too; I liked every single one of the opening and ending themes. The best one, however, was the third ending theme, \"'I Wanna Be Your Knight\" by Takuya Eguchi, Tomoya's voice actor; it just sounds so cool with an amazing singer to boot!\\n\\n\r\nOverall, Nijiiro Days was a good anime. If you're in the mood for an easygoing slice-of-life anime with romance sprinkled in, this is the anime for you. These rainbow-colored days cannot be forgotten about!",
            "date": "2016-06-26T10:25:00+00:00",
            "helpful_count": 25,
            "mal_id": 222041,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=222041"
        },
        {
            "content": "Prewarning: If you want something intellectually challenging, or awe-inspiring, this isn't for you. If you don't mind stereotypical plots, a bit of laughter, and are looking for something simple to watch and not think too much about: Sure, go watch this, knock yourself out and have some fun fawning over cute characters.\r\nI really enjoyed this show at the start, and had it ended after one cour I'd probably have given it an 8. To begin with the characters are fun and there was no major drama. Sure it played on typical relationships and character types, but in a light-hearted and happy-go-lucky manner. What was alsogreat was how the story looked into the side characters almost as much as the main... The art is cute, sound is appropriate but nothing inspiring, characters are fun and fairly simple. It was a great de-stress anime. Unfortunately, the anime seriously flat lined towards the end. The last few episodes were over-dramatic, uncalled for, and seriously boring as the heroine struggles to find her own emotions in an unrealistically lengthy manner. Side characters lose their screen time and it ends up being lengthy, repetitive monologues with a tag line of 'I don't know what to do' 'I am so confused'. The ending lacks climax and denounment, I've heard this is getting a second season but honestly if they'd just put some work into the last 3 or 4 episodes it could have been a perfect stand-alone anime.",
            "date": "2016-06-28T05:32:00+00:00",
            "helpful_count": 17,
            "mal_id": 222240,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/916849.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CherryChan98",
                "username": "CherryChan98"
            },
            "url": "https://myanimelist.net/reviews.php?id=222240"
        },
        {
            "content": "What Norn9: Norn+Nonet couldn't do, Nijiro Days did better with LESS screentime, ohh well ok nearly the same screentime but whatever.\r\nNijiro Days being an anime short consisting of 24 episodes with only 10 minutes is about the 4 differing relationships of the four main boys of the anime short. As such LA is very thankful that this anime short has this kind of screentime let alone episode count as it would have been rushed to all hell, nonetheless due to this the majority of the relationships go in depth to.\r\nThough LA says this, the majority of the focus goes to Natsuki \"Na-chan\" Hashiba voiced byYoshitsugu Matsuoka and Anna Kobayakawa voiced by Minami Tsuda's relationship from friends to a couple. The other closest relationship with this kind of focus goes to the incredibly shaky relationship of Tomoya \"Mat-tsun\" Matsunaga voiced by Takuya Eguchi and Anna's best friend Mari Tsutsui voiced by Yumi Uchiyama. Unfortunately the other two relationships of Yukiko Asai voiced by Shizuka Ishigami and Tsuyoshi \"Tsuyo-pon\" Naoe voiced by Kouki Uchiyama as well as Keiichi \"Kei-chan\" Katakura voiced by Nobunaga Shimazaki and Tomoya's little sister, Nozomi Matsunaga voiced by Ai Kayano gets *ahem* pushed aside for the other two more focused relationships and are more or less B plot relationships with Tsuyoshi and Yukiko's relationship was already formed before the anime thus didn't have enough meat and Keiichi and Nozomi's relationship started rather late to get a proper focus respectively. LA's favourite relationship oddly enough however goes to Tomoya and Mari's relationship, yes LA could say that Mari's constant bickering to Tomoya got annoying rather quickly but their development helped a bit more especially with Mari's defrosting and deredere moments.\\n\\n\r\nThe animation by Production Reed at best is above average for an anime short and LA had really no problem with the animation at all.\\n\\n\r\nVoice acting wise, there was an annoying voice acting mainly from Yumi Uchiyama who voiced Mari but she got better over time (away from her bitchy vocals anyways), however LA's favourite voice actor in Nijiro Days would actually be Shizuka Ishigami who voiced Yukiko and really LA wanted to see more of Yukiko but again for her character' circumstances, LA could see why she couldn't.\\n\\n\r\nThe ending for Nijro Days gave us something of an \"ok\" ending as the entire focus for the final few episodes went to Anna Kobayakawa's revelation about her relationship to Hashiba and really it's the typical \"can't spit it out\" by the end of the anime, ohh Anna finally gets her revelation about her growth to her relationship to Hashiba but she just doesn't take the move to grow it even further, nonetheless, the sentiment was nice, the ending also the narrow focus, all the other relationships are put in limbo to give the focus to the main couple of Hashiba and Anna, it's a bit of compensation at least but LA wished the focus was split a bit more to the rest of cast and their relationship. The ending is really a double-edged sword but LA overall was slightly satisfied with this ending.\\n\\n\r\nNijiro Days is a great romance anime short to the anime short medium that looks at many stages of a relationship with lots of growth to the multiple relational developments, sure the focus tends to go to Mari and Tomoya and especially Anna and Hashiba while the other two relationships turned into a pseudo-growth/supporting characters to the above relationships. Nonetheless Nijiro Days is a soft-fluffy puppy-love anime short with some good payoff of relationship growth here and there.",
            "date": "2016-06-26T17:32:00+00:00",
            "helpful_count": 17,
            "mal_id": 222090,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=222090"
        },
        {
            "content": "True definition of a rom-com, that portrays amazingly what friendship between guys is.\r\n                         Story 8 I Art 8 I Sound 8 I Character 9 I Enjoyment 8 I Overall: 8\r\nWhats good about this anime?\r\n+Amazing chemistry among characters, this aspect of the show is just amazing how even though the main characters are really different from each other they feel so close, just amazing.\r\n+Good Art style, not kyoto animation kind of art but beautiful when ithas to be.\\n\\n\r\n+A rom-com thats actually funny\\n\\n\r\n+Voice Actors are just perfect in this anime, really good cast\\n\\n\r\nWhats bad?\\n\\n\r\n-Dont expect to much story from it, it started really good with the first episodes, then it turns okay\\n\\n\r\n- Heroine was just meh, I mean it was just right but it could ve been better\\n\\n\r\nSo I reccommend this series if you are looking for a heartwarming love and comedy experience, don't expect it to be intelectually challanging or difficult plots, its just what it is, a lighthearted rom-com, \\n\\n\r\nBest aspect of this show are the characters, they carried all the kind of cliche story and make it actually really good\\n\\n\\n\\n\\n",
            "date": "2018-02-11T21:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 271320,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6538337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/netosolano98",
                "username": "netosolano98"
            },
            "url": "https://myanimelist.net/reviews.php?id=271320"
        },
        {
            "content": "Nijiro Days is as fulfilling as watching someone else eat delicious cake. It's taunting you with something amazing, something that you could have. But ultimately you're let down.\r\nThis anime had so many problems. I can't help but get angry because of it. On the surface, it's a quick, fluffy romance anime with male leads instead of female ones. This is a unique twist on the shoujo romance genre, but this twist is wasted on Nijiro Days. This is no better than a boring shoujo with female leads.\r\nMy major problem with the series is the characters. They are a lackluster, meaningless cast, and I felt noattachment to any of them, even though I've gone through the hardships of crushes and unrequited love before.\\n\\n\r\nLet's go down the list of couples, analyzing each.\\n\\n\r\nThe Main Couple is Bland Anna Kobayakawa and Typical Shoujo Girl Natsuki Hashiba. \\n\r\nAnna is a typical Mary Sue. She doesn't figure out her feelings for Natsuki until the last moment. She has little to no emotions; one of the four main characters even mentions her emotionless face. I rarely got to see her smile. I can deal with detached characters, but she really was empty. Her character had no depth. She was nice but in the way that everyone is nice. She works at a karaoke place. Other than that, I can't tell you a single one of her likes or traits. She was a boring character; that's it.\\n\r\nAnd Natsuki...sigh. He had real potential, you know? He could have been a heart-on-your-sleeve, comedic relief, lovable guy. What we got was less than average. He was more like the typical shoujo manga girl. As if the creators wanted to make him relatable to the females in the audience. I've met guys who have unrequited crushes on girls. They don't act like that. They're defensive at times and make jokes. Natsuki ended up being more of a squealing typical shoujo character. I liked that the main characters were guys crushing on girls; I thought that had real promise, but Natsuki ended up way too stereotypical for me to care about him.\\n\r\nAnd the romance between the two is innocent and kinda cute, but Anna takes way too many hints and throws them out of the window. It took way too long for the main romance to even become a thing in her eyes. Way too long.\\n\\n\r\nRead my full review here:\\n\r\nhttp://thelitaku.blogspot.com/2017/06/i-have-no-crush-on-nijiro-days-review.html",
            "date": "2017-06-16T16:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 250048,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3573547.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/wrenflyingaway",
                "username": "wrenflyingaway"
            },
            "url": "https://myanimelist.net/reviews.php?id=250048"
        },
        {
            "content": "Budget issues and the purpose of an anime can hinder it's meaning a lot and can affect the fanbase if an anime series as well. That's what the quite controversial sudden ending of Nijiiro Days brought upon us. I won't spoil it, but to some it was disappointing since it didn't give proper closure but to manga readers like me, it was perfectly fine and understandable, especially since the show was a low budget manga sales booster in the first place.\r\nYouthful and cute, Nijiiro Days is all about exploring and reminding people of how beautiful youth is and what better way to show it thanthrough the eyes of a high school group of friends and throw in some lovely romance in between as well? It's result? A super cute and fun to watch slice of life that just can't stop giving me these sweet moments. Since it's a slice of life the story was given less priority so it was quite understandable to see that little to no plot progression was seen as that's definitely not the focus of a slice of life. Apart from that it's plot scenarios were already seen before by many but were made even cuter by the amazing and cute characters. Since I'm repeating this a lot, I'll say it now itself and continue, Nijiiro Days is an anime that isn't the type which is serious and thick-headed. Nijiiro Days is an anime that you watch to relax and reminisce your youth if you're an adult or regret the fact that you didn't do anything in high school because you're too busy watching anime (ouch, that went personal). Nonetheless, Nijiiro Days is a cute and funny intake on the beauty of youth and is definitely worth the watch if you're looking for a nice slice of life to watch and enjoy and leave the show with a smile.\\n\\n\r\nWith that out of the way let's move on to the best the show has to offer: adorable characters. I've said this a lot before and I'll say it again: characters aren't just personalities, they give the show itself a personality and it's important that they are done well, which I'm happy to say was captured by Nijiiro Days perfectly. It had a Flustery non-dense MC for once which I felt was a breeze since romance anime nowadays are filled with dense MCs who don't know anything. This time the roles got pretty much reversed. Then we had a masochist (Matsunaga) and a Tsundere (Tsutsui?) who were adorable and hilarious to watch. Keichi got less focus on romance but he was a joy to watch, not to mention Nozomi who just so happens to be one of my favorite cutest characters from the show. She was adorbs! Everyone was!!! And did I forget to mention the best couple? Naoe and Yukirin were goals! I rarely use such Instagram-my language but I've got to say Nijiiro Days just brings it all out of you. \\n\\n\r\nIt wasn't just how amazing these characters were alone, what made them so awesome was that they all were intertwined so well in their interactions and the way they interacted was just so fun and at many times relatable to watch. I won't be surprised if my final score leads up to be my highest rated slice of life. It's just that good (said that twice now). Frankly I was surprised that Nijiiro Days had such amazing art with a low budget and so it felt doubly impressive. All the characters looked beautiful as well as vibrant. The color palette used was excellent since it was bright and fit in with the theme of youth perfectly and I'm sure the palette also fit in with your 4k monitor to you PC fans out there. Meanwhile Sonar Pocket did so well with both the OPs that its hard to imagine I still haven't downloaded their songs yet. I will definitely search for more of their songs now since their current selection for Nijiiro was so youthful and nostalgic. \\n\\n\r\nAfter seeing all this positivity and seeing no negativity you might guess I enjoyed this show to the max and yes you're absolutely right. Such slice of life anime are hard to come by so I was glad I came across the manga which ultimately led to me watching this beauty as well so it was all good. Yet questions remain. Why wasn't this full length? Why isn't the show getting a second season? Why did we get a non-closure ending? The reason for all three might lie in the fact that the show's budget was pretty less. Lesser than usual. Why? The purpose of the anime wasn't anything like other anime, the purpose of this anime in particular was to raise awareness and boost dropping manga sales for the manga and frankly the show helped the manga set it back on track and to be honest I couldn't be happier since this meant the show achieved it's target. Yes I do feel a slight regret we didn't get to see more but since I already read the manga there's no use fretting over it. Another possible reason why they didn't give the show an anime exclusive ending might as well be for the second season itself, since if they don't give closure that would mean they'd be able to do a season 2 soon but that seems unlikely since sequel seasons are hard to come by for slice of life anime simply because they don't need them to raise sales. Which is why I'm satisfied with what I have (still, I won't be forgiving them so easily in the story section). \\n\\n\r\nIn the end Nijiiro Days is an excellent testament to the slice of life genre and the spirit of friendship, youth and love itself. Its only downfall being the sudden ending Nijiiro Days checks a lot of the boxes which make it great and overall it's definitely worth a watch especially if you love slice of life like I do. So? Will you give the show a try? I don't see much loss since if you're watching for the cuteness and the laughs you won't be disappointed. And you could always read the manga if you wanted ;)\\n\\n\r\nOverall Rating: 9.0\\n\\n\r\nP.S: Tsutsui and Nozomi were basically the cutest characters!!! Tsutsui would have been better if she wasn't pissed all the time but Nozomi was so so cute! Especially when Keichi was around >.< As for Naoe and Yukirin they were the cutest couple ever. Natsuki and Anna were you could say juvenile? As for Matsunaga and Tsutsui all I can say is they looked like an old couple and were hilarious to watch. To the OVA we go!",
            "date": "2018-03-30T12:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 275759,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=275759"
        },
        {
            "content": "This anime just kinda makes you wanna go \"ah, youth.\" I'm really surprised I ended up liking it this much, actually. \r\nSo, as far as the art and sound go, I'd say it was pretty average. Honestly, there could've been some really awesome sound design done with this anime that wasn't 100% there, but I really don't get too picky about that sort of stuff, so it doesn't matter.\r\nThe story itself was decent. It was a little bit cliche, but I think that it was done well. I like that the story followed four romances (or beginnings of a few romances) without it being segmented.It wasn't like each character got their own set of episodes; it was all connected together like a normal story would be. I do think that the story was maybe a little too eager with the romance aspects because it felt like the characters fell in love a bit too quickly. I don't necessarily think it's a bad thing for characters to realize it quickly, but it still would've been nice to have a bit of lead-up for a couple of them. \\n\\n\r\nOkay, so characters. My motto is: give me a crappy story all you want, but you better give me dynamite characters. This anime pretty much delivered. Again, there are cliched character relationships and character personalities, but this anime presented them so well so that they seemed funny and interesting. Part of that is probably because every seiyuu is awesome, but I think a lot of it is also because you get to watch these characters be authentic. Also, the main girl isn't an idiot like a lot of main female characters are in romance anime. Not as in stupid, but as in someone who doesn't even know that romantic love is a thing that exists and they probably just blush when they're around a certain person because they have a cold. So, I'm happy that she isn't one of those because I would've been turned off right away. \\n\\n\r\nAll in all, it isn't a perfect story, but the characters especially made it comforting and peaceful to watch. I'd definitely recommend it, and now I'm gonna read the manga, because something tells me it's gonna be even better.",
            "date": "2019-03-31T21:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 305106,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=305106"
        },
        {
            "content": "This was one of the greatest shows I have ever watched, it had a great story, and it wasn't that rude, seriously I could go on and on about how great this show is but I must explain why I have wrote this review.\r\nI am quite annoyed that you would end the series like this, I mean are you going to make more or not, because this was just the worst ending ever, I mean sure the main character ends up loving the other main character, but the other main character doesn't know that, and so many people don't end up with the people thatthey have been crushing on the whole series. It is very annoying and there are so many cliffhangers and loose ends, it gets me really really annoyed, I loved the show so much but I hate that you would leave it on that note, it is so annoying and stupid, now please consider making more episodes and make them go for longer and as you can tell I am English so this just proves that people all around the world love your show sooooo much, so please please make more, just a few more episodes for all the shippings that everyone has had for every character, JUST FREAKING SOLVE THEM!",
            "date": "2016-08-20T10:18:00+00:00",
            "helpful_count": 5,
            "mal_id": 227199,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ryan53321",
                "username": "Ryan53321"
            },
            "url": "https://myanimelist.net/reviews.php?id=227199"
        },
        {
            "content": "Nijiiro Days is anime based on shoujo manga\r\nFirst impression: At first, I thought this anime is homo (in MAL cover guy of all) the duration is only 13 minutes away. plus I do not like shoujo.\r\nBut because of the holidays, I'm in short of anime, so I tried it watching this anime (as I see in genre there have romance , I like anime romance, and the graphics do not disappoint) and then, in 5 episode,, the anime is not in line with my first impression: D\r\nAfter watch: Anime is not a fag in my opinion. for each of the main characters has their respectivespouses (female of course). moreover the point of view often to men (so similarto shounen even though the source is an anime shoujo) so even though I do not really like to watch shoujo, interest on watching it.\\n\r\nThe story is also not boring (every episode at least there is a scene of her romance) no Ntr so safe in heart. comedynya not so crisp. try it\\n\\n\r\nStory : 8/10\\n\r\ni like the love story on each character. comedy is not boring. Nijiiro's anime left the story on the end of chapter 24 on manga.\\n\r\nbut i bit dissapointed on the ending. \\n\\n\r\nArt : 9/10\\n\r\nThe Art on Nijiiro days anime as good as manga art. character graphic are smooth and interest to watch.\\n\\n\r\nSound: 7/10\\n\r\nDubber on this anime are : Eguchi takuya (hachiman oregairu), yoshitsugu matsuoka (Bell Danmachi) and many more. but i like kobayakawa anna voice, cute <3\\n\\n\r\nCharacter :8/10\\n\r\nThe character development are good. every main haracters has their respective spouses. and i still like the character graphic and of course, anna <3\\n\\n\r\nEnjoyment : 9/10\\n\r\nNijiiro days can bring me to watch 12 episode in one day (because it just 13 minutes per episode) and make me feel like fallen in love on the episode 19-24 :D\\n\\n\r\nOverall : 8/10\\n\r\nshould i recomend you to watch :\\n\r\nYes, if you love serious romance stories.\\n\\n\r\ni hope this review useful :D thankyou for reading",
            "date": "2016-06-28T03:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 222230,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5334233.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nakayo-kun",
                "username": "Nakayo-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=222230"
        },
        {
            "content": "The story revolved around a group of four students; the hopeless romantic guy Natsuki Hashiba (Natcchan), Tomoya Matsunaga (Mattsun) who is the playboy type, the cheerful and sadistic guy, Keiichi Katakura (Kei-chan) and Tsuyoshi Naoe (Tsuyopon), the one  with the least words and also the smartest in the group. This anime begins with the encounter of Natcchan with a girl named Anna Kobayakawa on Christmas eve. He fell in love at first sight and since then he tried to get closer to her. Together with the main plot, it also tells the love story of the other three and how they support each otheras a group of friends. Many had said, at first glance, people may think that this is a yaoi anime, but actually a comedy, slice of life and not to forget a normal romance.\\n\\n\r\nStory: \\n\r\nThis anime has been one of my choices whenever I am not in the mood for heavy theme. However, at some point it is too plain and predictable until it becomes a bit boring. The comedy seems natural, appropriate and not overly done.\\n\\n\r\nArt and animation:\\n\r\nThe arts are okay and acceptable. One thing that is worth mentioning here is the characters' hair color that are very stand out. This is to enhance the characters' personality. For example, mattsun's hair is red and it suits his personalities, a boy who is confident and popular while tsuyopon's hair is blue showing his reserve and calm character. All the ridiculous colorful hair serve as the mood lifter and strengthen the characters.\\n\\n\r\nsounds: \\n\r\nThe opening and the ending theme songs are not the 'ear-bugging' type but still enjoyable and reflecting the theme of the anime.\\n\\n\r\nCharacters: \\n\r\nThe strongest point of the anime is the characters. They are well defined and well developed from the very start of the series except for Anna. Anna seems emotionless rather than being shy and kind girl. A part from that, I love how different the characters are make from each other. They are all unique. To be honest, the most out-standing couple is mattsun and mari-chan. \\n\\n\r\nEnjoyment: \\n\r\nIn terms of enjoyment, the highest score that can be given is 7. As said previously, the story is too simple. The outcome of each of the conflict in the anime can also be predicted thus limiting the adrenaline rush. The love story however, is as sweet as a cherry pie and become the saviour of the series.\\n\\n\r\nOverall:\\n\r\nThe series is considered as fun if you are in relaxed mode. If ypu are looking for something that is fast paced and challenging, this is not the one for you. The overall score is 7. Many had said that the manga is better than the anime. This review however is solely based  on the anime thus comparison can't be made. \\n",
            "date": "2016-06-29T03:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 222329,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kennyssaa_cyrae",
                "username": "kennyssaa_cyrae"
            },
            "url": "https://myanimelist.net/reviews.php?id=222329"
        },
        {
            "content": "Shoujo romance.  The penultimate genre of romance where everything is sappy and the journey to love is a slow, arduous, and sometimes painful one.  So, what better way to give us everything that Shoujo romance has to offer in one series?  That my friends, is Niijiro days.  \r\nStory: Our story begins on Christmas Eve with Nat-chan, who is sitting under the town's giant christmas tree in disappointment.  After breaking up with his girlfriend due to her being a gold digger (This was never a part of the anime, but it's the context that gave way to the rest of theseries), Nat-chan is given a tissue by a passerby Santa girl with whom he falls smitten to.  This girl's name is Kobayakawa Anna, a girl of the same grade in the same school as Nat-chan, thus starting another season of romance.\\n\\n\r\nNiijiro Days is a very...complete kind of shoujo Romance.  (And yes, I am aware that doesn't make much sense, but keep reading.)  The main draw of the series is the fact that the show has not one, not two, not three, but FOUR different ships/romances that are going on at the same time with each of them pertaining to a different kind of romance that you would normally have with shoujo romances.  The show doesn't really have much beyond just focusing on these relationships, as the majority of the screentime is just the characters hanging out and/or attempting to get their love-saturated plotline moving at a snail's pace.\\n\\n\r\nWith this setup, there're a few problems that come into play.  For starters, because the show focuses on so many couples at once that the show only inches its way towards the inevitable conclusions without actually getting there.  (Not like we were actually going to get any endings, but my point still stands)  Second of all, the imbalance of screentime makes it so that some couples, particularly the main couple, gets more screentime than any other couple and as such we don't get to see everyone get as much attention as they should get.  These are really minor problems in the grand scheme of things, but they're still inherent issues that the series has.\\n\\n\r\nOverall, Niijiro Days is more or less every single shoujo trope smacked together into one show.  Its execution is inherently flawed due to the show being only technically a full-length one cour series due to each of its 24 episodes only being 13-15 minutes long and because the manga is still on-going and as of today, has not reached much of a conclusion either. Still, there's nothing particularly bad about this series despite it being somewhat generic in terms of what they're presenting for their story.   \\n\\n\r\nOverview:\\n\r\n+ Four distinct stories/couples to follow\\n\r\n+/-  Stories contain mainly shoujo tropes\\n\r\n-  Typical with many shoujo, no clear conclusion\\n\\n\r\nCharacters:  As mentioned before, the characters in Niijiro Days are split into four distinct couples, with each character more or less having a defined trait that makes up their character, usually opposite to their opposite sex counterpart.  As such, I'll be going over each relationship rather than each character.  (I will also be using the nicknames for the male characters rather than their ACTUAL names because hell, if the show does it, I will too.)\\n\\n\r\nFirst there's Nat-chan and Anna, the main couple of the series.  Nat-chan can be easily described as the 'shoujo heroine' type of character.  He acts very often like your typical shoujo heroine as he is this bright, energetic, and extremely easy to read character that doesn't have an evil bone in his body.  Anna on the other hand is a softspoken, mostly quiet individual who starts to open up as the series goes along.  This couple in particular soaks up most of the series's screentime and is the one relationship that the series tries to put together the most.  Despite that, the show doesn't really...do much to actually put them together.  Anna is a very oblivious character and is easily influenced to the point it's actually quite dangerous to leave her alone due to how easily she could be picked up, and Nat-chan is very shy and flustered about his own feelings to the point that he can't confess and most of his attempts crash and burn.  They're pretty typical in terms of generic shoujo romances, so as a relationship, they're not really all that progressive or unique.\\n\\n\r\nThen there's Mat-tsun and Mari, the secondary couple of the series.  Mat-tsun is a playboy type character while Mari is Tsun.  No dere, just tsun.  (Her last name is Tsutsui, but I think it should be Tsuntsun instead).  These two...are somewhat aggravating if I'll be completely honest.  Particularly Mari.  The majority of their 'relationship' is more or less a game of cat and mouse, where Mat-tsun tries to chase down the annoying and shrill tsun child without really getting any results.  They have a few episodes that are devoted to them and their relationship, but similar to most of the other couples, the end result doesn't really prove to be in any way progressional.  In fact, Mari exists more as an obstacle to the series if anything.  Her characteristics are of being this man hating girl who solely just wants Anna to stay by her side and no one else, constantly complaining if someone 'takes her away' and for the majority of the series, despising the idea of the male characters even coming into the picuture.\\n\\n\r\nThen there's Kei-kun and Nozomi.  Kei-kun is a sadist who carries a whip around with him because hey why not?  While Nozomi is Mat-tsun's younger sister who is quite literally the definition of lovesick.  This couple probably gets the least amount of attention out of everyone.  Hell, they get the least amount of screentime compared to everyone else.  The brunt of their relationship is the girl chasing the guy while also playing the waiting game due to Nozomi's dedication despite getting rejected.  There's not really much to say about them and this just shows how unbalanced the show is in the way of exploring these individual romantic relationships.\\n\\n\r\nAnd finally we have the one OTP that actually exists in the series, Tsuyoponnu and Yukirin.  As the gaming/otaku couple of the group, these are the only two characters that actually are dating.  (Ya gotta cover all bases)  Their screentime is mostly devoted to starting some plotlines as well as giving advice to some of the other couples because well, they're the successful ones.  Aside from that, they have their fair share of lovey dovey moments and that's pretty much their purpose in the series.  They're a cute couple but since they've already 'succeeded', there's not really much else the series could do for them.\\n\\n\r\nSide characters are practically non-existent.  The few that are in the series fade away very quickly and only show up for 1 episode, maybe 2 max.  As such, there's nothing to really say for the side characters good or bad, so we're moving on.\\n\\n\r\nOverview:\\n\r\n+ Some unique couples\\n\r\n+ Couples showcase different forms of romance (Or stages)\\n\r\n-  Some generic couples\\n\r\n-  Side characters are worthless\\n\\n\r\nArt: Made by Production Reed, the animation for Niijiro days is a rather standard form of animation that doesn't particularly stand out.  The quality is good, the colors are bright and colorful, but there's nothing particularly unique about it.  \\n\\n\r\nThe show's comedic stylings are more geared towards the comedic face changes to show exaggeration or any other emotion, which is mainly used just to show us the kinds of feelings or tension that are going on at the moment.  They're not overused so that's a good thing.\\n\\n\r\nOverview:\\n\r\n+ Good quality art\\n\r\n+ No overuse of its comedic artwork\\n\\n\r\nSound: The tracks for Niijiro...they're not really all that special.  The tracks for the 2 OPs and EDs of the series are songs sung by the four main male characters that actually don't have much merit to them.  They sound so bland and uninspiring that it wasn't really worth listening to.  \\n\\n\r\nIn addition...Uchiyama Yumi, Tsutsui Mari's seiyuu, did a very...annoyingly good job at playing her character.  I have to point this out specifically because her performance is so annoyingly good that my distaste towards this character only elevated.  Just this shrill, ear-piercing voice shouting \"Anna!\" is a performance I have to commend despite my negativity towards this character.\\n\\n\r\nOverview:\\n\r\n+/- That annoyingly good tsundere performance\\n\r\n-  Soundtrack was rather generic\\n\\n\r\nPersonal Enjoyment: Niijiro was a shoujo romance that peaked my interest.  I mostly thought when I first saw it that it was gonna revolve around only one guy trying to get his romance going while his friends poked him and laughed at him for his attempts.  Bit mean, I admit, but that's what I thought before I read the manga and started to watch this show.  Niijiro is a series that I don't particularly hate, but at the same time, there's nothing about it that remotely screams originality or interesting.\\n\\n\r\nDid I like this series?\\n\\n\r\nIt was fine.  Nothing really stood out about it and I don't really hate much of what they did.  I went into this expecting to have no progress, and as expected, nothing except maybe the spark actually occurred.  I also find Nozomi to be a very...interesting character.  \\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nMari.  Mari is by far the most irritating character in this entire show and I will not stand to have her shout Anna in my ears anymore.  There's nothing even cute about her because she always seems uncomfortable with the current situation and that there's always a stick up her ass.  \\n\\n\r\nWould I recommend this series?\\n\\n\r\nNiijiro Days isn't really all that special in comparison to other shoujo romances.  Its only draw comes from the fact that the show has 4 couples so you don't have to just root for one.  Aside from that, there's nothing unique or special about it.  So if you're looking for a shoujo romance, then this is worth a pick up.  If not, then I would suggest to not watch this.",
            "date": "2016-06-26T15:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 222078,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=222078"
        },
        {
            "content": "\"Rainbow Days\" is one of those candy animes for people who like just a little bit of relationship drama and realism, but don't really want a soap opera or gritty drama. As seems to be the trend with shoujos, the main characters are boys, in this case four close friends who avoid club activities. All of them are in varying stages of dating (or trying to date) their respective girlfriend, and they help (or tease) each other as they go through their trials and tribulations. That's pretty much the entire anime, some people will obviously not want anything to do with it, but it doeshave a certain appeal to many of us.\\n\\n\r\nIt will not win any originality award, but at the same time it is not just one cliche after the other, the main characters all have distinct personalities and some are a bit fresh. They go through many of the relationship anime standard plot devices but don't really dwell too much on generic drama like the cocky rival love interest who appears just as things were starting to go okay for the main couple. Mostly each episode is a little romp at the usual places - karaoke bar, the beach, the hot springs hotel, etc.\\n\\n\r\nIt actually works pretty well with the short format, although I found myself getting behind on purpose and enjoying it a lot more to watch several of these in one session. Since it's such a breezy show it's hard to maintain your concern over the romantic cliffhangers for an entire week sometimes. \\n\\n\r\nThe characters are not hyper-realistic but they're not cartoon version of high schoolers that you can't relate to at all. When the guys learn their buddy's girlfriend's pet name for him and tease him for the rest of the series about it, or when the thorny Mari-chan makes her many appearances to disrupt the easy-going flow of the other characters, this is all stuff that can fondly remind me of my own \"rainbow days\". \\n\\n\r\nShorts always get under-rated on MAL for some reason, I really think if you like fun (but not silly) relationship drama animes, this is a must watch even despite the rating and it being shorts.",
            "date": "2016-06-15T07:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 220808,
            "reviewer": {
                "episodes_seen": 21,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/doc_awesome",
                "username": "doc_awesome"
            },
            "url": "https://myanimelist.net/reviews.php?id=220808"
        },
        {
            "content": "Nijiiro Days was basically any romance anime you've ever seen, except the episodes literally last 10 minutes - which is kind of annoying to have to constantly switch episodes if you're binging it like I did (at least it's not Sweet Love Patisserie with five minute content), but on the better side, there's 24 episodes, making it last just as long as any other 20 minute series with 12 episodes. \r\nMoving aside from the episode length, we should begin with the story. Like any other synopsis will give, the series begins with high school student Natsuki Hashiba heartbroken from a harsh parting from his exon Christmas night, along with his love interest Anna Kobayakawa coming to his aid. Soon after, Natsuki discovers she goes to her school and a romance \"blossoms\". I don't have too much to say about this beginning aside from it's clicheness being kind of tacky but not the worst I've seen.\\n\\n\r\nLater on in the series, each of Natsuki's three best friends end up getting paired with other girls, and the eight of them end up becoming good friends. It was pretty coincidental it ended up like that, though - four guys, and four girls to match. (One of the pairs was already a couple before this happened though.)\\n\\n\r\nEach character was unique and I enjoyed seeing the variety in the friend group; there was everything from a frantic cosplayer, to an accused sister complex. It was interesting, to say the least.\\n\\n\r\n(slight spoilers)\\n\r\nOne character I will comment on would definitely be Anna. \\n\\n\r\nI get that she's supposed to be really quiet and shy, but aside from this, she has 0 personality, which made me upset because Natsuki was such a great character who fell in love with such a mundane girl, which lead to me not caring an ounce about their relationship. They managed to get Tsuyoshi (another shy character) to be really intriguing because of his feelings toward Yukirin (his girlfriend), so why didn't they just add more emotion in her dialogue? I get she's to \"discover her feelings\" or whatever, but she became boring. I didn't even focus on the main couple because of this. What the fuck?\\n\\n\r\nIt really got my hopes up to see the four pairs get put together, but because of Anna eating up all the screentime with \"whY Do I feEl tHIs WaY?\" none of the relationships actually went anywhere. \\n\\n\r\nSpeaking of, the art and sound were all generic. Nothing jumped out to me, and it was the same as any other anime. I only kept going because of how adorable and good the characters were; they were what saved the show.\\n\r\nThis series could've been really enjoyable, but instead was boringly average. Overall, Nijiiro Days is not a bad show - yet, it is far from good. It did the purpose of any other anime, to entertain.",
            "date": "2018-12-31T15:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 297617,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7678344.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/felnorii",
                "username": "felnorii"
            },
            "url": "https://myanimelist.net/reviews.php?id=297617"
        },
        {
            "content": "What's my problem with Nijiro Days? I'll tell you what...\r\nTHE FUCKING EPISODE LENGTH. I mean come on, twelve minutes episodes, what sort of bullshit is this?\r\nWell whatever, let me get to the review. Nijiro Days is a shoujo anime and I can tell you it does it's job well. However I particularly hated the ending of Nijiro Days and I think that if the makers had made the episodes the full length, and actually FINISHED the story instead of leaving it halfway completed, I think Nijiro Days could've been a masterpiece. All things said let me get to what I enjoyed about this anime. \r\nThestory, the story truly is an incredibly good one. For one reason, the story is incredibly realistic and believable. The story has the right amount of melodrama mixed into it and realism as well. I particularly enjoyed the story and I seriously think that this anime deserves a season 2 to serve justice to the characters. \\n\\n\r\nThe artwork is also particularly clean and pleasant to look at, a typical shoujo manga style of art and the characters look well composed. The animation is a bit below par but it still looks good. I like the fact at how the stories of the characters are intertwined and how each character's love life fits in with everybody else's. Not like the characters are in separate worlds. The story does feel like a classic school shoujo romance. Overall I certainly did enjoy it quite a bit. \\n\\n\r\nNow time for the downsides, one thing I did not like about this anime was the fact that they tried splitting four love lives among the duration of about 280 minutes of viewing time. There wasn't nearly enough time to fully bond with the individual characters even though many of the scenes constituted multiple individuals. The character's backstories literally don't exist and the characters do not experience much development. The only character where I saw appreciable development was with the heroine Anna Kobayakawa, she develops beautifully through the anime.\\n\\n\r\nThe art in my opinion like I said was good but I feel like it was a bit too cartoony. The animation could've been done better. \\n\\n\r\nThe music is my problem, the music doesn't portray the motions effectively throughout the anime which I feel is a huge problem as music is incredibly important to set the tone of a scene. \\n\\n\r\nOverall, this anime has it's problems and I would rate it somewhere around 7.6-7.8. Overall I feel like this anime is a very satisfying watch for shoujo anime lovers and it's a great anime to watch in your spare time. Every episode is short which is convenient and you'll practically fall in love with the heroine. She's kawaii.",
            "date": "2018-09-05T07:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 288165,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ABDoesThings",
                "username": "ABDoesThings"
            },
            "url": "https://myanimelist.net/reviews.php?id=288165"
        },
        {
            "content": "Wow! This series is amazing. I'll be honest with you all I found about it when this years spring anime have ended and I was kind of sad because there was nothing new for me to watch. Somehow I missed this gem and now I'm really happy to say that this was one of best binge-watches in my life! \r\nStory can look simple and easy but characters are bringing the joy and fun. This is great mix of different personalities and we've got here what we love most. School, love, friendship, good days, bad days, happiness and sadness. It's all here and it's all wellpacked making Nijiiro Days totally great slice of life anime. I hope it will get more recognition and will be rated even higher.",
            "date": "2018-06-25T13:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 282206,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6677471.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/junmisugi",
                "username": "junmisugi"
            },
            "url": "https://myanimelist.net/reviews.php?id=282206"
        },
        {
            "content": "First of all let me say that i personally really enjoyed watching it.\r\nNow then let's get into the review. This anime is short, and honestly it crams so much stuff into it and it turns out really good. The characters are interesting and likeable. The story is kind of there but it's mostly like everyday life in school so don't expect some next level drama, romance story where s**t is about to go down. This is one of those anime where you watch it for the sole purpose of being entertained.\r\nOver all i rated the story 6, it's there but it's not really something.\r\nArt get'sa solid 7 since it's quite nice.\\n\r\nSound get's a bare 6 it's not really the strong point of this anime.\\n\r\nCharacters get an 8 i really liked them.\\n\r\nEnjoyment get's a 9 from me, i really killed it in one day :D.\\n\r\nOverall a 7 if you are into spending some time for a school like romance buddy entertainment.",
            "date": "2018-03-05T05:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 273078,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4999571.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nisekoichitoge",
                "username": "nisekoichitoge"
            },
            "url": "https://myanimelist.net/reviews.php?id=273078"
        },
        {
            "content": "I have to admit I thought this anime was going to suck but I was wrong. I REALLY liked it. It's a very chill show. Just your average high school kids going to school and hanging out with friends. Each character has their own quirk which makes them interesting. My favorite was Keiichi Katakura though. He was hilarious and made the show ten times better. \r\nHowever, there were two things that I didn't like. \r\n1.) I didn't like Anna Kobayakawa which is the main girl in the show. She was so bland and boring. Sure, she was sweet but she has no personality. Just plainand dull. Her voice even made me sleepy. That's how boring she was. I still don't get why Natsuki was so into her. \\n\\n\r\n2.) I didn't like the ending. I mean seriously IT WAS SO BAD. It just made no sense. However, you should still watch the show because it's still good. Although the ending might piss you off so beware!\\n\\n\r\nOVERALL, \\n\\n\r\nThere's no big plot so if that's what you're looking for then don't watch this. Each episode is ten minutes which kind of sucks. It's still a fun show and I do recommend it if you're looking for a funny romantic show.",
            "date": "2018-01-22T21:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 269391,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919522.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JoyJoyJoy",
                "username": "JoyJoyJoy"
            },
            "url": "https://myanimelist.net/reviews.php?id=269391"
        },
        {
            "content": "DOES NOT INCLUDE ANY LIFECHANGING SPOILERS, THEY ARE PRETTY OBVIOUS\r\nWhy I didn't like it that much: This is a very relaxing anime, nothing much happens, but come on! The ending is so unsatisfying! And every episode end is a total cliffhanger. \r\nBut I liked it because it didn't have any violence or nudity. Very family friendly and even a 7 year old (actually it depends on the person watching) can watch it if some situations or actions by some characters are explained. Also I feel like there are some stereotypes but I'm not 100% sure...\r\nRecommend for people who want to watch something \"easy\" or don'twant any nudity or violence. (Excluding some characters being a little creepy and such but basically every other kids cartoon has these moments. I also want to add that most of the time characters are acting nice and caring).\\n\\n\r\nIn my opinion, my every male classmate (sorry but they are in this age) should watch this, because it gives a good examlpe how a gentelman should act towards girls. (Except some scenes by some certain characters but the scenes are only like 5 minutes in the whole anime. (Girls? Not so much))\\n\\n\r\nI apologize if you read this and you totally disagree with everything, but this is how I see it.",
            "date": "2016-07-15T11:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 224104,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5493985.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/B-FOUR",
                "username": "B-FOUR"
            },
            "url": "https://myanimelist.net/reviews.php?id=224104"
        },
        {
            "content": "The story was nothing too complicated and not so much annoying drama, which is great. It's not a slice of life but more to romance and friendship, and I like it especially the bond between the boys. The art is simple and okay. But, I love the soundtrack the most, well I don't expect less from Sonar Pocket, I like their song as always :)\r\nCharacters are great, they've got simple personalities with not too much complicated going on within themselves. I like how they are honest with others and themselves. Just for that one character, if this anime/manga doesn't have that annoying-disturbing girl (why authorloves to put this kind of personality?), I would give 8/9 for character wise.\\n\\n\r\nI like this anime a lot, because it's easy to watch, and relaxing to get a rest from many intense-themed anime. I recommend this anime because this anime is simple and comforting. Though the ending could be better, but I hope that's just because they'll give another season? If not, then.. go read the manga, even though it's not ending yet.",
            "date": "2016-07-07T00:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 223363,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3205263.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/babiettangkoma",
                "username": "babiettangkoma"
            },
            "url": "https://myanimelist.net/reviews.php?id=223363"
        }
    ],
    [
        {
            "content": "Nijiiro days is a high-school, slice-of-life anime, complete with the usual comedic and shoujo elements. It's an adaptation of the ongoing manga with the same name. Episodes are about 12 minutes long, meaning that the 24 episodes basically comprise a single kur. \r\n\tThe story initially focuses on the four boy gang, but as time progresses (thankfully for the boys) an equal number of girls are added to the mix, creating the familiar “mina-oriented”  storyline. As a result, the focus is not on a single protagonist, but to the whole group of friends. The characters are distinct andtheir development visible, although some platitudes exist on their characterization.\\n\\n\r\n\tExpanding on that, the show has a formulaic feeling to it; If I had a list with all the genre's trites, I would be able to cross each item off. Having said that, none of the banalities reach that particular level of annoyance that anime are known for; the main (wannabe) couple is dense, but not that dense; the man-hating girl does not become exasperating; hey, we even have an actual couple and a couple of kisses! \\n\\n\r\n\tAll and all, the group works great, producing comedy and that warm, peaceful, and fuzzy feeling that the fans of this cliché-ridden genre (like yours truly) seek. Another elements that adds to the peaceful setting, is that the anime is down to earth; no Ouran Koukou or Special A grandiose displays of wealth, intellect, or general over-the-top-ness. Instead, the boys interact in a natural way between them, trading jabs, talking about girls, and being typical boys. Because of that, I was surprised when I found out that the mangaka is a girl. Each of the girls is unique, finding a way to be both charming, interesting, and (of course) cute. On a final note, the art is OK; nothing special, but it does not drag the anime down. \\n\\n\r\n\tNijiiro days delivers what the name (rainbow days) promises; a nice group of friends, a bit of comedy, and  a bigger bit of romance. While it is not the most original nor the best,  it is a solid addition to the genre. I  hope for a second season. 7/10.",
            "date": "2016-07-02T04:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 222743,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4882785.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Darmaiad",
                "username": "Darmaiad"
            },
            "url": "https://myanimelist.net/reviews.php?id=222743"
        },
        {
            "content": "Let's be honest,we all thought that this was yaoi at first glance,didn't we?\r\nFour boys running on green open field,with cheerful music and rainbow name?I can't blame you.\r\nBut there is more to it.\r\n\"I'm pretty sure I have no luck with girls,and I`am not suited for romance.\" - Natsuki \"Na-chan\" Hashiba\r\nRainbow days is a funny anime if you give it a chance, characters are interesting and everything that I watch reminds me at Kimi to Boku which I loved. Just with a little bit more of romance.\r\nStory is moving quite at slow pace, which for a show like this,is nothing wrong. Anime is not focusing too muchon just one pair, but everything is covered.\\n\r\nCharacters are, well,maybe \"too unique\" if you ask me, I mean whats with all that hair colors seriously? But lets forget that,their personalitses are something else.Even though it seems that they maybe go overboard with them, underneath , they are the same highschool boys that you can meet anywhere, except for Keiichi of course.\\n\r\nIf it aint broke dont fix it - I guess thats what the staff was thinking when making this anime, there is nothing surprising but on the same hand nothing that wil turn you away from it.\\n\r\nArt is basic, no WOW moments but its not about that here anyway so...Sound is minimalistic, which I'm fine with,some seem to complain.\\n\r\nAs I said characters are specail in this show, but talking about them would be pointless, you have to see that for yourself.\\n\\n\r\nOverall: [7/10]\\n\r\nIf you dont hate repeating gags, classic slice of life/school humor &amp; romance then this anime will surely be good with you and you will like it just as I do.",
            "date": "2016-07-01T00:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 222543,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4932610.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Daru-sama",
                "username": "Daru-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=222543"
        },
        {
            "content": "Nijiiro Days is like a cone of overly frozen vanilla ice cream. It's sweet. You enjoy it. But at some point, you get tired because it takes too long to consume.\r\nThe plot starts out with Natsuki (the male MC) falling in love with Anna at first sight. He has his set of wingmen friends who encourage him to go for it and pull out as many stops as possible to get them together. It ends with the girl acknowledging that she likes him too. The end. It's as vanilla as you get.\r\nThe MC's friends are an interesting bunch with their own quirks and personalities. Someexperience character development. Others remain static and didn't need much development to begin with.\\n\\n\r\nThe first half of the show is an overall fun ride with a mix of laughs and some character development. By the third quarter, the characters develop further and becoming slightly better people than when they started, but you sense that the plot is beginning to slow down. \\n\\n\r\nBy the time the fourth quarter rolls in and it's time to end the story (i.e. Anna realising that she likes Natsuki too), the writers seem to have already milked as much development as they could from the entire cast and are now forced to spread the entire arc real thinly and slowly over a whole 6 episodes.\\n\\n\r\nOverall, this is a fairly average SOL with pacing issues towards the end. Sweet and likeable. Nothing less. Nothing more.",
            "date": "2016-06-27T02:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 222134,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tlst9999",
                "username": "tlst9999"
            },
            "url": "https://myanimelist.net/reviews.php?id=222134"
        },
        {
            "content": "If your looking for a romance anime that has a deep maturing plot this anime isn't it. However, that is not to say that it isn't enjoyable. Its a very fun quirky anime. Imo theres a lot of romance anime that are cringeworthy I'm not gonna lie, the over hype romanticization of the meaning of love is just blehh. This anime was the first that made me not think that way, and I think thats a good thing. If your looking for a comedy/romance anime just to pass the time I suggest to watch it cause why not.\r\nThe characters are not your typical romance characters,if you know what I mean. Their kinda weird which I like. The anime doesn't revolve around just on two characters for their love story, it revolves around everyone. Which brings out funny and cute moments so I think its a good thing. \\n\\n\r\nMy overall rating is 7 which might seem quite low but the only reason is cause this anime is just to past the time its not something that really got me hooked on although I do read the manga and enjoy it twice as much, the anime is still good.",
            "date": "2016-06-26T17:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 222086,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4927424.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/akumma",
                "username": "akumma"
            },
            "url": "https://myanimelist.net/reviews.php?id=222086"
        }
    ]
]