[
    [
        {
            "content": "In one of SHAFT's latests, Dance in the Vampire Bund, there is actually very little to dance about. SHAFT usually has a knack for finding strange source materials and then adapting them in interesting new ways that break the troupes of their genres. Usually is the key word in that last sentence. I'm trying to write a non-bias review, but it's inevitable to say Dance in the Vampire Bund is not a good anime. But! At the same time it isn't a terrible anime. But what Bund is, is absolutely average. There's nothing this anime does to set it apart from other second-rate anime aboutvampires or political conquest. At first, everything that happens you'll feel like \"Hey well I kind of thought that was coming\" and by the end you'll be like \"Wait? Was that a plot twist?\" Note that is a review on the anime only and from what I've seen of the manga, this is a poor adaption of what could have been a much better experience.\\n\\n\r\nStory: 4/10\\n\r\nMina Tepes, the vampire princess has decided to establish a safehaven for all vampires. Through various means she gains political ground for the establishment of \"the Bund.\" Of course, exposing to the world that vampires exist and that they will be Japan's next door neighbor is troublesome and the events told in this story are about them. I think. Mina also happens to own some fancy Japanese High School where our protagonist attends and our protagonist also happens to be a werewolf whose dad works directly under Mina who also happens to attend her own school. Huh? I'm confused too. The story becomes derailed whenever Akira, the protagonist, is focused on, because to be frank, the anime isn't about him. It's about Mina Tepes, but SHAFT decided to make the back plot some nonsensical love story (which only resolves with loli-rape - I'm dead serious). Oh, and be warned, there's most likely a sequel coming.\\n\\n\r\nArt: 5/10\\n\r\nOho. SHAFT is one of my favorite animation companies because they always do interesting things with their anime and try and tread new grounds by playing with color or 3D elements or optical illusions. SHAFT is also one of the most underpaid and overworked studios in the current anime market and thus they have an incredibly low budget. The only reason I can make sense of why Bund's animation quality was so low was because at the same time SHAFT had been working on the eye-candy \"Hidamari Skecth Hoshimittsu.\" Almost everything about Bund in comparison animation-wise fails. The character movement is repulsive and over-dramatic. Every time a character does something they have a strange angle placed on them, then a zoom onto a random body part, followed by a slowed sentence that it wouldn't matter if it was even said or not. The only time you really see SHAFT's personal touch is when they zoom in on the eyes of the characters talking, which by the end of the anime was more of a nuisance than a pleasure. The clarity was also a huge problem. I started watching this anime in low quality TV rips, and then moved up to bigger and better looking files. There was no difference. The entire first episode had this weird green tint to it that made it unpleasing even to look at. The clarity fluctuates too (how fun!), so it's hard to enjoy when you have to up the brightness of your media player to view the episode normally. Oh, and other than Mina, every character looks boring. The main character looks like every other cliche male protagonist, and there's nothing even to set him apart from the other characters visually. Yuki, one of the female characters, is almost as interesting as Yuki from 11eyes (Note: Yuki from 11eyes sucks and she looks generic). I still like SHAFT's animation style, which is a plus for this anime, but the moments of camera genius that often appear in other SHAFT works are definitely missing here.\\n\\n\r\nSound: 7/10\\n\r\nNothing to complain about. The opening and ending are both nice but nothing memorable. Character voices are fitting (I enjoyed Mina's) but once again aren't anything to flaunt. BGM was quiet and rather uninteresting most of the time, but nothing bad.\\n\\n\r\nCharacter: 4/10\\n\r\nVampires, werewolves, tigresses, oh my! DERP. Mina Tepes is the one interesting character in this entire anime and every other character exists solely to support her. She's the under-estimated soon-to-be queen of vampires who tries and fights the old traditions of vampires to finally reveal her people to the world so they will not longer be persecuted. Kind of like a Martin Luther King Jr. of vampires, except in the form of a ten-year-old girl and not black. Hey, strong lolita leads are cool in all (Pani Poni Dash! I'm looking at you) but SHAFT needed to realize that there were other characters in this anime. The list includes a Chinese Tigress, a blood-sucking \"older sister,\" a vampire with massive eyebrows, a priestess, and about thirty five thousand big breasted women. There's actually very little to say about any of them except that they're bland. As soon as they're introduced you know exactly what their personality is. Mina is the only dynamic developed character, and thank god she is, because more than half of the anime is spent following her around. Akira on the other hand manages to grab as much time as Mina and ends up wasting it all. He's inctredibly undeveloped and the only point of appeal (kind of) is that he is a werewolf. COOL (BUT NOT REALLY). Even when he's a werewolf he most of the time gets the crapped knocked out of him and that's when a Deus ex Machina comes into play. Yuki is also an undeveloped annoying \"for some reason it's a harem\" bitch who gets in the way of the main \"relationship\" between Akira and Mina. She has absolutely nothing that separates her from other female characters in any anime ever and could easily be a background character that accidentally wandered onto the foreground.\\n\\n\r\nEnjoyment: 5/10\\n\r\nSHAFT tries to do the impossible and fails when they tried to make a show about political warfare with a touch of \"romance\" and then ended with a harem and fighting with plot twists as original as \"I AM YOUR FATHER\". It's frustrating seeing how much potential this show had. I can safely say that after such a thrilling experience I wiped the anime off my hard-drive and will have probably forgotten most of it by tomorrow morning.\\n\\n\r\nOverall: 5/10\\n\r\n That isn't to say that there aren't worse anime, because hot damn there are. I thoroughly enjoyed when Mina was on camera and thoroughly disliked whenever she wasn't. The annoying \"wait for season two where we explain what the final episode was even about card\" is pulled too. The only thing I can say is that for an anime about vampires, this show falls right into the pit with the other ones already out there, and unlike Hellsing, does not bring massive guns or blood. It brings one thing and one thing only - Mina Tepes - and if you don't like it, then this anime is definitely not for you.",
            "date": "2010-04-21T17:57:00+00:00",
            "helpful_count": 182,
            "mal_id": 25288,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207137.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Detective",
                "username": "Detective"
            },
            "url": "https://myanimelist.net/reviews.php?id=25288"
        },
        {
            "content": "To be honest, it's really surprising to see so many reviews giving Vampire Bund such a low score. For me, it was absolutely the best vampire anime I've ever seen. I can't really say that I'm obsessed with vampires, but it's certainly an interesting genre. Unfortunately there isn't really a lot of animes which use this theme to its fullest. In that sense, Vampire Bund has managed to utilize all the glory of the vampire legend and myth.\r\nStory: 10\r\nAs it goes with most vampire stories, Vampire Bund's plot revolves around the vampire princess, or vampire queen. However, it's really the subtle things that impresses methe most. I suppose most people would just pass them off as whims, but SHAFT has a knack at making an impression of the subtlest things which brings the plot together. Most vampire stories seem to forget that time moves, and are always trapped in one time-frame but Vampire Bund is nothing like that. Vampire Bund's story spans centuries of vampire history and glory, and the darkness within. It shows that vampires are not just creatures sleeping in coffins locked away in the middle ages, but also advance in technology and culture as humans do. It's an enormous theme and it's certainly not an easy task to depict it, but SHAFT does a great job. I suppose most people expect there would be a 2nd season because there's still another last boss and because of the manga, but if I'm not wrong, SHAFT doesn't intend on making a sequel. It's a lot better leaving the ending as it is and letting the audience imagine the story after, or just read the manga.\\n\\n\r\nArt: 8\\n\r\nIt doesn't get any better in abstract animation than with SHAFT. They make the simplest scenes look cinematic and grand. It seems they have been slacking a lot since ef, though. Basically, there's very little movement and lots of shadows. Vampire Bund seems to be lacking in the shadow effect SHAFT loves so much, however. In a sense, it could have been a lot better. However, it's still very impressive nonetheless. \\n\\n\r\nSound: 7\\n\r\nThe OP and ED are not the best you can get from anime songs, but it's complimentary. On the contrary, the sound effects are excellent, as expected from SHAFT. Many scenes would have been very empty and felt meaningless without the sound effects, but SHAFT always makes it worthwhile with the perfect timing and tone.\\n\\n\r\nCharacter: 8\\n\r\nAs it is, the story revolves around one person, the vampire queen. But this doesn't mean everyone else are just pawns. Yes, the side characters may seem to have very little screen time, but they make a powerful impression every time they come onto the chess board. Unorthodox as it may be, Vampire Bund never depicts the mains as powerful and unbeatable. Instead it shows that they bleed and feel the pain, and don't live on their own but are supported by various characters. \\n\\n\r\nEnjoyment: 10\\n\r\nVampire Bund is one of the few animes I've managed to finish in just a day. It's so enjoyable and interesting that I couldn't take my eyes of it. The conversations, culture, history, philosophy, and action makes every minute worthwhile. I haven't read the manga, and I probably would in a while, but I doubt I would enjoy it as much as the anime. It's beyond my mind that the beautiful abstract animation by SHAFT can be depicted in manga form.",
            "date": "2010-07-19T06:56:00+00:00",
            "helpful_count": 172,
            "mal_id": 28629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46781.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lonehunter88",
                "username": "lonehunter88"
            },
            "url": "https://myanimelist.net/reviews.php?id=28629"
        },
        {
            "content": "Okay, so Dance in the Vampire Bund. Or Bland, as I call it. First off, I had to look up what a bund was, because I thought I was missing something. Turns out I wasn't. It's just bad. I won't just stop there though, I will explain in detail why I think it's bad.\r\nStory: 3\r\nImagine if you will, the most painfully generic and dreadful story you can think of. Take what's chic. Vampires, right? Yeah, I mean, everybody loved Twilight, right? They'll like it even more now! Since you know, vampire shows haven't been beaten to death since the 1931 film version of Dracula. Thevampire, in this story, is Mina Tepes, the descendant of Vlad the Impaler we can only presume. Since you know, he was definitely a vampire, because that's what Dracula says. This time around though, the poor little vampires just want to be peacefully accepted into society. Two things come to mind when I hear this, the first being Mary Shelley's \"Frankenstein\" (1818), where a \"monster\" tries to integrate itself into society, and is nonetheless feared and shunned by everybody. The second is the anime Vampire Knight, where vampires and humans already co-exist to a small degree in a school setting, where the 'Day class' is occupied by humans and the 'Night class' by vampires. \\n\r\nIt goes further to hit every cliche in the arsenal, where the vampire chooses to attend school with her servant, who also happens to be a werewolf, the very school she of course has rule over, and the defiant student council wants to fight back for the school they most certainly love. Perhaps this wasn't meant to be an original story. For the rest of the review therefore, I will look at it as a re-telling of all the old legends of vampires and stuff like that. Story itself though, gets a 3 for lack of original content.\\n\\n\r\nArt: 5\\n\r\nShaft has always had a unique style of animation. That's what makes me a fan. Being a fan I've seen many of their other works. Having seen many of their other works, I recognize re-used animations and stills, re-colored to fit the characters in the current show. Clearly not their best effort. The animation itself however, is fairly decent, smooth, and with consistent characters and interesting angles. On the contrary, it's not as stylized as other Shaft works, such as Bakemonogatari or Sayonara Zetsubou Sensei, which means it does tend to just look a little generic compared to their other works. Also, there is no actual animation in the ending theme. Knowing Shaft, they will change that soon, but for now, 5'd.\\n\\n\r\nSound: 4\\n\r\nThe opening and ending themes are good. Everything else is generic, or even inappropriate. Comical sound effects mixed in with serious conversations set you off, and in my opinion, all the important voice actors have done better work in other shows. \\n\\n\r\nCharacter: 2\\n\r\nHere's one of the biggest disappointments of this show. Where they could have gone with creative, decent characters, there's just an eyesore lackluster display of crashing waves of mediocrity. The main character (at least, I think she is?) Mina Tepes,  is basically some sick combination of Remilia and Flandre Scarlet, as well as Nagi Sanzenin but without the nerdy side. An oppressive, static loli vampire queen. She shows two sides - the dominating, quick-witted personality you would expect from any major boss in a shonen show, and the slightly irritable yet teasing-playful unavoidable Tsundere archetype. Not exactly something to go in the record book.\\n\\n\r\nThen there's the other \"main\" character - Akira Kaburagi Regendorf. He made a promise as a child. Creative. He's a werewolf. Creative. He's a bullheaded protagonist that will go to unnecessary lengths to help the one he loves, even if he ends up just getting in the way. Creative. That, and if I were to describe him physically (short and somewhat spiky brown hair, school uniform, ..........) I'd run out of things to say about that fast. Complains a lot, same old, same old.\\n\\n\r\nEnjoyment: 2\\n\r\nUnless this anime is just a satire on anime or attempt to kill the industry, it's not worth watching. At all. I found myself checking the timer to see how much longer until each episode finished, so that I could be done with it and go on to bigger and better things, like staring at my computer's wallpaper. \\n\\n\r\nOverall: 3\\n\r\nUnless you're an undefeated vampire champion striving to peck up every last piece of lore you can relating to vampires, I would avoid watching Dance in the Vampire Bland. If you're looking for a vampire show with lots of action, there are many, many other, better choices.",
            "date": "2010-01-21T21:44:00+00:00",
            "helpful_count": 86,
            "mal_id": 22586,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/157985.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Cheating",
                "username": "Cheating"
            },
            "url": "https://myanimelist.net/reviews.php?id=22586"
        },
        {
            "content": "I did not read the manga so the review is based entirely upon the anime. I don't really describe what happens in the series and spoils are from none to very little. Look at the description if you wish to know what the anime is fully about.\r\nStory-7: Wow, vampires that have been hiding among us for centuries! I've never heard of anything like that before! That was sarcasm, if it wasn't obvious enough. Honestly though, yes it is overused and this anime doesn't pull it off as well as many other books or movies. But it doesn't have to. What I find very well doneis how they justify their ability to hide and survive in the time they have been oblivious to common humans. In the beginning the story is very poorly developed but everything starts adding up around the latter half of the series. Don't give it up too fast.\\n\\n\r\nArt-8: Everyone loves a naked 10 year old right? But seriously, it's not as bad as everyone is making it out to be. Although there are times when where they directly focus on her sexuality as a child, these are usually short and aren't that bad. So people should just take a chill pill. The animation moves in a way that Bakemonogatari does (yes I'm using it as an example, but in a good way) in that random motions and images are presented and there is a lot of emphasis on speech. Overall, expect fight scenes to have a dark undertone and blood is apparent when bodies are being cut in half. But that's just being realistic isn't it?\\n\\n\r\nSound-6: The background music doesn't stand out. The voice actors also don't really make themselves apparent. I do, however, enjoy the sounds that represent pain. They are far more realistic than many other animes and have almost a surreal quality.\\n\\n\r\nCharacter-8: The characters are bland and some come in and out of existence way too suddenly. You're left with a \"Who the hell was that guy?\" kind of feeling a lot of the time. Despite this the Vampire princess is actually a very complex person and it stands to reason that  most of the character development revolves around her. The rest of the characters are basically just there although some things do get explained during the last couple of episodes. I don't see enough character development based off of Akira but i still like his interactions with the rest of the characters.\\n\\n\r\nEnjoyment-9: I actually enjoyed this series very much. Although the whole series wasn't \"excellent,\" it was still a good watch. There are some very unpredictable moments which surprised me when I first read the reviews, stating that it is completely unoriginal. Oh and the princess' true form is sexy as hell, even though it uses a light effect instead of skin for representation.\\n\\n\r\nOverall-8: If it's taken for what it is it can be very enjoyable. I'll probably get lots of haters for this who try to only see the things wrong the with the anime and people who just can't sit back and enjoy. Sigh...well this is long enough already so I'll just end with saying if you like it, awesome, if you don't like it, that's cool, and if you've never seen it, you should give it a try. \\n\\n",
            "date": "2010-03-05T21:43:00+00:00",
            "helpful_count": 81,
            "mal_id": 23747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/220734.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shadesblade",
                "username": "Shadesblade"
            },
            "url": "https://myanimelist.net/reviews.php?id=23747"
        },
        {
            "content": "I was hesitant to watch Dance in the Vampire Bund, after all the bad reviews and ratings it was given, but I was surprised to find myself entertained by it.  So much that I finished it all in one day.\r\nI decided to give a summery of the anime because I dont believe the synopsis is fair to it.\r\nStory:\r\nA 17 yr old boy has had all his memories erased due to an incident that happened a year and a half ago.  What he does remember is a promise he made to this girl seven years ago, to always be together.  That girl turnsout to be the Queen of the Vampires, who he meets again, and shares a special bond with her.  And so the story begins.\\n\\n\\n\r\nThe art is beautiful.  So much detail, and colors.\\n\\n\r\nThe sound is ok. I didn't really pay any attention to it, to be honest.\\n\\n\r\nCharacters:  Really well developed considering there was only 12 episodes to work with.  If you put attention, you're not left lost or confused.\\n\\n\r\nEnjoyment:  I don't know why everyone gave it such low ratings.  I really liked Dancing in the Vampire Bund.  Though, the first episode made me dubious.  It's said that the audience bases their opinions of what they're watching within the first 10 seconds of their program.  Well, I'm glad I gave it till the second episode.\\n\\n\r\nOverall:  8.5\\n\r\nDance in the Vampire Bund was everything I was looking for.  Supernatural with romance and some action (the blood was a bonus).\\n\r\nAnyone looking for a action-packed romance anime, should definitely give this a chance.\\n\\n\r\nSorry if it's not the best review, I'm still an amateur at this:P\\n\\n\r\nTo all you \"Not Helpful\" and \"Helpful\" people too, feedback is appreciated. [;",
            "date": "2010-06-13T23:53:00+00:00",
            "helpful_count": 78,
            "mal_id": 27125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/296902.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lovethemtodie",
                "username": "lovethemtodie"
            },
            "url": "https://myanimelist.net/reviews.php?id=27125"
        },
        {
            "content": "7 episodes so far, and I decided to post this fe de erratas. Dance in the Vampire Bund is an anime that is sticking to the manga in the big picture sense. However, it lacks the details, both in the characters and the plot, that make this manga about vampires insightful and clever. \r\nThe anime has a lot of fillers which may have been intended to be creative, but turned out to be ridiculous. I really wasn't expecting much of a 13 episode anime in terms of the development of the story, but the amount of fillers will probably result in the abrupt truncation ofthe story  (as opposed to anime where the story is cut short with respect to the manga but have well rounded endings) \\n\\n\r\nThe art is very \"meh\"... They use different cinematic techniques to emphasize scenes but it gets repetitive, which together with the insane amounts of censoring, make the storyline of some episodes difficult to follow. The music just sounds like a cut and pasta from a random anime--I was expecting Dance in the Vampire Bund  to have some good music as in Bakemonogatari)\\n\\n\r\nI will admit that when I published the first draft of this review around episode 3, I was biased biased by the fact that I am a big fan of the manga. Back then, I suggested people to continue watching this for at least a few episodes. But, now I guess that I must say, you should spend those 24 minutes reading the manga =).\\n\\n\\n",
            "date": "2010-01-21T12:54:00+00:00",
            "helpful_count": 55,
            "mal_id": 22573,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/213633.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nomadica",
                "username": "nomadica"
            },
            "url": "https://myanimelist.net/reviews.php?id=22573"
        },
        {
            "content": "At the starting of the winter season Dance in the Vampire bund was touted to be the best of the anime winter line up. However, the show did not amount to all the hype. D in Disorder is a befitting name for this show. Be wary of Spoilers.\r\nStory-The story begins with Mina Tepes (The Queen of vampires) unveiling the existence of the vampire on a game show. What happens afterwards came as a surprise..At first you thought the show was about protecting the existence of vampires and somehow requisitioning a school as a corporate asset will stifle all insurrection.Right. Only opaque flashbacks are shown betweenthe Kaburagi and the heroine. Why did he a werewolf willingly protect the Queen of vampires? We shall never know. Before this show seemed to have that allure of becoming a political thriller in combination with a supernatural series. Instead we get a disjointed story about a guy who has little reason to have feelings towards his so-called master and then an arcane human enemy that we don't know about. I beg the question why didn't a person of the Japanese goverment become an enemy of Mina Tepes in her plans to create a utopian environment for vampires?\\n\\n\r\nThen we have the school setting. Do you really think kids will be a monumental threat to the Queen of vampires designs? These supernatural stories always base themselves upon using the high school setting as their background setting. The main character rebels against Mina tepe's hegemonic rule over his classmates, even though supposedly they have a master to servant relationship. Oh wait, there's more. Yes, if you thought this story was dysfunctional think again. A couple of episodes later.There's a planned coup to usurp the Queen of vampires position. This segment comes after the fighting between her former servant and the vampires. One of the nobles tried to seize power.The servant comes to the aid of his master again even though he tried to extirpate her from top to bottom not to long ago. This show ends with the abortive coup and the consolidating of her power. Let's seize more high schools, so I Mina Tepes have another excuse to show off the litany of flowers on my lavish dresses and bras. If you have a small tit fetish then enroll in Mina Tepes's district now. Overall a lacklustre piece of work, riddled with questions more than answers.\\n\\n\r\nArt-The art is similar to shafts prototypical art pieces. The animation tries to augment the characters with appealing surroundings, but lets face it the animation generally occurs only in a few separate settings. There's nothing remotely beguiling about the art, except in the ending song scenes.\\n\\n\r\nSound-Typical J-pop nothing new to see here at all. The music tries to acclimate to the dramatic points in the plot. However the serious taste in music is not warranted by a less than surpising or predictable outcome. Then we have the gothic music interposed with the vampiric theme, trying to effectually portray the story as a creepy vampire story.\\n\\n\r\nCharacters-First we have the blonde bomb shell herself Mina tepes, who exudes the pretentious little brat role that's quite abound in anime these days. Maybe it's her status of queen of the vampires that is used to justify this bombastic behaviour..Kaburagi is the typical reckless idiot that would make any level-headed question his existence in the show. He also is very naive and  cannot figure anything out regardless if it's placed right in front of his face. Do we need more facile morons in anime, that are pervayers of naivety?The rest of the cast I couldn't care less about.Just a tasteless supporting cast. Nothing needed to be said.\\n\\n\r\nEnjoyment- My enjoyment is poorer than the other categories because I had some remedial expectations for this show. Instead of an enthralling piece of politics with some semblance of realism, we get a inane piece of garbage is poorly executed.\\n\\n\r\nOverall- Some may think I thought of this as an abject failure due to my denunciations. However it's more disappointing experience than an exasperating one. If you want to watch an unfathomable anime that's below average, with horrible execution be my guest.\\n\\n\\n",
            "date": "2010-04-22T11:25:00+00:00",
            "helpful_count": 39,
            "mal_id": 25315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/49636.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Aeonic",
                "username": "Aeonic"
            },
            "url": "https://myanimelist.net/reviews.php?id=25315"
        },
        {
            "content": "Before I begin this review, I would like to make it very clear that I have not read the Dance In The Vampire Bund manga, nor do I have any immediate plans to do so, and this review is based entirely on the animated adaptation Thus, don't complain about how the manga was good, because that is completely irrelevant to how much I fucking hated the Vampire Bund anime.\r\nThe series starts off with an interesting premise, namely a TV gameshow discussing all the increasing amounts of signs that vampires walk among us. Although Vampires are hardly an original premise... actually, they're one of the leastoriginal and overused premises in modern media, but I digress... introducing their existence to the unsuspecting public via the media is certainly a new one. On paper, this reads like a fantastic deconstruction of the vampire genre, but horribly executed and turns into a rather large clusterfuck. Amidst the TV show, Mina Tepes, a small blonde loli girl who looks distinctly similar to Evangeline A.K. McDowell, announces the existence of Vampires, and declares herself to be their ruler.\\n\\n\r\nThe above becomes largely forgettable, though, as something of an Episode 0 sort of thing, and the following episode picks up with the actual plot, introducing our protagonist Akira. I call him our protagonist in the very lightest sense of the word, since from the very beginning it was painfully obvious that the staff behind the show care about one character, and one character only, and that is Mina. Despite being our supposed protagonist, Akira shows next to no personality in the series, being a bland plot vehicle instead. As it turns out, he and Mina go quite a way back, but Akira has amnesia. Apparently, he is a member of the Earth Clan of Werewolves, and is bound to protect Mina.\\n\\n\r\nYes, you read that right. This features both Vampires and Werewolves. Where have I heard that one before?\\n\\n\r\nWhat follows is a rather poorly-paced plot that takes several episodes to truly commence, and when it does, falls flat on its face. Whilst i'd rather not spoil too much, Mina takes a rather drastic choice within the series when the shit hits the fan, and starts to take a turn for the worst as a character. What doesn't help is that said decision seriously clashes with how she is portrayed in the previous episode, making her out to be a rather inconsistent character. At the same time, the plot that ensues is very generic, bland, and completely fails to ignite any sense of interest, with the exception being towards the end when the show begins to pick up.\\n\\n\r\nAll of this, however, is only so much detraction, and could still make for a passable show if it wasn't for my one and only massive complaint about this show: The directing. Put simply, Akiyuki Shinbo needs a good, hard kick in the 'nads for the horrible, horrible job he has done directing this show. For a start, the art style is extremely bland, and the colouring feels very undersaturated, making a very weak atmosphere for the series. But more importantly, the animation is horrific. Not since Evangelion have I seen such blatant corner-cutting, and at the very least Evangelion put it to good artistic use. Here, they repeat animation wholesale, and constantly use longshots, along with some very blatant and annoying censors. And just to put the cherry on the top, when the animation hits its low, can you guess what they did? They mixed in live action shots to save animation, if you believe they would honestly sink so low. But worst of all, the eye closeups. Oh dear lord the eye closeups. There's an extreme close up of an eyeball around every few seconds, or at least once every two minutes. In one episode, I actually counted how many, and guess what? 54. In a single episode. I am not making this up.\\n\\n\r\nIn essence, this show is garbage. It's hard to find more than a handful of redeeming features to it, aside from the fact that the manga might be something passable. \\n\\n\r\nFinal Words: Don't waste your time on it.\\n\\n\r\nAnimation/Graphics: 1/10\\n\r\nStory/Plot: 4/10\\n\r\nMusic/Background: 7/10\\n\r\nVoice Acting: N/A\\n\\n\r\nOverall: 3/10\\n\\n\r\nFor Fans Of: Bakemonogatari, Trinity Blood",
            "date": "2010-04-20T11:02:00+00:00",
            "helpful_count": 38,
            "mal_id": 25248,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=25248"
        },
        {
            "content": "CURRENTLY ON EP 5.\r\nAlright. First off, let's get out of the way, the reason why I'm having trouble with this anime.\r\nFOR THE LOVE OF PISS, SHAFT, LEARN HOW TO ANIMATE.\r\nIf it's one thing I love about the evolution of anime, is how natural animation is becoming. It began early with KyotoAni, who despite being money whores, animate like gods. Clannad was an animation masterpiece, where even the comedy felt natural, everything flowed. This was 2006, mind you. Later on they follwed with The Melancholy, which was a genius mix of character and animation flow. ToraDora was the next piece I loved the animation for. Noweird angles, small movements that just added to the over all picture. And most recently, Kimi ni Todoke, which took it's original style (from the manga) and added wonderful animation to make it a light hearted, lovely anime.\\n\\n\r\nSHAFT JUST TOOK THIS AND MURDERED IT. \\n\\n\r\nThe constant zooming in and about the place as if it were a shitty matrix remake. The crappy mouth animation that dosn't fit the faces at all. The random hair blowing in the NON EXISTANT wind, for no apparently reason. SHAFT isn't being daringly artistic, no, they're just being stupid. \\n\\n\r\nPLEASE, FIX THIS.\\n\\n\r\nOnto the story. I don't hate it, I don't like it. I was looking foward to an intense political drama, from what I've heard of the manga. Instead, I was given a vauge remake (with shitty animation /shot) the seems to more be focused on a romance. So ok, I like romance stories. So I will hold my judgement on this until later episodes.\\n\\n\r\nCharacter. Heck, I could watch this show blind and still know what was going on, the characters are so freaking bland and obvious. I know, I know, anime is not without cliche, but please. PLEASE. Do they have to be /this/ bad? I see little room for developtment/major growth. What I do see, is how this is going to end. However, I will hold out for suprises.\\n\\n\r\nArt. Well, animation aside, the art annoyes me to. It seems rather messy, blotchy, and overly shiney, like a new comer to photoshop who hasn't ever been tutored, or heck, bothered to learn how to use color properly. Mina's hair is about the only thing in the anime I like, in terms of art. This, combined with the animation from hell, means I would probably enjoy watching this blind. However, I don't understand enough japanese to do so. \\n\\n\r\nOverall, this anime has potentional, which it currently will probably never achieve. But y'know what? I'll see it through to the end. Damn it.",
            "date": "2010-02-06T14:38:00+00:00",
            "helpful_count": 29,
            "mal_id": 22992,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70001.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LoonyB",
                "username": "LoonyB"
            },
            "url": "https://myanimelist.net/reviews.php?id=22992"
        },
        {
            "content": "I dropped this anime after four episodes so this is a negative review.\r\nI didn't read the manga, I don't plan to, I don't care how good it is in comparison.\r\nThe story gets a 3 because it has vampires. Vampires are awesome but here, they are lame. Really lame. Seriously, the story doesn't even make sense. I mean it's okay if the queen of vampires is rich, like the richest in the world, but being able to pay off the \"entire debt of Japan\", this is BULLSHIT!! Besides, nobody knew about the existence of vampires because they were \"hiding\" for millennia. That's okay, I think it'sgreat that they keep their existence a secret. But collecting money for thousands of years without ANYBODY noticing their wealth, it's like taking humans for retards. \\n\r\nBasically, it's like vampires were running the world economy but nobody knew it was them because nobody knew they exist and that is bullshit.\\n\\n\r\nThe art is good, nothing else to say here. It gets a 7.\\n\\n\r\nI didn't pay attention to the sound, so can't say it's good or bad. Neutral so 5.\\n\\n\r\nThe characters suck. I hate fake lolis. Mina's been living for ages yet she tries to impress high school students with the statement of a math formula. I can do it even without living for millennia. It's like: \"Look how awesome I am, I know basic math formulas even though I'm a loli who lived for so long I crap fossils\". There's nothing impressive here. And why stay a loli when you can be hot, with a mature ladylike body (the body gets +2)? Just for that, the characters gets a 0 and a +2 for the hot body.\\n\\n\r\nEnjoyment... The first episode was bitter because it was too slow on development. Watching the second one was like shoving food up your ass till it comes out from your mouth. I don't enjoy that.",
            "date": "2010-02-28T08:52:00+00:00",
            "helpful_count": 27,
            "mal_id": 23590,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/298347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PCS1881",
                "username": "PCS1881"
            },
            "url": "https://myanimelist.net/reviews.php?id=23590"
        },
        {
            "content": "If you're going to watch this anime, do me a favor and watch the Blu-ray version. The TV version is so horrible that I even consider giving this anime a 6 once. \r\nNow for those who are too lazy to read:\r\nPros:\r\n+ Good art and animation (Blu-ray version)\r\n+ Great and well-developed character\r\n+ Interesting Plot\r\nCons:\r\n- Forgettable soundtrack\r\nIn-depth review:\r\nDance in the Vampire Bund. Looks like a good anime when i looked through the list of animes. Well, it's animated by SHAFT right? Let's give it a try then. \r\nStory: 8\r\nIt's about a vampire princess building her own country with her lover. Nothing interesting, right? The show starts offslow, but later the story progress at a better pace. The world-building aspect in this anime is good, makes you feel that the world is big and full of vampires. Some situation is predictable, but it's still fun to watch.\\n\\n\r\nThe anime is mostly romance, developing the relationship of the two main characters. But it has it's fair share of action and it's pretty good.\\n\\n\r\nThere is fanservice. But it's not that bad and fits the story.\\n\\n\r\nThe ending is a read-the-manga ending because from what I know, there won't be a second season.\\n\\n\r\nArt: 7\\n\r\nIf I was watching the TV version, I would give it a 5. Animation in the TV version is choppy and ugly, whereas the blu-ray version is superior but still doesn't look like what I would normally expect from SHAFT.\\n\\n\r\nSound: 7\\n\r\nOP and ED is catchy but forgettable. Background music is very fitting to the show.\\n\\n\r\nCharacter: 8\\n\r\nWe have our main characters, Mina Tepes and Akira Kaburagi. Mina is not your annoying as hell loli and has a strong personality with a dark side to it. Akira personality is pretty typical, but he's not and overpowered MC like other animes. Side characters don't show up often in this show, But when they do, they make a good impression and is pretty darn memorable.\\n\\n\r\nEnjoyment:8\\n\r\nExepct from the first episode, every episodes are good and enjoyable. \\n\\n\r\nOverall: 8\\n\r\nLike vampire animes? Want some romance anime with a mix of action? Or you just simply want to see some naked loli body? This anime is for you\\n\\n",
            "date": "2014-11-04T02:14:00+00:00",
            "helpful_count": 18,
            "mal_id": 167375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3563225.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/spiwar",
                "username": "spiwar"
            },
            "url": "https://myanimelist.net/reviews.php?id=167375"
        },
        {
            "content": "To me, this series is almost two separate beings: on one hand we have a highly intelligent show about political maneuvering and possible anti-discrimination undertones, while on the other hand we have a lame action show about large breasts. I can't say \"characters with large breasts\" because absolutely every female character (besides the princess in her normal form, ironically) has such abhorrently large ones that they dominate the screen.\r\nI supposed some viewers don't like the fact that SHAFT messes with the chronology and creates scenes that aren't in the manga, but I enjoy this. I don't want to to simply see a manga in motion;I want a different artistic experience. For example, the first episode of Dance was a parody of Japanese variety shows and was completely original--and so far it's still the best episode in my opinion.\\n\\n\r\nAnyway, if you like action and \"hot babes,\" you'll probably enjoy this show much more than I do. For now, I'm going to d/l the eps every week and hope they stray from the fanservice and delve deeper into the political aspect.",
            "date": "2010-02-10T12:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 23121,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/wickedlame",
                "username": "wickedlame"
            },
            "url": "https://myanimelist.net/reviews.php?id=23121"
        },
        {
            "content": "\"Still a better love story than twilight.\" No, but seriously now. This was phenomenal!\r\nI knew this show existed via cover art that I've seen in various places. So, I decided to take the time to watch it when it was finally recommended through another show. I figured vampires usually make something interesting to watch. This show was no exception and stole my complete attention until it was over.\r\nNo spoilers, but slight references possible.\r\nStory: 9\r\nSimply put, supernatural love story. I mean a good one too! This story did, however, take time for me to wrap around but it gets better. In other words, give it anepisode or two and hold on. In a world inhabited by both humans and vampires, they'll need to live like good neighbors. This is the premises. It gets even better when love is against the odds. Just let the feels roll out.\\n\\n\r\nArt: 9\\n\r\nThe art was very well done. I'm thoroughly pleased with the level of eye popping goodness contained within this series. The animation was nothing short of greatness. However, the cut-scenes and transitions were something... peculiar. I don't know how to phrase it but the camera angle goes all over the place. \"Eyes\" were focused on the majority of the time. It left me concerned, rather disoriented but I went with it.\\n\\n\r\nSound: 9\\n\r\nThe music was great. I really picked up on it and couldn't say anything bad. \\n\\n\r\nCharacters: 8\\n\r\n\"Why isn't this a 9 too?\" That's because of my personal feelings toward different areas of the anime. Without spoiling anything, sometimes I wished a certain person would have died because they were ALWAYS AROUND and had NO real reason to be. Don't worry if your don't get it or finished it and still don't understand. Anyways, the characters were great during the whole time. The main male character is a good person and shines when he shows it. As for the female, or queen, she has one of the best personalities I've witnessed. How the story plays out with all of them is just to good.\\n\\n\r\nEnjoyment: 8\\n\r\nI really liked this and will continue to like it. There was no mistake in my mind that this was something great to watch. I even spread it out to make sure I was in the right mood just so I wouldn't spoil it. \\n\\n\r\nOverall: 9\\n\r\n*Claps* I'd watch it again. Funny enough, I thought of games like bloody roar when people transformed. I couldn't stop thinking that way. The anime delivers a truly lovely story during it's span of 12 episodes. I couldn't recommend it more, especially if you like vampires.",
            "date": "2013-11-14T18:20:00+00:00",
            "helpful_count": 14,
            "mal_id": 120267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3309037.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/finalchance531",
                "username": "finalchance531"
            },
            "url": "https://myanimelist.net/reviews.php?id=120267"
        },
        {
            "content": "Due to the overwhelming amount of negativity in this anime i decided to write this review.\r\nDance in the Vampire Bund was an anime that caught my attention completely by accident stumbling on a video while exploring the internet. I was immediately immersed within the story. While yes the main plot behind the anime, (boy loses memory, cant remember girl/ promise with girl, goes through adventure to regain memory) is a bit cliche and the whole amnesia thing is truly overused but the story and presentation of this is truly magnificent. \r\nAkira the main character  initially has a cases of memory loss when Mina TheQueen of the Vampires, rediscovers him after a long absence. At the same time Mina is making the existence of Vampires public. What ensues is a mixture of the occult, graphic violence, political entanglement, struggling with oneself, and romance.\\n\r\nNow Dance in the Vampire Bund is not without its own faults, the story seems to be choppy, and not entirely planned out as well as the complete open ended way that the final episode ends, begging for a second season. Despite this, the story will always have you asking questions all the way to the end with very dramatic and interesting ways to answer each and every one of them. The art of the anime was beautifully done, many panoramic scenes, and stunning visuals.. this is a dark anime, somehow though they don't overuse this aspect so the anime still seems light and in some areas cheery. \\n\\n\r\nChanging the subject a bit,while i dissagree with many other people on this anime one thing t i can agree with other reviewers is why? It seems there are no reasons in the beginning as to why Akira does anything at all, changing from ignoring her, to helping her, to ignoring her again, then fighting against her, to once again being at her side. I believe this has to do with how he is gaining his memories back, but this wasn't truly evident in the anime. \\n\r\nAll in all though this anime does a wonderful job at what anime should do which is entertain.",
            "date": "2012-04-24T19:04:00+00:00",
            "helpful_count": 12,
            "mal_id": 59559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/976225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lokidemon09",
                "username": "lokidemon09"
            },
            "url": "https://myanimelist.net/reviews.php?id=59559"
        },
        {
            "content": "So, I basically adore this anime. In my opinion, it's better than Bakemonogatari, another SHAFT production directed by Akiyuki Shinbo. You should know that Shinbo is quite an auteur. His shows are positively smeared with his unique timbre. If you don't like other works from Shinbo, you won't like this one either. This show is directed intelligently schizophrenic: zoom, cut, still frame, cut, blur, cut, shot of seemingly unrelated object/scene, cut, dialogue, cut, wide-screen, inverted colors, etc. Despite all this, it's not confusing. Instead, it's exhilarating. Staccato. Fast. MTV on speed. Never boring.\r\n\"Intelligently\" schizophrenic, because none of the cuts are actually random. Every movement hasa purpose, not a wasted note is to be found. Sometimes, just when the dissonant camerawork and cut scenes seem about to overpower, it resolves into a beautifully harmonic scene. Sometimes the artwork is truly beautiful, like the shock-waves through flowers (cleomes, which only bloom at night)in the opening, and sometimes it's twisted, like a few of the vampires' true forms. \\n\\n\r\nIt may be avant garde, but it is by no means pretentious. Rather, it is a drunken romp flavored with gore, eroticism, dry humor, and pulp. It starts off sober enough, as most drunken romps do, but, well, you know how those Friday nights go… By the end, it sobers up into a pretty love ballad, and finishes quite touchingly with an epic and emotional finale. \\n\\n\r\nIt's often hard to tell if the story's continuous or not. Just as distortion allows a punk rocker to hide wrong notes and sloppy technique, the mania of this show obscures its sanity. When the show hits a sober note, it is ofter startling. One particularly delightful moment in the story was the parable of the butterfly and the flower who looked like a butterfly. The butterfly tries desperately to court the still flower, who never responds to him. As one of my favorite characters says, \"no matter how strongly the butterfly feels, he will never be together with a flower.\" The music this series dances to is the weakest link. Even so, it is delightfully gothic during the episode, pretty and energized before, and raunchy after. \\n\\n\r\nI thought this would be a controversial review considering the negativity this show has gotten here, so I checked the ratings distribution over at animenewsnetwork. This show is considered \"very good\" by a strong mode, though the average is drawn lower by a minority who find the show to be \"worst ever\". This means the people who dislike it are the most vociferous, not the most representative. What I'm getting at is that you, dear reader, shouldn't be scared away by the negative reviews. \\n\\n\r\nHere's a guide to see if you like it: 1. Did you like the manga if you read it? As far as I know, everyone who was a fan of the manga hated the show. You might be the exception, but not likely. 2. Do you like SHAFT? If so, then you have a greater chance of liking this release. 3. Do you pick up on dry humor? Almost every anime I've seen that's not a comedy or pretentious \"art\" (such as haibanme renmei) has some level of dry humor. If you don't really pick up on that stuff, a lot of this will seem boring to you. 4. Can you tolerate inappropriate fan service? Our 100 year old protagonist has the body of a ten year old, but definitely has tendencies belonging to much older females. 5. Watch the first episode. If you are one of the few who liked the first episode, then you are most likely going to enjoy the rest of the series. If you hate the first episode, don't bother with this series.\\n",
            "date": "2010-07-09T17:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 28191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332142.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seabury",
                "username": "Seabury"
            },
            "url": "https://myanimelist.net/reviews.php?id=28191"
        },
        {
            "content": "~*Dance in the Vampire Bund*~Review (revised):\r\n •     Story: Dance in the Vampire Bund is the anime adaptation of the manga with the same name. The author is Tamaki Nozomu,well known for his ecchi and hentai mangas, so we didn't expect too much from him either way.In this anime we have a blonde moe prepubescent girl (most likely twelve years old) that never ages. We also have the bishōnen Akira Kaburagi Regendorf (the first two names are japanese ,but the etymology of the last name is a little complex,\"Rege\" means  in romanian \"king\", but I'm not sure if themangaka named him knowing this detail). As for Mina Ţepeş's name,her family name is derived from the Vlad Ţepeş (meaning Vlad The Impaler) also known by the surname Dracul or later \"Dracula\". Vlad was referred to in several documents as \"Dracul\", which  means \"Son of the dragon\" and points to his fatherl, who received that moniker from his subjects because he had joined the Order of the Dragon. Dracul, derived from the Latin word Draco meant \"dragon\", though in modern Romanian it means \"devil\".\\n\r\nNow, returning to the story... The anime introduces the viewer to the main characters, Mina ( the above mentionated loli vampire ), and the  bishōnen Akira , which is later revealed to be  a werewolf ( love between a vampire,how original ). Akira-kun is the knight in shiney armor that wants to protect his lady ( Mina ) and rescue her. The intial story line shouldn't be taken so serious,since it is more of satire/parody of what modern japanese people about vampires, attributing many distorted concepts. Therefore,alternating the mythology in order to appeal to the modern audience.  Per total the story wasn't meant to be a deep,complex and emotional story full of unexpected story twits, but more of a parody. Therefore  the story seems constrained  to take a serious turn,and even when it finally does it feels out of place and clumsy. This anime achieves more being a comedy/satire than it achieves being dramatic.\\n\r\n  Story: 3\\n\\n\r\n •    I've always liked and admired SHAFT for the excelent animation and art, because of the master pieces animes such as Sayonara Zetsubou Sensei, Kino's Journey: The Land of Sickness -For You-, Maria†Holic ,Bakemonogatari etc.  I can't say that I don't enjoy this anime's graphic same as the others,that would be a lie. It has good animation,interesting visual effects and innovative visual concepts. However, the story drags down the art,with its clichés and  fanservice, especially from a loli exchibitionist like Mina. The fights scenes are decent,verging on average ...\\n\r\n  Art: 6\\n\\n\r\n •    The music was good, but nothing out of the ordinary.The Opening Theme  Friends by Aiko Nakano and Ending Theme  Tsumeato by Hibiku were fine,and agreable but nothing surprising,interesting and kind of wanna be a deep song or something like that.I liked it,but they are far from being my favorite japanese songs.   \\n\r\n   Sound: 7\\n\\n\r\n •    The characters may seem at first glance  full of clichés. Their personality  may seem apathetic , even when they face situations of emotional intensity. That may be because the mangaka focused more on the superfical aspects of the characters, and less about their inner selves.However,as the story progresses, the characters seem to gain more substance,being more believable in the interactions with each other. The  character that I empathize/symphatize most with  is Akira, he is just a normal teenager surrounded by unusual circumstances. And never forget: A single word:FANSERVICE. A lot of fanservice, especially loli fanservice. They don't really have a role or any purpose whatsoever, the complexity of one's character is not that important.\\n\\n\r\nAdded:Watching more episodes, I realised the characters do have some development. However, the characters remain the weakest point in the anime.\\n\\n\r\n Characters: 3\\n\\n\r\n •    I really do hope that this anime will have in the future a more serious plot, and that the mangaka will be more serious about it, after all, it's offensive to us readers.The idea was quite interesting and it could be a lot better and complex, but it turned out to be quite  clichéic story. I really hoped for more...   \\n\\n\r\nEnjoyment: 3\\n\\n\r\nOverall: 4\\n\\n\r\nNote: I have made a review of this anime back in 2010, when the first episodes appeared. At the time I was angered by the lack of historical knowlege that made people misunderstand a few things about the vampire concept. However, as of 22.02.2013, I changed my review and ratings, toning it down, and presenting the anime in a more favorable light, without being blinded by subjectivism.",
            "date": "2013-02-22T04:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 87553,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/195069.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/-Ereya-",
                "username": "-Ereya-"
            },
            "url": "https://myanimelist.net/reviews.php?id=87553"
        },
        {
            "content": "As even the Manga isn't finished, the 12 Episodes Anime will probably just cover the story till chapter 32. Well at least I hope so, and I really hope that there will be a second season. Well, yes I've read the manga and seen the Anime... But I don't want to compare it... I'll just write a review for the Anime as it is:\r\nDo you remember Hellsing? Yeah, cool guy with cool sunglasses, and a gun which is taller than the one of Vash the Stampede... That's what a true Vampire-King is about!... Well, let's summarize the Vampire-Queen from DitVB: A cute little Lolicon-princess, whenyou see her you would like to hug her and pat on her head... Cute little girley! Oh well... Yes she looks as terrifying as a poring (Small pink enemy ball in Ragnarok Online)... Well... But, even if the first few episodes of this don't show the real intentions and character of Mina, she can be quite hardcore... Well in fact the characters are good as they are. I like them! I like hime, Akira, the dumb glassed megaboob president pedo girl who loves her little brother, yeah and even yuki, who is the normal girl in this anime... Yeah... They are nothing special, nothing new, but all the categories are there. So everyone should be happy...\\n\\n\r\nWell if I were to rate the first few episodes, this anime would have a score about mh 4 or so. I read the manga after I watched the anime. So I was confused sometimes about the scenes, there were holes in the storyline and somehow it seemed cutted... Hm, but after a while it got better, you get to know more about the characters and the bund... You'll learn a few secrets, you get to see some action, some moe and some ecchi... Well, in fact I don't give such a high score for an serious anime... No it's a high score for a lightweight anime. Yeah, you can search for a deeper meaning, and you'll even find it. Yes, you can read the manga and the story'll develop in a much clearer and more interessting way... But oh well let's write a fazit:\\n\\n\r\nIf you want to watch a good Anime with some weaknesses, but a lot of entertaining scenes: like action, romance, ecchi and so on... Hey it's ok watch DitVB. If you don't take it to serious it's a very good anime. Else read the Manga, but I belive if you don't like the Anime you won't hype the Manga as well.",
            "date": "2010-03-22T22:57:00+00:00",
            "helpful_count": 9,
            "mal_id": 24231,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302476.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimizeEU",
                "username": "AnimizeEU"
            },
            "url": "https://myanimelist.net/reviews.php?id=24231"
        },
        {
            "content": "Just to clarify this anime has more action scenes than it has romance so its nothing like the american movie twilight at first I thought so than it hit me it is much better and likeable I mean vampires are known for sucking blood with out it they may as well humans with a long life rrriiiggghhhttt\r\nOk so at the first glance my first thought was lollycon alert \r\nI mean an almost naked barbie doll definitely some thing isn't right here. but since I enjoyed shows with vampire I decided to watch it and despite what some have to say I think in terms ofentertainment it has provided me a sufficient amount. I mean the reason we watch anime is to escape boredem right and yes this helped me out on that. \\n\\n\r\nNow I don't want to talk about any major spoiler and seeing as I just finished the anime my memory of it is quite sharp. So lets see well I learned that unlike many other series which have 12 episodes which is consisted of one arc this has 2 arcs each has 6 episodes which was a nice turn of events. So from that I can tell you that this is indeed a fast paced anime with a epic if not amazing story which makes you think of vampires in a different manner.\\n\\n\r\nNow the art hhhmmmmnnnnn well have you ever watched the monogatari series if not watch it cause they are quite similar in terms of one of the main protagonist being a vampire. Well the animation used is quite decent I haven't read the manga so I couldn't give you the a proper description of whether or not the art work is similar as I have not seen a lot if  it my self. but never the less in the anime its is quite decent and the flow of animation is smooth in nearly all scenes there are one or two scenes which could have been animated better but hey it look awesome overall any-ways so you know i bet you guys wont event notice it the only reason I noticed it cause I tend to be very observant when it comes to watch an interesting anime.\\n\\n\r\nThe characters now here is an interesting topic vampire + wearworlves cleache much. I said and done a thousand times in countless novels but in all honesty this is my first anime in which this has actually happened. So in term of anime i think this is an original love between 2 different character of different races. one of the things i like abut this is this anime has got character development if anything else. \\n\\n\r\nI want to write ssssooo much more but anymore and I will probably will be spoiling it for all of you and considering it has very short arcs any-ways then what's the point in watch if you know what is gona happen so thanks for reading pls watch and enjoy this anime.\\n\\n",
            "date": "2013-12-19T02:14:00+00:00",
            "helpful_count": 8,
            "mal_id": 124597,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2152369.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Devastator004",
                "username": "Devastator004"
            },
            "url": "https://myanimelist.net/reviews.php?id=124597"
        },
        {
            "content": "Dance in the Vampire Bund\r\nThere's been time when I felt a certain kind of curiosity to know about the genesis of vampire fiction and the root of this popular and discussed genre.So,obviously,I searched on google.Learned a little about Vlad the impaler.So,afterward,as I got the basic idea,I intended to watch some anime series about vampire.Despite of some people's opinion,I do not think that vampire stories in anime is bad.In most of the cases,the storyteller uses his imagination and makes a vampire which have superpowers or they don't have to bite or they don't get burned in the sun etc.So,yes,This show is no difference.But among the vampireanime out there,this one should be kept on top of the list.I can assure you,this show is worth watching.Only 12 episodes,aired in 2010.Produced by Shaft,Genco,AT-X and flying dog etc.This anime was licensed by FUNimation and later on it got  dubbed .So,obviously I watched the dubbed version and no complain there.But on youtube,the dubbed version you'll get is actually fandubbed.So better not to mix up.\\n\\n\r\nSynopsis:Right at the very beginning,the viewers didn't get any idea how this series supposed to get.It all started within a television show about the existence of vampires.Where several people related to the topic were invited.And at some point,a beautiful lady was introduced and she claimed herself to be a vampire.That's the moment where everything started to get messed up.A little girl from the audience,Mina Tepes,made a drastic move creating an intense situation.At the end of the 1st episode,things got hung in a very bizarre situation.Afterwards,the story moved on quite fast.A regular school boy named Akira was introduced to the show.But just like other stories,he has a mysterious past and identity.And apparently,we learned that Mina Tepes the main character of the series,has a rational goal for both draculas and mankind.Among the few things, I loved the pacing of this show.It brought up incidents that were supposed to happen in that time of the storyline.\\n\\n\r\nTheme Setup,Music & Artwork:I just loved the direction.The theme was deliciously dark as a horror show supposed to be.The time setting was present japan.But the churches,building structures and the other enviroment mixed up perfectly to give you a majestic experience.Moving on to the music,I can't recall any track from the ost.Doesn't mean that it was bad,it was decent in my opinion.The opening and ending tracks are the same,they just got turned over in the halfway of the series.I liked them both.One is called \"Friends\" and the other one is titled as \"Tsumeato\".Proceeding,the artwork was perfect.You are supposed to love the glossy effects.Every character looked charming.And one thing I would like to mention is that the aspect ratio changed depending on the mood of the situation.May seem trivial,but it made the scenes even more dramatic.And about the animation,I would say that it was crafted as smooth as the artwork.\\n\\n\r\nCharacters Setup:First of all,Mina Tepes,the Vampire disguised as a little girl.She is the princess of the ancient covenant and ruler of all vampires.She is the strong female protagonist you ought to like.As she holds the throne,she makes the most tactical decisions and can manipulate her co-workers well.Moving on to Akira,he is the of strong and devoted character,which can be seen very regularly in lots of anime.At the beginning we learned that he lost his memories by an accident.And afterward,he gains his memory back.And meanwhile in the process,he got enough character development.Moving on,there was a girl named Yuki we saw from the beginning.She loves Akira,but as usually, there are complexity.She got enough screentime.And sometimes she acted as a narrator.So basically,they are the main characters of the show.As for supporting,Nella,Nelly and Vera were at the side of Mina.From the school,Nanami had some more story.Hikosaka,Kuje and Takashi were used to be Akira's friend.And as a teacher,sister Laura gave us the general idea of the institution.Beside that,as the story progressed,bunch of the other characters came in from the ancient vampire monarchy,the government and etc.\\n\\n\r\nOverall Rating:\\n\r\n                           MAL Rating: 7.25\\n\r\n                           My Rating: 9.0",
            "date": "2015-06-10T07:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 189994,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4286249.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Rafiul",
                "username": "Rafiul"
            },
            "url": "https://myanimelist.net/reviews.php?id=189994"
        },
        {
            "content": "Hmm... what to say about Dance in the Vampire Bund...well personally I like the manga better but there is still much to say about the anime.\r\nStory: \r\nI found the plot interesting. However, the anime storyline lacks very important information. We the viewers are constantly wondering why something happens when it does which I personally found VERY frustrating.\r\nNot to mention the ending where we're all left hanging...which I hated because now we have to wait to see if they make a sequel so we can find out what the hell really happened.\r\nArt: \r\nThe animation in this anime was fantastic! Shaft really did a good job ofmaking everything so life-like and realistic. My favorite part is where the camera moves up and gives a full range of the body of the character and then focuses on the eyes that are obviously a personal touch done by Shaft.\\n\\n\r\nSound:\\n\r\nThe opening to the anime was well to put it in simply boring. It did not really suit the mood of the story at all.\\n\r\nHowever, I personally liked the closing to the anime. It is not something amazing but it does provided a simple yet catchy ending song to the anime.\\n\\n\r\nThe background is excellent you can hear every sound.\\n\r\nThe voice actors are well fitted to their characters in a way that you cannot imagine anyone else voicing them.\\n\\n\r\nCharacters:\\n\\n\r\nWhile most of the characters are...with lack of a better word their stereotypical.\\n\r\nMina is the only one who shows more depth with her sarcasm and all mighty personality.\\n\r\nAlthough I personally did like the anime only character Mei Rin, the cracking sound when she bites hard candy just gives me a chill. She is a bit too forward with Akira but I personally found it funny how she constantly tried to make him uncomfortable.\\n\\n\r\nEnjoyment:\\n\r\nI received much pleasure from this anime. Although lacking in storyline and in depth of the characters. This anime kept me on my toes, it kept me wanting to know more. I watched each episode trying to figure out what was going to happen only for the episode to end in a way I did not expect which was thrilling but also a little frustrating at times.\\n\\n\r\nOverall:\\n\r\nOverall I would rate this anime a 10 just because of my personally enjoyment. Nevertheless, for the sake of other people who do not quite share the same opinion I would rate this anime a 7.\\n\\n\\n\r\nYou might not like this anime if you hate vampires or werewolves.\\n\r\nIt has many political things, which I know a lot of you readers find to be boring.\\n\r\nThere is some blood and gore so if you are not into that then you should probably avoid this anime. \\n\r\nIf you are super into sugary sweet romance then you are not going to like this anime, however if you like the whole forbidden love thing then this anime is for you.\\n\\n\\n\r\nNow this is my personal opinion and I am not forcing any of you to share it.\\n",
            "date": "2011-08-22T04:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 41927,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403834.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Taylorgg12",
                "username": "Taylorgg12"
            },
            "url": "https://myanimelist.net/reviews.php?id=41927"
        }
    ],
    [
        {
            "content": "In one of SHAFT's latests, Dance in the Vampire Bund, there is actually very little to dance about. SHAFT usually has a knack for finding strange source materials and then adapting them in interesting new ways that break the troupes of their genres. Usually is the key word in that last sentence. I'm trying to write a non-bias review, but it's inevitable to say Dance in the Vampire Bund is not a good anime. But! At the same time it isn't a terrible anime. But what Bund is, is absolutely average. There's nothing this anime does to set it apart from other second-rate anime aboutvampires or political conquest. At first, everything that happens you'll feel like \"Hey well I kind of thought that was coming\" and by the end you'll be like \"Wait? Was that a plot twist?\" Note that is a review on the anime only and from what I've seen of the manga, this is a poor adaption of what could have been a much better experience.\\n\\n\r\nStory: 4/10\\n\r\nMina Tepes, the vampire princess has decided to establish a safehaven for all vampires. Through various means she gains political ground for the establishment of \"the Bund.\" Of course, exposing to the world that vampires exist and that they will be Japan's next door neighbor is troublesome and the events told in this story are about them. I think. Mina also happens to own some fancy Japanese High School where our protagonist attends and our protagonist also happens to be a werewolf whose dad works directly under Mina who also happens to attend her own school. Huh? I'm confused too. The story becomes derailed whenever Akira, the protagonist, is focused on, because to be frank, the anime isn't about him. It's about Mina Tepes, but SHAFT decided to make the back plot some nonsensical love story (which only resolves with loli-rape - I'm dead serious). Oh, and be warned, there's most likely a sequel coming.\\n\\n\r\nArt: 5/10\\n\r\nOho. SHAFT is one of my favorite animation companies because they always do interesting things with their anime and try and tread new grounds by playing with color or 3D elements or optical illusions. SHAFT is also one of the most underpaid and overworked studios in the current anime market and thus they have an incredibly low budget. The only reason I can make sense of why Bund's animation quality was so low was because at the same time SHAFT had been working on the eye-candy \"Hidamari Skecth Hoshimittsu.\" Almost everything about Bund in comparison animation-wise fails. The character movement is repulsive and over-dramatic. Every time a character does something they have a strange angle placed on them, then a zoom onto a random body part, followed by a slowed sentence that it wouldn't matter if it was even said or not. The only time you really see SHAFT's personal touch is when they zoom in on the eyes of the characters talking, which by the end of the anime was more of a nuisance than a pleasure. The clarity was also a huge problem. I started watching this anime in low quality TV rips, and then moved up to bigger and better looking files. There was no difference. The entire first episode had this weird green tint to it that made it unpleasing even to look at. The clarity fluctuates too (how fun!), so it's hard to enjoy when you have to up the brightness of your media player to view the episode normally. Oh, and other than Mina, every character looks boring. The main character looks like every other cliche male protagonist, and there's nothing even to set him apart from the other characters visually. Yuki, one of the female characters, is almost as interesting as Yuki from 11eyes (Note: Yuki from 11eyes sucks and she looks generic). I still like SHAFT's animation style, which is a plus for this anime, but the moments of camera genius that often appear in other SHAFT works are definitely missing here.\\n\\n\r\nSound: 7/10\\n\r\nNothing to complain about. The opening and ending are both nice but nothing memorable. Character voices are fitting (I enjoyed Mina's) but once again aren't anything to flaunt. BGM was quiet and rather uninteresting most of the time, but nothing bad.\\n\\n\r\nCharacter: 4/10\\n\r\nVampires, werewolves, tigresses, oh my! DERP. Mina Tepes is the one interesting character in this entire anime and every other character exists solely to support her. She's the under-estimated soon-to-be queen of vampires who tries and fights the old traditions of vampires to finally reveal her people to the world so they will not longer be persecuted. Kind of like a Martin Luther King Jr. of vampires, except in the form of a ten-year-old girl and not black. Hey, strong lolita leads are cool in all (Pani Poni Dash! I'm looking at you) but SHAFT needed to realize that there were other characters in this anime. The list includes a Chinese Tigress, a blood-sucking \"older sister,\" a vampire with massive eyebrows, a priestess, and about thirty five thousand big breasted women. There's actually very little to say about any of them except that they're bland. As soon as they're introduced you know exactly what their personality is. Mina is the only dynamic developed character, and thank god she is, because more than half of the anime is spent following her around. Akira on the other hand manages to grab as much time as Mina and ends up wasting it all. He's inctredibly undeveloped and the only point of appeal (kind of) is that he is a werewolf. COOL (BUT NOT REALLY). Even when he's a werewolf he most of the time gets the crapped knocked out of him and that's when a Deus ex Machina comes into play. Yuki is also an undeveloped annoying \"for some reason it's a harem\" bitch who gets in the way of the main \"relationship\" between Akira and Mina. She has absolutely nothing that separates her from other female characters in any anime ever and could easily be a background character that accidentally wandered onto the foreground.\\n\\n\r\nEnjoyment: 5/10\\n\r\nSHAFT tries to do the impossible and fails when they tried to make a show about political warfare with a touch of \"romance\" and then ended with a harem and fighting with plot twists as original as \"I AM YOUR FATHER\". It's frustrating seeing how much potential this show had. I can safely say that after such a thrilling experience I wiped the anime off my hard-drive and will have probably forgotten most of it by tomorrow morning.\\n\\n\r\nOverall: 5/10\\n\r\n That isn't to say that there aren't worse anime, because hot damn there are. I thoroughly enjoyed when Mina was on camera and thoroughly disliked whenever she wasn't. The annoying \"wait for season two where we explain what the final episode was even about card\" is pulled too. The only thing I can say is that for an anime about vampires, this show falls right into the pit with the other ones already out there, and unlike Hellsing, does not bring massive guns or blood. It brings one thing and one thing only - Mina Tepes - and if you don't like it, then this anime is definitely not for you.",
            "date": "2010-04-21T17:57:00+00:00",
            "helpful_count": 182,
            "mal_id": 25288,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207137.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Detective",
                "username": "Detective"
            },
            "url": "https://myanimelist.net/reviews.php?id=25288"
        },
        {
            "content": "To be honest, it's really surprising to see so many reviews giving Vampire Bund such a low score. For me, it was absolutely the best vampire anime I've ever seen. I can't really say that I'm obsessed with vampires, but it's certainly an interesting genre. Unfortunately there isn't really a lot of animes which use this theme to its fullest. In that sense, Vampire Bund has managed to utilize all the glory of the vampire legend and myth.\r\nStory: 10\r\nAs it goes with most vampire stories, Vampire Bund's plot revolves around the vampire princess, or vampire queen. However, it's really the subtle things that impresses methe most. I suppose most people would just pass them off as whims, but SHAFT has a knack at making an impression of the subtlest things which brings the plot together. Most vampire stories seem to forget that time moves, and are always trapped in one time-frame but Vampire Bund is nothing like that. Vampire Bund's story spans centuries of vampire history and glory, and the darkness within. It shows that vampires are not just creatures sleeping in coffins locked away in the middle ages, but also advance in technology and culture as humans do. It's an enormous theme and it's certainly not an easy task to depict it, but SHAFT does a great job. I suppose most people expect there would be a 2nd season because there's still another last boss and because of the manga, but if I'm not wrong, SHAFT doesn't intend on making a sequel. It's a lot better leaving the ending as it is and letting the audience imagine the story after, or just read the manga.\\n\\n\r\nArt: 8\\n\r\nIt doesn't get any better in abstract animation than with SHAFT. They make the simplest scenes look cinematic and grand. It seems they have been slacking a lot since ef, though. Basically, there's very little movement and lots of shadows. Vampire Bund seems to be lacking in the shadow effect SHAFT loves so much, however. In a sense, it could have been a lot better. However, it's still very impressive nonetheless. \\n\\n\r\nSound: 7\\n\r\nThe OP and ED are not the best you can get from anime songs, but it's complimentary. On the contrary, the sound effects are excellent, as expected from SHAFT. Many scenes would have been very empty and felt meaningless without the sound effects, but SHAFT always makes it worthwhile with the perfect timing and tone.\\n\\n\r\nCharacter: 8\\n\r\nAs it is, the story revolves around one person, the vampire queen. But this doesn't mean everyone else are just pawns. Yes, the side characters may seem to have very little screen time, but they make a powerful impression every time they come onto the chess board. Unorthodox as it may be, Vampire Bund never depicts the mains as powerful and unbeatable. Instead it shows that they bleed and feel the pain, and don't live on their own but are supported by various characters. \\n\\n\r\nEnjoyment: 10\\n\r\nVampire Bund is one of the few animes I've managed to finish in just a day. It's so enjoyable and interesting that I couldn't take my eyes of it. The conversations, culture, history, philosophy, and action makes every minute worthwhile. I haven't read the manga, and I probably would in a while, but I doubt I would enjoy it as much as the anime. It's beyond my mind that the beautiful abstract animation by SHAFT can be depicted in manga form.",
            "date": "2010-07-19T06:56:00+00:00",
            "helpful_count": 172,
            "mal_id": 28629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46781.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lonehunter88",
                "username": "lonehunter88"
            },
            "url": "https://myanimelist.net/reviews.php?id=28629"
        },
        {
            "content": "Okay, so Dance in the Vampire Bund. Or Bland, as I call it. First off, I had to look up what a bund was, because I thought I was missing something. Turns out I wasn't. It's just bad. I won't just stop there though, I will explain in detail why I think it's bad.\r\nStory: 3\r\nImagine if you will, the most painfully generic and dreadful story you can think of. Take what's chic. Vampires, right? Yeah, I mean, everybody loved Twilight, right? They'll like it even more now! Since you know, vampire shows haven't been beaten to death since the 1931 film version of Dracula. Thevampire, in this story, is Mina Tepes, the descendant of Vlad the Impaler we can only presume. Since you know, he was definitely a vampire, because that's what Dracula says. This time around though, the poor little vampires just want to be peacefully accepted into society. Two things come to mind when I hear this, the first being Mary Shelley's \"Frankenstein\" (1818), where a \"monster\" tries to integrate itself into society, and is nonetheless feared and shunned by everybody. The second is the anime Vampire Knight, where vampires and humans already co-exist to a small degree in a school setting, where the 'Day class' is occupied by humans and the 'Night class' by vampires. \\n\r\nIt goes further to hit every cliche in the arsenal, where the vampire chooses to attend school with her servant, who also happens to be a werewolf, the very school she of course has rule over, and the defiant student council wants to fight back for the school they most certainly love. Perhaps this wasn't meant to be an original story. For the rest of the review therefore, I will look at it as a re-telling of all the old legends of vampires and stuff like that. Story itself though, gets a 3 for lack of original content.\\n\\n\r\nArt: 5\\n\r\nShaft has always had a unique style of animation. That's what makes me a fan. Being a fan I've seen many of their other works. Having seen many of their other works, I recognize re-used animations and stills, re-colored to fit the characters in the current show. Clearly not their best effort. The animation itself however, is fairly decent, smooth, and with consistent characters and interesting angles. On the contrary, it's not as stylized as other Shaft works, such as Bakemonogatari or Sayonara Zetsubou Sensei, which means it does tend to just look a little generic compared to their other works. Also, there is no actual animation in the ending theme. Knowing Shaft, they will change that soon, but for now, 5'd.\\n\\n\r\nSound: 4\\n\r\nThe opening and ending themes are good. Everything else is generic, or even inappropriate. Comical sound effects mixed in with serious conversations set you off, and in my opinion, all the important voice actors have done better work in other shows. \\n\\n\r\nCharacter: 2\\n\r\nHere's one of the biggest disappointments of this show. Where they could have gone with creative, decent characters, there's just an eyesore lackluster display of crashing waves of mediocrity. The main character (at least, I think she is?) Mina Tepes,  is basically some sick combination of Remilia and Flandre Scarlet, as well as Nagi Sanzenin but without the nerdy side. An oppressive, static loli vampire queen. She shows two sides - the dominating, quick-witted personality you would expect from any major boss in a shonen show, and the slightly irritable yet teasing-playful unavoidable Tsundere archetype. Not exactly something to go in the record book.\\n\\n\r\nThen there's the other \"main\" character - Akira Kaburagi Regendorf. He made a promise as a child. Creative. He's a werewolf. Creative. He's a bullheaded protagonist that will go to unnecessary lengths to help the one he loves, even if he ends up just getting in the way. Creative. That, and if I were to describe him physically (short and somewhat spiky brown hair, school uniform, ..........) I'd run out of things to say about that fast. Complains a lot, same old, same old.\\n\\n\r\nEnjoyment: 2\\n\r\nUnless this anime is just a satire on anime or attempt to kill the industry, it's not worth watching. At all. I found myself checking the timer to see how much longer until each episode finished, so that I could be done with it and go on to bigger and better things, like staring at my computer's wallpaper. \\n\\n\r\nOverall: 3\\n\r\nUnless you're an undefeated vampire champion striving to peck up every last piece of lore you can relating to vampires, I would avoid watching Dance in the Vampire Bland. If you're looking for a vampire show with lots of action, there are many, many other, better choices.",
            "date": "2010-01-21T21:44:00+00:00",
            "helpful_count": 86,
            "mal_id": 22586,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/157985.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Cheating",
                "username": "Cheating"
            },
            "url": "https://myanimelist.net/reviews.php?id=22586"
        },
        {
            "content": "I did not read the manga so the review is based entirely upon the anime. I don't really describe what happens in the series and spoils are from none to very little. Look at the description if you wish to know what the anime is fully about.\r\nStory-7: Wow, vampires that have been hiding among us for centuries! I've never heard of anything like that before! That was sarcasm, if it wasn't obvious enough. Honestly though, yes it is overused and this anime doesn't pull it off as well as many other books or movies. But it doesn't have to. What I find very well doneis how they justify their ability to hide and survive in the time they have been oblivious to common humans. In the beginning the story is very poorly developed but everything starts adding up around the latter half of the series. Don't give it up too fast.\\n\\n\r\nArt-8: Everyone loves a naked 10 year old right? But seriously, it's not as bad as everyone is making it out to be. Although there are times when where they directly focus on her sexuality as a child, these are usually short and aren't that bad. So people should just take a chill pill. The animation moves in a way that Bakemonogatari does (yes I'm using it as an example, but in a good way) in that random motions and images are presented and there is a lot of emphasis on speech. Overall, expect fight scenes to have a dark undertone and blood is apparent when bodies are being cut in half. But that's just being realistic isn't it?\\n\\n\r\nSound-6: The background music doesn't stand out. The voice actors also don't really make themselves apparent. I do, however, enjoy the sounds that represent pain. They are far more realistic than many other animes and have almost a surreal quality.\\n\\n\r\nCharacter-8: The characters are bland and some come in and out of existence way too suddenly. You're left with a \"Who the hell was that guy?\" kind of feeling a lot of the time. Despite this the Vampire princess is actually a very complex person and it stands to reason that  most of the character development revolves around her. The rest of the characters are basically just there although some things do get explained during the last couple of episodes. I don't see enough character development based off of Akira but i still like his interactions with the rest of the characters.\\n\\n\r\nEnjoyment-9: I actually enjoyed this series very much. Although the whole series wasn't \"excellent,\" it was still a good watch. There are some very unpredictable moments which surprised me when I first read the reviews, stating that it is completely unoriginal. Oh and the princess' true form is sexy as hell, even though it uses a light effect instead of skin for representation.\\n\\n\r\nOverall-8: If it's taken for what it is it can be very enjoyable. I'll probably get lots of haters for this who try to only see the things wrong the with the anime and people who just can't sit back and enjoy. Sigh...well this is long enough already so I'll just end with saying if you like it, awesome, if you don't like it, that's cool, and if you've never seen it, you should give it a try. \\n\\n",
            "date": "2010-03-05T21:43:00+00:00",
            "helpful_count": 81,
            "mal_id": 23747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/220734.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shadesblade",
                "username": "Shadesblade"
            },
            "url": "https://myanimelist.net/reviews.php?id=23747"
        },
        {
            "content": "I was hesitant to watch Dance in the Vampire Bund, after all the bad reviews and ratings it was given, but I was surprised to find myself entertained by it.  So much that I finished it all in one day.\r\nI decided to give a summery of the anime because I dont believe the synopsis is fair to it.\r\nStory:\r\nA 17 yr old boy has had all his memories erased due to an incident that happened a year and a half ago.  What he does remember is a promise he made to this girl seven years ago, to always be together.  That girl turnsout to be the Queen of the Vampires, who he meets again, and shares a special bond with her.  And so the story begins.\\n\\n\\n\r\nThe art is beautiful.  So much detail, and colors.\\n\\n\r\nThe sound is ok. I didn't really pay any attention to it, to be honest.\\n\\n\r\nCharacters:  Really well developed considering there was only 12 episodes to work with.  If you put attention, you're not left lost or confused.\\n\\n\r\nEnjoyment:  I don't know why everyone gave it such low ratings.  I really liked Dancing in the Vampire Bund.  Though, the first episode made me dubious.  It's said that the audience bases their opinions of what they're watching within the first 10 seconds of their program.  Well, I'm glad I gave it till the second episode.\\n\\n\r\nOverall:  8.5\\n\r\nDance in the Vampire Bund was everything I was looking for.  Supernatural with romance and some action (the blood was a bonus).\\n\r\nAnyone looking for a action-packed romance anime, should definitely give this a chance.\\n\\n\r\nSorry if it's not the best review, I'm still an amateur at this:P\\n\\n\r\nTo all you \"Not Helpful\" and \"Helpful\" people too, feedback is appreciated. [;",
            "date": "2010-06-13T23:53:00+00:00",
            "helpful_count": 78,
            "mal_id": 27125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/296902.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lovethemtodie",
                "username": "lovethemtodie"
            },
            "url": "https://myanimelist.net/reviews.php?id=27125"
        },
        {
            "content": "7 episodes so far, and I decided to post this fe de erratas. Dance in the Vampire Bund is an anime that is sticking to the manga in the big picture sense. However, it lacks the details, both in the characters and the plot, that make this manga about vampires insightful and clever. \r\nThe anime has a lot of fillers which may have been intended to be creative, but turned out to be ridiculous. I really wasn't expecting much of a 13 episode anime in terms of the development of the story, but the amount of fillers will probably result in the abrupt truncation ofthe story  (as opposed to anime where the story is cut short with respect to the manga but have well rounded endings) \\n\\n\r\nThe art is very \"meh\"... They use different cinematic techniques to emphasize scenes but it gets repetitive, which together with the insane amounts of censoring, make the storyline of some episodes difficult to follow. The music just sounds like a cut and pasta from a random anime--I was expecting Dance in the Vampire Bund  to have some good music as in Bakemonogatari)\\n\\n\r\nI will admit that when I published the first draft of this review around episode 3, I was biased biased by the fact that I am a big fan of the manga. Back then, I suggested people to continue watching this for at least a few episodes. But, now I guess that I must say, you should spend those 24 minutes reading the manga =).\\n\\n\\n",
            "date": "2010-01-21T12:54:00+00:00",
            "helpful_count": 55,
            "mal_id": 22573,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/213633.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nomadica",
                "username": "nomadica"
            },
            "url": "https://myanimelist.net/reviews.php?id=22573"
        },
        {
            "content": "At the starting of the winter season Dance in the Vampire bund was touted to be the best of the anime winter line up. However, the show did not amount to all the hype. D in Disorder is a befitting name for this show. Be wary of Spoilers.\r\nStory-The story begins with Mina Tepes (The Queen of vampires) unveiling the existence of the vampire on a game show. What happens afterwards came as a surprise..At first you thought the show was about protecting the existence of vampires and somehow requisitioning a school as a corporate asset will stifle all insurrection.Right. Only opaque flashbacks are shown betweenthe Kaburagi and the heroine. Why did he a werewolf willingly protect the Queen of vampires? We shall never know. Before this show seemed to have that allure of becoming a political thriller in combination with a supernatural series. Instead we get a disjointed story about a guy who has little reason to have feelings towards his so-called master and then an arcane human enemy that we don't know about. I beg the question why didn't a person of the Japanese goverment become an enemy of Mina Tepes in her plans to create a utopian environment for vampires?\\n\\n\r\nThen we have the school setting. Do you really think kids will be a monumental threat to the Queen of vampires designs? These supernatural stories always base themselves upon using the high school setting as their background setting. The main character rebels against Mina tepe's hegemonic rule over his classmates, even though supposedly they have a master to servant relationship. Oh wait, there's more. Yes, if you thought this story was dysfunctional think again. A couple of episodes later.There's a planned coup to usurp the Queen of vampires position. This segment comes after the fighting between her former servant and the vampires. One of the nobles tried to seize power.The servant comes to the aid of his master again even though he tried to extirpate her from top to bottom not to long ago. This show ends with the abortive coup and the consolidating of her power. Let's seize more high schools, so I Mina Tepes have another excuse to show off the litany of flowers on my lavish dresses and bras. If you have a small tit fetish then enroll in Mina Tepes's district now. Overall a lacklustre piece of work, riddled with questions more than answers.\\n\\n\r\nArt-The art is similar to shafts prototypical art pieces. The animation tries to augment the characters with appealing surroundings, but lets face it the animation generally occurs only in a few separate settings. There's nothing remotely beguiling about the art, except in the ending song scenes.\\n\\n\r\nSound-Typical J-pop nothing new to see here at all. The music tries to acclimate to the dramatic points in the plot. However the serious taste in music is not warranted by a less than surpising or predictable outcome. Then we have the gothic music interposed with the vampiric theme, trying to effectually portray the story as a creepy vampire story.\\n\\n\r\nCharacters-First we have the blonde bomb shell herself Mina tepes, who exudes the pretentious little brat role that's quite abound in anime these days. Maybe it's her status of queen of the vampires that is used to justify this bombastic behaviour..Kaburagi is the typical reckless idiot that would make any level-headed question his existence in the show. He also is very naive and  cannot figure anything out regardless if it's placed right in front of his face. Do we need more facile morons in anime, that are pervayers of naivety?The rest of the cast I couldn't care less about.Just a tasteless supporting cast. Nothing needed to be said.\\n\\n\r\nEnjoyment- My enjoyment is poorer than the other categories because I had some remedial expectations for this show. Instead of an enthralling piece of politics with some semblance of realism, we get a inane piece of garbage is poorly executed.\\n\\n\r\nOverall- Some may think I thought of this as an abject failure due to my denunciations. However it's more disappointing experience than an exasperating one. If you want to watch an unfathomable anime that's below average, with horrible execution be my guest.\\n\\n\\n",
            "date": "2010-04-22T11:25:00+00:00",
            "helpful_count": 39,
            "mal_id": 25315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/49636.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Aeonic",
                "username": "Aeonic"
            },
            "url": "https://myanimelist.net/reviews.php?id=25315"
        },
        {
            "content": "Before I begin this review, I would like to make it very clear that I have not read the Dance In The Vampire Bund manga, nor do I have any immediate plans to do so, and this review is based entirely on the animated adaptation Thus, don't complain about how the manga was good, because that is completely irrelevant to how much I fucking hated the Vampire Bund anime.\r\nThe series starts off with an interesting premise, namely a TV gameshow discussing all the increasing amounts of signs that vampires walk among us. Although Vampires are hardly an original premise... actually, they're one of the leastoriginal and overused premises in modern media, but I digress... introducing their existence to the unsuspecting public via the media is certainly a new one. On paper, this reads like a fantastic deconstruction of the vampire genre, but horribly executed and turns into a rather large clusterfuck. Amidst the TV show, Mina Tepes, a small blonde loli girl who looks distinctly similar to Evangeline A.K. McDowell, announces the existence of Vampires, and declares herself to be their ruler.\\n\\n\r\nThe above becomes largely forgettable, though, as something of an Episode 0 sort of thing, and the following episode picks up with the actual plot, introducing our protagonist Akira. I call him our protagonist in the very lightest sense of the word, since from the very beginning it was painfully obvious that the staff behind the show care about one character, and one character only, and that is Mina. Despite being our supposed protagonist, Akira shows next to no personality in the series, being a bland plot vehicle instead. As it turns out, he and Mina go quite a way back, but Akira has amnesia. Apparently, he is a member of the Earth Clan of Werewolves, and is bound to protect Mina.\\n\\n\r\nYes, you read that right. This features both Vampires and Werewolves. Where have I heard that one before?\\n\\n\r\nWhat follows is a rather poorly-paced plot that takes several episodes to truly commence, and when it does, falls flat on its face. Whilst i'd rather not spoil too much, Mina takes a rather drastic choice within the series when the shit hits the fan, and starts to take a turn for the worst as a character. What doesn't help is that said decision seriously clashes with how she is portrayed in the previous episode, making her out to be a rather inconsistent character. At the same time, the plot that ensues is very generic, bland, and completely fails to ignite any sense of interest, with the exception being towards the end when the show begins to pick up.\\n\\n\r\nAll of this, however, is only so much detraction, and could still make for a passable show if it wasn't for my one and only massive complaint about this show: The directing. Put simply, Akiyuki Shinbo needs a good, hard kick in the 'nads for the horrible, horrible job he has done directing this show. For a start, the art style is extremely bland, and the colouring feels very undersaturated, making a very weak atmosphere for the series. But more importantly, the animation is horrific. Not since Evangelion have I seen such blatant corner-cutting, and at the very least Evangelion put it to good artistic use. Here, they repeat animation wholesale, and constantly use longshots, along with some very blatant and annoying censors. And just to put the cherry on the top, when the animation hits its low, can you guess what they did? They mixed in live action shots to save animation, if you believe they would honestly sink so low. But worst of all, the eye closeups. Oh dear lord the eye closeups. There's an extreme close up of an eyeball around every few seconds, or at least once every two minutes. In one episode, I actually counted how many, and guess what? 54. In a single episode. I am not making this up.\\n\\n\r\nIn essence, this show is garbage. It's hard to find more than a handful of redeeming features to it, aside from the fact that the manga might be something passable. \\n\\n\r\nFinal Words: Don't waste your time on it.\\n\\n\r\nAnimation/Graphics: 1/10\\n\r\nStory/Plot: 4/10\\n\r\nMusic/Background: 7/10\\n\r\nVoice Acting: N/A\\n\\n\r\nOverall: 3/10\\n\\n\r\nFor Fans Of: Bakemonogatari, Trinity Blood",
            "date": "2010-04-20T11:02:00+00:00",
            "helpful_count": 38,
            "mal_id": 25248,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=25248"
        },
        {
            "content": "CURRENTLY ON EP 5.\r\nAlright. First off, let's get out of the way, the reason why I'm having trouble with this anime.\r\nFOR THE LOVE OF PISS, SHAFT, LEARN HOW TO ANIMATE.\r\nIf it's one thing I love about the evolution of anime, is how natural animation is becoming. It began early with KyotoAni, who despite being money whores, animate like gods. Clannad was an animation masterpiece, where even the comedy felt natural, everything flowed. This was 2006, mind you. Later on they follwed with The Melancholy, which was a genius mix of character and animation flow. ToraDora was the next piece I loved the animation for. Noweird angles, small movements that just added to the over all picture. And most recently, Kimi ni Todoke, which took it's original style (from the manga) and added wonderful animation to make it a light hearted, lovely anime.\\n\\n\r\nSHAFT JUST TOOK THIS AND MURDERED IT. \\n\\n\r\nThe constant zooming in and about the place as if it were a shitty matrix remake. The crappy mouth animation that dosn't fit the faces at all. The random hair blowing in the NON EXISTANT wind, for no apparently reason. SHAFT isn't being daringly artistic, no, they're just being stupid. \\n\\n\r\nPLEASE, FIX THIS.\\n\\n\r\nOnto the story. I don't hate it, I don't like it. I was looking foward to an intense political drama, from what I've heard of the manga. Instead, I was given a vauge remake (with shitty animation /shot) the seems to more be focused on a romance. So ok, I like romance stories. So I will hold my judgement on this until later episodes.\\n\\n\r\nCharacter. Heck, I could watch this show blind and still know what was going on, the characters are so freaking bland and obvious. I know, I know, anime is not without cliche, but please. PLEASE. Do they have to be /this/ bad? I see little room for developtment/major growth. What I do see, is how this is going to end. However, I will hold out for suprises.\\n\\n\r\nArt. Well, animation aside, the art annoyes me to. It seems rather messy, blotchy, and overly shiney, like a new comer to photoshop who hasn't ever been tutored, or heck, bothered to learn how to use color properly. Mina's hair is about the only thing in the anime I like, in terms of art. This, combined with the animation from hell, means I would probably enjoy watching this blind. However, I don't understand enough japanese to do so. \\n\\n\r\nOverall, this anime has potentional, which it currently will probably never achieve. But y'know what? I'll see it through to the end. Damn it.",
            "date": "2010-02-06T14:38:00+00:00",
            "helpful_count": 29,
            "mal_id": 22992,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/70001.jpg",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LoonyB",
                "username": "LoonyB"
            },
            "url": "https://myanimelist.net/reviews.php?id=22992"
        },
        {
            "content": "I dropped this anime after four episodes so this is a negative review.\r\nI didn't read the manga, I don't plan to, I don't care how good it is in comparison.\r\nThe story gets a 3 because it has vampires. Vampires are awesome but here, they are lame. Really lame. Seriously, the story doesn't even make sense. I mean it's okay if the queen of vampires is rich, like the richest in the world, but being able to pay off the \"entire debt of Japan\", this is BULLSHIT!! Besides, nobody knew about the existence of vampires because they were \"hiding\" for millennia. That's okay, I think it'sgreat that they keep their existence a secret. But collecting money for thousands of years without ANYBODY noticing their wealth, it's like taking humans for retards. \\n\r\nBasically, it's like vampires were running the world economy but nobody knew it was them because nobody knew they exist and that is bullshit.\\n\\n\r\nThe art is good, nothing else to say here. It gets a 7.\\n\\n\r\nI didn't pay attention to the sound, so can't say it's good or bad. Neutral so 5.\\n\\n\r\nThe characters suck. I hate fake lolis. Mina's been living for ages yet she tries to impress high school students with the statement of a math formula. I can do it even without living for millennia. It's like: \"Look how awesome I am, I know basic math formulas even though I'm a loli who lived for so long I crap fossils\". There's nothing impressive here. And why stay a loli when you can be hot, with a mature ladylike body (the body gets +2)? Just for that, the characters gets a 0 and a +2 for the hot body.\\n\\n\r\nEnjoyment... The first episode was bitter because it was too slow on development. Watching the second one was like shoving food up your ass till it comes out from your mouth. I don't enjoy that.",
            "date": "2010-02-28T08:52:00+00:00",
            "helpful_count": 27,
            "mal_id": 23590,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/298347.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PCS1881",
                "username": "PCS1881"
            },
            "url": "https://myanimelist.net/reviews.php?id=23590"
        },
        {
            "content": "If you're going to watch this anime, do me a favor and watch the Blu-ray version. The TV version is so horrible that I even consider giving this anime a 6 once. \r\nNow for those who are too lazy to read:\r\nPros:\r\n+ Good art and animation (Blu-ray version)\r\n+ Great and well-developed character\r\n+ Interesting Plot\r\nCons:\r\n- Forgettable soundtrack\r\nIn-depth review:\r\nDance in the Vampire Bund. Looks like a good anime when i looked through the list of animes. Well, it's animated by SHAFT right? Let's give it a try then. \r\nStory: 8\r\nIt's about a vampire princess building her own country with her lover. Nothing interesting, right? The show starts offslow, but later the story progress at a better pace. The world-building aspect in this anime is good, makes you feel that the world is big and full of vampires. Some situation is predictable, but it's still fun to watch.\\n\\n\r\nThe anime is mostly romance, developing the relationship of the two main characters. But it has it's fair share of action and it's pretty good.\\n\\n\r\nThere is fanservice. But it's not that bad and fits the story.\\n\\n\r\nThe ending is a read-the-manga ending because from what I know, there won't be a second season.\\n\\n\r\nArt: 7\\n\r\nIf I was watching the TV version, I would give it a 5. Animation in the TV version is choppy and ugly, whereas the blu-ray version is superior but still doesn't look like what I would normally expect from SHAFT.\\n\\n\r\nSound: 7\\n\r\nOP and ED is catchy but forgettable. Background music is very fitting to the show.\\n\\n\r\nCharacter: 8\\n\r\nWe have our main characters, Mina Tepes and Akira Kaburagi. Mina is not your annoying as hell loli and has a strong personality with a dark side to it. Akira personality is pretty typical, but he's not and overpowered MC like other animes. Side characters don't show up often in this show, But when they do, they make a good impression and is pretty darn memorable.\\n\\n\r\nEnjoyment:8\\n\r\nExepct from the first episode, every episodes are good and enjoyable. \\n\\n\r\nOverall: 8\\n\r\nLike vampire animes? Want some romance anime with a mix of action? Or you just simply want to see some naked loli body? This anime is for you\\n\\n",
            "date": "2014-11-04T02:14:00+00:00",
            "helpful_count": 18,
            "mal_id": 167375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3563225.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/spiwar",
                "username": "spiwar"
            },
            "url": "https://myanimelist.net/reviews.php?id=167375"
        },
        {
            "content": "To me, this series is almost two separate beings: on one hand we have a highly intelligent show about political maneuvering and possible anti-discrimination undertones, while on the other hand we have a lame action show about large breasts. I can't say \"characters with large breasts\" because absolutely every female character (besides the princess in her normal form, ironically) has such abhorrently large ones that they dominate the screen.\r\nI supposed some viewers don't like the fact that SHAFT messes with the chronology and creates scenes that aren't in the manga, but I enjoy this. I don't want to to simply see a manga in motion;I want a different artistic experience. For example, the first episode of Dance was a parody of Japanese variety shows and was completely original--and so far it's still the best episode in my opinion.\\n\\n\r\nAnyway, if you like action and \"hot babes,\" you'll probably enjoy this show much more than I do. For now, I'm going to d/l the eps every week and hope they stray from the fanservice and delve deeper into the political aspect.",
            "date": "2010-02-10T12:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 23121,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/wickedlame",
                "username": "wickedlame"
            },
            "url": "https://myanimelist.net/reviews.php?id=23121"
        },
        {
            "content": "\"Still a better love story than twilight.\" No, but seriously now. This was phenomenal!\r\nI knew this show existed via cover art that I've seen in various places. So, I decided to take the time to watch it when it was finally recommended through another show. I figured vampires usually make something interesting to watch. This show was no exception and stole my complete attention until it was over.\r\nNo spoilers, but slight references possible.\r\nStory: 9\r\nSimply put, supernatural love story. I mean a good one too! This story did, however, take time for me to wrap around but it gets better. In other words, give it anepisode or two and hold on. In a world inhabited by both humans and vampires, they'll need to live like good neighbors. This is the premises. It gets even better when love is against the odds. Just let the feels roll out.\\n\\n\r\nArt: 9\\n\r\nThe art was very well done. I'm thoroughly pleased with the level of eye popping goodness contained within this series. The animation was nothing short of greatness. However, the cut-scenes and transitions were something... peculiar. I don't know how to phrase it but the camera angle goes all over the place. \"Eyes\" were focused on the majority of the time. It left me concerned, rather disoriented but I went with it.\\n\\n\r\nSound: 9\\n\r\nThe music was great. I really picked up on it and couldn't say anything bad. \\n\\n\r\nCharacters: 8\\n\r\n\"Why isn't this a 9 too?\" That's because of my personal feelings toward different areas of the anime. Without spoiling anything, sometimes I wished a certain person would have died because they were ALWAYS AROUND and had NO real reason to be. Don't worry if your don't get it or finished it and still don't understand. Anyways, the characters were great during the whole time. The main male character is a good person and shines when he shows it. As for the female, or queen, she has one of the best personalities I've witnessed. How the story plays out with all of them is just to good.\\n\\n\r\nEnjoyment: 8\\n\r\nI really liked this and will continue to like it. There was no mistake in my mind that this was something great to watch. I even spread it out to make sure I was in the right mood just so I wouldn't spoil it. \\n\\n\r\nOverall: 9\\n\r\n*Claps* I'd watch it again. Funny enough, I thought of games like bloody roar when people transformed. I couldn't stop thinking that way. The anime delivers a truly lovely story during it's span of 12 episodes. I couldn't recommend it more, especially if you like vampires.",
            "date": "2013-11-14T18:20:00+00:00",
            "helpful_count": 14,
            "mal_id": 120267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3309037.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/finalchance531",
                "username": "finalchance531"
            },
            "url": "https://myanimelist.net/reviews.php?id=120267"
        },
        {
            "content": "Due to the overwhelming amount of negativity in this anime i decided to write this review.\r\nDance in the Vampire Bund was an anime that caught my attention completely by accident stumbling on a video while exploring the internet. I was immediately immersed within the story. While yes the main plot behind the anime, (boy loses memory, cant remember girl/ promise with girl, goes through adventure to regain memory) is a bit cliche and the whole amnesia thing is truly overused but the story and presentation of this is truly magnificent. \r\nAkira the main character  initially has a cases of memory loss when Mina TheQueen of the Vampires, rediscovers him after a long absence. At the same time Mina is making the existence of Vampires public. What ensues is a mixture of the occult, graphic violence, political entanglement, struggling with oneself, and romance.\\n\r\nNow Dance in the Vampire Bund is not without its own faults, the story seems to be choppy, and not entirely planned out as well as the complete open ended way that the final episode ends, begging for a second season. Despite this, the story will always have you asking questions all the way to the end with very dramatic and interesting ways to answer each and every one of them. The art of the anime was beautifully done, many panoramic scenes, and stunning visuals.. this is a dark anime, somehow though they don't overuse this aspect so the anime still seems light and in some areas cheery. \\n\\n\r\nChanging the subject a bit,while i dissagree with many other people on this anime one thing t i can agree with other reviewers is why? It seems there are no reasons in the beginning as to why Akira does anything at all, changing from ignoring her, to helping her, to ignoring her again, then fighting against her, to once again being at her side. I believe this has to do with how he is gaining his memories back, but this wasn't truly evident in the anime. \\n\r\nAll in all though this anime does a wonderful job at what anime should do which is entertain.",
            "date": "2012-04-24T19:04:00+00:00",
            "helpful_count": 12,
            "mal_id": 59559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/976225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lokidemon09",
                "username": "lokidemon09"
            },
            "url": "https://myanimelist.net/reviews.php?id=59559"
        },
        {
            "content": "So, I basically adore this anime. In my opinion, it's better than Bakemonogatari, another SHAFT production directed by Akiyuki Shinbo. You should know that Shinbo is quite an auteur. His shows are positively smeared with his unique timbre. If you don't like other works from Shinbo, you won't like this one either. This show is directed intelligently schizophrenic: zoom, cut, still frame, cut, blur, cut, shot of seemingly unrelated object/scene, cut, dialogue, cut, wide-screen, inverted colors, etc. Despite all this, it's not confusing. Instead, it's exhilarating. Staccato. Fast. MTV on speed. Never boring.\r\n\"Intelligently\" schizophrenic, because none of the cuts are actually random. Every movement hasa purpose, not a wasted note is to be found. Sometimes, just when the dissonant camerawork and cut scenes seem about to overpower, it resolves into a beautifully harmonic scene. Sometimes the artwork is truly beautiful, like the shock-waves through flowers (cleomes, which only bloom at night)in the opening, and sometimes it's twisted, like a few of the vampires' true forms. \\n\\n\r\nIt may be avant garde, but it is by no means pretentious. Rather, it is a drunken romp flavored with gore, eroticism, dry humor, and pulp. It starts off sober enough, as most drunken romps do, but, well, you know how those Friday nights go… By the end, it sobers up into a pretty love ballad, and finishes quite touchingly with an epic and emotional finale. \\n\\n\r\nIt's often hard to tell if the story's continuous or not. Just as distortion allows a punk rocker to hide wrong notes and sloppy technique, the mania of this show obscures its sanity. When the show hits a sober note, it is ofter startling. One particularly delightful moment in the story was the parable of the butterfly and the flower who looked like a butterfly. The butterfly tries desperately to court the still flower, who never responds to him. As one of my favorite characters says, \"no matter how strongly the butterfly feels, he will never be together with a flower.\" The music this series dances to is the weakest link. Even so, it is delightfully gothic during the episode, pretty and energized before, and raunchy after. \\n\\n\r\nI thought this would be a controversial review considering the negativity this show has gotten here, so I checked the ratings distribution over at animenewsnetwork. This show is considered \"very good\" by a strong mode, though the average is drawn lower by a minority who find the show to be \"worst ever\". This means the people who dislike it are the most vociferous, not the most representative. What I'm getting at is that you, dear reader, shouldn't be scared away by the negative reviews. \\n\\n\r\nHere's a guide to see if you like it: 1. Did you like the manga if you read it? As far as I know, everyone who was a fan of the manga hated the show. You might be the exception, but not likely. 2. Do you like SHAFT? If so, then you have a greater chance of liking this release. 3. Do you pick up on dry humor? Almost every anime I've seen that's not a comedy or pretentious \"art\" (such as haibanme renmei) has some level of dry humor. If you don't really pick up on that stuff, a lot of this will seem boring to you. 4. Can you tolerate inappropriate fan service? Our 100 year old protagonist has the body of a ten year old, but definitely has tendencies belonging to much older females. 5. Watch the first episode. If you are one of the few who liked the first episode, then you are most likely going to enjoy the rest of the series. If you hate the first episode, don't bother with this series.\\n",
            "date": "2010-07-09T17:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 28191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332142.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seabury",
                "username": "Seabury"
            },
            "url": "https://myanimelist.net/reviews.php?id=28191"
        },
        {
            "content": "~*Dance in the Vampire Bund*~Review (revised):\r\n •     Story: Dance in the Vampire Bund is the anime adaptation of the manga with the same name. The author is Tamaki Nozomu,well known for his ecchi and hentai mangas, so we didn't expect too much from him either way.In this anime we have a blonde moe prepubescent girl (most likely twelve years old) that never ages. We also have the bishōnen Akira Kaburagi Regendorf (the first two names are japanese ,but the etymology of the last name is a little complex,\"Rege\" means  in romanian \"king\", but I'm not sure if themangaka named him knowing this detail). As for Mina Ţepeş's name,her family name is derived from the Vlad Ţepeş (meaning Vlad The Impaler) also known by the surname Dracul or later \"Dracula\". Vlad was referred to in several documents as \"Dracul\", which  means \"Son of the dragon\" and points to his fatherl, who received that moniker from his subjects because he had joined the Order of the Dragon. Dracul, derived from the Latin word Draco meant \"dragon\", though in modern Romanian it means \"devil\".\\n\r\nNow, returning to the story... The anime introduces the viewer to the main characters, Mina ( the above mentionated loli vampire ), and the  bishōnen Akira , which is later revealed to be  a werewolf ( love between a vampire,how original ). Akira-kun is the knight in shiney armor that wants to protect his lady ( Mina ) and rescue her. The intial story line shouldn't be taken so serious,since it is more of satire/parody of what modern japanese people about vampires, attributing many distorted concepts. Therefore,alternating the mythology in order to appeal to the modern audience.  Per total the story wasn't meant to be a deep,complex and emotional story full of unexpected story twits, but more of a parody. Therefore  the story seems constrained  to take a serious turn,and even when it finally does it feels out of place and clumsy. This anime achieves more being a comedy/satire than it achieves being dramatic.\\n\r\n  Story: 3\\n\\n\r\n •    I've always liked and admired SHAFT for the excelent animation and art, because of the master pieces animes such as Sayonara Zetsubou Sensei, Kino's Journey: The Land of Sickness -For You-, Maria†Holic ,Bakemonogatari etc.  I can't say that I don't enjoy this anime's graphic same as the others,that would be a lie. It has good animation,interesting visual effects and innovative visual concepts. However, the story drags down the art,with its clichés and  fanservice, especially from a loli exchibitionist like Mina. The fights scenes are decent,verging on average ...\\n\r\n  Art: 6\\n\\n\r\n •    The music was good, but nothing out of the ordinary.The Opening Theme  Friends by Aiko Nakano and Ending Theme  Tsumeato by Hibiku were fine,and agreable but nothing surprising,interesting and kind of wanna be a deep song or something like that.I liked it,but they are far from being my favorite japanese songs.   \\n\r\n   Sound: 7\\n\\n\r\n •    The characters may seem at first glance  full of clichés. Their personality  may seem apathetic , even when they face situations of emotional intensity. That may be because the mangaka focused more on the superfical aspects of the characters, and less about their inner selves.However,as the story progresses, the characters seem to gain more substance,being more believable in the interactions with each other. The  character that I empathize/symphatize most with  is Akira, he is just a normal teenager surrounded by unusual circumstances. And never forget: A single word:FANSERVICE. A lot of fanservice, especially loli fanservice. They don't really have a role or any purpose whatsoever, the complexity of one's character is not that important.\\n\\n\r\nAdded:Watching more episodes, I realised the characters do have some development. However, the characters remain the weakest point in the anime.\\n\\n\r\n Characters: 3\\n\\n\r\n •    I really do hope that this anime will have in the future a more serious plot, and that the mangaka will be more serious about it, after all, it's offensive to us readers.The idea was quite interesting and it could be a lot better and complex, but it turned out to be quite  clichéic story. I really hoped for more...   \\n\\n\r\nEnjoyment: 3\\n\\n\r\nOverall: 4\\n\\n\r\nNote: I have made a review of this anime back in 2010, when the first episodes appeared. At the time I was angered by the lack of historical knowlege that made people misunderstand a few things about the vampire concept. However, as of 22.02.2013, I changed my review and ratings, toning it down, and presenting the anime in a more favorable light, without being blinded by subjectivism.",
            "date": "2013-02-22T04:03:00+00:00",
            "helpful_count": 11,
            "mal_id": 87553,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/195069.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/-Ereya-",
                "username": "-Ereya-"
            },
            "url": "https://myanimelist.net/reviews.php?id=87553"
        },
        {
            "content": "As even the Manga isn't finished, the 12 Episodes Anime will probably just cover the story till chapter 32. Well at least I hope so, and I really hope that there will be a second season. Well, yes I've read the manga and seen the Anime... But I don't want to compare it... I'll just write a review for the Anime as it is:\r\nDo you remember Hellsing? Yeah, cool guy with cool sunglasses, and a gun which is taller than the one of Vash the Stampede... That's what a true Vampire-King is about!... Well, let's summarize the Vampire-Queen from DitVB: A cute little Lolicon-princess, whenyou see her you would like to hug her and pat on her head... Cute little girley! Oh well... Yes she looks as terrifying as a poring (Small pink enemy ball in Ragnarok Online)... Well... But, even if the first few episodes of this don't show the real intentions and character of Mina, she can be quite hardcore... Well in fact the characters are good as they are. I like them! I like hime, Akira, the dumb glassed megaboob president pedo girl who loves her little brother, yeah and even yuki, who is the normal girl in this anime... Yeah... They are nothing special, nothing new, but all the categories are there. So everyone should be happy...\\n\\n\r\nWell if I were to rate the first few episodes, this anime would have a score about mh 4 or so. I read the manga after I watched the anime. So I was confused sometimes about the scenes, there were holes in the storyline and somehow it seemed cutted... Hm, but after a while it got better, you get to know more about the characters and the bund... You'll learn a few secrets, you get to see some action, some moe and some ecchi... Well, in fact I don't give such a high score for an serious anime... No it's a high score for a lightweight anime. Yeah, you can search for a deeper meaning, and you'll even find it. Yes, you can read the manga and the story'll develop in a much clearer and more interessting way... But oh well let's write a fazit:\\n\\n\r\nIf you want to watch a good Anime with some weaknesses, but a lot of entertaining scenes: like action, romance, ecchi and so on... Hey it's ok watch DitVB. If you don't take it to serious it's a very good anime. Else read the Manga, but I belive if you don't like the Anime you won't hype the Manga as well.",
            "date": "2010-03-22T22:57:00+00:00",
            "helpful_count": 9,
            "mal_id": 24231,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302476.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimizeEU",
                "username": "AnimizeEU"
            },
            "url": "https://myanimelist.net/reviews.php?id=24231"
        },
        {
            "content": "Just to clarify this anime has more action scenes than it has romance so its nothing like the american movie twilight at first I thought so than it hit me it is much better and likeable I mean vampires are known for sucking blood with out it they may as well humans with a long life rrriiiggghhhttt\r\nOk so at the first glance my first thought was lollycon alert \r\nI mean an almost naked barbie doll definitely some thing isn't right here. but since I enjoyed shows with vampire I decided to watch it and despite what some have to say I think in terms ofentertainment it has provided me a sufficient amount. I mean the reason we watch anime is to escape boredem right and yes this helped me out on that. \\n\\n\r\nNow I don't want to talk about any major spoiler and seeing as I just finished the anime my memory of it is quite sharp. So lets see well I learned that unlike many other series which have 12 episodes which is consisted of one arc this has 2 arcs each has 6 episodes which was a nice turn of events. So from that I can tell you that this is indeed a fast paced anime with a epic if not amazing story which makes you think of vampires in a different manner.\\n\\n\r\nNow the art hhhmmmmnnnnn well have you ever watched the monogatari series if not watch it cause they are quite similar in terms of one of the main protagonist being a vampire. Well the animation used is quite decent I haven't read the manga so I couldn't give you the a proper description of whether or not the art work is similar as I have not seen a lot if  it my self. but never the less in the anime its is quite decent and the flow of animation is smooth in nearly all scenes there are one or two scenes which could have been animated better but hey it look awesome overall any-ways so you know i bet you guys wont event notice it the only reason I noticed it cause I tend to be very observant when it comes to watch an interesting anime.\\n\\n\r\nThe characters now here is an interesting topic vampire + wearworlves cleache much. I said and done a thousand times in countless novels but in all honesty this is my first anime in which this has actually happened. So in term of anime i think this is an original love between 2 different character of different races. one of the things i like abut this is this anime has got character development if anything else. \\n\\n\r\nI want to write ssssooo much more but anymore and I will probably will be spoiling it for all of you and considering it has very short arcs any-ways then what's the point in watch if you know what is gona happen so thanks for reading pls watch and enjoy this anime.\\n\\n",
            "date": "2013-12-19T02:14:00+00:00",
            "helpful_count": 8,
            "mal_id": 124597,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2152369.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Devastator004",
                "username": "Devastator004"
            },
            "url": "https://myanimelist.net/reviews.php?id=124597"
        },
        {
            "content": "Dance in the Vampire Bund\r\nThere's been time when I felt a certain kind of curiosity to know about the genesis of vampire fiction and the root of this popular and discussed genre.So,obviously,I searched on google.Learned a little about Vlad the impaler.So,afterward,as I got the basic idea,I intended to watch some anime series about vampire.Despite of some people's opinion,I do not think that vampire stories in anime is bad.In most of the cases,the storyteller uses his imagination and makes a vampire which have superpowers or they don't have to bite or they don't get burned in the sun etc.So,yes,This show is no difference.But among the vampireanime out there,this one should be kept on top of the list.I can assure you,this show is worth watching.Only 12 episodes,aired in 2010.Produced by Shaft,Genco,AT-X and flying dog etc.This anime was licensed by FUNimation and later on it got  dubbed .So,obviously I watched the dubbed version and no complain there.But on youtube,the dubbed version you'll get is actually fandubbed.So better not to mix up.\\n\\n\r\nSynopsis:Right at the very beginning,the viewers didn't get any idea how this series supposed to get.It all started within a television show about the existence of vampires.Where several people related to the topic were invited.And at some point,a beautiful lady was introduced and she claimed herself to be a vampire.That's the moment where everything started to get messed up.A little girl from the audience,Mina Tepes,made a drastic move creating an intense situation.At the end of the 1st episode,things got hung in a very bizarre situation.Afterwards,the story moved on quite fast.A regular school boy named Akira was introduced to the show.But just like other stories,he has a mysterious past and identity.And apparently,we learned that Mina Tepes the main character of the series,has a rational goal for both draculas and mankind.Among the few things, I loved the pacing of this show.It brought up incidents that were supposed to happen in that time of the storyline.\\n\\n\r\nTheme Setup,Music & Artwork:I just loved the direction.The theme was deliciously dark as a horror show supposed to be.The time setting was present japan.But the churches,building structures and the other enviroment mixed up perfectly to give you a majestic experience.Moving on to the music,I can't recall any track from the ost.Doesn't mean that it was bad,it was decent in my opinion.The opening and ending tracks are the same,they just got turned over in the halfway of the series.I liked them both.One is called \"Friends\" and the other one is titled as \"Tsumeato\".Proceeding,the artwork was perfect.You are supposed to love the glossy effects.Every character looked charming.And one thing I would like to mention is that the aspect ratio changed depending on the mood of the situation.May seem trivial,but it made the scenes even more dramatic.And about the animation,I would say that it was crafted as smooth as the artwork.\\n\\n\r\nCharacters Setup:First of all,Mina Tepes,the Vampire disguised as a little girl.She is the princess of the ancient covenant and ruler of all vampires.She is the strong female protagonist you ought to like.As she holds the throne,she makes the most tactical decisions and can manipulate her co-workers well.Moving on to Akira,he is the of strong and devoted character,which can be seen very regularly in lots of anime.At the beginning we learned that he lost his memories by an accident.And afterward,he gains his memory back.And meanwhile in the process,he got enough character development.Moving on,there was a girl named Yuki we saw from the beginning.She loves Akira,but as usually, there are complexity.She got enough screentime.And sometimes she acted as a narrator.So basically,they are the main characters of the show.As for supporting,Nella,Nelly and Vera were at the side of Mina.From the school,Nanami had some more story.Hikosaka,Kuje and Takashi were used to be Akira's friend.And as a teacher,sister Laura gave us the general idea of the institution.Beside that,as the story progressed,bunch of the other characters came in from the ancient vampire monarchy,the government and etc.\\n\\n\r\nOverall Rating:\\n\r\n                           MAL Rating: 7.25\\n\r\n                           My Rating: 9.0",
            "date": "2015-06-10T07:19:00+00:00",
            "helpful_count": 8,
            "mal_id": 189994,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4286249.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Rafiul",
                "username": "Rafiul"
            },
            "url": "https://myanimelist.net/reviews.php?id=189994"
        },
        {
            "content": "Hmm... what to say about Dance in the Vampire Bund...well personally I like the manga better but there is still much to say about the anime.\r\nStory: \r\nI found the plot interesting. However, the anime storyline lacks very important information. We the viewers are constantly wondering why something happens when it does which I personally found VERY frustrating.\r\nNot to mention the ending where we're all left hanging...which I hated because now we have to wait to see if they make a sequel so we can find out what the hell really happened.\r\nArt: \r\nThe animation in this anime was fantastic! Shaft really did a good job ofmaking everything so life-like and realistic. My favorite part is where the camera moves up and gives a full range of the body of the character and then focuses on the eyes that are obviously a personal touch done by Shaft.\\n\\n\r\nSound:\\n\r\nThe opening to the anime was well to put it in simply boring. It did not really suit the mood of the story at all.\\n\r\nHowever, I personally liked the closing to the anime. It is not something amazing but it does provided a simple yet catchy ending song to the anime.\\n\\n\r\nThe background is excellent you can hear every sound.\\n\r\nThe voice actors are well fitted to their characters in a way that you cannot imagine anyone else voicing them.\\n\\n\r\nCharacters:\\n\\n\r\nWhile most of the characters are...with lack of a better word their stereotypical.\\n\r\nMina is the only one who shows more depth with her sarcasm and all mighty personality.\\n\r\nAlthough I personally did like the anime only character Mei Rin, the cracking sound when she bites hard candy just gives me a chill. She is a bit too forward with Akira but I personally found it funny how she constantly tried to make him uncomfortable.\\n\\n\r\nEnjoyment:\\n\r\nI received much pleasure from this anime. Although lacking in storyline and in depth of the characters. This anime kept me on my toes, it kept me wanting to know more. I watched each episode trying to figure out what was going to happen only for the episode to end in a way I did not expect which was thrilling but also a little frustrating at times.\\n\\n\r\nOverall:\\n\r\nOverall I would rate this anime a 10 just because of my personally enjoyment. Nevertheless, for the sake of other people who do not quite share the same opinion I would rate this anime a 7.\\n\\n\\n\r\nYou might not like this anime if you hate vampires or werewolves.\\n\r\nIt has many political things, which I know a lot of you readers find to be boring.\\n\r\nThere is some blood and gore so if you are not into that then you should probably avoid this anime. \\n\r\nIf you are super into sugary sweet romance then you are not going to like this anime, however if you like the whole forbidden love thing then this anime is for you.\\n\\n\\n\r\nNow this is my personal opinion and I am not forcing any of you to share it.\\n",
            "date": "2011-08-22T04:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 41927,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/403834.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Taylorgg12",
                "username": "Taylorgg12"
            },
            "url": "https://myanimelist.net/reviews.php?id=41927"
        }
    ],
    [
        {
            "content": "Dance in the Vampire Bund is a rather notorious series. It's been heavily criticised for having sexualised content involving a character who looks like a child and when it was released outside of Japan there was a big fuss about censorship as various companies grappled with whether or not to cut some of the more controversial content. It's a series I've avoided because it looked crass in the same vein as Strike Witches or Upotte but I was asked to review it in spite of it being, according to the requester “a not very good show” due to it being a  prototype in theway it's directed for a lot of studio Shafts later works. For those of you unfamiliar with shaft, they're the ones behind the Rec OVA, which was terrible. They also did Ef: A Tale of Memories, which was sub-par. They also did Natsu no Arashi which was decent enough and Madoka which was actually really good. Thus  far, my experiences with their work has been pretty mixed. But I did just review a masterpiece so I may as well take up the request and look at this anime to see where it falls  on the spectrum of Shaft productions and to decide for ourselves if it really isn't very good. \\n\\n\r\nStory:\\n\\n\r\nAfter several attacks where young ladies are left with marks on their necks, a television program has a panel to discuss the possibility of vampires existing. The program includes a special guest, a woman claiming to be the vampire queen. She presents the preserved arm of the vampire who has, supposedly been attacking people. This prompts him to reveal himself and the existence of vampires is revealed to the public as is the face of the true vampire queen. She announces her plan to take a patch of land she owns within Japan and create a bund for vampires. Things take a turn when the vampire queen, Mina Tepes, begins showing interest in amnesiac High school student Kaburagi Akira. What's the connection betwixt them and can she successfully establish her bund?\\n\\n\r\nThere are several narrative issues to the series. The first is that it lacks narrative cohesion. There are factors of vampire society that get established early on and then retconned later in the series. It can't even keep whether Mina is the queen or the princess consistent. These are not interchangeable terms. They also switch between her as a student and as the school's chairman.  Her physical abilities also fluctuate. There are times when she can fight well and others where she's completely helpless because the plot needs her to be rescued. It's like she's silver age Jimmy Olsen and just constantly has different abilities. The romance is pretty dreadful in this as well. The 'development' is really stilted and comes across as contrived. But that isn't the worst part of it. You find out that she's been basically obsessed with him since he was a small child. That's the plot line with the paedophile werewolf from Twilight levels of just wrong. They try to balance it by making her look prepubescent but that just makes it worse. Or maybe it's less about balance and more that the writer has a fetish for children and should probably be institutionalised. Even the major side romance is utterly horrendous garbage involving one character who's way too old for the other, but with a less extreme age difference. The narrative isn't particularly compelling either. While it has some concepts that could be interesting if they were expanded on, it's more interested in showcasing its terrible romance and in providing fan-service. Because the only class that this writer is aware of is the variety you attend. \\n\\n\r\nThat being said, the whole idea of vampire society revealing itself and integrating into human society could have been really interesting if the writing hadn't been complete schlock. The whole Dance With the Vampire Maids segment can be kind of funny at times too. \\n\\n\r\nCharacters:\\n\\n\r\nFor the most part, the characters aren't all that bad. They're mostly just dull. There are two issues that really demote them from mediocrity. The first is the incessantly obnoxious way that a bunch of the female characters pursue our boring hero. The second is that the character dynamics are weak and they suffer from the same lack of cohesion as the narrative, undergoing changes without any reason beyond the plot demands it. \\n\\n\r\nArt:\\n\\n\r\nDance in the Vampire  Bund may very well be worse than Strike Witches when it comes to ridiculous, excess levels of fan-service. The big reason being that most of it centres around Mina, a character who looks to be eight or nine. She looks younger than Lucchini Here's the thing about Mina. You could potentially make me believe that our bland hero could fall for her, in spite of her appearance, since she doesn't act like a child, for the most part. It would require considerably better writing, but you could manage that. However, you aren't going to convince me that you're showing 'sexy' scenes of her starkers for any reason beyond you being a total sleazy scum bag. We don't need to see her in the nude for the narrative it's just distracting and unpleasant. Because she looks to be eight or nine. The action sequences are pretty bad too. Most of them consist of seeing our protagonist take a couple hits and then end things with one attack. Good thing  his opponents have no durability. If they were evenly matched on that front he'd have been killed pretty much right away and the series would be somewhat better because it wouldn't have its lousy romance taking up a bunch of time. \\n\\n\r\nSound:\\n\\n\r\nThe series got some good actors. Saito Chiwa, Yuuki Aoi & Itou Shizuka to name a few. Their performances in this, however, are pretty weak. You can tell they're trying but the writing just doesn't give them much in terms of character complexity. The music isn't bad, but it is pretty weak. \\n\\n\r\nHo-yay:\\n\\n\r\nThe series doesn't have any. Which is fine by me given that its romance is at the Twilight level. \\n\\n\r\nFinal Thoughts:\\n\\n\r\nSo, that's Dance in the Vampire Bund. How ungood is “not very good?” Well, the premise had potential and there are some funny bits in the ending segments but its held back by an awful romance, a story that doesn't hold together well, absurd levels of fan-service (a lot of which involves a character who looks like she's eight), weak performances and bland characters. My final rating is going to stand at a 3/10. Next week I'll look at Natsume Yuujinchou.",
            "date": "2017-02-01T12:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 239667,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=239667"
        },
        {
            "content": "This is a bit of a strange anime, in that the main character of the story and the protagonist seem to be different, kind of. The main character of story is definitely Mina, in that she's the one that has goals that serve as the focus of the anime, the one who makes crucial choices that decide how things will move forward, and the one around whom all conflict is based. However, in terms of framing and perspective, the protagonist is Akira, someone who supports her throughout all of this. This results in an interesting dynamic that works really well sometimes, but also quite strangelyin others. The core of when it does work well is usually when its centered around their relationship with each supporting each other. When it doesn't is when they seem to get into conflict. Still, all in all the relationship between the two is pretty good. It's a relationship that reemerges rather than being born within the anime, so it feels like there is a good deal that isn't shown, but the chemistry between the two is good enough by the end that it feels natural enough. In terms of plot, it ends up starting out incredibly strangely, in part due to the main character/ protagonist dynamic, in that on one side there is Akira's story, which is entirely school focused, but on the other there's Mina's which is far larger and much more political. This ends up feeling tremendously awkward, in that the balance doesn't work at all, and it actually feels somewhat inconsistent how things are playing out due to the major difference in scale. It eventually does overcome that though in the final arc. The core story about establishing the Vampire Bund, and doing anything in order to do, is quite interesting with the various factions and view points involved. However, there was an issue in that it felt like a lot of background and the setting as a whole needed to be fleshed out a lot more, in that while it didn't feel rushed, it felt like there was explanation lacking to the point that sometimes things felt inconsistent and random. The plot ultimately ended on an arc that seemed to resolve everything leading up to that arc, hence making it a good place to stop, but also ended up introducing a whole lot more that needed to be resolved, seemingly setting up the entire rest of the story, which is a pretty standard place for manga adaptations to stop, though one that I'm not a fan of, but considering they were following the manga I suppose there wasn't really any better option. Also, as a side note, the side characters were amusing and interesting enough for what they were, but everyone else certainly is a side character and doesn't really get much development at all. The exception to that is the villain of the last arc, who made quite the good villain and felt well established due to how similar she was to Akira.\\n\\n\r\nThe art and animation were amazing as SHAFT usually is. Though, while the action was well animated, it was pretty random without much substance.  Also, there was a lot of use of camera effects that was hit and miss, working incredibly well at times but feeling pointless and random at others. Stylistically too it felt somewhat all over the place at times. Still, though the motif of the butterfly in the last arc was a bit heavy handed, I thought worked really well. The soundtrack was pretty solid. The OP/ED were strange, in that the OP was also used as an ED and the ED was also used as an OP, each with their own sets of visuals, and while some of these felt cheap, when they were being used as they seemed to be intended to be used they were pretty great.\\n\\n\r\ntl;dr: An interesting plot in a world with an atmosphere that's incredibly great at times, but also quite awkward at times, centered around two characters that are incredibly great at times, but also quite awkward at times.",
            "date": "2018-12-15T16:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 295838,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=295838"
        },
        {
            "content": "Children of the night, something that always seems to entertain me. This series however, made me fall more in love with series that deal with the Vampires and other supernatural creatures. Something that bugged me was the low rating this seemed to have, naturally an anime that I enjoyed I wanted to write a positive review. So let's get started shall we?\r\nStory: 8/10\r\nThe premise of the story deals with the Queen of Vampires, Mina Tepes, and the promise 10 years before the current setting made with the main protagonist Kaburagi Akira. \"The Queen who had all the power, and boy who offered her everything.\" Orsomething like that was the reason this whole story had happened. The two's promise was that Akira would never leave her side, and he'll always have her smile. A little cliche'd but I didn't mind. Now I would have given the story a 10/10 if the plot gave more detail about Mina and the Japanese government. This also dealt with politics, knowing the Japanese were in a huge debt, along with the Bund the queen created to support all the vampires. Sadly they didn't provide much detail, but all in all the story was done quite well.\\n\\n\r\nArt: 10/10\\n\r\nFrom the get go, I knew the art was done by Shaft, the animators of the Bake and Nisemonogatari. From the odd viewpoints to the realistic characters. What I mean is that the characters anatomy was done closely to realistic ones, unlike those big eye'd stereotypical type of characters. This is what I really enjoyed. Another was the beauty of mixing real pictures along with the anime. Shaft has an unorthodox way of animating things, something that really catches my eye. \\n\\n\r\nSound: 9/10\\n\r\nThe sound was a bit out of the ordinary but not something over the top. The soundtracks played during key moments and the tone fit it as well. Opening and ending songs were something to remember, that also kept me on the positive side of the Sound portion.\\n\\n\r\nCharacter: 10/10\\n\r\nPrimarily, the story mainly focused on the two, Mina Tepes and Kaburagi Akira. The growth the characters have were amazing, the development was much needed for the story and they were done right. Although some side characters stand out, not much development but still important to the story. \\n\\n\r\nOverall: 9/10\\n\r\nFor me, I would've gave it a 10/10 but I tried my best to be unbiased for this review. I really enjoyed Dance in the Vampire Bund. I suggest for fans of any supernatural creature fans, romance fans, and action, this is something for you. If not, I highly suggest you try this, you may enjoy this as well :)",
            "date": "2012-11-22T22:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 78207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1527585.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OumaShuKun",
                "username": "OumaShuKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=78207"
        },
        {
            "content": "A fan of Twilight? Vampires? Werewolves? Fantasy? This anime has it all. Dance in the Vampire Bund was previously adapted from the manga and consists 12 episodes with 1 recap. A highly suspenseful and mysterious source. I personally thought everything was thorough, and detailed. If you're interested in a fantasy, horror, slight bit of nudity, this is a perfect anime for you.\r\nStory: 10\r\nThe story was very well thought. The audience clearly understands what is going on and the plot doesn't skip all over the place, definitely have transitional scenes in between. The future scenes were somewhat predictable in some areas. There were 3 different storiesthat connected and the 2nd scenario were fairly predictable, but otherwise i thought the plot was interesting. The plot really stood out, it wasn't those typical romances with your typical daily lives. Really is unique compared to the rest, especially when both protagonists start to reveal their past to the audience\\n\\n\r\nArt: 10 \\n\\n\r\nThe art was very detailed, indeed. The contrast in black and red, against the bright yellow and white portrays a very evil aspect of the anime, yet the brighter colours kind of portray a type of hope and peace. Although most of the anime was set in the dark you can distinguish the many aspects of the animation. It also had  great effects, especially with the vampire attacks and transformations.\\n\\n\r\nSound:\\n\\n\r\nSimilar to the art in the movie, it was well used at the right times. When you hear the sounds you can feel the different emotions in it, for example, if one would scream, it'd give a really eerie feel and send goosebumps up your spine. Its as if the sound runs through your body giving you the right reaction to the event that is occurring. Truly astounding.\\n\\n\r\nCharacters:\\n\\n\r\nThe characters were well developed. It was brought with a third person omniscient view, in which we know some things that are only revealed to the audience but not the actual characters in the story. The characters were very mysterious in every concept, you don't know some of their motives, etc. But as the anime progresses, the anime unfolds and many would start to understand the character's motive and personality better. The one thing I wasn't so pleased about was the nudity of the Vampire Queen (who has taken form into a young blond child), it was....rather disturbing. However, after awhile it'll be easily to absorb those images. Akira's personality was a little too obvious, really, a typical hero, who tries to keep his promise and does anything to save his friends, and Queen.\\n\\n\r\nI absolutely enjoyed the anime and I hope you will too =]",
            "date": "2011-09-29T19:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 44439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/fiddleberg",
                "username": "fiddleberg"
            },
            "url": "https://myanimelist.net/reviews.php?id=44439"
        },
        {
            "content": "my very first review!!when vampire queen mina tepes arrives in japan to bulid a home for the vampire race,akira kaburagi must keep his childhood promise to protect her from those who would dethrone her.i really like anime because its a great story.there are some pretty good fighting scenes and its also a great conspiracy-like anime",
            "date": "2011-10-19T17:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 45853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/748391.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/darknebula",
                "username": "darknebula"
            },
            "url": "https://myanimelist.net/reviews.php?id=45853"
        },
        {
            "content": "This anime is truly amazing! Now imagine Bakemonogatari with elements off horror and darkness... This anime is a mixture of them both!\r\nStory:\r\nNow the story could have been better, it revolves around a vampire princess or whatnot trying to start up a bund for all vampires really. Now the start of the story is amazing! The confusing times for all the characters really makes them really good! Now the first episode is a total bore and I suggest skipping to the next. I feel like the ending off the anime was horrible though, you can tell they had to sum it up really fast. Half waythrough the series you would swear it's the ending but then they do a total 360 and change nearly everything to introduce a new story. Certain relationships change with just a click of the fingers. \\n\r\nArt:\\n\r\nYou know how I mentioned the Monogatari series (my favourite off all time, well one of them ahaha), well I totally felt like this has elements off it! With the colours showing shadows and the top of the corner being black and sudden body movements of the characters. It's really cool!\\n\r\nCharacters:\\n\r\nNot much to say here, I feel like the characters were great! Good twists involving the characters and there is this one character who is really good on how she let's say, goes head on with her feelings. No spoilers here kids. The two main characters are great and work well together, then the side characters are also good. Many playing large roles in episodes, meaning they become mains for some time!\\n\r\nOverall:\\n\r\nIf you want a Dubbed, Horror, Drama, Supernatural, Artistic and little bit of Comedy, check this anime out! It's worth your time, I just brought the blu ray of it! It has awesome characters, again the story going to the end goes weird but still watchable!",
            "date": "2018-11-03T00:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 293218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4420215.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KnightwingNC",
                "username": "KnightwingNC"
            },
            "url": "https://myanimelist.net/reviews.php?id=293218"
        },
        {
            "content": "To be really honest, it was pretty poor. Not the best. Not going to lie, episode 5 really put me to sleep meaning that I got bored of it. Basically, the anime pretty much confused the fuck out of me. Not much to say for this anime tbh, I thought it was going to be cool but I thought wrong. No hate for the anime but I just feel that it was not my cup of tea at all. \r\nI wasn't aware of the fact that there's loli in it (I don't do loli or shota).\r\nI was just hoping it would be intense and gorybut meh, the story line pretty much lowered my expectations for this anime. So in all honesty, I give this anime a 1/10.",
            "date": "2017-04-07T10:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 244943,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6146017.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 1,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ShadowsOfHell",
                "username": "ShadowsOfHell"
            },
            "url": "https://myanimelist.net/reviews.php?id=244943"
        },
        {
            "content": "Vampires. The genre feels very divided - either people love it or hate it. I´m personally are quite fascinated by vampires and vampire story´s, it´s something with these children of the dark that never grows old on me - their wildness, immortality, history, powers, weaknesses, and bloodsucking can be decpited in so many ways. As to date not so many great vampire stories has been adapted to anime compared to other genres such as shounen, shoujo, harems, demons and so on. Of course some really great ones has been adapted such as Hellsing Ultimate, Blood+, and Trinity Blood with varying results. So I was quitehappy with how satisfied I was after finishing \"Dance in the Vampire Bund\" (DITVB). It took the theme seriously and didn´t lay any fingers in between. I will elaborate why think this is a gem for all you out there that has the slightest interest in vampires stories. \\n\\n\r\nStory: 8/10\\n\r\nAfter millennium in hiding the vampire race chooses to out them self to the world in the attempts to create their own free state within Japanese boarders, lead by their ruler princess Mina Tepes - direct dicendent of Vlad Tepes (Dracula). Of course this isn´t welcomed by all, both humans and other vampires. Especially not since rouge vampires are attacking humans and by doing so turing them. Mina and her allies goal is to coexist with the humans on their secluded island - which are called the vampire bund. But the joureny to that goal is filled with obsitcals, betryals, blood, deaths and brooken hearts. \\n\\n\r\nI really like the set up - It can be used in so many ways. Of course used wrong the story can easily be a boring cliché feast, but in this case it used right. For one, DITVB includes many aspects - the political and economic, fears and prejudices, personal emotions and relationships, and the responseibility of ones position. And all are used in a very credibly way, the cenarios was no to far fetched or undermined. For another, the vampires wasn´t potrayed as soft twilight vamps either (can´t really stand that, I mean we are talking about vampires here!) - they could be cruel and do very questionable things to get what they wanted and reach their goals. Huge plus for me. The relationships between the characters flow pretty smoothly, it was very few if any cringe worthy moments. Even the love triangle was done in a pretty good manor. Often can those be pointless, cringy or just flat out bad - but in DITVB I acutally felt for all of the involved and the situations didn´t really feel forced to me. You should be warned do, this is not for a younger audience - it´s lot of nudity, all kind of sexual situations (some really bordering to the questionable), gore and blood. The pacing was pretty even, it was a nice mix of dialouge, action, plot, character interactions and mystery (mostly in the form of Akiras amnesia). And of course it´s some romance involved, just the right amount in my opinion. You should also know that the manga was still ongoing when this was produced 2010 and it´s a build up for a sequel that has yet to come. It´s nicely rounded in the final episode as of the end of an arc, but some mysteries, new enemies and questions are still present after the last episode.\\n\\n\r\nArt: 9/10\\n\r\nFor a 2010 production (by Studio SHAFT), I think it holds a nice quality to it - all throughout the show. Espacially the city backgrounds was particulary stunning. The color palette that is used are quite soothing with highlights of color exploations in special scenes. I think they managed to catch the dark undertones of the plot and its characters with carefully choosen colors such as shadows and darker colors, the vampires and werevolwes glowing eyes and the expression of them, or the baring of fangs when provoked or challanged. Character designs is on the cute and beautiful side - without anything espacially unique to their design. But all over very eye pleasing, so if you are into that you gonna love this. For an anime it´s pretty uncensored, you been warned, nipples will be on display time to time. Mina´s childish apperance can be disturbing to some watchers, but her childlike look do has it purpose. For the animation I thought it was good, the action scenes were good but not outstanding. Over all body moments was absolutely fine, with few weird angles or movements. \\n\\n\r\nSound: 9/10\\n\r\nAs for the soundtrack I enjoyed it quite a bit! Much dramatical instrumental music were used, which i think suited the mood of DITVB very well. As for the OP it´s was ok but nothing oustanding. It felt like I had heard that kind of song multiple times and it didn´t brought anything new or memorbale. The two ED´s was better, espacially \"Tsumeato\" by Hibiku. Background sounds was doing it´s job  and was always on par with whats happened on the screen. As for VA´s I watched dubbed and was satisfied with their efforts. Their vocies was on par and most managed to bring out their character and give them life and personality. And Robert McCollum voices one of the supporting characters - and I love everything he does. \\n\\n\r\nCharacter: 9/10\\n\r\nWhich brings me to the characters. I most say that I liked most of them. Even if some was given sterotypical roles, did they manage to avoid their sterotypical developments and actions (in most cases). It´s just 12 episodes so of course didn´t most characters get the development and backgrounds that is so appreciated by us viewers. But the main characters Mina and Akira had both nice personal and relationship wise developments, and was given enough background story to satisfiy me. \\n\\n\r\nMina comes of at first imperssion as a typical Moe. Which is funny because she´s all but that (again in most cases) - but that is in looks only. She is the ruler and leader of all vampires and despite her childlike apperance she´s centuries old, and bear a huge responseablity on her small shoulders. Mina is the only living (still undead not dead), royalty of her vampire clan and the survival of the vampire race lives and dies with her. She´s smart, strong, roughless, determined, and sometimes right out cruel. But at the same time is she compassionate, kind, loving, lonely and sad. I like that in a main character. Not all goodie good and not despiteful either - great mix in my opinion. \\n\\n\r\nAkira also comes of in the beginning as a sterotypical main male lead. Great looks, kind of shy hero like personality, and has his idea of whats right and wrong. But during time he no longer sees thing as black and white, and has to make so choices that goes against what he thought was the truth. He also suffers from amnesia and only remember the last year of his life. As he gets pulled into all this comotion, he starts to remember who he is and whats he´s ment to do. What I trying to say is that he isn´t the empty boring good looking male lead that never changes, he starts to grow into a man who chooses his path and faces his fate. \\n\\n\r\nAs for the supporting and side characters - it´s so many. All given different amount of attention and screen time. Some of them are great and I would love to see more of them and learn more about them, and some are just there to fill their role and does it just fine. \\n\\n\r\nEnjoyment: 9/10\\n\r\nI´m gonna be honest - I really didn´t have high expectations of DITVB. So many of the few Vamp animes out there is mediocre at best and bad at worst. So I was suprised how the first episode took me by suprise and was much everything I wanted from this kind of show. It pulled me in and and I bench watched the whole thing in just one day. I enjoyed DITVB a hell of lot. I will for shore pick up the manga now.\\n\\n\r\nOverall: 9/10\\n\r\nA great vampire/drama/action show for shore. I would recommend DINVB to most people - even if you don´t think the vampire theme are that exciting. This show may as well be the show that turned you (yes, those words of choice was on purpose). Can´t believe the low score this show has (7,2). I can see that DITVB has it flaws and delibrate not explaining somethings, and has some questionable scenes but I truly enjoyed this display of a vampire story.\\n",
            "date": "2017-03-26T03:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 243568,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=243568"
        },
        {
            "content": "I don't know where to begin with this episode, I see a lot of reviews going over every aspect of the show in great detail but with this anime I can only say 1 thing about it..... It's extremely unique. I have not seen very many animes that actually hit me like this one did, though i'm starting to think i'm just a sucker for a bit of a romance :).\r\nI've seen a few vampire animes out there and I can say this indefinitely, this is the best one to date. The romance was amazing, the battle's were epic and the drama was unlike anythingi've seen!!\\n\\n\r\nI don't think there are true words to describe this anime other then, I fell in love with this anime within a matter of minutes of watching the first episode. Most romance shows you can usually predict what will happen next but this will is a whole nother ball park. There was not a single moment in which I had a doubt that this anime was going to disappoint me, the only thing that mad me sad was when I started watching it and realized only 12 episodes!",
            "date": "2010-08-01T17:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 29194,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/284341.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/InunoTaishou",
                "username": "InunoTaishou"
            },
            "url": "https://myanimelist.net/reviews.php?id=29194"
        },
        {
            "content": "it is not the best of vampire animes. \r\nbut i bet it would be rely good for this who rely like vampire anime. \r\ni think it is rather bad. but that is only my opinion, and i think is grate made it is just that i don't like this type of anime. i think it was to absurd (if that's the word XD) for my liking\r\nif you are looking for an vampire anime i would rather suggest Rosario+vampire",
            "date": "2013-03-19T12:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 90167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2318427.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/tunaKing",
                "username": "tunaKing"
            },
            "url": "https://myanimelist.net/reviews.php?id=90167"
        },
        {
            "content": "The story line seems both the same as all other shows about vampires but then it has a little bit of its own story line. I have a small feeling it’s a mix between ‘Black Blood Brothers’ and ‘Moon Phase’ where it’s a cutesy Lolita girl but is creating a new area for Vampires. I’m not so sure how I feel about Werewolves being controlled by Vampires. To me, they should be on the same level like all the other story lines but I guess it fits the story line. Akira feels a lot like Kouhei from Moon Phase and I would probably say theywere the same person if it wasn’t for the fact that he isn’t a real weakling. Another thing that makes it odd is that Akira’s friend talks a lot throughout the story as though she isn’t in the show much.\\n\\n\r\nThe artwork is bright and crisp, though I feel it should have been a little darker. It’s rather high detailed in some places but then turns into action lines and crazy CG artwork in a couple parts. This is the really sad CG that doesn’t look right in the show. It’s also the fact that the parts they have CG could have been really easily created by drawing. The beginning is pretty interesting though the running around gets really old really fast. I’m also not found of the naked Lolita. It’s more fan service that isn’t needed. There is also way to many images of flowers when there not part of the show.\\n\\n\r\nThe music is really not that special. I only like the beginning song but the rest isn’t really even loud enough to hear it. The English voices are not that great, but yet not that bad too, pretty much a rather average show.",
            "date": "2013-07-18T16:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 105893,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=105893"
        },
        {
            "content": "This is just a great anime that is good for just some good old fashioned watching.  The artwork is awesome and so are the characters.  The plot is always moving around from one side of the story to the other, and oh ya, it has vampires in it which makes it all the more fun to watch.  There is never a dull moment with this anime so I would definately recommend it to anyone over 18.  Other than that, enjoy.",
            "date": "2011-09-13T18:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 43301,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/500571.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/widowmaker",
                "username": "widowmaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=43301"
        },
        {
            "content": "Having read the whole manga I must say the anime adaption is great despite having taken a few liberties regarding introducing anime-original characters and removing a few others in order to shift the story in a somewhat different direction.\r\nArt: 9/10 - I watched the DVD/BD release and there's nothing wrong here except from what seems to be far too much saturation which was not there in the TV release, resulting in everything looking darker and giving objects and characters a shadowy outline around them and their facial features, making it appear as if they're wearing off-color make-up. Some scenes in the earlier episodes almost lookslike you were meant to watch them through a pair of 3D glasses due to how some colors seem to blend in with the surroundings.\\n\\n\r\nSound: 8/10 - It's not bad, but not amazing either.\\n\\n\r\nStory/Character: 8/10 - This is the most tricky part for me to rate due to the introduction of anime-only characters and other ones being skimmed over. The voice actors captured the characters perfectly no doubt about it. Only reason I'm not giving this a 10, is due to Meiren, the anime-only character that gets the most screentime. While her character is played out great she is introduced early in the series as a means of fleshing out Akira's character due to his anime-only amnesia plot and in the end replaces another very important character from the manga which would've been introduced around episode 11.\\n\r\nWhile I'm disappointed they altered the story somewhat from the manga in order to make the first 32 chapters fit neatly into a 12-ep show, it still holds up on its own without shifting too far away from the more critical plot points, this portrayal even ends up more clearly explaining a few vague things from the manga even if it instead removed a bit of suspense by introducing a certain character too early. It still doesn't tell the full story which continues for another 35 chapters after the anime ends, if the anime has tickled your fancies I recommend reading the manga to get the full unedited version.\\n\\n\r\nEnjoyment: 9/10 - Giving it a 10 is something I would've done simply because I could not put it down and ended up marathoning it, I can't do this due to my issues with the characters and story though. The reason it's not rated lower is simply because of the \"Dance with the Vampire Maids\" skit at the end of every episode.\\n\\n\r\nConclusion: I loved it despite the issues I have with it and that's all that matters, the manga is still better though. While I would argue that given how neatly they packaged it into a 12-ep show they could've done the same with a 24-ep one, but due to the changes to story and characters it'd be impossible to continue past the current ending without altering it even further.",
            "date": "2016-02-14T00:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 210845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Auralice",
                "username": "Auralice"
            },
            "url": "https://myanimelist.net/reviews.php?id=210845"
        },
        {
            "content": "For me this has to be one of the best vampire anime's out there. Now most people watched it for the sexy loli vamp queen, (not going to lie..... i didn't mind it) but that's not what made it so good. For start it's different to the manga in many many ways, but i feel like if they didn't change it the way they did it wouldn't of been as good (for the anime). Like there are only two races not 4 - 6 and the main hero didn't loose his memory he knew from the start that he was a wolf ( ill stopit there cause there is alot more). Second the love story and the way it made you feel each step of the way was bloody well done for a 12 ep series. Action was good for what we saw and the blood matched it just right and not over kill (like some i have seen).\\n\\n\r\nThe only bad bit is that it didn't get anything after. No move, ova mini series... nothing. They had the story right there waiting for the picking and was just like \" we could but naaaaah\".\\n\\n\r\nOver all if you like vampire shows that are dark or darkish (depend on witch version you watch) it's a must see.",
            "date": "2014-05-23T06:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 144235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3794265.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Haydos360",
                "username": "Haydos360"
            },
            "url": "https://myanimelist.net/reviews.php?id=144235"
        },
        {
            "content": "I've heard a lot of complaints about this one not sticking to the manga very well, but allow me to say that this one isn't that bad. In my opinion it does a very good job in making you want more. I for one never read the manga, and just happened to come across it by mere whim. and right off the \"bat\" no pun intended I was intrigued. Granted I suspect this will be received better by those like myself that enjoy Vampire/ Werewolf anime, but if nothing else you cant deny the art in this is spectacular. The main problem story wise isthat you honestly don't know anything about any of the characters and it's no secret that if you cant fill me in in a short 12 like this you're in the wrong line of work. I won't say it's a complete waste of time but it does feel rushed. I would have honestly preferred the art being trash and the story being great vs the other way around.",
            "date": "2017-07-16T15:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 253024,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5779993.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Eazzytheprodigy",
                "username": "Eazzytheprodigy"
            },
            "url": "https://myanimelist.net/reviews.php?id=253024"
        },
        {
            "content": "In all honesty this anime is not for everyone. The first episode especially is very bizarre and set up in a way that can be very off putting but if you push through and continue watching, the series gets much better as it goes along. Overall I personally find the art style a bit ugly and the character stories aside from Mina  fairly predictable. I do however really enjoy the concept of vampires in this one. I am a  fan of the shape shifting and sire theme. If you are a big fan of vampires/supernatural creatures then I would say this anime isworth watching but may not be the best one you have seen! Overall, I enjoyed watching this anime as a nice short filler between my 50+ episode watches. Would recommend it but also wouldn't be surprised if it was disliked.\\n\\n\r\nAlso beware of loli nipples.... jus sayin.",
            "date": "2017-05-15T05:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 247726,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3844489.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lupeyroo",
                "username": "lupeyroo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247726"
        },
        {
            "content": "So, this is my first review. I may end up sounding amateurish, so don't take it too seriously.\r\nStory wise? This anime has really made me think about how a vampire society would actually be structured. Would they live in a midieval-ish type society? Or perhaps would they be changing their lifestyles alongside with us humans? The anime also begs the question: Just what exactly is \"too much\" loyalty to one person is? Is there a point where sticking with someone you love is foolish? The story here does a really good job at that. Also, there are times where the story is spoken from apoetic perspective, so the midieval feel is very strong here. There is a bit of fanservice though, some of it strange when it features Princess Mina as well, she has the body of a child. See what I'm getting at?\\n\\n\r\nArt? Well, I'm still pretty new to the anime biz honestly. So, although this show is quite old, I think its art style looks very modern and doesn't look outdated at all! The art direction really goes well with the \"nightstalker\" feel in my opinion.\\n\\n\r\nCharacters. The characters in this show really feel alive and admittedly, I enjoyed watching their interactions with one another. Take Princess Mina for example. She has a very tough exterior befitting of a vampire royal, yet on the inside, she's just as emotional as any of us. Although some of the human characters do get shoved aside for the vampire cast, I do feel like it helps the story move forward as the protagonist is essentially tied to Princess Mina and the vampire lineage.\\n\\n\r\nSound? Well, the sound effects and the soundtrack is great! I feel as if the timing of the music is never used inappropriately. A good example coming to mind is \"Fuan\" from the anime's soundtrack. Give it a listen! See if it sparks your fancy.\\n\\n\r\nOverall Enjoyment? This anime really was a fun ride to be included in. It's a shame it only lasted 12 episodes, as the ending of the anime makes the viewer want to see even more adventures with Mina, Akira, and the rest of their crew. This anime is one of the first non-romance central I watched, and I will recommend it to any vampire lovers out there. It is not the best, but it is a great introduction to the vampire central anime out there.",
            "date": "2018-12-26T00:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 296894,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7631655.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HarukaDearest",
                "username": "HarukaDearest"
            },
            "url": "https://myanimelist.net/reviews.php?id=296894"
        },
        {
            "content": "Dance in the Vampire Bund, despite the current controversy is a good Manga.\r\nStory:\r\nThe Story follows the manga, to a point with one minor change being the lead, Akira, has lost his memories. However this change only is seen as an annoyance to the watcher because its never really talked about save, for the few obvious times.\r\nArtwork:\r\nI loved the Artwork, its very dark and lends itself perfect to the setting and feel of both the Manga and the Anime. \r\nSound: Ok, not much to say with that.\r\nEnjoyment: \r\nhaving read the manga did nothing to influence my enjoyment of the series until you get to the last3 episodes. Then it just drops more the the manga plot and makes up its own.\\n\\n\r\nOverall:\\n\\n\r\nI liked it until the last 3 episodes, then it got bad.\\n\\n\r\nLast:\\n\\n\r\nRead the manga, then if you like it watch it anime, its nice to put a voice to the face sometimes. But the fact that it only have 12 episodes stinks but then again the manga is not that far ahead so we may be in-store for a season 2",
            "date": "2010-04-09T10:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 24880,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lewanova",
                "username": "Lewanova"
            },
            "url": "https://myanimelist.net/reviews.php?id=24880"
        },
        {
            "content": "The manga and anime have some differences, but they both have good story. First I watched anime which left me with mixed feelings. The storytelling was very good and story itself was interesting and had complex main characters. But there were some unexplained moments which left me confused. Many details from “Dance in Vampire Bund” manga didn’t get in anime adaptation, so I advise you to read it first. This is the last time I talk about manga and all further words will be only about my impression from this anime.\r\nOn first glance “Dance in Vampire Bund” may seem like another story focusing on vampiretheme, but there are other themes beside it. Maybe the main plot is revolving around Vampire Princess and the most of characters is supernatural creatures, but more important is how they treat each other and their relationships with humans. Discrimination of some supernatural creatures, the weight of ruling the entire nation, hard decisions for the sake of many “people”, relationship issues – those are the main themes of this anime. And all that is showed not only in conversations – which is great disadvantage of all animes trying to be serious – but in characters actions. This is making the story really awesome and interesting. I just want more anime with this trait but dreams, dreams, dreams…\\n\\n\r\nOne more thing about the story: it envelopes in a form of detective, but there aren’t really surprising plot twists.  It’s just moving force for the main plot and shouldn’t get much of your attention. The main genre here is still drama although it may appear something else in the beginning. And by the way, the first episode is just introduction to the setting, so don’t judge the whole season by it. If you are bored with it just skip to second episode – you wouldn’t lose too much.\\n\\n\r\nArt is normal most of the time, but there are silly looking echi moments which just doesn't seem to fit the story. I even don’t know if it’s some kind of bad fun service or just making the anime less serious.\\n\\n\r\nThe music is good, but it is mostly the same. Good for anime soundtrack, but I don’t have any particular melody which I liked. So I don’t see any reason to download soundtrack – music seems good only when you watching anime.\\n\\n\r\nSo, in sum, I enjoyed the anime. It could be better and more elaborating, but even with its flaws “Dance in Vampire Bund” is one of anime with really good story.\\n",
            "date": "2012-10-11T11:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 74663,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1200921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tevkr",
                "username": "Tevkr"
            },
            "url": "https://myanimelist.net/reviews.php?id=74663"
        },
        {
            "content": "Dance in the Vampire Bund is a great anime. I've rewatched it many times, and i recommend it to anyone. It is one of the best vampire animes ever, and while most animes you see people bitching saying the manga was better, in this case, while the manga was longer and has a longer story (and more completed for that matter), but with this anime, the anime was better than the manga, its just a shame that a season 2 didn't come out to finish the story. Love the anime. 10/10. I liked this anime as it has many things other animes even fail todo now. Great art, great story, great characters, great first episode, everything, except the fact they didn't continue it. but still, its a good watch.",
            "date": "2015-11-07T21:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 202927,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4981439.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tranquil-Jam",
                "username": "Tranquil-Jam"
            },
            "url": "https://myanimelist.net/reviews.php?id=202927"
        }
    ],
    [
        {
            "content": "This is another manga turned anime that was poorly adapted. Which doesn't make sense, since the manga itself has characters and a plot that you would think would need very little change to be successful. BOY WAS I WRONG.  They changed many important plot points for reasons I still don't quite understand, as well as a lot of character development that just didn't exist in the manga, to make it more 'dramatic'. This is an awful interpretation of a fantastic manga.",
            "date": "2012-02-06T18:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 53371,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1080755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mizkodomo",
                "username": "Mizkodomo"
            },
            "url": "https://myanimelist.net/reviews.php?id=53371"
        },
        {
            "content": "Dance in the vampire Bund starts off a little weird. It's not a typical anime. Once you get into it I couldn't stop watching. I fell in love with the main characters and their stories. Some scenes might be weird, but every anime is weird time to time. The one thing that kept me on the edge of my seat is the mystery, you never truly know the main character's (mina) intentions and you keep watching just to figure out on which side she's on. Overall great vampire anime! A little dark, but to be expected.\r\nP.S. There's room for a season 2 hopefully they makeone!",
            "date": "2014-04-29T06:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 141747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3735135.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Oxyniia",
                "username": "Oxyniia"
            },
            "url": "https://myanimelist.net/reviews.php?id=141747"
        },
        {
            "content": "This anime starts off good.  both the \"friends\" is the opening and ending song  \"Tsumeato\" are quite enjoyable songs and so (was) the story to this anime.That being said the main characters Akira and mina have a lot going for them and the anime builds on that i just feel they focused too much on that and not much else. thanks to that the anime had a strong start but could have been more. it isn't a \"Bad\" anime it just hits around a 6 or so on the rating list.  at the end of the day it is up to youto watch it, i did and it was enjoyable i just cant say it is an amazing title that everyone should watch.",
            "date": "2018-03-17T21:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 274140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6723762.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ScarletHaze",
                "username": "ScarletHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=274140"
        },
        {
            "content": "I had to drop it because it got quite annoying. Though not entirely bad, I have to say that I just couldn't bear with it.\r\nIt was mostly annoying because the characters could've been a lot more enjoyable but they felt quite lagged and stereotypical. Mina became your casual tsundere type and I quite like her but I wish that she was more badass.\r\nAkira is a character that made me quite wish I didn't even watch the show. He's a lot of work and I kinda felt bad for Mina in those 3 episodes that I've watched. \r\nNow, I have to say that this show mightbe for some people so I'm not gonna plummet it down to the ground because in a way, it was quite decent. It just really wasn't for me",
            "date": "2016-04-01T00:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 215003,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5288471.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jayvwrites27",
                "username": "jayvwrites27"
            },
            "url": "https://myanimelist.net/reviews.php?id=215003"
        },
        {
            "content": "I did not like the fact that the vampire is shown as a little girl. Not only is she little she dances around naked which leaves me uneasy. She is older than a mere little girl, but knowing that and seeing how little she looks does not help. Including in her sexual acts. \r\nThis vampire awaits change in the world. So she sets off an area for vampires. While plans for this area are undergoing final paper work, her life is put into danger. \r\nNext there is this teen boy whose body is changing. He ends up awaking a while in the show and thingsget intense between him and the girl. This becomes weird because she looks to be so much younger than him it feels like he is a pedophile.  \\n\\n\r\nI did not like this at all.",
            "date": "2016-04-26T18:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 217248,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Desi_Barton",
                "username": "Desi_Barton"
            },
            "url": "https://myanimelist.net/reviews.php?id=217248"
        },
        {
            "content": "I finished watching Dance in the Vampire Bund. First off, the beginning was very captivating and I wanted to find out more about where this series was going. It pulled me right in. \r\nStory: The story was pretty unique. A vampire queen wants to protect her own kind by having Japan save/pardon a small portion for her kind to leave peacefully to coexist with the human race. The other part involves romance between her and Akira, a werewolf. I won't say much else. Though pretty interesting, I felt like the plot was a bit rushed and the series could have been expanded easily to a24-episode series. \\n\\n\r\nArt: I enjoyed the animation. Plenty of action sequences, beautiful color detail on the females and eye color. Seemed to me the eyes were much of a focal point when looking at the characters. \\n\\n\r\nSound: The Opening Theme and Ending Themes were fantastic. I love the singer's voice. Professional, crisp and powerful. Dark pop to me, heh. Otherwise the rest of the series, I didn't pay too much attention to the BG music, kinda tuned it out. The high rating is only for the opening and ending songs. \\n\\n\r\nCharacter: I enjoyed the main characters. Didn't pay too much attention to the side characters, with exception to Vera and Mei Rin. If the characters were flushed out a bit more, I would have rated the character value higher.\\n\\n\r\nOverall Enjoyment: I particularly liked the overall feel of the anime. Vampires trying to coexist with humans, the theme of undying loyalty and seeing how far one promise can go....this series appears to have some cute, childish moments, but this series is for those over the age of 16. \\n\\n",
            "date": "2012-02-05T13:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 53299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1124729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NonkiLauren",
                "username": "NonkiLauren"
            },
            "url": "https://myanimelist.net/reviews.php?id=53299"
        },
        {
            "content": "So its taken me about 30 minutes to make one of these animelist things just to throw my opinion out there an to get the record strait im a 19 year old male.. but im a strong believer in a hard core fast paced action packed anime with tons of romance i truly think u cant have good combat story lines without intense feelings getting thrown around iv fallen hard in love with anime's that are very simuler to this one hear an ill admit the art is half assed and it should have stretched out over about 4 seasons an i truly hate howmuch love gets thrown around an looked past but that's as real as it gets people everywhere run across this issue all the time ware someone loves a person and thay love another i didn't care much for the constant younger older relationship thing that went down but all things aside it was a super spectacular anime that was super summarized... an yes i truly do believe if i had the funds and a year and the full permission of the creators i think i could easily do better art sound and stretch it out to be a very great and all around perfect anime as if it all ready wasn't a perfect short story but im truly grateful it wasn't a shity half thrown together anime like bleach witch in the begging was great all up to the story never took a turn for better or worse no one truly dies no one ever gives there life for the one thay love there is just a bunch of screaming ichgo an rukiu an that red heard girls name i mean it was a waste of 3 to 4 weeks of my life the up point in that was rengi and beyakuya but the rest of it blew dick other good ones if people actually read this stuff id have to say The irregular a magical high , seharfe of the end , Chivalry of a failed knight its amazing if you love tons of romance an combat expeshaly hand to hand and sword play its great but dont expect super bad ass in depth fight scenes it is a romance action after all.., SAO , GGO , Angel beats , Aquarion the first one was ok if you could push past the weird noises thay make and if you work in the day and sleep in the afternoons because your an insomniac like me i suggest all of these at some point as a mater a fact look into Tokyo ghoul my siblings seem to love fairy tale it was captivating but not my cup of tea death note is real interesting to really enjoying that but its real main stream but one thing i hate to say about all these anime that for real are perfect in all ways thay all are missing the one thing that shity anime like bleach always have length all the anime i names off are beautiful masterpieces just art in the up most great art, sound, charters, story lines, and above all thay can keep track of whats up whats gone down and thay all take you places the way anime should but you always get cut short because its hard to keep a great story going but a mediocre half assed story can push on forever all you have to do is throw you 5 or 6 undefetabel charters in new places to fight intense battles until you simply cant deal with how gay its really gotten cause all anime start good its the ones that get great that never make it far but if an anime gets past season one expect to find out real fast weather its great or just ok and a lot of mainstream anime that seem to be tossed around are just ok not to mention every anime creator has high hopes expecting his or her anime to get into season 10 an shit but always fall short around two its like writers block for book writers and stuff its all the same to be completely real if people actually read this far on my dumb ass rant sit down an try to wright an anime you have the basics from school (beginning, middle, peak point, end) see how far you truly get the farthest i can seem to make it most the time is 4 seasons broke up to an average of 12 to 14 episodes but i don't have the equipment to actually put it on the computer and make my drawings and story come to life i just get this half assed clip art... but yup i got way of topic the rest u ppl that think ditvb sucked can suck my nob cause you only hate cause u cant make",
            "date": "2016-03-23T05:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 213689,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5281716.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/IJustLoveAnime19",
                "username": "IJustLoveAnime19"
            },
            "url": "https://myanimelist.net/reviews.php?id=213689"
        },
        {
            "content": "I've always been a Vampire fan... I've watched Forever Knight, Interview with a Vampire, Buffy the Vampire Slayer, Angel and The Vampire Diaries... vampires just seem so mysterious and yeah, sexy... \r\nMain Characters: Mina Tepes and Akira Kaburagi Regendorf\r\nI guess the storyline just boils down to one thing: A Promise... simple & at some point, intriguing... but that was not enough to really hold my interest, though...\r\nMina Tepes, the Queen of the vampires, is portrayed as a little girl (11yrs old?) who is too comfortable in her own skin... Akira Kaburagi, the boy werewolf who swore to protect her and give her everything he has...a Vampire and a Werewolf... aren't they supposed to be enemies? Sexual Tension, maybe? if only Mina was not depicted as a minor... oh well, maybe that's for the best since we already have the Nanami and Yuzuru tandem... *awkward*shivers* -- better watch the series to find out... fair warning was already given, eh?\\n\\n\r\nMoving on to the supporting characters: Yuki Saegusa was too cutesy for my taste... The Vampire maids were funny, especially in the Dance of the Vampire Maids (?) scenes... Mei Ren reminded me of Sawa from Kite... a sexier version... the other vampires were so-so...\\n\\n\r\nI had high hopes for this anime ever since I saw the news about its DVD/Blu-Ray release... It did not really disappoint, it was actually good... it was just missing something... Needless to say 12 episodes are enough for DitVB but I guess I wanted my vampires to kick more a** and be more sinister... More Claudia, please...  :)",
            "date": "2011-07-21T23:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 39699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/519987.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BBHood22",
                "username": "BBHood22"
            },
            "url": "https://myanimelist.net/reviews.php?id=39699"
        },
        {
            "content": "A show that screams 'bad adaptation' pretty much off the bat, Dance in the Vampire Bund is a mix of gratuitous fanservice and over-the-top violence portrayed within a convoluted world that is explained in periodic info-dumps and vague plot points that could only be satisfied by going to the source material.\r\nIf you've come for the loli vampire queen, I imagine you'll only leave somewhat satisfied. While the politicking, romantically troubled and not-infrequently naked Mina Tepis steals the spotlight in terms of character (much more so than our generic jacked werewolf high school protagonist), she's trapped within the mess of a plot that make her intentionseven more vague than perhaps even she would like them. What she's doing is given a lot of weight but never enough explanation or grounding to really make it compelling beyond the fact that she strikes such dramatic poses when talking about it.\\n\\n\r\nAfter the rather lackluster first episode that isn't representative of the substance or tone of the rest of the story it's almost non-stop drama and action, taking only the occasional breather to give any sort of substance to what's going on on screen beyond all the flesh and blood. This might sound exciting to people who are here exactly for those reasons, but more often than not it's just confusing as we whip from one shocking plot revelation to the next, adding yet more characters and intrigue in order to keep the viewer watching. \\n\\n\r\nThe charitable reading of this work is that the is has to fit a much better-paced manga into 12 episodes, but even so this knowledge would not save it. Beyond the story itself, the art is lackluster and often leans on long shots with low detail in order to save on budget in a way that's reminiscent of the earlier episodes of Bakemonogatari but without the charm of the dialogue or characters. The character design itself isn't particularly attractive but does communicate quite clearly the intent to make them look so.\\n\\n\r\nWatching Bund, you'll understand why that, when people think Shaft and Vampires, they don't think of this. However, beyond that and a few moments of some of the more graphic fanservice I've seen, there's little worth watching this show for.",
            "date": "2016-10-28T13:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 232797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=232797"
        },
        {
            "content": "At first, this anime started out very good but then failed to finish providing a good story, but I'll still give the story an (8). It started out with some violence and mystery at first and then ended up being some love story about some promise a guy made to some little girl who happens to be a vampire.The story became stupid if you ask me, but I'll stop beating up the anime because there were other things that kept me watching it. The sound was good, I really don't see how an anime can't have good sound, but the art was outstanding, which iswhy I give it a (10). The characters were well drawn and the color was great. The art is one of the best things Dance in the Vampire Bund has to offer. The characters were also good too (9), a tad bit silly but they're likable. Enjoyment (7) I did enjoy this anime but it had so much more potential. I think the creators focused more on the romance than the story for this one. Overall (7) you should try this anime out, the beginning to the middle is very good and keeps you interesting but it goes down hill from there, but then again you may end up liking it. If you are looking for romance, action and a plot you can go with then try this.",
            "date": "2012-09-21T12:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 72847,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479765.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CoolBreeze",
                "username": "CoolBreeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=72847"
        },
        {
            "content": "While I was watching Dance in the Vampire Bund, I did look at the reviews to see if I should bother trying to finish the series - it was a mix of good and bad, so I gave it a shot. Honestly, I was expecting worse. It's in no way my favorite vampire anime, but it's definitely better some of them. This review was based entirely on the english dub.\r\nSTORY: It started off great. The concept was amazing, in my opinion. I've never seen vampires willingly reveal themselves into human society, and tell them that they plan to form their own nation within their country.The idea of a vampire nation within human society has been done before - but never with all humans knowing that vampires existed. The main focus however seems to be on Mina and Akira's relationship, rather than the development of the vampire bund and everything that interfered with it. I couldn't help but keep watching, but as the story went on - I did start getting bored. What was with all of Akira's flashbacks? Only one of them was actually explained in detail, and it was the last one he needed for his memory to be back in full. I like that he stood by Mina's side even without his memories, but I felt like they could have went into more detail on that.\\n\\n\r\nART: Do I really need to say more? The animation was beautiful. I wouldn't say they had the best animation for a vampire anime, but it's up there. The true forms looked quite good as well. I was expecting all of them to be hideous, and for the most part, they were. Mina's true vampire form was the most spectacular one. The beast forms of Meiren and Akira were drawn beautifully as well, with a lot of detail.\\n\\n\r\nSOUND: The voice-overs were decent, and the OPs and EDs were very fitting of the series.\\n\\n\r\nCHARACTER: I liked Akira, but that's mostly because he's a bishounen and I can't help but like most of them - that's really all he had going for him aside from being a werewolf. Out of the other characters, Mina was the only one that had any true development. The loyal servant, Veratos, that will do anything for the ruler had already been done by other anime - and there was nothing about Vera that really made her stand out. Yuki didn't really stand out much either - just the classic \"girl next door\" that loves the male protagonist, the only difference is that she doesn't end up with him but that's canceled by the fact that she dated him pre-series. Wolfgang is Akira's father, and although he looked badass - we know nothing about him, but I suppose that's better than getting a lot of screentime and getting no development. I didn't hate the characters by any chance, but all of them could have used development. Yuki, Mina, and Akira are the only ones listed as main characters - but of those three, only Mina had any depth. They started trying to develop Akira near the end, but it was too little, too late; with them mentioning the amnesia early on, they should have been able to do a bit more with him. They didn't even seem to try with Yuki. Overall, the characterization was a disappointment.\\n\\n\r\nENJOYMENT: Despite my dislike of the character development, among other things, I won't deny that I enjoyed watching it. The series definitely kept me wanting more; it took me less than 24 hours to watch the whole thing - and that's a feat for even the shortest of series with me.\\n\\n\r\nOVERALL: Dance in the Vampire Bund is by no means a bad anime. Yet, it's not a great anime either. If you're watching it just to watch it, you'll enjoy it quite a bit. However, if you go in with a lot of preconceptions, you might be disappointed. All vampire anime are done differently, but only some of them can actually make the genre enjoyable. Vampires are my favorite supernatural creatures, but very few anime can portray them well. Dance in the Vampire Bund is one of the few that can actually show us a decent portrayal of vampirism.",
            "date": "2012-01-24T17:43:00+00:00",
            "helpful_count": 0,
            "mal_id": 52473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1110983.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HeyItsCami",
                "username": "HeyItsCami"
            },
            "url": "https://myanimelist.net/reviews.php?id=52473"
        }
    ]
]