[
    [
        {
            "content": "Cliches, stereotypes, formulas, and other such mass production \"tools\" that are involved in the creation of \"original\" anime are a common part of the industry these days. One only has to look at the shows released over the previous season, never mind the previous year, to see just how many titles are nothing more than variations on a given theme.\r\nThat doesn't mean that they're all bad though. While an anime may be burdened with cliches, have a fomulaic plot and/or stereotypical characters, if these are used in an intelligent and innovative manner then it's possible to produce something decent at least. Sadly, many of showsmade this way (which unfortunately is the majority of anime these days), have more in common with the delusions of a hormone addled teenager (either male or female), than they do with quality entertainment.\\n\\n\r\nThanks heavens for small favours.\\n\\n\r\nOtome Youkai Zakuro is based on the ongoing historical fantasy manga of the same name by Hoshino Lily. The story is set in an alternate Japan during the Meiji era's period of Westernisation, where the Ministry of Spirit Affairs deals with the common and uncommon issues that arise in a multi-vital society (i.e. youkai and humans trying to live side by side).\\n\\n\r\nThe story is pretty decent for the most part, especially in terms of content, and there's a lot to keep the casual viewer watching the show. The plot is pitched at a specific audience though, and while it may flow quite well, although there are times when it's difficult to tell who that audience is. In addition to this, one can't help but think of Otome Youkai Zakuro as more than a little \"folkish\", and with good reason too as aside from the obvious allusions to Japanese folklore and mythology, there's actually a very subtle, and slightly bawdy, undercurrent to the show that seems to have bypassed just about everybody.\\n\\n\r\nConfused? Well, it's not that obvious as it has to do with soldiers, maidens, garter-belts and folk songs. Three soldiers are sent to join the Ministry of Spirit Affairs where they are to partner young half-youkai ladies (complete with animal ears), who are supposed to represent the yamato nadeshiko, but carry branches with pomegranate blossoms inside other spirits or their garter belts like they're some kind of hidden weapon.\\n\\n\r\nSeriously, if I showed that sentence to anyone interested in traditional ribaldry or the more coarse side of folk music they'd first applaud the subtlety, then laugh themselves silly.\\n\\n\r\nBut I digress. The fact is that Hoshino Lily managed to insert some very sly inferences directly into the plot without anybody realising it, which should bode well for the series ... if it wasn't for one thing that is. While the story may be decent enough, certain key plot events can feel staged because the viewer is able to predict not only what is going to happen, but the outcome as well. This is one of the dangers of relying too heavily on cliches, stereotypes and formulas, as there is an inherent repetitiveness that arises from using these \"tools\".\\n\\n\r\nAnd boy, does this show use them.\\n\\n\r\nOtome Youkai Zakuro is one of those shows that looks as though it was made while someone was checking boxes in a \"moe: how to ...\" handbook. One look at the series and it's clear that while this may be labelled a seinen show (with some rather obvious shoujo influences), the target audience is mainly those who like \"cute\" young girls with animal ears.\\n\\n\r\nThe \"human\" characters have been made to look as attractive as possible, even when they're being evil, and there's a certain generic quality to the design principle that can sometimes make the viewer wonder if they've seen the character before (I'm pretty sure I saw the elephant guy in India). The settings are nicely detailed, but while they're well suited to the time period, they seem a bit too clinical and sanitised. Everything and everyone are too clean and too \"nice\", even when bad things are happening, and this can sometimes make it difficult to take the show seriously. The colour scheme also compounds the \"nice\" atmosphere, and Otome Youkai Zakuro is literally awash with \"cute\" pinks, blues, greens, yellows, etc.\\n\\n\r\nOn the plus side, the animation is pretty good, with flowing character movements  and some rather nice action set pieces. The problem  is that the shadow of repetition raises its head once more. There are a few scenes that, aside from the backgrounds, are simply the same routine repeated over and over again (the most common one being Zakuro's transformation into \"Mega-Zakuro\" - which basically means she has a knife instead of a stick and her pupils change shape). Fortunately this doesn't really impede on one's enjoyment of the series, but it does make one wonder why more effort hasn't gone into the animation production, and also why a respected studio like J.C. Staff decided to cut some very obvious corners.\\n\\n\r\nThankfully the acting is a definite step in the right direction, although it has to be said that some of the roles didn't really require anything special. Nakahara Mai is an enormously talented actress and has some surprising lead roles under her belt (Furukawa Nagisa from Clannad, Ryuuguu Rena from Higurashi, etc), but while she gives a decent performance in her role as Zakuro, she is ultimately limited by some mediocre scripting. The same is true for Sakurai Takahiro (who plays Agemaki Kei), and the rest of the cast, and while all of the sieyuu clearly have a great deal of ability, there are times when it feels like their skills aren't being fully utilised.\\n\\n\r\nOn a different note, aside from some strange choices with the incidental music, the soundtrack is functional, but that's about the best one can say about it. There are some small issues with timing, and more importantly relevance, but these can be viewed as minor niggles that are quickly forgotten. The big issues are the opening theme and the three ending themes. The OP is well animated, but the timing is all over the place, and to further compound matters Moon Signal by Sphere doesn't fit in with the look, storyline, or atmosphere of the whole show. The song feels completely out of place, but that's just the tip of the iceberg.\\n\\n\r\nAll of the EDs are sung by the seiyuu whose roles are partnered in the anime (for example, Nakahara Mai and Sakurai Takahiro sing the first one together), which is nice, and could have worked well as an additional reinforcement of the bond between the soldiers and the youkai maidens. Unfortunately it seems as though somebody has overestimated their musical ability (I look pointedly at you Sugimoto Masaru), as the first two EDs, Hatsukoi wa Zakuro-iro and Junjou Masquerade, are stereotypical efforts that don't work with the ending sequence's imagery, nor the main storyline itself. Strangely, the third ED, Futari Shizuka, is more in keeping with the feel of the show, so it's obvious that although somebody was paying attention, it wasn't enough or they were sinply overruled by the producers.\\n\\n\r\nNow while it may be true that the scripting wasn't up to spec, that doesn't mean that the characters were poorly envisioned. Granted there is a degree of formula to their personas (Zakuro being a tsundere is one example of this), and a number of cliches are on display with their development, but as a rule the characters aren't that bad. Each is able to grow because of their \"partnership\", and while there is a certain method and measure to this, the evolution of the characters is treated with a degree of diffidence that somewhat belies the open targeting of the moe market.\\n\\n\r\nUnfortunately, the developmental method is a bit too formulaic at times, and because of this the viewer can feel like certain obvious events are being force fed to them in an effort to elicit some sort of empathy. That said, the characters are charming in their own ways, and while they may appeal to a specific fan base, that doesn't mean that others won't find them interesting, or even cute.\\n\\n\r\nI will admit that Otome Youkai Zakuro surprised me, as while it's definitely cliched and formulaic, it's also pretty enjoyable in a charming, quirky sort of way. Yes, the story is predictable, but rather than make the characters completely stereotypical there has been some effort to give them a degree of individuality (which is one of the reasons why the poor scripting is so noticeable). The design may be aimed at the moe markets, but within that saccharine sweet exterior lies a story that tries to mix several genres to produce something ... at least a little different.\\n\\n\r\nUltimately though, this is yet another example of the anime industry wasting the opportunity to produce something above average. It's a decent show, but it had the potential to be so much better than it is if the producers and director had tried that little bit harder to ditch the fomrulaic approach.\\n",
            "date": "2010-12-30T12:12:00+00:00",
            "helpful_count": 223,
            "mal_id": 33212,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=33212"
        },
        {
            "content": "Ever hear of the saying \"try something new\", well I'm glad I did.  At the beginning of the season I wasn't expecting much from Otome Youkai Zakuro but boy did this series surprise me.Otome Youkai Zakuro is produced by J.C. Staff and the reason I wasn't expecting much from it was because they were already producing 2 other more hyped anime this season.  However I think this might be the best one out of the three they put out this season.\r\nThe series takes place in the Meiji Era (which is anywhere between 1868 and 1912).  During this time 3 Soldiers are sentto the Spirit Affairs where they work with half spirits to resolve the issues between spirits and humans.  But as they continue with their jobs a greater problem presents itself which is deeply related to Zakuro's past.  As the story continues to unfold Zakuro's problem grows bigger and the Spirit Affairs are forced to resolve it.\\n\\n\r\nOtome Youkai Zakuro gave me a pleasent surprise because every episode was significant and contributed to the story.  The story was well paced which a lot of anime series fail to do these days.  A lot of new series I watch these days tend to leave off all plot until the final episodes which makes the series seem rushed.  However Otome Youkai Zakuro advances the plot more with every episode that goes by which doesn't make the ending or any part of the series seemed rushed whatsoever.  The actual plot was actually really well written and not overly complicated.  The problem with a number of series these days is they try to be so creative that it just over complicates things.  Otome Youkai Zakuro didn't try for too much which is why the story flowed so well.  The plot of the series seemed pretty simple and straight forward and as it unfolds it becomes something beautiful.  Also unlike a number of series out there,  Otome Youkai Zakuro actually has a proper ending instead of leaving the series up in the air.\\n\\n\r\nThe art and animation were beautiful.  The animation was pretty smooth and the art was just astounding.  The backgrounds had a lot of detail and it always caught my attention.  Art isn't really something I usually pay attention to but this was so beautiful that it managed to catch my attention and enhanced the beauty of the series.\\n\\n\r\nThe sound is also really well done.  The opening was really good and one of the first openings which I actually remembered the rhythm to. The alternating endings were always a treat and well done too.  I often found myself listening to the full ending which is something considering I'm a guy that likes to skip endings.\\n\\n\r\nThe problem with tsunderes today is that anime series like to overdo it.  Characters these days are so overly tsundere that they just seem unrealistic.  However Zakuro is different, although she is a tsundere she isn't overly done, she can admit when she's wrong. This is what I like about Zakuro, her personality is not over-done which makes her feel so real.\\n\\n\r\nOur main protagonist Kei Agemaki is alright too.  He starts off really afraid of spirits but as the series continues he fights his fears and by the end he has completely no fear of spirits.  He also has other flaws too but that's what makes him a good character.  Some anime these days have protagonists who are perfect in every way shape and form which isn't good because they don't develop.  \\n\\n\r\nThere is also romance between Zakuro and Kei and what makes it good is that they both have flaws and that they both help the other with it. The romance just wouldn't be the same if the other did not have flaws.\\n\\n\r\nThe other characters also help this series too.  The romance between Riken and Susukihatarou is really interesting.  A lot of other series don't usually have romances between other characters which don't usually get you to think about them.  However since this series had every character develop relationships, you never really forget any of them.  \\n\\n\r\nThere's nothing really bad to say about Otome Youkai Zakuro.  I often found the episodes to be short and it never bored me.  Everything about this series was great because it didn't try for too much and it didn't exaggerate things. It seems that a lot of anime series today are really poorly paced with lackluster plots because they focus too much on side stories of characters. Otome Youkai Zakuro just shows that with a well written and well paced plot, everything else will just fall into place.\\n\\n\\n\\n\\n\\n",
            "date": "2010-12-28T09:54:00+00:00",
            "helpful_count": 110,
            "mal_id": 33152,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=33152"
        },
        {
            "content": "Otome Youkai Zakuro promised a unique plot from the very beginning, and it's only getting better and better. Backed by great character developement, voice acting, and artwork, this anime is sure to keep everyone hooked.\r\nI like everything about this ainme, and haven't really found anything to dislike. I expect it to get even better as it continues, and I'd definently suggest it to everyone!",
            "date": "2010-11-22T15:31:00+00:00",
            "helpful_count": 44,
            "mal_id": 32247,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Johnforester15",
                "username": "Johnforester15"
            },
            "url": "https://myanimelist.net/reviews.php?id=32247"
        },
        {
            "content": "Do not be deceived by the \"seinen\" genre, 'Otome Youkai Zakuro' ('Girl Demon Zakuro') has everything that makes it a shoujo anime.\r\nThe story is centered around newly formed Ministry of Spirit Affairs where Zakuro, along with other half-demon operatives and militants settle youkai-related problems around the city. Zakuro has a mysterious background, and slowly learns her own dark past through encounter with various antagonists. Hmm... the plot synopsis and setting sure sound like shounen. However, the story, character, and animation have such strong resemblance to typical shoujo material that it's hard to claim this is targeted toward the male demographics.\r\nStory:\r\nThe story is set in 19thcentury alternate Japan, where Westernization had just begun. It actually looks like colonization because the army consists entirely of rich Caucasian-looking guys while half-demons and civilians are dressed in traditional Japanese attire, but it is not clear exactly how the government functions or how the civilians are reacting toward Westernization. This show is certainly not about politics or realism, and that's just fine. The central theme of 'Otome Youkai Zakuro' is romance. Members of Ministry of Spirit Affairs are separated into 3 pairs (I'm going to count the twins as one), and basically they instantly fall in love and overcome numerous romantic predicaments, forming stronger bond after each incident. The romance really kicks in through mid-latter part of the show. Now, most shoujo series are about romance, but that doesn't automatically make it one. What does make this a shoujo series is that the girls keep ending up in the arms of princes through most improbable circumstances, and the fact that 90% of the time it was the girl whose heart \"skips a beat\" after a guy spews out an incredibly corny line. Another major theme of this show is coexistence of youkai (demons) and human beings. This is also set up so that it's the girl who's in the receiving end of the discrimination, and the prince comes to the rescue.\\n\\n\r\nThe story does have a very good flow, as we learn more about Zakuro's past in every episode, which piques our interest for new episodes without apparent cliffhangers. On the other hand, there are so many plot holes with the setting and turn of events that completely defies logic. The worst facepalm moment occurred when our heroes trapped in a cellar were struggling to keep the door closed because they'll get flooded if those doors break down. Such an unlikely circumstance, not to mention why would anyone trap someone in a place with such fragile doors? I can still somehow tolerate that, but then the heroines \"save\" them by smashing open the very door the prisoners were trying to keep closed... What?! And they didn't rip off their arms by keeping them from drowning? Water flow didn't even seem to be serious enough to drown... I give up.\\n\\n\r\nCharacter:\\n\r\nZakuro is by far the strongest operative in Ministry of Spirit Affairs, but being a shoujo anime that it is, she's mentally weak and constantly requires the big, tough prince to protect her, even though Agemaki is very weak and thus never putting up a real fight (he just offers moral support).\\n\r\nSusukihotaru is a typical fragile chick who needs protection, and he gets it from the strongest and honorable human warrior Riken. \\n\r\nGanryuu is a shoujo-equivalent of a loli, and gets the twins Bonbori and Houzuki to constantly pamper him. \\n\\n\r\nI have to admit the characters did have very good backgrounds that made them interesting and contributed to the story, but this setup makes the show predictable as hell. \\n\\n\r\nThe character abilities also do not make a good shounen show, because men are completely hopeless, and all girls other than Zakuro are nearly equally useless in battle, not even having any support ability other than singing (why does it even raise Zakuro's spirit level?). All their skills are for reconnaissance rather than actual fighting, and it's always Zakuro showing up and defeats the enemy in 1 hit to advance the plot.\\n\\n\r\nAnimation:\\n\r\nThe style is decidedly targeted toward, and typical of shoujo series. All the guys look so feminine that I was surprised there was no BL. A lot of flowers blooming to express emotion (obviously done as a joke, but still...). The demons are rather friendly looking, 'Inu Yasha' types, and very little gore or blood.\\n\r\nI personally hate this art style, but technically it was above average. Characters have high consistency in appearance, and detailed. Backgrounds set nice atmosphere, and it's usually clear sky or indoors with few objects, but detailed when it needs to be. Action sequences are short, but not as boring as it could've been.\\n\\n\r\nSound:\\n\r\nEveryone sounded like they should. Very emotional when needed to be.\\n\r\nBGM was pretty ordinary and did not play a crucial part in the show.\\n\r\nOP was somewhat catchy, but too intense for the mood of this series, and ED was outright horrible.\\n\\n\r\nEnjoyment:\\n\r\n'Otome Youkai Zakuro' is like a shoujo version of 'Inu Yasha'. It does have some shounen and seinen elements mixed in, but predominantly a shoujo anime. I have no idea what the author and producers were trying to do with this series. As it stands, it's a weird shoujo romance with demons, and unwatchable as a shounen/seinen adventure.\\n\\n\r\nNeedless to say, I'm not in the primary target demographics, but I found the story to be more engaging than most shoujo series I've seen before despite its flaws. The ending was quite satisfying and summed up all the mysteries of Zakuro's past. \\n",
            "date": "2010-12-30T10:20:00+00:00",
            "helpful_count": 24,
            "mal_id": 33210,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=33210"
        },
        {
            "content": "Note that this review is based on the first 2 episodes [ don't start screaming if u feel it's incomplete xD ] It also might contain some spoilers so be careful:\r\nOtome Youkai Zakuro ,an anime about youkai and humans trying to fight together and learn to accept each other....the story might not be unheard of,but I,for one,appreciate more the way a story unfolds than if it's totally new as plot,because what makes a story good is  the way characters interact and the ''pace'' of all the action.\r\nStory: For what i saw thus far, a not very slow but not very fast paced plot isunfolding.We get to know the main characters at an acceptable pace  [like ep 2 started with Zakuro,the main character].What's extremely good in this anime is the character interactions.The plot has alot of humor,and personally, i laughed half of the time or more all throughout the episode.It's also interesting the ''chanting'' of the youkai girls before a battle,i find it beautiful and ''bewitching'' as Zakuro herself says,and somehow seems to transmit a traditional japanese ghost folklore feeling.And from what i have read of the manga,it seemed to me like  the manga had less funny moments than the anime,which in this case i didn't enjoy much,because the humor was done very well. 9/10 thus far.\\n\\n\r\nArt: Very beautiful,energetic and fun [ those who say pink is gay have no reason to continue reading this section >.> thank you ] It is also very faithful to the manga art.My opinion is that there is nothing more to add here. 10/10\\n\\n\r\nSound: Until now,the sound also seems fitting to the feeling of the anime.It's half serious/half energetic [ talking about the opening song].The 2 ending songs are also ok. 9/10\\n\\n\r\nCharacter: hehe,one of the best parts of this anime.I think that until now i like all the characters very much.Zakuro might seem a typical tsundere style girl,but,we forgive her ...since she's still young and inexperienced in love ^^..plus she certainly has funny moments at some times , most of them when she interacts with Agemaki .\\n\r\nAgemaki Kei on the other hand i think is the true humor-producer in this story....his fear for youkai and his tendency to try and hide it by looking cool on the outside [most of the times] turns every situation into something very hilarious.Add to those reactions a voice actor good enough to take on such a role [ Sakurai Takahiro-sama] and u get the funniest and yet still most bishounen character in the series..[ gotta love Agemaki Kei ]\\n\r\nBonBori and Hoozuki are the deadly-twins..they are adorable [ as is Susukihotaru]...although they might act the same and u confuse them ,they actually complete each other [you will understand if you watch the anime]\\n\r\nSusukihotaru is the quiet sweet type...she's too adorable when she blushes...>.>\\n\r\nGanryuu is the little boy with the BIG attitude,yet he is also sweet,no wonder the 2 twins enjoy grabbing him and taking him everywhere with them[ he probably will hold a harem when he grows bigger..lmfao..]\\n\r\nRiken is the quiet type,yet he is very kind....hmm..the bigger brother image...a mature guy,also very nice character.\\n\r\nAnother funny character is Mamezou....him and Agemaki would make a great comedic duet [ they already do...rofl...]   10/10\\n\\n\r\nThis is what i feel thus far for this series,even though it's pretty early to conclude....but for now i think it's enough.",
            "date": "2010-10-11T13:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 31285,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/115521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mel-hime",
                "username": "mel-hime"
            },
            "url": "https://myanimelist.net/reviews.php?id=31285"
        },
        {
            "content": "Story- The plot wasn't confusing at all. It wasn't cliche, and very original. It did have a few things that were predictable, but only a few. I think that this  was a very unique and different anime. The ended was surprisingly different then how I though it would end. There was only one thing I didn't like at the end.\r\nArt- The art really shined in this anime. The character and setting art was average, it was the fighting. The visuals were stunning during a fight scene. There were vivid colors and it flowed nicely. The cherry blossom petals that occasionally showed look beautiful. Theart in the opening rely captured the show. It showed the action part as you see Zakuro fighting, the cherry blossoms in the wind. The colors they used either represented the darkness of the show, with reds and blacks, or the lightness and love, the flowers and bright colors.\\n\\n\r\nSound- the music itself was slightly memorable. I like the opening theme song. It really captured the show. The voice acting was spot on; It really reflected the characters. There is no dub.\\n\\n\r\nCharacters- I think that some of the characters could have been given more dept, such as Riken and Susuki. Other than that I thought that each character was extremely either well presented or average.  Zakuro look at acted a lot like Hikari from Special A, I'm not getting over that.\\n\\n\r\nEnjoyment- I really loved this shoe. I love hoe original it was. The girls singing as the other kills a spirit, perfect. The powers they had, pure genus. The only problem I had was what I stated.",
            "date": "2015-03-02T09:01:00+00:00",
            "helpful_count": 14,
            "mal_id": 181539,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437397.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuPrincess010",
                "username": "OtakuPrincess010"
            },
            "url": "https://myanimelist.net/reviews.php?id=181539"
        },
        {
            "content": "If there is something that i learned over the years that i watched anime is that it doesn't matter what genre is the show , shounen , shoujo , seinen or jousei , if it has a good story i will watch it and with that in mind i tried Otome Youkai Zakuro . \r\nStory 7 \r\nIt wasn't the best story that is for sure , but it wasn't the worst either , it had ups and downs as all other animes . As some of you know cuz' you've read the plot line this anime is about 3 soldiers Agemaki ,Ganryuu and Riken ,who have been assinged to the Ministry of Spirit Affairs , there they met our other protagonists , in other words Zakuro , Bonbori , Hoozuki and Susukihotaru . From here on some of you will know how it will develop , romance between characters , drama and lets not forget about the action . \\n\r\nWhat made me give this anime a 7 for the story was the ending , i don't really like the whole concept of ' I am your enemy , but now that a stronger guy makes his appearance i will fight alongside you ' , that is a clear no , if you are the bad dude of the show stay that way till the end . \\n\r\nAll in all , the story could've been handled a lot better , but beggars can't be choosers . \\n\\n\\n\r\nCharacters 7\\n\\n\r\nLets see , here we have a wide range of them the tsundere Zakuro , the ' wuss ' Agemaki , the shy-able to read minds Susukihotaru , the stone faced Riken , the chearfull twins Bonbori and Hoozuki and the last child looking Ganryuu . Of course there are support characters but they do almost anything all the anime , in other words they are not important .\\n\r\nAs for the enemy we have another pair of twins that are weak as hell plus one of them is the avearange idiot who is envious of her older sister , the Black Widow who was supposed to be strong but was taken down in matter of seconds , twice i might add and lets not forget the ' party-changing ' main villan who only showed his true colours at the end of the anime . \\n\r\nIf it weren't for the so called bad guys of the show this part of the review would get a better grade . \\n\\n\\n\r\nSound 8 \\n\\n\r\nEven if the OST was not something that i am particularly attracted to in anime there are times when it stays with you even after you finished it . \\n\r\nI don't really know if the girls singing when they are fighting is called OST but , i found it really cute and catchy , for that sole reason i will give it an 8 . \\n\\n\r\nArt / Animation 9 \\n\\n\r\nHere we have a winner , if the story and characters were not something out of the ordanary , this made the anime a lot better . \\n\r\nIt is very shoujo-esque , but who cares ? The colours are lively and the art is surprisingly good .  The battles were well drawn , every other scene was well made , you could feel that this isn't a low budget show . \\n\\n\\n\r\nEnjoyment 8 \\n\\n\r\nEven if this anime is not the masterpiece we are all searching for , in the same degree this isn't the moe filled piece of garbage some are looking for either , yes as a matter of fact i forgot to add this : This anime has no panty shots , no se through clothes and other things that i don't really care for in my anime . \\n\r\nAnyway all i can say is that i enjoyed this anime to its fullest . \\n\\n\\n\r\nOverall 7.8 / 8 \\n\\n\r\nIn my book this is something that can be watched once when you have time and the mood to see some romance with a bit of action and singing mixed together . \\n\r\nNothing else to say here , thx for reading this .",
            "date": "2013-08-21T00:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 110629,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1354627.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AgelessPharaoh",
                "username": "AgelessPharaoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=110629"
        },
        {
            "content": "I didnt have high expectations for \"Otome Youkai Zakuro\" (eng. Spirit girl Zakuro), due to some recent let downs in the romance genre department (Yes, Wolf girl & Black prince, im looking at you). But I was happily suprised by this show, it wasnt a let down at all! Yes, at first glans it can look very stereotypical, but actually had its own style and some very none sterotypical character relationships. If you are in to romance animes which is not only character based and with some deeper subjects - well, then its definitley for you.\r\nStory: 8/10\r\nThe story isnt super deep or complicated, but surelyenough to keep your intrest. In historical setting we get to follow the half-youkai female cast cooperations with a western originated male cast to ease the realtionships between humans and youkais (spirits), in Japan. Its not a dance on roses to get humans and spirits to coexist, and we also gets some glimpses of the not always so smooth interaction of western values and things in Japanese culture (which the cast member discusses and argue about from time to time during the show). We get to follow several characters, but our main girl is Zakuro. The story mainly centers around her, even if it at first may seem like random events. Overall not a masterpiece, but shore something worth your time.\\n\\n\r\nArt: 8/10\\n\r\nNot outstanding in any way, but its really pretty. Both male and female cast are beautiful and should satisfy both the female and male audience.  Particulary I liked Zakuros character design, she could both look really pretty and like the strong spirit fox she is.There are some nice light settings as well. The thing that stood out is the scences with the cherry blossom trees and how the are used by the half-youkais to \"cleans spirits\". Its also very pretty. \\n\\n\r\nSound: 7/10\\n\r\nAbsolutly not the best I heard, but the music filled it purpose and did manage to highlight the mood of the scenes. The opening song was actually quite beautiful and poppig, and suited the show very well. The half-youkais hymm then cleansing spirits was ear candy. Vocie acting was also really good.\\n\\n\r\nCharacter: 8/10\\n\r\nLike i mentioned before, at first glans they look quite sterotypical, but most of them actually suprised me alot. They had their own peronalites that didnt fit some of the most common archetypes. Most suprising was Zakuro and Kei, who both was refreshing in this genre. Like in most short running shows, it was no major character developments. But they manage to put in enough to make the show more likable and intresting. Its actually three romances going on (ok, mayby three and a half), and all are unique in their own way. \\n\\n\r\nMy absolute favorite is Zakuro. She is a strong and compassioned girl, whom concile her own fear to not worry others. To see how she has to deal with both being half-human and half-youkai was impressive, and how she is handling things then her unknown past is starting to get to the surface. Zakuro is nobodys push over, thats for shore.\\n\\n\r\nKei, was probably the character whom suprised me the most. You may think he is fearless and strong, but are actually terrified of youkai and arent that great of fighting either (so he ends up being saved by Zakuro on regular basis). To see him deal with his fears (which he knows are a bit ridiculous) and become stronger for Zakuros sake, are nothing but adorable. \\n\\n\r\nAll of the other main and supporting cast was also very likable. Its was overall enjoyable to watch the different realtionships grow (both romanticly and other wise).\\n\\n\r\nEnjoyment: 9/10\\n\r\nI enjoyed it quite alot! I actually benk watched this one. Its was aslo a true a eye candy parade, which only made it more enjoyable for me.\\n\\n\r\nOverall: 8/10\\n\r\nA very good short running show. It did its job done in the short time it had, without feeling rushed. The romance was in all cases heart warming and enjoyable to watch. The romance wasnt the story, but more something that came together with the storyline of events. Definitley something I will remember.",
            "date": "2016-10-23T03:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 232417,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=232417"
        },
        {
            "content": "First Impression & Bias:\r\nSo what happens when you think your going to watch some shoujo with girls duking it out with twigs in pink yukatas with bishie males? Well naturally as a male I flinched a little bit. Yet, thankfully this show was heartwarming and very enjoyable from the start. This provided stress free entertainment, a pure romance that's main goal was to deliver. \r\nExpected: 6\r\nEpisode Scores: -,-,-,-,8,-,8,8,7,9,8,8,9,9\r\nActual: 8 (Very Good)\r\nThe premise is predictable and very bland to tell the truth. However, the plot is rather insignificant to the show as a whole. Why, this is because the focus is only on the relationships betweenthe couples, and to see that they progress smoothly. While they do squeeze a arc into the last few episodes, it is not just some crap pulled together at the last minute, but a carefully planned and meaningful one.\\n\r\nThree men are sent to the Spirit affairs, and are paired up with their work companion.The main couple of the show are your basic tsundere pair. Thankfully the characters don't enjoy giving you much of a headache so the act is dropped frequently enough that Zakuro never gets on your nerves, and actually becomes that strong yet gentle on the inside character they were looking to create. The other pairs are not really focused on as much, but Riken and Susukihotaru are most perfect pair ever. I swear a fangirl was born inside of me just for these two. I find that the silent couples are the most interesting. The youngest officer in the bunch does not  get any development, but this was fine with me as I saw his group as the least interesting and most annoying. I also won't have to actually have to judge the whole twins headache either.\\n\\n\r\nConclusion: \\n\\n\r\nThis show provided a vent for me after watching so many horrible harem endings and other frustrating relationships. While there was not a lot of plot to offer, it was satisfying and fit in well. I would say that this is a watch for those looking for a stress free romance without the drama. If I was to ruthlessly judge this show I would give it a 7, yet sometimes it is nice to go easy on things; I'm handing it a Very Good out of 10.",
            "date": "2010-12-31T01:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 33245,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=33245"
        },
        {
            "content": "I'll start with the Overall Enjoyment- and no matter what I did enjoy this anime and give it a 9 for that. This anime itself has elements of different anime, and it starts off like many others, but is able to take on its own within the 13 episodes. The manga itself is good as well.\r\nThe story/plot again seems to be a mix of anime story lines but makes it unique and adds mystery for its main heroine. While it does seem a bit cliche to have half \"spirits\" working along side humans to defeat rouge spirits, it does introduce a specific time, Westernization inJapan, an interesting time that did help the story along, and helps provide back stories and current issues for the characters.  Of course as the story progresses we start seeing the changes in the character's relationships and in themselves. Also we start to see the true villains appear and their purpose.\\n\\n\r\nArt gets an 8. I myself enjoyed the artwork. Cherry Blossoms, an obvious yet still beautiful symbol in Japanese culture and in anime graced this series. In fact the main female characters use them for fighting throughout the series. The different scenes were beautiful, from the lotus flowers, the water, the moon, just every detail. The characters were cute and charming and the fighting scenes were nice to watch. \\n\\n\r\nSound was a 9 because within the anime the female heroines sang when they fought. This is seen in the very first episode. It is a haunting melody and very catchy. The series had one opening, it reminded me of DDR but it was so hyped and fun to listen to. The ending had 3 songs introduced, and changed up every other episode. I loved them all. Simple. They were romantic, soothing, and great ways to end the episodes.\\n\\n\r\nThe Characters received an 8 from me. I do see some similarities with other anime characters and do find it a bit un-original with them being \"half-spirits\" but again this element is used to create something original. Again I found them- beautiful. I found their relations with the humans, especially with the soldiers and their bonds growing. I did find the main villain to be not as villain as I thought, rather suspecting of who it was.  When all was revealed I feared a bit of incest but moving on from that I don't think it's too much to worry about. Again the series characters were charming and adoring.",
            "date": "2012-12-29T12:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 81848,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1217679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Heta-rashi1",
                "username": "Heta-rashi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=81848"
        },
        {
            "content": "It's near--scratch that. It's impossible to make something without a base stereotype. It's how it's executed and developed that makes it more than a simple cliche. I can't say that Otome Youkai Zakuro does a lot of this. \r\nPlot:\r\nWhile the plot was okay the build up was done pretty decently considering how long it was. The plot wasn't very unique, but had those nice little breaks from the flow with humor or a little background story on the characters, helping you to avoid that suffocated feeling that comes from a short anime. \r\nCharacters and Romance: \r\nWhile Otome Youkai Zakuro makes its attempts and sometimes succeeds,I found Zakuro's 'kindness' to be quite boring and a little irritating in her sudden character shift. It wasn't that she was suddenly kind, or that she was mean before. It just made her character a little flat. In an attempt to be objective, I have to say that while Zakuro isn't a bad character, she's not insanely unique either. It's more like an attempt to make a unique character gone wrong. \\n\\n\r\nAgemaki, although a flawed character, ended up coming to save the day every time, or ended up being saved by Zakuro. He wasn't very memorable for me, to be honest.\\n\\n\r\nSusukihotaru and Riken ended up being my favorite pairing and the twins surprisingly didn't really irritated me (although their little side story and telling of it was so stereotypical I just sort of stared there wondering what happened).\\n\\n\r\nIn the end my favorite character was--Kushimatsu. The elder of all the spirits who live with her. She was strong and worrisome, frequently scolding Zakuro in attempt to help protect her. \\n\\n\r\nThe romance was quite weak, although I liked how they focused on the other characters. Bonbori and Hozuki's romance with Ganryu pretty much felt like it was thrown together and sewn by a five year old.\\n\\n\r\nZakuro's romance was teased and finally thrown just as half-heartedly together at the end after the battle.\\n\\n\r\nI'm trying not to be biased when I say this, but I probably enjoyed this shipping the most because of how it was executed, Susukihotaru's and Riken's romance was probably done the best. There were sweet bits every once in a while, but also those parts when you just know that these two are supposed to be together. Susukihotaru, although occasionally rescued, did a fine job of trying to stand on her own and caring for Riken in her own way. Riken is very stoic and chivalrous and cares for Susukihotaru in a very considerate manner. They are incredibly adorable with how shy she can get (without being tsundere) and how he tries to understand his own feelings.\\n\\n\r\nSound:\\n\\n\r\nI loved the soundtrack and have it on my iPod. there was so much effort and it was so... family-like, I guess. All the seiyuus (main) had a part and sang in the opening and ending theme and it was nice to listen to with an almost traditional and 1950's feel. They were catchy and light--just like this anime.\\n\\n\r\nWhile I wasn't that fond of the background music (more specifically the battle music) and much of it sounded quite similar, I like the slow little tunes that would pop up during the 'break times'. \\n\\n\r\nAll the seiyuus were chosen correctly and did an excellent job as always. Especially since there was Kana Hanazawa (Susukihotaru) and Sakurai Takahiro (voicing Kei Agemaki) who are veteran voice actors.\\n\\n\r\nArt:\\n\\n\r\nWhat originally attracted me to this anime. The art was pretty. I fell for it. It's like a horrible trap--except this wasn't that horrible. The animation was done well and, actually, quite creatively. \\n\\n\r\nEither way, despite any flaws this anime had--I was still pushed to continue this series and managed to even though I nearly never finish any. It simply sucked me in.",
            "date": "2011-10-17T16:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 45727,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/748925.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Harmoniche",
                "username": "Harmoniche"
            },
            "url": "https://myanimelist.net/reviews.php?id=45727"
        },
        {
            "content": "In the beginning I was really irritated about this Anime because of the time which it plays. Stories, which plays in the beginning of 20th Century are rar and with fantasy and demons too.\r\nI found the first episode not really good but the art looked very well and I don't wanted to give up so I watched more and I was really surprised. After I get into the story and adjust this whole anime, it was surprisingly good. At first the episodes are completed but after a while there was more tension and action and a red line. \r\nHere are my conrete marking:\r\nBecause of theslow beginning only 7 points for story. \\n\r\nThe art is really great and with fine animation so 9. \\n\r\nThe sound is also really clear and the voices are very convenient to the characters.\\n\r\nThe characters are all very typical and not something new. This was a little bit sad but they are straight in their actions. Anyway I liked them but for less creativity only 5.\\n\r\nIt makes fun to watch it but it wasn't at first so only 7 for enjoyment.\\n\r\nIn the end I give for this Anime seven points, it's refreshing but not something with much standard.\\n",
            "date": "2016-03-19T14:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 213356,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2175737.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ahoiibrause",
                "username": "Ahoiibrause"
            },
            "url": "https://myanimelist.net/reviews.php?id=213356"
        },
        {
            "content": "Amazing. That's a good word for this anime. When I first watched it I laughed a lot. And as the story continued I was laughing sometimes and then almost crying the next. You know when something dramatic happens and your heart just kinda seizes up? Well I felt it a lot. The plot just moves smoothly throughout the show and it all comes together perfectly at the end. I was hooked right from the start.\r\nAnd the CHARACTERS!! They were drawn so well and the ears are just adorable! The pairings were so perfectly matched. So when you are reading this and deciding whether to watchit or not.. Just do it. You wont regret it. :)\\n\\n\r\n~~And this was my first review so sorry if its kinda bad~~",
            "date": "2010-12-28T20:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 33166,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/357176.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SummerStar1234",
                "username": "SummerStar1234"
            },
            "url": "https://myanimelist.net/reviews.php?id=33166"
        },
        {
            "content": "For those of you who don't feel like reading through an entire review just to get my overall, general thoughts of this anime, I'll go ahead and say this: It was good, but nothing special. Honestly, more than a few times, I found myself thinking, \"I'd rather be watching Inuyasha\". Now, that isn't to say I didn't enjoy my watch-through of this anime, but again, it didn't stand out in any significant way to me; the humor earned a few giggles here and there, my eyes got mildly watery at just a couple of points in the story, and although I was looking forward toseeing the relationships between the main characters blossom, I never found myself getting super hyped up over any one moment. This anime was a fun way to pass the time, but if you're looking for something to really get invested in that has a unique storyline, characters, art, or music, you may want to bypass this show. If you're looking for a short, decent romance anime to pass the time, I'd recommend Otome Youkai Zakuro! Now to go into specifics for those who are still on the fence. Of course, these are just my personal thoughts and opinions, and I'm sure there are others out there who will appreciate this anime much more than I did!\\n\\n\r\nStory: 6\\n\r\nThe story followed an extremely basic formula to me, on multiple levels. Firstly, although there are several romances budding over the course of the show, each of them are founded on typical stereotypes and cliches of the genre, such as tsundere type development or misunderstand feelings. You know, the good ol' stuff. I will admit that there were a few times that I was surprised at the direction the story *seemed* to be taking, but it was like each major plot point was an after-thought in getting the story where the creators wanted it to end up. I'm hesitant to go into detail for those of you who are genuinely interested in a watch-through, but I do want to say that some of the more prominent plot points appeared forced and ultimately of little significance to the overall story (which can honestly be said for some of the characters as well). I suppose some aspects of the story just seemed rushed, but I don't hold that too heavily against it, as I haven't read the manga and can't speak on if the pace of the anime adaption was solely due to something like time constraint or budget restrictions. All of that being said, despite the progression of the tale seeming a bit off and it being nothing out of the ordinary, by romance standards it is a solid story that offers its fair share of sappy moments (and having come for that, it was pretty enjoyable). \\n\\n\r\nArt: 7\\n\r\nAgain, nothing special, but definitely crisp and appealing. My biggest complaint was the frequent (and noticeable, in my opinion) re-use of animation in certain scenes. What made it a little less tolerable was that the bad habit got even more common toward the end, making it difficult for me to take some of the later climactic scenes as seriously as I would have liked to. This is just a pet-peeve of mine, but even so, it wasn't unbearable. I was still able to enjoy the art and the events that were unfolding throughout the series despite that apparent laziness in animation; all in all, the art was one of the highlights of the show, as it remained consistently well done. \\n\\n\r\nSound: 6.5\\n\r\nThe opening was one of my favorite parts about the show, not because it was anything out of the ordinary but because it still did a good job of hyping up the show, which I believe is the most important thing for an intro to do, whether it have the goal of making people feel mellow, restless, pumped up, etc--as long as it represents the anime and gets the viewer invested in some way, I think it's fulfilled its purpose. Moon Signal definitely did that for Otome Youkai Zakuro. The endings were also very enjoyable, and I liked the way they didn't seem to play in a specific order so you never knew which of the three you would be hearing once the episode came to an end. For a short anime with only one intro, it was a nice touch. Now, the actual soundtrack during the show was what I found to be a bit lackluster. There were not many choices in the melody or sound effects you could expect to hear, but the ones that were present were at least decent. I don't necessarily have any complain except for the lack of variety! Overall, the sound was solid!\\n\\n\r\nCharacters: 6.5\\n\r\nThe characters were about as basic as the story, but likewise, it was enjoyable to follow their development and personal plots. Most of the cast is rather one-dimensional, and even the individuals who aren't don't have extreme complexity or depth to their profiles; however, each of the main characters fulfill their roles well and are at least somewhat interesting/entertaining in their own ways. I honestly don't have too much to say about them, bad or good, except for that they are pleasant to follow despite abiding by the same stereotypes and cliches of the story. \\n\\n\r\nEnjoyment: 6.5\\n\r\nI know I have used the rating of 6.5 a lot, but to me, that just reflects how I felt about this anime overall. I got enjoyment out of it by watching it one time through, but I don't see myself coming back to it because once the end is reached, it doesn't seem to me like the kind of series that was still have enough substance for me to watch it back over. \\n\\n\r\nOverall: 6.5\\n\r\nTo sum things up, did I like Otome Youkai Zakuro? For sure. Do I think it's anything special? As you've probably gotten by now, no. I believe it had a lot of promise that it never really added up to, but at the same time, the series got its point across well enough for me to have fun watching it. I would definitely recommend it for anyone looking to relax with a solid romance anime that delivers what it should (although not much more), but if you're looking for something more that has a similar story archetype, well... Inuyasha is still where it's at!",
            "date": "2018-07-30T14:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 285180,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5803118.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SincerelyShania",
                "username": "SincerelyShania"
            },
            "url": "https://myanimelist.net/reviews.php?id=285180"
        },
        {
            "content": "I personally loved the anime itself. There was really nice character development despite the fact that there wasn't much time since there was a lot of action and such in only 13 episodes. During the moments where characters were just together having a brief conversation, I felt that the story had reached a mountain.  It had built up to the peak then, began its descent.  In a way, it is rather childish since they all seem rather 'love-inexperienced' and watching them try to convey their feelings toward one another is rather funny.  I have a feeling that they might make a season2 since they left pleny of room for one at the end of the last episode.  Like most short animes like this one, the ending seemed a bit too fast and could maybe use more development.  Kind of like it reached up to where it should start winding down, then it fell.  Watching it once it reached that point made me feel like I was falling since it all went by so quickly.  Despite the fact that it was fast, the plot wrap-up in the end and the change in mood were very good.  The opening theme is a good fire-starter since it gets you in to the anime. After a while, you get fully engaged just after that one spark (that's how it was for me at least).  Overall, its a wonderful anime.",
            "date": "2010-12-28T20:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 33165,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/424091.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sakurax98",
                "username": "sakurax98"
            },
            "url": "https://myanimelist.net/reviews.php?id=33165"
        },
        {
            "content": "This is one of those animes that I watched all the way through, just because of the amount of potential it had. I kept wanting it to dish out more, but sadly it never delivered. \r\nStory 6/10\r\nThe story was decent but didn't seem like the main focus of the show, plus it was as predictable as it got. It seemed like the romances and relations between characters was the main focus, but even then the show didn't show any real progression until around the end of the anime, which left me wanting more. \r\nArt 8/10\r\nI found this anime to be beautiful, the art fit mytastes perfectly, with a wide range of color, and detailed shading on characters. It was truly eye candy and was the main attraction of the show for me.\\n\\n\r\nCharacters 7/10\\n\\n\r\nAll the characters were well made, just not well developed. You didn't see any real change from start to finish, other than some minor stuff. I felt myself wanting more background of each character, which is why I believe there should be some specials or even another season. It did dip into their pasts a little, but it really just left you wanting more. \\n\\n\r\nThe relations between the characters were very sweet, although setup in a ridiculous manner, the whole Spirit Affairs Division seemed like a matchmaking group.\\n\\n\r\nEnjoyment 7/10\\n\\n\r\nAlthough it seemed pretty messy, I found my self not able to stop watching. It was still enjoyable regardless of a large amount of flaws, and I do recommend watching it.\\n\\n\r\nOverall 7/10\\n\\n\r\nThis was my first review, and at the start it was a lot longer, but it felt more like a rant than a review. So, I revised it quite a bit, to the point of rewriting, but I hope this is helpful.",
            "date": "2012-12-24T02:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 81128,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1486631.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/deagosane",
                "username": "deagosane"
            },
            "url": "https://myanimelist.net/reviews.php?id=81128"
        },
        {
            "content": "K, my first review goes to this, because i think i'm SO against the other reviews i need to say why.\r\nArt and sound i usually don't rate (so i give it a solid 7) unless it's so good (or so bad) that it deserves a higher/lower one.\r\nStory:\r\nI'm usually more to the lower-counts, when it goes to tell a story, but this was just shortend beyond imagination. A struggle between demons, halfdemons and humans in that aera sounds promising, even if it's in a romance enviroment. Not that i don't like such anime from time to time.\r\nAt start there comes a lighting-demon and you learn, theydo not kill them, they  put them to sleep and afterwards the demon is nice. Why did it become angry at all? No answer.\\n\\n\r\nThen the episode with Kai's father. Ok, Kai is afraid of ghosts, we learn that is because he saw a ghost when he was little? And his Father says \"don't be afraid of ghosts\" and slaps him? Just normal, get over it after ~10 years maybe?\\n\\n\r\nBackground-stories for the background chars were ..let me say under any bridge, but more on that in the Char-section.\\n\\n\r\nChars:  Ugh, were to start.\\n\r\nKai: get's kicked over and over and don't even mans up a tiny bit untill the last 20 seconds of the show.\\n\r\nZakuro: again ugh, to make tsundere is fun, but it needs to stop at one moment. I mean, she got the stick up her ***** out sometimes, not in the final.\\n\r\nOther girls and other boys: They get along from the very start, there is ABSOLUTELY no envolvment, you just know what is going together (not that it is explained).\\n\r\nAnother \"Fun\":  The \"bad\" guys.\\n\r\nAlmost no backstory (ok, the brother wants to *bleep* his sister. Oh really?\\n\r\nThe other one is the spider, who loves the brother but get's rejected and is starting a fight (the endfight)\\n\r\nPlease, have i seen too many animes to see this?\\n\\n\r\nOverall:\\n\r\nStory: Good intention perhaps, but very poor.\\n\r\nChars: 1-dimensional, even the mains were just as in the intro.\\n",
            "date": "2015-02-17T04:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 180608,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4424505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rohling",
                "username": "Rohling"
            },
            "url": "https://myanimelist.net/reviews.php?id=180608"
        },
        {
            "content": "If you want a quick short but a bit depressing, demon fighting goreish anime, with a bit of humor and romance this is your anime! \r\nThis was a lot better than I thought it would be, and I finished it pretty quickly. The art is really great to look at and the plot drew me in fairly quickly. It's a lot sadder than it would seem to be, but the ending is does not leaving you completely hanging like a lot of anime does out there, even if it is short.\r\nSome might claim it reminds them of InuYasha, and as much as I like thatanime, they are aren't very much alike. Sure the lead is half demon/spirit but she is has  a toughness to her I really like (and that's hard to find in anime girls). Instead of the males being the stronger ones, the girls in this anime are the ones who protect them the most, and I have to give props for that.\\n\\n\r\nMy favoirte thing about this anime is the light romance (the shyness of it), how much the characters grow(Deeper than one would expect) (even though the humans seem meh at first), the goreish fighting, and the bit of humor that does show up. The plot twists do help too (though I can't say what!)\\n\\n\r\n I am a fan of multipile types of anime, normally (action, romance, gore, ect) and this anime fits in perfectly! \\n\\n\r\nAlthough an ending is better than hanging, this anime could have been longer with added arcs (that is if you're a fan of long animes like myself)\\n\\n\r\nAll in all, it's worth watching! :)\\n\\n",
            "date": "2012-10-31T12:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 76351,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1709295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pinkbun17",
                "username": "pinkbun17"
            },
            "url": "https://myanimelist.net/reviews.php?id=76351"
        },
        {
            "content": "Story -  In Japan’s Meiji Era of Westernization, humans and half spirits have come together to live amongst each other. Naturally, everything isn’t so peaceful and tons of issues arise. That’s when the military decides to create the Ministry of Spirit Affairs. Each half-spirit is assigned to a human soldier and that is how we meet the powerful half fox-spirit, Zakuro and her partner Agemaki. Her friends Susukihotaru, Bonbori, Hozuki, Riken, and Ganryuu help her and the Ministry resolve issues and bring peace to conflicts. However, Zakuro must face a mystery of her own; the truth of her mother’s death.\r\nCharacters - Definitely a highlightof this anime! Every character is filled with their own histories and distinct personalities.You have the tsundere Zakuro (not a very unique trait in anime, but still an interesting character), the cheerful twins Bonbori and Hozuki, the shy Susukihotaru, and the noble men of the military. Each of their backstories were so interesting to watch and added to everyone’s overall character development. Each pairing in Spirit Affairs also complimented each other so well and were a perfect match. The cast did so well in portraying these characters and brought them to life.\\n\\n\\n\r\nAnimation/Art- The one thing that I love about the shoujo genre is that there are so many great artists providing gorgeous characters and sceneries. From the attire in this anime, to the character designs, the art is another high point. My favorites, though, were Bonbori and Hozuki’s hair and outfits because they were so detailed and intricate. It was fun watching them on screen. Vibrant colors and smooth animation grabs your attention instantly. During the ending song animations, artwork from the actual manga were incorporated and I must admit it was breathtaking. It made me want to begin the manga and I actually did! The art is much more sensual and has such an elegant feel to it. It’s lovely.\\n\\n\r\nSound - The soundtrack backing this anime suited the show very well. A wide variety of song types fill this anime. There are fast-paced happy songs, eerie mysterious ones, as well as sad sentimental ones. They also did one of my favorite things any anime could do…have multiple ending sequences. I usually skip the ending song for any anime that I watch, but I find that I stick around when the songs are different each episode. It adds variety and makes you look forward to hearing what song is going to be used next. There were three ending songs for this anime and they were all excellent. They fit the episode they closed after appropriately and were also quite catchy. My favorite of the three was “Futari Shizuka”, a duet featuring the voice actress of Susukihotaru and Riken. It’s  simply a beautiful song, with enchanting vocals and violins.\\n\\n\\n\r\nPros - One quality about this anime that I enjoyed was that its romance was not too unrealistic or overly dramatic. Too many times have I stopped watching shows where the romance feels absolutely fake, so this was a refresher. The romance was subtle and warm-hearted. Made you want to say “awwwww”. All of the couples fit each other so well and it’s like you want them to be romantically involved.\\n\r\nAlso:\\n\\n\r\n    - Story wasn’t complicated and was very easy to follow.\\n\r\n   -  Illustrious fight scenes! Very cool to watch.\\n\r\n    - Loved how Zakuro’s weapon transformed from a sakura branch. Now that was awesome in my book.\\n\\n\\n\r\nCons - The main villian was part of a plot twist, but their power was hardly shown. Expected more of a showdown between the chacracters, but there was barely a fight, which was disappointing. It was another evil character, the Black Widow, that stole the limelight as far as villianry goes. She was much creepier and actually showed a lot of potential in harming someone.\\n\r\n    Also, the anime could be slow-paced at times, making a couple of scenes slightly boring. There weren’t too many of these instances, but there were enough for me to notice. It was as if we’re expecting something to happen and nothing does. Scenes could be drawn out to prolong the episode.\\n\\n\r\n——————————————————————————-\\n\r\nIn conclusion, Otome Youkai Zakuro wasn’t perfect, but it caught my attention. A short and sweet series that had potential for more material, but finished a little short. Really wished that more people watched this show because it is worth the watch! Loved the fact that there wasn’t an abundance of drama when it came to the romance. No open endings were left, making the ending satisfying and fulfilling. The issues the Ministry had to resolve were also actually pretty cool and hey I recognize some of those spirits! My love for Japanese Mythology and folklore just increased :3\\n\\n\r\nRating - 8/10",
            "date": "2014-02-27T05:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 134025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3583285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Deep_Drive",
                "username": "Deep_Drive"
            },
            "url": "https://myanimelist.net/reviews.php?id=134025"
        },
        {
            "content": "Story:\r\nI don't know why no one mentioned this about the story; I found the story more appropriate for hentai genre (Although there were no inappropriate scenes) but the story itself revolve around a sick guy who tried to make his mother bear his child but she refused him then goes around trying to kidnap his half-sister (sister from his mother) to make her his wife.\r\nSound:\r\nI think the songs they used were very good; I even thought about having one of the songs as a ringtone for my mobile phone (I am still planning to but I'm just too lazy to do it)",
            "date": "2017-08-12T06:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 255256,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RED_SCORPION",
                "username": "RED_SCORPION"
            },
            "url": "https://myanimelist.net/reviews.php?id=255256"
        }
    ],
    [
        {
            "content": "Cliches, stereotypes, formulas, and other such mass production \"tools\" that are involved in the creation of \"original\" anime are a common part of the industry these days. One only has to look at the shows released over the previous season, never mind the previous year, to see just how many titles are nothing more than variations on a given theme.\r\nThat doesn't mean that they're all bad though. While an anime may be burdened with cliches, have a fomulaic plot and/or stereotypical characters, if these are used in an intelligent and innovative manner then it's possible to produce something decent at least. Sadly, many of showsmade this way (which unfortunately is the majority of anime these days), have more in common with the delusions of a hormone addled teenager (either male or female), than they do with quality entertainment.\\n\\n\r\nThanks heavens for small favours.\\n\\n\r\nOtome Youkai Zakuro is based on the ongoing historical fantasy manga of the same name by Hoshino Lily. The story is set in an alternate Japan during the Meiji era's period of Westernisation, where the Ministry of Spirit Affairs deals with the common and uncommon issues that arise in a multi-vital society (i.e. youkai and humans trying to live side by side).\\n\\n\r\nThe story is pretty decent for the most part, especially in terms of content, and there's a lot to keep the casual viewer watching the show. The plot is pitched at a specific audience though, and while it may flow quite well, although there are times when it's difficult to tell who that audience is. In addition to this, one can't help but think of Otome Youkai Zakuro as more than a little \"folkish\", and with good reason too as aside from the obvious allusions to Japanese folklore and mythology, there's actually a very subtle, and slightly bawdy, undercurrent to the show that seems to have bypassed just about everybody.\\n\\n\r\nConfused? Well, it's not that obvious as it has to do with soldiers, maidens, garter-belts and folk songs. Three soldiers are sent to join the Ministry of Spirit Affairs where they are to partner young half-youkai ladies (complete with animal ears), who are supposed to represent the yamato nadeshiko, but carry branches with pomegranate blossoms inside other spirits or their garter belts like they're some kind of hidden weapon.\\n\\n\r\nSeriously, if I showed that sentence to anyone interested in traditional ribaldry or the more coarse side of folk music they'd first applaud the subtlety, then laugh themselves silly.\\n\\n\r\nBut I digress. The fact is that Hoshino Lily managed to insert some very sly inferences directly into the plot without anybody realising it, which should bode well for the series ... if it wasn't for one thing that is. While the story may be decent enough, certain key plot events can feel staged because the viewer is able to predict not only what is going to happen, but the outcome as well. This is one of the dangers of relying too heavily on cliches, stereotypes and formulas, as there is an inherent repetitiveness that arises from using these \"tools\".\\n\\n\r\nAnd boy, does this show use them.\\n\\n\r\nOtome Youkai Zakuro is one of those shows that looks as though it was made while someone was checking boxes in a \"moe: how to ...\" handbook. One look at the series and it's clear that while this may be labelled a seinen show (with some rather obvious shoujo influences), the target audience is mainly those who like \"cute\" young girls with animal ears.\\n\\n\r\nThe \"human\" characters have been made to look as attractive as possible, even when they're being evil, and there's a certain generic quality to the design principle that can sometimes make the viewer wonder if they've seen the character before (I'm pretty sure I saw the elephant guy in India). The settings are nicely detailed, but while they're well suited to the time period, they seem a bit too clinical and sanitised. Everything and everyone are too clean and too \"nice\", even when bad things are happening, and this can sometimes make it difficult to take the show seriously. The colour scheme also compounds the \"nice\" atmosphere, and Otome Youkai Zakuro is literally awash with \"cute\" pinks, blues, greens, yellows, etc.\\n\\n\r\nOn the plus side, the animation is pretty good, with flowing character movements  and some rather nice action set pieces. The problem  is that the shadow of repetition raises its head once more. There are a few scenes that, aside from the backgrounds, are simply the same routine repeated over and over again (the most common one being Zakuro's transformation into \"Mega-Zakuro\" - which basically means she has a knife instead of a stick and her pupils change shape). Fortunately this doesn't really impede on one's enjoyment of the series, but it does make one wonder why more effort hasn't gone into the animation production, and also why a respected studio like J.C. Staff decided to cut some very obvious corners.\\n\\n\r\nThankfully the acting is a definite step in the right direction, although it has to be said that some of the roles didn't really require anything special. Nakahara Mai is an enormously talented actress and has some surprising lead roles under her belt (Furukawa Nagisa from Clannad, Ryuuguu Rena from Higurashi, etc), but while she gives a decent performance in her role as Zakuro, she is ultimately limited by some mediocre scripting. The same is true for Sakurai Takahiro (who plays Agemaki Kei), and the rest of the cast, and while all of the sieyuu clearly have a great deal of ability, there are times when it feels like their skills aren't being fully utilised.\\n\\n\r\nOn a different note, aside from some strange choices with the incidental music, the soundtrack is functional, but that's about the best one can say about it. There are some small issues with timing, and more importantly relevance, but these can be viewed as minor niggles that are quickly forgotten. The big issues are the opening theme and the three ending themes. The OP is well animated, but the timing is all over the place, and to further compound matters Moon Signal by Sphere doesn't fit in with the look, storyline, or atmosphere of the whole show. The song feels completely out of place, but that's just the tip of the iceberg.\\n\\n\r\nAll of the EDs are sung by the seiyuu whose roles are partnered in the anime (for example, Nakahara Mai and Sakurai Takahiro sing the first one together), which is nice, and could have worked well as an additional reinforcement of the bond between the soldiers and the youkai maidens. Unfortunately it seems as though somebody has overestimated their musical ability (I look pointedly at you Sugimoto Masaru), as the first two EDs, Hatsukoi wa Zakuro-iro and Junjou Masquerade, are stereotypical efforts that don't work with the ending sequence's imagery, nor the main storyline itself. Strangely, the third ED, Futari Shizuka, is more in keeping with the feel of the show, so it's obvious that although somebody was paying attention, it wasn't enough or they were sinply overruled by the producers.\\n\\n\r\nNow while it may be true that the scripting wasn't up to spec, that doesn't mean that the characters were poorly envisioned. Granted there is a degree of formula to their personas (Zakuro being a tsundere is one example of this), and a number of cliches are on display with their development, but as a rule the characters aren't that bad. Each is able to grow because of their \"partnership\", and while there is a certain method and measure to this, the evolution of the characters is treated with a degree of diffidence that somewhat belies the open targeting of the moe market.\\n\\n\r\nUnfortunately, the developmental method is a bit too formulaic at times, and because of this the viewer can feel like certain obvious events are being force fed to them in an effort to elicit some sort of empathy. That said, the characters are charming in their own ways, and while they may appeal to a specific fan base, that doesn't mean that others won't find them interesting, or even cute.\\n\\n\r\nI will admit that Otome Youkai Zakuro surprised me, as while it's definitely cliched and formulaic, it's also pretty enjoyable in a charming, quirky sort of way. Yes, the story is predictable, but rather than make the characters completely stereotypical there has been some effort to give them a degree of individuality (which is one of the reasons why the poor scripting is so noticeable). The design may be aimed at the moe markets, but within that saccharine sweet exterior lies a story that tries to mix several genres to produce something ... at least a little different.\\n\\n\r\nUltimately though, this is yet another example of the anime industry wasting the opportunity to produce something above average. It's a decent show, but it had the potential to be so much better than it is if the producers and director had tried that little bit harder to ditch the fomrulaic approach.\\n",
            "date": "2010-12-30T12:12:00+00:00",
            "helpful_count": 223,
            "mal_id": 33212,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=33212"
        },
        {
            "content": "Ever hear of the saying \"try something new\", well I'm glad I did.  At the beginning of the season I wasn't expecting much from Otome Youkai Zakuro but boy did this series surprise me.Otome Youkai Zakuro is produced by J.C. Staff and the reason I wasn't expecting much from it was because they were already producing 2 other more hyped anime this season.  However I think this might be the best one out of the three they put out this season.\r\nThe series takes place in the Meiji Era (which is anywhere between 1868 and 1912).  During this time 3 Soldiers are sentto the Spirit Affairs where they work with half spirits to resolve the issues between spirits and humans.  But as they continue with their jobs a greater problem presents itself which is deeply related to Zakuro's past.  As the story continues to unfold Zakuro's problem grows bigger and the Spirit Affairs are forced to resolve it.\\n\\n\r\nOtome Youkai Zakuro gave me a pleasent surprise because every episode was significant and contributed to the story.  The story was well paced which a lot of anime series fail to do these days.  A lot of new series I watch these days tend to leave off all plot until the final episodes which makes the series seem rushed.  However Otome Youkai Zakuro advances the plot more with every episode that goes by which doesn't make the ending or any part of the series seemed rushed whatsoever.  The actual plot was actually really well written and not overly complicated.  The problem with a number of series these days is they try to be so creative that it just over complicates things.  Otome Youkai Zakuro didn't try for too much which is why the story flowed so well.  The plot of the series seemed pretty simple and straight forward and as it unfolds it becomes something beautiful.  Also unlike a number of series out there,  Otome Youkai Zakuro actually has a proper ending instead of leaving the series up in the air.\\n\\n\r\nThe art and animation were beautiful.  The animation was pretty smooth and the art was just astounding.  The backgrounds had a lot of detail and it always caught my attention.  Art isn't really something I usually pay attention to but this was so beautiful that it managed to catch my attention and enhanced the beauty of the series.\\n\\n\r\nThe sound is also really well done.  The opening was really good and one of the first openings which I actually remembered the rhythm to. The alternating endings were always a treat and well done too.  I often found myself listening to the full ending which is something considering I'm a guy that likes to skip endings.\\n\\n\r\nThe problem with tsunderes today is that anime series like to overdo it.  Characters these days are so overly tsundere that they just seem unrealistic.  However Zakuro is different, although she is a tsundere she isn't overly done, she can admit when she's wrong. This is what I like about Zakuro, her personality is not over-done which makes her feel so real.\\n\\n\r\nOur main protagonist Kei Agemaki is alright too.  He starts off really afraid of spirits but as the series continues he fights his fears and by the end he has completely no fear of spirits.  He also has other flaws too but that's what makes him a good character.  Some anime these days have protagonists who are perfect in every way shape and form which isn't good because they don't develop.  \\n\\n\r\nThere is also romance between Zakuro and Kei and what makes it good is that they both have flaws and that they both help the other with it. The romance just wouldn't be the same if the other did not have flaws.\\n\\n\r\nThe other characters also help this series too.  The romance between Riken and Susukihatarou is really interesting.  A lot of other series don't usually have romances between other characters which don't usually get you to think about them.  However since this series had every character develop relationships, you never really forget any of them.  \\n\\n\r\nThere's nothing really bad to say about Otome Youkai Zakuro.  I often found the episodes to be short and it never bored me.  Everything about this series was great because it didn't try for too much and it didn't exaggerate things. It seems that a lot of anime series today are really poorly paced with lackluster plots because they focus too much on side stories of characters. Otome Youkai Zakuro just shows that with a well written and well paced plot, everything else will just fall into place.\\n\\n\\n\\n\\n\\n",
            "date": "2010-12-28T09:54:00+00:00",
            "helpful_count": 110,
            "mal_id": 33152,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=33152"
        },
        {
            "content": "Otome Youkai Zakuro promised a unique plot from the very beginning, and it's only getting better and better. Backed by great character developement, voice acting, and artwork, this anime is sure to keep everyone hooked.\r\nI like everything about this ainme, and haven't really found anything to dislike. I expect it to get even better as it continues, and I'd definently suggest it to everyone!",
            "date": "2010-11-22T15:31:00+00:00",
            "helpful_count": 44,
            "mal_id": 32247,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400119.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Johnforester15",
                "username": "Johnforester15"
            },
            "url": "https://myanimelist.net/reviews.php?id=32247"
        },
        {
            "content": "Do not be deceived by the \"seinen\" genre, 'Otome Youkai Zakuro' ('Girl Demon Zakuro') has everything that makes it a shoujo anime.\r\nThe story is centered around newly formed Ministry of Spirit Affairs where Zakuro, along with other half-demon operatives and militants settle youkai-related problems around the city. Zakuro has a mysterious background, and slowly learns her own dark past through encounter with various antagonists. Hmm... the plot synopsis and setting sure sound like shounen. However, the story, character, and animation have such strong resemblance to typical shoujo material that it's hard to claim this is targeted toward the male demographics.\r\nStory:\r\nThe story is set in 19thcentury alternate Japan, where Westernization had just begun. It actually looks like colonization because the army consists entirely of rich Caucasian-looking guys while half-demons and civilians are dressed in traditional Japanese attire, but it is not clear exactly how the government functions or how the civilians are reacting toward Westernization. This show is certainly not about politics or realism, and that's just fine. The central theme of 'Otome Youkai Zakuro' is romance. Members of Ministry of Spirit Affairs are separated into 3 pairs (I'm going to count the twins as one), and basically they instantly fall in love and overcome numerous romantic predicaments, forming stronger bond after each incident. The romance really kicks in through mid-latter part of the show. Now, most shoujo series are about romance, but that doesn't automatically make it one. What does make this a shoujo series is that the girls keep ending up in the arms of princes through most improbable circumstances, and the fact that 90% of the time it was the girl whose heart \"skips a beat\" after a guy spews out an incredibly corny line. Another major theme of this show is coexistence of youkai (demons) and human beings. This is also set up so that it's the girl who's in the receiving end of the discrimination, and the prince comes to the rescue.\\n\\n\r\nThe story does have a very good flow, as we learn more about Zakuro's past in every episode, which piques our interest for new episodes without apparent cliffhangers. On the other hand, there are so many plot holes with the setting and turn of events that completely defies logic. The worst facepalm moment occurred when our heroes trapped in a cellar were struggling to keep the door closed because they'll get flooded if those doors break down. Such an unlikely circumstance, not to mention why would anyone trap someone in a place with such fragile doors? I can still somehow tolerate that, but then the heroines \"save\" them by smashing open the very door the prisoners were trying to keep closed... What?! And they didn't rip off their arms by keeping them from drowning? Water flow didn't even seem to be serious enough to drown... I give up.\\n\\n\r\nCharacter:\\n\r\nZakuro is by far the strongest operative in Ministry of Spirit Affairs, but being a shoujo anime that it is, she's mentally weak and constantly requires the big, tough prince to protect her, even though Agemaki is very weak and thus never putting up a real fight (he just offers moral support).\\n\r\nSusukihotaru is a typical fragile chick who needs protection, and he gets it from the strongest and honorable human warrior Riken. \\n\r\nGanryuu is a shoujo-equivalent of a loli, and gets the twins Bonbori and Houzuki to constantly pamper him. \\n\\n\r\nI have to admit the characters did have very good backgrounds that made them interesting and contributed to the story, but this setup makes the show predictable as hell. \\n\\n\r\nThe character abilities also do not make a good shounen show, because men are completely hopeless, and all girls other than Zakuro are nearly equally useless in battle, not even having any support ability other than singing (why does it even raise Zakuro's spirit level?). All their skills are for reconnaissance rather than actual fighting, and it's always Zakuro showing up and defeats the enemy in 1 hit to advance the plot.\\n\\n\r\nAnimation:\\n\r\nThe style is decidedly targeted toward, and typical of shoujo series. All the guys look so feminine that I was surprised there was no BL. A lot of flowers blooming to express emotion (obviously done as a joke, but still...). The demons are rather friendly looking, 'Inu Yasha' types, and very little gore or blood.\\n\r\nI personally hate this art style, but technically it was above average. Characters have high consistency in appearance, and detailed. Backgrounds set nice atmosphere, and it's usually clear sky or indoors with few objects, but detailed when it needs to be. Action sequences are short, but not as boring as it could've been.\\n\\n\r\nSound:\\n\r\nEveryone sounded like they should. Very emotional when needed to be.\\n\r\nBGM was pretty ordinary and did not play a crucial part in the show.\\n\r\nOP was somewhat catchy, but too intense for the mood of this series, and ED was outright horrible.\\n\\n\r\nEnjoyment:\\n\r\n'Otome Youkai Zakuro' is like a shoujo version of 'Inu Yasha'. It does have some shounen and seinen elements mixed in, but predominantly a shoujo anime. I have no idea what the author and producers were trying to do with this series. As it stands, it's a weird shoujo romance with demons, and unwatchable as a shounen/seinen adventure.\\n\\n\r\nNeedless to say, I'm not in the primary target demographics, but I found the story to be more engaging than most shoujo series I've seen before despite its flaws. The ending was quite satisfying and summed up all the mysteries of Zakuro's past. \\n",
            "date": "2010-12-30T10:20:00+00:00",
            "helpful_count": 24,
            "mal_id": 33210,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=33210"
        },
        {
            "content": "Note that this review is based on the first 2 episodes [ don't start screaming if u feel it's incomplete xD ] It also might contain some spoilers so be careful:\r\nOtome Youkai Zakuro ,an anime about youkai and humans trying to fight together and learn to accept each other....the story might not be unheard of,but I,for one,appreciate more the way a story unfolds than if it's totally new as plot,because what makes a story good is  the way characters interact and the ''pace'' of all the action.\r\nStory: For what i saw thus far, a not very slow but not very fast paced plot isunfolding.We get to know the main characters at an acceptable pace  [like ep 2 started with Zakuro,the main character].What's extremely good in this anime is the character interactions.The plot has alot of humor,and personally, i laughed half of the time or more all throughout the episode.It's also interesting the ''chanting'' of the youkai girls before a battle,i find it beautiful and ''bewitching'' as Zakuro herself says,and somehow seems to transmit a traditional japanese ghost folklore feeling.And from what i have read of the manga,it seemed to me like  the manga had less funny moments than the anime,which in this case i didn't enjoy much,because the humor was done very well. 9/10 thus far.\\n\\n\r\nArt: Very beautiful,energetic and fun [ those who say pink is gay have no reason to continue reading this section >.> thank you ] It is also very faithful to the manga art.My opinion is that there is nothing more to add here. 10/10\\n\\n\r\nSound: Until now,the sound also seems fitting to the feeling of the anime.It's half serious/half energetic [ talking about the opening song].The 2 ending songs are also ok. 9/10\\n\\n\r\nCharacter: hehe,one of the best parts of this anime.I think that until now i like all the characters very much.Zakuro might seem a typical tsundere style girl,but,we forgive her ...since she's still young and inexperienced in love ^^..plus she certainly has funny moments at some times , most of them when she interacts with Agemaki .\\n\r\nAgemaki Kei on the other hand i think is the true humor-producer in this story....his fear for youkai and his tendency to try and hide it by looking cool on the outside [most of the times] turns every situation into something very hilarious.Add to those reactions a voice actor good enough to take on such a role [ Sakurai Takahiro-sama] and u get the funniest and yet still most bishounen character in the series..[ gotta love Agemaki Kei ]\\n\r\nBonBori and Hoozuki are the deadly-twins..they are adorable [ as is Susukihotaru]...although they might act the same and u confuse them ,they actually complete each other [you will understand if you watch the anime]\\n\r\nSusukihotaru is the quiet sweet type...she's too adorable when she blushes...>.>\\n\r\nGanryuu is the little boy with the BIG attitude,yet he is also sweet,no wonder the 2 twins enjoy grabbing him and taking him everywhere with them[ he probably will hold a harem when he grows bigger..lmfao..]\\n\r\nRiken is the quiet type,yet he is very kind....hmm..the bigger brother image...a mature guy,also very nice character.\\n\r\nAnother funny character is Mamezou....him and Agemaki would make a great comedic duet [ they already do...rofl...]   10/10\\n\\n\r\nThis is what i feel thus far for this series,even though it's pretty early to conclude....but for now i think it's enough.",
            "date": "2010-10-11T13:46:00+00:00",
            "helpful_count": 16,
            "mal_id": 31285,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/115521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mel-hime",
                "username": "mel-hime"
            },
            "url": "https://myanimelist.net/reviews.php?id=31285"
        },
        {
            "content": "Story- The plot wasn't confusing at all. It wasn't cliche, and very original. It did have a few things that were predictable, but only a few. I think that this  was a very unique and different anime. The ended was surprisingly different then how I though it would end. There was only one thing I didn't like at the end.\r\nArt- The art really shined in this anime. The character and setting art was average, it was the fighting. The visuals were stunning during a fight scene. There were vivid colors and it flowed nicely. The cherry blossom petals that occasionally showed look beautiful. Theart in the opening rely captured the show. It showed the action part as you see Zakuro fighting, the cherry blossoms in the wind. The colors they used either represented the darkness of the show, with reds and blacks, or the lightness and love, the flowers and bright colors.\\n\\n\r\nSound- the music itself was slightly memorable. I like the opening theme song. It really captured the show. The voice acting was spot on; It really reflected the characters. There is no dub.\\n\\n\r\nCharacters- I think that some of the characters could have been given more dept, such as Riken and Susuki. Other than that I thought that each character was extremely either well presented or average.  Zakuro look at acted a lot like Hikari from Special A, I'm not getting over that.\\n\\n\r\nEnjoyment- I really loved this shoe. I love hoe original it was. The girls singing as the other kills a spirit, perfect. The powers they had, pure genus. The only problem I had was what I stated.",
            "date": "2015-03-02T09:01:00+00:00",
            "helpful_count": 14,
            "mal_id": 181539,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437397.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuPrincess010",
                "username": "OtakuPrincess010"
            },
            "url": "https://myanimelist.net/reviews.php?id=181539"
        },
        {
            "content": "If there is something that i learned over the years that i watched anime is that it doesn't matter what genre is the show , shounen , shoujo , seinen or jousei , if it has a good story i will watch it and with that in mind i tried Otome Youkai Zakuro . \r\nStory 7 \r\nIt wasn't the best story that is for sure , but it wasn't the worst either , it had ups and downs as all other animes . As some of you know cuz' you've read the plot line this anime is about 3 soldiers Agemaki ,Ganryuu and Riken ,who have been assinged to the Ministry of Spirit Affairs , there they met our other protagonists , in other words Zakuro , Bonbori , Hoozuki and Susukihotaru . From here on some of you will know how it will develop , romance between characters , drama and lets not forget about the action . \\n\r\nWhat made me give this anime a 7 for the story was the ending , i don't really like the whole concept of ' I am your enemy , but now that a stronger guy makes his appearance i will fight alongside you ' , that is a clear no , if you are the bad dude of the show stay that way till the end . \\n\r\nAll in all , the story could've been handled a lot better , but beggars can't be choosers . \\n\\n\\n\r\nCharacters 7\\n\\n\r\nLets see , here we have a wide range of them the tsundere Zakuro , the ' wuss ' Agemaki , the shy-able to read minds Susukihotaru , the stone faced Riken , the chearfull twins Bonbori and Hoozuki and the last child looking Ganryuu . Of course there are support characters but they do almost anything all the anime , in other words they are not important .\\n\r\nAs for the enemy we have another pair of twins that are weak as hell plus one of them is the avearange idiot who is envious of her older sister , the Black Widow who was supposed to be strong but was taken down in matter of seconds , twice i might add and lets not forget the ' party-changing ' main villan who only showed his true colours at the end of the anime . \\n\r\nIf it weren't for the so called bad guys of the show this part of the review would get a better grade . \\n\\n\\n\r\nSound 8 \\n\\n\r\nEven if the OST was not something that i am particularly attracted to in anime there are times when it stays with you even after you finished it . \\n\r\nI don't really know if the girls singing when they are fighting is called OST but , i found it really cute and catchy , for that sole reason i will give it an 8 . \\n\\n\r\nArt / Animation 9 \\n\\n\r\nHere we have a winner , if the story and characters were not something out of the ordanary , this made the anime a lot better . \\n\r\nIt is very shoujo-esque , but who cares ? The colours are lively and the art is surprisingly good .  The battles were well drawn , every other scene was well made , you could feel that this isn't a low budget show . \\n\\n\\n\r\nEnjoyment 8 \\n\\n\r\nEven if this anime is not the masterpiece we are all searching for , in the same degree this isn't the moe filled piece of garbage some are looking for either , yes as a matter of fact i forgot to add this : This anime has no panty shots , no se through clothes and other things that i don't really care for in my anime . \\n\r\nAnyway all i can say is that i enjoyed this anime to its fullest . \\n\\n\\n\r\nOverall 7.8 / 8 \\n\\n\r\nIn my book this is something that can be watched once when you have time and the mood to see some romance with a bit of action and singing mixed together . \\n\r\nNothing else to say here , thx for reading this .",
            "date": "2013-08-21T00:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 110629,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1354627.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AgelessPharaoh",
                "username": "AgelessPharaoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=110629"
        },
        {
            "content": "I didnt have high expectations for \"Otome Youkai Zakuro\" (eng. Spirit girl Zakuro), due to some recent let downs in the romance genre department (Yes, Wolf girl & Black prince, im looking at you). But I was happily suprised by this show, it wasnt a let down at all! Yes, at first glans it can look very stereotypical, but actually had its own style and some very none sterotypical character relationships. If you are in to romance animes which is not only character based and with some deeper subjects - well, then its definitley for you.\r\nStory: 8/10\r\nThe story isnt super deep or complicated, but surelyenough to keep your intrest. In historical setting we get to follow the half-youkai female cast cooperations with a western originated male cast to ease the realtionships between humans and youkais (spirits), in Japan. Its not a dance on roses to get humans and spirits to coexist, and we also gets some glimpses of the not always so smooth interaction of western values and things in Japanese culture (which the cast member discusses and argue about from time to time during the show). We get to follow several characters, but our main girl is Zakuro. The story mainly centers around her, even if it at first may seem like random events. Overall not a masterpiece, but shore something worth your time.\\n\\n\r\nArt: 8/10\\n\r\nNot outstanding in any way, but its really pretty. Both male and female cast are beautiful and should satisfy both the female and male audience.  Particulary I liked Zakuros character design, she could both look really pretty and like the strong spirit fox she is.There are some nice light settings as well. The thing that stood out is the scences with the cherry blossom trees and how the are used by the half-youkais to \"cleans spirits\". Its also very pretty. \\n\\n\r\nSound: 7/10\\n\r\nAbsolutly not the best I heard, but the music filled it purpose and did manage to highlight the mood of the scenes. The opening song was actually quite beautiful and poppig, and suited the show very well. The half-youkais hymm then cleansing spirits was ear candy. Vocie acting was also really good.\\n\\n\r\nCharacter: 8/10\\n\r\nLike i mentioned before, at first glans they look quite sterotypical, but most of them actually suprised me alot. They had their own peronalites that didnt fit some of the most common archetypes. Most suprising was Zakuro and Kei, who both was refreshing in this genre. Like in most short running shows, it was no major character developments. But they manage to put in enough to make the show more likable and intresting. Its actually three romances going on (ok, mayby three and a half), and all are unique in their own way. \\n\\n\r\nMy absolute favorite is Zakuro. She is a strong and compassioned girl, whom concile her own fear to not worry others. To see how she has to deal with both being half-human and half-youkai was impressive, and how she is handling things then her unknown past is starting to get to the surface. Zakuro is nobodys push over, thats for shore.\\n\\n\r\nKei, was probably the character whom suprised me the most. You may think he is fearless and strong, but are actually terrified of youkai and arent that great of fighting either (so he ends up being saved by Zakuro on regular basis). To see him deal with his fears (which he knows are a bit ridiculous) and become stronger for Zakuros sake, are nothing but adorable. \\n\\n\r\nAll of the other main and supporting cast was also very likable. Its was overall enjoyable to watch the different realtionships grow (both romanticly and other wise).\\n\\n\r\nEnjoyment: 9/10\\n\r\nI enjoyed it quite alot! I actually benk watched this one. Its was aslo a true a eye candy parade, which only made it more enjoyable for me.\\n\\n\r\nOverall: 8/10\\n\r\nA very good short running show. It did its job done in the short time it had, without feeling rushed. The romance was in all cases heart warming and enjoyable to watch. The romance wasnt the story, but more something that came together with the storyline of events. Definitley something I will remember.",
            "date": "2016-10-23T03:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 232417,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=232417"
        },
        {
            "content": "First Impression & Bias:\r\nSo what happens when you think your going to watch some shoujo with girls duking it out with twigs in pink yukatas with bishie males? Well naturally as a male I flinched a little bit. Yet, thankfully this show was heartwarming and very enjoyable from the start. This provided stress free entertainment, a pure romance that's main goal was to deliver. \r\nExpected: 6\r\nEpisode Scores: -,-,-,-,8,-,8,8,7,9,8,8,9,9\r\nActual: 8 (Very Good)\r\nThe premise is predictable and very bland to tell the truth. However, the plot is rather insignificant to the show as a whole. Why, this is because the focus is only on the relationships betweenthe couples, and to see that they progress smoothly. While they do squeeze a arc into the last few episodes, it is not just some crap pulled together at the last minute, but a carefully planned and meaningful one.\\n\r\nThree men are sent to the Spirit affairs, and are paired up with their work companion.The main couple of the show are your basic tsundere pair. Thankfully the characters don't enjoy giving you much of a headache so the act is dropped frequently enough that Zakuro never gets on your nerves, and actually becomes that strong yet gentle on the inside character they were looking to create. The other pairs are not really focused on as much, but Riken and Susukihotaru are most perfect pair ever. I swear a fangirl was born inside of me just for these two. I find that the silent couples are the most interesting. The youngest officer in the bunch does not  get any development, but this was fine with me as I saw his group as the least interesting and most annoying. I also won't have to actually have to judge the whole twins headache either.\\n\\n\r\nConclusion: \\n\\n\r\nThis show provided a vent for me after watching so many horrible harem endings and other frustrating relationships. While there was not a lot of plot to offer, it was satisfying and fit in well. I would say that this is a watch for those looking for a stress free romance without the drama. If I was to ruthlessly judge this show I would give it a 7, yet sometimes it is nice to go easy on things; I'm handing it a Very Good out of 10.",
            "date": "2010-12-31T01:36:00+00:00",
            "helpful_count": 5,
            "mal_id": 33245,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=33245"
        },
        {
            "content": "I'll start with the Overall Enjoyment- and no matter what I did enjoy this anime and give it a 9 for that. This anime itself has elements of different anime, and it starts off like many others, but is able to take on its own within the 13 episodes. The manga itself is good as well.\r\nThe story/plot again seems to be a mix of anime story lines but makes it unique and adds mystery for its main heroine. While it does seem a bit cliche to have half \"spirits\" working along side humans to defeat rouge spirits, it does introduce a specific time, Westernization inJapan, an interesting time that did help the story along, and helps provide back stories and current issues for the characters.  Of course as the story progresses we start seeing the changes in the character's relationships and in themselves. Also we start to see the true villains appear and their purpose.\\n\\n\r\nArt gets an 8. I myself enjoyed the artwork. Cherry Blossoms, an obvious yet still beautiful symbol in Japanese culture and in anime graced this series. In fact the main female characters use them for fighting throughout the series. The different scenes were beautiful, from the lotus flowers, the water, the moon, just every detail. The characters were cute and charming and the fighting scenes were nice to watch. \\n\\n\r\nSound was a 9 because within the anime the female heroines sang when they fought. This is seen in the very first episode. It is a haunting melody and very catchy. The series had one opening, it reminded me of DDR but it was so hyped and fun to listen to. The ending had 3 songs introduced, and changed up every other episode. I loved them all. Simple. They were romantic, soothing, and great ways to end the episodes.\\n\\n\r\nThe Characters received an 8 from me. I do see some similarities with other anime characters and do find it a bit un-original with them being \"half-spirits\" but again this element is used to create something original. Again I found them- beautiful. I found their relations with the humans, especially with the soldiers and their bonds growing. I did find the main villain to be not as villain as I thought, rather suspecting of who it was.  When all was revealed I feared a bit of incest but moving on from that I don't think it's too much to worry about. Again the series characters were charming and adoring.",
            "date": "2012-12-29T12:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 81848,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1217679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Heta-rashi1",
                "username": "Heta-rashi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=81848"
        },
        {
            "content": "It's near--scratch that. It's impossible to make something without a base stereotype. It's how it's executed and developed that makes it more than a simple cliche. I can't say that Otome Youkai Zakuro does a lot of this. \r\nPlot:\r\nWhile the plot was okay the build up was done pretty decently considering how long it was. The plot wasn't very unique, but had those nice little breaks from the flow with humor or a little background story on the characters, helping you to avoid that suffocated feeling that comes from a short anime. \r\nCharacters and Romance: \r\nWhile Otome Youkai Zakuro makes its attempts and sometimes succeeds,I found Zakuro's 'kindness' to be quite boring and a little irritating in her sudden character shift. It wasn't that she was suddenly kind, or that she was mean before. It just made her character a little flat. In an attempt to be objective, I have to say that while Zakuro isn't a bad character, she's not insanely unique either. It's more like an attempt to make a unique character gone wrong. \\n\\n\r\nAgemaki, although a flawed character, ended up coming to save the day every time, or ended up being saved by Zakuro. He wasn't very memorable for me, to be honest.\\n\\n\r\nSusukihotaru and Riken ended up being my favorite pairing and the twins surprisingly didn't really irritated me (although their little side story and telling of it was so stereotypical I just sort of stared there wondering what happened).\\n\\n\r\nIn the end my favorite character was--Kushimatsu. The elder of all the spirits who live with her. She was strong and worrisome, frequently scolding Zakuro in attempt to help protect her. \\n\\n\r\nThe romance was quite weak, although I liked how they focused on the other characters. Bonbori and Hozuki's romance with Ganryu pretty much felt like it was thrown together and sewn by a five year old.\\n\\n\r\nZakuro's romance was teased and finally thrown just as half-heartedly together at the end after the battle.\\n\\n\r\nI'm trying not to be biased when I say this, but I probably enjoyed this shipping the most because of how it was executed, Susukihotaru's and Riken's romance was probably done the best. There were sweet bits every once in a while, but also those parts when you just know that these two are supposed to be together. Susukihotaru, although occasionally rescued, did a fine job of trying to stand on her own and caring for Riken in her own way. Riken is very stoic and chivalrous and cares for Susukihotaru in a very considerate manner. They are incredibly adorable with how shy she can get (without being tsundere) and how he tries to understand his own feelings.\\n\\n\r\nSound:\\n\\n\r\nI loved the soundtrack and have it on my iPod. there was so much effort and it was so... family-like, I guess. All the seiyuus (main) had a part and sang in the opening and ending theme and it was nice to listen to with an almost traditional and 1950's feel. They were catchy and light--just like this anime.\\n\\n\r\nWhile I wasn't that fond of the background music (more specifically the battle music) and much of it sounded quite similar, I like the slow little tunes that would pop up during the 'break times'. \\n\\n\r\nAll the seiyuus were chosen correctly and did an excellent job as always. Especially since there was Kana Hanazawa (Susukihotaru) and Sakurai Takahiro (voicing Kei Agemaki) who are veteran voice actors.\\n\\n\r\nArt:\\n\\n\r\nWhat originally attracted me to this anime. The art was pretty. I fell for it. It's like a horrible trap--except this wasn't that horrible. The animation was done well and, actually, quite creatively. \\n\\n\r\nEither way, despite any flaws this anime had--I was still pushed to continue this series and managed to even though I nearly never finish any. It simply sucked me in.",
            "date": "2011-10-17T16:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 45727,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/748925.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Harmoniche",
                "username": "Harmoniche"
            },
            "url": "https://myanimelist.net/reviews.php?id=45727"
        },
        {
            "content": "In the beginning I was really irritated about this Anime because of the time which it plays. Stories, which plays in the beginning of 20th Century are rar and with fantasy and demons too.\r\nI found the first episode not really good but the art looked very well and I don't wanted to give up so I watched more and I was really surprised. After I get into the story and adjust this whole anime, it was surprisingly good. At first the episodes are completed but after a while there was more tension and action and a red line. \r\nHere are my conrete marking:\r\nBecause of theslow beginning only 7 points for story. \\n\r\nThe art is really great and with fine animation so 9. \\n\r\nThe sound is also really clear and the voices are very convenient to the characters.\\n\r\nThe characters are all very typical and not something new. This was a little bit sad but they are straight in their actions. Anyway I liked them but for less creativity only 5.\\n\r\nIt makes fun to watch it but it wasn't at first so only 7 for enjoyment.\\n\r\nIn the end I give for this Anime seven points, it's refreshing but not something with much standard.\\n",
            "date": "2016-03-19T14:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 213356,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2175737.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ahoiibrause",
                "username": "Ahoiibrause"
            },
            "url": "https://myanimelist.net/reviews.php?id=213356"
        },
        {
            "content": "Amazing. That's a good word for this anime. When I first watched it I laughed a lot. And as the story continued I was laughing sometimes and then almost crying the next. You know when something dramatic happens and your heart just kinda seizes up? Well I felt it a lot. The plot just moves smoothly throughout the show and it all comes together perfectly at the end. I was hooked right from the start.\r\nAnd the CHARACTERS!! They were drawn so well and the ears are just adorable! The pairings were so perfectly matched. So when you are reading this and deciding whether to watchit or not.. Just do it. You wont regret it. :)\\n\\n\r\n~~And this was my first review so sorry if its kinda bad~~",
            "date": "2010-12-28T20:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 33166,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/357176.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SummerStar1234",
                "username": "SummerStar1234"
            },
            "url": "https://myanimelist.net/reviews.php?id=33166"
        },
        {
            "content": "For those of you who don't feel like reading through an entire review just to get my overall, general thoughts of this anime, I'll go ahead and say this: It was good, but nothing special. Honestly, more than a few times, I found myself thinking, \"I'd rather be watching Inuyasha\". Now, that isn't to say I didn't enjoy my watch-through of this anime, but again, it didn't stand out in any significant way to me; the humor earned a few giggles here and there, my eyes got mildly watery at just a couple of points in the story, and although I was looking forward toseeing the relationships between the main characters blossom, I never found myself getting super hyped up over any one moment. This anime was a fun way to pass the time, but if you're looking for something to really get invested in that has a unique storyline, characters, art, or music, you may want to bypass this show. If you're looking for a short, decent romance anime to pass the time, I'd recommend Otome Youkai Zakuro! Now to go into specifics for those who are still on the fence. Of course, these are just my personal thoughts and opinions, and I'm sure there are others out there who will appreciate this anime much more than I did!\\n\\n\r\nStory: 6\\n\r\nThe story followed an extremely basic formula to me, on multiple levels. Firstly, although there are several romances budding over the course of the show, each of them are founded on typical stereotypes and cliches of the genre, such as tsundere type development or misunderstand feelings. You know, the good ol' stuff. I will admit that there were a few times that I was surprised at the direction the story *seemed* to be taking, but it was like each major plot point was an after-thought in getting the story where the creators wanted it to end up. I'm hesitant to go into detail for those of you who are genuinely interested in a watch-through, but I do want to say that some of the more prominent plot points appeared forced and ultimately of little significance to the overall story (which can honestly be said for some of the characters as well). I suppose some aspects of the story just seemed rushed, but I don't hold that too heavily against it, as I haven't read the manga and can't speak on if the pace of the anime adaption was solely due to something like time constraint or budget restrictions. All of that being said, despite the progression of the tale seeming a bit off and it being nothing out of the ordinary, by romance standards it is a solid story that offers its fair share of sappy moments (and having come for that, it was pretty enjoyable). \\n\\n\r\nArt: 7\\n\r\nAgain, nothing special, but definitely crisp and appealing. My biggest complaint was the frequent (and noticeable, in my opinion) re-use of animation in certain scenes. What made it a little less tolerable was that the bad habit got even more common toward the end, making it difficult for me to take some of the later climactic scenes as seriously as I would have liked to. This is just a pet-peeve of mine, but even so, it wasn't unbearable. I was still able to enjoy the art and the events that were unfolding throughout the series despite that apparent laziness in animation; all in all, the art was one of the highlights of the show, as it remained consistently well done. \\n\\n\r\nSound: 6.5\\n\r\nThe opening was one of my favorite parts about the show, not because it was anything out of the ordinary but because it still did a good job of hyping up the show, which I believe is the most important thing for an intro to do, whether it have the goal of making people feel mellow, restless, pumped up, etc--as long as it represents the anime and gets the viewer invested in some way, I think it's fulfilled its purpose. Moon Signal definitely did that for Otome Youkai Zakuro. The endings were also very enjoyable, and I liked the way they didn't seem to play in a specific order so you never knew which of the three you would be hearing once the episode came to an end. For a short anime with only one intro, it was a nice touch. Now, the actual soundtrack during the show was what I found to be a bit lackluster. There were not many choices in the melody or sound effects you could expect to hear, but the ones that were present were at least decent. I don't necessarily have any complain except for the lack of variety! Overall, the sound was solid!\\n\\n\r\nCharacters: 6.5\\n\r\nThe characters were about as basic as the story, but likewise, it was enjoyable to follow their development and personal plots. Most of the cast is rather one-dimensional, and even the individuals who aren't don't have extreme complexity or depth to their profiles; however, each of the main characters fulfill their roles well and are at least somewhat interesting/entertaining in their own ways. I honestly don't have too much to say about them, bad or good, except for that they are pleasant to follow despite abiding by the same stereotypes and cliches of the story. \\n\\n\r\nEnjoyment: 6.5\\n\r\nI know I have used the rating of 6.5 a lot, but to me, that just reflects how I felt about this anime overall. I got enjoyment out of it by watching it one time through, but I don't see myself coming back to it because once the end is reached, it doesn't seem to me like the kind of series that was still have enough substance for me to watch it back over. \\n\\n\r\nOverall: 6.5\\n\r\nTo sum things up, did I like Otome Youkai Zakuro? For sure. Do I think it's anything special? As you've probably gotten by now, no. I believe it had a lot of promise that it never really added up to, but at the same time, the series got its point across well enough for me to have fun watching it. I would definitely recommend it for anyone looking to relax with a solid romance anime that delivers what it should (although not much more), but if you're looking for something more that has a similar story archetype, well... Inuyasha is still where it's at!",
            "date": "2018-07-30T14:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 285180,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5803118.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SincerelyShania",
                "username": "SincerelyShania"
            },
            "url": "https://myanimelist.net/reviews.php?id=285180"
        },
        {
            "content": "I personally loved the anime itself. There was really nice character development despite the fact that there wasn't much time since there was a lot of action and such in only 13 episodes. During the moments where characters were just together having a brief conversation, I felt that the story had reached a mountain.  It had built up to the peak then, began its descent.  In a way, it is rather childish since they all seem rather 'love-inexperienced' and watching them try to convey their feelings toward one another is rather funny.  I have a feeling that they might make a season2 since they left pleny of room for one at the end of the last episode.  Like most short animes like this one, the ending seemed a bit too fast and could maybe use more development.  Kind of like it reached up to where it should start winding down, then it fell.  Watching it once it reached that point made me feel like I was falling since it all went by so quickly.  Despite the fact that it was fast, the plot wrap-up in the end and the change in mood were very good.  The opening theme is a good fire-starter since it gets you in to the anime. After a while, you get fully engaged just after that one spark (that's how it was for me at least).  Overall, its a wonderful anime.",
            "date": "2010-12-28T20:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 33165,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/424091.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sakurax98",
                "username": "sakurax98"
            },
            "url": "https://myanimelist.net/reviews.php?id=33165"
        },
        {
            "content": "This is one of those animes that I watched all the way through, just because of the amount of potential it had. I kept wanting it to dish out more, but sadly it never delivered. \r\nStory 6/10\r\nThe story was decent but didn't seem like the main focus of the show, plus it was as predictable as it got. It seemed like the romances and relations between characters was the main focus, but even then the show didn't show any real progression until around the end of the anime, which left me wanting more. \r\nArt 8/10\r\nI found this anime to be beautiful, the art fit mytastes perfectly, with a wide range of color, and detailed shading on characters. It was truly eye candy and was the main attraction of the show for me.\\n\\n\r\nCharacters 7/10\\n\\n\r\nAll the characters were well made, just not well developed. You didn't see any real change from start to finish, other than some minor stuff. I felt myself wanting more background of each character, which is why I believe there should be some specials or even another season. It did dip into their pasts a little, but it really just left you wanting more. \\n\\n\r\nThe relations between the characters were very sweet, although setup in a ridiculous manner, the whole Spirit Affairs Division seemed like a matchmaking group.\\n\\n\r\nEnjoyment 7/10\\n\\n\r\nAlthough it seemed pretty messy, I found my self not able to stop watching. It was still enjoyable regardless of a large amount of flaws, and I do recommend watching it.\\n\\n\r\nOverall 7/10\\n\\n\r\nThis was my first review, and at the start it was a lot longer, but it felt more like a rant than a review. So, I revised it quite a bit, to the point of rewriting, but I hope this is helpful.",
            "date": "2012-12-24T02:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 81128,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1486631.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/deagosane",
                "username": "deagosane"
            },
            "url": "https://myanimelist.net/reviews.php?id=81128"
        },
        {
            "content": "K, my first review goes to this, because i think i'm SO against the other reviews i need to say why.\r\nArt and sound i usually don't rate (so i give it a solid 7) unless it's so good (or so bad) that it deserves a higher/lower one.\r\nStory:\r\nI'm usually more to the lower-counts, when it goes to tell a story, but this was just shortend beyond imagination. A struggle between demons, halfdemons and humans in that aera sounds promising, even if it's in a romance enviroment. Not that i don't like such anime from time to time.\r\nAt start there comes a lighting-demon and you learn, theydo not kill them, they  put them to sleep and afterwards the demon is nice. Why did it become angry at all? No answer.\\n\\n\r\nThen the episode with Kai's father. Ok, Kai is afraid of ghosts, we learn that is because he saw a ghost when he was little? And his Father says \"don't be afraid of ghosts\" and slaps him? Just normal, get over it after ~10 years maybe?\\n\\n\r\nBackground-stories for the background chars were ..let me say under any bridge, but more on that in the Char-section.\\n\\n\r\nChars:  Ugh, were to start.\\n\r\nKai: get's kicked over and over and don't even mans up a tiny bit untill the last 20 seconds of the show.\\n\r\nZakuro: again ugh, to make tsundere is fun, but it needs to stop at one moment. I mean, she got the stick up her ***** out sometimes, not in the final.\\n\r\nOther girls and other boys: They get along from the very start, there is ABSOLUTELY no envolvment, you just know what is going together (not that it is explained).\\n\r\nAnother \"Fun\":  The \"bad\" guys.\\n\r\nAlmost no backstory (ok, the brother wants to *bleep* his sister. Oh really?\\n\r\nThe other one is the spider, who loves the brother but get's rejected and is starting a fight (the endfight)\\n\r\nPlease, have i seen too many animes to see this?\\n\\n\r\nOverall:\\n\r\nStory: Good intention perhaps, but very poor.\\n\r\nChars: 1-dimensional, even the mains were just as in the intro.\\n",
            "date": "2015-02-17T04:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 180608,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4424505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rohling",
                "username": "Rohling"
            },
            "url": "https://myanimelist.net/reviews.php?id=180608"
        },
        {
            "content": "If you want a quick short but a bit depressing, demon fighting goreish anime, with a bit of humor and romance this is your anime! \r\nThis was a lot better than I thought it would be, and I finished it pretty quickly. The art is really great to look at and the plot drew me in fairly quickly. It's a lot sadder than it would seem to be, but the ending is does not leaving you completely hanging like a lot of anime does out there, even if it is short.\r\nSome might claim it reminds them of InuYasha, and as much as I like thatanime, they are aren't very much alike. Sure the lead is half demon/spirit but she is has  a toughness to her I really like (and that's hard to find in anime girls). Instead of the males being the stronger ones, the girls in this anime are the ones who protect them the most, and I have to give props for that.\\n\\n\r\nMy favoirte thing about this anime is the light romance (the shyness of it), how much the characters grow(Deeper than one would expect) (even though the humans seem meh at first), the goreish fighting, and the bit of humor that does show up. The plot twists do help too (though I can't say what!)\\n\\n\r\n I am a fan of multipile types of anime, normally (action, romance, gore, ect) and this anime fits in perfectly! \\n\\n\r\nAlthough an ending is better than hanging, this anime could have been longer with added arcs (that is if you're a fan of long animes like myself)\\n\\n\r\nAll in all, it's worth watching! :)\\n\\n",
            "date": "2012-10-31T12:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 76351,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1709295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pinkbun17",
                "username": "pinkbun17"
            },
            "url": "https://myanimelist.net/reviews.php?id=76351"
        },
        {
            "content": "Story -  In Japan’s Meiji Era of Westernization, humans and half spirits have come together to live amongst each other. Naturally, everything isn’t so peaceful and tons of issues arise. That’s when the military decides to create the Ministry of Spirit Affairs. Each half-spirit is assigned to a human soldier and that is how we meet the powerful half fox-spirit, Zakuro and her partner Agemaki. Her friends Susukihotaru, Bonbori, Hozuki, Riken, and Ganryuu help her and the Ministry resolve issues and bring peace to conflicts. However, Zakuro must face a mystery of her own; the truth of her mother’s death.\r\nCharacters - Definitely a highlightof this anime! Every character is filled with their own histories and distinct personalities.You have the tsundere Zakuro (not a very unique trait in anime, but still an interesting character), the cheerful twins Bonbori and Hozuki, the shy Susukihotaru, and the noble men of the military. Each of their backstories were so interesting to watch and added to everyone’s overall character development. Each pairing in Spirit Affairs also complimented each other so well and were a perfect match. The cast did so well in portraying these characters and brought them to life.\\n\\n\\n\r\nAnimation/Art- The one thing that I love about the shoujo genre is that there are so many great artists providing gorgeous characters and sceneries. From the attire in this anime, to the character designs, the art is another high point. My favorites, though, were Bonbori and Hozuki’s hair and outfits because they were so detailed and intricate. It was fun watching them on screen. Vibrant colors and smooth animation grabs your attention instantly. During the ending song animations, artwork from the actual manga were incorporated and I must admit it was breathtaking. It made me want to begin the manga and I actually did! The art is much more sensual and has such an elegant feel to it. It’s lovely.\\n\\n\r\nSound - The soundtrack backing this anime suited the show very well. A wide variety of song types fill this anime. There are fast-paced happy songs, eerie mysterious ones, as well as sad sentimental ones. They also did one of my favorite things any anime could do…have multiple ending sequences. I usually skip the ending song for any anime that I watch, but I find that I stick around when the songs are different each episode. It adds variety and makes you look forward to hearing what song is going to be used next. There were three ending songs for this anime and they were all excellent. They fit the episode they closed after appropriately and were also quite catchy. My favorite of the three was “Futari Shizuka”, a duet featuring the voice actress of Susukihotaru and Riken. It’s  simply a beautiful song, with enchanting vocals and violins.\\n\\n\\n\r\nPros - One quality about this anime that I enjoyed was that its romance was not too unrealistic or overly dramatic. Too many times have I stopped watching shows where the romance feels absolutely fake, so this was a refresher. The romance was subtle and warm-hearted. Made you want to say “awwwww”. All of the couples fit each other so well and it’s like you want them to be romantically involved.\\n\r\nAlso:\\n\\n\r\n    - Story wasn’t complicated and was very easy to follow.\\n\r\n   -  Illustrious fight scenes! Very cool to watch.\\n\r\n    - Loved how Zakuro’s weapon transformed from a sakura branch. Now that was awesome in my book.\\n\\n\\n\r\nCons - The main villian was part of a plot twist, but their power was hardly shown. Expected more of a showdown between the chacracters, but there was barely a fight, which was disappointing. It was another evil character, the Black Widow, that stole the limelight as far as villianry goes. She was much creepier and actually showed a lot of potential in harming someone.\\n\r\n    Also, the anime could be slow-paced at times, making a couple of scenes slightly boring. There weren’t too many of these instances, but there were enough for me to notice. It was as if we’re expecting something to happen and nothing does. Scenes could be drawn out to prolong the episode.\\n\\n\r\n——————————————————————————-\\n\r\nIn conclusion, Otome Youkai Zakuro wasn’t perfect, but it caught my attention. A short and sweet series that had potential for more material, but finished a little short. Really wished that more people watched this show because it is worth the watch! Loved the fact that there wasn’t an abundance of drama when it came to the romance. No open endings were left, making the ending satisfying and fulfilling. The issues the Ministry had to resolve were also actually pretty cool and hey I recognize some of those spirits! My love for Japanese Mythology and folklore just increased :3\\n\\n\r\nRating - 8/10",
            "date": "2014-02-27T05:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 134025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3583285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Deep_Drive",
                "username": "Deep_Drive"
            },
            "url": "https://myanimelist.net/reviews.php?id=134025"
        },
        {
            "content": "Story:\r\nI don't know why no one mentioned this about the story; I found the story more appropriate for hentai genre (Although there were no inappropriate scenes) but the story itself revolve around a sick guy who tried to make his mother bear his child but she refused him then goes around trying to kidnap his half-sister (sister from his mother) to make her his wife.\r\nSound:\r\nI think the songs they used were very good; I even thought about having one of the songs as a ringtone for my mobile phone (I am still planning to but I'm just too lazy to do it)",
            "date": "2017-08-12T06:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 255256,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RED_SCORPION",
                "username": "RED_SCORPION"
            },
            "url": "https://myanimelist.net/reviews.php?id=255256"
        }
    ],
    [
        {
            "content": "The story is not too complex (no James Joyce type of stuff), for more experienced viewers it might be a bit predictable, but still  it is far from being boring. The characters are adorable and really easy to fall in love with! The only thing I disliked, was the cowardliness of one of the main characters in the beginning, but as  the series draw to the end, he obtained an sufficient amount of honor in my eyes! The art is satisfactory! A great thing about this anime is also the song the girls  sing, when they fight the bad guys. \"Am Ia flower, a butterfly, or a demon?\"It gives away a special kind of elegance and beauty. I can't imagine Otome Youkai Zakuro without this song.\\n\r\nA French novelist once said: \"There is only one happiness in this life, to love and be loved.\" I would also add serving your community but I agree, he was quite right! This anime is like an atom bomb of love, that releases huge amounts of happiness. It will blast your grey sunless days away and it will feed your love starved souls! At least it did for a me... I approve this anime!\\n",
            "date": "2017-02-05T05:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 239940,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5321095.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/eiserneskreuz",
                "username": "eiserneskreuz"
            },
            "url": "https://myanimelist.net/reviews.php?id=239940"
        },
        {
            "content": "It was alright. Not horrible, not bad, but not amazing, the best, or the greatest either. It wasn't the most original thing going on and most of it was predictable. Nothing really excited me or had me on the edge of my seat. The ending is satisfactory but I still feel like the anime lacked something to make it better than it was. It also reminded me too much of Ouran Highschool Host Club which left the same empty lackluster feeling. The pairings were okay but I was disappointed that Ruken and Suskihotaru were never given enough screen time to have their growing relationship shineon screen. (The only thing that piqued my interest.)  Overall I give it a 6, because it was pretty average and nothing too special. Again it's not horrible, just decent. If you're sick or it's a rainy day and you can't find a good anime to watch then this will be good enough, but you're better off finding something like Death Note.",
            "date": "2014-08-28T16:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 158301,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1187717.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rokatsu",
                "username": "Rokatsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=158301"
        },
        {
            "content": "Such beautiful animation. You feel like you're watching some glorious artwork that keeps changing on you and becoming more beautiful. The story is nice and the characters quite loveable but I found it was the imagery that kept me coming back for more!",
            "date": "2012-08-11T09:12:00+00:00",
            "helpful_count": 0,
            "mal_id": 69423,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1435735.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/raindrops_tumble",
                "username": "raindrops_tumble"
            },
            "url": "https://myanimelist.net/reviews.php?id=69423"
        },
        {
            "content": "My basis for rating animus come down to a few vital points. Art, character development, story, and length. As I don't have oodles of time to watch anime series, I like to make what I watch worth my time.\r\nStory:\r\nI loved the story for this series. Yes, it was a bit cliche, but it was entertaining. There were no fillers, every episode had something to contribute to the overall series. \r\nArt:\r\nLovely art! Very appealing to look at, making the series all that more enjoyable.\r\nSound:\r\nGood opening song, i actually stuck around to hear it. I never pay attention to endings but it never particularly caught my taste\r\nCharacter:\r\nBESTPART! I love how they developed the characters in their past and with each other! The relationships and blooming romances were great as well as friendships and everything in between. One of my favorite parts of this series.\\n\\n\r\nTime:\\n\r\nOnly 13 episodes! A great weekend watch to relax and enjoy something!",
            "date": "2012-03-17T16:05:00+00:00",
            "helpful_count": 0,
            "mal_id": 56199,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1200371.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/fireystar",
                "username": "fireystar"
            },
            "url": "https://myanimelist.net/reviews.php?id=56199"
        }
    ]
]