[
    [
        {
            "content": "First off, I will start by saying that I have not read any of the manga nor do I plan to.\r\nFreezing Vibrations, simply put, was very bad. More so, Freezing Vibrations was even worse compared to it's first season which was quite a good show. My main focus in this review will mostly be directed to anyone who has watched the first season.(which I don't know why you wouldn't watch that before watching this...) Let's begin.\r\nStory: 4\r\nThe story never really was this shows strong spot. That said, the first season at least did a fair job at keeping it from being weak. This season,... theyreally dropped the ball. While the exact idea of the plot wasn't bad, it's execution was something of a nightmare. While I would like to go through each episode and beat them down like the wild animals they are, it is taboo to do so in a basic review. I will, however, address the **** storm that was the final episode and warn you about the 6th. \\n\r\n(Possible spoilers) Firstly, the 6th episode led to a moment that could be misinterpreted ENTIRELY. They did a GREAT job at completely misguiding you on a very important event that almost had me quit the show right then and there. When you get there, you will see, and will hopefully remember little ole me warning you now. To add to this episode, it resolved itself in the most insane way.  Just everybody acting like nothing really happened. I just couldn't believe it!\\n\r\nNow for the final episode. So, while the build up to this point was already pretty bad, the phrase, \"They dropped the ball\" simply no longer does it justice. Rather, they took the ball and threw it at you with full intentions of it hitting you in the face and I will say... it will probably hurt. Vaguely put, the last episode could be described as: A character, who was never really hinted to being important, turns out to be pretty damn important and basically becomes Iron Giant Jesus, everything goes black and white, and then a picture of a nebula gets flashed at you. Yeah,..  you'll see...  To top it off, they try to leave you with a cliff hanger by introducing yet another character who looks like three other people in the show. I just couldn't care enough at this point and just wanted it to end. The episode was ironically named \"Shaft of Light\" because we all got handed the shaft.\\n\\n\r\nArt & Sound: 8\\n\r\nIf you saw the first season, the Art was the same. For me, there is nothing to complain about and nothing really special about it either. So, all in all, no worries there. The sound on the other hand was quite swell. I spent most of the last episode listening to it with my face in my hands trying to cope with the pain. It might have actually been the only thing keeping me sane at the time... \\n\\n\r\nCharacter: 2\\n\r\nDespite of all the stories flaws, the characters might have actually been the most disappointing part of this. While I thought that the first season spent a lot of time making Kazuya the \"main\" character, the second season spends most of its time making sure you don't think that. In terms of character development, he has ZERO. I warn you all now, if you wanted him to have any significant part of this story where he did ANYTHING useful, walk away. Now that I think about it, he gets less screen time than most characters in the show. Completely disappointing.\\n\r\nWhile the show does it's best to make him NOT the main character, it can't, FOR THE LIFE OF IT, decide who is. Call me old fashioned, but I like a focused story from a mostly singular perspective and strong development from a MAIN character. The story can't decide who the hell is important and just kills anybody it decides isn't. On top of that, EVERYBODY is crying ALL the time and nobody acts realistically. NOBODY. The weak characters strongly effected the stories progression and ultimately killed entire experience for me.          uuuhhh...\\n\\n\r\nEnjoyment: 3\\n\r\nDo I really have to say it? It sucked. Every corner of every episode was just one disappointment after the other. I powered through in hopes that something would get good but to no avail. While this rating is strongly influenced off the success of its progenitor, which means it is probably receiving a heavier bashing than it deserves, the show was still just... bad.  And I very rarely give below a seven.  \\n\r\nI will say, the action scenes were pretty decent at times. I guess I got some enjoyment out of that maybe.\\n\\n\r\nOverall: 4\\n\r\nI don't think I need to go any further. If you liked the first, I can't imagine you will like this one more. Though, you may not hate it like I did....\\n\r\n...My face still hurts...",
            "date": "2014-03-20T22:53:00+00:00",
            "helpful_count": 66,
            "mal_id": 136291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969859.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/BeanWack",
                "username": "BeanWack"
            },
            "url": "https://myanimelist.net/reviews.php?id=136291"
        },
        {
            "content": "There’s something that is painfully cold about Freezing Vibration. It’s not the temperature I’m referring to but the fact the show is stone cold in terms of storytelling, characters, and presentation. I tried to remain optimistic about what this sequel could bring because the establishment of season 1. Despite being clichéd and molded with unbalanced characters, the first season at least had some standards on its premise. The way it was orchestrated did not live up to its promise but if you thought Freezing was bad, season 2 is at another level of catastrophe. It’s like an avalanche heading for disaster and eventually buries itselfin this disaster of a continuation.\\n\\n\r\nFreezing Vibration is the direct continuation of season 1 of Freezing, a manga based on the same name written by Dall-Young Lim. If you haven’t seen Freezing yet, then better get to that now if you’re curious about this series. The fact is that you’ll be a bit lost at what’s happening. Therefore, it is highly advisable to watch season 1 of Freezing before venturing on this continuation.\\n\\n\r\nSeason 2 takes off wasting little time with its plot. From the beginning, we meet our three main protagonists Kazuya, Satellizer, and Rana whom seem to be part of an expedition in a very frosty location. It’s soon we find that they were sent there to undertake and be part of an experiment for the “benefit of humanity”. I put this in quotation marks as this will be explained later. But as the plot begins to unfold itself, we find out there’s more than meets the eye especially for what’s going behind the scenes.\\n\\n\r\nThe anime is adapted from the manga as part of the “E-Pandora” arc that introduces many new characters into the show. New characters such as Amelia Evans and Gina Papleton are introduced as supporting characters and part of a project known as “E-Pandora Project”. Other prominent characters such as Chiffon, Elizabeth, and a returning Cassie Lockhart make their way in the show. What do they have in common? Nothing except their rankings in terms of fighting abilities that made the famous throughout the world. Altogether, they are in line to support the latest evolution in experimentation to combat the deadly Novas. That’s at least what they think anyways…\\n\\n\r\nAt the core of the experimentation is a research with extensive knowledge of the Stigmata. We learn throughout the show that the experimentations aren’t as they appear to be especially involving a powerful drug. It’s hard to categorize what kind of drug this is but the effects are malevolent. To make matter worse, there’s a line where E-Pandoras cross before they get themselves hurt. By hurt, I mean real hurt. For this sequel to work with a storyline this, there’s need to be a realization on the history of experimentation (or at least similar cases). Unfortunately, the series explores only its effects on the surface through actual combat. The fighting itself doesn’t hold any promise as most of the fights are one sided. Even when there’s a little glimmer of hope, it goes back to being stale again with predicable circumstances. \\n\\n\r\nThe plot of Freezing Vibration also apparently explores a bit of our main characters in particular Satellizer. We already know that she is nicknamed the “untouchable queen” for a reason in season 1. However, that element is really touched upon (almost in a literal sense…) in this sequel. To say the least, it’s disturbing, ominous, and distasteful to watch considering the relations involved. To make matters worse, it makes little effort in resolving the issue. Sure, there’s the emotions and symbolism that were involved. However, there’s little sense in who to exactly blame. Was it really the perpetrator, Satellizer’s own insecurities of herself, or just nature of humanity itself? It’s also unknown what sort of message it's trying to sent; especially with its odd coordination at the middle of the story. The premise is completely separate from the E-Pandoras or war against Novas itself. It seems like the series is trying to develop characters but rubs it in the wrong way. It’s literally forcing itself at the body of its plot to show the grim reality of Satellizer’s past. It’s excruciating to watch and makes us feel uncomfortable with its delivery.\\n\\n\r\nAt some respects, Freezing Vibration does give many of the characters screen time. Almost everyone gets a little action in whether you’re a Pandora, E-Pandora, or Limiter. Just be aware that the series is a one cour show so don’t expect any characterization on anyone. In fact, we only get a little glimpse at the true visage of a few characters such as Elizabeth and Amelia. Our antagonist of this show named Scarlett Ohara is also stereotypical with the lab coat, cynical personality, and ambition of a researcher just without the mad scientist glasses. With no sense of a personality she is about as stone cold as the freezing winds of Alaska. At various points, I question if the main problem of the antagonist is humanity itself because the E-Pandoras suffers by the products of humans’ inventions. Without them, the E-Pandoras wouldn’t even be there or have to live through a fear of being a human lab animal. \\n\\n\r\nIn terms of aesthetic values, Freezing Vibration does keep up with its science fiction theme well. Characters are designed to look and feel like they are part of the program. Because the show brings out the female dominance of the characters, most of them are designed to look compelling and can handle themselves. In particular, the top 5 Pandoras of the world distinguishes themselves by different nicknames that matches their personalities/abilities. On the other hand, there’s a subtext of cruelty related to the E-Pandoras as we get to see where some of them came from; not literally with background histories but rather what they are fighting for or why they’re there. \\n\\n\r\nSimilar to the first season as well, there’s fan service. It feels odd to see many pool scenes in a cold climate where the experimentations take place. Of course, with a pool filled with hot water can only mean one thing: clothes coming off. In more ways than one, a few of the characters goes on a more daring way to advertise themselves such as Elizabeth or Roxanne. Rana also follows this trend in order to “take advantage of Kazuya”. Oh and speaking of the relationship Rana and Kazuya, there seems to be no progression there as well except for the occasional tease that achieves little results. Similarly, Satellizer still remains unbaptized despite overcoming a crucial obstacle in her life. It’s factors like these that really degenerates the main plot together as viewers may be left with how to feel. In the end, I felt unsatisfied. The way some conflicts are resolved are also questionable with predictable results left with clichéd holes. It’s a cold stone reality and the E-Pandoras doesn’t like it either. \\n\\n\r\nArtistic wise, most of the designs are generic although fits with the overall science fiction theme well. There’s not much change in any of the main characters’ designs although a few of the new Pandoras introduced give them a distinguishing appearance. These include the scarlet hair of Roxanne, the short stature of Charles, or the glamorous figure of a nude Elizabeth Mably. On the contrary, we don’t get to see a lot of Novas in this season as the show focuses on the E-Pandoras so it’s hard to tell if they underwent significant changes. The setting of this season goes well with its style though in the cold climates of Alaska. The freezing snow depicts the cruelty of the experimentation and the reality of E-Pandoras like the frozen winds.\\n\\n\r\nSoundtrack isn’t entirely impressive but is tolerable enough. Music director Masaru Yokoyama returns for his role and does a standard job. The OST is only tolerable at best during the action scenes and less so during emotional subplots. The choreography of the action scenes rises above the standards though especially for moves such as the rapid Tempest maneuver or Accel Turns. The OP song ‘Avenge World’ balances itself with a sense of science. On the other hand, the ED song ‘Sekai wa Kizu wo Dakishimeru’ is saturated with fan service that makes the sinister style of this season look like a joke.\\n\\n\r\nFreezing Vibration is one of those shows that I only recommend for completion’s sakes or if you want to see what happens after season one. It’s really hard to not feel disappointed after seeing the weak characterization and its mess of a plot. The plot itself also doesn't end well with a rushed conclusion and hinting a possible continuation. There are many inconsistencies related to the E-Pandora arc such as to who to blame or its main purpose. Sure, it might be to save humanity but who is to save the E-Pandoras themselves? Thankfully, the show introduces a diverse amount of characters that fans might get accustomed to along with some intense action and feuds. But ultimately, Freezing Vibration doesn’t live up to its name. If Freezing is a prototype, then Vibration would be the defection. Clearly, evolution is NOT the solution.\\n\\n\\n",
            "date": "2013-12-21T05:21:00+00:00",
            "helpful_count": 63,
            "mal_id": 124861,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=124861"
        },
        {
            "content": "As someone who enjoyed the first season of Freezing, I found Vibration to be very disappointing for several reasons, but first I will cover the good points of this series.\r\nStory - (Synopsis from Freezing)\r\nThe story hasn't changed, Set in a slightly futuristic world where Earth has been invaded and is at war with aliens from another dimension called the Nova, the story follows the adventures of a Japanese boy named Kazuya Aoi who enrolls for training at a special school for genetically modified girls called Pandoras who battle the aliens, and their male partners, called Limiters, who use a special power called \"freezing\" to limittheir opponent's mobility. The protagonist makes the acquaintance of an unusual older girl named Satellizer el Bridget who appears to be the most powerful Pandora in her class, but has not yet chosen a male partner to be her Limiter, and in spite of the warnings of all his friends, he decides to be her Limiter.\\n\\n\r\nThis isn't your typical School/Romance/Harem in my opinion, it is quite different which actually holds a plot - defeating the aliens combining forces of one female, also known as a Pandora and one male who is called the Limiter; although one boy has a different type of power being the younger sibling of the greatest Pandora to exist, where he can use his 'full' freezing power for anyone he fights with and all the Pandoras fight over him. I rated the story an 8, based upon the two seasons.\\n\\n\r\nArt -\\n\r\nNow for the art, exactly the same as the first Freezing, it is remarkable. The detail put in, each snowflake falling and all the detail put in to the characters, background and the whole surface of it, it's clearly had a lot of time and effort put in and in my own opinion, this is the best part about this season. I rated the Art a 9.\\n\\n\r\nSound -\\n\r\nI didn't find the sound that interesting, it's got the type of opening/ending sound tracks you just listen to once, don't find it catchy and skip it and move on. I rate the sound tracks a 5.\\n\\n\r\nCharacters -\\n\r\nWell, here we go. In my opinion; the character development is the biggest flop of Freezing Vibration; the first season had 3 main characters, Kazuya Aoi, Satellizer el Bridget and Linchen Rana, who had a great back-story and you find out a lot about them all within the first couple of episodes. But, then you come to Freezing Vibration, they have doubled the amount of mains from 3 to 6 and make it confusing; their isn't a big story behind these characters because you are not told much about them, they haven't presented them in the right way and just rushed them into action. Characters - 5.\\n\\n\r\nEnjoyment -\\n\r\nAlthough their are bad things about Vibration, it isn't all bad. It is enjoyable to an extent and does keep you moderately interested, although at points I have felt bored and 'couldn't be bothered' watching. In my opinion, the newer mains annoy me and don't interest me, I would of rather watched the first season again but with more development to the story and what/when Kazuya and Bridget finally become the #1 team.\\n\\n\r\nOverall -\\n\r\nOverall taking all my ratings into account, I rated this a 7.\\n\r\nThe story and art are the best things, like in any anime these are a key necessity for a good show, although the Characters are the biggest let down for me and I'm not too bothered about the sound.\\n\\n\r\nThank you for reading.\\n\r\n~Malteasers",
            "date": "2014-05-08T00:36:00+00:00",
            "helpful_count": 40,
            "mal_id": 142665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3002361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Malteasers",
                "username": "Malteasers"
            },
            "url": "https://myanimelist.net/reviews.php?id=142665"
        },
        {
            "content": "\"Freezing Vibration\" attempts to pick up where its predecessor left off, at least in some ways.\r\nAs It begins, you are quickly jumped into a relatively new plot, and you quickly find out that the show has little to none relevance to \"Freezing\"\r\nThe Important characters that remain from Freezing are: Satella, Rana, Elizabeth Mably, Chiffron, and and Kazuya.\r\nBut don't misunderstand, The Only people to be considered \"Main Characters\" should be Elizabeth, Satella, and a new character name \"Amelia Evans\"\r\nAlong with this, there is absolutely no character development improvement from \"Freezing\"\r\nStory:1, there is more then one way at looking at this, you could consider the story acompletely new theme, based on a completely different plot, yet keeping the same system from Freezing, for fighting style, etc.\\n\r\nor: It is a side story, with little to no development towards the official plot at all, that is trying to throw new characters at us as an attempt to increase the small fan base \"Freezing\" Originally had.\\n\\n\r\nArt:4 In general, Freezing Vibration had a great art style, and though the pointless scenes where their clothes are ripped from Freezing was slightly aggravating. Freezing attempted to fix this by censoring every 1 of those times with light rays. which in the end was even more aggravating.\\n\\n\r\nSound:8 This was the one spot in the story that wasn't terrible, Freezing Vibration has Great epic battle music, and a great Opening song, which may have been the same thing.\\n\\n\r\nCharacter:3 As my expectations for watching this show were, to see some progression on perhaps the Satella-Rana mini harem, or maybe just some character development in general. 95% of the small character development the show ended up having, was based on completely new characters, completely irrelevant to the first season.\\n\\n\r\nEnjoyment:1 Initially, with shows like Freezing, even with everything else failing, you can sit back, and enjoy the show's Ecchiness through comedy. but in reality, picture this show as a Censored Hardcore Ecchi/harem with absolutely no comedy or Romance, at all! That attempts to WOW you with its irrelevant plot, and boring new characters.\\n\\n\r\nOverall:2 Now, even though I view this show as dreadful, through the power of a good extra song at the end of the show, i decided to bump up the inevitable 1 i was prepared to give it, to a 2.\\n\\n\r\nNote: I watched it while it aired so it was censored, that obviously won't apply to you.\\n\\n\r\n#AnimeX",
            "date": "2015-02-02T09:36:00+00:00",
            "helpful_count": 26,
            "mal_id": 179502,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2935173.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Crim",
                "username": "Crim"
            },
            "url": "https://myanimelist.net/reviews.php?id=179502"
        },
        {
            "content": "This anime is probably one of the worst animes i have ever watched in my entire life.\r\nThe fanservice is forced and is really just useless, the only reason this anime is half worth watching is cause of tits..\r\nThe story is bad, there is nothing else to say.\r\nCharacters is bad as hell to, the main character is strong as hell, but he lets the girl fight until she is half dead before he stops the fight, witch he could have done before it started. For some fucked up reason there is alot of girls that likes him although he is a shit person and a badcharacter.\\n\\n\r\nThe anime is frustrating to watch and i remember forcing myself to not hit the screen multiple times as i watched this, and i basicly only completed it to write a review on it so that as many people will be spared to watch something as trash as this.",
            "date": "2014-11-01T18:56:00+00:00",
            "helpful_count": 18,
            "mal_id": 167079,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3479525.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/InXLnT",
                "username": "InXLnT"
            },
            "url": "https://myanimelist.net/reviews.php?id=167079"
        },
        {
            "content": "Ok, so season 2 has just ended and frankly, hummmm, I basically don't have enough as to what to say about this sequel, so at this point I'm gonna get straight to the point:\r\nStory: Poor 3.\r\nFrankly, there isn't anything new here, it is just them Pandora's with their usual cat-fights and fanservice, and the Novas, just as predicted have appeared in the first episode, flash backs and in the last 2 episodes, let's face it it's just the usual plot, the only consolation here were the addition of a conspiracy thing about the E-Pandora, and a certain Dr. Ohara and some guy who has thesame name of a famous men clothing line called Marks Spencer whom serves as the main antagonists .\\n\\n\\n\r\nArt: Very Good 8.\\n\\n\r\nWhat can I say, I'm a sucker for fan-service, though there are some censoring being done, one only has to wait just a couple of months, co'z other anime viewing site will show it uncensored.\\n\\n\r\nSound: Mediocre 5.\\n\\n\r\nCo'z I have nothing much to say.\\n\\n\r\nCharacter: Fair 6.\\n\\n\r\nUnlike the previous season, were it was a Aoi and Satellizer tandem, here the protagonist roles are divided among Satellizer, Elizabeth, Linchen, Amelia, Chiffon and Cassie,  such distribution of being the main character does provide some consolation since just with Satellizer and Aoi hogging the limelight would prove to be boring. However, it was disappointing that Aoi as a limiter was more like a supporting role and so as most of the limiters in this anime whom are more like cameo than anything else, only Elizabeth's limiter, Andre kinda who has  outshined the limiters. Frankly , studio A.G.C.T has put more emphasis on the antagonist like  Scarlett O'hara, Marks Spencer, Louis El Briget and the Chevaliers than the protagonist. Tbh, I'm a bit disappointment at Aoi for not getting banged either by Satellizer or Rana.  \\n\\n\r\nEnjoyment: Good 7. \\n\\n\r\nWell, the fan-service, cat-fights, the battle with the unknown Nova, the dramatic moments and the part where the antagonists got what they deserve, were enjoyable enough, but I'm putting more on the fan-service than anything else.\\n\\n\r\nOverall: Fair 6.\\n\\n\r\nThough, the plot was still the usual and there is that melodramatic thing in it, I just don't thing that this anime deserves a high score, besides, I can never understand why Aoi never get baptize (or banged) either by Satellizer or Rana from the last episode of season 1.  \\n\\n",
            "date": "2013-12-21T00:07:00+00:00",
            "helpful_count": 17,
            "mal_id": 124843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=124843"
        },
        {
            "content": "First off i'll just say that, well I stopped this one short, I just couldn't handle it. I can force myself to finish off an anime, even if I do not like that anime, but for this one I just couldn't. Even if their clothes do get ripped off in almost every scene.  \r\nI wrote this, from watching the first season, to watching this season up until episode 10, hopefully you did the same, but actually finished this season. \r\nIf you want an actual review with the reviewer actually watching all of it (12/12 ep.) then feel free to skip this. For those ofyou who actually take the time to read this, thank you. \\n\\n\r\nStory 5/10 (Well let's just dive right into it~)\\n\r\nI simply just did not like the story plot in this season, at all. First they tell you where they are and why they are there, sort of, but I don't understand the sudden, weird, awkward switch of settings from season 1, for I liked the school life... Anyways, probably the biggest reasons why I found Freezing Vibrations story to be so, \"meeehhhhh\" is simple. (spoiler) They somehow found a way to sort of forcefully bring Satellizer's past back into this season. Whiiich I wouldn't have minded, if not for the, smooth yet very, very, very awkward transition into it. What I mean by that is, you're going to just let the lead characters go off into their own world, right in the middle of the story??? That honestly just blew my mind, plus I felt like Satellizer's past was rushed and not thought of carefully. Okay, I'm probably being a bit rough on this, (already...) but don't get me wrong I did enjoy watching the tidbits of good story to Freezing. If they would have made the characters face the actual problems at hand, and not have so many little side details that didn't matter come up and in the way, the story would have been much, much better. \\n\\n\r\nArt 6/10 \\n\r\nI'm not usually too knit-picky when it comes to art, but Freezing doesn't come up to par with some of the other anime from it's year/years. Overall standard animation. \\n\\n\r\nSound 6/10\\n\r\nFor sound, I'm usually not to picky either. There are a few points I'm looking for, a nice opening/s and ending/s. If the anime doesn't have these I don't mind, but if I hear the same ost for a few scenes over I do get a bit annoyed. Freezing did fine when it came to that.  Also, the voice acting was quite, \"OK\" I liked the sound of their voices a majority of the time. \\n\\n\r\nCharacter 3/10 \\n\r\n\"Why such a low score for this!?!?\" Is what a friend of mine said, and here is what I had to say. In Freezing Vibration, they spent FAR too much time on the small, supporting, never to be seen again characters. I would have liked to see some more character development on the  characters from season 1, you know the ones who won't die off. And I do say that the main Heroines, did get some attention, but honestly it's not the type of attention I wanted. When the characters \"grew\" closer together, I just felt super awkward, like AWKOTACO awkward. Satellizer is the main bad-ass in this series, I just felt like she got weak, (spoiler, she did) and seeing a main heroine go bipolar all over the place is sort of distorting. \\n\r\nThe overall fighting was pretty good, I get a bit confused on what they are saying from time to time, but the individual characters are good at stating the facts about themselves and the current battle situation. \\n\r\nThe characters, to me just... They felt so one-sided, not fake but on the verge of just being to predictable. Even if the main characters did get more time, I feel like it would be for nothing, since from the start, they were sort of brought up, only to just \"be there.\"\\n\\n\r\nEnjoyment 4/10\\n\r\nIt's not like I didn't enjoy Freezing Vibration, it's just that saying, \"I like this season!\" Is too far fetched. Granted the clothes randomly ripping did make me laugh out loud from time to time, but less of that and more on things that actually mattered would have been great. I mean especially since they want you to sort of take this series seriously, but how can you and I take a battle serious when we see boobies everywhere? My enjoyment for this season would have been higher if the plot and the character's weren't so predictable, cliche and awkward. Seeing on how I just randomly dropped this on episode 10. Probably means that I just lost all interest in it.  Honestly I'm being a bit nice on this end. The only thing that kept me going stronk, was Satellizer.\\n\\n\r\nFinal Verdict 4.\\n\r\nI don't really recommend this to anyone, unless you're into ecchi and just want to watch a bunch of girls fight. From the first season to the second (this one) season there was a huge drop of detail and work done on the story and the characters. Not a horrendous watch, but plenty out there that can fill this ones place.",
            "date": "2015-07-30T00:41:00+00:00",
            "helpful_count": 14,
            "mal_id": 194682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4710550.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SunZun",
                "username": "SunZun"
            },
            "url": "https://myanimelist.net/reviews.php?id=194682"
        },
        {
            "content": "Some people have asked themselves, what is hatred? Where does it come from?\r\nWell allow me to clarify those things as best I can.\r\nHatred is a means for one to obtain power quickly while rendering himself blind in the process. It is born from the sins of humanity and it is also the responsibility of\r\nhumanity to pay for those sins.\r\nThe second season of Freezing presents  evolves around a research center in Alaska where the protagonists travel as part of their orders. New faces are revealed, old ones stand in the spotlight once more as restlessness and conflict grips the facility.\r\nNot only does the artwork reflectthe amount of fanservice of this series, it also puts the objects ofthe fanservice on the foreground. As such there are few background scenes that will amaze you.\\n\\n\r\nSoundtracks are made mainly to back up the suspense , the fighting scenes or the emotional moments of the series and are done in a good fashion.\\n\\n\r\nCharacters have numerous personalities each with it's own reasons and ways, something uncommon these days. These many ways to be specific to one character each decrease the level of predictability of the series.\\n\\n\r\nOverally I enjoyed the series since the fanservice mostly blends in with the story. However the message is a strong one and it is one worthy of remembrance.",
            "date": "2013-12-21T05:30:00+00:00",
            "helpful_count": 13,
            "mal_id": 124863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=124863"
        },
        {
            "content": "This is a review on Freezing's 2nd season Freezing vibration Thanks for reading time for the review likes and dislikes but first the categories.\r\nStory- 7/10  I liked the story but it wasnt as good as season one but without trying to compare it, it was good to say the least it had many ups the fights incorporating into the story the sci fi which you get in basically every episode it kinda moves away from the romance part towards the end and is more like friendship stuff  by the end but whatever a good story but, the main arc seemed really rushed towardsthe end and it left you feeling unsatisfied by the ending it seems to give you the rushed feeling and the feeling of wanting more and probably a 3rd season there isnt really a cliff hanger but it seems to indicate a 3rd season. All in all good not great but good. \\n\\n\r\nArt- Same as the previous season so it is decent nothing out of the ordinary but the biggest problem they did with the 2nd season is censoring the fan service scenes which was so badly done but not the worst censoring ive seen. The censoring is just a really blinding white circle or oval and whatnot it really took away from many of the fight scenes especially since the first season was uncensored and the 1st episode of the 2nd season was uncensored but for some reason the other 11 episodes from 2-12 were censored...(funimation).... so thats why, Minus all of that its good during fight scenes and some other stuff i cannot mention cuz their spoilers.\\n\\n\r\nSound- Ima give this a 9/10 i prefered the op and ed of the second season alot more then the first. The 2nd season has a powerful opening theme from the start of it just a great op and the ending theme is good as well the ost is good certain themes catch your attention to where you just stop to watch and listen just good overall.\\n\\n\r\nCharacter- You get the same characters from the previous season along with many more characters for the second season some characters from the first season arent in the second but thats not important. The characters are good from main to side you also see satellizer's worst fear *spoiler sorry but they show him as a child during season one. To get back to the point many characters i wished they were showcased more in anime which they really didnt do all that well. A good character roster but kinda fails on making us care about some of the new characters which indeed kinda sucked and fell flat but it doesnt take away from utilzing the characters for the amount of time they had.\\n\\n\r\nEnjoyment- 8/10 i enjoyed it probably more than the first season but i didnt think it was better than the first season mainly because the ending seemed kinda rushed and theirs no sign of a 3rd season although i enjoyed it quite a bit some things they did with this anime's second season was just plain bad but the story was compelling enough it gave suspense and wonder and this time around you genuinely feel emotionally attached to certain characters based on who they are and what they perceive. \\n\\n\r\nLikes- Story, Fight scenes, All the music, More characters & more enjoyable characters, attachment with certain characters, \\n\\n\r\nDislikes- Censoring, The use of the main character towards the end & in the end, Pacing was to fast towards the end.\\n\\n\r\nOverall- i am being really generous with this score an 8/10 i enjoyed everything enough to give it that score even if it was uncensored it would still receive an 8. The pacing is really what makes this season not as great as what it should have been and thats what it all comes down to it did everything right aside from cesnoring but the story was not perfectly executed it had alot of potential but 12 episodes didnt give it justice if it were extended to about 14 maybe the outcome would be different. Freezing as a whole is a super underrated anime that doesnt get enough love. Although i loved it i wouldn't recommend it to everyone both seasons that is.",
            "date": "2015-04-07T15:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 185080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4511312.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joel-Baxter",
                "username": "Joel-Baxter"
            },
            "url": "https://myanimelist.net/reviews.php?id=185080"
        },
        {
            "content": "What is Aoi Kazuya doing here?\r\nHe was annoying in the first season, but he had something resembling an arc. He was a terrible character, but he was a character. Here, he’s an empty shell that does nothing. There are episodes where he hardly appears and he contributes nothing to the climax. Remove him, and the only thing that will go away are the two worst episodes.\r\nFreezing always had a funky relationship with sexualized violence. It boasts some of anime’s sexiest characters, but isn’t it more fun to see them swing their cool weapons with swooshing backgrounds? This could have been a really fun series aboutwarrior women. In fact, that’s what it is at its best. I don’t mean this in the pseudo-feminist, give a woman a gun and she’s strong way. There’s a big cast of female characters, each with her quirks and potential to be fun. Talk about fanservice all you want, but here the women are the leaders instead of sexual options.\\n\\n\r\nAlong comes Kazuya though, and a funny attempt to bring us to the dark ages. Satellizer’s story had to come to a close, but the way it did was disgusting. There is putting a woman in a weak position, and there is letting the camera linger on her breasts as the rapists fondles it.\\n\\n\r\nThis is what people criticize about Game of Thrones. It’s not the presence of violent sexuality that’s the problem. It’s the way it’s presented on the screen. Satellizer’s sexiness didn’t need to be emphasized during her moments of abuse. There is nothing sexy about a man raping a woman. Our dear rapist is also given a position of power so solid it makes no sense. A lot of sexual harassers are sexually attractive. It’s that quality that enables them to continue. Yet, women have a limit. Some women may forgive you for a little harassment if you look like Justin Timberlake, but Holly Rose’s devotion was completely unbelievable.\\n\\n\r\nIt’s not connected to something in her personality. If there was something in her psyche that made her forgive such behavior it’d develop both her and the rapist, telling us what kind of women he’s into. She’s devoted to him just to make the situation harder for Satellizer. This is no longer pushing characters to the edge and seeing how they react but abusing them for the audience’s pleasures. No one has yet put a good argument for how rape can be a decent of form aestheacized violence. All I could see was the strings behind Holly Rose, and all I wanted was to grab her hand and run away with her to a world where there are no Novas and teenagers don’t have to join any military.\\n\\n\r\nI can dream, can’t I?\\n\\n\r\nIt gets a little better once you move beyond that and to the other characters. Vibration is more ambitious than its predecessor. There are more characters, more of them are important to the plot, the story is more about people against people rather than humanity vs. an unknown enemy and the fanservice is often forgotten.\\n\\n\r\nSo long as Vibration stays ambitious, it’s a lot of fun. Like Date A Live, though, we see another case of good ideas remaining undeveloped because the creators are too afraid to break the chains.\\n\\n\r\nThere is an interesting story here somewhere about how we get lost trying to save humanity. It’s a good topic, considering the series feels like another response to Evangelion. By the time Vibration reveals its main theme, it reaches a climax that aside from being huge has no direction.\\n\\n\r\nYou don’t expect a cozy climax from this, and the climax shouldn’t be. It’s a series built on visuals, but it can’t ride on it completely. You need to focus. You need to decide what you’re trying to do and make sure every thing points to it. Vibration decides to be a drama, which is a great change from the first season. It’s not sure what’s the dramatic core it revolves around.\\n\\n\r\nMaybe this mess could have been excused if they put more effort into the charactrization. There is humanity and personality lurking beneath all these great looks. These great looks actually help attract attention to the people beneath the skin. [i]Freezing[/i] boasts a very sexy character design – something I will elaborate in a different essay – but it’s also creative.\\n\\n\r\nThey don’t just stick boobs on women. There is attention to the whole body structure that will look good. There is also variety in the facial expression and hairdos. This is not the dullness of Sekirei. The personalities that are hinted at are varied enough – Cassie is warm and accepting. Elizabeth is an uptight, judgemental moralist. Rana takes everything lightly and remains unaware of what’s around her. Roxanne is down-to-earth. Amelia is a well-intentioned girl who came from nothing and is afraid of returning there.\\n\\n\r\nThe series never takes advantage of this varied, charismatic cast. Most of the character development is handled by the voice actors. The script is too busy moving the plot forward. It doesn’t give us enough moments that show us how they feel and react to everything. Things happen everyday, everywhere. The only thing that grants them meaning is how people perceive them, and isn’t art and entertainment a way to examine various viewpoints?\\n\\n\r\nThe big climax is solved not by realizing how strong you are, but by the characters coming to a realization. That’s great. The creators decided to take the hard way out and not prove that one side was right via violence. I can’t stress how important this is. If the hero chops up the bad guys to pieces perfect for grilling, it doesn’t prove he was morally right. It proves he was stronger. By the time the big epiphany comes, the characters are wasted. So even if the idea was good in theory, it doesn’t offer much in the execution beyond not succumbing to cliches.\\n\\n\r\nHow exactly this failure happened is a mystery. Chop the two episodes where they ruin Satellizer, chop the occasional moment of fanservice and you’re still left with plenty of time. Maybe they were just insecure. Maybe the creators were so busy not succumbing to cliches that they forgot to develop the good stuff. It ends up being defined more by lack. When you view the glass as half empty, it’s a sign of pessimism.\\n\\n\r\nThere are fun moments, and there are cool ideas to borrow if you’re writing your own story. Overall, though, it’s a series that tries more to avoid being cliched than developing its unique ideas. It wins the award for sexiest character design, but I can’t help but wish for a little more. I would have forgiven more fanservice, or more Kazuya if the cost was learning more about Amelia, Cassie, Roxanne and all the rest.\\n\\n\r\n2 mutations out of 5",
            "date": "2015-06-20T03:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 190707,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4632480.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheBrainintheJar",
                "username": "TheBrainintheJar"
            },
            "url": "https://myanimelist.net/reviews.php?id=190707"
        },
        {
            "content": "When I finished Freezing I was kind of disappointed and was all \"So.... what happens next? *looks around and sees \"Freezing Vibration\"* WHAT?!\r\nSo I clicked on it and I lit up with happiness because I was very sad that there was no backstory on Satellizer el Bridget. I was AMAZED. The amount of detail they went into of getting to know each and every character that you saw is outstanding. You actually get to SEE how each character grew up and why they are who they are.\r\nThe story in itself is very different from its predecessor \"Freezing\", so don't expect to be seeing boobies flyingleft and right. It's a huge change from what you might think it is but you won't be disappointed, because it's very story driven and the action comes at you like a slap to the face from your girlfriend who just caught you cheating with her best friend. \\n\\n\r\nI would STRONGLY recommend watching Freezing and Freezing Vibration back to back so you get the full experience and story",
            "date": "2015-10-27T10:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 202094,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4935850.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/monkeyplaysbass",
                "username": "monkeyplaysbass"
            },
            "url": "https://myanimelist.net/reviews.php?id=202094"
        },
        {
            "content": "This is one of the few animes that right off the bat I will say, don't watch this unless you read the manhwa. The reason for this is that some necessary background to make this anime enjoyable is omitted and can only be found in the manhwa. Another failing point of the anime is that it doesn't have the same pacing  or character development that the manhwa does, it feels less plot driven than it's source material. That being said, apart from the content added for the anime version the plot is astoundingly high quality for this genre, the CGI is well done andthe anime sticks very close to the manhwa. A few notes on how to make this a more enjoyable experience:\\n\\n\r\n* skip the extra fanservice added by the anime it feels forced and makes things less enjoyable.\\n\r\n* read the manhwa first, specifically vol. 7 - 14 which this season covers, this anime can be a bit fast paced and confusing otherwise.\\n",
            "date": "2014-11-01T20:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 167091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ILOVEPIEAMS",
                "username": "ILOVEPIEAMS"
            },
            "url": "https://myanimelist.net/reviews.php?id=167091"
        },
        {
            "content": "When i first watched freezing's first season, i was really hooked for see what are going to happen next, it somehow attached me, probably i was wishing for more events involving satellizer, kazuya and rana, since they are funny to watch and  in the first show. After the announcement of Freezing vibration, i was kinda happy to see what is that about and expectating new things and also new interesting events to happens just like few events in the first show. But after completing the series....i was very disappointed by how freezing vibration turned out. In other words, i can freely say that Freezing(2011)is superior than Freezing Vibration. I have a lot of things to say in this review and about this anime so lets start to the point shall we?\\n\\n\r\nStory: 4/10\\n\r\nLets start with the weakiest part of the show that are the story. It happens some time later after the first season. Chevalier concluded that most of the Nova assaults are causing many loss of pandoras that they can even produce. For fix this, a certain project starts called E-Pandora(Evolution Padora), that consists in giving powers to normal humans in order to turn them into pandoras aswell. In order to help with experiences  and developing the E-pandoras, most of the pandoras around the world is invited to come to the alaska in the base of the project for help. Satellizer, Kazuya and Lana aswell are invited for it but they soon manage to discover some secrets of the e-pandora's project as they lives some dark events around it. Well....about the story....it have decreased a lot in terms of enjoyment. The first season was building a good plot with a gripping atmosphere and certain interesting events that the second season could have turned it better but the e-pandora arc is not really interesting. Few episodes saved the anime for being bad but yet the story doesn't really impressed me. I have see a lot of animes with that nakama feeling with emotional themes that had sucess in transmit it just like One piece, fairy tail(but i think FT just overruse it that nakama thing) and etc. I have feeling that freezing vibration tried to do that, showing about how much of the e-pandoras cares about theirselves and her friends, but for be sincerity, in the sad scenes, i don't feel sorry for them because i didn't find they interesting in point of having me locked into them(i will explain more about it in the character section).The Fights are not so good as the first season, they are somehow rushed and skipped a lot for show other scenes, something that really disappointed me since freezing had some good fights before, i was expectating to see more good fights in this season aswell but i couldn't see, there are some fights involving pandoras but they are not interesting to see, you will just see and wish it for end quickly for how boring it is. In the first season, it was good to see pandoras fighting against novas and how epic were the effects during the fight scenes, but this second season don't have any fight involving novas(only more near of the end but i can't tell since it would be spoiler) but is very quickly, decreasing the excitment. Other thing i want to make sure is i readed freezing manga and i already saw how the e-pandora arc is in the manga and i can say...is so much better and amazing than the anime. Its somehow more deep and dark with a lot of interesting contents and more explained things. In other words, i can say in the story, Freezing vibration had a mediocre adaptation, with a lot of unexplained things and skipped information that decreased the story in point of becoming a lot of uniteresting and boring. As i said before, few episodes saved the anime like episode 6-7 and the last 2 episodes that turned the anime slighty interesting, yet the story is still awful duo the bad adaptation, becoming unmotivating to keep watch.\\n\\n\r\nArt: 7/10\\n\r\nNothing to say about it, is the same animation since Freezing 2011, with some few changes in the visuals and effects. New changes would increases the quality of the anime but meh is still a good animation.\\n\\n\r\nSound: 6/10\\n\r\nThe sound decreased it a little in terms of OP and ED, is not really memorable, those are OK OP and ED, you will just hear but won't remember or feel like hearing it again. Yet the Orchestral and Piano OSTs of Freezing vibration are still so epic to hear.\\n\\n\r\nCharacter: 5/10\\n\r\nIn terms of character, i have to say that is slighty better than the original Freezing. Now there is more characters that somehow fits with the story and the events around it or got more attention than the first season like roxanne, ticy, cassie, chiffon, Elizabeth, Amelia and etc. They are eh...OK characters, not exactly memorable, they are like just for fit their hole in the anime, not like will make any change to the story, there few ones that really will change everything in the story or how the things will go. Satellizer, Kazuya and Rana are back, they are exactly the same, won't change anything, but Satellizer gets a little more of development, becoming a slighty better character but yet i really don't liked how OP satellizer be, i know she don't like giving up but we can give too much protagonism on her. Well, Duo the rushed adaptation, i will say a problem that appears aswell in Black Bullet. For a lot of content and information being skipped and unexplained, you won't know many things about the characters, in other words, in case of something happens with them, you won't really care for them because you think of them like just a support for help the protagonists and if they die, won't make difference. This is not a problem of the manga, and yes of the anime. A ongoing manga(with more than 30-50 chapters) cannot have only 13 episodes, because it will be very rushed and less enjoying. Characters that would be memorable, will be eh...good but not excitting characters that you will always remember. Nowdays animators think less information and more action makes something good. =/\\n\\n\r\nEnjoyment: 5/10\\n\r\nThe Ecchi/Fanservice decreased a little, giving some more focus in the story that still comes rushed and unexplained, turning it less excitting. i Didn't liked Freezing Vibration too much for having the same mistake as many animes around, bad adaptation. I was expectating more from it since i enjoyed the first season. A lot of things decreased principally the quality of anime in terms of story and sound that before were kinda good but it have fall.\\n\\n\r\nOverall: 5/10\\n\r\nFreezing Vibration, for most mediocre it is, you have to watch or you won't catch to the story, and also you will do not understand anything if Freezing have future seasons. Is not really good as the first season and also not very enjoyable because the excitment have decreased for anime that don't bring anything new  or something to lock us into the series.\\n\r\nPros:\\n\r\n+Good Animation/Soundtracks\\n\r\n+Some Characters got their respective attention/They have good roles in the series.\\n\r\n+Amazing Visual Effects\\n\\n\r\nCons:\\n\r\n-Bland Rushed and Unexplained Story\\n\r\n-A lot of Skipped Informations\\n\r\n-Not All characters got developed\\n\r\n-Less Excitting Scenes\\n\\n",
            "date": "2014-11-05T06:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 167493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4226635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LoneNinja123",
                "username": "LoneNinja123"
            },
            "url": "https://myanimelist.net/reviews.php?id=167493"
        },
        {
            "content": "SCORING\r\nstory: 7\r\nart: 7\r\nsound: 8\r\ncharacters: 7\r\nenjoyment: 1\r\noverall: 1\r\ngreat math right? from story to character has good scores. but the overall rating just \"1\"?. Let start this right away. I'm not good at reviewing and I'm not a passionate reviewer. But because I want someone to know what I feel about this anime(2 or 3 readers is okay). I just can't help myself to make a  a review. \r\nHERE->\r\nDirector:- woah! the season 1 is a huge success. So come here my fellow staff and lets make the season 2 to to be original and unique. \r\nIdiot staff:- yehey!!! that was a good idea. hooray!!!. (idiots arelaughing and happy)\\n\r\nDirector:- here's the idea. lets forget some of the manga and make our own. \\n\r\nIdiot staff again:- yehey!!! you're a genius director. (idiots are clapping)\\n\\n\r\n(POSSIBLE SPOILER)\\n\r\nso here's were it all the toilet start. \\n\r\nI'm very excited to start the season 2 right away. after watching the s1 last night. I did a marathon this early morning. The first 5 episode of s2 was fine and interesting. and a little bit dark. dark and sad. But I wondered when the MC appears again cuz he's being left behind no more screen time. this is Harem-ecchi right? why the main male lead has no screen time for 5 episodes? it's almost half the time of the series. \\n\\n\r\nepisode 6. Yehey! finally see the baby MC to bring us some man sided plot (male viewers are happy). Too bad, our hopes are fallen. The story is very disturbing. still no time for MC. everything is tragic.\\n\r\nHAVE YOU SEEN THE \"H\" ANIME \"otome dori\"?  this is what it feels like. the arc is very frustrating and disturbing. \\n\r\nthe episode feels like an hour long cuz of it's unbearable scenes. I broke my pillow, I'm very pissed off. \\n\r\ncan you imagine? example. at the party that you're not invited, your GF is there and get drunk. then she just give her body to someone. then you found out secretly cuz you're worried. but in the morning she pretends that theres nothing happened. Isn't it disturbing and disgusting? \\n\\n\r\nLet's go back to the anime. stella is strong and she loves aoi right? why not resist on luois intention? why she just give up?\\n\r\nshit happens. \\n\r\nI love the director in this anime so much. I want to kill him so badly lol :D. \\n\r\nthen to the next episode, I just fast-forward the scenes cuz I lost my appetite and hype on the series until I reached the last episode. still nothing good happen but clicheness. \\n\r\nMC #2 get rage and lost control then because of the power of love of our MC#1. the MC #2  got back to herself. Then end.\\n\\n\r\nGREAT STORY RIGHT? HOW IS IT? is it deserve to have an award?\\n\\n\r\nI know the anime industry should not copy all the original sources. But man? come on? why make it so bad? you need money for the dvd righ? so why the hell should I purchase a trash. it's a trash + can + toilet :D\\n\r\n have a nice day everyone. \\n\r\nBETTER READ THE MANGA, FORGET THE ANIME.",
            "date": "2016-10-18T05:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 231989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5499443.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Luuji222",
                "username": "Luuji222"
            },
            "url": "https://myanimelist.net/reviews.php?id=231989"
        },
        {
            "content": "Although i Mustn't comment on other reviews i'll only say that for days i see people  blaming season 2 for being bad so i wanted to write this  review to set things right.\r\nFirst of all about the story. I want to say that it's one of the most beautifull stories i have ever seen for an anime. It had only some gaps in season 2. I give 10/10 for the storyline!\r\nArt: Very beautifull created characters and every each of them with hiw own glamour. 10/10 for art!\r\nSound: Although the music didn't impress me some of the soundtracks where nicely putted in the spotsof the story perfectly!\\n\\n\r\nCharacters: I'll agree with the most that Kazuya was almost MIA at season 2, but that doesn't mean it was fully bad. I liked the substories and the path that the main story took. Only thing i wanted is to see Kazuya more times! 9/10 only for Kazuya!\\n\\n\r\nEnjoyment: 10/10 for an anime that promotes romance-friendship-loyalty to it's all aspects - Fan srvice ofc was top!\\n\\n\r\nIn Overall I give 9/10 with the only mistake that Kazuya wasn't in action so much and he didn't revealed what he can do with his powers!\\n\\n\r\nP.S As far for Chiffon Death i want to say to Manga readers that ofc it let you down cause u had already the image from the manga. For me (i saw only anime) it was a pure moment with  Power. Only gap that they rushed it a little!",
            "date": "2014-03-03T11:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 134579,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491607.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TWHunter",
                "username": "TWHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=134579"
        },
        {
            "content": "tl;dr: For those that loved all of S1, this review may not be as helpful. For those that found S1 to have serious problems, this review may be more in tune with your perspective.\r\nHaving just watched the first season of Freezing, I had high hopes for the second season, since the first ended much better than it started, and I was not disappointed at all. Gone were the socially awkward moments in S1 that had me pausing the video and facepalming. Gone was all the plot armor surrounding the MCs from S1. And gone was a big chunk of the poorly done, shameless Ecchi infavor of some Ecchi related to the actual plot. S2 is a lot darker and grittier than S1, and although it's a bit less action packed in the beginning, it more than makes up for it in the end with a much wider variety of action than S1 had.\\n\\n\r\nFirst of all, the story. The premise of S1 was mere SoL at a magic university, while Vibration starts off with a mission-based premise. It felt much more natural and, though it had less physical conflict at first, the pacing was supremely better in the buildup to the end. This season also focused a bit on a secondary story involving Satellizer that was done fairly well. Both stories going on in Vibration are darker in nature, which was a welcome shift from the rather upbeat and overly happy children from S1. The weakpoint in both main stories going on would definitely be the endings. Endings are make-or-break for me, and I felt that, although they didn't break the story, they could have been done much better.\\n\\n\r\nThe character developments in Vibrations were more varied than S1. Vibration focused on more characters than S1 did and, for the majority of the time, on characters that weren't the MCs. The female MC, Satellizer, still got a fair amount of development, but the Male MC, Aoi, got pretty much squat (he's a pretty boring guy anyways). Overall, I felt the characters to be more believable and making harder choices in this season than the first, especially the secondary characters. They seemed more like real people rather than plot-driven dolls.\\n\\n\r\nNormally, I do not comment on art or sound, but one episode in particular had some... curious design choices. That is all I will say.\\n\\n\r\nOverall, Freezing Vibration provides a much deeper and focused look into the problems plaguing the planet, and focuses more on difficult, meaningful decisions by the cast over the rather silly choices made in S1.  It takes the solid final half of S1 and builds upon it.\\n\\n\r\nP.S. My review may seem a little, perplexing, to some. I feel this may be because the story of the first half of S1 was not to my liking, and most people that would have liked it, may not like the premise of Vibration as much. For those that found all of S1 to be enjoyable, including the SoL at the beginning, the darker tone that Vibration sets right from the beginning will not be as appealing. It's a shame because I feel there are many people who would enjoy Vibration that were completely turned off to the show by S1.",
            "date": "2015-10-22T13:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 201765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486450.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/webM-guy",
                "username": "webM-guy"
            },
            "url": "https://myanimelist.net/reviews.php?id=201765"
        },
        {
            "content": "In the Chevalier's Alaska base is a project to produce more Pandora to combat the dwindling population that currently exists to combat the monstrous and enigmatic Nova. Satellizer, Kazuya, Rana, Elizabeth, and Chiffon are called along with other Pandora to provide data to assist with the project. When project's specifics are brought to light is the cost really justifiable or are the Chevalier going too far? \r\nStory - (9) Freezing Vibration improves story wise in all aspects. While the first season is mostly just hazing, this season brings Satellizer and company into an interesting and at times disturbing story about humanityand just how horrible and monstrous we can be when backed into a corner. It also focuses on the many different characters views and opinions on what it means to be a Pandora. Are Pandora merely tools that should follow what their superiors say? Are they obligated to use their powers to challenge what goes against their morals for the sake of the innocent? Are the few expendable if it means saving humanity? These questions aren't given concrete answers and it's up for the viewer to decide who was right or wrong at the end of all this. Though it doesn't do as well at making arguments for all the characters in motivations as the manga does, it's still pretty compelling.\\n\\n\r\nArt - (8) Freezing Vibration slightly increases art quality across the board for most characters. The new characters are all well designed and even minor Pandora have really nice designs. Just like the first season however I feel far too much of the scenery is too dark and dreary. This helps with the feeling of isolation of Alaska in this season, but even then I would've liked some brighter colors here and there. \\n\\n\r\nSound - (8) Freezing Vibration again has a very nice set of songs. It's ending and opening in particular are both very catchy and awesome.  The themes in the anime are on par with the first season and I really seen no upgrade or downgrade in them.\\n\\n\r\nCharacters - (9) This is really Freezing Vibration really shines. This season introduces the top 5 world ranked Pandora to the cast. Much like the first season. each girl in this season has different reasons for being a Pandora and answers to what it means to be a soldier. They are unique and interesting for the most part. We also get to delve deeper into the characters we already know. Satellizer confronts demons from her past and has noticeably changed from season 1. We get a better idea of who Elizabeth is and what she stands for. Chiffon gets to show how she got to be number 1 in the world. Even Cassie/Cathy shows development from her battle with Satellizer at the end of season 1. \\n\\n\r\n- Few Notes here\\n\r\nUnfortunately the majority of the characters shown in season 1 aren't in season 2 at all due to the setting.\\n\r\nKazuya does kind of get the short end of the stick this season, but his relationship with Satellizer does develop. \\n\r\nA certain character's personality is completely different from her manga counterpart this season. Whether this is for better or worse is up to the individual. \\n\\n\r\nEnjoyment (9) - I really enjoy Freezing as a whole and enjoyed season 2 more than season 1. I was never bored and was really invested in the characters and overall conflict. I really thought it was good.\\n\\n\r\nOverall (9) - Freezing Vibration, like most anime that has fanservice, gets overlooked by people who don't even give it a chance. What I watched was an interesting look into Pandora and what they fight for. I liked that Satellizer and Kazuya shared the spotlight with other characters. It's got disturbing scenes in it, but I think that makes it unique. It's a show pushes people's buttons, but in my case I guess they were the right ones. If this show gets a 3rd season I'll be right there continuing the ride.\\n",
            "date": "2015-04-29T02:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 186728,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3441293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LordAura",
                "username": "LordAura"
            },
            "url": "https://myanimelist.net/reviews.php?id=186728"
        },
        {
            "content": "This series is painful to watch, especially compared to the first season.\r\nNo spoilers...\r\nI will be making plenty of comparisons with the first season. However, this is still meant to be a review of this season specifically. The comparisons are only there to illustrate and highlight some of the points I make.\r\nAlso, I highly recommend to watch the first season before considering to watch this one.\r\nFirst off, the art and the music. They were pretty good, like in the first season, and did enhance the experience wherever possible. They're not really exceptional either.\r\nBut the writing, oh dear... This series was confusing and tiresome to watch. Beforeexplaining, I'll talk about what made the first season good in my opinion.\\n\\n\r\nThe first season, while being not the most profound or thought-provoking series, was fun and quite enjoyable. In essence, it's an action anime, blended with ecchi that is unsubtle but not overdone, with a rather intimate/romantic vibe. Next to that, it spent some time developing its characters, their background and even its lore to a degree, but subtly, and never becoming complicated or narrating. The show wasn't afraid to bring up some slightly darker themes, but those were never strong enough to throw off the tone either.\\n\\n\r\nThis season's writers somehow manage to mess up to such a degree, that it takes every aspect I mentioned (action, ecchi, character dev, lore and dark themes), and throws them all into the blender with none of the refinement of the original, resulting in a confusing and painful mess.\\n\r\nSo many different aspects are overdone in such a way that you can tell even the writers were confused about what the focus was even supposed to be. The atmosphere is all around the place, going from almost fetish ecchi (on the verge of pornography), to torture and death (but no real gore luckily), to drama, to politics, to even low key biblical references (yes, seriously).\\n\\n\r\nI would guess that this season was mainly supposed to expand on the background of the first season as a military drama of sorts (with a religious undertone?) -at least, that's what I make out of all the major plot points.\\n\\n\r\nHowever, if that's the case, despite ecchi obviously not being highly compatible with the suffering and death that war brings, the writers still didn't want to/couldn't get rid of the ecchi element, which was obviously a defining aspect of the first season.\\n\r\nAnd for some reason, here they decided to take the brakes off; where the first season's ecchi generally had a sort of passionate/intimate context, here it's rather raw, lusty and often fetishised (even the scenes referencing rape that occur seem almost fetishised). I can see that some people may enjoy this, but to me it's a major turnoff. And I don't understand why they thought throwing it in the same mix as torture and death themes was a good idea.\\n\\n\r\nThis series is a mess. It has many contrasting themes going on at the same time. But where in the first season seemingly incompatible elements were cleverly balanced resulting in an all around enjoyable and unique experience, here they all end up pushing against each other and screaming for attention, making this series mentally and emotionally tiring to watch, and thought-provoking nor fun.",
            "date": "2018-02-02T19:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 270469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/warsaberso",
                "username": "warsaberso"
            },
            "url": "https://myanimelist.net/reviews.php?id=270469"
        },
        {
            "content": "TIP: Whenever I say PLOT, I'm talking about ASS & BREAST(aka fan service)\r\nFreezing Vibration, a story of a world that's at war with enemies known as the NOVA, Huge & powerful as they be humanity refuses to kneel to such a threat. Militaries around the world came up with a plan to fight back against the NOVA. The Military in each country has an acadamy for men & women who attend the acadamy to hoan thier skills & become stronger to fight against the NOVA. The women who attend this school are known a Pandoras, a rare being capable of skills to bring aNOVA to its knees to protect humanity. Though Pandoras are powerful, they would be nothing without the aid of their Limiters. The NOVAs are capable to cast a field to FREEZE their attackers in place & also making them supceptible to an attack from the NOVA itself. To counter this, the Pandoras have male partners known as Limiters, the abilites of a Limiter is the same as a NOVA, they are able to cast a field freezing anything in its range. But this ability is normally used to counter a NOVAs freezing to give the Pandora a chance to strike at the NOVA.\\n\\n\r\nYes, this anime is a ecchie & a harem, but the PLOT only seems to revolve around a single male. Normally, that's what a harem is, but in this anime the girls who want to become more then friends are 2 girls with occasional attention from other girls around the school. I'll get into detail in my breakdown review. At any rate this show is anything but bad, it's a interesting & enjoyable watch to those who are ecchie & harem fans. If you can't take nip slips & there I advise not to watch it. But to those who want that & believe me I know what you want or you wouldn't of clicked on this anime to begin with you won't be disappointed.\\n\\n\\n\r\nBREAKDOWN REVIEW: Scoring ranging from 1-10, 1 being dredful\\n\\n\\n\r\n[9]STORY: Don't let the over-top action fool you or the PLOT keep you in a trance. They actually has some substance to it, meaning there's actually an interesting point to the story. It kinda resembles an average high school. Students fighting among each other but coming together when they face a hurtle they cant defeat alone.\\n\\n\r\n[8]ART: The art in this anime is very good & an on par with a lot of other popular animes. You'll notice throughout each episode when clothes start become revealing or torn the detail tends to pop a little more making you focus primarily on the PLOT...!\\n\\n\r\n[8]SOUND: Sound becomes highten in intimate situations & the music makes all the fights absolutly epic.\\n\\n\r\n[8]CHARACTER: The character I'm going to cover are only 3, because I can't cover all of them.\\n\\n\r\n-Kazuya Aoi- The story seems to revolve around Kazuya. As special he may be he can't help but be stuck in his older sister's shadow because of her sacrifice many years ago. But through self realization he breaks free from her shadow & becomes his own person.\\n\\n\r\n-Satellizer el Bridget- A powerful Pandora who is known as the \"untouchable Queen\" who does not rely on anybody but herself & rather die then admit defeat to anyone & refuses to have a Limiter. Ironic as it may seem she reluctantly meets Kazyuya. Very mean & resiliant at first to Kazyuya she evenually warms up to him slowly.\\n\\n\r\n-Rana Linchen- A transfer student from a an old world country & who is not aware of certain terms amongst average Pandoras. She only wishes to find her \"destined one\" aka her Limiter. By chance she meets Kazyuya & falls head over heals for him & is convinced that Kazyuya belongs to her NOT Saterllizer, thus forcing Kazyuya into a love triangle.\\n\\n\\n\r\n[9]ENJOYMENT: The show is not a bad watch, with the fan service it actually makes the show even better.\\n\\n\\n\r\n[9]OVERALL: Freezing overall is show worthy of praise for its originality & worth watching if you're really into ecchie & harem with a side of action packed fights.\\n\\n\\n\r\nTo those looking for another ecchie & harem I recommend this show you will not be disappointed.\\n\\n\r\nEnjoy =)",
            "date": "2014-02-21T17:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 133393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3541779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SkitZxX3",
                "username": "SkitZxX3"
            },
            "url": "https://myanimelist.net/reviews.php?id=133393"
        },
        {
            "content": "I'll said that Season One is better than Season Two ! Why? \r\nBecause Season Two show us the story that is more serious and too dark perhaps?Unlike Season One it's friendly and enjoyable but I don't sense any excitement.It's a disappointment as it will you a feeling of dissatisfy after you done watching the series. The storyline is just giving the character more grudges to take on.\r\nIt's just a piece of my mind but Season 1 is better !\r\nNo Offense :D !",
            "date": "2015-04-11T09:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 185386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3876469.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Toyen12",
                "username": "Toyen12"
            },
            "url": "https://myanimelist.net/reviews.php?id=185386"
        }
    ],
    [
        {
            "content": "First off, I will start by saying that I have not read any of the manga nor do I plan to.\r\nFreezing Vibrations, simply put, was very bad. More so, Freezing Vibrations was even worse compared to it's first season which was quite a good show. My main focus in this review will mostly be directed to anyone who has watched the first season.(which I don't know why you wouldn't watch that before watching this...) Let's begin.\r\nStory: 4\r\nThe story never really was this shows strong spot. That said, the first season at least did a fair job at keeping it from being weak. This season,... theyreally dropped the ball. While the exact idea of the plot wasn't bad, it's execution was something of a nightmare. While I would like to go through each episode and beat them down like the wild animals they are, it is taboo to do so in a basic review. I will, however, address the **** storm that was the final episode and warn you about the 6th. \\n\r\n(Possible spoilers) Firstly, the 6th episode led to a moment that could be misinterpreted ENTIRELY. They did a GREAT job at completely misguiding you on a very important event that almost had me quit the show right then and there. When you get there, you will see, and will hopefully remember little ole me warning you now. To add to this episode, it resolved itself in the most insane way.  Just everybody acting like nothing really happened. I just couldn't believe it!\\n\r\nNow for the final episode. So, while the build up to this point was already pretty bad, the phrase, \"They dropped the ball\" simply no longer does it justice. Rather, they took the ball and threw it at you with full intentions of it hitting you in the face and I will say... it will probably hurt. Vaguely put, the last episode could be described as: A character, who was never really hinted to being important, turns out to be pretty damn important and basically becomes Iron Giant Jesus, everything goes black and white, and then a picture of a nebula gets flashed at you. Yeah,..  you'll see...  To top it off, they try to leave you with a cliff hanger by introducing yet another character who looks like three other people in the show. I just couldn't care enough at this point and just wanted it to end. The episode was ironically named \"Shaft of Light\" because we all got handed the shaft.\\n\\n\r\nArt & Sound: 8\\n\r\nIf you saw the first season, the Art was the same. For me, there is nothing to complain about and nothing really special about it either. So, all in all, no worries there. The sound on the other hand was quite swell. I spent most of the last episode listening to it with my face in my hands trying to cope with the pain. It might have actually been the only thing keeping me sane at the time... \\n\\n\r\nCharacter: 2\\n\r\nDespite of all the stories flaws, the characters might have actually been the most disappointing part of this. While I thought that the first season spent a lot of time making Kazuya the \"main\" character, the second season spends most of its time making sure you don't think that. In terms of character development, he has ZERO. I warn you all now, if you wanted him to have any significant part of this story where he did ANYTHING useful, walk away. Now that I think about it, he gets less screen time than most characters in the show. Completely disappointing.\\n\r\nWhile the show does it's best to make him NOT the main character, it can't, FOR THE LIFE OF IT, decide who is. Call me old fashioned, but I like a focused story from a mostly singular perspective and strong development from a MAIN character. The story can't decide who the hell is important and just kills anybody it decides isn't. On top of that, EVERYBODY is crying ALL the time and nobody acts realistically. NOBODY. The weak characters strongly effected the stories progression and ultimately killed entire experience for me.          uuuhhh...\\n\\n\r\nEnjoyment: 3\\n\r\nDo I really have to say it? It sucked. Every corner of every episode was just one disappointment after the other. I powered through in hopes that something would get good but to no avail. While this rating is strongly influenced off the success of its progenitor, which means it is probably receiving a heavier bashing than it deserves, the show was still just... bad.  And I very rarely give below a seven.  \\n\r\nI will say, the action scenes were pretty decent at times. I guess I got some enjoyment out of that maybe.\\n\\n\r\nOverall: 4\\n\r\nI don't think I need to go any further. If you liked the first, I can't imagine you will like this one more. Though, you may not hate it like I did....\\n\r\n...My face still hurts...",
            "date": "2014-03-20T22:53:00+00:00",
            "helpful_count": 66,
            "mal_id": 136291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2969859.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/BeanWack",
                "username": "BeanWack"
            },
            "url": "https://myanimelist.net/reviews.php?id=136291"
        },
        {
            "content": "There’s something that is painfully cold about Freezing Vibration. It’s not the temperature I’m referring to but the fact the show is stone cold in terms of storytelling, characters, and presentation. I tried to remain optimistic about what this sequel could bring because the establishment of season 1. Despite being clichéd and molded with unbalanced characters, the first season at least had some standards on its premise. The way it was orchestrated did not live up to its promise but if you thought Freezing was bad, season 2 is at another level of catastrophe. It’s like an avalanche heading for disaster and eventually buries itselfin this disaster of a continuation.\\n\\n\r\nFreezing Vibration is the direct continuation of season 1 of Freezing, a manga based on the same name written by Dall-Young Lim. If you haven’t seen Freezing yet, then better get to that now if you’re curious about this series. The fact is that you’ll be a bit lost at what’s happening. Therefore, it is highly advisable to watch season 1 of Freezing before venturing on this continuation.\\n\\n\r\nSeason 2 takes off wasting little time with its plot. From the beginning, we meet our three main protagonists Kazuya, Satellizer, and Rana whom seem to be part of an expedition in a very frosty location. It’s soon we find that they were sent there to undertake and be part of an experiment for the “benefit of humanity”. I put this in quotation marks as this will be explained later. But as the plot begins to unfold itself, we find out there’s more than meets the eye especially for what’s going behind the scenes.\\n\\n\r\nThe anime is adapted from the manga as part of the “E-Pandora” arc that introduces many new characters into the show. New characters such as Amelia Evans and Gina Papleton are introduced as supporting characters and part of a project known as “E-Pandora Project”. Other prominent characters such as Chiffon, Elizabeth, and a returning Cassie Lockhart make their way in the show. What do they have in common? Nothing except their rankings in terms of fighting abilities that made the famous throughout the world. Altogether, they are in line to support the latest evolution in experimentation to combat the deadly Novas. That’s at least what they think anyways…\\n\\n\r\nAt the core of the experimentation is a research with extensive knowledge of the Stigmata. We learn throughout the show that the experimentations aren’t as they appear to be especially involving a powerful drug. It’s hard to categorize what kind of drug this is but the effects are malevolent. To make matter worse, there’s a line where E-Pandoras cross before they get themselves hurt. By hurt, I mean real hurt. For this sequel to work with a storyline this, there’s need to be a realization on the history of experimentation (or at least similar cases). Unfortunately, the series explores only its effects on the surface through actual combat. The fighting itself doesn’t hold any promise as most of the fights are one sided. Even when there’s a little glimmer of hope, it goes back to being stale again with predicable circumstances. \\n\\n\r\nThe plot of Freezing Vibration also apparently explores a bit of our main characters in particular Satellizer. We already know that she is nicknamed the “untouchable queen” for a reason in season 1. However, that element is really touched upon (almost in a literal sense…) in this sequel. To say the least, it’s disturbing, ominous, and distasteful to watch considering the relations involved. To make matters worse, it makes little effort in resolving the issue. Sure, there’s the emotions and symbolism that were involved. However, there’s little sense in who to exactly blame. Was it really the perpetrator, Satellizer’s own insecurities of herself, or just nature of humanity itself? It’s also unknown what sort of message it's trying to sent; especially with its odd coordination at the middle of the story. The premise is completely separate from the E-Pandoras or war against Novas itself. It seems like the series is trying to develop characters but rubs it in the wrong way. It’s literally forcing itself at the body of its plot to show the grim reality of Satellizer’s past. It’s excruciating to watch and makes us feel uncomfortable with its delivery.\\n\\n\r\nAt some respects, Freezing Vibration does give many of the characters screen time. Almost everyone gets a little action in whether you’re a Pandora, E-Pandora, or Limiter. Just be aware that the series is a one cour show so don’t expect any characterization on anyone. In fact, we only get a little glimpse at the true visage of a few characters such as Elizabeth and Amelia. Our antagonist of this show named Scarlett Ohara is also stereotypical with the lab coat, cynical personality, and ambition of a researcher just without the mad scientist glasses. With no sense of a personality she is about as stone cold as the freezing winds of Alaska. At various points, I question if the main problem of the antagonist is humanity itself because the E-Pandoras suffers by the products of humans’ inventions. Without them, the E-Pandoras wouldn’t even be there or have to live through a fear of being a human lab animal. \\n\\n\r\nIn terms of aesthetic values, Freezing Vibration does keep up with its science fiction theme well. Characters are designed to look and feel like they are part of the program. Because the show brings out the female dominance of the characters, most of them are designed to look compelling and can handle themselves. In particular, the top 5 Pandoras of the world distinguishes themselves by different nicknames that matches their personalities/abilities. On the other hand, there’s a subtext of cruelty related to the E-Pandoras as we get to see where some of them came from; not literally with background histories but rather what they are fighting for or why they’re there. \\n\\n\r\nSimilar to the first season as well, there’s fan service. It feels odd to see many pool scenes in a cold climate where the experimentations take place. Of course, with a pool filled with hot water can only mean one thing: clothes coming off. In more ways than one, a few of the characters goes on a more daring way to advertise themselves such as Elizabeth or Roxanne. Rana also follows this trend in order to “take advantage of Kazuya”. Oh and speaking of the relationship Rana and Kazuya, there seems to be no progression there as well except for the occasional tease that achieves little results. Similarly, Satellizer still remains unbaptized despite overcoming a crucial obstacle in her life. It’s factors like these that really degenerates the main plot together as viewers may be left with how to feel. In the end, I felt unsatisfied. The way some conflicts are resolved are also questionable with predictable results left with clichéd holes. It’s a cold stone reality and the E-Pandoras doesn’t like it either. \\n\\n\r\nArtistic wise, most of the designs are generic although fits with the overall science fiction theme well. There’s not much change in any of the main characters’ designs although a few of the new Pandoras introduced give them a distinguishing appearance. These include the scarlet hair of Roxanne, the short stature of Charles, or the glamorous figure of a nude Elizabeth Mably. On the contrary, we don’t get to see a lot of Novas in this season as the show focuses on the E-Pandoras so it’s hard to tell if they underwent significant changes. The setting of this season goes well with its style though in the cold climates of Alaska. The freezing snow depicts the cruelty of the experimentation and the reality of E-Pandoras like the frozen winds.\\n\\n\r\nSoundtrack isn’t entirely impressive but is tolerable enough. Music director Masaru Yokoyama returns for his role and does a standard job. The OST is only tolerable at best during the action scenes and less so during emotional subplots. The choreography of the action scenes rises above the standards though especially for moves such as the rapid Tempest maneuver or Accel Turns. The OP song ‘Avenge World’ balances itself with a sense of science. On the other hand, the ED song ‘Sekai wa Kizu wo Dakishimeru’ is saturated with fan service that makes the sinister style of this season look like a joke.\\n\\n\r\nFreezing Vibration is one of those shows that I only recommend for completion’s sakes or if you want to see what happens after season one. It’s really hard to not feel disappointed after seeing the weak characterization and its mess of a plot. The plot itself also doesn't end well with a rushed conclusion and hinting a possible continuation. There are many inconsistencies related to the E-Pandora arc such as to who to blame or its main purpose. Sure, it might be to save humanity but who is to save the E-Pandoras themselves? Thankfully, the show introduces a diverse amount of characters that fans might get accustomed to along with some intense action and feuds. But ultimately, Freezing Vibration doesn’t live up to its name. If Freezing is a prototype, then Vibration would be the defection. Clearly, evolution is NOT the solution.\\n\\n\\n",
            "date": "2013-12-21T05:21:00+00:00",
            "helpful_count": 63,
            "mal_id": 124861,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=124861"
        },
        {
            "content": "As someone who enjoyed the first season of Freezing, I found Vibration to be very disappointing for several reasons, but first I will cover the good points of this series.\r\nStory - (Synopsis from Freezing)\r\nThe story hasn't changed, Set in a slightly futuristic world where Earth has been invaded and is at war with aliens from another dimension called the Nova, the story follows the adventures of a Japanese boy named Kazuya Aoi who enrolls for training at a special school for genetically modified girls called Pandoras who battle the aliens, and their male partners, called Limiters, who use a special power called \"freezing\" to limittheir opponent's mobility. The protagonist makes the acquaintance of an unusual older girl named Satellizer el Bridget who appears to be the most powerful Pandora in her class, but has not yet chosen a male partner to be her Limiter, and in spite of the warnings of all his friends, he decides to be her Limiter.\\n\\n\r\nThis isn't your typical School/Romance/Harem in my opinion, it is quite different which actually holds a plot - defeating the aliens combining forces of one female, also known as a Pandora and one male who is called the Limiter; although one boy has a different type of power being the younger sibling of the greatest Pandora to exist, where he can use his 'full' freezing power for anyone he fights with and all the Pandoras fight over him. I rated the story an 8, based upon the two seasons.\\n\\n\r\nArt -\\n\r\nNow for the art, exactly the same as the first Freezing, it is remarkable. The detail put in, each snowflake falling and all the detail put in to the characters, background and the whole surface of it, it's clearly had a lot of time and effort put in and in my own opinion, this is the best part about this season. I rated the Art a 9.\\n\\n\r\nSound -\\n\r\nI didn't find the sound that interesting, it's got the type of opening/ending sound tracks you just listen to once, don't find it catchy and skip it and move on. I rate the sound tracks a 5.\\n\\n\r\nCharacters -\\n\r\nWell, here we go. In my opinion; the character development is the biggest flop of Freezing Vibration; the first season had 3 main characters, Kazuya Aoi, Satellizer el Bridget and Linchen Rana, who had a great back-story and you find out a lot about them all within the first couple of episodes. But, then you come to Freezing Vibration, they have doubled the amount of mains from 3 to 6 and make it confusing; their isn't a big story behind these characters because you are not told much about them, they haven't presented them in the right way and just rushed them into action. Characters - 5.\\n\\n\r\nEnjoyment -\\n\r\nAlthough their are bad things about Vibration, it isn't all bad. It is enjoyable to an extent and does keep you moderately interested, although at points I have felt bored and 'couldn't be bothered' watching. In my opinion, the newer mains annoy me and don't interest me, I would of rather watched the first season again but with more development to the story and what/when Kazuya and Bridget finally become the #1 team.\\n\\n\r\nOverall -\\n\r\nOverall taking all my ratings into account, I rated this a 7.\\n\r\nThe story and art are the best things, like in any anime these are a key necessity for a good show, although the Characters are the biggest let down for me and I'm not too bothered about the sound.\\n\\n\r\nThank you for reading.\\n\r\n~Malteasers",
            "date": "2014-05-08T00:36:00+00:00",
            "helpful_count": 40,
            "mal_id": 142665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3002361.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Malteasers",
                "username": "Malteasers"
            },
            "url": "https://myanimelist.net/reviews.php?id=142665"
        },
        {
            "content": "\"Freezing Vibration\" attempts to pick up where its predecessor left off, at least in some ways.\r\nAs It begins, you are quickly jumped into a relatively new plot, and you quickly find out that the show has little to none relevance to \"Freezing\"\r\nThe Important characters that remain from Freezing are: Satella, Rana, Elizabeth Mably, Chiffron, and and Kazuya.\r\nBut don't misunderstand, The Only people to be considered \"Main Characters\" should be Elizabeth, Satella, and a new character name \"Amelia Evans\"\r\nAlong with this, there is absolutely no character development improvement from \"Freezing\"\r\nStory:1, there is more then one way at looking at this, you could consider the story acompletely new theme, based on a completely different plot, yet keeping the same system from Freezing, for fighting style, etc.\\n\r\nor: It is a side story, with little to no development towards the official plot at all, that is trying to throw new characters at us as an attempt to increase the small fan base \"Freezing\" Originally had.\\n\\n\r\nArt:4 In general, Freezing Vibration had a great art style, and though the pointless scenes where their clothes are ripped from Freezing was slightly aggravating. Freezing attempted to fix this by censoring every 1 of those times with light rays. which in the end was even more aggravating.\\n\\n\r\nSound:8 This was the one spot in the story that wasn't terrible, Freezing Vibration has Great epic battle music, and a great Opening song, which may have been the same thing.\\n\\n\r\nCharacter:3 As my expectations for watching this show were, to see some progression on perhaps the Satella-Rana mini harem, or maybe just some character development in general. 95% of the small character development the show ended up having, was based on completely new characters, completely irrelevant to the first season.\\n\\n\r\nEnjoyment:1 Initially, with shows like Freezing, even with everything else failing, you can sit back, and enjoy the show's Ecchiness through comedy. but in reality, picture this show as a Censored Hardcore Ecchi/harem with absolutely no comedy or Romance, at all! That attempts to WOW you with its irrelevant plot, and boring new characters.\\n\\n\r\nOverall:2 Now, even though I view this show as dreadful, through the power of a good extra song at the end of the show, i decided to bump up the inevitable 1 i was prepared to give it, to a 2.\\n\\n\r\nNote: I watched it while it aired so it was censored, that obviously won't apply to you.\\n\\n\r\n#AnimeX",
            "date": "2015-02-02T09:36:00+00:00",
            "helpful_count": 26,
            "mal_id": 179502,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2935173.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Crim",
                "username": "Crim"
            },
            "url": "https://myanimelist.net/reviews.php?id=179502"
        },
        {
            "content": "This anime is probably one of the worst animes i have ever watched in my entire life.\r\nThe fanservice is forced and is really just useless, the only reason this anime is half worth watching is cause of tits..\r\nThe story is bad, there is nothing else to say.\r\nCharacters is bad as hell to, the main character is strong as hell, but he lets the girl fight until she is half dead before he stops the fight, witch he could have done before it started. For some fucked up reason there is alot of girls that likes him although he is a shit person and a badcharacter.\\n\\n\r\nThe anime is frustrating to watch and i remember forcing myself to not hit the screen multiple times as i watched this, and i basicly only completed it to write a review on it so that as many people will be spared to watch something as trash as this.",
            "date": "2014-11-01T18:56:00+00:00",
            "helpful_count": 18,
            "mal_id": 167079,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3479525.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/InXLnT",
                "username": "InXLnT"
            },
            "url": "https://myanimelist.net/reviews.php?id=167079"
        },
        {
            "content": "Ok, so season 2 has just ended and frankly, hummmm, I basically don't have enough as to what to say about this sequel, so at this point I'm gonna get straight to the point:\r\nStory: Poor 3.\r\nFrankly, there isn't anything new here, it is just them Pandora's with their usual cat-fights and fanservice, and the Novas, just as predicted have appeared in the first episode, flash backs and in the last 2 episodes, let's face it it's just the usual plot, the only consolation here were the addition of a conspiracy thing about the E-Pandora, and a certain Dr. Ohara and some guy who has thesame name of a famous men clothing line called Marks Spencer whom serves as the main antagonists .\\n\\n\\n\r\nArt: Very Good 8.\\n\\n\r\nWhat can I say, I'm a sucker for fan-service, though there are some censoring being done, one only has to wait just a couple of months, co'z other anime viewing site will show it uncensored.\\n\\n\r\nSound: Mediocre 5.\\n\\n\r\nCo'z I have nothing much to say.\\n\\n\r\nCharacter: Fair 6.\\n\\n\r\nUnlike the previous season, were it was a Aoi and Satellizer tandem, here the protagonist roles are divided among Satellizer, Elizabeth, Linchen, Amelia, Chiffon and Cassie,  such distribution of being the main character does provide some consolation since just with Satellizer and Aoi hogging the limelight would prove to be boring. However, it was disappointing that Aoi as a limiter was more like a supporting role and so as most of the limiters in this anime whom are more like cameo than anything else, only Elizabeth's limiter, Andre kinda who has  outshined the limiters. Frankly , studio A.G.C.T has put more emphasis on the antagonist like  Scarlett O'hara, Marks Spencer, Louis El Briget and the Chevaliers than the protagonist. Tbh, I'm a bit disappointment at Aoi for not getting banged either by Satellizer or Rana.  \\n\\n\r\nEnjoyment: Good 7. \\n\\n\r\nWell, the fan-service, cat-fights, the battle with the unknown Nova, the dramatic moments and the part where the antagonists got what they deserve, were enjoyable enough, but I'm putting more on the fan-service than anything else.\\n\\n\r\nOverall: Fair 6.\\n\\n\r\nThough, the plot was still the usual and there is that melodramatic thing in it, I just don't thing that this anime deserves a high score, besides, I can never understand why Aoi never get baptize (or banged) either by Satellizer or Rana from the last episode of season 1.  \\n\\n",
            "date": "2013-12-21T00:07:00+00:00",
            "helpful_count": 17,
            "mal_id": 124843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=124843"
        },
        {
            "content": "First off i'll just say that, well I stopped this one short, I just couldn't handle it. I can force myself to finish off an anime, even if I do not like that anime, but for this one I just couldn't. Even if their clothes do get ripped off in almost every scene.  \r\nI wrote this, from watching the first season, to watching this season up until episode 10, hopefully you did the same, but actually finished this season. \r\nIf you want an actual review with the reviewer actually watching all of it (12/12 ep.) then feel free to skip this. For those ofyou who actually take the time to read this, thank you. \\n\\n\r\nStory 5/10 (Well let's just dive right into it~)\\n\r\nI simply just did not like the story plot in this season, at all. First they tell you where they are and why they are there, sort of, but I don't understand the sudden, weird, awkward switch of settings from season 1, for I liked the school life... Anyways, probably the biggest reasons why I found Freezing Vibrations story to be so, \"meeehhhhh\" is simple. (spoiler) They somehow found a way to sort of forcefully bring Satellizer's past back into this season. Whiiich I wouldn't have minded, if not for the, smooth yet very, very, very awkward transition into it. What I mean by that is, you're going to just let the lead characters go off into their own world, right in the middle of the story??? That honestly just blew my mind, plus I felt like Satellizer's past was rushed and not thought of carefully. Okay, I'm probably being a bit rough on this, (already...) but don't get me wrong I did enjoy watching the tidbits of good story to Freezing. If they would have made the characters face the actual problems at hand, and not have so many little side details that didn't matter come up and in the way, the story would have been much, much better. \\n\\n\r\nArt 6/10 \\n\r\nI'm not usually too knit-picky when it comes to art, but Freezing doesn't come up to par with some of the other anime from it's year/years. Overall standard animation. \\n\\n\r\nSound 6/10\\n\r\nFor sound, I'm usually not to picky either. There are a few points I'm looking for, a nice opening/s and ending/s. If the anime doesn't have these I don't mind, but if I hear the same ost for a few scenes over I do get a bit annoyed. Freezing did fine when it came to that.  Also, the voice acting was quite, \"OK\" I liked the sound of their voices a majority of the time. \\n\\n\r\nCharacter 3/10 \\n\r\n\"Why such a low score for this!?!?\" Is what a friend of mine said, and here is what I had to say. In Freezing Vibration, they spent FAR too much time on the small, supporting, never to be seen again characters. I would have liked to see some more character development on the  characters from season 1, you know the ones who won't die off. And I do say that the main Heroines, did get some attention, but honestly it's not the type of attention I wanted. When the characters \"grew\" closer together, I just felt super awkward, like AWKOTACO awkward. Satellizer is the main bad-ass in this series, I just felt like she got weak, (spoiler, she did) and seeing a main heroine go bipolar all over the place is sort of distorting. \\n\r\nThe overall fighting was pretty good, I get a bit confused on what they are saying from time to time, but the individual characters are good at stating the facts about themselves and the current battle situation. \\n\r\nThe characters, to me just... They felt so one-sided, not fake but on the verge of just being to predictable. Even if the main characters did get more time, I feel like it would be for nothing, since from the start, they were sort of brought up, only to just \"be there.\"\\n\\n\r\nEnjoyment 4/10\\n\r\nIt's not like I didn't enjoy Freezing Vibration, it's just that saying, \"I like this season!\" Is too far fetched. Granted the clothes randomly ripping did make me laugh out loud from time to time, but less of that and more on things that actually mattered would have been great. I mean especially since they want you to sort of take this series seriously, but how can you and I take a battle serious when we see boobies everywhere? My enjoyment for this season would have been higher if the plot and the character's weren't so predictable, cliche and awkward. Seeing on how I just randomly dropped this on episode 10. Probably means that I just lost all interest in it.  Honestly I'm being a bit nice on this end. The only thing that kept me going stronk, was Satellizer.\\n\\n\r\nFinal Verdict 4.\\n\r\nI don't really recommend this to anyone, unless you're into ecchi and just want to watch a bunch of girls fight. From the first season to the second (this one) season there was a huge drop of detail and work done on the story and the characters. Not a horrendous watch, but plenty out there that can fill this ones place.",
            "date": "2015-07-30T00:41:00+00:00",
            "helpful_count": 14,
            "mal_id": 194682,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4710550.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SunZun",
                "username": "SunZun"
            },
            "url": "https://myanimelist.net/reviews.php?id=194682"
        },
        {
            "content": "Some people have asked themselves, what is hatred? Where does it come from?\r\nWell allow me to clarify those things as best I can.\r\nHatred is a means for one to obtain power quickly while rendering himself blind in the process. It is born from the sins of humanity and it is also the responsibility of\r\nhumanity to pay for those sins.\r\nThe second season of Freezing presents  evolves around a research center in Alaska where the protagonists travel as part of their orders. New faces are revealed, old ones stand in the spotlight once more as restlessness and conflict grips the facility.\r\nNot only does the artwork reflectthe amount of fanservice of this series, it also puts the objects ofthe fanservice on the foreground. As such there are few background scenes that will amaze you.\\n\\n\r\nSoundtracks are made mainly to back up the suspense , the fighting scenes or the emotional moments of the series and are done in a good fashion.\\n\\n\r\nCharacters have numerous personalities each with it's own reasons and ways, something uncommon these days. These many ways to be specific to one character each decrease the level of predictability of the series.\\n\\n\r\nOverally I enjoyed the series since the fanservice mostly blends in with the story. However the message is a strong one and it is one worthy of remembrance.",
            "date": "2013-12-21T05:30:00+00:00",
            "helpful_count": 13,
            "mal_id": 124863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=124863"
        },
        {
            "content": "This is a review on Freezing's 2nd season Freezing vibration Thanks for reading time for the review likes and dislikes but first the categories.\r\nStory- 7/10  I liked the story but it wasnt as good as season one but without trying to compare it, it was good to say the least it had many ups the fights incorporating into the story the sci fi which you get in basically every episode it kinda moves away from the romance part towards the end and is more like friendship stuff  by the end but whatever a good story but, the main arc seemed really rushed towardsthe end and it left you feeling unsatisfied by the ending it seems to give you the rushed feeling and the feeling of wanting more and probably a 3rd season there isnt really a cliff hanger but it seems to indicate a 3rd season. All in all good not great but good. \\n\\n\r\nArt- Same as the previous season so it is decent nothing out of the ordinary but the biggest problem they did with the 2nd season is censoring the fan service scenes which was so badly done but not the worst censoring ive seen. The censoring is just a really blinding white circle or oval and whatnot it really took away from many of the fight scenes especially since the first season was uncensored and the 1st episode of the 2nd season was uncensored but for some reason the other 11 episodes from 2-12 were censored...(funimation).... so thats why, Minus all of that its good during fight scenes and some other stuff i cannot mention cuz their spoilers.\\n\\n\r\nSound- Ima give this a 9/10 i prefered the op and ed of the second season alot more then the first. The 2nd season has a powerful opening theme from the start of it just a great op and the ending theme is good as well the ost is good certain themes catch your attention to where you just stop to watch and listen just good overall.\\n\\n\r\nCharacter- You get the same characters from the previous season along with many more characters for the second season some characters from the first season arent in the second but thats not important. The characters are good from main to side you also see satellizer's worst fear *spoiler sorry but they show him as a child during season one. To get back to the point many characters i wished they were showcased more in anime which they really didnt do all that well. A good character roster but kinda fails on making us care about some of the new characters which indeed kinda sucked and fell flat but it doesnt take away from utilzing the characters for the amount of time they had.\\n\\n\r\nEnjoyment- 8/10 i enjoyed it probably more than the first season but i didnt think it was better than the first season mainly because the ending seemed kinda rushed and theirs no sign of a 3rd season although i enjoyed it quite a bit some things they did with this anime's second season was just plain bad but the story was compelling enough it gave suspense and wonder and this time around you genuinely feel emotionally attached to certain characters based on who they are and what they perceive. \\n\\n\r\nLikes- Story, Fight scenes, All the music, More characters & more enjoyable characters, attachment with certain characters, \\n\\n\r\nDislikes- Censoring, The use of the main character towards the end & in the end, Pacing was to fast towards the end.\\n\\n\r\nOverall- i am being really generous with this score an 8/10 i enjoyed everything enough to give it that score even if it was uncensored it would still receive an 8. The pacing is really what makes this season not as great as what it should have been and thats what it all comes down to it did everything right aside from cesnoring but the story was not perfectly executed it had alot of potential but 12 episodes didnt give it justice if it were extended to about 14 maybe the outcome would be different. Freezing as a whole is a super underrated anime that doesnt get enough love. Although i loved it i wouldn't recommend it to everyone both seasons that is.",
            "date": "2015-04-07T15:46:00+00:00",
            "helpful_count": 12,
            "mal_id": 185080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4511312.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Joel-Baxter",
                "username": "Joel-Baxter"
            },
            "url": "https://myanimelist.net/reviews.php?id=185080"
        },
        {
            "content": "What is Aoi Kazuya doing here?\r\nHe was annoying in the first season, but he had something resembling an arc. He was a terrible character, but he was a character. Here, he’s an empty shell that does nothing. There are episodes where he hardly appears and he contributes nothing to the climax. Remove him, and the only thing that will go away are the two worst episodes.\r\nFreezing always had a funky relationship with sexualized violence. It boasts some of anime’s sexiest characters, but isn’t it more fun to see them swing their cool weapons with swooshing backgrounds? This could have been a really fun series aboutwarrior women. In fact, that’s what it is at its best. I don’t mean this in the pseudo-feminist, give a woman a gun and she’s strong way. There’s a big cast of female characters, each with her quirks and potential to be fun. Talk about fanservice all you want, but here the women are the leaders instead of sexual options.\\n\\n\r\nAlong comes Kazuya though, and a funny attempt to bring us to the dark ages. Satellizer’s story had to come to a close, but the way it did was disgusting. There is putting a woman in a weak position, and there is letting the camera linger on her breasts as the rapists fondles it.\\n\\n\r\nThis is what people criticize about Game of Thrones. It’s not the presence of violent sexuality that’s the problem. It’s the way it’s presented on the screen. Satellizer’s sexiness didn’t need to be emphasized during her moments of abuse. There is nothing sexy about a man raping a woman. Our dear rapist is also given a position of power so solid it makes no sense. A lot of sexual harassers are sexually attractive. It’s that quality that enables them to continue. Yet, women have a limit. Some women may forgive you for a little harassment if you look like Justin Timberlake, but Holly Rose’s devotion was completely unbelievable.\\n\\n\r\nIt’s not connected to something in her personality. If there was something in her psyche that made her forgive such behavior it’d develop both her and the rapist, telling us what kind of women he’s into. She’s devoted to him just to make the situation harder for Satellizer. This is no longer pushing characters to the edge and seeing how they react but abusing them for the audience’s pleasures. No one has yet put a good argument for how rape can be a decent of form aestheacized violence. All I could see was the strings behind Holly Rose, and all I wanted was to grab her hand and run away with her to a world where there are no Novas and teenagers don’t have to join any military.\\n\\n\r\nI can dream, can’t I?\\n\\n\r\nIt gets a little better once you move beyond that and to the other characters. Vibration is more ambitious than its predecessor. There are more characters, more of them are important to the plot, the story is more about people against people rather than humanity vs. an unknown enemy and the fanservice is often forgotten.\\n\\n\r\nSo long as Vibration stays ambitious, it’s a lot of fun. Like Date A Live, though, we see another case of good ideas remaining undeveloped because the creators are too afraid to break the chains.\\n\\n\r\nThere is an interesting story here somewhere about how we get lost trying to save humanity. It’s a good topic, considering the series feels like another response to Evangelion. By the time Vibration reveals its main theme, it reaches a climax that aside from being huge has no direction.\\n\\n\r\nYou don’t expect a cozy climax from this, and the climax shouldn’t be. It’s a series built on visuals, but it can’t ride on it completely. You need to focus. You need to decide what you’re trying to do and make sure every thing points to it. Vibration decides to be a drama, which is a great change from the first season. It’s not sure what’s the dramatic core it revolves around.\\n\\n\r\nMaybe this mess could have been excused if they put more effort into the charactrization. There is humanity and personality lurking beneath all these great looks. These great looks actually help attract attention to the people beneath the skin. [i]Freezing[/i] boasts a very sexy character design – something I will elaborate in a different essay – but it’s also creative.\\n\\n\r\nThey don’t just stick boobs on women. There is attention to the whole body structure that will look good. There is also variety in the facial expression and hairdos. This is not the dullness of Sekirei. The personalities that are hinted at are varied enough – Cassie is warm and accepting. Elizabeth is an uptight, judgemental moralist. Rana takes everything lightly and remains unaware of what’s around her. Roxanne is down-to-earth. Amelia is a well-intentioned girl who came from nothing and is afraid of returning there.\\n\\n\r\nThe series never takes advantage of this varied, charismatic cast. Most of the character development is handled by the voice actors. The script is too busy moving the plot forward. It doesn’t give us enough moments that show us how they feel and react to everything. Things happen everyday, everywhere. The only thing that grants them meaning is how people perceive them, and isn’t art and entertainment a way to examine various viewpoints?\\n\\n\r\nThe big climax is solved not by realizing how strong you are, but by the characters coming to a realization. That’s great. The creators decided to take the hard way out and not prove that one side was right via violence. I can’t stress how important this is. If the hero chops up the bad guys to pieces perfect for grilling, it doesn’t prove he was morally right. It proves he was stronger. By the time the big epiphany comes, the characters are wasted. So even if the idea was good in theory, it doesn’t offer much in the execution beyond not succumbing to cliches.\\n\\n\r\nHow exactly this failure happened is a mystery. Chop the two episodes where they ruin Satellizer, chop the occasional moment of fanservice and you’re still left with plenty of time. Maybe they were just insecure. Maybe the creators were so busy not succumbing to cliches that they forgot to develop the good stuff. It ends up being defined more by lack. When you view the glass as half empty, it’s a sign of pessimism.\\n\\n\r\nThere are fun moments, and there are cool ideas to borrow if you’re writing your own story. Overall, though, it’s a series that tries more to avoid being cliched than developing its unique ideas. It wins the award for sexiest character design, but I can’t help but wish for a little more. I would have forgiven more fanservice, or more Kazuya if the cost was learning more about Amelia, Cassie, Roxanne and all the rest.\\n\\n\r\n2 mutations out of 5",
            "date": "2015-06-20T03:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 190707,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4632480.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheBrainintheJar",
                "username": "TheBrainintheJar"
            },
            "url": "https://myanimelist.net/reviews.php?id=190707"
        },
        {
            "content": "When I finished Freezing I was kind of disappointed and was all \"So.... what happens next? *looks around and sees \"Freezing Vibration\"* WHAT?!\r\nSo I clicked on it and I lit up with happiness because I was very sad that there was no backstory on Satellizer el Bridget. I was AMAZED. The amount of detail they went into of getting to know each and every character that you saw is outstanding. You actually get to SEE how each character grew up and why they are who they are.\r\nThe story in itself is very different from its predecessor \"Freezing\", so don't expect to be seeing boobies flyingleft and right. It's a huge change from what you might think it is but you won't be disappointed, because it's very story driven and the action comes at you like a slap to the face from your girlfriend who just caught you cheating with her best friend. \\n\\n\r\nI would STRONGLY recommend watching Freezing and Freezing Vibration back to back so you get the full experience and story",
            "date": "2015-10-27T10:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 202094,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4935850.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/monkeyplaysbass",
                "username": "monkeyplaysbass"
            },
            "url": "https://myanimelist.net/reviews.php?id=202094"
        },
        {
            "content": "This is one of the few animes that right off the bat I will say, don't watch this unless you read the manhwa. The reason for this is that some necessary background to make this anime enjoyable is omitted and can only be found in the manhwa. Another failing point of the anime is that it doesn't have the same pacing  or character development that the manhwa does, it feels less plot driven than it's source material. That being said, apart from the content added for the anime version the plot is astoundingly high quality for this genre, the CGI is well done andthe anime sticks very close to the manhwa. A few notes on how to make this a more enjoyable experience:\\n\\n\r\n* skip the extra fanservice added by the anime it feels forced and makes things less enjoyable.\\n\r\n* read the manhwa first, specifically vol. 7 - 14 which this season covers, this anime can be a bit fast paced and confusing otherwise.\\n",
            "date": "2014-11-01T20:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 167091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ILOVEPIEAMS",
                "username": "ILOVEPIEAMS"
            },
            "url": "https://myanimelist.net/reviews.php?id=167091"
        },
        {
            "content": "When i first watched freezing's first season, i was really hooked for see what are going to happen next, it somehow attached me, probably i was wishing for more events involving satellizer, kazuya and rana, since they are funny to watch and  in the first show. After the announcement of Freezing vibration, i was kinda happy to see what is that about and expectating new things and also new interesting events to happens just like few events in the first show. But after completing the series....i was very disappointed by how freezing vibration turned out. In other words, i can freely say that Freezing(2011)is superior than Freezing Vibration. I have a lot of things to say in this review and about this anime so lets start to the point shall we?\\n\\n\r\nStory: 4/10\\n\r\nLets start with the weakiest part of the show that are the story. It happens some time later after the first season. Chevalier concluded that most of the Nova assaults are causing many loss of pandoras that they can even produce. For fix this, a certain project starts called E-Pandora(Evolution Padora), that consists in giving powers to normal humans in order to turn them into pandoras aswell. In order to help with experiences  and developing the E-pandoras, most of the pandoras around the world is invited to come to the alaska in the base of the project for help. Satellizer, Kazuya and Lana aswell are invited for it but they soon manage to discover some secrets of the e-pandora's project as they lives some dark events around it. Well....about the story....it have decreased a lot in terms of enjoyment. The first season was building a good plot with a gripping atmosphere and certain interesting events that the second season could have turned it better but the e-pandora arc is not really interesting. Few episodes saved the anime for being bad but yet the story doesn't really impressed me. I have see a lot of animes with that nakama feeling with emotional themes that had sucess in transmit it just like One piece, fairy tail(but i think FT just overruse it that nakama thing) and etc. I have feeling that freezing vibration tried to do that, showing about how much of the e-pandoras cares about theirselves and her friends, but for be sincerity, in the sad scenes, i don't feel sorry for them because i didn't find they interesting in point of having me locked into them(i will explain more about it in the character section).The Fights are not so good as the first season, they are somehow rushed and skipped a lot for show other scenes, something that really disappointed me since freezing had some good fights before, i was expectating to see more good fights in this season aswell but i couldn't see, there are some fights involving pandoras but they are not interesting to see, you will just see and wish it for end quickly for how boring it is. In the first season, it was good to see pandoras fighting against novas and how epic were the effects during the fight scenes, but this second season don't have any fight involving novas(only more near of the end but i can't tell since it would be spoiler) but is very quickly, decreasing the excitment. Other thing i want to make sure is i readed freezing manga and i already saw how the e-pandora arc is in the manga and i can say...is so much better and amazing than the anime. Its somehow more deep and dark with a lot of interesting contents and more explained things. In other words, i can say in the story, Freezing vibration had a mediocre adaptation, with a lot of unexplained things and skipped information that decreased the story in point of becoming a lot of uniteresting and boring. As i said before, few episodes saved the anime like episode 6-7 and the last 2 episodes that turned the anime slighty interesting, yet the story is still awful duo the bad adaptation, becoming unmotivating to keep watch.\\n\\n\r\nArt: 7/10\\n\r\nNothing to say about it, is the same animation since Freezing 2011, with some few changes in the visuals and effects. New changes would increases the quality of the anime but meh is still a good animation.\\n\\n\r\nSound: 6/10\\n\r\nThe sound decreased it a little in terms of OP and ED, is not really memorable, those are OK OP and ED, you will just hear but won't remember or feel like hearing it again. Yet the Orchestral and Piano OSTs of Freezing vibration are still so epic to hear.\\n\\n\r\nCharacter: 5/10\\n\r\nIn terms of character, i have to say that is slighty better than the original Freezing. Now there is more characters that somehow fits with the story and the events around it or got more attention than the first season like roxanne, ticy, cassie, chiffon, Elizabeth, Amelia and etc. They are eh...OK characters, not exactly memorable, they are like just for fit their hole in the anime, not like will make any change to the story, there few ones that really will change everything in the story or how the things will go. Satellizer, Kazuya and Rana are back, they are exactly the same, won't change anything, but Satellizer gets a little more of development, becoming a slighty better character but yet i really don't liked how OP satellizer be, i know she don't like giving up but we can give too much protagonism on her. Well, Duo the rushed adaptation, i will say a problem that appears aswell in Black Bullet. For a lot of content and information being skipped and unexplained, you won't know many things about the characters, in other words, in case of something happens with them, you won't really care for them because you think of them like just a support for help the protagonists and if they die, won't make difference. This is not a problem of the manga, and yes of the anime. A ongoing manga(with more than 30-50 chapters) cannot have only 13 episodes, because it will be very rushed and less enjoying. Characters that would be memorable, will be eh...good but not excitting characters that you will always remember. Nowdays animators think less information and more action makes something good. =/\\n\\n\r\nEnjoyment: 5/10\\n\r\nThe Ecchi/Fanservice decreased a little, giving some more focus in the story that still comes rushed and unexplained, turning it less excitting. i Didn't liked Freezing Vibration too much for having the same mistake as many animes around, bad adaptation. I was expectating more from it since i enjoyed the first season. A lot of things decreased principally the quality of anime in terms of story and sound that before were kinda good but it have fall.\\n\\n\r\nOverall: 5/10\\n\r\nFreezing Vibration, for most mediocre it is, you have to watch or you won't catch to the story, and also you will do not understand anything if Freezing have future seasons. Is not really good as the first season and also not very enjoyable because the excitment have decreased for anime that don't bring anything new  or something to lock us into the series.\\n\r\nPros:\\n\r\n+Good Animation/Soundtracks\\n\r\n+Some Characters got their respective attention/They have good roles in the series.\\n\r\n+Amazing Visual Effects\\n\\n\r\nCons:\\n\r\n-Bland Rushed and Unexplained Story\\n\r\n-A lot of Skipped Informations\\n\r\n-Not All characters got developed\\n\r\n-Less Excitting Scenes\\n\\n",
            "date": "2014-11-05T06:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 167493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4226635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LoneNinja123",
                "username": "LoneNinja123"
            },
            "url": "https://myanimelist.net/reviews.php?id=167493"
        },
        {
            "content": "SCORING\r\nstory: 7\r\nart: 7\r\nsound: 8\r\ncharacters: 7\r\nenjoyment: 1\r\noverall: 1\r\ngreat math right? from story to character has good scores. but the overall rating just \"1\"?. Let start this right away. I'm not good at reviewing and I'm not a passionate reviewer. But because I want someone to know what I feel about this anime(2 or 3 readers is okay). I just can't help myself to make a  a review. \r\nHERE->\r\nDirector:- woah! the season 1 is a huge success. So come here my fellow staff and lets make the season 2 to to be original and unique. \r\nIdiot staff:- yehey!!! that was a good idea. hooray!!!. (idiots arelaughing and happy)\\n\r\nDirector:- here's the idea. lets forget some of the manga and make our own. \\n\r\nIdiot staff again:- yehey!!! you're a genius director. (idiots are clapping)\\n\\n\r\n(POSSIBLE SPOILER)\\n\r\nso here's were it all the toilet start. \\n\r\nI'm very excited to start the season 2 right away. after watching the s1 last night. I did a marathon this early morning. The first 5 episode of s2 was fine and interesting. and a little bit dark. dark and sad. But I wondered when the MC appears again cuz he's being left behind no more screen time. this is Harem-ecchi right? why the main male lead has no screen time for 5 episodes? it's almost half the time of the series. \\n\\n\r\nepisode 6. Yehey! finally see the baby MC to bring us some man sided plot (male viewers are happy). Too bad, our hopes are fallen. The story is very disturbing. still no time for MC. everything is tragic.\\n\r\nHAVE YOU SEEN THE \"H\" ANIME \"otome dori\"?  this is what it feels like. the arc is very frustrating and disturbing. \\n\r\nthe episode feels like an hour long cuz of it's unbearable scenes. I broke my pillow, I'm very pissed off. \\n\r\ncan you imagine? example. at the party that you're not invited, your GF is there and get drunk. then she just give her body to someone. then you found out secretly cuz you're worried. but in the morning she pretends that theres nothing happened. Isn't it disturbing and disgusting? \\n\\n\r\nLet's go back to the anime. stella is strong and she loves aoi right? why not resist on luois intention? why she just give up?\\n\r\nshit happens. \\n\r\nI love the director in this anime so much. I want to kill him so badly lol :D. \\n\r\nthen to the next episode, I just fast-forward the scenes cuz I lost my appetite and hype on the series until I reached the last episode. still nothing good happen but clicheness. \\n\r\nMC #2 get rage and lost control then because of the power of love of our MC#1. the MC #2  got back to herself. Then end.\\n\\n\r\nGREAT STORY RIGHT? HOW IS IT? is it deserve to have an award?\\n\\n\r\nI know the anime industry should not copy all the original sources. But man? come on? why make it so bad? you need money for the dvd righ? so why the hell should I purchase a trash. it's a trash + can + toilet :D\\n\r\n have a nice day everyone. \\n\r\nBETTER READ THE MANGA, FORGET THE ANIME.",
            "date": "2016-10-18T05:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 231989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5499443.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Luuji222",
                "username": "Luuji222"
            },
            "url": "https://myanimelist.net/reviews.php?id=231989"
        },
        {
            "content": "Although i Mustn't comment on other reviews i'll only say that for days i see people  blaming season 2 for being bad so i wanted to write this  review to set things right.\r\nFirst of all about the story. I want to say that it's one of the most beautifull stories i have ever seen for an anime. It had only some gaps in season 2. I give 10/10 for the storyline!\r\nArt: Very beautifull created characters and every each of them with hiw own glamour. 10/10 for art!\r\nSound: Although the music didn't impress me some of the soundtracks where nicely putted in the spotsof the story perfectly!\\n\\n\r\nCharacters: I'll agree with the most that Kazuya was almost MIA at season 2, but that doesn't mean it was fully bad. I liked the substories and the path that the main story took. Only thing i wanted is to see Kazuya more times! 9/10 only for Kazuya!\\n\\n\r\nEnjoyment: 10/10 for an anime that promotes romance-friendship-loyalty to it's all aspects - Fan srvice ofc was top!\\n\\n\r\nIn Overall I give 9/10 with the only mistake that Kazuya wasn't in action so much and he didn't revealed what he can do with his powers!\\n\\n\r\nP.S As far for Chiffon Death i want to say to Manga readers that ofc it let you down cause u had already the image from the manga. For me (i saw only anime) it was a pure moment with  Power. Only gap that they rushed it a little!",
            "date": "2014-03-03T11:24:00+00:00",
            "helpful_count": 5,
            "mal_id": 134579,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491607.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TWHunter",
                "username": "TWHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=134579"
        },
        {
            "content": "tl;dr: For those that loved all of S1, this review may not be as helpful. For those that found S1 to have serious problems, this review may be more in tune with your perspective.\r\nHaving just watched the first season of Freezing, I had high hopes for the second season, since the first ended much better than it started, and I was not disappointed at all. Gone were the socially awkward moments in S1 that had me pausing the video and facepalming. Gone was all the plot armor surrounding the MCs from S1. And gone was a big chunk of the poorly done, shameless Ecchi infavor of some Ecchi related to the actual plot. S2 is a lot darker and grittier than S1, and although it's a bit less action packed in the beginning, it more than makes up for it in the end with a much wider variety of action than S1 had.\\n\\n\r\nFirst of all, the story. The premise of S1 was mere SoL at a magic university, while Vibration starts off with a mission-based premise. It felt much more natural and, though it had less physical conflict at first, the pacing was supremely better in the buildup to the end. This season also focused a bit on a secondary story involving Satellizer that was done fairly well. Both stories going on in Vibration are darker in nature, which was a welcome shift from the rather upbeat and overly happy children from S1. The weakpoint in both main stories going on would definitely be the endings. Endings are make-or-break for me, and I felt that, although they didn't break the story, they could have been done much better.\\n\\n\r\nThe character developments in Vibrations were more varied than S1. Vibration focused on more characters than S1 did and, for the majority of the time, on characters that weren't the MCs. The female MC, Satellizer, still got a fair amount of development, but the Male MC, Aoi, got pretty much squat (he's a pretty boring guy anyways). Overall, I felt the characters to be more believable and making harder choices in this season than the first, especially the secondary characters. They seemed more like real people rather than plot-driven dolls.\\n\\n\r\nNormally, I do not comment on art or sound, but one episode in particular had some... curious design choices. That is all I will say.\\n\\n\r\nOverall, Freezing Vibration provides a much deeper and focused look into the problems plaguing the planet, and focuses more on difficult, meaningful decisions by the cast over the rather silly choices made in S1.  It takes the solid final half of S1 and builds upon it.\\n\\n\r\nP.S. My review may seem a little, perplexing, to some. I feel this may be because the story of the first half of S1 was not to my liking, and most people that would have liked it, may not like the premise of Vibration as much. For those that found all of S1 to be enjoyable, including the SoL at the beginning, the darker tone that Vibration sets right from the beginning will not be as appealing. It's a shame because I feel there are many people who would enjoy Vibration that were completely turned off to the show by S1.",
            "date": "2015-10-22T13:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 201765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486450.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/webM-guy",
                "username": "webM-guy"
            },
            "url": "https://myanimelist.net/reviews.php?id=201765"
        },
        {
            "content": "In the Chevalier's Alaska base is a project to produce more Pandora to combat the dwindling population that currently exists to combat the monstrous and enigmatic Nova. Satellizer, Kazuya, Rana, Elizabeth, and Chiffon are called along with other Pandora to provide data to assist with the project. When project's specifics are brought to light is the cost really justifiable or are the Chevalier going too far? \r\nStory - (9) Freezing Vibration improves story wise in all aspects. While the first season is mostly just hazing, this season brings Satellizer and company into an interesting and at times disturbing story about humanityand just how horrible and monstrous we can be when backed into a corner. It also focuses on the many different characters views and opinions on what it means to be a Pandora. Are Pandora merely tools that should follow what their superiors say? Are they obligated to use their powers to challenge what goes against their morals for the sake of the innocent? Are the few expendable if it means saving humanity? These questions aren't given concrete answers and it's up for the viewer to decide who was right or wrong at the end of all this. Though it doesn't do as well at making arguments for all the characters in motivations as the manga does, it's still pretty compelling.\\n\\n\r\nArt - (8) Freezing Vibration slightly increases art quality across the board for most characters. The new characters are all well designed and even minor Pandora have really nice designs. Just like the first season however I feel far too much of the scenery is too dark and dreary. This helps with the feeling of isolation of Alaska in this season, but even then I would've liked some brighter colors here and there. \\n\\n\r\nSound - (8) Freezing Vibration again has a very nice set of songs. It's ending and opening in particular are both very catchy and awesome.  The themes in the anime are on par with the first season and I really seen no upgrade or downgrade in them.\\n\\n\r\nCharacters - (9) This is really Freezing Vibration really shines. This season introduces the top 5 world ranked Pandora to the cast. Much like the first season. each girl in this season has different reasons for being a Pandora and answers to what it means to be a soldier. They are unique and interesting for the most part. We also get to delve deeper into the characters we already know. Satellizer confronts demons from her past and has noticeably changed from season 1. We get a better idea of who Elizabeth is and what she stands for. Chiffon gets to show how she got to be number 1 in the world. Even Cassie/Cathy shows development from her battle with Satellizer at the end of season 1. \\n\\n\r\n- Few Notes here\\n\r\nUnfortunately the majority of the characters shown in season 1 aren't in season 2 at all due to the setting.\\n\r\nKazuya does kind of get the short end of the stick this season, but his relationship with Satellizer does develop. \\n\r\nA certain character's personality is completely different from her manga counterpart this season. Whether this is for better or worse is up to the individual. \\n\\n\r\nEnjoyment (9) - I really enjoy Freezing as a whole and enjoyed season 2 more than season 1. I was never bored and was really invested in the characters and overall conflict. I really thought it was good.\\n\\n\r\nOverall (9) - Freezing Vibration, like most anime that has fanservice, gets overlooked by people who don't even give it a chance. What I watched was an interesting look into Pandora and what they fight for. I liked that Satellizer and Kazuya shared the spotlight with other characters. It's got disturbing scenes in it, but I think that makes it unique. It's a show pushes people's buttons, but in my case I guess they were the right ones. If this show gets a 3rd season I'll be right there continuing the ride.\\n",
            "date": "2015-04-29T02:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 186728,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3441293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LordAura",
                "username": "LordAura"
            },
            "url": "https://myanimelist.net/reviews.php?id=186728"
        },
        {
            "content": "This series is painful to watch, especially compared to the first season.\r\nNo spoilers...\r\nI will be making plenty of comparisons with the first season. However, this is still meant to be a review of this season specifically. The comparisons are only there to illustrate and highlight some of the points I make.\r\nAlso, I highly recommend to watch the first season before considering to watch this one.\r\nFirst off, the art and the music. They were pretty good, like in the first season, and did enhance the experience wherever possible. They're not really exceptional either.\r\nBut the writing, oh dear... This series was confusing and tiresome to watch. Beforeexplaining, I'll talk about what made the first season good in my opinion.\\n\\n\r\nThe first season, while being not the most profound or thought-provoking series, was fun and quite enjoyable. In essence, it's an action anime, blended with ecchi that is unsubtle but not overdone, with a rather intimate/romantic vibe. Next to that, it spent some time developing its characters, their background and even its lore to a degree, but subtly, and never becoming complicated or narrating. The show wasn't afraid to bring up some slightly darker themes, but those were never strong enough to throw off the tone either.\\n\\n\r\nThis season's writers somehow manage to mess up to such a degree, that it takes every aspect I mentioned (action, ecchi, character dev, lore and dark themes), and throws them all into the blender with none of the refinement of the original, resulting in a confusing and painful mess.\\n\r\nSo many different aspects are overdone in such a way that you can tell even the writers were confused about what the focus was even supposed to be. The atmosphere is all around the place, going from almost fetish ecchi (on the verge of pornography), to torture and death (but no real gore luckily), to drama, to politics, to even low key biblical references (yes, seriously).\\n\\n\r\nI would guess that this season was mainly supposed to expand on the background of the first season as a military drama of sorts (with a religious undertone?) -at least, that's what I make out of all the major plot points.\\n\\n\r\nHowever, if that's the case, despite ecchi obviously not being highly compatible with the suffering and death that war brings, the writers still didn't want to/couldn't get rid of the ecchi element, which was obviously a defining aspect of the first season.\\n\r\nAnd for some reason, here they decided to take the brakes off; where the first season's ecchi generally had a sort of passionate/intimate context, here it's rather raw, lusty and often fetishised (even the scenes referencing rape that occur seem almost fetishised). I can see that some people may enjoy this, but to me it's a major turnoff. And I don't understand why they thought throwing it in the same mix as torture and death themes was a good idea.\\n\\n\r\nThis series is a mess. It has many contrasting themes going on at the same time. But where in the first season seemingly incompatible elements were cleverly balanced resulting in an all around enjoyable and unique experience, here they all end up pushing against each other and screaming for attention, making this series mentally and emotionally tiring to watch, and thought-provoking nor fun.",
            "date": "2018-02-02T19:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 270469,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/warsaberso",
                "username": "warsaberso"
            },
            "url": "https://myanimelist.net/reviews.php?id=270469"
        },
        {
            "content": "TIP: Whenever I say PLOT, I'm talking about ASS & BREAST(aka fan service)\r\nFreezing Vibration, a story of a world that's at war with enemies known as the NOVA, Huge & powerful as they be humanity refuses to kneel to such a threat. Militaries around the world came up with a plan to fight back against the NOVA. The Military in each country has an acadamy for men & women who attend the acadamy to hoan thier skills & become stronger to fight against the NOVA. The women who attend this school are known a Pandoras, a rare being capable of skills to bring aNOVA to its knees to protect humanity. Though Pandoras are powerful, they would be nothing without the aid of their Limiters. The NOVAs are capable to cast a field to FREEZE their attackers in place & also making them supceptible to an attack from the NOVA itself. To counter this, the Pandoras have male partners known as Limiters, the abilites of a Limiter is the same as a NOVA, they are able to cast a field freezing anything in its range. But this ability is normally used to counter a NOVAs freezing to give the Pandora a chance to strike at the NOVA.\\n\\n\r\nYes, this anime is a ecchie & a harem, but the PLOT only seems to revolve around a single male. Normally, that's what a harem is, but in this anime the girls who want to become more then friends are 2 girls with occasional attention from other girls around the school. I'll get into detail in my breakdown review. At any rate this show is anything but bad, it's a interesting & enjoyable watch to those who are ecchie & harem fans. If you can't take nip slips & there I advise not to watch it. But to those who want that & believe me I know what you want or you wouldn't of clicked on this anime to begin with you won't be disappointed.\\n\\n\\n\r\nBREAKDOWN REVIEW: Scoring ranging from 1-10, 1 being dredful\\n\\n\\n\r\n[9]STORY: Don't let the over-top action fool you or the PLOT keep you in a trance. They actually has some substance to it, meaning there's actually an interesting point to the story. It kinda resembles an average high school. Students fighting among each other but coming together when they face a hurtle they cant defeat alone.\\n\\n\r\n[8]ART: The art in this anime is very good & an on par with a lot of other popular animes. You'll notice throughout each episode when clothes start become revealing or torn the detail tends to pop a little more making you focus primarily on the PLOT...!\\n\\n\r\n[8]SOUND: Sound becomes highten in intimate situations & the music makes all the fights absolutly epic.\\n\\n\r\n[8]CHARACTER: The character I'm going to cover are only 3, because I can't cover all of them.\\n\\n\r\n-Kazuya Aoi- The story seems to revolve around Kazuya. As special he may be he can't help but be stuck in his older sister's shadow because of her sacrifice many years ago. But through self realization he breaks free from her shadow & becomes his own person.\\n\\n\r\n-Satellizer el Bridget- A powerful Pandora who is known as the \"untouchable Queen\" who does not rely on anybody but herself & rather die then admit defeat to anyone & refuses to have a Limiter. Ironic as it may seem she reluctantly meets Kazyuya. Very mean & resiliant at first to Kazyuya she evenually warms up to him slowly.\\n\\n\r\n-Rana Linchen- A transfer student from a an old world country & who is not aware of certain terms amongst average Pandoras. She only wishes to find her \"destined one\" aka her Limiter. By chance she meets Kazyuya & falls head over heals for him & is convinced that Kazyuya belongs to her NOT Saterllizer, thus forcing Kazyuya into a love triangle.\\n\\n\\n\r\n[9]ENJOYMENT: The show is not a bad watch, with the fan service it actually makes the show even better.\\n\\n\\n\r\n[9]OVERALL: Freezing overall is show worthy of praise for its originality & worth watching if you're really into ecchie & harem with a side of action packed fights.\\n\\n\\n\r\nTo those looking for another ecchie & harem I recommend this show you will not be disappointed.\\n\\n\r\nEnjoy =)",
            "date": "2014-02-21T17:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 133393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3541779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SkitZxX3",
                "username": "SkitZxX3"
            },
            "url": "https://myanimelist.net/reviews.php?id=133393"
        },
        {
            "content": "I'll said that Season One is better than Season Two ! Why? \r\nBecause Season Two show us the story that is more serious and too dark perhaps?Unlike Season One it's friendly and enjoyable but I don't sense any excitement.It's a disappointment as it will you a feeling of dissatisfy after you done watching the series. The storyline is just giving the character more grudges to take on.\r\nIt's just a piece of my mind but Season 1 is better !\r\nNo Offense :D !",
            "date": "2015-04-11T09:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 185386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3876469.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Toyen12",
                "username": "Toyen12"
            },
            "url": "https://myanimelist.net/reviews.php?id=185386"
        }
    ],
    [
        {
            "content": "Freezing did a lot of things right.\r\nSeason 2 made a significant leap with its soundtrack. There music is brilliant! The storyline is still unexciting though.\r\nThe number one complaint from critics is that boobs are present. Let me tell you something. There isn't a single moment boobs are present without being accompanied by action or emotional character thought/development. Therefore, no sacrifices are made to squeeze in fanservice like other series tend to do. That aside, the story here had potential. The problem is the students spend a ton of time fighting amongst themselves rather than directing their power to the true enemy. Because of this Ifound myself feeling like I couldn't really root for the \"good guys\" due to them all being incredibly ignorant assholes. But they aren't just assholes. They are really savage about it and fuck each other up pretty bad. This really made the story suffer. \\n\\n\r\nIf it weren't for the storyline flaw, this anime would be supreme. The art and lighting is incredible. They do a great job at creating a realistic atmosphere to pull you into their situations. The battles are extremely intense and brutal. The emotional experiences are much stronger than most series as well. You'll find yourself tearing up a lot. There is a good variety of characters, but some go underdeveloped so you don't appreciate them as much. All in all, Freezing is an excellent anime.",
            "date": "2016-10-14T02:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 231754,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5742500.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GodBlessDXD",
                "username": "GodBlessDXD"
            },
            "url": "https://myanimelist.net/reviews.php?id=231754"
        },
        {
            "content": "Well that (de)escalated pretty quickly.\r\nFreezing returns; taking that term \"literally\" now, as the plot mainly takes place in Alaska. Satellizer, Kazuya, Rana, Chiffon, and Beth return; meeting other Pandoraii, getting involved with the mysterious \"E-Pandora Project,\" and (for Satellizer) dealing with a re-opened wound that is her half-brother.\r\nFans of the manga version may not like the switches and changed within the anime, but everyone else who'd been watching this anime should be glad: The upskirt panty shots, nudity, gore, and useful male leads return as if they've never left. What you get more of is the \"Sis-Fist\" and the psychological suffering.",
            "date": "2013-12-22T16:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 125121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=125121"
        },
        {
            "content": "Its hard to rate with numbers, considering the fact that the reason i don't like the second season of freezing is because is totally goes against all the good vibes (no pun intended) i got from the first season. Without spoiling anything, I feel that the second season is not only weird in itself, but it also ruins the first season, and therefore I would recommend just watching the first season, and leaving the rest to imagination.\r\nI also found the ecchi to be totally irrelevant to the plot, which I don't like, because when ecchi is irrelevant, all it serves is to take away fromthe seriousness of the situation, such as an important conversation in between two characters, where you can't focus on the conversation, because the camera is focused on the characters breasts. If you watch ecchi just for good boobies, then this is the anime for you, but if you want good plot, I would recommend sticking to the first season.",
            "date": "2017-07-21T13:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 253397,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6354167.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/duvydvylner",
                "username": "duvydvylner"
            },
            "url": "https://myanimelist.net/reviews.php?id=253397"
        },
        {
            "content": "Vibration - a series of small, fast movements back and forth or from side to side...huh...kinda like the pacing of this season.\r\nThe difference between Freezing and Freezing Vibration is it's topic of agenda and execution of the agenda they both do.\r\nFreezing Vibration takes off where the first season left on on but with a different plotline following Satellizer and Kazuya. So instead of the survival of humanity of Nova attacking humanity, we have a artificial vs.natural in the form of discrimination towards the newly shown plotline of E-Pandora, artificial Pandora using ordinary girls to the naturally-battle ready Pandora's. So before LA delves into this \"agenda\"that Vibration has, LA will get into the typical basics.\\n\\n\r\nIn terms of characters, we have a new line of characters, from the international Pandora's and their Limiters to the new cast of E-Pandora's, essentially the cast has DOUBLED but omitted some of the characters from the first season such as Ganessa. As for character focuses, we do get some insight to some of the characters that were hinted at the first season such as Chiffon and Elizabeth Mably voiced by Sayaka Ohara, as for the new cast of E-Pandora characters, well the centralized focus is on these new E-Pandora's, most notably Amelia Evans voiced by Suzuko Mimori. Oddly enough Satellizer and Kazuya doesn't get much of a focus until the halfway mark, however that is \"slightly\" compensated with an in-depth look at Satellizer's past which will for LA will immediately bring up Satellizer's younger step-brother Louis el Bridget, if there was a lack of execution or payoff for even looking into Satellizer's past with Louis involved, well the biggest problem with developing Satellizer's past is that Louis in reality didn't get the comeuppance he deserved to all he did to Satellizer in the past AS WELL AS during the events of Vibration, LA already loathed Louis as a character from the first season (in fact LA hated this character more than the main villain of Vibration), the payoff to this just wasn't handled properly. As much as the characters and their development are scattered and LA has overall mixed feelings to the new and old characters. If you want to know whether Satellizer is STILL LA's favourite character, she is, however as for the minor character cast, well LA's favourite minor character is STILL Chiffon, however Cathy Lockharte voiced by Rie Kugimiya can easily be LA's second favourite from the minor cast...and no it's not because of Rie Kugimiya.\\n\\n\r\nIn terms of animation done once again by A.C.G.T, well it's overall decent like the first season but LA felt that it kinda lacked in the battle department with some stiff and awkward battle movements here and there, still Vibration still has the same color palette it had in the first still briniging in that dark tone and mood it needs for this season.\\n\\n\r\nThe fanservice however takes a big dip in levels as Vibration gets serious with it's agenda and really due to this agenda, most of the fanservice and ripped clothing is hardly noticeably, let alone LA cares about it. However the biggest offender of the fanservice is the shameless fanservice girl of Elizabeth Mably essentially her walking in the nude is the highest level of fanservice Vibration ever gets.\\n\\n\r\nNow onto the \"difference of agenda\" LA said at the beginning of this review, well Vibration overall has lowered their stakes in the plot for a more focus on artificiality vs. natural while taking on abused human experimentation for a \"ambitious mad scientist human villain\" -sigh- see what LA means by lowering the stakes, sure Vibration is multi-faceted with it's new agenda but ultimately towards the overall impact on this plot, it doesn't do much for LA to care about the plot when the villain is a scummy human villain instead of ohh LA doesn't know the already powerfully insane Nova's, made worse by Satellizer's failed execution of her past (though her character development along with Kazuya gets better) and made even worse is that Kazuya becomes utterly one-note as a supporting character to Satellizer. As much as LA is bashing Vibration LA will say that at the VERY least the new agenda Vibration took with it's multi-faceted messages doesn't ring hollow as it's centralized focus on this does make it engaging even if the payoff is horrible, also the new cast of characters of E-Pandora's and the international Pandoras are welcome additions to Freezing.\\n\\n\r\nThe ending if anything gave the focus from Satellizer to Chiffon Fairchild and to be honest it was kinda baffling where this ending led to, yes it actually lead to an actual death compensated with a few \"deaths but not\" by the end of it. Now LA really thought that this ending was a clusterfuck of themes and ideas put together with some plotlines that still become unexplained by the end of Vibration, however for a clusterfuck, LA didn't mind this ending, sure it has lots of loose plot threads (like the obvious, what the hell are the Nova's!?!??!?!) that \"might\" hint to another season but how batshit insane it went to the central focus of the Nova, LA didn't mind it as it had a similar ending to the first season.\\n\\n\r\nFreezing Vibration, with it's negatives and positives, all LA can say about Vibration is that, it's not THAT bad a sequel to Freezing, however LA would say that if you want higher stakes in Freezing just stick to the first season, if you wanted a different agenda to Freezing and like the new cast of characters, then Vibration will scratch that itch, for LA however Vibration is \"decent\" but can't stand up to it's first season as the negatives \"just\" outweighed the positives for LA.",
            "date": "2016-07-28T18:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 225284,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=225284"
        },
        {
            "content": "Most people call it fan service, it slightly is but it's not.\r\nThe story is great!\r\nSomeone who hasn't read the manga may say it sucks but truly, the story is deep and interesting.\r\nThe Anime just hasn't gotten to that point yet.\r\nThe music is okay, it's anticipating and emotional.\r\nHere are 2 examples.\r\nEmotional: Sister Ost\r\nAnticipating: Aria Ost\r\nThe art is good also, good enough to lable Satellizer as the cutest anime character by far.\r\nThe character personalities are well to, it's very unique.\r\nOver all, one of my favorite anime's and I'm begging for a third season.",
            "date": "2014-09-21T20:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 161501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4115471.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/vibrationX7",
                "username": "vibrationX7"
            },
            "url": "https://myanimelist.net/reviews.php?id=161501"
        },
        {
            "content": "For some as i who have enjoyed the first season.I apologized for the terms used during my critics but it was the worst of all i could have seen in my life.I did watch manga and anime where i regret,my precipitation.\r\nBut here,it is scarcely acceptable,First of all,with the lack of imagination it was a copy and paste work.\r\nThe concept,I want to surpass you and create \"New pandora\" is too much of a let down,than it should be.\r\nTo make a pandora,which i will represent with P,adding the possibility of 2% for a pandora and the based as B which are females as the first season.\r\nNow forthe season season first of all,due to the differ in methods,males could have been used for such a matter as it was unsafe knowing girls would turn into Nova.\\n\\n\r\nAnother matter i would like to attract attention would be the uselessness the main character Aoi Kazuya shown was incoherent.In the first season he have deploy his ability as due to the facts that he still haven't done the ritual with Satellizer baptism.He would have been able to deploy his field and help Fairchild survive this explosion.\\n\\n\r\nHe sat there doing nothing even the brother of satellizer,louis which i agreed treated his sister wrongly as he was in loved with her and a bit of a lonely child fight the copy of Maria.What was our hero doing this time?No helping?now at the end of the series Elizabeth says i will now leave,as it would feel like betraying him?We are speaking of the possibility of the end of the world.\\n\\n\r\nIt doesn't matter the world crumble as long as you have your boyfriend?You won't help or make a move to protect him either?In their section they already lack backup now that fairchild is no more.Elizabeth left?What is she a spoiled kiddos?no wonder rich kids have so bad reputation.When we see how some acts carefree of their surrounding.",
            "date": "2014-07-19T09:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 152747,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3868113.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Jylius",
                "username": "Jylius"
            },
            "url": "https://myanimelist.net/reviews.php?id=152747"
        },
        {
            "content": "I enjoyed the story. Although I'm a pretty open guy and enjoy a lot of anime's in which many others think is bad. Which is a good thing because I get to enjoy more.\r\nThe story progressed so well. It didn't feel rushed which is rare for a 12 episode anime. My only gripe with a lot of animes is the fact that the story feels rushed. Not the case in this anime imo.\r\nEverything in my opinion was going well until the ending. It lacked a lot of feeling and denies any expectations. It will also make you question the point of even having \"main\" characters.If they had a better ending then maybe I would have rated the story 10/10. But it was such a disappointment I gave it a 7/10.",
            "date": "2015-10-31T17:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 202342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4821408.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShikuTeshi",
                "username": "ShikuTeshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=202342"
        },
        {
            "content": "When you create a sequel for an anime, two things can happen: \r\nA) Surpass the original one and make something better, more beautiful.\r\nB) Achieve a critical failure by making something not worth of its predecessor.\r\nIn Freezing: Vibration's case, sadly it would be option B.\r\nThe seeting is the same as Freezing: futuristic world, boobs, lots of blood, boobs, girls fighting each other, boobs, complicated relationships and boobs. I loved Freezing. I really did. It had a somewhat interesting plot wrapped with excellent fanservice (consisting of naked cleavages). I lost nearly 2 litres of blood watching it and I was knocked out for 3 days until myblood levels were replenished. Yeah , I had that many nosebleeds.\\n\\n\r\nAnyway, the story continues from where it left off. The Pandoras from the East Genetics travel to Alaska to assist a program that will enable common women to become artificial Pandoras, dubbed E-Pandoras. However, it quickly becomes a conspiracy-based storyline with information wars. I thought Freezing was about three things: fanservice, aliens, battles. If I wanted to watch something like this, I would get one of the Bourne movies. Not only that, the fanservice is dramatically reduced! Yeah, in the first freezing you had girls taking damage that exposed their naked breasts that were depicted beautifully. In Vibration, EVERY NAKED CLEAVAGE IS CONCEALED BY SOME SORT OF LIGHTING! Seriously, why do something like that? Also, while Earth is supposed to be invaded by dimensional aliens called Nova, you will hardly see any of them.\\n\\n\r\nThe art doesn't have many differences thant Freezing. The same nice visuals and unique battle choreography for every character. However, the amount of battles was reduced significantly and they were less interesting for some reason. I felt Freezing's battles where more energetic and more dynamical.\\n\\n\r\nAnother thing that changes is the addition of new characters and the evolution of some of the old ones. But you will have to find out about that yourselves.\\n\\n\r\nVibration is absolutely not worthy of comparison with Freezing. It's like day and night. I would suggest Vibration if you were interested in Freezing's plot and want to see where it will lead. But if you only want fanservice, you are better off watching the first one or something else. It's a shame though.\\n\\n\r\nStory: 5\\n\r\nArt: 8\\n\r\nSound: 8\\n\r\nCharacter: 8\\n\r\nEnjoyment: 6\\n\r\nOverall: 7",
            "date": "2014-02-04T02:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 131363,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3167841.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheSpicyDonut",
                "username": "TheSpicyDonut"
            },
            "url": "https://myanimelist.net/reviews.php?id=131363"
        },
        {
            "content": "It's a fun watch, but compared to the first one it's not as good. In all reality it seems more focused on fan service in the fact that it's showing the abilities of everyone in more detail than in the first series.\r\nBut on that note, I'll say this has been my one problem overall with the series: Too much unnecessary nudity. It's like the writers thought the only way to draw in was by showing girls in a state of undress. No exceptions, every single episode had girls \"conveniently\" getting their clothes cut in a way that showed off their breasts. If it wasn't ina fight, there was always a guaranteed \"water\" scene where someone was either naked in a shower or in a swimming pool with a slow pan up from their stomachs. \\n\\n\r\nI'm not usually a stickler for these types of things considering the perv I normally am, but how often it happened and for no reason was just ridiculous to the point of making the show less enjoyable.",
            "date": "2014-01-03T01:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 126943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/41155.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/burningice256",
                "username": "burningice256"
            },
            "url": "https://myanimelist.net/reviews.php?id=126943"
        }
    ]
]