[
    [
        {
            "content": "I feel kind of weird to be writing a review for Black Lagoon: the Second Barrage after I just wrote the review for the first season. Why? Because I don't really consider them to be two different seasons. It's just a continuation of a series I really didn't expect to be as good as it was the first time around. All 24 episodes are just Black Lagoon to me, and for good reason: Second Barrage keeps up the high octane action that made the first season such a blast. The art is the same, the sound is the same (which is unfortunate we didn't getany new songs added in), and the VA's are the same, thank God. Except something fail happens -- some of them start speaking in English in the last arc, and the pronunciation and grammar are horrible. Actually, the lines were cringeworthy too for Revy, who is supposedly a Chinese American so I would expect better English from her. It was revealed near the end the cast actually speaks English all the time and it's only in Japanese for the audience's sake. Having learned that I'm rather curious how the English dub sounds in some of these later episodes where English, Japanese, and Russian were all used in one conversation. I would have rather they just kept Revy talking in Japanese for the remainder of the show as I saw it, although that makes another character shouting &quot;Hey! Speak in Japanese!&quot; to her seem weird. ;-)\\n\\n\r\nOne difference is the story length this time. Last season was a series of 2-3 episode arcs wth a couple one-shot stories added. This season the entire last six episodes are absorbed into a single war between the old guard Japanese mafia and the up and coming Russians of Hotel Moscow, that takes Rock back to his home and to face the past he turned his back on. The &quot;Greenback Jane&quot; arc is easily the weakest of the season (probably both seasons) but is made up for with the first story arc featuring murderous children (yes, deadly lolis) and the epic ending arc.\\n\\n\r\nLike The Melancholy of Haruhi Suzumiya, this is one show I was disappointed to see end, and it looks like I wont have to yet, as a Third Season has been announced now.",
            "date": "2008-09-04T14:46:00+00:00",
            "helpful_count": 120,
            "mal_id": 7696,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60494.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nx6",
                "username": "nx6"
            },
            "url": "https://myanimelist.net/reviews.php?id=7696"
        },
        {
            "content": "Welcome back Rock, Revy and the gang! In this second installment of Black Lagoon, we continue our journey through Roanapur, the city of criminals.\r\nIt's somewhat sad, but I have to begin with a dissatisfied distaste in my mouth after finishing this season. What's so sad about it? Well, for one thing, the story.\r\nI wonder if they simply wrote down a whole bunch of plot ideas on paper, crumbled them up in a ball, put them in a hat and drew at random. Boom, just like that, they came up with two, ridiculously stupid story lines to encompass 12 episodes. Each is so far fetched thatyou can't help but feel like you're watching a terrible D rated movie. Nothing is realistic (not even close), and nothing is even attempted to be explained to you. Flat out horrible.\\n\\n\r\nOn the other hand, the animation for these terrible plots was well done. Revy looks great, Rock is his pansy self, and Dutch is still black. Fights are fluid, but who cares with what they gave you to watch.\\n\\n\r\nThe music, as far as I can tell, is the same thing from the first season. I can't recall if the opening is different, but it's well done. The ED is slow, tacky, and I skipped it every time. Background music throughout the show is alright, but nothing worth buying.\\n\\n\r\nLet's move on to the characters and their interactions...oh wait, nothing happened. We find out next to nothing else about Rock and Revy. Well wait, we know Rock used to live in Japan now. WOW! 12 episodes and it feels like they've told us nothing more about the characters except one used to live in Japan! Yay?\\n\\n\r\nI'll admit, I enjoyed the season, because who doesn't enjoy seeing Revy kick ass? But seriously, it was a huge let down and I probably won't watch it again. They could have done sooo much more with the characters, their background, and possibly maybe...just maybe throw in a relationship?\\n\\n\r\nTry it out, watch it if you saw the fist season, but don't expect much other than an average anime.\\n\\n\r\nOh yeah, perhaps one highlight was the nudity they threw in. Yay for dirty animators?",
            "date": "2007-02-12T10:05:00+00:00",
            "helpful_count": 116,
            "mal_id": 145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Xinil",
                "username": "Xinil"
            },
            "url": "https://myanimelist.net/reviews.php?id=145"
        },
        {
            "content": "I personally absolutely loved the second season of Black Lagoon!\r\nWhile the storyline is a little short in that it seems like just a bunch of random stories thrown together, the themes remain the same throughout the anime and have a good conclusion to them.\r\nIt is not only action-wise intense but it poses questions of morality and who is right or wrong in the world, and more importantly which side should you be on. \r\nThroughout the anime there is this central conflict, of making choices and determining if they are the right/just ones, with the main character and the ending is satisfying in learning what hisfinal decision is!\\n\\n\r\nThe most powerful episodes to me were 13-15,(the twin-arc), which really touchs base with how messed up this world can be!\\n",
            "date": "2008-03-30T21:03:00+00:00",
            "helpful_count": 109,
            "mal_id": 3498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46508.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/domthebomb",
                "username": "domthebomb"
            },
            "url": "https://myanimelist.net/reviews.php?id=3498"
        },
        {
            "content": "The second installment of the Black Lagoon Series! If you've watched the first season and liked it, I assume you'd want more right?\r\nWell in this second installment you'll see the crew of Black Lagoon in even more misadventures. \r\nThere's not much to expect except MORE GUNFIGHTS and MORE Revy and Rock antics! XD \r\nThe great thing about the second season is that it show's the backgrounds of the characters like Eda, Revy and Balalaika's past although it's vague. IT also shows the different sides of the characters like Revy's soft side, Balalaika's value of her comrades as well as her war freak side, Eda inaction! \\n\\n\r\nThe focus here is more on Rock and Revy. Dutch and Benny now seem like supporting characters here. \\n\\n\r\nAll in all, a good second season. Watch it if you're looking for more Black Lagoon goodness! I guarantee though it may not be great storywise, but it's one hell or a ride! XD",
            "date": "2007-11-01T19:56:00+00:00",
            "helpful_count": 39,
            "mal_id": 1195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/17052.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Two-Hands",
                "username": "Two-Hands"
            },
            "url": "https://myanimelist.net/reviews.php?id=1195"
        },
        {
            "content": "This anime is incredible, the second season makes it even more so. It requires a bit of maturity to watch, especially things like the twin arc. \r\nIt's not for the faint of heart, nor the overly sensitive. or those with strong moral backround. \r\nbut for those who can look past it, this anime has it all. Action(lots of it) Comedy, and Tragedy; and a great story to go with it.\r\nWhat I don't like about it, which is just a minor nitpick, is while in the second season more of the plot follows Revy and Rock, they don't expand upon their relationship much. And the restof the black lagoon crew is phased out of the season more or less. They also fail to expand upon a few more major characters, unless there is going to be a third season. \\n\\n\r\nThis knocks it down a bit, but only to a minor degree for me.",
            "date": "2008-03-11T03:00:00+00:00",
            "helpful_count": 29,
            "mal_id": 3032,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kharaa",
                "username": "kharaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=3032"
        },
        {
            "content": "Black Lagoon: The Second Barrage\r\nThe second part of Black Lagoon, but it's splitted as a second season for some reason, follows another day in the episodic life of the Black Lagoon gang, another day but focused more on Revy and Rock and less Dutch and Benny.\r\nStory\r\nThe same as the first part, it has episodic stories that are a mess at giving a contundent conclusion and rising questions, just like Eda's identity is revealed i was expecting a story with her, but no, her motives are unknown, the first three episodes are sad, i felt sorry for Hansel and Gretel, it was really sad and tothink that happens in real life too and seeing their fates made me shed some tears, maybe the best eps. of this Second Barrage, those eps. had story behind it, a deep and really really dark one and a dark conclusion; The next eps. are good with another different story but with Eda's identity revealed and in the next ep. nothing about that, a different story again this time in Japan and Revy's clothes changed too, it's refreshing and she looked really good; Rock and Revy gets closer and you can see Revy cares a lot for Rock in her own way (she even gets jealous when Eda flirts with Rock or doesn't want to talk about it when Eda asks Revy if they banged or when he was talking with Yukio) and that story in Japan was good, but it would be better if it had more eps. it ended like a normal ep. like giving you the impression that there's going to be another ep. that was not a good ending. Well after the ending and the ED song, Eda asks her again if she finally banged him because they had a lot of time to do it and Revy said she didn't wanted to talk about it and was ashamed and angry at the question, it was kind of funny because she never tries but acts more kind towards him than before, not getting angry at him like she used to, those stories were good, the first one was great, the second story didn't have a conclusion and the third one felt almost the same, but i was'' so where is the next episode?''.\\n\\n\r\nArt & Animation\\n\r\nArt style is the same, it's very good, great animation and details, more blood than the first part with a liitle more violence, and with great character design.\\n\\n\r\nSound\\n\r\nAlmost the same but i expected more with the music, very good VA but a little clumsy with the english when Rock had to work as Balalaika's translator, i barely understood her, not just her but every one who attempted to speak in english because they didn't know each others languages. The same amazing OP, i got obsessed pausing the video clip at sec. 36 she had something and i was trying to find out why i liked that shot so much, maybe because you won't see her like that in the anime, every episode pausing at that sec. for half an hour... there are three ED the same one from the first part/season and the one that will make you drop a tear the one from ep. 15 and the one from the last ep... in general was very good.\\n\\n\r\nCharacter\\n\r\nI enjoyed much more Revy on this second barrage, she was less heartless, a little, but she really was better than before and treats Rock better and protects him.\\n\r\n-Rock is better too and he starts to find out who he is and where he stands.\\n\r\n-Mr. Chang is a confirmed badass.\\n\r\n-Shenhua's voice is funny, i love the way she talks, she is a cool character.\\n\r\n-Balalaika is ruthless than ever, she is greedy for war, i liked the addition of Sawyer (she reminded me of the girl from Nazo no Kanojo X) and Ginji, cool character and not to mention the darker characters like Hansel and Gretel with a really dark past, hevy stuff, it was a heavy story and Yukio's end was... she should have stopped, that end wouldn't happened if she... and there's not much of Dutch unfortunately, not Benny neither but he only appears two times and he already has a girlfriend Janet the clumsy Indian girl.\\n\\n\r\nEnjoyment\\n\r\nI enjoyed more this second barrage than the first 12 eps. it was a little better, but the action was much enjoyable, although i feel it should be tagged as supernatural, because c'mon is obvious why, eg, Gretel a girl who wields a heavy machinegun and handles it like a boss without hurting herself, or Roberta in the first part/season is basically terminator... Revy was much ''nicer'' more likeable, more relaxed and badass than before, Revy is quite something unique and sexy, adding the 7 Omakes which were funny and good i got a great enjoyment.",
            "date": "2015-10-11T21:44:00+00:00",
            "helpful_count": 23,
            "mal_id": 201059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=201059"
        },
        {
            "content": "The second season of Black Lagoon is really a story of two different anime; the underwhelming, uninspired first six episodes, and the spectacular, engaging last half of the show. The former is a 5, while the latter is very close to a 10.\r\nThe returning characters and excellent opening are largely the same as the first season (mentioned more in my review of that season), which is a good thing. The art is as stylish, vivid, and colorful as ever, and adds a definite flavor to all the gun battles.\r\nNow, there are three different story arcs, each completely independent of one another; the murderous twins, GreenbackJane, and the Yakuza fighting back in Japan.\\n\\n\r\nThe series starts off with the Romanian siblings, two eight year olds with white hair carrying a mini-gun and an ax larger than they are themselves. These two little children love to kill, and are so dangerous that they wreak havoc upon Roanapur, killing dozens of high-level, powerful gangsters, including those from Hotel Moscow.\\n\\n\r\nNow, I understand suspension of disbelief, and I realize that the gun-wielding heavies in the Black Lagoon universe are supposed to be bizarre, unorthodox characters, from chain-smoking nuns to chambermaids wearing glasses, but this is absurd.\\n\\n\r\nEven in the Black Lagoon universe, it doesn't make sense for two FRAIL CHILDREN to single-handedly cut through droves of gangsters and expert gunmen like so much confetti. The only way to pull this off is to inject humor, but there is none of that in the first three episodes.\\n\\n\r\nThe emotional melisma surrounding the end of this arc is both unnecessary and poorly executed.\\n\\n\r\nNext up is Greenback Jane, a straightforward action arc about a counterfeiter on the run, with all of Roanapur's deadliest criminals after her, and only Eda and the Black Lagoon company around to protect her.\\n\\n\r\nIt's mostly action, with several funny scenes, and little character development, an Eda flashback aside. It's decent fare, but I found a few key moments disappointing. Without revealing any spoilers, there are several notorious gangsters fighting against Eda and Revy.\\n\\n\r\nA few of the less important ones die, but the main ones, with significant backstory, curiously survive, only one with serious injuries of any kind. Now, I understand they wanted to save them for Season 3, but it's anti-climactic, a cheap device from the creators.\\n\\n\r\nIn the ruthless Black Lagoon universe, when two heavies battle it out, one should die.\\n\\n\r\nFinally, we come to the last six episodes, which cover Hotel Moscow's quest to destroy several Yakuza families in Japan, quality time spent between Revy (fully-clothed even!) and Rock near the latter's home, as we are also introduced to a cute schoolgirl named Yukio and honorable swordsman Ginji, who can slice bullets in half.\\n\\n\r\nThis might very well be the best story arc in the entire series, Seasons 1 and 2, and corrects many of the things I disliked about the earlier episodes.\\n\\n\r\nIf you read my review for the first season, one of my biggest complaints was the character of Revy, that she was a character with no depth or reality, and was boring and stupid to boot.\\n\\n\r\nWell, by the end of Season 2, she has been transformed into a much more understandable and most importantly, FUN individual.\\n\\n\r\nNo longer is she hysterical, crazy, nor does she talk as much ridiculous shit. She's far more competent, rational, and even her character is developed, as we see her interacting with children, and she shows genuine compassion and love for Rock.\\n\\n\r\nThe overall character development in these last six episodes is excellent. A lot of attention is paid to Miss Balalaika, as she cements her status as the coolest, most competent criminal in the series. Her blend of stoicism with charm, humor, and the ability to do whatever is necessary to crush her enemies is entertaining to watch.\\n\\n\r\nEven the minor characters, like the violent, insane Chaka, with facial piercings, blonde hair, and a purple suit, are well done.\\n\\n\r\nHe is a neat reference to Kakihara from \"Ichi the Killer\", minus the love of sadomasochism.\\n\\n\r\nThe story itself drags a little with overly abstract, emotional dialogue, but it's not terrible, and is at least relevant to the central theme, which concerns the transition and choice between criminal or peaceful life.\\n\\n\r\nThe last six episodes make up for the beginning of the Second Season, but not enough to propel it into \"great\" status.\\n\\n\r\nHighly recommended for anyone that enjoys action and a fast pace to one's anime, as well as unusual personalities.",
            "date": "2009-11-30T17:29:00+00:00",
            "helpful_count": 18,
            "mal_id": 21004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81668.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/YoungVagabond",
                "username": "YoungVagabond"
            },
            "url": "https://myanimelist.net/reviews.php?id=21004"
        },
        {
            "content": "STORY: 6/10\r\nCHARACTER: 8/10\r\nART: 10/10\r\nSOUND: 9/10\r\nENJOYMENT: 9/10\r\nOVERALL: 7/10\r\n!!Since there’s only a short gap between S1 and S2 of Black Lagoon, I am going to be reviewing both seasons here so Warning beforehand for any Accidental Spoilers!!\r\n‘Black Lagoon’ captured my attention from Revy on the poster to good word of mouth. Not knowing what to make of the title or the poster, I was very surprised at what this anime turned out to be. Often criticized for copying ‘Cowboy Bebop’, I was a little concerned at first but this anime distinguishes itself with its world building and characters. Set to a dark yet realistic, cruel, cold, violentand brutal crime infested town that perfectly captures the last place you want to be in this R-rated world. This anime superbly holds nothing back and you get a load of hot girls wielding big guns and firing at everything and everyone! In fact, this anime is all about tits, ass, guns, explosions, cursing and badass chicks! You start with Okajima, leading a boring life who then gets kidnapped by the Lagoon company on a business trip. Upon realizing he’s been abandoned by his own company, he decides to join this group of renegades and gets the nickname ‘Rock’. Even though the anime lacks in story and the plot is pretty much the group doing different missions, it never bothers anyone since what you get is very entertaining to watch! This has some of the best Action scenes, so good that you can’t take your eyes off them! I mean why would I care about Story when I can get Revy killing a bunch of Nazi’s on a ship! The anime also doesn’t shy away from clichés like generic character traits or plot armour for the main characters during battle but it doesn’t matter! ‘Black Lagoon’ totally owns it by delivering non-stop Awesome Action and helps you forget the unrealism of it all.\\n\\n\r\nThis is also one of those rare shows where the Female characters not only KICK ASS but completely steal the show! You get a little bit of everything from the characters, with the weak MC who later grow balls to a Computer Geek, Samurai, Mafia, Cartels, Russians, Nazis, Crazy maids and nuns! I had a lot of fun with most of the characters but the Stand out is Revy by a large margin. This foul mouthed, gun blazing, sexy yet deadly Chinese version of Lara Croft is the most interesting character on the show. She’s the kind of woman who will kill anyone that gets in her way and then later drink at a bar as if nothing happened! Her use of the word ‘F***’ was always fun to hear and her ‘No Shit Given’ attitude propels her to the top of many people’s list of Badass female characters. Revy also comes across very sexy regardless of displaying no forms of seductiveness, I mean she rarely shows any sort of attraction to anyone! But those poses she takes while shooting just makes her unbelievably attractive and I for one couldn’t get her out of my head for a while! She’s also involved in a lively relationship with Rock that’s never clearly defined yet both display great chemistry with one another. In fact, Rock becomes more interesting after his interactions with Revy cause otherwise he’s the one who holds back, being the one with morals and integrity. He’s heavily overshadowed by Revy but I enjoyed him a lot too cause he showed tons of resilience for an amateur and even stared down the badass Revy by speaking his mind. Even under the threat of a gun, he was able to hold his ground. We even later see him starting to fit in with the rest of the group which was also to my liking. There are so many great supporting characters here so it’s hard to pick a favourite! You get the nuns from the church, Eda stands out due to her relationship with Revy. Then you have the freaking female terminator maid Roberta who’s insanely good with killing and tracking! Balalaika was another stand out female character, with her connections to the Russian military and the cold and smart demeanour with which she ran the place. She and her crew are responsible for some cool action scenes and I thoroughly enjoyed her arc in S2. Let’s not forget about Chang who’s a male badass in the show but unfortunately, we get very little of him. One nit-pick from my side is that the ladies go through their own tragic backstories, further developing their characters while guys were put to the side. The OVA even shed a glimpse into the past of Revy and you can then understand why she is the way she is but we get nothing for Dutch or Benny.\\n\\n\\n\r\nThe OP is as badass as the anime itself, perfectly setting the mood for some hardcore action. For such a standard track, it doesn't warrant you singing along or anything but it definitely gets its job done by pumping up the action scenes. The good use of sound effects for the car chases and explosions further improved the overall effect of those set pieces. And then the dubbing, which is some top-notch stuff. I loved, loved and loved Hendrikse’s portrayal of Revy!!! She so perfectly embodied Revy’s voice with her masterful give and take choice of words and tone that puts the subs to shame! Plus, the characters of the show themselves aren’t Asian so the dubs gave an International feeling to the show which was required. Aside from great characters, we were also nursed with great dialogues, uncensored with profanity and energy! Finally, the animation here is excellent in both the character design and art work. The characters all have a uniqueness to them which’s strongly displayed throughout the show. I never felt like I was watching a generic villain of the week with a different hairstyle or clothing, they really felt different from one another. The highly-distinguished artwork on Revy mannerisms, movements and expressions is further proof of the amount of quality work that went into this anime. And let’s not forget about those action scenes! We have tons of them, ranging from fights on boats to ships to underwater submarine, car chases, bomb blasts and tons of gun battles! Despite so much variety of action, you are never bored with any of them for they are well choregraphed no matter how long they get! \\n\\n\\n\r\nIf there’s any anime that can easily be turned into a live action movie, it’s this one! And Quentin Tarantino should direct it if the casting is well done. S1 focuses on the entire team doing many jobs, basically an intro to all characters while S2 dives deep into the politics and power play of the city and its players. Not a bad direction to venture off to but it came at the expense of the Lagoon team for we only get Rock and Revy. Also in S2 I didn’t like the changes with Revy at first. She’s a total badass in S1 but then she changes in S2, showing a cuter side of herself. She lost that edge of gun blazing insanity streak to her and started smiling more, she even started wearing a skirt and i felt like it was just fan service! I was also afraid they were going to just stick her into a girlfriend role with Rock in S2 but thankfully they further played upon the platonic relationship between those two. You could clearly see a more humane side to Revy, realizing theirs’s a sensitive side deep inside her despite all her ruthlessness. It’s also totally believable since Rock is slowly wearing her defences down and Revy is finding herself more relaxed and comfortable around Rock. \\n\r\nIn conclusion, the anime has an unsatisfying ending! The story conveniently wraps up but we get NO Resolution from the characters which really pissed me off! I still enjoyed this violent and gritty take on crime mafia and the badass characters that run this city though I would have wished for a more complete ending. It’s still worth your time so check it out!",
            "date": "2017-08-29T08:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 256471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421599.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PakiUSA",
                "username": "PakiUSA"
            },
            "url": "https://myanimelist.net/reviews.php?id=256471"
        },
        {
            "content": "Less episodic than the first &ldquo;Black Lagoon&rdquo; season, &ldquo;The Second Barrage&rdquo; features only three story arcs, the first two are three episodes long each and the final, closing story arc spans six episodes. \r\nFilled with crazy gun-toting babes, wild shoot-outs, mob wars and non-stop action &ldquo;Black Lagoon&rdquo; as it's a roller-coaster ride that rarely slows down the pace. \r\nWhen it does slow down, it finds time to have the characters take a look at the insane, rotten world they live in, walking a fine line between idolizing and condemning that criminal world, depending on which character's view is being explored. This is an interesting element,as it makes the series more realistic, as for humans, right and wrong still do depend on their personal outlook in life. \\n\r\nEspecially the first plot arc, featuring child assassins that were severely abused as children which left them mentally scarred and severely psychotic, handles some very heavy ethic themes. But it does so well, not shying from showing sickening things, they make you stop and think at how such events can affect people and twist their lives and personalities into misery you do not even want to imagine.\\n\\n\r\nMost character development is seen in Revy and Rock, although their personalities and positions at the end of the series may not seem very different than before, they both have changed significantly. \\n\\n\r\nRock remains an interesting character since he never truly delves into the criminal world of his comrades of the Lagoon crew. This is even a pivotal plot point in the final arc, where he is quite accurately accused of remaining in the twilight, not choosing to either return to a normal life or to fully accept a criminal life like the others. \\n\r\nIn the end Rock acknowledges he hasn't chosen a life like Revy's, but he has said goodbye to his past in Japan. He consciously remains in the twilight because he feels it gives him a unique vantage point on everything, a view and insight the others can no longer have because they are lost in the criminal world. So while his position remains roughly the same, Rock does change as he was forced to reflect on his life and the choices he made, motivating them with renewed reasons.\\n\\n\r\nRevy still is as foul mouthed and short tempered as ever, but we see she suffers an internal struggle. She wants to push Rock away and send him back to the normal world because she feels he can not really live in her criminal world. Yet we also see signs of her humanity, wanting to hold onto Rock and perhaps change her own life, to finally escape from the world of death and despair she has always lived in. \\n\r\nRevy also begins to show surprisingly humane and soft expressions around Rock, and it seems being around him has had a positive, soothing influence on her. This may be something she sought herself, as she was the one who originally invited Rock into the Lagoon crew, into her world. No matter how much she may state he doesn't belong there, she was the one who brought him in and Rock choose to stay there. \\n\r\nNo matter how much their personalities may be opposites and collide, Rock and Revy's own bond continually grows, showing a deep trust has formed between them. \\n\r\nEven when Revy gets frustrated because she does not understand what Rock is thinking or what he wants to achieve, she eventually tries and comes to understand him, something she would not do for another person. Rock too seems to become better at handling Revy, and while he may never fully understand her, he doesn't pity her because of her past and accepts her for who she is.\\n\\n\r\nWe also get some surprising new insights into Balalaika, no doubt to make her look more sympathetic to the viewer's eye or perhaps to make the juxtaposition between her innocent youth years a stark contrast to her blood lust as a capable leader of her former Russian army troops, part of the Russian Mafia group 'Hotel Moscow'.\\n\\n\r\nOnly Dutch and Benny do not get much more character development and end up barely appearing in the closing story arc which takes place largely in Japan.\\n\\n\r\nAnimation in &ldquo;Black Lagoon: The Second Barrage&rdquo; is good, all the characters are distinguishable and well animated in most scenes, this goes for the action as well. However dips in the animation can be seen here and there, but never to the point where it bothered me.\\n\r\nThe soundtrack is fine, with typical guitar and fast beats to accentuate the action, though this second season also featured a more mellow ballad for the child assassin arc. The eclectic opener 'Red Faction' by Mell is used this second season as well, which is fine with me as it's a catchy tune with raw guitar chords.",
            "date": "2008-05-17T11:03:00+00:00",
            "helpful_count": 15,
            "mal_id": 4795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=4795"
        },
        {
            "content": "Once again, Black Lagoon has continued to deliver nonstop action! The fighting scenes are more mature and puts more emphasis on the characters’ backgrounds in the second season! There were a few things I disliked unlike in the first season, but the pros greatly outweighed the cons. It’s definitely worth watching, especially if you enjoyed the first season!\r\nStory (7)\r\nThe Lagoon Company is rarely together. There is less of Benny and Dutch, but the scenes are just as exciting with Revy and Rock being separated. The 1st and 2nd arcs took place in the fictional city of Roanapur in southeast Thailand, also known as “gun paradise.”\r\nThefirst arc was extremely gruesome and consisted of merciless new villains, two twisted vampire twins who treated people’s lives as if they had no value. Several mysteries surround the murders and the twins, and the violence within the city is spectacular. Besides the thrilling action the vampire twins brought to the series, the fact that they were called “vampires” is even more mediocre than Twilight. There’s no blood-sucking or burning to ashes in the daylight. The only proofs were their background in Romania and their sharp teeth, which is my complaint about the artwork.\\n\\n\r\nThe second arc was my least favorite, besides laughing at practically everyone being stupid. New characters were funny yet annoying during fight scenes, because they talked way too much. Also, some of them claimed to be dangerous and hardcore, but they showed too much emotion and whined over the smallest things in the spur of a fight. However, the excessive talking has an advantage by resulting in some secrets being revealed about the main characters. There are also more weapons besides guns used in fights, which makes the scenes entertaining nonetheless.\\n\\n\r\nUnlike the 1st and 2nd arcs, the 3rd arc took place outside of Roanapur and into Japan. Balalaika’s true colors are revealed in this arc, causing nonstop murders between clans and mafias throughout the rest of the series. Rock shows his annoying side by not facing reality to the new world he’s living in. Also, new characters, including a swordsman, bring on incredibly entertaining fighting skills. A swordsman vs. a gunman is definitely a fight to see!\\n\\n\r\nThere were some unanswered questions, including from the 1st season, but they have a chance of being answered in the 3rd season.\\n\\n\r\nCharacters (7)\\n\\n\r\nRock hasn't changed a bit. Despite the year he spent with Black Lagoon, he has yet to show any toughness. He is so annoying, because all he ever does is talk about nonsense. He never cares how dangerous the situation, and it’s like he doesn’t care about dying at all. He’s such a weakling that people continue to use him as a shield, and he always needs to be protected or rescued. No one takes him seriously, and I can’t blame them. However, I’ll give him credit for his honesty and courage to speak in order to avoid meaningless war.\\n\\n\r\nRevy shows more of her soft side. Maybe she’s been hanging around Rock too long. She doesn’t shoot first and ask questions later as usual. Instead, she makes meaningless threats that never follows through. She’s still “Two Hands,” but her shots aren’t nearly as accurate as they should be for someone who’s supposed to be feared by others. Besides that, her hot-headed temper and vulgar language is still there, making some scenes hilarious.\\n\\n\r\nEda (1st and 2nd arc) is another version of Revy with the same hot-headed temper. She made a short appearance in the 1st season as a nun from the Rip-Off Church. In addition to that role, she’s cool with Revy and appear to have a strange friendship, despite getting on each other’s nerves. She can handle a gun, but she’s greedy and only follow the highest bidder, even if it means jeopardizing her chances of living. Money seems to be her life. Also, she appears hardcore in front of most people, but she actually panics when she nears defeat. She even shows signs of fear, which is why Revy has her beat by a long shot in the toughness category.\\n\\n\r\nBalalaika (1st and 3rd arc), mockingly known as “Fry-Face,” is the scariest and most dangerous character of all. She destroys everything in her path without a care in the world and kills without blinking an eye. Well, what do you expect by the leader of the Russian mafia (Hotel Moscow) and a former military soldier? She’s no longer behind the scenes, and she shows everyone that she means business. Her presence makes the whole series entertaining.\\n\\n\r\nSound (8)\\n\\n\r\nThe characters’ voices fit their personalities precisely. For example, Balalaika has the hardest and fearful voice needed for someone in her ranking. The same OP and ED are present in the 2nd season, but there are two new songs (one from Episode 3 and the other from Episode 12). They are absolutely beautiful and goes perfectly with the episodes’ theme, especially the a capella track called “The World of Midnight” concluding the first arc.\\n\\n\r\nArt (8) \\n\\n\r\nMadhouse has some of the best artwork in my opinion, but the art should have been more detailed in the 1st arc. There were two vampire kids in the 1st arc, but the word “vampire” came from the sight of their teeth. Some other characters, including Revy and Dutch, have sharp teeth drawn the exact same way. If the twins are supposed to be vampires, at least distinguish their teeth from other characters somehow.\\n\\n\r\nEnjoyment/Overall (7) \\n\\n\r\nAlthough the first season was better in my opinion, the second season brought meaningful stories about the old and new characters. The action is still there, and it’s gotten even better with the different weapons. There are more stories and secrets revealed in the second season, so I highly recommend it!",
            "date": "2013-11-10T22:06:00+00:00",
            "helpful_count": 14,
            "mal_id": 119921,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=119921"
        },
        {
            "content": "This review contains spoilers. Please, proceed with caution.\r\n\"Only business, nothing personal\".\r\nDo you know that feeling when you are watching a TV show, or a movie, maybe and anime / manga, playing a videogame or reading a book, and those generic, boring characters that pretend to represent evil show up? In classic series, like Saint Seiya, where is common to contrast the light and the darkness by an stereotyped, greek representation of justice and evil, you can see that in every fight, every conversation. But, what if someone broke down that vision and put the 'bad ones' in the spotlight? The answer is Black Lagoon: TheSecond Barriage.\\n\\n\r\nSeen from outside, Black Lagoon is just another action anime that doesn't have nothing more than random shooting scenes and boring, bland characters, with a predictable story and mediocre animation. Well, the one who thought that, couldn't be more wrong, because this second season has much to offer to the viewer. Not only tense moments but character development and a strong, dark and nihilistic philosophy that I personally loved.\\n\\n\r\nTo see this season and fully enjoy it, I recommend you to watch the first one previously, to understand why the characters act like they do and their relationships.\\n\\n\r\nThe story is really good, one of the strongest points in this anime along with the characters. I must admit that the dark atmosphere really catches me, like in Berserk or Evangelion, but it is not only dark but deep. Basically, everything developes around Revy Two Hands and Rock, the main characters that are part of an obviously ilegal delivery service called 'Lagoon'. We are allowed to see the crew in some jobs and how they live and react to some events in Roa Napra. Basically, we have three different arcs here: the Twins arc (which I personally consider to be a fucking masterpiece), the Fake Money arc (for me, the most mediocre), and the Japan War arc, which is pretty good too, and I personally enjoyed when I thought the series was going downhill. While I enjoyed the Fake Money arc, I felt it was like a bridge between the greatest parts, some filler that has more random action (but an interesting discover) than actual plot.\\n\\n\r\nThe Twins arc is one of the greatest I've seen in anime, not only because of the action (which is unbelievably good, with unpredictable plot twists) but of the strong realities shown there. We have a pair of twins that are in Roa Napra to kill Balalaika, hired by a random hooligan that I'd never seen or heard about in Black Lagoon. Revy and Eda, the nun of the Violent Church, want the reward for their head, so they pursue them through the city. When one of the twins finds Balalaika, she is shown merciless (when it was only a child, maybe 14yo or younger) and watches how it's killed without even blink. The other twin pays the Lagoon company to escort her to an island, only to find death in hands of a hitman hired by the Hotel Moscow.\\n\\n\r\nThis arc is told to show the viewers that life isn't easy, or, at least, isn't easy for everyone. Every day, some people go out to the street to kill, kidnap or steal. Maybe for money, like the Lagoon company, maybe for honor, like Balalaika and his army, or maybe for pleasure, like the twins. For them, every single day is a 'kill or be killed' reminder, whether they like it or not. Life is dark, hard and in the end, you may not be satisfyied with what you lived. But, in the other hand, there is more than meets the eye, because not everything has to be violent or a bloodthirst desire. There is love, human warm and confidence. Sadly, it finishes with a harsh reality: you can't save everyone, just live your life and try not to be involved in those things.\\n\\n\r\nThe Japan War arc is good too. Things like loyalty or ambition are put to the test, but I prefer not to spoil it, because is the longest one and I want everyone to take a look at it with their own eyes.\\n\\n\r\nThe animation and art are good, really good in the first chapters, but have a notable downgrade in the last three, to the point of be annoying sometimes. The final fight has serious budget problems.\\n\\n\r\nThe sound felt atmospheric and correct in every single moment. The op and the ed are the same as the first season, but they are equally awesome. I personally enjoy the ED, because it gives that lonely sensation, like if Revy was walking through a path of thorns, being hurt in every step she gives.\\n\\n\r\nThe reason why I enjoyed this season that much was because of Revy, Rock and Balalaika. While I think characters like Dutch, who is a charismatic and intelligent douche, capable of recognize Sartre quotes, are left apart in favor of those mented, I think it was a really good choice, because they are exploited to the maximum of their capabilities.\\n\\n\r\nIn the first season, Revy is shown like a cold woman, without any kind of human feeling but the most violent ones. Revy enjoys killing, shooting, drinking, smoking and earning money, but, how much of her personality is her 'real personality'? In this season, we see Revy much closer to Rock than previously, she is literally told to be 'his weapon', and has risked her life for him even if she textually refused. When Rock is in Japan, working as Balalaika's translator for the Yakuza, Revy seems to enjoy what a normal life is, and there is even a moment when Balalaika says something like \"Two-Hands, don't even think in a life like this one\", refering to a normal, safe routine. While other animes show us how cool is to be bad, how powerful a gun feels in your hands (like the sword in Vagabond), Black Lagoon goes a step further and actually puts the real weight shooting and killing has in Revy's mind.\\n\\n\r\nIs the human born with the capacity of doing evil, or does he aprehend it through its life? It is told that Revy had a dark past, and some events conditioned her to have the life now owns, but even if she seems to enjoy the life she has, can't avoid to envy Rock's normal life and a place to go back.\\n\\n\r\nRock has some improvement too, but none close to Revy and Balalaika's. To me, Rock represents the person that can't choose between two antagonistic choices. He is told to be in the 'sunset', because walks through darkness and light at the same time, being able to choose the one he prefers when it suits. Rock has some badass moments when he has to discuss Balalaika even at risk of being killed by her. He discovers his own dark, even if he is thinking in the greater good. In the end, Revy desires what Rock has, and Rock discovers what Revy's mind is made of.\\n\\n\r\nBalalaika was for sure a huge surprise for me, because in the first season it is shown like a strong woman, for sure, but with some moral values. Here, we discover that she is a cold hearted militar, ex Spetsnaz, that doesn't fool around. She has her own moral code, that is based in mutual comprehension and respect, but only for the men under her flag. They respect her, and far from having fear, they devoutly idolize her as a leader. This goddamned sexy russian woman doesn't kill for fun nor money, she does it because it has to be done.\\n\\n\r\nI enjoyed this series, I really did. It was an incredible trip through some of the most dark and deep human desires: evil, greed, envy, lust, but also hope and comprehension, that are always present in our hearts.\\n\\n\r\nThanks, Lagoon company.",
            "date": "2019-02-20T13:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 302087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7300151.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PentagramShogoki",
                "username": "PentagramShogoki"
            },
            "url": "https://myanimelist.net/reviews.php?id=302087"
        },
        {
            "content": "Where to begin. Black Lagoon may in fact be the worst animation ever, and it boggled the mind that someone felt a second season was necessary. Just as well, I feel it is my duty to the MAL community to help cease the spread of misinformation that seems to be plaguing the internet about this \"series\" (and i use the term loosely I assure you)\r\nStory:1 Basically it's just American garbage of run around and shoot everything that is in sight. Clearly, the creators of this atrocity felt the need to service the lowest common denominator. I find it rather insulting to be honest, thatsomeone out there thinks so little of my intelligence that this filth could pass as a \"story\" of intrigue.\\n\\n\r\nArt:1 We have seen it all before I'm afraid, colors in between dark lines, however this particular animator was quite inconsistent and down right boorish with their animations.\\n\\n\r\nSound:3 I suppose guns and explosions all sound the same.\\n\\n\r\nCharacters:1 This is my main grievance with this garbage, it is the fact at how one dimensional and flat the characters are. Their motives are spoon fed to us and the exposition that is thrown into our faces leave little to the imagination, as if we are required to have everything spelled out for us. No depth at all, just a bunch of shallow, empty puppets who are placed in their specific roles.\\n\\n\r\nEnjoyment:1 For reasons stated above.\\n\\n\r\nOverall:1 Stay away if you value your time and dignity.",
            "date": "2010-05-28T08:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 26523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/327649.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/oneeyedwilly25",
                "username": "oneeyedwilly25"
            },
            "url": "https://myanimelist.net/reviews.php?id=26523"
        },
        {
            "content": "(I'm treating this as a comprehensive review of both seasons, because the two seasons of this anime are more or less the same)\r\nWho would have thought that a stereotyped crime drama would become a philosophy showcase? Guns, murder, mafia wars, and the like are all tied in to Nietzsche, Kirkegaard, Sartre, and Heidigger. It made the show a bit uncomfortable to be honest, with a shoot-em-up bang bang action thriller confronting itself, and ourselves in the process. The show casts aside morals, but unlike most shows where we justify it with an “oh, it's just the enemy” sleight-of-mind, this show rubs its amorality in ourface. Bloodbaths are taken just a little too far, outside acceptable hollywood. The characters were such interesting characters, never falling to the temptation of merely being either a philosophical model or a stock anime character, but always having a life, conflicts, and past that complicate and interest. None of the characters are meant to be all that likable (except maybe the protagonist), and despite this I found myself completely attached to them. The style was brilliant too, being a direct homage to Quentin Tarentino and all others in his lineage, and it had a kick ass opening song. Despite such a great opening song (and a good closing), the sound suffers from terrible accents when the characters try to speak english. Black Lagoon is a strange out-of-nowhere flash of brilliance, a intellectually sophisticated mainstream action show, but little surprises like this are why I consider anime to be more than a time waster.",
            "date": "2010-05-23T17:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 26308,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332142.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Seabury",
                "username": "Seabury"
            },
            "url": "https://myanimelist.net/reviews.php?id=26308"
        },
        {
            "content": "What makes a good anime? Plot....characters...and perhaps an excessive bit of violence ^^. Though Black Lagoon: The Second Barrage isn't quite different from the first season there is viewer joy to be found in the second season...\r\nMost memorable (and perhaps the highlight) is the first three episodes of Second Barrage. The debut of Hansel and Gretel hurls us into the story and by the end of Swan Song At Dawn you'll wish you could replay it (at least I did ^^). \r\nBut either than that this season moves in a more serious direction with Mafia fights, sad pasts and a whole lot of trigger happyladies. Well what do you expect from an action anime? Even so I was surprised by the realism some of the topics held and the after thoughts I had.\\n\\n\r\nAll in all Black Lagoon with it's great visuals and exceptional voice acting (lol, Rock sounds like Light Yagami :D) this is a great anime if you're tired of the usual sword fights and random fan service (can that be?!). Enjoy it! ^^",
            "date": "2009-09-05T09:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 18420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230263.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LoliM",
                "username": "LoliM"
            },
            "url": "https://myanimelist.net/reviews.php?id=18420"
        },
        {
            "content": "Black Lagoon: The Second Barrage puts a really interesting spin on the atmosphere from the first season. The gore and the cursing still there and the season was still as enjoyable as the first but it had it's share of disappointments.\r\nThe art (9/10), and sound (9/10) don't change and they are really good!! The characters are also enjoyable because they dont drastically change from one season to the next but they do focus on other characters than the Black Lagoon crew like they did in the first season.\r\nThe story (8/10)  is pretty good as well. its something you would expect any other mafia woulddo; Hotel Moscow is trying to gain territory in japan, terrorizing japan's biggest mafias (taking out all leaders that done comply with Hotel Moscow's demands) and uses the Rock to translate and brings Revy along to guard him while they are there. there are still explosions, car chases and awesome fight scenes and shoot outs but the second series takes a more personal and secluded path than the first. It really focuses on Revy and Rock and their relationship verses Rock getting to know the whole crew in the first season which was somewhat a downer because Benny was my favorite character and we really never got to see him or Dutch. It was really focuses around Revy, Rock, and Ms. Balalaika. We explore the pasts of all three of these characters and watch as they try to connect with each other. the second season is basically watching Balalaika, Revy and Rock try to understand each other better by looking into each other's pasts. It also gives the audience some closure which was nice because we really never got that in the first season.\\n\\n\r\nOverall (8/10)  is was pretty good. I still really enjoyed watching it because it still had all of the plot twists the first season had but i really wish it wasnt in japan and wish we got to see just a little bit more of the Black Lagoon crew together because that IS what the show is about after all. It was really interesting to see their take on Revy and Rock and i really liked the character development.  \\n",
            "date": "2015-03-23T05:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 183119,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4460875.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/berserkersoul",
                "username": "berserkersoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=183119"
        },
        {
            "content": "(This review covers both seasons of Black Lagoon.)\r\nFor the time worth watching this, people have been describing this as the younger sister of “Cowboy Bebop”, being the anime equivalent to the big action blockbuster Hollywood movie (The Rock, Bad Boys, any 80s’ action flick you can think of) with the many details of graphic violence, excessive cursing and language, sexuality thrown in there and a bit of inspiration some such filmmakers as Quentin Tarantino & John Woo, although the former did a bit of anime in his venture (yes, you should know what I’m talking about).\r\nThe story follows a team of pirates/mercenaries known asLagoon Company, which smuggles goods in and around the seas of Southeast Asia in the early to mid-1990s. Their base of operations is located in the fictional harbor city of Roanapur in southeast Thailand (somewhere in the Amphoe Mueang Trat district, likely on the mainland north/northeast of the Ko Chang island or on the island itself). They transport goods in the 80-foot (24 m) Elco-type PT boat Black Lagoon. Lagoon Company does business with various clients, but has a particularly friendly relationship with the Russian crime syndicate Hotel Moscow. The team takes on a variety of missions—which may involve violent firefights, hand-to-hand combat, and nautical battles—in various Southeast Asian locations, even going as far as Phu Quoc island of Vietnam and when not doing much, the members of the Lagoon Company spend much of their down time at The Yellow Flag, a bar in Roanapur which is often destroyed in firefights.\\n\\n\\n\\n\r\nNow for the characters of the show, it does have a very vast range of characters but sometimes that showcase as little as they can. Rokuro Okajima, or Rock, is the main protagonist of the show as the Japanese salary man who is so bored and displeased with his daily life and no one exactly gave a shit about him. Actually, when the company he worked for send him out to deliver a package and he gotten captured, they just abandoned him as he was expendable to them. Aside from being captured, Rock manages to keep his mild-mannered and humble attitude throughout the whole show, which is in contrast to our next character, Revy, also known as “Two Hands” (at least she didn’t swing chains). She is one of the most foul-mouthed, merciless, sadistic and fatal characters of the show and that really got the show in drive. Hell, most of the opening sequence is practically her being showcased in action and while she often gets irritated by Rock in the first season but she is protective of him as the series goes along.\\n\\n\r\nThe other members of the Lagoon Company include Dutch, the black leader of the company, who is more of the easygoing and relaxed members and last, there’s Benny, the tech specialist member who in his past gotten into the mafia and would’ve ended up dead if Revy didn’t saved him. Now, I would like these characters to have backstory in the show but unfortunately, it’s being taken up by the former two characters of the series, which really disappointed me considering they seemed like interesting characters to know…maybe they might be in the manga, though.\\n\\n\\n\\n\r\nLike I said, there was a wide variety of characters in the show that will probably be too many to mention and name drop like Balalaika, the boss of Hotel Moscow, one of the many gangs that are mentioned in the show and not only she is very skilled at what she does but practically a character that makes her presence to be feared. There is also the Hong Kong Triads lead by Mr. Chang and his top assassin Shenhua; The Colombian Cartel, The Church of Violence, The Aryan Socialist Union (Neo Nazis.) and The Washimine Group (Japanese Yakuza), who are more heavily-involved towards the end of the show.\\n\\n\r\nThe show is total 24 episodes, with the first and the second season called “The Second Barrage”, and I will say that the second season has more of a storyline while the first is just random missions with little storyline aside from the main one and yet for some characters like Roberta and her arc makes me crave for more of her (luckily, there is an option for that) but the vampire incestuous twins Hansel and Gretel didn’t feel organic to the series or even to most of the plot. They could’ve been thrown out of the show entirely and not much of a difference would have been made.\\n\\n\\n\\n\r\nAs for the animation, the credit all goes to Madhouse for the many use of blood, detailed fight scenes and gun battles, chase scenes, beautiful scenery, and for the opening and ending sequences, which the music for both worked well. The OP theme, “Red Faction” by MELL will get your blood pumping as the show begins, although singing it….I would not suggest if you get the lyrics and the ending music….yeah, music, it’s not much of a theme but many people complained about it being slow, depressing, and drags down the tone of the series…..maybe it does but most of the time when the show have its serious moments, it’s appropriate to rather end on that note rather than just generic hard-driving rock music. The ending music for episode 15 was actually one of my favorites but the last ending theme music was more of a “meh” to me.\\n\\n\\n\\n\r\nNow, as for the dub from Geneon/Ocean, it is a bit 50/50, on the one hand, the dub fits more naturally than the sub, considering its flair is more international and some characters speak English naturally, performances from Brad Swaile, Maryke Hendrikse, Brian Drummond & Dean Redman, which from him I will say this: “Finally, a black character in an anime is voiced by an actual black guy.” This is a good thing, people. But, unfortunately, some of the voices either irritated or creeped me out like the voice of Hansel and Gretel really had me freaking out a bit, considering I heard them before on a show that in a conscience that I’m not telling you….well, one of the actresses was the voice of Nurse Witch Komugi. Garcia just seems annoying and grating whenever he speaks and whoever voiced Shenhua has the worst and slightly offensive Chinese voice I have ever heard. It sounds like that fake accent most people would put in a black-owned hair salon and that’s about as Chinese as the Panda Express.\\n\\n\\n\r\nFINAL VERDICT: By all means, Black Lagoon is worth seeing and definitely worth buying. This could be one of the few anime that I see Western culture getting into, maybe not as much or iconic as Bebop but still. It has a very in-your-face tone mixed with dark comedy and sometimes even darker drama once it gets more storyline driven. Your friends will love this but I wouldn’t recommended seeing this with family or kids…..unless they into that, too.\\n",
            "date": "2013-01-16T10:08:00+00:00",
            "helpful_count": 9,
            "mal_id": 83841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1028709.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HybridMedia",
                "username": "HybridMedia"
            },
            "url": "https://myanimelist.net/reviews.php?id=83841"
        },
        {
            "content": "I've always had my own personal philosophy when it comes to anything anime: “If it's anime, it can't be all bad.” So as much as I disliked Black Lagoon, it really wasn't such a bad show in itself as much as it just wasn't my cup of tea. However, it's also my opinion that this show does not live up to the hype and buzz it's been receiving in the media and all these comparisons to Cowboy Bebop, because Bebop was epic compared to this which really at the core is tantamount to only two words: Fan Service.\r\n ANIMATION \r\nGreat art. I can't complain aboutthis; great looking characters, glossy scenery. This is one slick piece of work, from the appearance of the characters and the vehicles they drive to the seedy towns, cramped bases and sprawling compounds. This series is most definitely not lacking in the visual appeal department. Since there are many, many gun-fights, car chases and destruction galore much more importance is given to relaying the story visually, so we the viewer see lot of fast cars swerving, guns blazing, glass shatterings and metal crunching...and it's all done to a slick perfection.\\n\\n\r\nBut also creatively speaking, I don't think this animation and drawing style completely befits the show....it was too slick and too CLEAN at times which made the whole “Roanapur is the scummiest, vilest place on earth” seem a little disingenuous. If anything it seemed to lack or not reflect the so called “GRIT” message of the show.\\n\\n\\n\r\n SOUNDS \\n\r\nThe OP Theme I loved! Rough, gritty, feminine rock which was very fitting for the female lead. The ED Theme I wasn't too thrilled about and at first it didn't make much sense to me but after a few times it made sense... tho I still don't like it as an ED theme\\n\\n\r\nThe Japanese voice acting was good right up until they tried to speak English. I don't have a problem with Jap-English when it's portrayed as a Japanese not understanding English or trying to speak it....but when it's used to illustrate a person as FLUENTLY bi-lingual, then I have issues with it. Those voices are way too rushed, flat, monotone and just to phonetically horrible to be perceived as a fluent speaker....to be honest it sounded computer-ish and was very distracting.\\n\\n\r\n STORY \\n\r\nI don't think there's a REAL story as in an overall story so it may not necessarily be sequential and I would hardly call it a serial. It's really just a collections of missions or excursions. The original synopsis is pretty trivial: Nerdy white-collar schmuck finds himself [both literally and figuratively] within a degenerate society where everyone is “Bad-Ass”and so everyone carries a gun and likes to shoot various things and people.\\n\r\nPersonally I think it's just a thinly veiled premise to create another anime where big-breasted girls with guns run around wearing skimpy clothes....Fan Service. Fan Service all of it; gratuitous violence, excessive destruction, oceans of blood, big breasted girls with guns in skimpy clothes in all sorts of provocative poses.\\n\\n\r\nBut then by then end, a miracle happened....the show got good! They just kinda of turned it around, the whole “T & A” Showcase was toned down a bit and they focused on content. Of course this all happened by the second half of the show or “Second Barrage” with the whole Vampire Kids bit. By then the viewer gets to understand that this is not just fun, it's not just “hey, let's shoot everything!” The viewer gets to see real depth and real sadness, the real harshness that is the world.\\n\\n\r\n CHARACTERS \\n\r\nThe characters aren't really too deep or complex. It's really all just about the different levels of interaction between the various gangs from different races and mafia sects. The only real character of conscience is Rock, who fluctuates between being good-guy with a heavy dose of cynicism or a bad-guy with too soft a heart. I tended to like the side-characters more because we, the viewer, we allowed to delve a little bit into their pasts and psyche which we aren't really allowed to with the main characters...except Rock. They were drawn really well, but if they were supposed to be of different races I couldn't easily tell......the only exception of course, being, the black guy.\\n\\n\r\n ENJOYMENT \\n\r\nI don't totally dislike fan service nor do I frown upon it like most seem to, however, I would like a little “heads up” as to what I'm watching so that I'm prepared to watch, assess, evaluate and even enjoy the program more because I'll know what to expect. To be honest and to give credit to the show they did “tone it down” a little bit by the second half [The second Barrage] The heroine was no longer in those horrendous “Daisy Dukes” shorts.\\n\\n\r\nIt's good to watch maybe on web-broadcasts/podcasts, on TV or OnDemand to while away the time doing homework or just @ work, but it's hardly a collector's item....and they should just end it as it is at the second season.",
            "date": "2008-04-24T09:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 4283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=4283"
        },
        {
            "content": "The visual quality is as great as the first season and a little more of character development takes place. I expected a little more of story to at least cover the holes that are evident, but we are left with nothing but assumptions of the motives of each one and their real goals. As with the first season, there are a few episodes that are a bit to hard to the eye because of the story itself (it is focused in the worst of human nature, from kidnapping, torture, pornografy, blackmailing and of course killing) but if you have the guts then is a goodchoice.\\n\\n\r\nThe music is somehow the right choice for this show but I found it repetitive at a long term.\\n\\n\r\nAs with the first season, the best aspect of this anime is the way it shows the &quot;twisted&quot; nature of human beings. It focuses on the worst aspects of the human psyche (not a bad thing) and it is that difference which makes you want to see it. As I said before just watch it if you really want to witness the wickedness of the human beings.\\n\\n\r\nEven though theres a lot of action through every episode, the most interesting thing is the relationship between Revy and Rock.In this second season you get to see more changes with every episode as you get to see a change of heart from both of them.\\n\r\nAlmost every other character has less to no importance at the long run, and most characters only make an appearance for a few episodes before being forgotten.",
            "date": "2008-04-23T13:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 4262,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/55212.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nightscream",
                "username": "Nightscream"
            },
            "url": "https://myanimelist.net/reviews.php?id=4262"
        },
        {
            "content": "In Short:\r\nIf you are an action fan & love fighting, shooting & hard talks, this is a good anime for you.\r\nIn brief:\r\nBlack Lagoon Second barrage continues after the 1st series & has plenty of action & enjoyment just like in the 1st series.\r\nIf you liked the 1st season then definitely U\"ll like the 2nd season too.\r\nPlot is quite similar to the 1st series.Picking up random missions & completing them. Full of Action, blood & gore. Difference is now Rock(the main protagonist) is considered as a trusty team member & is needed in many jobs.Also this time the focus is more on Rock, Revy, & Balalaika.\r\nStory:\r\nThestory seems more harsh in the 2nd series, showing some of the unspoken truths about Mafia world, Sorrowful ending of the enemies.\\n\r\nAlso the words used this time are more powerful & strikes in mind. Humans being lead to the Dark world without having any choices--is one of the main theme of this series.\\n\\n\r\nCharacters:\\n\r\nThe characters are very well developed & the dubbed voice is fantastic & completely matches with the characters.\\n\r\nBackground of the characters are though vague but shown in good manner & shows the reason of their attachment to the dark world.\\n\\n\r\nArt/Animation:\\n\r\nI don't know much about art, so cant really explain. To me the art seemed great. \\n\\n\r\nMusic:\\n\r\nThe OP & ED songs have the same lyrics as the 1st series. But they are sung differently \\n\\n\r\nEnding:\\n\r\nThe ending is sorrowful but spectacular. In short  The only way to give peace to those of the dark world is to end their sorrowful life\\n\\n\r\nEnjoyment:\\n\r\nSimilar to the 1st season It's a  very good anime to watch. There is not a single boring part & is filled with Action & hard talks.\\n\r\nAlso the story & the characters are interesting & will cling you on to your seats until you finish the series.\\n\\n\r\nDownside:\\n\r\nSome things are over exaggerated. Also few things are way unbelievable. Tries too hard darken the characters.\\n\\n\r\nOverall:\\n\r\nIt's a must watch for any action fan.And If you watched the 1st season & liked it, then it's a crime not to watch the 2nd season.\\n\r\nAt least I can guarantee that you will not be bored.",
            "date": "2011-08-09T21:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 41155,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/501729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jamil",
                "username": "Jamil"
            },
            "url": "https://myanimelist.net/reviews.php?id=41155"
        },
        {
            "content": "Black Lagoon: The Second Barrage is as unapologetically violent and foul mouthed as its predecessor, but it also delves deeper into the human psyche than the original and forces us to explore themes of morality, power and what it means to be human.\r\nThe Second Barrage picks up the story of The Black Lagoon Company, with Rock further settling into his new life in Roanapur. Mysterious assassins have begun picking off members of the different mafia groups running the city, and tensions are at fever pitch. By the time this story arc comes to a close 3 episodes later, you get the distinct feeling that TheSecond Barrage is decidedly more serious than the original, with violence being presented more as a consequence of the depravity of the human condition than the punchline in a series made to shock and awe.\\n\\n\r\nThe middle arc with Greenback Jane is more light hearted and reintroduces some favorite characters from the first season, along with a host of new ones that are at turns comical and very very creepy. It showcases perfectly the amorality of the denizens of Roanapur as former allies fluidly become foes at the bat of an eyelid. It is in some ways a stark reminder of just how dangerous the world Rock lives in is, and demonstrates how remarkable the bond of trust forming between Rock and Revy is.\\n\\n\r\nThe final arc is far grander, but also the most problematic. We get to see a lot of more the mysterious and powerful leader of Hotel Moscow, Balalaika. Set mostly in Japan, the story continually juxtaposes Rock's old life and setting in Japan against the criminal underworld he has now chosen to inhabit. Revy demonstrates a surprisingly soft side in this arc, constantly fretting over whether or not Rock is better off returning to his old life. It's not the \"get out of here, I don't need you\" routine we're used to seeing, but rather, a softer examination of what is best for the man who has been part of her crew for the better part of the last year. It's very well done. Pasts are revealed as situations complicate themselves. There's a very existential reflection on choices and superb monologues on accepting our lot in life. What is right or wrong is hard to determine as the philosophical backgrounds of the opposing positions is sound, but if anything, this central conflict serves as a reminder that this season is far more than characters toting guns and blasting their enemies into oblivion.\\n\\n\r\nOverall the series is superbly animated. For a series released in 2006 I believe, the art work, animation of vehicles and such is absolutely outstanding. The opening theme is particularly suiting, until you realize the words are in English, and then you simply cannot get over the pronunciations. Which brings me to my biggest gripe with the series, now, I ended up watching the subtitled version and I believe this is a mistake. There is much and more that is lost in translation this way, and certain lines simply do not make sense in the overall context of some conversations, or simply do not carry the same weight they do in the English dub. Moreover, the issue of language becomes particularly problematic in the final story arc because the characters all speak in Japanese, but are supposed to be in a setting where the fact that they do not speak Japanese is key to many of the plot points. It's definitely distracting ... and Revy being Chinese American, the show's attempt to make her speak English in certain scenarios in the sub are simply .. well, I would say hilarious if it wasn't so frustrating. It's hard to believe that a series that did such a good job everywhere else, would drop the ball so badly in this department. I would definitely DEFINITELY recommend watching the dub to avoid these issues.\\n\\n\r\nThen there's the issue with the pacing of character development. Ok, so Rock and Revy go on some introspective journeys together, and although subtle you can see Revy's attitude towards Rock change a bit, but the issue here is that not only is this not very much development in a 12 episode arc, or overall from the first season, but the series spends most of its time focusing on these two at the expense of the other members of the Black Lagoon Company, who basically get shafted. I'm willing to trade on screen time for those two, if we were given more out of Rock and Revy's on screen time, but there's precious little here and most of the \"development\" you would have to insinuate yourself. In one scene for instance, Revy attacks another character and says \"If you ever tease him (Rock) like that again, I'll kill you\" but we never really find out what this means in the larger context of her relationship with Rock. We do know it doesn't take much to get her to pull a trigger ... now I'm not expecting a love story here, but I would have liked to see something solid to indicate how Revy really feels about having Rock around and vice versa. Sadly, it seems to be mostly business with these two, and the only thing we know for sure is that they have mostly accepted each other as inevitable objects in the other's existence.\\n\\n\r\nThis aside, The Second Barrage is an absolute delight. There are not many anime's that manage to thoroughly entertain while disturbing your perceptions of morality so effortlessly. The show certainly revels in it's goriness, but for those paying attention, there are deeper issues being tackled here. I highly recommend this series, watch the dub if you can, as you will most certainly get more out of it than the sub, and I for one am eagerly looking forward to the more adventures from Rock, Revy and the rest of the Black Lagoon Crew.",
            "date": "2013-02-10T10:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 86441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266895.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Last_Chevalier",
                "username": "Last_Chevalier"
            },
            "url": "https://myanimelist.net/reviews.php?id=86441"
        }
    ],
    [
        {
            "content": "I feel kind of weird to be writing a review for Black Lagoon: the Second Barrage after I just wrote the review for the first season. Why? Because I don't really consider them to be two different seasons. It's just a continuation of a series I really didn't expect to be as good as it was the first time around. All 24 episodes are just Black Lagoon to me, and for good reason: Second Barrage keeps up the high octane action that made the first season such a blast. The art is the same, the sound is the same (which is unfortunate we didn't getany new songs added in), and the VA's are the same, thank God. Except something fail happens -- some of them start speaking in English in the last arc, and the pronunciation and grammar are horrible. Actually, the lines were cringeworthy too for Revy, who is supposedly a Chinese American so I would expect better English from her. It was revealed near the end the cast actually speaks English all the time and it's only in Japanese for the audience's sake. Having learned that I'm rather curious how the English dub sounds in some of these later episodes where English, Japanese, and Russian were all used in one conversation. I would have rather they just kept Revy talking in Japanese for the remainder of the show as I saw it, although that makes another character shouting &quot;Hey! Speak in Japanese!&quot; to her seem weird. ;-)\\n\\n\r\nOne difference is the story length this time. Last season was a series of 2-3 episode arcs wth a couple one-shot stories added. This season the entire last six episodes are absorbed into a single war between the old guard Japanese mafia and the up and coming Russians of Hotel Moscow, that takes Rock back to his home and to face the past he turned his back on. The &quot;Greenback Jane&quot; arc is easily the weakest of the season (probably both seasons) but is made up for with the first story arc featuring murderous children (yes, deadly lolis) and the epic ending arc.\\n\\n\r\nLike The Melancholy of Haruhi Suzumiya, this is one show I was disappointed to see end, and it looks like I wont have to yet, as a Third Season has been announced now.",
            "date": "2008-09-04T14:46:00+00:00",
            "helpful_count": 120,
            "mal_id": 7696,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60494.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nx6",
                "username": "nx6"
            },
            "url": "https://myanimelist.net/reviews.php?id=7696"
        },
        {
            "content": "Welcome back Rock, Revy and the gang! In this second installment of Black Lagoon, we continue our journey through Roanapur, the city of criminals.\r\nIt's somewhat sad, but I have to begin with a dissatisfied distaste in my mouth after finishing this season. What's so sad about it? Well, for one thing, the story.\r\nI wonder if they simply wrote down a whole bunch of plot ideas on paper, crumbled them up in a ball, put them in a hat and drew at random. Boom, just like that, they came up with two, ridiculously stupid story lines to encompass 12 episodes. Each is so far fetched thatyou can't help but feel like you're watching a terrible D rated movie. Nothing is realistic (not even close), and nothing is even attempted to be explained to you. Flat out horrible.\\n\\n\r\nOn the other hand, the animation for these terrible plots was well done. Revy looks great, Rock is his pansy self, and Dutch is still black. Fights are fluid, but who cares with what they gave you to watch.\\n\\n\r\nThe music, as far as I can tell, is the same thing from the first season. I can't recall if the opening is different, but it's well done. The ED is slow, tacky, and I skipped it every time. Background music throughout the show is alright, but nothing worth buying.\\n\\n\r\nLet's move on to the characters and their interactions...oh wait, nothing happened. We find out next to nothing else about Rock and Revy. Well wait, we know Rock used to live in Japan now. WOW! 12 episodes and it feels like they've told us nothing more about the characters except one used to live in Japan! Yay?\\n\\n\r\nI'll admit, I enjoyed the season, because who doesn't enjoy seeing Revy kick ass? But seriously, it was a huge let down and I probably won't watch it again. They could have done sooo much more with the characters, their background, and possibly maybe...just maybe throw in a relationship?\\n\\n\r\nTry it out, watch it if you saw the fist season, but don't expect much other than an average anime.\\n\\n\r\nOh yeah, perhaps one highlight was the nudity they threw in. Yay for dirty animators?",
            "date": "2007-02-12T10:05:00+00:00",
            "helpful_count": 116,
            "mal_id": 145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Xinil",
                "username": "Xinil"
            },
            "url": "https://myanimelist.net/reviews.php?id=145"
        },
        {
            "content": "I personally absolutely loved the second season of Black Lagoon!\r\nWhile the storyline is a little short in that it seems like just a bunch of random stories thrown together, the themes remain the same throughout the anime and have a good conclusion to them.\r\nIt is not only action-wise intense but it poses questions of morality and who is right or wrong in the world, and more importantly which side should you be on. \r\nThroughout the anime there is this central conflict, of making choices and determining if they are the right/just ones, with the main character and the ending is satisfying in learning what hisfinal decision is!\\n\\n\r\nThe most powerful episodes to me were 13-15,(the twin-arc), which really touchs base with how messed up this world can be!\\n",
            "date": "2008-03-30T21:03:00+00:00",
            "helpful_count": 109,
            "mal_id": 3498,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46508.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/domthebomb",
                "username": "domthebomb"
            },
            "url": "https://myanimelist.net/reviews.php?id=3498"
        },
        {
            "content": "The second installment of the Black Lagoon Series! If you've watched the first season and liked it, I assume you'd want more right?\r\nWell in this second installment you'll see the crew of Black Lagoon in even more misadventures. \r\nThere's not much to expect except MORE GUNFIGHTS and MORE Revy and Rock antics! XD \r\nThe great thing about the second season is that it show's the backgrounds of the characters like Eda, Revy and Balalaika's past although it's vague. IT also shows the different sides of the characters like Revy's soft side, Balalaika's value of her comrades as well as her war freak side, Eda inaction! \\n\\n\r\nThe focus here is more on Rock and Revy. Dutch and Benny now seem like supporting characters here. \\n\\n\r\nAll in all, a good second season. Watch it if you're looking for more Black Lagoon goodness! I guarantee though it may not be great storywise, but it's one hell or a ride! XD",
            "date": "2007-11-01T19:56:00+00:00",
            "helpful_count": 39,
            "mal_id": 1195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/17052.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Two-Hands",
                "username": "Two-Hands"
            },
            "url": "https://myanimelist.net/reviews.php?id=1195"
        },
        {
            "content": "This anime is incredible, the second season makes it even more so. It requires a bit of maturity to watch, especially things like the twin arc. \r\nIt's not for the faint of heart, nor the overly sensitive. or those with strong moral backround. \r\nbut for those who can look past it, this anime has it all. Action(lots of it) Comedy, and Tragedy; and a great story to go with it.\r\nWhat I don't like about it, which is just a minor nitpick, is while in the second season more of the plot follows Revy and Rock, they don't expand upon their relationship much. And the restof the black lagoon crew is phased out of the season more or less. They also fail to expand upon a few more major characters, unless there is going to be a third season. \\n\\n\r\nThis knocks it down a bit, but only to a minor degree for me.",
            "date": "2008-03-11T03:00:00+00:00",
            "helpful_count": 29,
            "mal_id": 3032,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/28305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kharaa",
                "username": "kharaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=3032"
        },
        {
            "content": "Black Lagoon: The Second Barrage\r\nThe second part of Black Lagoon, but it's splitted as a second season for some reason, follows another day in the episodic life of the Black Lagoon gang, another day but focused more on Revy and Rock and less Dutch and Benny.\r\nStory\r\nThe same as the first part, it has episodic stories that are a mess at giving a contundent conclusion and rising questions, just like Eda's identity is revealed i was expecting a story with her, but no, her motives are unknown, the first three episodes are sad, i felt sorry for Hansel and Gretel, it was really sad and tothink that happens in real life too and seeing their fates made me shed some tears, maybe the best eps. of this Second Barrage, those eps. had story behind it, a deep and really really dark one and a dark conclusion; The next eps. are good with another different story but with Eda's identity revealed and in the next ep. nothing about that, a different story again this time in Japan and Revy's clothes changed too, it's refreshing and she looked really good; Rock and Revy gets closer and you can see Revy cares a lot for Rock in her own way (she even gets jealous when Eda flirts with Rock or doesn't want to talk about it when Eda asks Revy if they banged or when he was talking with Yukio) and that story in Japan was good, but it would be better if it had more eps. it ended like a normal ep. like giving you the impression that there's going to be another ep. that was not a good ending. Well after the ending and the ED song, Eda asks her again if she finally banged him because they had a lot of time to do it and Revy said she didn't wanted to talk about it and was ashamed and angry at the question, it was kind of funny because she never tries but acts more kind towards him than before, not getting angry at him like she used to, those stories were good, the first one was great, the second story didn't have a conclusion and the third one felt almost the same, but i was'' so where is the next episode?''.\\n\\n\r\nArt & Animation\\n\r\nArt style is the same, it's very good, great animation and details, more blood than the first part with a liitle more violence, and with great character design.\\n\\n\r\nSound\\n\r\nAlmost the same but i expected more with the music, very good VA but a little clumsy with the english when Rock had to work as Balalaika's translator, i barely understood her, not just her but every one who attempted to speak in english because they didn't know each others languages. The same amazing OP, i got obsessed pausing the video clip at sec. 36 she had something and i was trying to find out why i liked that shot so much, maybe because you won't see her like that in the anime, every episode pausing at that sec. for half an hour... there are three ED the same one from the first part/season and the one that will make you drop a tear the one from ep. 15 and the one from the last ep... in general was very good.\\n\\n\r\nCharacter\\n\r\nI enjoyed much more Revy on this second barrage, she was less heartless, a little, but she really was better than before and treats Rock better and protects him.\\n\r\n-Rock is better too and he starts to find out who he is and where he stands.\\n\r\n-Mr. Chang is a confirmed badass.\\n\r\n-Shenhua's voice is funny, i love the way she talks, she is a cool character.\\n\r\n-Balalaika is ruthless than ever, she is greedy for war, i liked the addition of Sawyer (she reminded me of the girl from Nazo no Kanojo X) and Ginji, cool character and not to mention the darker characters like Hansel and Gretel with a really dark past, hevy stuff, it was a heavy story and Yukio's end was... she should have stopped, that end wouldn't happened if she... and there's not much of Dutch unfortunately, not Benny neither but he only appears two times and he already has a girlfriend Janet the clumsy Indian girl.\\n\\n\r\nEnjoyment\\n\r\nI enjoyed more this second barrage than the first 12 eps. it was a little better, but the action was much enjoyable, although i feel it should be tagged as supernatural, because c'mon is obvious why, eg, Gretel a girl who wields a heavy machinegun and handles it like a boss without hurting herself, or Roberta in the first part/season is basically terminator... Revy was much ''nicer'' more likeable, more relaxed and badass than before, Revy is quite something unique and sexy, adding the 7 Omakes which were funny and good i got a great enjoyment.",
            "date": "2015-10-11T21:44:00+00:00",
            "helpful_count": 23,
            "mal_id": 201059,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=201059"
        },
        {
            "content": "The second season of Black Lagoon is really a story of two different anime; the underwhelming, uninspired first six episodes, and the spectacular, engaging last half of the show. The former is a 5, while the latter is very close to a 10.\r\nThe returning characters and excellent opening are largely the same as the first season (mentioned more in my review of that season), which is a good thing. The art is as stylish, vivid, and colorful as ever, and adds a definite flavor to all the gun battles.\r\nNow, there are three different story arcs, each completely independent of one another; the murderous twins, GreenbackJane, and the Yakuza fighting back in Japan.\\n\\n\r\nThe series starts off with the Romanian siblings, two eight year olds with white hair carrying a mini-gun and an ax larger than they are themselves. These two little children love to kill, and are so dangerous that they wreak havoc upon Roanapur, killing dozens of high-level, powerful gangsters, including those from Hotel Moscow.\\n\\n\r\nNow, I understand suspension of disbelief, and I realize that the gun-wielding heavies in the Black Lagoon universe are supposed to be bizarre, unorthodox characters, from chain-smoking nuns to chambermaids wearing glasses, but this is absurd.\\n\\n\r\nEven in the Black Lagoon universe, it doesn't make sense for two FRAIL CHILDREN to single-handedly cut through droves of gangsters and expert gunmen like so much confetti. The only way to pull this off is to inject humor, but there is none of that in the first three episodes.\\n\\n\r\nThe emotional melisma surrounding the end of this arc is both unnecessary and poorly executed.\\n\\n\r\nNext up is Greenback Jane, a straightforward action arc about a counterfeiter on the run, with all of Roanapur's deadliest criminals after her, and only Eda and the Black Lagoon company around to protect her.\\n\\n\r\nIt's mostly action, with several funny scenes, and little character development, an Eda flashback aside. It's decent fare, but I found a few key moments disappointing. Without revealing any spoilers, there are several notorious gangsters fighting against Eda and Revy.\\n\\n\r\nA few of the less important ones die, but the main ones, with significant backstory, curiously survive, only one with serious injuries of any kind. Now, I understand they wanted to save them for Season 3, but it's anti-climactic, a cheap device from the creators.\\n\\n\r\nIn the ruthless Black Lagoon universe, when two heavies battle it out, one should die.\\n\\n\r\nFinally, we come to the last six episodes, which cover Hotel Moscow's quest to destroy several Yakuza families in Japan, quality time spent between Revy (fully-clothed even!) and Rock near the latter's home, as we are also introduced to a cute schoolgirl named Yukio and honorable swordsman Ginji, who can slice bullets in half.\\n\\n\r\nThis might very well be the best story arc in the entire series, Seasons 1 and 2, and corrects many of the things I disliked about the earlier episodes.\\n\\n\r\nIf you read my review for the first season, one of my biggest complaints was the character of Revy, that she was a character with no depth or reality, and was boring and stupid to boot.\\n\\n\r\nWell, by the end of Season 2, she has been transformed into a much more understandable and most importantly, FUN individual.\\n\\n\r\nNo longer is she hysterical, crazy, nor does she talk as much ridiculous shit. She's far more competent, rational, and even her character is developed, as we see her interacting with children, and she shows genuine compassion and love for Rock.\\n\\n\r\nThe overall character development in these last six episodes is excellent. A lot of attention is paid to Miss Balalaika, as she cements her status as the coolest, most competent criminal in the series. Her blend of stoicism with charm, humor, and the ability to do whatever is necessary to crush her enemies is entertaining to watch.\\n\\n\r\nEven the minor characters, like the violent, insane Chaka, with facial piercings, blonde hair, and a purple suit, are well done.\\n\\n\r\nHe is a neat reference to Kakihara from \"Ichi the Killer\", minus the love of sadomasochism.\\n\\n\r\nThe story itself drags a little with overly abstract, emotional dialogue, but it's not terrible, and is at least relevant to the central theme, which concerns the transition and choice between criminal or peaceful life.\\n\\n\r\nThe last six episodes make up for the beginning of the Second Season, but not enough to propel it into \"great\" status.\\n\\n\r\nHighly recommended for anyone that enjoys action and a fast pace to one's anime, as well as unusual personalities.",
            "date": "2009-11-30T17:29:00+00:00",
            "helpful_count": 18,
            "mal_id": 21004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81668.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/YoungVagabond",
                "username": "YoungVagabond"
            },
            "url": "https://myanimelist.net/reviews.php?id=21004"
        },
        {
            "content": "STORY: 6/10\r\nCHARACTER: 8/10\r\nART: 10/10\r\nSOUND: 9/10\r\nENJOYMENT: 9/10\r\nOVERALL: 7/10\r\n!!Since there’s only a short gap between S1 and S2 of Black Lagoon, I am going to be reviewing both seasons here so Warning beforehand for any Accidental Spoilers!!\r\n‘Black Lagoon’ captured my attention from Revy on the poster to good word of mouth. Not knowing what to make of the title or the poster, I was very surprised at what this anime turned out to be. Often criticized for copying ‘Cowboy Bebop’, I was a little concerned at first but this anime distinguishes itself with its world building and characters. Set to a dark yet realistic, cruel, cold, violentand brutal crime infested town that perfectly captures the last place you want to be in this R-rated world. This anime superbly holds nothing back and you get a load of hot girls wielding big guns and firing at everything and everyone! In fact, this anime is all about tits, ass, guns, explosions, cursing and badass chicks! You start with Okajima, leading a boring life who then gets kidnapped by the Lagoon company on a business trip. Upon realizing he’s been abandoned by his own company, he decides to join this group of renegades and gets the nickname ‘Rock’. Even though the anime lacks in story and the plot is pretty much the group doing different missions, it never bothers anyone since what you get is very entertaining to watch! This has some of the best Action scenes, so good that you can’t take your eyes off them! I mean why would I care about Story when I can get Revy killing a bunch of Nazi’s on a ship! The anime also doesn’t shy away from clichés like generic character traits or plot armour for the main characters during battle but it doesn’t matter! ‘Black Lagoon’ totally owns it by delivering non-stop Awesome Action and helps you forget the unrealism of it all.\\n\\n\r\nThis is also one of those rare shows where the Female characters not only KICK ASS but completely steal the show! You get a little bit of everything from the characters, with the weak MC who later grow balls to a Computer Geek, Samurai, Mafia, Cartels, Russians, Nazis, Crazy maids and nuns! I had a lot of fun with most of the characters but the Stand out is Revy by a large margin. This foul mouthed, gun blazing, sexy yet deadly Chinese version of Lara Croft is the most interesting character on the show. She’s the kind of woman who will kill anyone that gets in her way and then later drink at a bar as if nothing happened! Her use of the word ‘F***’ was always fun to hear and her ‘No Shit Given’ attitude propels her to the top of many people’s list of Badass female characters. Revy also comes across very sexy regardless of displaying no forms of seductiveness, I mean she rarely shows any sort of attraction to anyone! But those poses she takes while shooting just makes her unbelievably attractive and I for one couldn’t get her out of my head for a while! She’s also involved in a lively relationship with Rock that’s never clearly defined yet both display great chemistry with one another. In fact, Rock becomes more interesting after his interactions with Revy cause otherwise he’s the one who holds back, being the one with morals and integrity. He’s heavily overshadowed by Revy but I enjoyed him a lot too cause he showed tons of resilience for an amateur and even stared down the badass Revy by speaking his mind. Even under the threat of a gun, he was able to hold his ground. We even later see him starting to fit in with the rest of the group which was also to my liking. There are so many great supporting characters here so it’s hard to pick a favourite! You get the nuns from the church, Eda stands out due to her relationship with Revy. Then you have the freaking female terminator maid Roberta who’s insanely good with killing and tracking! Balalaika was another stand out female character, with her connections to the Russian military and the cold and smart demeanour with which she ran the place. She and her crew are responsible for some cool action scenes and I thoroughly enjoyed her arc in S2. Let’s not forget about Chang who’s a male badass in the show but unfortunately, we get very little of him. One nit-pick from my side is that the ladies go through their own tragic backstories, further developing their characters while guys were put to the side. The OVA even shed a glimpse into the past of Revy and you can then understand why she is the way she is but we get nothing for Dutch or Benny.\\n\\n\\n\r\nThe OP is as badass as the anime itself, perfectly setting the mood for some hardcore action. For such a standard track, it doesn't warrant you singing along or anything but it definitely gets its job done by pumping up the action scenes. The good use of sound effects for the car chases and explosions further improved the overall effect of those set pieces. And then the dubbing, which is some top-notch stuff. I loved, loved and loved Hendrikse’s portrayal of Revy!!! She so perfectly embodied Revy’s voice with her masterful give and take choice of words and tone that puts the subs to shame! Plus, the characters of the show themselves aren’t Asian so the dubs gave an International feeling to the show which was required. Aside from great characters, we were also nursed with great dialogues, uncensored with profanity and energy! Finally, the animation here is excellent in both the character design and art work. The characters all have a uniqueness to them which’s strongly displayed throughout the show. I never felt like I was watching a generic villain of the week with a different hairstyle or clothing, they really felt different from one another. The highly-distinguished artwork on Revy mannerisms, movements and expressions is further proof of the amount of quality work that went into this anime. And let’s not forget about those action scenes! We have tons of them, ranging from fights on boats to ships to underwater submarine, car chases, bomb blasts and tons of gun battles! Despite so much variety of action, you are never bored with any of them for they are well choregraphed no matter how long they get! \\n\\n\\n\r\nIf there’s any anime that can easily be turned into a live action movie, it’s this one! And Quentin Tarantino should direct it if the casting is well done. S1 focuses on the entire team doing many jobs, basically an intro to all characters while S2 dives deep into the politics and power play of the city and its players. Not a bad direction to venture off to but it came at the expense of the Lagoon team for we only get Rock and Revy. Also in S2 I didn’t like the changes with Revy at first. She’s a total badass in S1 but then she changes in S2, showing a cuter side of herself. She lost that edge of gun blazing insanity streak to her and started smiling more, she even started wearing a skirt and i felt like it was just fan service! I was also afraid they were going to just stick her into a girlfriend role with Rock in S2 but thankfully they further played upon the platonic relationship between those two. You could clearly see a more humane side to Revy, realizing theirs’s a sensitive side deep inside her despite all her ruthlessness. It’s also totally believable since Rock is slowly wearing her defences down and Revy is finding herself more relaxed and comfortable around Rock. \\n\r\nIn conclusion, the anime has an unsatisfying ending! The story conveniently wraps up but we get NO Resolution from the characters which really pissed me off! I still enjoyed this violent and gritty take on crime mafia and the badass characters that run this city though I would have wished for a more complete ending. It’s still worth your time so check it out!",
            "date": "2017-08-29T08:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 256471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421599.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PakiUSA",
                "username": "PakiUSA"
            },
            "url": "https://myanimelist.net/reviews.php?id=256471"
        },
        {
            "content": "Less episodic than the first &ldquo;Black Lagoon&rdquo; season, &ldquo;The Second Barrage&rdquo; features only three story arcs, the first two are three episodes long each and the final, closing story arc spans six episodes. \r\nFilled with crazy gun-toting babes, wild shoot-outs, mob wars and non-stop action &ldquo;Black Lagoon&rdquo; as it's a roller-coaster ride that rarely slows down the pace. \r\nWhen it does slow down, it finds time to have the characters take a look at the insane, rotten world they live in, walking a fine line between idolizing and condemning that criminal world, depending on which character's view is being explored. This is an interesting element,as it makes the series more realistic, as for humans, right and wrong still do depend on their personal outlook in life. \\n\r\nEspecially the first plot arc, featuring child assassins that were severely abused as children which left them mentally scarred and severely psychotic, handles some very heavy ethic themes. But it does so well, not shying from showing sickening things, they make you stop and think at how such events can affect people and twist their lives and personalities into misery you do not even want to imagine.\\n\\n\r\nMost character development is seen in Revy and Rock, although their personalities and positions at the end of the series may not seem very different than before, they both have changed significantly. \\n\\n\r\nRock remains an interesting character since he never truly delves into the criminal world of his comrades of the Lagoon crew. This is even a pivotal plot point in the final arc, where he is quite accurately accused of remaining in the twilight, not choosing to either return to a normal life or to fully accept a criminal life like the others. \\n\r\nIn the end Rock acknowledges he hasn't chosen a life like Revy's, but he has said goodbye to his past in Japan. He consciously remains in the twilight because he feels it gives him a unique vantage point on everything, a view and insight the others can no longer have because they are lost in the criminal world. So while his position remains roughly the same, Rock does change as he was forced to reflect on his life and the choices he made, motivating them with renewed reasons.\\n\\n\r\nRevy still is as foul mouthed and short tempered as ever, but we see she suffers an internal struggle. She wants to push Rock away and send him back to the normal world because she feels he can not really live in her criminal world. Yet we also see signs of her humanity, wanting to hold onto Rock and perhaps change her own life, to finally escape from the world of death and despair she has always lived in. \\n\r\nRevy also begins to show surprisingly humane and soft expressions around Rock, and it seems being around him has had a positive, soothing influence on her. This may be something she sought herself, as she was the one who originally invited Rock into the Lagoon crew, into her world. No matter how much she may state he doesn't belong there, she was the one who brought him in and Rock choose to stay there. \\n\r\nNo matter how much their personalities may be opposites and collide, Rock and Revy's own bond continually grows, showing a deep trust has formed between them. \\n\r\nEven when Revy gets frustrated because she does not understand what Rock is thinking or what he wants to achieve, she eventually tries and comes to understand him, something she would not do for another person. Rock too seems to become better at handling Revy, and while he may never fully understand her, he doesn't pity her because of her past and accepts her for who she is.\\n\\n\r\nWe also get some surprising new insights into Balalaika, no doubt to make her look more sympathetic to the viewer's eye or perhaps to make the juxtaposition between her innocent youth years a stark contrast to her blood lust as a capable leader of her former Russian army troops, part of the Russian Mafia group 'Hotel Moscow'.\\n\\n\r\nOnly Dutch and Benny do not get much more character development and end up barely appearing in the closing story arc which takes place largely in Japan.\\n\\n\r\nAnimation in &ldquo;Black Lagoon: The Second Barrage&rdquo; is good, all the characters are distinguishable and well animated in most scenes, this goes for the action as well. However dips in the animation can be seen here and there, but never to the point where it bothered me.\\n\r\nThe soundtrack is fine, with typical guitar and fast beats to accentuate the action, though this second season also featured a more mellow ballad for the child assassin arc. The eclectic opener 'Red Faction' by Mell is used this second season as well, which is fine with me as it's a catchy tune with raw guitar chords.",
            "date": "2008-05-17T11:03:00+00:00",
            "helpful_count": 15,
            "mal_id": 4795,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=4795"
        },
        {
            "content": "Once again, Black Lagoon has continued to deliver nonstop action! The fighting scenes are more mature and puts more emphasis on the characters’ backgrounds in the second season! There were a few things I disliked unlike in the first season, but the pros greatly outweighed the cons. It’s definitely worth watching, especially if you enjoyed the first season!\r\nStory (7)\r\nThe Lagoon Company is rarely together. There is less of Benny and Dutch, but the scenes are just as exciting with Revy and Rock being separated. The 1st and 2nd arcs took place in the fictional city of Roanapur in southeast Thailand, also known as “gun paradise.”\r\nThefirst arc was extremely gruesome and consisted of merciless new villains, two twisted vampire twins who treated people’s lives as if they had no value. Several mysteries surround the murders and the twins, and the violence within the city is spectacular. Besides the thrilling action the vampire twins brought to the series, the fact that they were called “vampires” is even more mediocre than Twilight. There’s no blood-sucking or burning to ashes in the daylight. The only proofs were their background in Romania and their sharp teeth, which is my complaint about the artwork.\\n\\n\r\nThe second arc was my least favorite, besides laughing at practically everyone being stupid. New characters were funny yet annoying during fight scenes, because they talked way too much. Also, some of them claimed to be dangerous and hardcore, but they showed too much emotion and whined over the smallest things in the spur of a fight. However, the excessive talking has an advantage by resulting in some secrets being revealed about the main characters. There are also more weapons besides guns used in fights, which makes the scenes entertaining nonetheless.\\n\\n\r\nUnlike the 1st and 2nd arcs, the 3rd arc took place outside of Roanapur and into Japan. Balalaika’s true colors are revealed in this arc, causing nonstop murders between clans and mafias throughout the rest of the series. Rock shows his annoying side by not facing reality to the new world he’s living in. Also, new characters, including a swordsman, bring on incredibly entertaining fighting skills. A swordsman vs. a gunman is definitely a fight to see!\\n\\n\r\nThere were some unanswered questions, including from the 1st season, but they have a chance of being answered in the 3rd season.\\n\\n\r\nCharacters (7)\\n\\n\r\nRock hasn't changed a bit. Despite the year he spent with Black Lagoon, he has yet to show any toughness. He is so annoying, because all he ever does is talk about nonsense. He never cares how dangerous the situation, and it’s like he doesn’t care about dying at all. He’s such a weakling that people continue to use him as a shield, and he always needs to be protected or rescued. No one takes him seriously, and I can’t blame them. However, I’ll give him credit for his honesty and courage to speak in order to avoid meaningless war.\\n\\n\r\nRevy shows more of her soft side. Maybe she’s been hanging around Rock too long. She doesn’t shoot first and ask questions later as usual. Instead, she makes meaningless threats that never follows through. She’s still “Two Hands,” but her shots aren’t nearly as accurate as they should be for someone who’s supposed to be feared by others. Besides that, her hot-headed temper and vulgar language is still there, making some scenes hilarious.\\n\\n\r\nEda (1st and 2nd arc) is another version of Revy with the same hot-headed temper. She made a short appearance in the 1st season as a nun from the Rip-Off Church. In addition to that role, she’s cool with Revy and appear to have a strange friendship, despite getting on each other’s nerves. She can handle a gun, but she’s greedy and only follow the highest bidder, even if it means jeopardizing her chances of living. Money seems to be her life. Also, she appears hardcore in front of most people, but she actually panics when she nears defeat. She even shows signs of fear, which is why Revy has her beat by a long shot in the toughness category.\\n\\n\r\nBalalaika (1st and 3rd arc), mockingly known as “Fry-Face,” is the scariest and most dangerous character of all. She destroys everything in her path without a care in the world and kills without blinking an eye. Well, what do you expect by the leader of the Russian mafia (Hotel Moscow) and a former military soldier? She’s no longer behind the scenes, and she shows everyone that she means business. Her presence makes the whole series entertaining.\\n\\n\r\nSound (8)\\n\\n\r\nThe characters’ voices fit their personalities precisely. For example, Balalaika has the hardest and fearful voice needed for someone in her ranking. The same OP and ED are present in the 2nd season, but there are two new songs (one from Episode 3 and the other from Episode 12). They are absolutely beautiful and goes perfectly with the episodes’ theme, especially the a capella track called “The World of Midnight” concluding the first arc.\\n\\n\r\nArt (8) \\n\\n\r\nMadhouse has some of the best artwork in my opinion, but the art should have been more detailed in the 1st arc. There were two vampire kids in the 1st arc, but the word “vampire” came from the sight of their teeth. Some other characters, including Revy and Dutch, have sharp teeth drawn the exact same way. If the twins are supposed to be vampires, at least distinguish their teeth from other characters somehow.\\n\\n\r\nEnjoyment/Overall (7) \\n\\n\r\nAlthough the first season was better in my opinion, the second season brought meaningful stories about the old and new characters. The action is still there, and it’s gotten even better with the different weapons. There are more stories and secrets revealed in the second season, so I highly recommend it!",
            "date": "2013-11-10T22:06:00+00:00",
            "helpful_count": 14,
            "mal_id": 119921,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=119921"
        },
        {
            "content": "This review contains spoilers. Please, proceed with caution.\r\n\"Only business, nothing personal\".\r\nDo you know that feeling when you are watching a TV show, or a movie, maybe and anime / manga, playing a videogame or reading a book, and those generic, boring characters that pretend to represent evil show up? In classic series, like Saint Seiya, where is common to contrast the light and the darkness by an stereotyped, greek representation of justice and evil, you can see that in every fight, every conversation. But, what if someone broke down that vision and put the 'bad ones' in the spotlight? The answer is Black Lagoon: TheSecond Barriage.\\n\\n\r\nSeen from outside, Black Lagoon is just another action anime that doesn't have nothing more than random shooting scenes and boring, bland characters, with a predictable story and mediocre animation. Well, the one who thought that, couldn't be more wrong, because this second season has much to offer to the viewer. Not only tense moments but character development and a strong, dark and nihilistic philosophy that I personally loved.\\n\\n\r\nTo see this season and fully enjoy it, I recommend you to watch the first one previously, to understand why the characters act like they do and their relationships.\\n\\n\r\nThe story is really good, one of the strongest points in this anime along with the characters. I must admit that the dark atmosphere really catches me, like in Berserk or Evangelion, but it is not only dark but deep. Basically, everything developes around Revy Two Hands and Rock, the main characters that are part of an obviously ilegal delivery service called 'Lagoon'. We are allowed to see the crew in some jobs and how they live and react to some events in Roa Napra. Basically, we have three different arcs here: the Twins arc (which I personally consider to be a fucking masterpiece), the Fake Money arc (for me, the most mediocre), and the Japan War arc, which is pretty good too, and I personally enjoyed when I thought the series was going downhill. While I enjoyed the Fake Money arc, I felt it was like a bridge between the greatest parts, some filler that has more random action (but an interesting discover) than actual plot.\\n\\n\r\nThe Twins arc is one of the greatest I've seen in anime, not only because of the action (which is unbelievably good, with unpredictable plot twists) but of the strong realities shown there. We have a pair of twins that are in Roa Napra to kill Balalaika, hired by a random hooligan that I'd never seen or heard about in Black Lagoon. Revy and Eda, the nun of the Violent Church, want the reward for their head, so they pursue them through the city. When one of the twins finds Balalaika, she is shown merciless (when it was only a child, maybe 14yo or younger) and watches how it's killed without even blink. The other twin pays the Lagoon company to escort her to an island, only to find death in hands of a hitman hired by the Hotel Moscow.\\n\\n\r\nThis arc is told to show the viewers that life isn't easy, or, at least, isn't easy for everyone. Every day, some people go out to the street to kill, kidnap or steal. Maybe for money, like the Lagoon company, maybe for honor, like Balalaika and his army, or maybe for pleasure, like the twins. For them, every single day is a 'kill or be killed' reminder, whether they like it or not. Life is dark, hard and in the end, you may not be satisfyied with what you lived. But, in the other hand, there is more than meets the eye, because not everything has to be violent or a bloodthirst desire. There is love, human warm and confidence. Sadly, it finishes with a harsh reality: you can't save everyone, just live your life and try not to be involved in those things.\\n\\n\r\nThe Japan War arc is good too. Things like loyalty or ambition are put to the test, but I prefer not to spoil it, because is the longest one and I want everyone to take a look at it with their own eyes.\\n\\n\r\nThe animation and art are good, really good in the first chapters, but have a notable downgrade in the last three, to the point of be annoying sometimes. The final fight has serious budget problems.\\n\\n\r\nThe sound felt atmospheric and correct in every single moment. The op and the ed are the same as the first season, but they are equally awesome. I personally enjoy the ED, because it gives that lonely sensation, like if Revy was walking through a path of thorns, being hurt in every step she gives.\\n\\n\r\nThe reason why I enjoyed this season that much was because of Revy, Rock and Balalaika. While I think characters like Dutch, who is a charismatic and intelligent douche, capable of recognize Sartre quotes, are left apart in favor of those mented, I think it was a really good choice, because they are exploited to the maximum of their capabilities.\\n\\n\r\nIn the first season, Revy is shown like a cold woman, without any kind of human feeling but the most violent ones. Revy enjoys killing, shooting, drinking, smoking and earning money, but, how much of her personality is her 'real personality'? In this season, we see Revy much closer to Rock than previously, she is literally told to be 'his weapon', and has risked her life for him even if she textually refused. When Rock is in Japan, working as Balalaika's translator for the Yakuza, Revy seems to enjoy what a normal life is, and there is even a moment when Balalaika says something like \"Two-Hands, don't even think in a life like this one\", refering to a normal, safe routine. While other animes show us how cool is to be bad, how powerful a gun feels in your hands (like the sword in Vagabond), Black Lagoon goes a step further and actually puts the real weight shooting and killing has in Revy's mind.\\n\\n\r\nIs the human born with the capacity of doing evil, or does he aprehend it through its life? It is told that Revy had a dark past, and some events conditioned her to have the life now owns, but even if she seems to enjoy the life she has, can't avoid to envy Rock's normal life and a place to go back.\\n\\n\r\nRock has some improvement too, but none close to Revy and Balalaika's. To me, Rock represents the person that can't choose between two antagonistic choices. He is told to be in the 'sunset', because walks through darkness and light at the same time, being able to choose the one he prefers when it suits. Rock has some badass moments when he has to discuss Balalaika even at risk of being killed by her. He discovers his own dark, even if he is thinking in the greater good. In the end, Revy desires what Rock has, and Rock discovers what Revy's mind is made of.\\n\\n\r\nBalalaika was for sure a huge surprise for me, because in the first season it is shown like a strong woman, for sure, but with some moral values. Here, we discover that she is a cold hearted militar, ex Spetsnaz, that doesn't fool around. She has her own moral code, that is based in mutual comprehension and respect, but only for the men under her flag. They respect her, and far from having fear, they devoutly idolize her as a leader. This goddamned sexy russian woman doesn't kill for fun nor money, she does it because it has to be done.\\n\\n\r\nI enjoyed this series, I really did. It was an incredible trip through some of the most dark and deep human desires: evil, greed, envy, lust, but also hope and comprehension, that are always present in our hearts.\\n\\n\r\nThanks, Lagoon company.",
            "date": "2019-02-20T13:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 302087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7300151.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PentagramShogoki",
                "username": "PentagramShogoki"
            },
            "url": "https://myanimelist.net/reviews.php?id=302087"
        },
        {
            "content": "Where to begin. Black Lagoon may in fact be the worst animation ever, and it boggled the mind that someone felt a second season was necessary. Just as well, I feel it is my duty to the MAL community to help cease the spread of misinformation that seems to be plaguing the internet about this \"series\" (and i use the term loosely I assure you)\r\nStory:1 Basically it's just American garbage of run around and shoot everything that is in sight. Clearly, the creators of this atrocity felt the need to service the lowest common denominator. I find it rather insulting to be honest, thatsomeone out there thinks so little of my intelligence that this filth could pass as a \"story\" of intrigue.\\n\\n\r\nArt:1 We have seen it all before I'm afraid, colors in between dark lines, however this particular animator was quite inconsistent and down right boorish with their animations.\\n\\n\r\nSound:3 I suppose guns and explosions all sound the same.\\n\\n\r\nCharacters:1 This is my main grievance with this garbage, it is the fact at how one dimensional and flat the characters are. Their motives are spoon fed to us and the exposition that is thrown into our faces leave little to the imagination, as if we are required to have everything spelled out for us. No depth at all, just a bunch of shallow, empty puppets who are placed in their specific roles.\\n\\n\r\nEnjoyment:1 For reasons stated above.\\n\\n\r\nOverall:1 Stay away if you value your time and dignity.",
            "date": "2010-05-28T08:40:00+00:00",
            "helpful_count": 11,
            "mal_id": 26523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/327649.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/oneeyedwilly25",
                "username": "oneeyedwilly25"
            },
            "url": "https://myanimelist.net/reviews.php?id=26523"
        },
        {
            "content": "(I'm treating this as a comprehensive review of both seasons, because the two seasons of this anime are more or less the same)\r\nWho would have thought that a stereotyped crime drama would become a philosophy showcase? Guns, murder, mafia wars, and the like are all tied in to Nietzsche, Kirkegaard, Sartre, and Heidigger. It made the show a bit uncomfortable to be honest, with a shoot-em-up bang bang action thriller confronting itself, and ourselves in the process. The show casts aside morals, but unlike most shows where we justify it with an “oh, it's just the enemy” sleight-of-mind, this show rubs its amorality in ourface. Bloodbaths are taken just a little too far, outside acceptable hollywood. The characters were such interesting characters, never falling to the temptation of merely being either a philosophical model or a stock anime character, but always having a life, conflicts, and past that complicate and interest. None of the characters are meant to be all that likable (except maybe the protagonist), and despite this I found myself completely attached to them. The style was brilliant too, being a direct homage to Quentin Tarentino and all others in his lineage, and it had a kick ass opening song. Despite such a great opening song (and a good closing), the sound suffers from terrible accents when the characters try to speak english. Black Lagoon is a strange out-of-nowhere flash of brilliance, a intellectually sophisticated mainstream action show, but little surprises like this are why I consider anime to be more than a time waster.",
            "date": "2010-05-23T17:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 26308,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/332142.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Seabury",
                "username": "Seabury"
            },
            "url": "https://myanimelist.net/reviews.php?id=26308"
        },
        {
            "content": "What makes a good anime? Plot....characters...and perhaps an excessive bit of violence ^^. Though Black Lagoon: The Second Barrage isn't quite different from the first season there is viewer joy to be found in the second season...\r\nMost memorable (and perhaps the highlight) is the first three episodes of Second Barrage. The debut of Hansel and Gretel hurls us into the story and by the end of Swan Song At Dawn you'll wish you could replay it (at least I did ^^). \r\nBut either than that this season moves in a more serious direction with Mafia fights, sad pasts and a whole lot of trigger happyladies. Well what do you expect from an action anime? Even so I was surprised by the realism some of the topics held and the after thoughts I had.\\n\\n\r\nAll in all Black Lagoon with it's great visuals and exceptional voice acting (lol, Rock sounds like Light Yagami :D) this is a great anime if you're tired of the usual sword fights and random fan service (can that be?!). Enjoy it! ^^",
            "date": "2009-09-05T09:16:00+00:00",
            "helpful_count": 11,
            "mal_id": 18420,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/230263.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LoliM",
                "username": "LoliM"
            },
            "url": "https://myanimelist.net/reviews.php?id=18420"
        },
        {
            "content": "Black Lagoon: The Second Barrage puts a really interesting spin on the atmosphere from the first season. The gore and the cursing still there and the season was still as enjoyable as the first but it had it's share of disappointments.\r\nThe art (9/10), and sound (9/10) don't change and they are really good!! The characters are also enjoyable because they dont drastically change from one season to the next but they do focus on other characters than the Black Lagoon crew like they did in the first season.\r\nThe story (8/10)  is pretty good as well. its something you would expect any other mafia woulddo; Hotel Moscow is trying to gain territory in japan, terrorizing japan's biggest mafias (taking out all leaders that done comply with Hotel Moscow's demands) and uses the Rock to translate and brings Revy along to guard him while they are there. there are still explosions, car chases and awesome fight scenes and shoot outs but the second series takes a more personal and secluded path than the first. It really focuses on Revy and Rock and their relationship verses Rock getting to know the whole crew in the first season which was somewhat a downer because Benny was my favorite character and we really never got to see him or Dutch. It was really focuses around Revy, Rock, and Ms. Balalaika. We explore the pasts of all three of these characters and watch as they try to connect with each other. the second season is basically watching Balalaika, Revy and Rock try to understand each other better by looking into each other's pasts. It also gives the audience some closure which was nice because we really never got that in the first season.\\n\\n\r\nOverall (8/10)  is was pretty good. I still really enjoyed watching it because it still had all of the plot twists the first season had but i really wish it wasnt in japan and wish we got to see just a little bit more of the Black Lagoon crew together because that IS what the show is about after all. It was really interesting to see their take on Revy and Rock and i really liked the character development.  \\n",
            "date": "2015-03-23T05:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 183119,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4460875.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/berserkersoul",
                "username": "berserkersoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=183119"
        },
        {
            "content": "(This review covers both seasons of Black Lagoon.)\r\nFor the time worth watching this, people have been describing this as the younger sister of “Cowboy Bebop”, being the anime equivalent to the big action blockbuster Hollywood movie (The Rock, Bad Boys, any 80s’ action flick you can think of) with the many details of graphic violence, excessive cursing and language, sexuality thrown in there and a bit of inspiration some such filmmakers as Quentin Tarantino & John Woo, although the former did a bit of anime in his venture (yes, you should know what I’m talking about).\r\nThe story follows a team of pirates/mercenaries known asLagoon Company, which smuggles goods in and around the seas of Southeast Asia in the early to mid-1990s. Their base of operations is located in the fictional harbor city of Roanapur in southeast Thailand (somewhere in the Amphoe Mueang Trat district, likely on the mainland north/northeast of the Ko Chang island or on the island itself). They transport goods in the 80-foot (24 m) Elco-type PT boat Black Lagoon. Lagoon Company does business with various clients, but has a particularly friendly relationship with the Russian crime syndicate Hotel Moscow. The team takes on a variety of missions—which may involve violent firefights, hand-to-hand combat, and nautical battles—in various Southeast Asian locations, even going as far as Phu Quoc island of Vietnam and when not doing much, the members of the Lagoon Company spend much of their down time at The Yellow Flag, a bar in Roanapur which is often destroyed in firefights.\\n\\n\\n\\n\r\nNow for the characters of the show, it does have a very vast range of characters but sometimes that showcase as little as they can. Rokuro Okajima, or Rock, is the main protagonist of the show as the Japanese salary man who is so bored and displeased with his daily life and no one exactly gave a shit about him. Actually, when the company he worked for send him out to deliver a package and he gotten captured, they just abandoned him as he was expendable to them. Aside from being captured, Rock manages to keep his mild-mannered and humble attitude throughout the whole show, which is in contrast to our next character, Revy, also known as “Two Hands” (at least she didn’t swing chains). She is one of the most foul-mouthed, merciless, sadistic and fatal characters of the show and that really got the show in drive. Hell, most of the opening sequence is practically her being showcased in action and while she often gets irritated by Rock in the first season but she is protective of him as the series goes along.\\n\\n\r\nThe other members of the Lagoon Company include Dutch, the black leader of the company, who is more of the easygoing and relaxed members and last, there’s Benny, the tech specialist member who in his past gotten into the mafia and would’ve ended up dead if Revy didn’t saved him. Now, I would like these characters to have backstory in the show but unfortunately, it’s being taken up by the former two characters of the series, which really disappointed me considering they seemed like interesting characters to know…maybe they might be in the manga, though.\\n\\n\\n\\n\r\nLike I said, there was a wide variety of characters in the show that will probably be too many to mention and name drop like Balalaika, the boss of Hotel Moscow, one of the many gangs that are mentioned in the show and not only she is very skilled at what she does but practically a character that makes her presence to be feared. There is also the Hong Kong Triads lead by Mr. Chang and his top assassin Shenhua; The Colombian Cartel, The Church of Violence, The Aryan Socialist Union (Neo Nazis.) and The Washimine Group (Japanese Yakuza), who are more heavily-involved towards the end of the show.\\n\\n\r\nThe show is total 24 episodes, with the first and the second season called “The Second Barrage”, and I will say that the second season has more of a storyline while the first is just random missions with little storyline aside from the main one and yet for some characters like Roberta and her arc makes me crave for more of her (luckily, there is an option for that) but the vampire incestuous twins Hansel and Gretel didn’t feel organic to the series or even to most of the plot. They could’ve been thrown out of the show entirely and not much of a difference would have been made.\\n\\n\\n\\n\r\nAs for the animation, the credit all goes to Madhouse for the many use of blood, detailed fight scenes and gun battles, chase scenes, beautiful scenery, and for the opening and ending sequences, which the music for both worked well. The OP theme, “Red Faction” by MELL will get your blood pumping as the show begins, although singing it….I would not suggest if you get the lyrics and the ending music….yeah, music, it’s not much of a theme but many people complained about it being slow, depressing, and drags down the tone of the series…..maybe it does but most of the time when the show have its serious moments, it’s appropriate to rather end on that note rather than just generic hard-driving rock music. The ending music for episode 15 was actually one of my favorites but the last ending theme music was more of a “meh” to me.\\n\\n\\n\\n\r\nNow, as for the dub from Geneon/Ocean, it is a bit 50/50, on the one hand, the dub fits more naturally than the sub, considering its flair is more international and some characters speak English naturally, performances from Brad Swaile, Maryke Hendrikse, Brian Drummond & Dean Redman, which from him I will say this: “Finally, a black character in an anime is voiced by an actual black guy.” This is a good thing, people. But, unfortunately, some of the voices either irritated or creeped me out like the voice of Hansel and Gretel really had me freaking out a bit, considering I heard them before on a show that in a conscience that I’m not telling you….well, one of the actresses was the voice of Nurse Witch Komugi. Garcia just seems annoying and grating whenever he speaks and whoever voiced Shenhua has the worst and slightly offensive Chinese voice I have ever heard. It sounds like that fake accent most people would put in a black-owned hair salon and that’s about as Chinese as the Panda Express.\\n\\n\\n\r\nFINAL VERDICT: By all means, Black Lagoon is worth seeing and definitely worth buying. This could be one of the few anime that I see Western culture getting into, maybe not as much or iconic as Bebop but still. It has a very in-your-face tone mixed with dark comedy and sometimes even darker drama once it gets more storyline driven. Your friends will love this but I wouldn’t recommended seeing this with family or kids…..unless they into that, too.\\n",
            "date": "2013-01-16T10:08:00+00:00",
            "helpful_count": 9,
            "mal_id": 83841,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1028709.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HybridMedia",
                "username": "HybridMedia"
            },
            "url": "https://myanimelist.net/reviews.php?id=83841"
        },
        {
            "content": "I've always had my own personal philosophy when it comes to anything anime: “If it's anime, it can't be all bad.” So as much as I disliked Black Lagoon, it really wasn't such a bad show in itself as much as it just wasn't my cup of tea. However, it's also my opinion that this show does not live up to the hype and buzz it's been receiving in the media and all these comparisons to Cowboy Bebop, because Bebop was epic compared to this which really at the core is tantamount to only two words: Fan Service.\r\n ANIMATION \r\nGreat art. I can't complain aboutthis; great looking characters, glossy scenery. This is one slick piece of work, from the appearance of the characters and the vehicles they drive to the seedy towns, cramped bases and sprawling compounds. This series is most definitely not lacking in the visual appeal department. Since there are many, many gun-fights, car chases and destruction galore much more importance is given to relaying the story visually, so we the viewer see lot of fast cars swerving, guns blazing, glass shatterings and metal crunching...and it's all done to a slick perfection.\\n\\n\r\nBut also creatively speaking, I don't think this animation and drawing style completely befits the show....it was too slick and too CLEAN at times which made the whole “Roanapur is the scummiest, vilest place on earth” seem a little disingenuous. If anything it seemed to lack or not reflect the so called “GRIT” message of the show.\\n\\n\\n\r\n SOUNDS \\n\r\nThe OP Theme I loved! Rough, gritty, feminine rock which was very fitting for the female lead. The ED Theme I wasn't too thrilled about and at first it didn't make much sense to me but after a few times it made sense... tho I still don't like it as an ED theme\\n\\n\r\nThe Japanese voice acting was good right up until they tried to speak English. I don't have a problem with Jap-English when it's portrayed as a Japanese not understanding English or trying to speak it....but when it's used to illustrate a person as FLUENTLY bi-lingual, then I have issues with it. Those voices are way too rushed, flat, monotone and just to phonetically horrible to be perceived as a fluent speaker....to be honest it sounded computer-ish and was very distracting.\\n\\n\r\n STORY \\n\r\nI don't think there's a REAL story as in an overall story so it may not necessarily be sequential and I would hardly call it a serial. It's really just a collections of missions or excursions. The original synopsis is pretty trivial: Nerdy white-collar schmuck finds himself [both literally and figuratively] within a degenerate society where everyone is “Bad-Ass”and so everyone carries a gun and likes to shoot various things and people.\\n\r\nPersonally I think it's just a thinly veiled premise to create another anime where big-breasted girls with guns run around wearing skimpy clothes....Fan Service. Fan Service all of it; gratuitous violence, excessive destruction, oceans of blood, big breasted girls with guns in skimpy clothes in all sorts of provocative poses.\\n\\n\r\nBut then by then end, a miracle happened....the show got good! They just kinda of turned it around, the whole “T & A” Showcase was toned down a bit and they focused on content. Of course this all happened by the second half of the show or “Second Barrage” with the whole Vampire Kids bit. By then the viewer gets to understand that this is not just fun, it's not just “hey, let's shoot everything!” The viewer gets to see real depth and real sadness, the real harshness that is the world.\\n\\n\r\n CHARACTERS \\n\r\nThe characters aren't really too deep or complex. It's really all just about the different levels of interaction between the various gangs from different races and mafia sects. The only real character of conscience is Rock, who fluctuates between being good-guy with a heavy dose of cynicism or a bad-guy with too soft a heart. I tended to like the side-characters more because we, the viewer, we allowed to delve a little bit into their pasts and psyche which we aren't really allowed to with the main characters...except Rock. They were drawn really well, but if they were supposed to be of different races I couldn't easily tell......the only exception of course, being, the black guy.\\n\\n\r\n ENJOYMENT \\n\r\nI don't totally dislike fan service nor do I frown upon it like most seem to, however, I would like a little “heads up” as to what I'm watching so that I'm prepared to watch, assess, evaluate and even enjoy the program more because I'll know what to expect. To be honest and to give credit to the show they did “tone it down” a little bit by the second half [The second Barrage] The heroine was no longer in those horrendous “Daisy Dukes” shorts.\\n\\n\r\nIt's good to watch maybe on web-broadcasts/podcasts, on TV or OnDemand to while away the time doing homework or just @ work, but it's hardly a collector's item....and they should just end it as it is at the second season.",
            "date": "2008-04-24T09:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 4283,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=4283"
        },
        {
            "content": "The visual quality is as great as the first season and a little more of character development takes place. I expected a little more of story to at least cover the holes that are evident, but we are left with nothing but assumptions of the motives of each one and their real goals. As with the first season, there are a few episodes that are a bit to hard to the eye because of the story itself (it is focused in the worst of human nature, from kidnapping, torture, pornografy, blackmailing and of course killing) but if you have the guts then is a goodchoice.\\n\\n\r\nThe music is somehow the right choice for this show but I found it repetitive at a long term.\\n\\n\r\nAs with the first season, the best aspect of this anime is the way it shows the &quot;twisted&quot; nature of human beings. It focuses on the worst aspects of the human psyche (not a bad thing) and it is that difference which makes you want to see it. As I said before just watch it if you really want to witness the wickedness of the human beings.\\n\\n\r\nEven though theres a lot of action through every episode, the most interesting thing is the relationship between Revy and Rock.In this second season you get to see more changes with every episode as you get to see a change of heart from both of them.\\n\r\nAlmost every other character has less to no importance at the long run, and most characters only make an appearance for a few episodes before being forgotten.",
            "date": "2008-04-23T13:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 4262,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/55212.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nightscream",
                "username": "Nightscream"
            },
            "url": "https://myanimelist.net/reviews.php?id=4262"
        },
        {
            "content": "In Short:\r\nIf you are an action fan & love fighting, shooting & hard talks, this is a good anime for you.\r\nIn brief:\r\nBlack Lagoon Second barrage continues after the 1st series & has plenty of action & enjoyment just like in the 1st series.\r\nIf you liked the 1st season then definitely U\"ll like the 2nd season too.\r\nPlot is quite similar to the 1st series.Picking up random missions & completing them. Full of Action, blood & gore. Difference is now Rock(the main protagonist) is considered as a trusty team member & is needed in many jobs.Also this time the focus is more on Rock, Revy, & Balalaika.\r\nStory:\r\nThestory seems more harsh in the 2nd series, showing some of the unspoken truths about Mafia world, Sorrowful ending of the enemies.\\n\r\nAlso the words used this time are more powerful & strikes in mind. Humans being lead to the Dark world without having any choices--is one of the main theme of this series.\\n\\n\r\nCharacters:\\n\r\nThe characters are very well developed & the dubbed voice is fantastic & completely matches with the characters.\\n\r\nBackground of the characters are though vague but shown in good manner & shows the reason of their attachment to the dark world.\\n\\n\r\nArt/Animation:\\n\r\nI don't know much about art, so cant really explain. To me the art seemed great. \\n\\n\r\nMusic:\\n\r\nThe OP & ED songs have the same lyrics as the 1st series. But they are sung differently \\n\\n\r\nEnding:\\n\r\nThe ending is sorrowful but spectacular. In short  The only way to give peace to those of the dark world is to end their sorrowful life\\n\\n\r\nEnjoyment:\\n\r\nSimilar to the 1st season It's a  very good anime to watch. There is not a single boring part & is filled with Action & hard talks.\\n\r\nAlso the story & the characters are interesting & will cling you on to your seats until you finish the series.\\n\\n\r\nDownside:\\n\r\nSome things are over exaggerated. Also few things are way unbelievable. Tries too hard darken the characters.\\n\\n\r\nOverall:\\n\r\nIt's a must watch for any action fan.And If you watched the 1st season & liked it, then it's a crime not to watch the 2nd season.\\n\r\nAt least I can guarantee that you will not be bored.",
            "date": "2011-08-09T21:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 41155,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/501729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jamil",
                "username": "Jamil"
            },
            "url": "https://myanimelist.net/reviews.php?id=41155"
        },
        {
            "content": "Black Lagoon: The Second Barrage is as unapologetically violent and foul mouthed as its predecessor, but it also delves deeper into the human psyche than the original and forces us to explore themes of morality, power and what it means to be human.\r\nThe Second Barrage picks up the story of The Black Lagoon Company, with Rock further settling into his new life in Roanapur. Mysterious assassins have begun picking off members of the different mafia groups running the city, and tensions are at fever pitch. By the time this story arc comes to a close 3 episodes later, you get the distinct feeling that TheSecond Barrage is decidedly more serious than the original, with violence being presented more as a consequence of the depravity of the human condition than the punchline in a series made to shock and awe.\\n\\n\r\nThe middle arc with Greenback Jane is more light hearted and reintroduces some favorite characters from the first season, along with a host of new ones that are at turns comical and very very creepy. It showcases perfectly the amorality of the denizens of Roanapur as former allies fluidly become foes at the bat of an eyelid. It is in some ways a stark reminder of just how dangerous the world Rock lives in is, and demonstrates how remarkable the bond of trust forming between Rock and Revy is.\\n\\n\r\nThe final arc is far grander, but also the most problematic. We get to see a lot of more the mysterious and powerful leader of Hotel Moscow, Balalaika. Set mostly in Japan, the story continually juxtaposes Rock's old life and setting in Japan against the criminal underworld he has now chosen to inhabit. Revy demonstrates a surprisingly soft side in this arc, constantly fretting over whether or not Rock is better off returning to his old life. It's not the \"get out of here, I don't need you\" routine we're used to seeing, but rather, a softer examination of what is best for the man who has been part of her crew for the better part of the last year. It's very well done. Pasts are revealed as situations complicate themselves. There's a very existential reflection on choices and superb monologues on accepting our lot in life. What is right or wrong is hard to determine as the philosophical backgrounds of the opposing positions is sound, but if anything, this central conflict serves as a reminder that this season is far more than characters toting guns and blasting their enemies into oblivion.\\n\\n\r\nOverall the series is superbly animated. For a series released in 2006 I believe, the art work, animation of vehicles and such is absolutely outstanding. The opening theme is particularly suiting, until you realize the words are in English, and then you simply cannot get over the pronunciations. Which brings me to my biggest gripe with the series, now, I ended up watching the subtitled version and I believe this is a mistake. There is much and more that is lost in translation this way, and certain lines simply do not make sense in the overall context of some conversations, or simply do not carry the same weight they do in the English dub. Moreover, the issue of language becomes particularly problematic in the final story arc because the characters all speak in Japanese, but are supposed to be in a setting where the fact that they do not speak Japanese is key to many of the plot points. It's definitely distracting ... and Revy being Chinese American, the show's attempt to make her speak English in certain scenarios in the sub are simply .. well, I would say hilarious if it wasn't so frustrating. It's hard to believe that a series that did such a good job everywhere else, would drop the ball so badly in this department. I would definitely DEFINITELY recommend watching the dub to avoid these issues.\\n\\n\r\nThen there's the issue with the pacing of character development. Ok, so Rock and Revy go on some introspective journeys together, and although subtle you can see Revy's attitude towards Rock change a bit, but the issue here is that not only is this not very much development in a 12 episode arc, or overall from the first season, but the series spends most of its time focusing on these two at the expense of the other members of the Black Lagoon Company, who basically get shafted. I'm willing to trade on screen time for those two, if we were given more out of Rock and Revy's on screen time, but there's precious little here and most of the \"development\" you would have to insinuate yourself. In one scene for instance, Revy attacks another character and says \"If you ever tease him (Rock) like that again, I'll kill you\" but we never really find out what this means in the larger context of her relationship with Rock. We do know it doesn't take much to get her to pull a trigger ... now I'm not expecting a love story here, but I would have liked to see something solid to indicate how Revy really feels about having Rock around and vice versa. Sadly, it seems to be mostly business with these two, and the only thing we know for sure is that they have mostly accepted each other as inevitable objects in the other's existence.\\n\\n\r\nThis aside, The Second Barrage is an absolute delight. There are not many anime's that manage to thoroughly entertain while disturbing your perceptions of morality so effortlessly. The show certainly revels in it's goriness, but for those paying attention, there are deeper issues being tackled here. I highly recommend this series, watch the dub if you can, as you will most certainly get more out of it than the sub, and I for one am eagerly looking forward to the more adventures from Rock, Revy and the rest of the Black Lagoon Crew.",
            "date": "2013-02-10T10:42:00+00:00",
            "helpful_count": 8,
            "mal_id": 86441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266895.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Last_Chevalier",
                "username": "Last_Chevalier"
            },
            "url": "https://myanimelist.net/reviews.php?id=86441"
        }
    ],
    [
        {
            "content": "Black Lagoon, the epitome of pure action on screen. This anime never fails to provide viewers with what they came looking for, providing a constant flow that never bores. Ren Hiroe's masterpiece truly embodies how action anime should be made; and despite its age, stands the test of time above many of the new action-based projects created by studios\r\nStory 8/10: Coming into an action anime might cause skepticism when it comes to good storytelling, i’m here to tell you not to worry about that. The story is told in a series of arcs integrated within lapses of time. Through these arcs we are shown notjust how the main characters (Rock and Revy) develop over time, but rather the continuous development of the city of Roanapour and those who inhabit it. Black Lagoon locks the viewer in to a non-stop thrill ride that continuously adds layers of depth to the the story through dialogue and good character development. In each arc we are treated to all sorts of scenarios that engage the viewer in each and every way, creating a universe which fully integrates all those who watch so thoroughly that it seems as though the city of Roanapour is just a flight away.\\n\\n\r\nArt 7/10: A product of its era the art does little to deviate from the norm and bestows the viewer with that aesthetically-friendly 2000’s anime feel. Not to say that the art is poor, as it does provide the feeling of realism and quality that one would expect from a well-liked manga adaptation. Black Lagoon’s strength does not lie in it’s art, but I don’t think the viewers expect (or even want) it to.\\n\\n\r\nSound 7/10: The opening theme for all 24 episodes features a song ENTIRELY in English. Now you may not see that as an issue, but they had a Japanese speaker with a heavy accent sing it. I don’t have a problem with that, but it just makes it sound a little strange (and not in a good way). I did however, like the outro. A nice dark melody paired with the dark footsteps in the sand helps perfectly seal the ending of each episode. Not a big factor, the sound takes a backseat to the non-stop action in Black Lagoon.\\n\\n\r\nCharacters 10/10: The series essentially follows Rock and Revy’s shenanigans as they journey throughout the world killing people and doing “piratey” things. Rock is the “out of place” character so to speak, being a former businessman from Japan he has neither the stomach nor resolve to be a pirate. Despite this he never develops into a true pirate throughout Black Lagoon (you can be the judge of that), but his character growth is evident and we begin to see him as a true member of the team, one whom is liked and respected by many. Revy is the polar opposite of Rock in that she has grown up in this dirty type of atmosphere. Constantly reprimanding him for his sense of what is “right”. Although they are polar opposites, these two play off of each other so well that they become truly indispensable to one another. Essentially taking certain characteristics from one another and becoming a team they once thought impossible. All of the side characters play a vital role in the story. Not a single character feels unnecessary and they are all flushed out in a concise manner that makes you understand why they are who they are. I would like to talk about all of the characters in-depth, but as this is meant to be read i’ll end with saying Balalaika is my favorite and a badass.\\n\\n\\n\r\nEnjoyment 9/10: If you’re looking for an anime that has non-stop action that develops overarching relations, with characters so in-depth that they seem nearly real, a highly engrossing story that creates a sense of fluidity between arcs. Then you have come to the right place. \\n\\n\r\nOverall 9/10: Although split up into 2 seperate titles, Black Lagoon functions as a single entity. Delivering 24 episodes of non-stop action-packed enjoyment, this anime gets almost everything right. A fun time for just about anyone, Black Lagoon is an anime that will leave you loving it and wanting more.\\n\\n\r\nThank you for reading this review, and if you haven’t already, do yourself a favor and watch Black Lagoon.\\n",
            "date": "2018-03-22T14:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 274583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7033662.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Himura-Kenshin",
                "username": "Himura-Kenshin"
            },
            "url": "https://myanimelist.net/reviews.php?id=274583"
        },
        {
            "content": "This series is deep yet simple. The show takes on a very dark reality of the world, showing the darker side of business in the world, and throwing a regular person into the mix. And of course through out the story, there is the confusing connection between the main girl and main guy (yes, yes, very predictable), but nothing is really said. Anyways, although the story is deep, it's only a compilation of several different stories.\r\nOver all, an 8/10, but people be forewarned. Although I gave this a light review, there is a lot of fast paced violence and plenty of gore for you actionjunkies.\\n\\n\r\nPS This applies to the first season as well",
            "date": "2009-03-31T22:57:00+00:00",
            "helpful_count": 7,
            "mal_id": 13672,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13672"
        },
        {
            "content": "(Note: My review of Black Lagoon, the first 12 episodes, applies also to this season as well. )\r\nBlack Lagoon... I don't even know where to start.\r\nTo be frank, I would usually follow the traditional format of Story/Art/Sound/Character/Overall, but... its just so damn good I really don't know where to start.\r\nAs a story, I can just say that it started on a little rough patch, but it paced itself so thoroughly and with such effectiveness that I truly have nothing else to say other than \"I kept watching till the bloody end\". And as a story, it really and truly is well developed - it usedin-universe logic and premise rationale throughout and relied entirely on the premise and environment which it has richly - and lucidly - kept strong. Not once did I - during my time spent watching this anime - feel that there was a need to consider outerworld aspects (i.e. any aspect outside the Black Lagoon anime universe) or perspectives when watching the story unfold. It is that damn good.\\n\\n\r\nIt is made better because of the Japan subplot and the Dracula kids.\\n\\n\r\nSound was brilliant - the gunshots were real, the minor detailing was real, the characters were handled lucidly and without even a shred of doubt about who they are. Everyone was menacing when they played their scripts, and even the explosions and the music fitted this anime.\\n\\n\r\nBut... but... there are a few snags in the subbed anime of Black Lagoon: the english portions which were read aloud didn't have the same effectiveness as the Japanese portions. Once you start watching the Yakuza-and-Japan subplot you'll get what I mean. I found them a little superficial to be frank. Although in terms of in-built universe, I don't blame the actors: they improvised the portions, but still pulled it off enough to NOT let the anime fall to pieces. In that respect, they were functionally adequate. Besides, when you hear bullets being ripped into half by a katana, the voice acting for the English portions seems like a fickle thing to complain about. Seriously.\\n\\n\r\nAnd speaking of sound, this anime has an addictive opening theme - Its not as upfront or bombastically epic as The Hero (ONE PUNCH!!!!) nor is it as upbeat as Cowboy Bebop's opening theme, but it definitely sets the tone, the pace and the roaring gun filled frenzy of Roanapur. And Roanapur has a presence which - because the overall attention to detail was handled just as brilliantly by the sound as it was in the story - is felt too close to home.\\n\\n\r\nAs for the characters... is it me, or is every character in this damn anime so badass its a sin to like them? Balalika, Revy, Dutch, Chang (he arrives in Second Barrage, but he's a presence in this anime as well), Roberta the Bloodhound of Florencia... I could go on, but they're all so well developed (and even more interestingly, three dimensional - because they use Roanapur to get by, and are all made better because they add to the environment which is established in Roanapur). I give credit where credit is due, it is this anime's characters who bring the story to life, and in fact made it twice as better.\\n\\n\r\nOverall, this is a 2006 classic. I call it a classic - period. This anime has done what a very, very rare number of anime have been able to achieve: remain watchable and still be fresh and involving while being scary and realistic. A definitive addition to any anime roster.",
            "date": "2016-02-20T13:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 211325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4587700.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/shehrozeameen",
                "username": "shehrozeameen"
            },
            "url": "https://myanimelist.net/reviews.php?id=211325"
        },
        {
            "content": "Second season of black lagoon. If you've seen the first and enjoy it, you're gonna enjoy this too.\r\nThe story continues the adventures of Rock and the Lagoon Company, but this time are more plots centered in Balalaika, the fearful leader of the Russian mafia in Rao Napra. As upporting character in the first season, she got more screen time in this, and if you want a female villain strong, crazy psycopath, bloody thirsty, strategist master ,surronded by men and harder than them, she's gonna be one of your all-time favourite villains.\r\nWe can divide this season in three arcs: the hansel and gretel saga, about twochildren who murder people all over Rao Napra; the Greenback Jane Saga, about and informatic girl who escape from the mafia she was working making fake dollars, the worst arc in my opion because it show some many old and new characters without even a good presentation, making the story less interesting to follow; and the Washimine clan Saga, the best in my opinion, because it returns the spotlight to Rock and Revy, without privating us of a Balalaika's dose. and of course, the fights. The fights are still one of the best parts of the show, so you're not gonna to be disappointented. The soundtrack is the same, following the logo if something is good, why change it?, but with some new song.",
            "date": "2015-04-30T08:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 186832,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4262579.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlancaXLobo",
                "username": "BlancaXLobo"
            },
            "url": "https://myanimelist.net/reviews.php?id=186832"
        },
        {
            "content": "Black Lagoon: The Second Barrage, gives the audience more of what they’ve come to expect. Lots of action, dark comedy, and brooding characters make this a worthy second season, though a prolonged final story arc and some needless things here and there detract from the overall experience.\r\nPros\r\n1) More of the Same- The first two arcs of this second season contain all the sort of things you’ve come to expect from Black Lagoon. The first arc focuses on incestuous vampire twins and gets weirder and weirder the longer it goes on. The second arc focuses on a money launderer and the hunt for her by everybaddie in Roanuper. The third arc deviates quite a bit from the normally fast-paced and action heavy script of the other arcs, but I’ll get to that later. The first two arcs show that the writers knew what the audience wanted. They focus on wacky action, fun characters, and that general sense of fun that pervades this very dark show. The fact that Black Lagoon can blend the merciless and brooding with the funny and entertaining remains a testament to its strengths. As I said in my review of the first season, it’s so hard to balance comedy and darkness, action and silliness. Especially in something as usually serious as Black Lagoon is. But this series manages to do so. The fact that the second season is more of the same isn’t a con because this is what the audience wants.\\n\\n\r\n2) Revy’s Development- Revy continues to develop in this second season and manages to become an even better character due to this. While at the beginning of the series she was unapproachable, annoying, crass, and a total bitch to Rock; she’s really developed into something like a…girlfriend. I mean, she’s not dating him and she’s not overtly saying anything but the gradual softening of Revy is one of the more interesting and well done aspects of the show. In this season, especially toward the end, we see a different side of Revy. This is especially due to her entering Rock’s world and seeing what her definition of a normal life would be. She’s where Rock is, stuck between normalcy and piracy and not able to move one way or the other. So she plays with kids, she’s nice to Rock. She still kicks some ass, but she has feelings toward Rock that are never overtly stated. She’s a total tsundere without falling into the high school level conventions of the character. She blushes, she softens up, but she’s not loudly calling him a baka and crying in corners. I feel that out of every character, Revy was the best developed. Rock stays mostly the same through the whole series and Benny and Dutch aren’t even given much focus. This is the story of Rock and Revy. Any romance is implied, but not shown.\\n\\n\r\n3) Animation- I don’t think I ever took the time to praise the animation for this series. It’s damn good. Even watching the DVD version on a sixty-inch the show looks like a freaking blu-ray copy. Even my friend mentioned that when we watched some of the show together. Black Lagoon has really good animation. Sure, from afar faces can look Picasso-esque, but close up the characters faces show all kinds of mixed, weird emotions that are fun to try to understand. Revy especially has these looks of disgust/boredom that are both hilarious and deeply integral to her character. The animation does a good job of expressing emotion and making the characters much more interesting because of that. The action scenes are also exceptionally smooth. There was definite care taken in making sure the series looked good.\\n\\n\r\n4) Balalaika- Dis bitch cray. Balalaika pulls most of the strings in the series and while the first season gives us a good idea of who she is, this second season gives us a lot of her. She’s remorseless, cruel, and batshit insane. The final arc is fairly dull but the parts containing Balalaika shine. While I could have done without the part of her backstory concerning becoming a ballerina (is that all Russian women can attain to be?), the rest of her parts are great. The first season made Revy out to be the crazy bitch but this season really shows that Revy is nothing compared to Balalaika.\\n\\n\r\nCons\\n\r\n1) The Final Arc- The final arc isn’t bad in any way. The story itself is good, the action scenes are excellent, Revy and Rock getting in the middle of a war is pretty great, and the character development is wonderful. But it goes on way too damn long. This single arc stretches across half the season and the pay-off is forgettable. This was an arc that could have probably been about four episodes if it had neglected to show all the ridiculous high school antics and build a character who is both extremely boring (she can pull quotes from philosophers out of her ass), and just there to play point-counterpoint with Rock. Which is part of the charm of the character building, but, in the end, it wasn’t effective because the bitch was crazy! If it had been a normal girl, someone like Rock who got pulled into the world and was forced into being part of the underworld, who didn’t succumb to the craziness, it would have been so much more effective. If Rock had to realize that in order to protect people like her from the underworld, you have to kill in the underworld, it would have been more effective. I understood the tone and meaning of the final arc but it fell into a long-winded, very Japanese style of story-telling. Which just might be the point. We go from a very western, gung-ho style of story-telling then move to a slower, Japanese version. It’s part of the counterpoint to Revy and Rock’s lives. Ultimately, this arc left me with mixed feelings.\\n\\n\r\n2) Panty Shots!- We got some Revy fan service in the first season. But this season, we get all the fan service we need in the second arc, when a silly girl who counterfeits dollar bills continually shows her panties every time she moves. Perhaps that’s part of building her character and showing her as silly, but at the same time, it’s rather pointless and, for me, detracted from the experience. There were more panties in this season then I would have expected. It didn’t totally detract, but was a minor nuisance.\\n\\n\r\n3) Neglecting Benny and Dutch- While the focus on Revy and Rock is welcome; the series never gives much of a chance for the audience to get to know Dutch and Benny. They’re part of the crew yet we are only given fleeting glimpses of Benny and Dutch maintains a kind of stoicism through the whole series. There was a lot of room to build character that never got a chance.\\n\\n\r\nOverall\\n\r\nBlack Lagoon: The Second Barrage is a good follow up to the first season, though unbalanced. While not as strong as season one, it still makes for great entertainment.",
            "date": "2015-05-22T11:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 188484,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188484"
        },
        {
            "content": "Before I begin this Review this is going to cover both seasons and the OVA no spoilers. lets start the review the story I thought it was a good the story follows a Japanese businessman named Rokurou Okajima and one day he gets kidnapped by a group of mercenaries or hired guns what will happen next. that is the story with out giving to much away next the action. the action in this anime was fucking great it was unrealistic but if your watching an anime i doubt your going for realism. next the most critical part of making this anime amazing and that isthe characters no doubt the characters is what made this anime great with out the great characters I would of got bored and probably would of gave this anime an average rating at best the characters were great they had there own personality and they felt like they were  actual people and not the cookie cutter characters like you see in a lot of anime. and each of the main characters had a really good backstory. overall the characters is what made this anime so great, next the art and sound I personally loved the art and the sound no problems there. next the negatives it was really hard for me to find negatives and believe me i am hard on anime if you dont believe me read my other reviews. but after thinking for 10 minutes there are only 2 things I can really think of the action in this anime was unrealistic I personally dont care about that because this is an anime but if you care that could be considered a negative and the last thing is the story progression the story really doesn't advance what you get in the first 5 episodes is all your really going to get as far as the story is concerned. Overall one of the best anime I have ever watched so far and I will say this it is important you watch both seasons and the Ova if you want more backstorys I dont really consider them different seasons I think its is just one big season if your curious about seeing what happens next the manga got picked up again last year the manga has 97 chapters on the day I am writing this all the seasons and the ova ends on chapter 76 it picks back up on chapter 77 if you want to read it. Overall great anime This is definitely on my rewatch list.",
            "date": "2018-03-24T17:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 274893,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7052310.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DJM47",
                "username": "DJM47"
            },
            "url": "https://myanimelist.net/reviews.php?id=274893"
        },
        {
            "content": "[This is a review for both the seasons.]\r\nArguably the greatest action anime ever made,Black lagoon is the very definition of badassery.Now it's very hard to review this show because of the fact it's nothing special as an anime.It's story is almost non-existent but it's one of the most entertaining experience anime has to offer.\r\nBlack Lagoon is about a group of mercenary called the Lagoon company living in the criminal shithole known as Roanapur.Okajima is an average japanese person who gets caught with the lagoon company's affair and after being betrayed by his company decided to join them.Honestly that's about it.Just as I've said before thestory is non-existent.Although there are 2 story arcs that shines through.The Incest twin sibling arc and the final arc of Washimine clan.On to the positive note,Black Lagoon has some of the most enjoyable and memorable cast I've seen in an anime.This anime absolutely thrives on it's characters.The main cast includes the Mr.Nice Guy Okajima(rock),The Black Muscle Man Dutch,The Computer Genius Benny and of course the most badass chick in the galaxy Revy the Two Hand.Even outside the main cast the supporting casts are just as memorable and enjoyable as the main one.Balalaika is one of them and she has a very unique and well rounded personality,making her one of the most memorable character in the anime.Not only the people who work as really good cast,this anime uses object or an entire location as it's character as well.Kind of like,The Shining did with the elevator.It creates a very unique and well set up crime underworld called Roanapur.Which serves almost as a character part of this anime.Hoestly,Roanapur might be the best city set up in any anime.Black Lagoon is a very stylistic anime which depends on it's characters.The story just isn't there.So,the characters needed to be spot on and they striked gold on that department.It is hugely considered one of the best action anime ever mad if not the best.Honestly,the standard of action in this series is yet to be matched by any other anime.The action is total in your face badassery.This series is filled with tons of action and blowing shit up.Literally,this series blows up just about everything it sees.If you don't wanna watch a series that is only about action and nothing more than it's not for you.The sound track for the most part isn't anything special but it does it's job.The opening and ending however were great.The ending specially is very well used.My favorite moment in the entire series is the end to the twin incest sibling arc.After that story ends,the show changes it's ending song into a very peaceful track and we see the girl walking beside the shore and meeting with the boy in the end of the darkness.The writer changed their ending song and the video to add a perfect ending to that story arc.I know most of the viewers will never notice it but it's the subtle things that makes this series special.This series has surprising amount of subtle character weighting.The animation is extremely well done.Madhouse have done an excellent job.\\n\r\nIn the end,Black Lagoon is an extremely well done action series.It is filled with cliches and tropes and the story does nothing but create endless amount of chances only to have action and explosions.But that kind of works for this series.You don't always need a great story as long as you have incredible amount of badass characters and action to support your show.",
            "date": "2017-02-07T00:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 240076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5528286.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Thatevafag",
                "username": "Thatevafag"
            },
            "url": "https://myanimelist.net/reviews.php?id=240076"
        },
        {
            "content": "The second barrage is death , cruelty , pain , suffering and death all in one pakkage seen from the eyes from the one who walks between the so called good and bad sides. \r\nThe story is a sequel to the first season showing other sides of the world of Roanopraur. Though it also delves deeper in the mind of our two main characters. The stories are as evil and wicked as from the same anime and the gunfightings are as vicious and interesting to watch. It will explain that ignorance isnt an exuse when you are in this kind of city and it willpush our dear main characters farther into a world filled with everything this world of clock and daggers has to offer even in the world of druglords , murderes and war mongers. \\n\\n\r\nThe sound and characters are all the same but one character will see how deep this abyss called roanopraur actually is. You will also see the true faces of our good russian friends in it and see how hungry someone can be about starting something fun filled with gun powder. \\n\\n\r\nAs the first i enjoy this to its perfection few anime ever give me this thrill of watching such a dark yet beatiful anime. This is one of those anime i will always fall back to and remember this one was great this one had it all. \\n\\n\r\nOverall i might as well give it 10 or 9 but as last i give it 9 since im such a twitching person when it comes to give the one or the other.",
            "date": "2016-12-12T10:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 235328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5327546.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Geddon616",
                "username": "Geddon616"
            },
            "url": "https://myanimelist.net/reviews.php?id=235328"
        },
        {
            "content": "After greatly enjoying the first season of \"Black Lagoon\", I was more than eager to watch \"The Second Barrage\" and I was not disappointed. It's the same joyous carnival of bullets, blood, profanity, and colorful characters. This second season has the advantage of already having established characters and improves upon the first with some better and crazier stories than featured before. Even with the improvement, forget the stories. Forget the art. It's another12 episodes of shoot 'em up, Anime junk food featuring our four protagonists vs. a new batch of unique adversaries and obstacles. A show still enjoyed best, in my less than humble opinion,in English. I had just as much fun with this season as I did last and you should, too. Not much else I can say. 8/10. Check it out. Cheers!",
            "date": "2016-11-20T05:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 234055,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5233934.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GarlandReese",
                "username": "GarlandReese"
            },
            "url": "https://myanimelist.net/reviews.php?id=234055"
        },
        {
            "content": "I hoped the last two eps from first season would lead the plot somewhere, but it looks like after the first episode you can watch the stories in any order you want, you won't miss a thing 'cause there is no plot or characters development at all, it's kinda like watching Tom and Jerry episodes.\r\nThey added some good humor scenes here and there in this season, but also lots of awful over the top action scenes - massive shootouts where no one gets hit and so on.\r\nI was disappointed with the plot but I have to admit the last story was interesting and managed toavoid bigger clichés in the end.\\n\\n\r\nThe music still the worst part to me. I can't add much from my review on the first season.\\n\\n\r\nBlack Lagoon is not all bad, I think it's average, but if you are looking just for some action you may like it.",
            "date": "2016-01-16T13:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 208672,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5103626.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 1,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PxHC",
                "username": "PxHC"
            },
            "url": "https://myanimelist.net/reviews.php?id=208672"
        },
        {
            "content": "Finally, a North American release! This second season is a fantastic action anime series that I consider to be the successful successor to \"Cowboy Bebop\". Overall, I think the bar was raised on this second outing and, though it's not perfect, I'll round it up to 5-star status because it comes so close. The character development is great, the new characters are all memorable and entertaining, even with limited screen time, and the familiar faces are a more than welcome sight. If you enjoyed the first twelve episodes, have no fear; this anime continues to deliver big time. The added depth and emotional content ofthe epic final arc will be gobbled up by fans of more serious works and the fast-and-furious action and humor of the first half of the season should please everyone. There's talk of a third barrage, which will hopefully gives us more of the Black Lagoon and completes the teasing glimpses we're given into Revi's childhood.",
            "date": "2014-06-04T04:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 145767,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3425797.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 8,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jyagan0",
                "username": "jyagan0"
            },
            "url": "https://myanimelist.net/reviews.php?id=145767"
        },
        {
            "content": "The previous season of Black Lagoon contained episodes 1 -12, and those episodes followed the adventures of Lagoon Company, as they took on several jobs that landed them in conflicts with powerful businessmen, Neo-Nazi's, and even a killer that was tough enough to pursue them nearly all night. The series isn't cheap at all with delivering its bloodbaths through numerous shootouts. At its core, Black Lagoon is an action first anime title, but it also has characters that are meant to be more than plot devices as the show attempts to drive home its various themes. The show is quite ambitious; Black Lagoon: The SecondBarrage is season two and it continues to stick with what works. However, there's more of a focus on its characters both old and new, as it explores these people's backgrounds, surroundings, and how these things effects them. \\n\\n\r\nIt's worth mentioning that this season is quite different; take the first three parter for example. The main characters of Lagoon Company actually fall into side character roles, which means very little appearance of Revy's over the top antics. I would probably have a problem with this if Black Lagoon's world wasn't so interesting. The first story involves two very young Romanian twins, Hansel and Gretel, as they run around the city of Roanapur killing members of Hotel Moscow, Roanapur's resident Russian mafia. The characters even have that chibi appearance somewhat, in which this is something I have grown to hate when tossed into serious anime. The solid writing provides a reason on how come these characters work, as the anime continues exploring these darker themes with the dark atmosphere to match it. The content is quite disturbing as it lightly steps into incest, and further explores reasons on what leads some people towards atheist beliefs. It's very easy to understand how these characters turned out the way they did, and it can also cause the viewer to wonder what exactly goes on in these third world countries, where children are terribly abused and tortured for no real reasons. \\n\\n\r\nThe writing excels further because these kids experiences receive very little to no visual flashbacks, it's all by mouth and sometimes these horrors work better in stimulating your imagination as opposed to providing visual details. It's amazing what good episode writing can do for characters. I cared more for Hansel and Gretel in only two to three episodes, than I did for Lucy, Kouta, and Yuka in Elfen Lied across thirteen. The same for those silly rejects in High School of the Dead. I hated all of those characters across those two anime series and wanted them to die screaming. \\n\\n\r\nThe second multi-parter is considered weak concerning character study when compared to the other two stories, since it focuses heavily on action. I don't find it to be as bland as some sell it. This time the story develops Roanapur itself, the city of outlaws. It has been mentioned several times that this city is home to the lowest of the low. This story arc explores that in a way as Revy of Lagoon Company, and Eda of the Rip-Off Church find themselves in battle with other criminals over a bounty. These people all know each other, drink together, even have worked together, and they're prepared for all out war against one another for money alone. At the very least, it provides insight on the cutthroat amongst outlaws. I feel the story here had potential to be far more than just another action romp for the most part, but it does deliver and proves to be quite entertaining, even working well with its dark humor. \\n\\n\r\nThe final story focuses on Rock and Revy, while at the same time shares airspace with old and new characters; Balalaika of Hotel Moscow and Yukio of the Yakuza respectively. I enjoyed this story arc most, as it continues to explore the usual themes, but it steps also into family responsibility, choices, and consequences. This arc follows Balalaika as she brings war to Tokyo in her attempt to smash two Yakuza branches, with Rock as her interpreter and Revy as his bodyguard. The Yakuza have no plans on going down quietly, and Yukio is forced into the fold due to her relations with them. There is a good amount of action to take place but it is overshadowed by the characters. I definitely enjoyed the character study here, in which we get to see what may happen to a person exposed to the outlaw life, and completely on their own enjoying its rush. It brings to light that there is a devil lurking inside us all, and all we need are certain pieces to fall into place; whether those pieces are actually excuses or not really isn't relevant. \\n\\n\r\nBlack Lagoon indeed has its flaws though, but this anime could have been a whole hell of a lot worse. I commend director Sunao Katabuchi for not attempting to appeal to everyone. Around this time anime had taken a turn to inject all manner of genres into its narrative just because, and not out of need at all. Rock and Revy's relationship is handled very well, and we're not provided an abundance of asinine scenes containing the usual otaku clichés to remind us that they probably like each other. He also deserves a lot of credit for removing main characters from the foreground and still keeping the narrative interesting. Some things such as more of Eda's origin, some insight on Dutch himself, and even more details concerning Raonapur may have benefited the series. The use of symbolism, exploitation of themes, even the somewhat use of nudity were just very well handled and found its place in the narrative. \\n\\n\r\nThe animation is slightly better this time with backgrounds of the city and night time views standing out. Some of the action has their cool moments once again with those shootouts, but I think the previous season had a bit more. I really liked the use of symbolism in regards to the character designs; I'm mainly thinking about Hansel & Gretel here. The characters are dressed up in black almost appearing to be ready for a funeral, while their hair is a spooky shade of white, which provides all of the detail on their view of life. There is no gray area to them and their design did a great job introducing this amount of information. It helped in working towards the character's mystery. The new design for Revy was cool too, the extra clothes were needed since I got tired of seeing her running around in cut off shorts and tank top. The message with her was long ago made clear. \\n\\n\r\nThe voice work for the English dub is still awesome to me, and I prefer listening to it over the Japanese language. Maryke Hendrikse is still edgy and cool as Revy. I think Saffron Henderson was cool and sexy as the Taiwanese sword handler Shenhua. I didn't even know it was her until I read the credits; she sounded so different from other roles such as Sachiko Yagami in Death Note or even Junko Saotome in Nana. The voice work is solid all around; it could have used a bit more of Dean Redman as Dutch, it's pretty funny listening to him flip out even though it was only once here. The soundtrack is still the same, with only one new slow song that is played for the twins. The opening rock and electronica hybrid song Red Fraction by Mell is still featured, and the background music still only does its job setting the mood. \\n\\n\r\nBlack Lagoon is an anime that I appreciate more now than before. This recent re-watch was such a breath of fresh air, because it was a break from all the random, puerile bullshit the anime genre has been known for as of late. Over the last several years anime has gone to hell; this is one of the only somewhat recent titles I can sit through without gritting my teeth. While it does throw in humor, it's still tonally consistent, nudity and fan service is quite tame when compared to many other titles, plus it has a good amount of bloody action. If you missed Black Lagoon then give it a shot, even if you hate anime give it a watch any way.\\n\\n\r\nHighs: Characters are pretty strong, use of themes, action\\n\\n\\n\r\nLows: Not as action-filled as last season, BGM is decent at best\\n\\n",
            "date": "2015-11-01T16:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 202452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4526092.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Luquillo",
                "username": "Luquillo"
            },
            "url": "https://myanimelist.net/reviews.php?id=202452"
        },
        {
            "content": "Warning possible Spoilers\r\nThe trouble with making a second season is trying to out do the first season, now at first this season was doing well then things took a bit of a spin.\r\nThe story continues with the Black Lagoon company who carry on doing their mischievous deeds to earn a quick buck, but they get themselves into situations bigger than they thought.\r\nNow the last season had a big lack of story and relied on the action and characters, this season decides to create more of a story since the arcs last longer compared to the first hell one arc lasts for the entire second halfand I thought this was a good idea since we get to see the relationship between Revy and Rock grow stronger, we also get to see more of how the Mafia world works and how dangerous and convoluted it can get which resulted into some deep subjects especially with Rocks view on the whole criminal society and how it works which really changes his perspective by the end of this season and brings him closer to the mindset of the other Lagoon members while also containing his own morals and humanity, there was also a darker element this season too because it began with two incest, crossdressing, creepy vampire kids who were pretty messed up in the head and it was only just the beginning of how intense this season got.\\n\\n\r\nNow the characters were a little mixed this season, yes you got more progress in Revy and Rock's relationship hell even Revy started going along with Rock's plans from time to time until he did something absolutely stupid that almost got him killed like questioning Balalaika's decisions and almost getting chopped in half by a chainsaw which makes her very angry, but she does show signs of protection showing that she does have a soft side and is willing to open up to Rock from time to time in this season.\\n\r\nSome characters like Eda and Balalaika were given more screentime this season which I did like because you get to know more about their personalities like Eda's relationship with Revy which shows they were a badass duo together when they get caught in a firefight and with Balalaika it just shows how ruthless of a woman she is and shouldn't be underestimated because she is definitely the scariest character of the entire show, but this causes a bit of a conundrum with Dutch and Benny who got considerably less screentime than the first season and that kind of sucked because Benny as a character still hadn't proved himself for me and Dutch was cool so giving these two less screentime was a big mistake.\\n\\n\r\nThe artstyle is just as good as the last season with the locations mainly being in Roanapur and Tokyo Japan so the locations this season weren't as extravagant as the last one, but it didn't really annoy me since we did get a lot of locations in the last season and seeing Rock finally back in Japan was certainly interesting since he has finally returned home since his kidnapping.\\n\\n\r\nThe action continued to be amazing the firefights were hectic, intense and suspenseful. The joint co-operation with Revy and Genji fighting a bunch of guys in a bowling alley was definitely one of the best parts of this season along with Revy and Eda teaming up to fight against the other criminals of Roanapur was also really entertaining since we get to see Revy fight against people she's had to work with.\\n\\n\r\nOverall this season wasn't as good as the first, but it did have more of a story and was more deep than the first so I'll give this season credit for that, if you enjoyed the first season then you'll certainly enjoy this one.",
            "date": "2017-06-24T12:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 250884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=250884"
        },
        {
            "content": "I can't believe how awful the second season was! The show did have some silly aspects to it, like the maid who couldn't be killed, but this season just went way overboard. Among the ridiculousness we have a pair of adolescent twins who are able to kill organized gangs of criminals with guns surrounding them (one with an AXE no less), the \"rip off\" church seemed somewhat implausible but even more so this season with the super busty gun toting nun, the new priest eager to fire guns at anyone and everyone, and the head sister firing some kind of explosive gold gun, and acowboy who is supposed to depict the typical Floridian... Need I go on?",
            "date": "2013-03-02T09:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 88413,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 3,
                    "sound": 0,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/nightmareofmitch",
                "username": "nightmareofmitch"
            },
            "url": "https://myanimelist.net/reviews.php?id=88413"
        },
        {
            "content": "Black Lagoon manages to captivate with intense action and extremely likeable characters. It's only downfall is that it spends far too much time concentrating on the stories of side characters and leaves the far more appealing stories of the main characters up to the viewers imagination.\r\nThe characters of Black Lagoon are it's strongest point. Rock stands as the focal point of the series, a businessman who's tired of his life and chooses to enter the criminal underworld. His character could have easily been irritatingly indecisive but he proves to have a strong backbone by standing up for what he believes in, even in the faceof the toughest criminals. His coworker Revy, is the most instantly appealing character in the show. Although she remains a violent gunslinger throughout the entire series, her internal conflicts are acknowledged and make her seem like much more of a real character. Finally, the last amazing character in this show is Balalaika. Balalaika may be the most badass female character in all of anime, period. In a show that is filled with violent characters, she stands above the rest as the smartest and most powerful. There aren't many characters in the anime that don't acknowledge her power and the few who do don't, don't live very long at all. Overall, all of the other characters in the show were also interesting and I'd have to say the show deserves to be commended for creating so many engrossing characters.\\n\\n\r\nThis show is also insanely entertaining. The intro is great for preparing viewers for the carnage that fills almost every episode. The action sequences are all fast-paced and unpredictable, with new characters that always bring a twist to every battle. The ending theme also brought an appropriately dark tone to the end of every episode. \\n\\n\r\nThe biggest drawback of Black Lagoon is that it fails to set up a clear narrative and instead chooses to follow the stories of different insignificant characters. New characters are introduced every three episodes who then become the focal point for the next few episodes before they are never seen again. This formula became increasingly frustrating as the show approached it's conclusion and I felt like I knew more about the various side characters than the main characters that I cared most about. The best episodes in this series are the episodes which concentrate on the two main characters, Revy and Rock. Unfortunately, there are far too few of these episodes and the backstories of these characters are left mostly up to speculation. This is unfortunate because the few moments that we get with the two of them seem like they could lead to a far more interesting plot. \\n\\n\r\nRegardless, Black Lagoon succeeds in doing what it strives to do. It's entertaining, has great characters and explores dark themes that most other shows don't dream of approaching. It's greatest downfall is that it doesn't aim high enough. With a bit more ambition, this anime could have had a cohesive plot that focused more on it's great main cast, rather than on irrelevant side characters. Black Lagoon comes close to dark, violent perfection but narrowly misses the mark.\\n\r\n9/10",
            "date": "2013-10-22T21:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 117929,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3274041.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/msdrakegx",
                "username": "msdrakegx"
            },
            "url": "https://myanimelist.net/reviews.php?id=117929"
        },
        {
            "content": "The second installment of Black Lagoon carries on from where the first left off, as has been noted, there doesn't seem to be much of a change of pace, I watched both series back to back and due to the intros being the same it felt like one big continuation. However there are some distinct differences between the second barrage and the first series.\r\nThe story is split into three mini arcs, and ususally involve a look at some of the other characters in the show. The first mini arc gives its attention to Balalika, the second Revy and Edna and the third tries to bringin Balalika, Revy and Rock. I have to admit I didn't enjoy this format as much as the first series, for the majority of the series the crew of the Black Lagoon are barely involved, Dutch and Benny are barely seen throughout the series. Some of the plots for the mini arcs are questionable as well, I didn't enjoy the first two arcs, though I thought the third arc was back to Black Lagoon best although it was ruined by horrific English use.\\n\\n\r\nThe artwork is the same as before and is very well done and the darkness of the backdrop fits in well with Roanapur's dark and dangerous feel. The sound really lets this series down, I was already worried from the first series hearing Revy, a supposed American-Chinese national, murdering her English lines, and it just gets worse in tsb. The third arc take place in Japan, and Rock is brought along to translate, as everyone in Roanapur speaks English (yeah, I hadn't really caught that one either), and the use of the Japanese floating back into terribley pronounced English is grating, and is a real downer on what is otherwise a very interesting part of the story.\\n\\n\r\nThe Characters are all very well written, we don't get any new major characters this series, and get some additional background on Balalika, Edna and Revy which was interesting, I was somewhat disapointed that for the length of the series we didn't get a more in depth look at Rock adjusting to life on the edge (The last mini arc does go into it, but thats without interaction from Benny or Dutch and life on the Black Lagoon) and a look at how Benny and Dutch came to be there, hopefully Black Lagoon 3 will look at this.\\n\\n\r\nOverall its a decent series to watch but suffers from being a sequal to such a fresh and action packed first series, to which it doesn't really ever live upto. Added into that the terrible forgein lanuage scenes, and storylines which don't really contribute that much to the story, its a 7 for Black Lagoon tsb, and hopefully back upto standard for the third installment.",
            "date": "2009-08-07T02:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 17561,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1293.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GeneralCox",
                "username": "GeneralCox"
            },
            "url": "https://myanimelist.net/reviews.php?id=17561"
        },
        {
            "content": "This is a really good anime that had soo much potential but chose not to use it. Black Lagoon would've been amazing if it allowed the main character to' pick up and keep the gun', like how the main character did in Phantom Requiem for the Phantom.\r\nThe story in the beginning was very good, it's what got me hooked on Black Lagoon, so I give it a (9). It would've received a (10) if it used its full potential. The art (8) was good for the time it came out but the sound was amazing (10). The voice actors were perfect for the characters thatthey were given. Characters (10), there really shouldn't be anyone that you'll dislike in Black Lagoon. You may find that you actually love all the characters, the best thing BL has to offer is they're characters. Enjoyment (9) although the story didn't go where I thought it was planned I still really enjoyed Black Lagoon and really loved it. Overall (9) Black Lagoon was still a big success. When I just started watching it for the first time I was already very interested in it just by watching the intro. If anyone is looking for action and some comedy, this is the show for you",
            "date": "2012-09-22T14:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 72961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479765.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/CoolBreeze",
                "username": "CoolBreeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=72961"
        },
        {
            "content": "\"People are like dice, we throw ourselves into life\"...\r\nThe second season of Black Lagoon is very much like the first season under some different settings or the Lagoon Company or Rock or Revy getting themselves into the thick of it all by sheer luck. This season is split up into three arcs what LA dubs the Hansel and Gretel arc, Greenback Jane arc and the Yakuza arc.\r\nMild spoilers ahead...\r\nThe Hansel and Gretel arc shows us two homicidal blood hungry KIDS by the names of Hansel voiced by Omi Minami and Gretel voiced by Tomoko Kaneda as our villains of this arc. Hansel and Gretel asvillains are given a rather tragic backstory and as to HOW these two kids becomes murderers however it once again shows Balalaika's ruthlessness in full force and what Balalaika's wrath entails when you blow her fuse. The highlights of this arc are Hansel and Gretel themselves as they just ooze villainous intent and for KIDS, even LA was intimated if only because kids and Ronanpur don't usually go together. The obvious flaws are that even though LA thought they were villainous yet sympathetic characters, Rock and Revy don't really have much impact in this arc and is almost entirely focused on Balalaika's rampage to take down these murdering children. On the the upside, LA actually hearing Tomoko Kaneda doing a kiddish evil vocal accenting has shown a new light in Tomoko Kaneda voice acting as a result of Gretel.\\n\\n\r\nGreenback Jane's arc kickstarts with Revy and Eda getting into some luck with the titular Jane Bhai voiced by Miki Nagasawa of this arc with her illegally making counterfeit plates. Eda gets some focus in this arc for a bit if only to show how the Ripoff Church functions in Ronanpur. LA would have say that the arc is slightly predictable however what happens in the climax becomes chaotic to the point of multiple characters old and new (like Shenhua) gets into this. LA thought this was the lowest point of Black Lagoon for LA, LA did enjoy the carnage and the newer and older character mingling and causing chaos and all but besides the goal of Jane Bhai's \"deal\" for Revy and Eda, LA didn't get much from this arc. If there WAS anything to get out of this arc then it would have to be of showing how Ronanpur is like in a bigger scope...though the first season kinda already did that.\\n\\n\r\nAnd finally, probably the best arc of this second season being the Yakuza arc. This arc not only once again showed you DON'T mess with Balalaika but also FINALLY got into a bit more depth with Revy and Rock. The Yazuka arc for LA can be a counterpoint to the Hansel and Gretel arc where this time Balalaika is the one initiated the wrath of another mafia group instead of when Hansel and Gretel killed one of Balalaika's men that caused their manhunt in their arc. Revy and Rock's dynamics also gets tested once again only that we're in Rock's turf and his want of a normal life creeps back in, this kinda reflects another new character in this arc by the name of Yukio Washimine voiced by Houko Kuwashima and her being dragged into the Yakuza underground. Yukio's strong loyalty to her clan and wanting revenge against Balalaika also is similar to Balalaika herself BUT also her traditions that were thrust towards her as well as her connection to Rock though coincidental also shows her fall into the dark underbelly of the Yakuza similar to Rock with his partnership to the Lagoon Company. Yukio is the focal point of this arc but Rock and Revy gets developments as well mainly of Rock converting back to how he was in the first season's early episodes wanting people to turn good but not knowing their backstories or more or less not caring about them and telling them it's fine when it's not with Revy more or less snapping him out of it showing that be it Ronanpur or Japan, corruption is EVERYWHERE and just being somewhere away from the depraved criminal underground of Ronanpur isn't gonna change that. The Yakuza's arc is the longest of the three arcs but by god did this arc do itself justice by giving us multilayered new characters to root for, Rock and Revy's development as well as the themes being connected and/or similar to Yukio made this arc brilliantly executed. The only flaw?...the Engrish from Revy and Balalaika...but it was funny to hear the Engrish nonetheless.\\n\\n\r\nThe animation done once again by MADHOUSE did a great job as usual even if the quality somehow dipped at times though not blatant enough for LA to see. The gun fights and the \"craziness\" of many of the arcs were adrenaline pumping as usual. Besides some of the quality dipping at times, the animation was consistent and almost comparable to the first season's quality. \\n\\n\r\nThe voice acting, well the voice acting is decent and consistent enough, Megumi Toyoguchi, Daisuke Namikawa, Mami Koyama, Jun Karasawa, Tomoko Kaneda, Omi Minami and Houko Kuwashima did excellent in their respective roles. Yes if LA needs to reiterate but Megumi Toyoguchi and Mami Koyama's Engrish was uncanny to say the least...but again...funny in it's own way.\\n\\n\r\nLA won't say Second Barrage is better than the first season as both this season and the second seasons have their faults that manages to cover each of their weaknesses in the first place. For one, LA thinks the Greenback Jane arc gave more world building to the city of Ronanpur and the Ripoff Church in comparison to the first season, while the first season developed Rock and Revy's partnership rather well but Second Barrage only strengthen it with the Yakuza arc while the Hansel and Gretel and the Yakuza arc showed TRULY how ruthless Balalaika is while the first season only gave us a hint to how much of merciless boss she is while at the same time LA can easily say that the Hansel and Gretel arc is similar to the Roberta arc. So even though the Yazuka arc is for LA the best Black Lagoon has to offer, Second Barrage is still on par with it's first season for LA's preference with all it's highs and lows. \\n\\n\r\nNonetheless Black Lagoon as an anime series is an utterly unabashedly a wild ride of gunfights, blood, insanity, depravity and showing us the lowest of the low for humanity and how it survives...and LA just loved every second of it.",
            "date": "2018-02-08T16:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 271064,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=271064"
        },
        {
            "content": "I feel as if the writers decided they needed to outdo the previous season of Black Lagoon with ‘The Second Barrage’ and ended up getting some mixed results. For the most part they succeeded tremendously with the exception of the first arc which centers around child killers. This season begins with some of the edgiest episodes imaginable. Our team of mercenaries end up crossing paths with a pair of psychopathic children who escaped from their lives as slaves. This part of the narrative doesn’t fit the tone set in the first series and ends up feeling very jarring.\r\nSo with that out of the way let’stalk about the main arc. In the first season our heroes had to fight Nazi’s, crime lords, and other mercenaries. How can you possibly top that? The answer is simple; They end up going to War. Balalaika the Ex-Soviet army captain decides she wants to seize power in Japan. I won’t spoil what happens, but I will say the brutality of the action steps up a notch. Hotel Moscow acts like a Guerrilla army, blowing up buildings and assassinating rivals. To say this arc is exciting would be an understatement. The action is choreographed beautifully and the new Japanese urban setting that part of it takes place in adds a sense of realism previously not seen in the anime.\\n\\n\r\nBalalaika manages to affect change on a huge scale due to sheer force of will and her hunger for a new cause. A cause she hasn’t had since her time as a solider in Afghanistan during the Soviet invasion. Rock also comes into his in own this season, using business skills he is able to act as a diplomat to help diffuse the various power struggles that occur. Rock supresses his anxiety and eventually becomes apathetic towards the immorale decisions he ends up making. Revy continue to seize power through violence. But in Rock she sees something she doesn’t like about herself. This brings out a completely new dynamic between the two. The scenes in which these two protagonist’s reflect on their decisions seem far weighter than the previous season. I’d even go far as to say it makes the anime worth a repeat viewing.\\n\\n\r\nOriginal Review:\\n\r\nhttp://thatsterror.com/anime-review-black-lagoon/",
            "date": "2016-07-20T12:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 224494,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3974191.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ComicConReviews",
                "username": "ComicConReviews"
            },
            "url": "https://myanimelist.net/reviews.php?id=224494"
        },
        {
            "content": "Anime is very pleasing in many aspects. lovely art style and much more, But the main reason i made this is to point out how much of a bitch Rock really is. First of all Rock has no character progression what so ever and is a pussy lol. I was hoping after a year of them working together rock would be useful but i was definitely let down . To make matter worse Yukio Washimine who became head of the Washimine Group, in 2-3 days she was robbing banks and shooting guns AND shes like 17, Come on rock wtf are you doing -_-I cant Stress enough how fucking weak and useless he is lol, hes legit more useless than a 17 year old even tho he has a year in experience on her. In my opinion i really don't know why they made this anime revolve around him hes not exciting in any way shape or form hes just a letdown.",
            "date": "2016-05-26T15:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 219374,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5264971.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CrypticLife",
                "username": "CrypticLife"
            },
            "url": "https://myanimelist.net/reviews.php?id=219374"
        }
    ],
    [
        {
            "content": "I really liked the first season of Black Lagoon - it was the mature, gritty, animated version of an R-rated action thriller movie with an awesome female character in Revy. Overall, Black Lagoon Season 1 was really good but I felt had some pacing issues that sometimes made me nod off a little until the narrative and action picked back up again. Additionally, a couple of the stories in that season weren't as fun and energetic as others.\r\nHowever, all of that is addressed in The Second Barrage. It's everything a great sequel is: bigger, better, and more of it! One of the things I reallyenjoyed about this season is its clear focus on Revy and Rock. We also get to understand Revy and Rock on a more personal level as well as delving deeper into the motivations of characters from the first season like the icy Balalaika and some interesting newcomers.\\n\\n\r\nThe stories keep the action going at a nonstop pace and never overstay their welcome (an issue I felt happened sometimes in the first season) and you really want to see what happens next. This season really had a hold on me and I simply couldn't wait to see what the next episode brought. The only thing I could say is \"wrong\" with The Second Barrage is I felt it was a little too short at 12 episodes. Perhaps, 16 episodes would've been perfect but I'm okay with a show maintaining brevity and ending on a high note instead of endlessly dragging out with filler episodes (an all too common occurrence in anime). I really think you'll love this show!",
            "date": "2016-05-17T05:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 218753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5154373.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kawaii-keppan",
                "username": "kawaii-keppan"
            },
            "url": "https://myanimelist.net/reviews.php?id=218753"
        },
        {
            "content": "Note this is a review for both seasons one and 2 of Black Lagoon because in my eyes there is only one season of Black Lagoon as there is no continuously ongoing story only 3-4 episode arcs!\r\nCriteria \r\nStory: 7\r\nThere Really is no ‘solid story’ to Black Lagoon, as its basically separated into 3 episode arc each with their own ‘small story’ however there is no bigger picture, like small events that happen in each arc that are supposed to lead up to the final arc. Each arc completely differs from the other in terms of plot, scenes and story. If there was really any generalstory it would be about a man named ‘Rock’ who is one day taken for hostage/ransom whilst traveling aboard a boat. He then finds friendship among his kidnappers and joins them upon there many ‘adventures’\\n\\n\r\nEnding: 5\\n\r\nReally average ending seeing as it’s technically just an ending to arc, there was no build up, no mystery, no cliffhanger, it just ends\\n\\n\r\nSolid Plot: 8\\n\r\nThe plot is as solid a it gets seeing as they only have to worry about 3-4 episodes worth of plot/story.\\n\\n\r\nMoral: 5\\n\r\nThe only one I could make out of this anime was that no matter who you are or where you are you’re on a ‘side’ whether you’re for or against or on the sideline, life will be much easier for you once you realize whose side your on.\\n\\n\r\nSense: 5\\n\r\nThis anime makes ABSOLUTELY NO sense at all. For starters on one of the arc there is an enemy who is basically portrayed as the terminator and can neat die. For example in a room where she drops about 20 grenades from under her dress she so happens to walk out of the fiery building unscathed. For an anime that is based in the real world the laws of ‘death’ surely do not apply.\\n\\n\r\nMusic: 6\\n\r\nReally boring music didn't like it out of the whole 24 episodes the music did not change once. The intros and outros remained exactly the same. The music was also not complimentary to the mood of the scene as I couldn't even tell if there was some sort of sound track playing to amplify the mood.\\n\\n\r\nArt: 7\\n\r\nThe art was good to say the least. Nice art, nice drawing and at least not every main character looked the same. \\n\\n\r\nCharacters: 6\\n\r\nDon’t get me started on the characters because I really disliked them. Especially since there was basically no character development whatsoever; Rock is as much of a cry baby from day as he is until the last episode. A high-schooler has more balls than him.  Also Revy’s gun skills remain the same all the way till the last episode. There is no emotional development or physical development.  \\n\\n\r\nBoredom/Captivation Scale: 7\\n\r\nIf it was for the action scenes I would have left this anime a long, long, long time ago because it just didn't do it for me.\\n\\n\r\nPersonal Score: 5\\n\r\nIf you’re not into anime that only focus on 3-4 episode story lines and plots then I don’t recommend this anime, however if you are than this anime is perfect for you.\\n\r\nLastly I would not watch this anime again and I do not recommend it to those who like a good story/plot.\\n\r\nHowever if you are going to watch it the best Arc of all the 7 arcs is definitely episodes 13-15 (inclusive) ‘Vampire’ Arc and 16-18 (Inclusive) Assassins Arc\\n\\n\r\nGenres\\n\r\nAction: 8\\n\r\nGreat Action scenes, only thing that kept me watching.",
            "date": "2014-03-23T01:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 136547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2277829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OtakuLair",
                "username": "OtakuLair"
            },
            "url": "https://myanimelist.net/reviews.php?id=136547"
        },
        {
            "content": "yet again another disappointment and a waste of time\r\neverything works in a boring fashion\r\nthe plot, which never gives you enough space to develop, (money,drugs,corruption)\r\ni would be ok with that but the fact of the matter is, \r\nit just doesn't deliver\r\nwith the exception of Balalaika and Roberta, i found no other character worthy to keep my eye on as the events accumulated to a so-called climax\r\neveryone else is either weak to face his/her destiny, or continuously bitching about it, and of course our so loved main characters are kept away from harm as they witness the fall of their enemies portrayed in a sugar-coated false senseof tragedy\\n\r\nat some point i wanted to shout to the director (kill Revy if you dare, hell kill off anyone of your main staff, just make things more interesting for fuck's sake)\\n\r\nin the end it was time wasted\\n\\n\r\nthough someone pointed out that there's a continuation of the story in the form of 5 ova episodes\\n\\n\r\ni wonder...",
            "date": "2012-03-30T02:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 57357,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1216277.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ramimanify",
                "username": "ramimanify"
            },
            "url": "https://myanimelist.net/reviews.php?id=57357"
        },
        {
            "content": "So, I have finally figured out to wait before talking about a series. I then get a chance to think about the series critically, and I don't have to go back and change my review later. But onto the actual series. Black Lagoon Second Barrage sat in the middle between the amazing Robert's Blood Trail and the great first season.\r\nThe bad. This season did take one arc way too seriously, maybe it was the writer wanting to put too much Japan into a series that doesn't generally take place in the country. The arc did seem a bit forced but it wasn't horrible and itgave birth to a pretty bad ass character.\\n\\n\r\nThe good. Where as the final arc of this season took up half the freaking season,  the final arc wasn't bad and it did show how a normally calm and collected girl could turn to crime after becoming the head of a Yakuza family. The arc is interesting but would be better as an OVA. The other arcs however, I loved. I loved the murderous, cannibalistic, and incestuous twins that came in the first arc of this season, the amount that they were able to develop two characters that could be either male or female in only 3 episodes was actually a pretty great feat. The second arc was okay, it gave us more characters that we won't see developed for another year or two from now and one that we will probably never see again, but it did introduce Sawyer and develop Eda's character a bit more. That's another 3 episodes and then we have the Japan arc. Which pretty much took up half the series, at 5 out of 11 episodes this season.\\n\\n\r\nFinal Verdict:\\n\r\nIf you were a fan of the original series, then give this a watch, even though it pretty much just takes on a stereotypical Yakuza anime near the end, it was still a pretty good experience. Like the last one, this is one of the only anime where I really enjoyed the dub a whole lot more than the original.\\n\\n\r\n7.4/10",
            "date": "2014-03-26T00:38:00+00:00",
            "helpful_count": 0,
            "mal_id": 137039,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3016257.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/moonkingdomify",
                "username": "moonkingdomify"
            },
            "url": "https://myanimelist.net/reviews.php?id=137039"
        }
    ]
]