[
    [
        {
            "content": "\"Recently, My Younger Sister Is a Little Strange\" is what you get when people try too hard to make an ecchi show. First of all, why would you even make a show revolving around a high school girl wearing a chastity belt if the chastity belt has to be blatantly censored almost every time?\r\nThis is one of those shows that you know is going to be horrible right from the premise. An extremely generic and oblivious guy, Yuuya, gets a new sister, Mitsuki, after his father remarries. Mitsuki soon runs into a ghost, Hiyori, who has amnesia and can only remember that she loves Yuuya.In order for Hiyori to go to heaven, she has to get Mitsuki and Yuuya to fall in love (or at least have Mitsuki get turned on by him enough times to fill up the \"special\" meter in the chastity belt). I have no idea what bizarre religion only lets spirits into heaven after making step-siblings fall in love... To top it all off, Mitsuki can only \"open\" up the chastity belt for three minutes at a time every hour. Hiyori's final goal is for Mitsuki and Yuuya to have sex so that she can go to heaven..... considering the chastity belt only opens for three minutes, they better make it fast. So the premise is absolutely stupid and I only watched it for the laughs. The plot is actually hilariously bad at times, but most times it'll just leave you shaking your head at how dumb everything is.\\n\\n\r\nSpeaking of dumb, the characters are horrible and stupid on top of that. Yuuya is oblivious to everything, Mitsuki is your generic tsundere, and Hiyori just causes trouble every episode. The minor characters are completely forgettable and only help to cause friction between Mitsuki and Yuuya and be even more generic than the main characters. There's not much to say about the characters other than that.\\n\\n\r\nWell, except that the character designs are also terrible. The area in between the characters' foreheads and cheekbones is depressed so much it just looks strange, kind of like if they all slept with their heads on their hands when they were babies and caused a permanent skull deformation around their eyes. The backgrounds and the rest of the characters are cheaply designed, but the worst part is when it comes to the fanservice.\\n\\n\r\nThere are two things that are both problematic with this:\\n\\n\r\n1. The censorship is over-the-top as I already mentioned (and it's not just bright light covering things, it's a giant lock).\\n\r\n2. Those weird eroge-style text boxes whenever Hiyori sexually assaults Mitsuki off-screen. That is the worst part of the show. It seems like they just decided to throw in a little yuri fanservice, but then told the audience to just imagine it themselves like they were reading a book and not watching a show.\\n\r\nThe soundtrack is also boring and forgettable, and the opening and ending are typical j-pop songs for an ecchi show.\\n\\n\r\nMy recommendation is to not watch this show. The characters are generic and helpless, the animation is just bad especially for the character designs and fanservice, I have no idea why anyone would come up with such a bizarre story that defies any existing religious belief to create it's own stupid one, and it's really only enjoyable if you're going in expecting to laugh at it or if you really, really enjoy ecchi shows for the fanservice alone.",
            "date": "2014-03-22T13:42:00+00:00",
            "helpful_count": 81,
            "mal_id": 136471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=136471"
        },
        {
            "content": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga (or the shorter English title \"Recently, My Sister is Unusual\") follows the story of a young girl and an older boy who become step-siblings due to their parents marrying each other. The setup is pretty standard, but the catch is that the younger stepsister gets possessed by a ghost who's in love with the older brother, is forced to make moves on the brother to send her new poltergeist companion to the next life, and ends up falling in love with him in the process. Mysterious missing parents and ecchi, incesty hijinks involving a chastity belt thenensue.\\n\\n\r\nThe thing about this series is that it does not break any new ground whatsoever. The premise has potential, but the series never builds upon it, instead relying on tired tropes: dense/stupid main character (the brother), tsundere (the little sister), a childhood friend whose main features are her big breasts, a perverted best friend, an annoying ghost, a silent book-reading girl, etc., etc. It's all been done before. The aspect that could have been unique and set the series apart - the part about the ghost - is never fully explored. Instead, it's used simply as a device to make sure the \"fanservice quota\" for each episode is fulfilled. What results is a bland, tired, and frankly boring-to-watch incest fanservice show that is entirely forgettable.\\n\\n\r\nStory: 5/10\\n\r\nThe weak point of the series. All the plot points that get brought up along the way - why the ghost had to possess the sister, why the ghost loves the older brother, why the childhood friend came back and is hinted to be able to see the ghost, why the silent girl seems to know everything that's going on, etc. - are never really answered. This is second season baiting in its finest. Overall, nothing too interesting about the story.\\n\\n\r\nArt: 6/10\\n\r\nThe animation and character designs do their job. The characters look cute and appealing, the backgrounds are nice and detailed. It's not an action series, so there weren't any impressive feats either. The animation is simple but is sufficient in a fanservice show such as this.\\n\\n\r\nOne caveat, though: this is another one of those shows that censored its contents for the TV broadcast to bait gullible otaku into buying Blu-rays to see naughty bits, so keep that in mind. IF CENSORSHIP TURNS YOU OFF, THEN AVOID THIS SERIES ALTOGETHER unless you can get your hands on the Blu-ray version.\\n\\n\r\nSound: 7/10\\n\r\nThe music is the high point of this series. The OP and ED are both very catchy and memorable, especially the ED, which coupled with the trippy/WTF/LOL animation makes for a pretty enjoyable closing segment to each episode. The sad thing is it was probably better than the actual show itself.\\n\\n\r\nCharacter: 5/10\\n\r\nLike I said earlier, all of the characters follow archetypes and act according to tropes. Standard ecchi stuff: dense/clueless male MC protagonist, tsundere little sister who secretly likes her brother but abuses him because she doesn't accept that fact, the pervert best friend who wants to get into every girl's pants (even if they're a decade older), etc. Bland and forgettable characters that failed to leave an impression even after a fairly dramatic ending, especially since we were supposed to feel for the ghost near the end.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI'll admit the fanservice comedy got a few laughs out of me. Some episodes made me smile, mostly due to the characters' stupidity or the ludicrous plot. But mostly I watched this because I had time on my hands, but this show was not really something I looked forward to every week, in contrast to some of the other series that came out the same season.\\n\\n\r\nOverall: 6/10\\n\r\nIf you're looking for a mindless RomCom with incest undertones or an over-the-top and unnecessary fanservice series that allows you to turn off your brain and kill a few hours, then this series does fine. If you were hoping for a deeper story and good characters with fanservice only as cherry on top, then look elsewhere, because this is a completely standard, overdone ecchi anime that is a prime example of lazy fanservice-based series that seem to have burgeoned in numbers in recent years.\\n\\n\r\nOther anime similar to this series:\\n\r\nNAKAIMO - My Little Sister is Among Them\\n\r\nOreImo\\n\r\nListen to Me Girls, I Am Your Father!\\n\r\nInfinite Statos\\n\r\nDate a Live\\n\r\nHigh School DxD\\n\r\nDemon King Daimao",
            "date": "2014-03-22T21:46:00+00:00",
            "helpful_count": 56,
            "mal_id": 136521,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366694.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TCTriangle",
                "username": "TCTriangle"
            },
            "url": "https://myanimelist.net/reviews.php?id=136521"
        },
        {
            "content": "Recently this anime is sooooo unusual, why? co'z it simply doesn't amount to anything. Let's see, there is no story, its plot was sooooooooo lame, fanservice were poor, comedy was too corny, so overall this anime was just tooooo pathetic to say the least, now, I really don't dig as to why this story creator, Mari, Matsuzawa was thinking, but frankly she isn't doing a good job in anyways, and only her \"Inukami\" was the best thing she ever created. Also, I don't dig as to why studio \"Project No 9\" would ever think about making this into an anime when there are other mangasout there whose story line was far better than this one. Ok so lets get into this anime's character one by one:\\n\\n\r\n Mistuki Kanzaki- Her character being this man hating girl kinda conflicts the part where she hates men but seems to have reserve feelings for Yuuya. At one point I kinda pity her that she has to be this stupid ghost's, Hiyori, love juice bearer just for her to construct a stair way to heaven. However, what I hate about her is how much of a bitch she is towards Yuuya that he has to get a lotta bitch slap from her. Frankly, to be this anime's fanservice object was just too lame to say the least.\\n\\n\r\nYuuya Kanzaki- Pretty much your generic harem boy, as usual his character was very boring to say the least.\\n\\n\r\nHiyori Kotobuki - If this anime would have a antagonist then she fits right in, though she doesn't act like one, the fact that she was the one who put Mitsuki in such predicament qualifies her to be one, also her character was very annoying since her role was full of dichotomy where at one point she doesn't remember anything as to how she died and yet she was able to describe details of her dead. Also, her role was to be this ghost who was suppose to posse Mitsuki  and make lovey dovey with Yuuya so that the gauge in Mitsuki's chastity belt would be filled with love juice and yet she can achieve it by sexually pleasuring Mitsuki, what makes her qualify as an antagonist was that she more of a sexual predator rather than an loose soul.\\n\\n\r\nKiritani Yukina- Ok she suppose to complete this anime's harem genre, but unfortunately, her character was a disappointment as well. Let's face for someone who can see dead people, I really wonder why her role doesn't allow her to tell the male character or let alone help Mitsuki. The only consolation about her was her fanservice and that's as good as she gets.\\n\\n\r\nNeko - Another disappointing character, like Yukina she can also sense Hiyori's presences and just like the latter her character doesn't allow her to tell the male character and just be a fence sitter.\\n\\n\r\nSo with the main character's mentioned, it was difficult to say as to what author Mari, Matsuzawa was on about as to there roles which for me the character part of this anime can be classified as pathetic.\\n\\n\r\nSo, without further adieu and I've already state my case with this anime, here  are my ratings.\\n\\n\r\nStory- pathetic 1\\n\r\nSince, it was base on a weak plot.\\n\r\nArt - poor 3.\\n\r\nCo'z Mitsuki's fanservce sucks.\\n\r\nSound- Good 7.\\n\r\nThe rating is for the opening theme.\\n\r\nCharacter-pathetic 1.\\n\r\nNo need for me to mentioned.\\n\r\nEnjoyment - fair 6.\\n\r\nThat's for Yukina's hotness.\\n\r\nOverall - pathetic 1.\\n\r\nCo'z Mari, Matsuzawa's didn't do a good job on it and frankly there's no point of going through the manga co'z this anime alone has already given the spoiler as how it will end.\\n",
            "date": "2014-03-23T09:23:00+00:00",
            "helpful_count": 44,
            "mal_id": 136579,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2004376.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 1,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Baddie007",
                "username": "Baddie007"
            },
            "url": "https://myanimelist.net/reviews.php?id=136579"
        },
        {
            "content": "Incest is a very interesting genre in the world of anime.  For some reason, the japanese love the idea of forbidden love in their animations, attempting to twist the idea so they can still have said forbidden love so it abides by the law, kind of, with well-known titles like \"Oreimo\" and \"Onii-chan Dakedo\" taking the spot as the more well-known incest related animes.  Today I will be talking about one of the more recent introductions to the incest genre, Saikin, Imouto no Yousu ga Chotto Okashiinda ga, or, Recently, my little sister is unusual.  Let's begin.\r\nStory (6.45/10): The story of Saikinfollows the story of Mitsuki, a 15 year old girl, who gains a stepfather and a stepbrother named Yuuta as a result of her mom marrying another man.  It is from this point where Mitsuki hates her new life, and one day, when crossing a bridge, a ghost that goes by the name Hiyori tackles her and she blacks out.  After a whole set of circumstances, Mitsuki finds out that this ghost, Hiyori, is possessing her, and that she must fill this heart gauge that is on the chastity belt that she is required to wear, with various, lustful actions with her older brother, whom she hates, in order to satisfy Hiyori's final wish, (which is basically having sex with Yuuta), and move her on to heaven.  (You know, you would think that god or whoever's in charge would condone such sinful actions.  Oh well, it's anime after all.)\\n\\n\r\nNormally with incest animes, the story is a run of the mill one that would consist of 2 siblings, a brother an a sister, where the sister, (normally little sister), has an intense brother complex, and therefore would be in love with her brother, and it would stem off from there.  Saikin, as I like to refer to the show as, has a unique twist to this \"idea.\"  \\n\\n\r\nCompared to \"normal\" incest animes, the female loves the main male lead.  This is not the case.  The fact that I get to see a different approach in this genre, was enough for to see how this went, as Mitsuki seemed like a normal person, being unwilling to do something undecent, as well as having a moral compass, as well as an acurate interpretation to how a normal person would react to the situation.  As far as a base idea goes, the series gets a plus, seeing as how the normal format on how the plot was written, was somewhat different.\\n\\n\r\nIn terms of pacing, the series never really felt too rushed.  It had a rather decent pace that I could follow, and the series never felt overflowed with useless plot points and rushed areas of explanation.  (There was still a complete filler episode that I thought was completely unnecessary.)\\n\\n\r\nOn the other hand, we still get that sort of incestuous relationship that you would get with an anime like this.  (Bear in mind, these characters are siblings by name, not blood.)  As the series goes on, the development for the series started to become what you would normally see.  It was nice to see the characters develop a bit more, as Mitsuki started to be \"ok\" with having an older brother, but there were a few things that bothered me as the series went on.  One, they don't explain anything.  Saikin has an absurd amount of plot holes, ranging from little unexplained things, to an entire potential backstory being completely underminded, and even a whole character who's purpose I feel isn't completely explained.\\n\\n\r\nOverview\\n\r\n+  Different approach to the incest genre, (sort of)\\n\r\n+  Decent pacing\\n\r\n-   Unexplained plot points\\n\r\n-   Generic story development as series continued on\\n\r\n-   Side story and generic episodes (beach episode, hot springs, etc.)\\n\\n\r\nCharacters (5.78/10):  When it comes to characters, this series has a wide array of them, most of the falling into the supportive and basically non-existent role, all of which have varying degrees of development and actual characteristics.  \\n\\n\r\nFirst off is our main character, Mitsuki.  (At least I think so.)  Mitsuki, is a very interesting character.  Compared to what a normal female protagonist is in a romance anime, she doesn't really follow a standard troupe as one might think.  At the beginning of the series, she is shown to be quite an independent character, not needing really anyone in order to be around her or be with her, as well as developing a stand alone personality.  As the series goes on, she starts to learn more about this new brother that she has acquired, and starts to get closer to him with each passing episode, as little as it may be. (While also doing a bunch of things no real girl would ever do, or be caught doing.)  She is more or less the most interesting character in the series, and more or less carries the show with her stand alone personality and originality as a character.  Beyond that, it's downhill from here.\\n\\n\r\nYuuya, the main male is one of those guys you would want to punch in the face.  Like any main guy in a romance anime, the godforsaken density of his mind makes for the most absolute infuriating and completely pointless and redone characteristics ever.  (Seriously.  Why the hell would they NEED to make the main guy so fucking oblivious to everything?  It doesn't even make sense in a romance anime for the guy to not know there's a girl crushing on him, or something like that.)  Apart from his sheer density, Yuuya is more or less a caring sort of person, having concern for his new sister and being as nice of a person as he can be.  In my opinion, it was nice to see him as such a nice character, but his obliviousness was extremely facepalm worthy.  \\n\\n\r\nHiyori, as the aforementioned ghost in the series is a rather \"interesting\" character.  For starters, she died, painfully.  Because in her life, she loved Yuuya, she attempted to confess to him, only to be run over by a drunk truck driver, never to breathe or confess to her one true love ever again.  So, as the law of ghosts go, a spirit must be able to fulfill his or her last wish in order to move on to either heaven, or hell.  In this case, it's to have sexy time with the dense guy mentioned above.  Throughout the series, Hiyori is a mystery.  She is constantly being mentioned to have amnesia of her past life, as well as being able to be seen by random characters here an there.  Neither of these plot points, which would've added SO much to the story, are fully explained, and it made me mad, seeing as how they mention it, but forgot it in the series much later.  Most of the time, Hiyori is this fun little character who can get a bit annoying at time, urging on Mitsuki to do things, so that Hiyori can move on.  That's pretty much it.\\n\\n\r\nIn terms of supporting cast, we have what you would really expect in a show like this, one-noted and terrible character, aside from Yukina.  The supporting character really weren't that terrible, but didn't add much in terms of development of the plot and really were just fodder to explain that this show has more people than the ones of the cover art.  They're not fantastic, and mostly boring, (except Neko, who's purpose is a freaking mystery since she seems to have some sort of plot importance, which was never explained), and really are only just, there.\\n\\n\r\nOverview\\n\r\n+  Decent female lead\\n\r\n-   Another addition to the super dense male lead army\\n\r\n-   Completely pointless supporting cast that didn't add much of anything\\n\r\n-   relying heavily on the main lead for any sort of development\\n\r\n-   Completely unexplained character that was teased to have plot significance.  (i.e. Neko)\\n\\n\r\nArt and sound (6.98/10 and 4.78/10): In terms of art, the actual animation in fairly decent.  For one thing, the characters aren't overly moe and they have a very crisp looking design to them.  Personally, I like the look of these characters and the way they were designed.  \\n\\n\r\nA little segment I do whenever talking about an ecchi show is to actually talk about the ecchi, since it does sort of fall into the art category.  Saikin has an outstanding amount of ecchi, most of it coming from showing the chastity belt on Mitsuki, which is completely pointlessly covered up by an ornate heart-shaped censor bar compared to a normal black bar.  This is something that made me a little upset.  For starters, if you're going to make an ecchi show, you show the panties, like what most ecchi show does.  To put in the effort of censoring it with your own censor bar, which is probably wasted money due to the fact on how ornate it was, seems like a waste of time to me.  \\n\\n\r\nThe sound is completely generic and forgettable.  It's your average happy-go-lucky sound which you'll forget about within a month unless you're like me, and watched the series week after week for the new episode.\\n\\n\r\nOverview\\n\r\n+  Good character designs and artwork\\n\r\n-   Completely unneeded ornate censor bar\\n\r\n-   forgettable soundtrack that you probably won't bat an eye on\\n\\n\r\nPersonal Enjoyment (6.76/10): While for the most part, the show was terrible, I somehow enjoyed it way more than I should've.  Because the exposition was somewhat intriguing, I continued watching it and wanted to know if it went anywhere, if at all.  In the end, what I received at the end of this series, was an anime that more or less was what I expected, a generic mess that was somewhat different than what I had watched prior.  The show does have a redeeming feature with what I feel like is a better female protagonist, but the rest of it was as dead as Hiyori, being just this loop of never-ending formula of the same thing, that was less than satisfactory. \\n\\n\r\nA huge critique that I would give the show, is its lack of any real plot explanation.  Throughout the whole anime, it was focused solely on the idea of making Mitsuki orgasm from her brother, in order to build stairs of light up to heaven for Hiyori.  What made the show worse, was the addition of plot points and potential mysteries, that actually made me a bit more intrigued, as the story looked to be taking a different turn that actually seemed interesting.  But in the end, those plot points were completely disregarded, and tossed to the side, making me wonder how the show would've turned out if it followed a different path.  (i.e. both Mitsuki's and Yuuya's past, as well as how other people other than Mitsuki can see Hiyori)  \\n\\n\r\nAll in all, Saikin was a rather interesting take on the incest genre, which ultimately, failed to grasp any favorites from fans like its predecessors.  It had less than good writing, generic character, and a forgettable soundtrack.  Personally, I feel like this show isn't as bad as it seems, but it is still pretty terrible nonetheless.  If you're an ecchi fan, you might actually like this.  Other than that, I would highly suggest you stay away.  This really isn't a show for everyone, since it's mostly about boobs and a chastity belt that looks like it was bought from a pleasure place.\\n\\n\r\nOverall Score:  (6.40/10)  Seriously though, terrible plot explanation.",
            "date": "2014-03-22T20:33:00+00:00",
            "helpful_count": 25,
            "mal_id": 136515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136515"
        },
        {
            "content": "This anime, unlike many other ecchi anime, has a story line that is not difficult to follow. Although, people seem to complain about not knowing the answers to questions, although they are right in front of them. For example, if you would simply watch the ending theme all the way through, you would learn all you need to know about Hiyori's past.\r\nThe art was not hard to look at, but some scenes were just a little off in appearance and the way characters bodies were drawn.\r\nThe voices were easy to listen to and matched the characters very well. I especially enjoyed the difference in Mitsuki'svoice whenever Hiyori possessed her.\\n\\n\r\nThe character types are rather common, but that does not make them boring by any means. They are always lively and interesting.\\n\\n\r\nThis anime is a great combination of genres, and you will definitely enjoy its constant bursts of humor. Though I would mostly recommend this to ecchi fans, it's still incredibly funny and can be enjoyed by many more.\\n\\n\r\nOverall, this anime was a good watch, and I would gladly suggest it to all of my friends.",
            "date": "2015-07-11T09:06:00+00:00",
            "helpful_count": 10,
            "mal_id": 192988,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4735536.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShadowsweeperX",
                "username": "ShadowsweeperX"
            },
            "url": "https://myanimelist.net/reviews.php?id=192988"
        },
        {
            "content": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga comes in a season without any blow-me-away hypetrain anime to compete with, an as such many people may be considering whether to give it a go while they wait for the blockbuster mega-hype that is the spring 2014 season. Don't do it.\r\nStory: \r\nThe premise is neither particularly good nor particularly awful compared to other pieces in the ecchi genre; our dense protagonist gets a new sister, who is then possessed by a girl who claims to have known Yuuya before she passed away, and who is in love with him. If this leaves you at all curious,feel free to watch the pilot and judge it for yourself. \\n\\n\r\nWhat is particularly bad though, is the execution. Many anime have that one 'dissapointing' episode. you know the one. You're having fun, having a bit of a laugh, or there's some tense episode going on, and then BAM out of nowhere its a filler episode that leaves you wondering why they didn't just put it in an OVA and not break up the pacing. Saikin is full of these episodes. \\n\\n\r\nPlot threads begin, and then are soon dropped, characters have some confrontation or realisation, and then pursuing it is brushed aside in lieu of a pool/hot spring/beach episode. This may not put off the diehard ecchi fans though, and knocking a show like this for its story alone would be pretty ridiculous.\\n\\n\r\nCharacters:\\n\r\nMany anime take on too large a cast and then have trouble fleshing out the characters at all. Saikin has a relatively small cast, and still many of the characters say one type of thing the entire show. Shoutarou's involvment in the show consists of him being the pervy best friend (how original) and almost every single line (he has a few too) is something along the lines of \"that is/isn't what a real little sister is\". His actual sister is no better.\\n\\n\r\nMoa's only contribution is to go on and on about how shitty her brother is which, while not necessarily untrue, is incredibly unwarranted to the extent that it goes on. \\n\\n\r\nAnd then there's Neko. Is she a mastermind? God? An annoying stereotype? We will never know, but most of her time is spent wearing glasses, reading a book, and seeming to know more than the others think she does. What respectful character design. At this point I'm inclined to think that project 9 is just giving us a straight middle finger.\\n\\n\r\nThe 3/4 main characters (depending if you count Yukina) are mostly just blatant stereotypes. There isn't really a need to discuss the bad things about them, so I'll focus on the few small good things. There are a few somewhat genuine moments between Yuuya and Mitsuki which show a developing relationship (not the sexual kind), and Yuuya's ability to remain proactive in the way he goes about living with Mitsuki is if nothing respectable. Hiyori and Mitsuki have some amusing moments of back and forth and there personalities at least seem like an appropriate choice for this sort of anime. Again, where it all falls apart is execution.\\n\\n\r\nSound:\\n\r\nAs someone who has studied music all my life, the OP of this anime made me laugh. There are bad openings, there are good openings. That is just a matter of taste. But this is just lazy. OST is whatever, I don't feel like any music in this show is worth writing about.\\n\\n\r\nArt:\\n\r\nI reaaaaallly don't like the style here, but it is entirely a matter of preference. To me the characters seem wonky in a way, and I often thought that the artist was having trouble actually displaying emotions in the characters. \\n\\n\r\nThe one thing i can warn about though is censorship. Seeing as this show sells itself as ecchi, there is a lot of censorship. Giant clip art style blocks to prevent you seeing panties, cutting out implied yuri scenes while describing them in text boxes (wtf?), this certainyl isn't DxD.\\n\\n\r\nConclusion:\\n\r\nThis show is a failure not because it is an ecchi, not because the story is boring, not because the characters are bland and not because the art and music leave something to be desired. It is a failure because it can't execute anything properly. Is it an ecchi? If so then why does it cut almost all ecchi moments out after the first few episodes? Is it a rom com? If so then why is there so little meaningful character development, and why does this seem secondary to going to the pool or whatever other typical thing can be put in there?\\n\\n\r\nIf you are a diehard ecchi fan, who is a complete siscon, then maybe you should watch this show. if you are interested in the genre, then go watch Oreimo if you hate ecchi or KissXsis if you don't. There are simply better series out there if this is what you wan't.\\n\\n\r\nI hope i can save at least a few people a little time.\\n",
            "date": "2014-03-24T03:24:00+00:00",
            "helpful_count": 9,
            "mal_id": 136699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2735103.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dalvoid",
                "username": "Dalvoid"
            },
            "url": "https://myanimelist.net/reviews.php?id=136699"
        },
        {
            "content": "Okay, plain and simple this show is bad, i myself have no clue why i stuck through the entire thing. I think i was waiting for something good to happen ;) but nope nothing. The Art is one of the worst I've seen, it looks like a \"I made it in 5 minutes\" type of art and it also seemed like the least amount of effort was put into the MC herself. The story is utterly pathetic, there is no real story and i feel that the main character should not have been the little sister. Imagine if \"My little sister can't be this cute\"was made through Kirino's (BASED KIRINO) eye's, wouldn't have been to appealing now would it. I assume that the story was supposed to funny at some points but the jokes weren't funny. \\n\r\nIn terms of character development some may argue that MIsuki (the MC) under went some character development because she can take to her Oni-chan easier. However there is no real character development here because even though her life is literally on the line she refuses to do anything about it and hits the brother (don't know his name because he's not important) even though she caused the incident to happen. With Misuki being the main character this show was not enjoyable.  \\n\r\nSound...(I'm a tough critic on this one)... the music sounds like they only had a week deadline and had to do whatever they could. The outside noises did not match the actions depicted and several times made me wonder if the audio was a second late. \\n\r\nOverall I'm very disappointed, and having liked watching OreImo i had high hopes for this show but the show did not deliver.",
            "date": "2014-03-29T20:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 137823,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3393157.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/9tehk1ll3r",
                "username": "9tehk1ll3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=137823"
        },
        {
            "content": "Before I get to the structured part of this review, there is one major gripe about this anime I have to get off my chest. It is best captured by a classic line from Shakespeare, namely \"This above all, to thine own self be true.\" \r\nThat may sound a bit dramatic when reviewing an anime with a strong ecchi element, but that is exactly the point: this show did not *need* to be an echhi. Nor did it need the \"imouto\" element, since the writer did not seem to be all that interested in wiriting about a brother-sister relationship. (In fact, the only real brotherand sister characters in this show constantly bitch about each other. Which is okay, but seems more like the kind of thing you'd expect in a show that makes fun of the imouto genre). The writer simply should have told the story she wanted to write about characters she felt were interesting and worth developing. And based on the strength of that, she should have tried to sell the idea for a manga and then an anime. So no fake \"imouto\" tag and no ecchi that gets covered up all the time anyway. Then the writer would have been true to herself.\\n\\n\r\nStory 3/10\\n\r\nThe story basically revolves around a high school girl, 15-year old Mitsuki, who is very depressed due to her mother's many relationship problems get pounced upon by a horny ghost who wants to force her into having sexual intercourse with her stepbrother (the result of a hopefully more fortuitous relationship choice of her mother's). The horny ghost in question, Hiyori, is completely self-centered and shows very little mercy to Mitsuki, who is completely miserable throughout all the trials that Hiyori puts her through. Needless to say, witnessing an already depressed teenage girl get sexually mangled is not something most people will enjoy. I certainly didn't. To make matters worse, there are at least two instances in the show where Mitsuki seems dangerously close to taking her own life to escape all this misery. Quite shocking, I felt. \\n\\n\r\nThere really isn't much else to the story, really.Aside from some even more disturbing bits, that is. For some reason, Mitsuki is forced to wear some sort of magical chastity belt that only opens for 3 minutes every hour, so that she is often in a lot of discomfort as she tries to avoid soiling herself while the thing is closed. And if all that wasn't enough, Hiyori regularly sexually assaults her, perhaps for good measure? (And the writer who came up with all this sickness actually is a *woman*, or so I understand...)\\n\\n\r\nArt\\n\r\nThe animators involved obviously weren't very happy to be working on this \"project\", since the character drawings are very rudimentary. Compared to this, one of the earliest \"Detective Conan\" episodes from 1996 looks like a veritable height of anime quality. \\n\\n\r\nSound 7/10\\n\r\nNothing much to complain of, although the opening theme is fairly generic. The voice acting is generally good, with the newcomer who voices Mitsuki infusing her voice with all the pain and humiliation that anyone in that situation would more or less feel. \\n\r\nIt's a curious point that the rapist-ghost Hiyori is voiced by the same actress who voiced Tsutsuskashi Tsukiko on the much friendlier \"The Hentai Prince and the Stony Cat\", since Tsukiko was such a strong girl who always made clear that she would not stand for any sexual advances outside of an actual relationship. To go from portraying Tsukiko to portraying a female rapist is quite a leap...\\n\\n\r\nCharacter 3/10\\n\r\nThis is what brings me back to my opening statement about the writer needing to be true to herself, because there are some definite glimmers of interesting characters here. Mitsuki is far from your standard anime imouto and even unusual in her alsmost consistently (although justifiably) depressed mood. \\n\\n\r\nHer stepbrother Yuuka (or Yuuna?) is an extremely goody-two-shoes type of guy, who is always gallant and understanding throughout all the hijinks that he has to witness when Hiyori is possessing Mitsuki. Given the strength of Hiyori's fascination with him, it's a real pity that his exact backstory with whoever Hiyori was when she was still alive is not revealed. But it's probably safe to say that he behaved very polite, friendly and gentlemanly to whoever she was. \\n\\n\r\nHorny ghost Hiyori is the unequivocal villain of this series, even if she does not seem to think so herself. Mitsuki would have been well within her rights to have some sort of exorcism performed that would have sent this monster straight to hell. \\n\\n\r\nRecently moved in next door childhood friend Yuki is almost as saintly and boring as Yuuka. Her having been a tomboy who was always being rough with Yuuka is an interesting idea, especially since she grew into such a large-breasted young woman who tried so hard to be the stereotypical gentle female. It feels like there could have been an interesting story here, and there are some small hints in the final episode about why Yuuna and she act towards each other the way they do. \\n\\n\r\nThen there is the mysterious mousy bookworm Yukina, with the emotionless voice that we have come to expect from such characters. There are some curious hints towards the end that she may in some way be behind all that has happened, but her reasons and goals never really become clear. She probably represents the writer herself. \\n\\n\r\nThere are no real other characters to speak of. There's an alcoholic aunt who lives with Mitsuki and Yuuna, but she hardly ever seems to be around. And then there are the only real brother and sister in this series who always get in each other's hair. \\n\\n\r\nEnjoyment 1/10\\n\r\nThe misery inflicted on Mitsuki was not something I enjoyed watching. It's almost as if the animators made her look as depressed as possible to continually underline how sick this aspect of the show is, perhaps as a silent protest. To make matters worse, Mitsuki's ordeals do not seem to have served any purpose. Seeing some potentially interesting characters not get much meaningful development was not enjoyable either. \\n\\n\r\nOverall 3/10\\n\r\nI really wanted all these strange people (even the alcoholic aunt) somehow overcome their problems and grow as a result of their experiences. (Apart from Hiyori, that is, she simply needed to burn in hell for her crimes!). But in the end, nobody really seemed to have made much progress.",
            "date": "2014-03-23T14:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 136627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2655401.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Eminem2",
                "username": "Eminem2"
            },
            "url": "https://myanimelist.net/reviews.php?id=136627"
        },
        {
            "content": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga, a typical, shitty romcom with the usual 'shy girl'. What to expect from this? Nothing, but pure fanservice and a shitty storyline. (Also, a horny ghost)\r\nStory: 1/10\r\nStory, yes there is a story, but it was horribly told. They focused more on the fanservice part, rather than the story. It was just about a shy girl (Mistuki) who was forced to love his step-brother(Yuuya) by a ghost (Hiyori). To sum it all up, Mitsuki just needs to fill out the chastity belt in order for the ghost to pass on. Yes, that's all there is to the story.\r\nArt:6/10\\n\\n\r\nThe background was alright(Didn't really matter to me). The character designs were actually good, especially with the tsundere expressions of Hiyori.\\n\\n\r\nSound: 7/10\\n\\n\r\nSounds were good, especially with the OP and ED, while the background music didn't really bothered me.\\n\\n\r\nCharacter: 5/10\\n\\n\r\nCharacters were not that bad, but also not that good. Some characters were not explained thoroughly. There are a few characters which had some development, like Mitsuki who became more interactive to Yuuya, as the anime progressed.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\nYes, despite the fact that the story was horrible, it was still enjoyable, especially with Mitsuki's clumsiness and the fanservice (If you know what I mean).\\n\\n\r\nOverall: 4/10\\n\\n\r\nAll in all, I could say that ImoCho could be a lot better, especially with the manga being active and all. If you're looking for a romcom with a lot of pure fanservice and has a typical shitty story, then this would be good for you.",
            "date": "2014-03-28T06:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 137467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3302691.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Happy24",
                "username": "Happy24"
            },
            "url": "https://myanimelist.net/reviews.php?id=137467"
        },
        {
            "content": "What a terrible piece of crap. Somehow they turned a show that could have been a hilarious, cute, silly show about a \"forbidden\" relationship into a total joke of a show. This could have just been Oreimo with a supernatural element, and a little more lewdness, and it would've been fine. Instead it felt like the staff didn't know what kind of show they were making, a supernatural-comedy-ecchi-incest-SoL, or a heartfelt-coming of age-incest-SoL. They failed on both accounts. Maybe it was the staffs fault, maybe the source material was already garbage and they didn't have much to work with, or maybe it's Japan's decency law'sfault. \\n\\n\r\nThe characters are all hot garbage. Mitsuki, the main character, is a total pain in the ass from the moment you meet her. She has a terrible attitude, terrible people skills, and shows zero signs of improvement throughout the series. Her brother Yuya is no better. He's your typical male lead in a romance SoL that isn't a shoujo. Oblivious to everything that goes on around him, always jumping to the wrong and most absurd conclusions. You would think, with a step-sister that constantly treats him like garbage, he'd eventually lose his temper and yell it her, and maybe make her grow in the process. But nope. Mitsuki could probably murder everyone he knows and loves and he'd just sit back and wonder why she's feeling sad. \\n\\n\r\nThey other characters are just as terrible. Neko, a Nagato Yuki knock-off, is some sort of supernatural thing. It's never explained who or what she really is, we're just supposed to accept that she's friends with the main characters and is a little odd. Torii, Yuya's best friend, is your typical best friend in an ecchi anime. He's an uber perv that wants to have sex with anything that has two holes. They didn't waste any time on him. Yukina, Yuya's childhood friend and obvious romantic interest, is another of your cook-cutter characters. Boy has a childhood friend that's a girl but comes off as very boyish. Eventually one of them moves, then one day they are reunited and she's suddenly very feminine, with a large chest and curvy body. And apparently she can see ghosts, for some reason. It's never explained, like pretty much everything else in this show. \\n\\n\r\nThen there is literally the worst character in an anime, Hiyori. She's the ghost that causes all the trouble in the show. She's apparently a girl who was killed when she was hit by truck-kun (literally the only good thing about this show is seeing her get hit by the truck in the ED). She remembers nothing about her life, only that she loves Yuya. She wants to go to heaven, but can't. For some reason you can't go to heaven in this world unless you have sex with your love. Literally nothing about her is explained in the show. There's one scene where Yuya tells Mitsuki (who is possessed by Hiyori at the time) that him and Yukina would go to another kids house, and that kid would call him Yuya-Oni-Chan. Hiyori seems to think it's her, but most viewers probably picked up by that point that they didn't know each other when she was alive. The ED makes it pretty clear she's your typical horny girl character that stalks the male character, only she dies in the process. She has no redeeming qualities. She literally steals and ruins a young girls life and forces her to commit incest just so she can go to heaven. Oh, and if Mitsuki doesn't oblige, she'll die and they'll both go to hell. She constantly rapes Mistuki to fill her love gauge that builds steps toward heavens gate, and even tries to use Mitsuki's body to rape Yuya. She's a terrible character. \\n\\n\r\nThe show overall is a mess. It starts off very lewd, and the viewer may think they're just watching some hard ecchi/borderline hentai show, something they could just turn their brain off to and enjoy. Then it quickly starts trying to be a heartwarming, emotional show about family, love, and life. It fails at that, too. The show has no advancement in plot. Hiyori keeps insisting that having sex with Yuya is the only way this thing will end, yet that never happens and the love gauge fills. Eventually Hiyori goes through the gate and you, the viewer, believe that this hell is over. Then she comes back. Did you think you were free, Mitsuki? Nope! There's another floor that needs to be completed. Clearly the staff thought this anime would be popular enough to warrant a second season, and didn't feel any need to conclude the show. \\n\\n\r\nThis a truly awful show. No one should watch this show. Anyone that does and likes it should not be trusted. Save yourselves and watch something else.",
            "date": "2015-07-31T17:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 194843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3724853.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/smokeyjoey8",
                "username": "smokeyjoey8"
            },
            "url": "https://myanimelist.net/reviews.php?id=194843"
        },
        {
            "content": "Art style was great 90% of the time, although Mitsuki's face was a little off on the edges in some scenes.\r\nStory was barely there, as it was an excuse to throw in some more ecchi, although it was the only reason for her actions.\r\nSounds only get a 5 from me, as her voice was sometimes that generic high pitch. Although her normal talking voice was not. That was good.\r\nHiyori was probably one of the characters they needed to explore most, but never did. Mitsuki and her brother are pretty generic, but hey! Still nice. They only got a 6 for that reason. Otherwise, most oftheme are just fine.\\n\\n\r\nOverall it is a 7. It's not too good, not too bad. I would recommend it to ecchi fans, but remember! It's not borderline hentai, you can't use this as hentai. Don't come into this expecting that. It's a bit much sometimes, though.",
            "date": "2015-05-22T15:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 188563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/tyone123",
                "username": "tyone123"
            },
            "url": "https://myanimelist.net/reviews.php?id=188563"
        },
        {
            "content": "When i started this show i was pleasantly surprised, because my expectations were extremely low.  The first few episodes were really lewd, pretty funny, and the \"gimmick\" seemed like it could provide with some material to craft gags and possibly even *gasp* a story around.  To put it simply, ImoCho is a really good terrible show.\r\nBecause it's bad, when you measure it objectively.  It's just a succession of tropes and vapid unoriginal drama.  However, it is a show without pretension.  It knows it's terrible, it's not trying to be artsy or anything, it's just how it is.  And that'srefreshing when you compare it to LN adaptation trash that's just as bad as this but has the gall to try to \"pretend\" like it's good.  \\n\\n\r\nSo what makes this bad show entertaining?  Well for starters the lewd parts are well-animated and unrestrained.  You won't have to settle for shitty panty shots here; you may even get slightly turned on here and there.  There's also a good amount of laughs to be had, mainly driven by Hiyori, the only good character in the series.  She's very cute!  The soundtrack is outstanding; it really drives the humor.  It too is without pretension, and sounds like it's been generated in a day or two with cheap midi samples, but it fulfills its purpose to perfection.  The \"drama\" is completely retarded, so you can watch it ironically and find some enjoyment there too.\\n\\n\r\nThe biggest issue with this series is that it runs out of steam half way through.  The sexy scenes become rarer and rarer, and the \"drama\" takes more space over the humor.  Enjoyment drops like a stone and the ending is, as you would expect, a complete turd (i think i predicted the last 10 minutes perfectly).  \\n\\n\r\nNot recommended unless you are extremely bored and your backlog has nothing in it.",
            "date": "2017-02-15T22:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 240680,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/summitsama",
                "username": "summitsama"
            },
            "url": "https://myanimelist.net/reviews.php?id=240680"
        },
        {
            "content": "First of lets say if there is not gonna be a second season the score wont be as high. This review doesn't have any spoilers.\r\noverall I think this story is very good, but there are some problems I have with this show. 1) they've never showed the back story or the memories of hiyori. 2) didn't have a proper conclusion to any of yuuya's relationships with any characters.\r\nThe art of this show is really good it reminds me of Boku wa Tomodachi ga Sukunai.\r\nthe sound also amazing!!! I really love the most of the songs: the opening, the ending, and some song they use duringthe show!!! the voice acting is as good as the sound; they suit the characters.\\n\\n\r\nthe character are lovable and rememberable (if that's even a word :P) and attachable, as they would make u feel happy, sad, or angry.\\n\\n\r\nAll of this adds up to give u the most enjoyment you will ever have watching this anime!!! I say this anime is worth the time!!!! :D",
            "date": "2014-04-16T23:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 140253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/quentin464",
                "username": "quentin464"
            },
            "url": "https://myanimelist.net/reviews.php?id=140253"
        },
        {
            "content": "I just finished the current season of Saikin, (Recently, My Little Sister is Unusual) *THIS MAY CONTAIN SPOILERS*\r\nHere's my review\r\nA romance comedy, a girl named Mitsuki Kanzaki lives with her step-brother Yuuya after her mother remarries. One day, Mitsuki (Yes she looks like Ruri! But I wish she had her personality) is possessed by the self-proclaimed spirit of a young girl, Hiyori Kotobuki. Hiyori (in Mitsuki's body) must fall in love with Yuuya to move toward the \"Gates of Heaven\" or rather, Hiyori is hoping to have relations with yuuya through Satsukis body. Attached to Hiyoris spirit possessing her, is a chastity belt, that hasa gauge that feels up every time Hiyori is more and more satisfied emotionally or something, which is always on Mitsukis body instead of normal underwear and for some reason never puts normal underwear underneath even though she complains somebody might see it, everything is pretty much exposed because of it if her tiny skirt just so happened to lift up. If the chastity belts Gauge stays still and does not get what the gauge needs to fill, Mitsuki will die as well. (Poor Mitsuki right?)\\n\r\nAnywho, the fan service in this anime is well over 9000, many moments when you see skirts lift up and/or have times where Mitsuki gets sexually harrassed by Hiyori, even so it's a decent anime with some good humor, a nice plot and the characters are alright. Take away Yuuya getting slapped 200 times for being in the wrong place at the wrong time, or just being brought into an awkward situation by force (Just like almost every Anime) and it's a great series, Yuuya is a cool character, acts like a good brother towards his new step-sister even though he's always been alone, he tries to help her as much as he can if she's feeling down or feels she needs to talk about something, he's a good guy. Mitsuki is pretty moody at times, kind of a tsundere I guess but not as bad, but she's cute and has her nice side as well and you feel for her as you watch the series for what she has to go through. Hiyori on the other hand is bubbly, fun and charismatic and all she wants to do is get into Yuuyas pants, if she wasn't a spirit I'm sure she would just jump him and rape the guy.\\n\r\nThat being said it was a pretty good story, will probably watch a second season if it had one. It had some pretty damn funny moments in it as well.\\n\r\nRecommended for those who like fan service, comedy, romance, splice of life, etc.\\n\r\n7.5/10 for me.",
            "date": "2014-03-27T20:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 137365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1384699.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/burnsanimal",
                "username": "burnsanimal"
            },
            "url": "https://myanimelist.net/reviews.php?id=137365"
        },
        {
            "content": "Ok, weird anime is weird.\r\nThat´s pretty much all I can say about \"Saikin, Imouto no Yousu ga Chotto Okashinda ga\".\r\nI mean, look at the plot: A girl is obligated to wear a chastity belt until she can seduce her older brother (of course, not blood related) and send her ghost friend to heaven.\r\nIt´s pretty stupid, but I always give a try to stupid looking anime, because they might actually make me laugh. And this anime...made me laugh, at least a bit.\r\nStory: 6\r\nLook, even though there seems to be a story, most of the anime is just fanservice, scenes where it looks like I´m watching avery softcore hentai. There´s almost no development during it´s entirety, which is usual in these kinds of adaptations. Sometimes, I really didn´t know what I was watching, and I felt like rage quiting the episode right then and there. Still, sometimes it was actually fun. Sometimes.\\n\\n\r\nArt:5\\n\r\nEven though \"5\" means \"mediocre\" on MAL, the art of this anime is basically what the anime itself is, average. It looks like the art-style I´ve seen in so many other anime that sometimes I wonder if they´re all set in the same world or something. Not even bringing in the characters, that look like super generic characters. Sigh...\\n\\n\r\nSound:6\\n\r\nWhat can I really say about the sound? It wasn´t bad. \\n\r\nI have the habit of always listening to the OP and ED in each episode, so I eventually get them in my head, but I can say they weren´t bad. They were catchy and that´s what matters.\\n\\n\r\nCharacter:6\\n\r\nEven though this is a 6, the characters were really generic, as in they fit in all the existent character tropes, and they look like (yet again) characters taken from other generic anime series.\\n\r\nFirst, we have the \"Bland and Generic Male Protagonist That Lacks Balls\", if you really like this type of character, you can find him in about 90% of light novels.\\n\r\nThen, we have the \"Main Female Protagonist Who Faints Ignorance Of (Not Blood Related) Older Brother, But In Reality Is Just Being A Tsundere And Actually Wants His D\". The name says it all.\\n\r\nBesides them, we have other generic characters, like: \"Big Boobied Nee-san Type Childhood Friend That Also Wants Generic Male Protagonist´s D\", the ever lovable \"Deadpan Girl That Knows A Lot More That What She Leads On\", \"The Happy-Go-Lucky And Stupidly Perverted Best Friend\", and of course \"The Perverted Girl That Likes To Sexually Molest Other Girls\"...\\n\r\nYeah, all lovable characters, that we *really* love so much!!\\n\\n\r\nEnjoyment:6\\n\r\nSurprisingly, I actually enjoyed watching this, even though it was bland and generic, it wasn´t bad.\\n\\n\r\nOverall:6\\n\r\nI think that this series was just weird overall, and I seriously tell you to think twice before watching it. If you like ecchi that tries to be over-the-top but fails, then this is the anime for you. If you actually want to watch anime that has over-the-top ecchi then how about watching \"Shinmai Maou No Testament\" or \"KissXSis\".\\n\r\nOh well...\\n\r\nJust have that in mind.\\n\\n",
            "date": "2016-09-13T04:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 228951,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5251804.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AndriushaRi",
                "username": "AndriushaRi"
            },
            "url": "https://myanimelist.net/reviews.php?id=228951"
        },
        {
            "content": "I think I might've gotten cancer from watching this godawful anime. Lord have mercy... Am I going through a masochistic phase of some sort, as I have also watched School Days two weeks prior...? And that one already annoyed me to no end (altough the ending was pretty great lmaooo)\r\nBut THIS...\r\nOkay first of all, why are the Japanese so obsessed with portraying these sexualized brother/sister relationships - but they're almost NEVER even related by blood?? I mean sure, they're trying to make it ok, or, you know...make it seem like more of a coincidence than a weird fetish. But they do this every time andthat's my problem. I have seen this countless times and I'm sick of it.\\n\\n\r\nLook I'm really not into incest. But by making romantically involved characters actually blood-related (Game of Thrones is a good example) it would at least cause some drama that I'd actually be interested in watching. This step sibling formula is so overused that it's just beyond belief by now.\\n\\n\r\nSPOILERS AHEAD\\n\\n\r\nHere's all you need to know:\\n\r\nSo there's this one girl named Mitsuki, who suddenly got herself an older 'brother' called Yuuya. Then there's this other girl which I'm just gonna call Ghost-chan. Ghost-chan died without confessing her love to Yuuya, which is why she cannot rest in peace. And so she haunts Mitsuki, makes her wear a ~magical chastity belt for some fucking reason and also casually has sex with Mitsuki every now and then to like...idek...charge the belt with...the power of yuri- I mean...satisfaction (?) I HAVE NO IDEA. But ofc it's not enough as long as Ghost-chan (who will possess Mitsuki's body whenever she pleases) doesn't get/sleep with her crush Yuuya. Yep. That'll definitely be my biggest worry too, once I die.\\n\\n\r\nThe characters aren't just immature and super easily turned on by random shit, nah, they're also downright stupid. They have such unbelievably dumb moments sometimes, which is shown through the conclusions they draw for themselves and I just...wanted to cry every time.\\n\\n\r\nI felt really sorry for Mitsuki though, and I hate the anime even more for how her situation is handled. She's embarassing herself multiple times; She falls on her face for no reason at least two times per episode, she is kinda raped by a ghost a few times and that fucking belt even physically hurts her at some point. But yeah OF COURSE she starts developing feelings for Yuuya herself. Mhm, that's how I like my anime girls best: Totally degraded -.- And I know this is Ecchi, but please...just don't do it like this. Mitsuki clearly isn't having fun most of the time, and I definitely didn't have fun seeing her like this.\\n\\n\r\nBut why didn't I rate this bullshit even lower?\\n\r\nBecause, the art is okay I guess - as well as the sound, also very few lines were actually funny. The show even made me snort out of sheer disbelief 2-3 times, like when they referred to the Reaction Guys meme :'D But that's about it. The ending is also super bad and makes no sense, just like the whole thing. I'll never watch it ever again.\\n\\n\r\n(A lil' bit of trivia: There's a live action movie which is actual porn. I'm not the least bit surprised.)",
            "date": "2018-01-02T13:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 267212,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/175367.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lawli-Pop",
                "username": "Lawli-Pop"
            },
            "url": "https://myanimelist.net/reviews.php?id=267212"
        },
        {
            "content": "This show honestly tries too have the cake and eat it too and it kind of ruin a part of the main show. \r\nRecently My sister is Unusual isn't a bad show. Their is certainly worse. But with a mixture of elements done badly it just kind of leaves the show in an awkward state. \r\nThis show is very much Echi but at the same time it censors itself. It has stuff like shots of the MC's chastity belt but it censors it. It will censor the most random stuff at times too. I don't know why if they aren't o'k with showing sexual scenesthen why would they even put them in the show. They either should have gone full on Echi/Hentai or just not put them in the show at all.\\n\\n\r\nThe Ghost chick ( Hiyori) Is kind of an awful character for the most part of the show. I still enjoyed parts of her. But she can just be so insensitive.  Hiyori Doesn't even seem to care that she has basically made Mitsuki into a hostage. If Mitsuki doesn't help her she will die because of Hiyori and she doesn't even seem to care as much. Hiyori also has gone about and ruined Mitsuki's life. It just kind of annoying and makes me dislike her.\\n\\n\r\nMitsuki had a calm and alright life. But Hiyori came in and has put Mitsuki into embarrassing situations such as make Mitsuki Wet herself and having too Pee into a flower vase. It is just annoying. \\n\\n\r\nYuuya also tends to just be annoying as can be. He is so oblivious and dense it's annoying.  He tends to always force Mitsuki to other places cause he thinks something is wrong even when she saids she is alright.\\n\\n\r\nI honestly think this show would have been a better show. If instead of Hiyori wanting to get with Mitsuki brother she wanted to get with another chick. So instead of having Mitsuki want to date with her brother she starts getting emotions for a different girl in the show. So instead of MitsukixYuuya it would be someone like MitsukixYukina.\\n\\n\r\nI would honestly love to see MitsukixYukina a lot. I don't like the brother. Hell i wouldn't mind instead of her getting a Brother she gets Yukina as her sister. Yukina is an awesome character that i feel would be better fit for Mitsuki. \\n\\n\r\nOverall it's an alright show that could have been better.",
            "date": "2017-12-06T20:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 264676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264676"
        },
        {
            "content": "I gave Recently, My Sister is Unusual a watch in search of outrageous, original ecchi lulz. In this I was sorely disappointed, not least by the lack of more frequently inventive use of the show's premise to create entertaining and memorable scenes.\r\nThat's not to say it was a terrible show. It cut a light-hearted dash among the rest of my queue for this season, which involved a mixture of drama, intensity, violence and plot-twisting, whereas Recently, My Sister is 90% warmly predictable high-school bread and butter, and 10% risqué scenes that range from mild to fantastic, though unfortunately the latter was pretty darn rare. Ican see why some liked the characters, but for the amount of time we're spending watching them interacting each episode, I honestly think they could be far better. \\n\\n\r\nThe basic premise is outlined in the first episode, and from there on it's a pretty slow procession of largely trivial events played out by a very white-bread, boring male character (Yuuya), his cutely tsundere little sister (Mitsuki) and her uncontrollable ghost (Hiyori), plus four or five other characters who are even more forgettable, including Yuuya's buddy, whose provision of the typical perverted idiot-buddy role fostered two or three chuckles across six hours of content. Really, we're definitely not talking anything above average here in my opinion even by slice of life moeblob standards, and when it comes to the 'plot', if I were to be brutally honest, it's an entire season of pretty mild filler without any real qualities compared to other anime of the genre. Additionally, the visuals and soundtrack are really quite unimpressive as can be expected from much high-school anime.\\n\\n\r\nThe problem for me is that because of how boring and conventional the dynamics and characters were, I placed my hopes for the show in bold, quasi-incestuous ecchi entertainment. It's really unfortunate that most of what you get in Recently, My Sister is simply tame and done to death, consisting of tropes you can find in hundreds of other anime: Falling over in awkward positions, blushes, accidental boob-touching, pantyshots (in this case chastity-belt shots) and off-screen slaps to the cheek alongside screams. There are four or five scenes which step out of this pretty dreary routine (including the brilliant 'Metal Gear Yuuya'), but unfortunately they're too few to really make a difference and bump it up to 'upper average' for me when compared with other shows. While this one had the potential to be a total blast like Noucome, it ended up just being too mild, reserved and conventional to really achieve anything.\\n\\n\r\n3/10",
            "date": "2015-03-26T05:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 183446,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3829377.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Renegatz",
                "username": "Renegatz"
            },
            "url": "https://myanimelist.net/reviews.php?id=183446"
        },
        {
            "content": "\"Little sisters are difficult.\" - Kanzaki Yuuya.\r\nCouldn't agree more with that.\r\nStory : 8\r\nKanzaki Mitsuki is our female heroine; she's shy and cute. Her mom and Kanzaki Yuuya's father re-married. Having both their parents re-marry is obviously an awkward situation. Not to mention they're forced to live in one roof now, by themselves at that. 'Course they'd look strangers in both of their eyes. Saikin's plot is kinda original for me; it's refreshing. But the re-marrying stuff is kinda overused already. Beware on the ecchiness it contains. It does have censoring, though. Black random things devouring half of your screen, moving keyholes within Mitzuki's body. Bewarned: DO NOT WATCH IT IN PUBLIC(I needed to caps it). Back on the plot; Mitzuki discovers a lost soul bound to Earth because of her love for Kanzaki Yuuya, our male MC. Kotobuki Hiyori is the ghost girl who needs to get lovey-dovey with Yuuya to be able to cross the stairs to Heaven. Mitzuki gets caught up and will have no choice but to go with the flow.\\n\\n\\n\r\nArt : 7\\n\r\nSaikin's art is fairly good. Faces with sharp edges are done to make characters look cute, which is not bad at all. Everyone has big-puppy eyes to emphasize the \"cute\" drawing more. CG's are used a lot for backgrounds. Like for the cars, animals, and etc.\\n\\n\\n\r\nCharacters : 7\\n\r\nOf course, we always need are ever-so-densed male MC's in every show. And that's where Yuuya comes into. A guy who's dense as a rock, not too original if you ask me(almost every show has dense MC in it, though). Kanzaki Mitsuki who fulfills the role of the ever-so-moe little sister in the show. She's a tsundere at most times... No scratch that, she usually lashes out on Yuuya, maybe because they haven't known each other for too long. But later in the show she'd... You know, will soften up too. Kotobuki Hiyori, our girl ghost who's mind is full of ecchiness. She often complicates matter for the siblings. Honestly, Saikin's characters are not that original, but they're still good. \\n\\n\\n\\n\r\nMusic : 6\\n\r\nI didn't like them, so didn't paid too much attention to the music.\\n\\n\\n\\n\r\nEnjoyment : 8\\n\r\nI really enjoyed the show. Had some laughs I haven't had for a long time(this sums up how lonely I am). It's been a long time since I've watched a series this ecchi, and it made me feel so refreshed. That's probably why I enjoyed it this much. Nevertheless, the plot's not that complex, so you can immediately grasp the story with just the very first episode.\\n\\n\\n\\n\\n\\n\r\nOverall : 8\\n\r\nThe way how a ghost interferes between what should be a normal sister-brother relationship is quite amusing. I mean, it doesn't count as incest, right? I'm sure they made the adjustment of re-marrying stuff to stay in the \"legal track\", and to not count as incest. But anyway, it's still certainly entertaining for me. Apart from the ecchiness with half-censoring, it's safe to watch Saikin... really, trust me.  Of course, don't go watching it with your sister, you sis-con! JK. That concludes my very short review for Saikin, Imouto no Yousu ga Chotto Okashiinda ga.\\n",
            "date": "2014-07-09T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 151149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=151149"
        },
        {
            "content": "There are people that review sleazy anime with standards that would be more fitting for top shelf anime. These people do not understand the concept of reviews because an anime , as well as any product, should be reviewed with standards appropriate to its medium and genre. With that opening out of the way, let's talk about saikin, imouto (etc etc.) \"Recently my sister has been acting unusual\";\r\nART (And animation):\r\nIt has some of the most boring, pedestrian, mediocre art and animation I've ever seen, on the plus side I didn't see any blatant animation shortcuts but it makes sense that they didn't  take anybecause they use the most typical, low effort backgrounds and settings possible, bar a couple of exceptional scenes (Aquarium, \"heaven\", etc.).\\n\\n\r\nBecause of those rare instances, I would say it goes from a 5 to an 8... and yes, those few rare instances are beautifully rendered and gorgeous to look at. \\n\\n\\n\r\nCHARACTER (With little to no spoilers);\\n\r\nHere is where we enter a strange area, these characters, particularly one , are very fetishized, I WILL EXPLAIN LATER, WAIT FOR IT... but don't get me wrong the story is actually very good but it is very reliant on the characters, there is a lot of pathos and drama to be had here... the core premise of the anime  is that there is a ghost (Yure) that is trying to achieve ascension to what is heavily implied to be 'Heaven'. In order to achieve this, she must (Engage in sexual acts with the male lead...? we don't know (?????????)) and there we have the problem. We don't really know much about this character or her plight.\\n\\n\r\nShe is the force that moves the plot forward from the beginning until the end, and because we know so little, we are forced to just go along for the ride without having even the basic knowledge necessary to identify with the character.\\n\\n\r\nThis character is called Hiyori and she is the best part of the anime.\\n\r\nShe is bubbly, cute, playful, jealous, dynamic, annoying, interesting and more... she is a legitimate character with a seemingly tragic backstory. Without her the anime would have nothing to do, but as I said she is shrouded in complete mystery right down to her true identity which we never find out. Basically it is an unopened box which becomes a bit of a hassle as time goes by.\\n\\n\\n\r\nThe other two leads are;\\n\r\nMitsuki; A young girl who's mother has just remarried. She is a massive buzzkill the entire show and a very hateable character. She is not Kirino-level bitchy but she comes close... she is very rude, very unappreciative and just an overall drag to have in any scene. Worst of all, she is incredibly inconsistent with her motivations. Sometimes she hates everyone and treats everyone like garbage... other times she is friendly and wishes she had more people around her.\\n\\n\r\nIt is not interesting, it is not cute. She is the worst part of the show... unfortunately the show mainly takes place from her point of view. \\n\\n\r\nYuuya; A fairly bland, self-insert Japanese character. I could not tell you a single one of his characteristics beyond \"He is a young Japanese man\" ... well, he has one trait; He is INCREDIBLY patient with his horrible new sister. He is a Zen-rock given how much abuse he tolerates from the Mitsuki character.\\n\\n\\n\r\nPLEASE TAKE NOTE:\\n\r\nThere are two supporting female characters that spend the entire show \"Foreshadowing\" their involvement in supernatural affairs. This never gets paid off, not even a little bit. It is a complete waste of time so I did not even mention their names. \\n\\n\r\n I was like \"Oh okay, I think I see where this is going\" in the first episode when these characters are hinted to \"Know more than what they are sharing\" ... but even in the FINAL EPISODES they're still doing the foreshadowing thing with no end in sight for their shenanigans. Terrible characters that don't add up to anything.\\n\\n\\n\\n\\n\r\nSTORY;\\n\r\nAnd now let's talk about the elephant in the room. This is an ecchi anime that goes so hardcore so as to almost be hentai.... and that's not wrong. I am a man and I enjoy both ecchi and hentai... however, this specific anime is leaning heavily towards the disturbing fetishistic.\\n\\n\r\nThere is a strong leaning towards urination fetish and that's just.... not for me. There is also a strong undercurrent of BDSM going on ... but the worst part is;\\n\r\nThis reaches its highest points in the first 3 episodes and then it tones way down.\\n\r\nYes that's right. It goes full on fetish-mode as it's introduction to the audience.\\n\r\nI was like \"WTF?\" when I watched this, it takes some very weird turns.\\n\\n\r\nThat being said, if you can soldier through the first few episodes, you will be rewarded with a fairly quirky and unique screw-ball ecchi comedy that almost completely redeems itself. It has some great situations and even some solid comedy here and there. Honestly if more of the show was like the middle parts, it would be a fantastic show but alas, it is not.\\n\\n\\n\r\nThe beginning is very poor, rather than easing the viewer into the fetish it wants to explore, it hits you like a brick to the face with no build-up or tone... and that is the word of the day; TONE. In the first few episodes there is severe tonal discordance which makes it very difficult to watch or recommend. \"It gets better\" is not enough.\\n\\n\r\nAnyway, the ending of the show is a massive cop-out. Yes, I understand that they want to make more money, yes I understand it is probably based on a manga that is on-going. Yes, I get that we never knew much about the situation to begin with but none of that excuses the complete non-ending that is given to the audience. It is absolute garbage.\\n\\n\\n\\n\r\nTo summarize the story;\\n\r\nHORRIBLE beginning (First few episodes)\\n\r\nHORRIBLE ending (Last two episodes)\\n\r\nPretty good middle parts.\\n\\n\\n\\n\r\nSo, to conclude, do I recommend?\\n\r\n- No, do not watch if you are sensitive to fetish scenes, I would totally understand if someone didn't even bother getting through the first few episodes. There is a serious \"Wall\" before it \"Gets better\".\\n\\n\r\n- I do not recommend if you are looking for a light-hearted comedy show. This gets dark pretty often and the comedy is off-set by macabre set-pieces.\\n\\n\r\n- I do not recommend if you are looking for a serious, drama orientated show. The tonal dissonance will get on your nerves fast.\\n\\n\r\n- I do not recommend if you are looking for fap material. There is much better material out there and it is not as padded as this.\\n\\n\r\n- I do recommend if you meet the following criteria;\\n\r\n* You are very curious to see the middle portion of this anime, which as I said, is very good.\\n\r\n* You have high tolerance or maybe even a desire for BDSM and urine fetish anime (I don't).\\n\r\n* You want to see how spectacularly bad the beginning and ending of the anime are.\\n\\n\r\nBasically, almost no one should watch this anime.... I enjoyed the middle portion which was really quite good, but the fact that it begins and ends so horrendously means I can't recommend in almost any circumstances.\\n\\n\\n\r\ngg.",
            "date": "2016-02-19T14:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 211267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061511.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dominick_Destine",
                "username": "Dominick_Destine"
            },
            "url": "https://myanimelist.net/reviews.php?id=211267"
        }
    ],
    [
        {
            "content": "\"Recently, My Younger Sister Is a Little Strange\" is what you get when people try too hard to make an ecchi show. First of all, why would you even make a show revolving around a high school girl wearing a chastity belt if the chastity belt has to be blatantly censored almost every time?\r\nThis is one of those shows that you know is going to be horrible right from the premise. An extremely generic and oblivious guy, Yuuya, gets a new sister, Mitsuki, after his father remarries. Mitsuki soon runs into a ghost, Hiyori, who has amnesia and can only remember that she loves Yuuya.In order for Hiyori to go to heaven, she has to get Mitsuki and Yuuya to fall in love (or at least have Mitsuki get turned on by him enough times to fill up the \"special\" meter in the chastity belt). I have no idea what bizarre religion only lets spirits into heaven after making step-siblings fall in love... To top it all off, Mitsuki can only \"open\" up the chastity belt for three minutes at a time every hour. Hiyori's final goal is for Mitsuki and Yuuya to have sex so that she can go to heaven..... considering the chastity belt only opens for three minutes, they better make it fast. So the premise is absolutely stupid and I only watched it for the laughs. The plot is actually hilariously bad at times, but most times it'll just leave you shaking your head at how dumb everything is.\\n\\n\r\nSpeaking of dumb, the characters are horrible and stupid on top of that. Yuuya is oblivious to everything, Mitsuki is your generic tsundere, and Hiyori just causes trouble every episode. The minor characters are completely forgettable and only help to cause friction between Mitsuki and Yuuya and be even more generic than the main characters. There's not much to say about the characters other than that.\\n\\n\r\nWell, except that the character designs are also terrible. The area in between the characters' foreheads and cheekbones is depressed so much it just looks strange, kind of like if they all slept with their heads on their hands when they were babies and caused a permanent skull deformation around their eyes. The backgrounds and the rest of the characters are cheaply designed, but the worst part is when it comes to the fanservice.\\n\\n\r\nThere are two things that are both problematic with this:\\n\\n\r\n1. The censorship is over-the-top as I already mentioned (and it's not just bright light covering things, it's a giant lock).\\n\r\n2. Those weird eroge-style text boxes whenever Hiyori sexually assaults Mitsuki off-screen. That is the worst part of the show. It seems like they just decided to throw in a little yuri fanservice, but then told the audience to just imagine it themselves like they were reading a book and not watching a show.\\n\r\nThe soundtrack is also boring and forgettable, and the opening and ending are typical j-pop songs for an ecchi show.\\n\\n\r\nMy recommendation is to not watch this show. The characters are generic and helpless, the animation is just bad especially for the character designs and fanservice, I have no idea why anyone would come up with such a bizarre story that defies any existing religious belief to create it's own stupid one, and it's really only enjoyable if you're going in expecting to laugh at it or if you really, really enjoy ecchi shows for the fanservice alone.",
            "date": "2014-03-22T13:42:00+00:00",
            "helpful_count": 81,
            "mal_id": 136471,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=136471"
        },
        {
            "content": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga (or the shorter English title \"Recently, My Sister is Unusual\") follows the story of a young girl and an older boy who become step-siblings due to their parents marrying each other. The setup is pretty standard, but the catch is that the younger stepsister gets possessed by a ghost who's in love with the older brother, is forced to make moves on the brother to send her new poltergeist companion to the next life, and ends up falling in love with him in the process. Mysterious missing parents and ecchi, incesty hijinks involving a chastity belt thenensue.\\n\\n\r\nThe thing about this series is that it does not break any new ground whatsoever. The premise has potential, but the series never builds upon it, instead relying on tired tropes: dense/stupid main character (the brother), tsundere (the little sister), a childhood friend whose main features are her big breasts, a perverted best friend, an annoying ghost, a silent book-reading girl, etc., etc. It's all been done before. The aspect that could have been unique and set the series apart - the part about the ghost - is never fully explored. Instead, it's used simply as a device to make sure the \"fanservice quota\" for each episode is fulfilled. What results is a bland, tired, and frankly boring-to-watch incest fanservice show that is entirely forgettable.\\n\\n\r\nStory: 5/10\\n\r\nThe weak point of the series. All the plot points that get brought up along the way - why the ghost had to possess the sister, why the ghost loves the older brother, why the childhood friend came back and is hinted to be able to see the ghost, why the silent girl seems to know everything that's going on, etc. - are never really answered. This is second season baiting in its finest. Overall, nothing too interesting about the story.\\n\\n\r\nArt: 6/10\\n\r\nThe animation and character designs do their job. The characters look cute and appealing, the backgrounds are nice and detailed. It's not an action series, so there weren't any impressive feats either. The animation is simple but is sufficient in a fanservice show such as this.\\n\\n\r\nOne caveat, though: this is another one of those shows that censored its contents for the TV broadcast to bait gullible otaku into buying Blu-rays to see naughty bits, so keep that in mind. IF CENSORSHIP TURNS YOU OFF, THEN AVOID THIS SERIES ALTOGETHER unless you can get your hands on the Blu-ray version.\\n\\n\r\nSound: 7/10\\n\r\nThe music is the high point of this series. The OP and ED are both very catchy and memorable, especially the ED, which coupled with the trippy/WTF/LOL animation makes for a pretty enjoyable closing segment to each episode. The sad thing is it was probably better than the actual show itself.\\n\\n\r\nCharacter: 5/10\\n\r\nLike I said earlier, all of the characters follow archetypes and act according to tropes. Standard ecchi stuff: dense/clueless male MC protagonist, tsundere little sister who secretly likes her brother but abuses him because she doesn't accept that fact, the pervert best friend who wants to get into every girl's pants (even if they're a decade older), etc. Bland and forgettable characters that failed to leave an impression even after a fairly dramatic ending, especially since we were supposed to feel for the ghost near the end.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI'll admit the fanservice comedy got a few laughs out of me. Some episodes made me smile, mostly due to the characters' stupidity or the ludicrous plot. But mostly I watched this because I had time on my hands, but this show was not really something I looked forward to every week, in contrast to some of the other series that came out the same season.\\n\\n\r\nOverall: 6/10\\n\r\nIf you're looking for a mindless RomCom with incest undertones or an over-the-top and unnecessary fanservice series that allows you to turn off your brain and kill a few hours, then this series does fine. If you were hoping for a deeper story and good characters with fanservice only as cherry on top, then look elsewhere, because this is a completely standard, overdone ecchi anime that is a prime example of lazy fanservice-based series that seem to have burgeoned in numbers in recent years.\\n\\n\r\nOther anime similar to this series:\\n\r\nNAKAIMO - My Little Sister is Among Them\\n\r\nOreImo\\n\r\nListen to Me Girls, I Am Your Father!\\n\r\nInfinite Statos\\n\r\nDate a Live\\n\r\nHigh School DxD\\n\r\nDemon King Daimao",
            "date": "2014-03-22T21:46:00+00:00",
            "helpful_count": 56,
            "mal_id": 136521,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366694.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TCTriangle",
                "username": "TCTriangle"
            },
            "url": "https://myanimelist.net/reviews.php?id=136521"
        },
        {
            "content": "Recently this anime is sooooo unusual, why? co'z it simply doesn't amount to anything. Let's see, there is no story, its plot was sooooooooo lame, fanservice were poor, comedy was too corny, so overall this anime was just tooooo pathetic to say the least, now, I really don't dig as to why this story creator, Mari, Matsuzawa was thinking, but frankly she isn't doing a good job in anyways, and only her \"Inukami\" was the best thing she ever created. Also, I don't dig as to why studio \"Project No 9\" would ever think about making this into an anime when there are other mangasout there whose story line was far better than this one. Ok so lets get into this anime's character one by one:\\n\\n\r\n Mistuki Kanzaki- Her character being this man hating girl kinda conflicts the part where she hates men but seems to have reserve feelings for Yuuya. At one point I kinda pity her that she has to be this stupid ghost's, Hiyori, love juice bearer just for her to construct a stair way to heaven. However, what I hate about her is how much of a bitch she is towards Yuuya that he has to get a lotta bitch slap from her. Frankly, to be this anime's fanservice object was just too lame to say the least.\\n\\n\r\nYuuya Kanzaki- Pretty much your generic harem boy, as usual his character was very boring to say the least.\\n\\n\r\nHiyori Kotobuki - If this anime would have a antagonist then she fits right in, though she doesn't act like one, the fact that she was the one who put Mitsuki in such predicament qualifies her to be one, also her character was very annoying since her role was full of dichotomy where at one point she doesn't remember anything as to how she died and yet she was able to describe details of her dead. Also, her role was to be this ghost who was suppose to posse Mitsuki  and make lovey dovey with Yuuya so that the gauge in Mitsuki's chastity belt would be filled with love juice and yet she can achieve it by sexually pleasuring Mitsuki, what makes her qualify as an antagonist was that she more of a sexual predator rather than an loose soul.\\n\\n\r\nKiritani Yukina- Ok she suppose to complete this anime's harem genre, but unfortunately, her character was a disappointment as well. Let's face for someone who can see dead people, I really wonder why her role doesn't allow her to tell the male character or let alone help Mitsuki. The only consolation about her was her fanservice and that's as good as she gets.\\n\\n\r\nNeko - Another disappointing character, like Yukina she can also sense Hiyori's presences and just like the latter her character doesn't allow her to tell the male character and just be a fence sitter.\\n\\n\r\nSo with the main character's mentioned, it was difficult to say as to what author Mari, Matsuzawa was on about as to there roles which for me the character part of this anime can be classified as pathetic.\\n\\n\r\nSo, without further adieu and I've already state my case with this anime, here  are my ratings.\\n\\n\r\nStory- pathetic 1\\n\r\nSince, it was base on a weak plot.\\n\r\nArt - poor 3.\\n\r\nCo'z Mitsuki's fanservce sucks.\\n\r\nSound- Good 7.\\n\r\nThe rating is for the opening theme.\\n\r\nCharacter-pathetic 1.\\n\r\nNo need for me to mentioned.\\n\r\nEnjoyment - fair 6.\\n\r\nThat's for Yukina's hotness.\\n\r\nOverall - pathetic 1.\\n\r\nCo'z Mari, Matsuzawa's didn't do a good job on it and frankly there's no point of going through the manga co'z this anime alone has already given the spoiler as how it will end.\\n",
            "date": "2014-03-23T09:23:00+00:00",
            "helpful_count": 44,
            "mal_id": 136579,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2004376.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 1,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Baddie007",
                "username": "Baddie007"
            },
            "url": "https://myanimelist.net/reviews.php?id=136579"
        },
        {
            "content": "Incest is a very interesting genre in the world of anime.  For some reason, the japanese love the idea of forbidden love in their animations, attempting to twist the idea so they can still have said forbidden love so it abides by the law, kind of, with well-known titles like \"Oreimo\" and \"Onii-chan Dakedo\" taking the spot as the more well-known incest related animes.  Today I will be talking about one of the more recent introductions to the incest genre, Saikin, Imouto no Yousu ga Chotto Okashiinda ga, or, Recently, my little sister is unusual.  Let's begin.\r\nStory (6.45/10): The story of Saikinfollows the story of Mitsuki, a 15 year old girl, who gains a stepfather and a stepbrother named Yuuta as a result of her mom marrying another man.  It is from this point where Mitsuki hates her new life, and one day, when crossing a bridge, a ghost that goes by the name Hiyori tackles her and she blacks out.  After a whole set of circumstances, Mitsuki finds out that this ghost, Hiyori, is possessing her, and that she must fill this heart gauge that is on the chastity belt that she is required to wear, with various, lustful actions with her older brother, whom she hates, in order to satisfy Hiyori's final wish, (which is basically having sex with Yuuta), and move her on to heaven.  (You know, you would think that god or whoever's in charge would condone such sinful actions.  Oh well, it's anime after all.)\\n\\n\r\nNormally with incest animes, the story is a run of the mill one that would consist of 2 siblings, a brother an a sister, where the sister, (normally little sister), has an intense brother complex, and therefore would be in love with her brother, and it would stem off from there.  Saikin, as I like to refer to the show as, has a unique twist to this \"idea.\"  \\n\\n\r\nCompared to \"normal\" incest animes, the female loves the main male lead.  This is not the case.  The fact that I get to see a different approach in this genre, was enough for to see how this went, as Mitsuki seemed like a normal person, being unwilling to do something undecent, as well as having a moral compass, as well as an acurate interpretation to how a normal person would react to the situation.  As far as a base idea goes, the series gets a plus, seeing as how the normal format on how the plot was written, was somewhat different.\\n\\n\r\nIn terms of pacing, the series never really felt too rushed.  It had a rather decent pace that I could follow, and the series never felt overflowed with useless plot points and rushed areas of explanation.  (There was still a complete filler episode that I thought was completely unnecessary.)\\n\\n\r\nOn the other hand, we still get that sort of incestuous relationship that you would get with an anime like this.  (Bear in mind, these characters are siblings by name, not blood.)  As the series goes on, the development for the series started to become what you would normally see.  It was nice to see the characters develop a bit more, as Mitsuki started to be \"ok\" with having an older brother, but there were a few things that bothered me as the series went on.  One, they don't explain anything.  Saikin has an absurd amount of plot holes, ranging from little unexplained things, to an entire potential backstory being completely underminded, and even a whole character who's purpose I feel isn't completely explained.\\n\\n\r\nOverview\\n\r\n+  Different approach to the incest genre, (sort of)\\n\r\n+  Decent pacing\\n\r\n-   Unexplained plot points\\n\r\n-   Generic story development as series continued on\\n\r\n-   Side story and generic episodes (beach episode, hot springs, etc.)\\n\\n\r\nCharacters (5.78/10):  When it comes to characters, this series has a wide array of them, most of the falling into the supportive and basically non-existent role, all of which have varying degrees of development and actual characteristics.  \\n\\n\r\nFirst off is our main character, Mitsuki.  (At least I think so.)  Mitsuki, is a very interesting character.  Compared to what a normal female protagonist is in a romance anime, she doesn't really follow a standard troupe as one might think.  At the beginning of the series, she is shown to be quite an independent character, not needing really anyone in order to be around her or be with her, as well as developing a stand alone personality.  As the series goes on, she starts to learn more about this new brother that she has acquired, and starts to get closer to him with each passing episode, as little as it may be. (While also doing a bunch of things no real girl would ever do, or be caught doing.)  She is more or less the most interesting character in the series, and more or less carries the show with her stand alone personality and originality as a character.  Beyond that, it's downhill from here.\\n\\n\r\nYuuya, the main male is one of those guys you would want to punch in the face.  Like any main guy in a romance anime, the godforsaken density of his mind makes for the most absolute infuriating and completely pointless and redone characteristics ever.  (Seriously.  Why the hell would they NEED to make the main guy so fucking oblivious to everything?  It doesn't even make sense in a romance anime for the guy to not know there's a girl crushing on him, or something like that.)  Apart from his sheer density, Yuuya is more or less a caring sort of person, having concern for his new sister and being as nice of a person as he can be.  In my opinion, it was nice to see him as such a nice character, but his obliviousness was extremely facepalm worthy.  \\n\\n\r\nHiyori, as the aforementioned ghost in the series is a rather \"interesting\" character.  For starters, she died, painfully.  Because in her life, she loved Yuuya, she attempted to confess to him, only to be run over by a drunk truck driver, never to breathe or confess to her one true love ever again.  So, as the law of ghosts go, a spirit must be able to fulfill his or her last wish in order to move on to either heaven, or hell.  In this case, it's to have sexy time with the dense guy mentioned above.  Throughout the series, Hiyori is a mystery.  She is constantly being mentioned to have amnesia of her past life, as well as being able to be seen by random characters here an there.  Neither of these plot points, which would've added SO much to the story, are fully explained, and it made me mad, seeing as how they mention it, but forgot it in the series much later.  Most of the time, Hiyori is this fun little character who can get a bit annoying at time, urging on Mitsuki to do things, so that Hiyori can move on.  That's pretty much it.\\n\\n\r\nIn terms of supporting cast, we have what you would really expect in a show like this, one-noted and terrible character, aside from Yukina.  The supporting character really weren't that terrible, but didn't add much in terms of development of the plot and really were just fodder to explain that this show has more people than the ones of the cover art.  They're not fantastic, and mostly boring, (except Neko, who's purpose is a freaking mystery since she seems to have some sort of plot importance, which was never explained), and really are only just, there.\\n\\n\r\nOverview\\n\r\n+  Decent female lead\\n\r\n-   Another addition to the super dense male lead army\\n\r\n-   Completely pointless supporting cast that didn't add much of anything\\n\r\n-   relying heavily on the main lead for any sort of development\\n\r\n-   Completely unexplained character that was teased to have plot significance.  (i.e. Neko)\\n\\n\r\nArt and sound (6.98/10 and 4.78/10): In terms of art, the actual animation in fairly decent.  For one thing, the characters aren't overly moe and they have a very crisp looking design to them.  Personally, I like the look of these characters and the way they were designed.  \\n\\n\r\nA little segment I do whenever talking about an ecchi show is to actually talk about the ecchi, since it does sort of fall into the art category.  Saikin has an outstanding amount of ecchi, most of it coming from showing the chastity belt on Mitsuki, which is completely pointlessly covered up by an ornate heart-shaped censor bar compared to a normal black bar.  This is something that made me a little upset.  For starters, if you're going to make an ecchi show, you show the panties, like what most ecchi show does.  To put in the effort of censoring it with your own censor bar, which is probably wasted money due to the fact on how ornate it was, seems like a waste of time to me.  \\n\\n\r\nThe sound is completely generic and forgettable.  It's your average happy-go-lucky sound which you'll forget about within a month unless you're like me, and watched the series week after week for the new episode.\\n\\n\r\nOverview\\n\r\n+  Good character designs and artwork\\n\r\n-   Completely unneeded ornate censor bar\\n\r\n-   forgettable soundtrack that you probably won't bat an eye on\\n\\n\r\nPersonal Enjoyment (6.76/10): While for the most part, the show was terrible, I somehow enjoyed it way more than I should've.  Because the exposition was somewhat intriguing, I continued watching it and wanted to know if it went anywhere, if at all.  In the end, what I received at the end of this series, was an anime that more or less was what I expected, a generic mess that was somewhat different than what I had watched prior.  The show does have a redeeming feature with what I feel like is a better female protagonist, but the rest of it was as dead as Hiyori, being just this loop of never-ending formula of the same thing, that was less than satisfactory. \\n\\n\r\nA huge critique that I would give the show, is its lack of any real plot explanation.  Throughout the whole anime, it was focused solely on the idea of making Mitsuki orgasm from her brother, in order to build stairs of light up to heaven for Hiyori.  What made the show worse, was the addition of plot points and potential mysteries, that actually made me a bit more intrigued, as the story looked to be taking a different turn that actually seemed interesting.  But in the end, those plot points were completely disregarded, and tossed to the side, making me wonder how the show would've turned out if it followed a different path.  (i.e. both Mitsuki's and Yuuya's past, as well as how other people other than Mitsuki can see Hiyori)  \\n\\n\r\nAll in all, Saikin was a rather interesting take on the incest genre, which ultimately, failed to grasp any favorites from fans like its predecessors.  It had less than good writing, generic character, and a forgettable soundtrack.  Personally, I feel like this show isn't as bad as it seems, but it is still pretty terrible nonetheless.  If you're an ecchi fan, you might actually like this.  Other than that, I would highly suggest you stay away.  This really isn't a show for everyone, since it's mostly about boobs and a chastity belt that looks like it was bought from a pleasure place.\\n\\n\r\nOverall Score:  (6.40/10)  Seriously though, terrible plot explanation.",
            "date": "2014-03-22T20:33:00+00:00",
            "helpful_count": 25,
            "mal_id": 136515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=136515"
        },
        {
            "content": "This anime, unlike many other ecchi anime, has a story line that is not difficult to follow. Although, people seem to complain about not knowing the answers to questions, although they are right in front of them. For example, if you would simply watch the ending theme all the way through, you would learn all you need to know about Hiyori's past.\r\nThe art was not hard to look at, but some scenes were just a little off in appearance and the way characters bodies were drawn.\r\nThe voices were easy to listen to and matched the characters very well. I especially enjoyed the difference in Mitsuki'svoice whenever Hiyori possessed her.\\n\\n\r\nThe character types are rather common, but that does not make them boring by any means. They are always lively and interesting.\\n\\n\r\nThis anime is a great combination of genres, and you will definitely enjoy its constant bursts of humor. Though I would mostly recommend this to ecchi fans, it's still incredibly funny and can be enjoyed by many more.\\n\\n\r\nOverall, this anime was a good watch, and I would gladly suggest it to all of my friends.",
            "date": "2015-07-11T09:06:00+00:00",
            "helpful_count": 10,
            "mal_id": 192988,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4735536.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ShadowsweeperX",
                "username": "ShadowsweeperX"
            },
            "url": "https://myanimelist.net/reviews.php?id=192988"
        },
        {
            "content": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga comes in a season without any blow-me-away hypetrain anime to compete with, an as such many people may be considering whether to give it a go while they wait for the blockbuster mega-hype that is the spring 2014 season. Don't do it.\r\nStory: \r\nThe premise is neither particularly good nor particularly awful compared to other pieces in the ecchi genre; our dense protagonist gets a new sister, who is then possessed by a girl who claims to have known Yuuya before she passed away, and who is in love with him. If this leaves you at all curious,feel free to watch the pilot and judge it for yourself. \\n\\n\r\nWhat is particularly bad though, is the execution. Many anime have that one 'dissapointing' episode. you know the one. You're having fun, having a bit of a laugh, or there's some tense episode going on, and then BAM out of nowhere its a filler episode that leaves you wondering why they didn't just put it in an OVA and not break up the pacing. Saikin is full of these episodes. \\n\\n\r\nPlot threads begin, and then are soon dropped, characters have some confrontation or realisation, and then pursuing it is brushed aside in lieu of a pool/hot spring/beach episode. This may not put off the diehard ecchi fans though, and knocking a show like this for its story alone would be pretty ridiculous.\\n\\n\r\nCharacters:\\n\r\nMany anime take on too large a cast and then have trouble fleshing out the characters at all. Saikin has a relatively small cast, and still many of the characters say one type of thing the entire show. Shoutarou's involvment in the show consists of him being the pervy best friend (how original) and almost every single line (he has a few too) is something along the lines of \"that is/isn't what a real little sister is\". His actual sister is no better.\\n\\n\r\nMoa's only contribution is to go on and on about how shitty her brother is which, while not necessarily untrue, is incredibly unwarranted to the extent that it goes on. \\n\\n\r\nAnd then there's Neko. Is she a mastermind? God? An annoying stereotype? We will never know, but most of her time is spent wearing glasses, reading a book, and seeming to know more than the others think she does. What respectful character design. At this point I'm inclined to think that project 9 is just giving us a straight middle finger.\\n\\n\r\nThe 3/4 main characters (depending if you count Yukina) are mostly just blatant stereotypes. There isn't really a need to discuss the bad things about them, so I'll focus on the few small good things. There are a few somewhat genuine moments between Yuuya and Mitsuki which show a developing relationship (not the sexual kind), and Yuuya's ability to remain proactive in the way he goes about living with Mitsuki is if nothing respectable. Hiyori and Mitsuki have some amusing moments of back and forth and there personalities at least seem like an appropriate choice for this sort of anime. Again, where it all falls apart is execution.\\n\\n\r\nSound:\\n\r\nAs someone who has studied music all my life, the OP of this anime made me laugh. There are bad openings, there are good openings. That is just a matter of taste. But this is just lazy. OST is whatever, I don't feel like any music in this show is worth writing about.\\n\\n\r\nArt:\\n\r\nI reaaaaallly don't like the style here, but it is entirely a matter of preference. To me the characters seem wonky in a way, and I often thought that the artist was having trouble actually displaying emotions in the characters. \\n\\n\r\nThe one thing i can warn about though is censorship. Seeing as this show sells itself as ecchi, there is a lot of censorship. Giant clip art style blocks to prevent you seeing panties, cutting out implied yuri scenes while describing them in text boxes (wtf?), this certainyl isn't DxD.\\n\\n\r\nConclusion:\\n\r\nThis show is a failure not because it is an ecchi, not because the story is boring, not because the characters are bland and not because the art and music leave something to be desired. It is a failure because it can't execute anything properly. Is it an ecchi? If so then why does it cut almost all ecchi moments out after the first few episodes? Is it a rom com? If so then why is there so little meaningful character development, and why does this seem secondary to going to the pool or whatever other typical thing can be put in there?\\n\\n\r\nIf you are a diehard ecchi fan, who is a complete siscon, then maybe you should watch this show. if you are interested in the genre, then go watch Oreimo if you hate ecchi or KissXsis if you don't. There are simply better series out there if this is what you wan't.\\n\\n\r\nI hope i can save at least a few people a little time.\\n",
            "date": "2014-03-24T03:24:00+00:00",
            "helpful_count": 9,
            "mal_id": 136699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2735103.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dalvoid",
                "username": "Dalvoid"
            },
            "url": "https://myanimelist.net/reviews.php?id=136699"
        },
        {
            "content": "Okay, plain and simple this show is bad, i myself have no clue why i stuck through the entire thing. I think i was waiting for something good to happen ;) but nope nothing. The Art is one of the worst I've seen, it looks like a \"I made it in 5 minutes\" type of art and it also seemed like the least amount of effort was put into the MC herself. The story is utterly pathetic, there is no real story and i feel that the main character should not have been the little sister. Imagine if \"My little sister can't be this cute\"was made through Kirino's (BASED KIRINO) eye's, wouldn't have been to appealing now would it. I assume that the story was supposed to funny at some points but the jokes weren't funny. \\n\r\nIn terms of character development some may argue that MIsuki (the MC) under went some character development because she can take to her Oni-chan easier. However there is no real character development here because even though her life is literally on the line she refuses to do anything about it and hits the brother (don't know his name because he's not important) even though she caused the incident to happen. With Misuki being the main character this show was not enjoyable.  \\n\r\nSound...(I'm a tough critic on this one)... the music sounds like they only had a week deadline and had to do whatever they could. The outside noises did not match the actions depicted and several times made me wonder if the audio was a second late. \\n\r\nOverall I'm very disappointed, and having liked watching OreImo i had high hopes for this show but the show did not deliver.",
            "date": "2014-03-29T20:48:00+00:00",
            "helpful_count": 8,
            "mal_id": 137823,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3393157.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/9tehk1ll3r",
                "username": "9tehk1ll3r"
            },
            "url": "https://myanimelist.net/reviews.php?id=137823"
        },
        {
            "content": "Before I get to the structured part of this review, there is one major gripe about this anime I have to get off my chest. It is best captured by a classic line from Shakespeare, namely \"This above all, to thine own self be true.\" \r\nThat may sound a bit dramatic when reviewing an anime with a strong ecchi element, but that is exactly the point: this show did not *need* to be an echhi. Nor did it need the \"imouto\" element, since the writer did not seem to be all that interested in wiriting about a brother-sister relationship. (In fact, the only real brotherand sister characters in this show constantly bitch about each other. Which is okay, but seems more like the kind of thing you'd expect in a show that makes fun of the imouto genre). The writer simply should have told the story she wanted to write about characters she felt were interesting and worth developing. And based on the strength of that, she should have tried to sell the idea for a manga and then an anime. So no fake \"imouto\" tag and no ecchi that gets covered up all the time anyway. Then the writer would have been true to herself.\\n\\n\r\nStory 3/10\\n\r\nThe story basically revolves around a high school girl, 15-year old Mitsuki, who is very depressed due to her mother's many relationship problems get pounced upon by a horny ghost who wants to force her into having sexual intercourse with her stepbrother (the result of a hopefully more fortuitous relationship choice of her mother's). The horny ghost in question, Hiyori, is completely self-centered and shows very little mercy to Mitsuki, who is completely miserable throughout all the trials that Hiyori puts her through. Needless to say, witnessing an already depressed teenage girl get sexually mangled is not something most people will enjoy. I certainly didn't. To make matters worse, there are at least two instances in the show where Mitsuki seems dangerously close to taking her own life to escape all this misery. Quite shocking, I felt. \\n\\n\r\nThere really isn't much else to the story, really.Aside from some even more disturbing bits, that is. For some reason, Mitsuki is forced to wear some sort of magical chastity belt that only opens for 3 minutes every hour, so that she is often in a lot of discomfort as she tries to avoid soiling herself while the thing is closed. And if all that wasn't enough, Hiyori regularly sexually assaults her, perhaps for good measure? (And the writer who came up with all this sickness actually is a *woman*, or so I understand...)\\n\\n\r\nArt\\n\r\nThe animators involved obviously weren't very happy to be working on this \"project\", since the character drawings are very rudimentary. Compared to this, one of the earliest \"Detective Conan\" episodes from 1996 looks like a veritable height of anime quality. \\n\\n\r\nSound 7/10\\n\r\nNothing much to complain of, although the opening theme is fairly generic. The voice acting is generally good, with the newcomer who voices Mitsuki infusing her voice with all the pain and humiliation that anyone in that situation would more or less feel. \\n\r\nIt's a curious point that the rapist-ghost Hiyori is voiced by the same actress who voiced Tsutsuskashi Tsukiko on the much friendlier \"The Hentai Prince and the Stony Cat\", since Tsukiko was such a strong girl who always made clear that she would not stand for any sexual advances outside of an actual relationship. To go from portraying Tsukiko to portraying a female rapist is quite a leap...\\n\\n\r\nCharacter 3/10\\n\r\nThis is what brings me back to my opening statement about the writer needing to be true to herself, because there are some definite glimmers of interesting characters here. Mitsuki is far from your standard anime imouto and even unusual in her alsmost consistently (although justifiably) depressed mood. \\n\\n\r\nHer stepbrother Yuuka (or Yuuna?) is an extremely goody-two-shoes type of guy, who is always gallant and understanding throughout all the hijinks that he has to witness when Hiyori is possessing Mitsuki. Given the strength of Hiyori's fascination with him, it's a real pity that his exact backstory with whoever Hiyori was when she was still alive is not revealed. But it's probably safe to say that he behaved very polite, friendly and gentlemanly to whoever she was. \\n\\n\r\nHorny ghost Hiyori is the unequivocal villain of this series, even if she does not seem to think so herself. Mitsuki would have been well within her rights to have some sort of exorcism performed that would have sent this monster straight to hell. \\n\\n\r\nRecently moved in next door childhood friend Yuki is almost as saintly and boring as Yuuka. Her having been a tomboy who was always being rough with Yuuka is an interesting idea, especially since she grew into such a large-breasted young woman who tried so hard to be the stereotypical gentle female. It feels like there could have been an interesting story here, and there are some small hints in the final episode about why Yuuna and she act towards each other the way they do. \\n\\n\r\nThen there is the mysterious mousy bookworm Yukina, with the emotionless voice that we have come to expect from such characters. There are some curious hints towards the end that she may in some way be behind all that has happened, but her reasons and goals never really become clear. She probably represents the writer herself. \\n\\n\r\nThere are no real other characters to speak of. There's an alcoholic aunt who lives with Mitsuki and Yuuna, but she hardly ever seems to be around. And then there are the only real brother and sister in this series who always get in each other's hair. \\n\\n\r\nEnjoyment 1/10\\n\r\nThe misery inflicted on Mitsuki was not something I enjoyed watching. It's almost as if the animators made her look as depressed as possible to continually underline how sick this aspect of the show is, perhaps as a silent protest. To make matters worse, Mitsuki's ordeals do not seem to have served any purpose. Seeing some potentially interesting characters not get much meaningful development was not enjoyable either. \\n\\n\r\nOverall 3/10\\n\r\nI really wanted all these strange people (even the alcoholic aunt) somehow overcome their problems and grow as a result of their experiences. (Apart from Hiyori, that is, she simply needed to burn in hell for her crimes!). But in the end, nobody really seemed to have made much progress.",
            "date": "2014-03-23T14:23:00+00:00",
            "helpful_count": 7,
            "mal_id": 136627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2655401.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Eminem2",
                "username": "Eminem2"
            },
            "url": "https://myanimelist.net/reviews.php?id=136627"
        },
        {
            "content": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga, a typical, shitty romcom with the usual 'shy girl'. What to expect from this? Nothing, but pure fanservice and a shitty storyline. (Also, a horny ghost)\r\nStory: 1/10\r\nStory, yes there is a story, but it was horribly told. They focused more on the fanservice part, rather than the story. It was just about a shy girl (Mistuki) who was forced to love his step-brother(Yuuya) by a ghost (Hiyori). To sum it all up, Mitsuki just needs to fill out the chastity belt in order for the ghost to pass on. Yes, that's all there is to the story.\r\nArt:6/10\\n\\n\r\nThe background was alright(Didn't really matter to me). The character designs were actually good, especially with the tsundere expressions of Hiyori.\\n\\n\r\nSound: 7/10\\n\\n\r\nSounds were good, especially with the OP and ED, while the background music didn't really bothered me.\\n\\n\r\nCharacter: 5/10\\n\\n\r\nCharacters were not that bad, but also not that good. Some characters were not explained thoroughly. There are a few characters which had some development, like Mitsuki who became more interactive to Yuuya, as the anime progressed.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\nYes, despite the fact that the story was horrible, it was still enjoyable, especially with Mitsuki's clumsiness and the fanservice (If you know what I mean).\\n\\n\r\nOverall: 4/10\\n\\n\r\nAll in all, I could say that ImoCho could be a lot better, especially with the manga being active and all. If you're looking for a romcom with a lot of pure fanservice and has a typical shitty story, then this would be good for you.",
            "date": "2014-03-28T06:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 137467,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3302691.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Happy24",
                "username": "Happy24"
            },
            "url": "https://myanimelist.net/reviews.php?id=137467"
        },
        {
            "content": "What a terrible piece of crap. Somehow they turned a show that could have been a hilarious, cute, silly show about a \"forbidden\" relationship into a total joke of a show. This could have just been Oreimo with a supernatural element, and a little more lewdness, and it would've been fine. Instead it felt like the staff didn't know what kind of show they were making, a supernatural-comedy-ecchi-incest-SoL, or a heartfelt-coming of age-incest-SoL. They failed on both accounts. Maybe it was the staffs fault, maybe the source material was already garbage and they didn't have much to work with, or maybe it's Japan's decency law'sfault. \\n\\n\r\nThe characters are all hot garbage. Mitsuki, the main character, is a total pain in the ass from the moment you meet her. She has a terrible attitude, terrible people skills, and shows zero signs of improvement throughout the series. Her brother Yuya is no better. He's your typical male lead in a romance SoL that isn't a shoujo. Oblivious to everything that goes on around him, always jumping to the wrong and most absurd conclusions. You would think, with a step-sister that constantly treats him like garbage, he'd eventually lose his temper and yell it her, and maybe make her grow in the process. But nope. Mitsuki could probably murder everyone he knows and loves and he'd just sit back and wonder why she's feeling sad. \\n\\n\r\nThey other characters are just as terrible. Neko, a Nagato Yuki knock-off, is some sort of supernatural thing. It's never explained who or what she really is, we're just supposed to accept that she's friends with the main characters and is a little odd. Torii, Yuya's best friend, is your typical best friend in an ecchi anime. He's an uber perv that wants to have sex with anything that has two holes. They didn't waste any time on him. Yukina, Yuya's childhood friend and obvious romantic interest, is another of your cook-cutter characters. Boy has a childhood friend that's a girl but comes off as very boyish. Eventually one of them moves, then one day they are reunited and she's suddenly very feminine, with a large chest and curvy body. And apparently she can see ghosts, for some reason. It's never explained, like pretty much everything else in this show. \\n\\n\r\nThen there is literally the worst character in an anime, Hiyori. She's the ghost that causes all the trouble in the show. She's apparently a girl who was killed when she was hit by truck-kun (literally the only good thing about this show is seeing her get hit by the truck in the ED). She remembers nothing about her life, only that she loves Yuya. She wants to go to heaven, but can't. For some reason you can't go to heaven in this world unless you have sex with your love. Literally nothing about her is explained in the show. There's one scene where Yuya tells Mitsuki (who is possessed by Hiyori at the time) that him and Yukina would go to another kids house, and that kid would call him Yuya-Oni-Chan. Hiyori seems to think it's her, but most viewers probably picked up by that point that they didn't know each other when she was alive. The ED makes it pretty clear she's your typical horny girl character that stalks the male character, only she dies in the process. She has no redeeming qualities. She literally steals and ruins a young girls life and forces her to commit incest just so she can go to heaven. Oh, and if Mitsuki doesn't oblige, she'll die and they'll both go to hell. She constantly rapes Mistuki to fill her love gauge that builds steps toward heavens gate, and even tries to use Mitsuki's body to rape Yuya. She's a terrible character. \\n\\n\r\nThe show overall is a mess. It starts off very lewd, and the viewer may think they're just watching some hard ecchi/borderline hentai show, something they could just turn their brain off to and enjoy. Then it quickly starts trying to be a heartwarming, emotional show about family, love, and life. It fails at that, too. The show has no advancement in plot. Hiyori keeps insisting that having sex with Yuya is the only way this thing will end, yet that never happens and the love gauge fills. Eventually Hiyori goes through the gate and you, the viewer, believe that this hell is over. Then she comes back. Did you think you were free, Mitsuki? Nope! There's another floor that needs to be completed. Clearly the staff thought this anime would be popular enough to warrant a second season, and didn't feel any need to conclude the show. \\n\\n\r\nThis a truly awful show. No one should watch this show. Anyone that does and likes it should not be trusted. Save yourselves and watch something else.",
            "date": "2015-07-31T17:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 194843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3724853.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/smokeyjoey8",
                "username": "smokeyjoey8"
            },
            "url": "https://myanimelist.net/reviews.php?id=194843"
        },
        {
            "content": "Art style was great 90% of the time, although Mitsuki's face was a little off on the edges in some scenes.\r\nStory was barely there, as it was an excuse to throw in some more ecchi, although it was the only reason for her actions.\r\nSounds only get a 5 from me, as her voice was sometimes that generic high pitch. Although her normal talking voice was not. That was good.\r\nHiyori was probably one of the characters they needed to explore most, but never did. Mitsuki and her brother are pretty generic, but hey! Still nice. They only got a 6 for that reason. Otherwise, most oftheme are just fine.\\n\\n\r\nOverall it is a 7. It's not too good, not too bad. I would recommend it to ecchi fans, but remember! It's not borderline hentai, you can't use this as hentai. Don't come into this expecting that. It's a bit much sometimes, though.",
            "date": "2015-05-22T15:35:00+00:00",
            "helpful_count": 5,
            "mal_id": 188563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/tyone123",
                "username": "tyone123"
            },
            "url": "https://myanimelist.net/reviews.php?id=188563"
        },
        {
            "content": "When i started this show i was pleasantly surprised, because my expectations were extremely low.  The first few episodes were really lewd, pretty funny, and the \"gimmick\" seemed like it could provide with some material to craft gags and possibly even *gasp* a story around.  To put it simply, ImoCho is a really good terrible show.\r\nBecause it's bad, when you measure it objectively.  It's just a succession of tropes and vapid unoriginal drama.  However, it is a show without pretension.  It knows it's terrible, it's not trying to be artsy or anything, it's just how it is.  And that'srefreshing when you compare it to LN adaptation trash that's just as bad as this but has the gall to try to \"pretend\" like it's good.  \\n\\n\r\nSo what makes this bad show entertaining?  Well for starters the lewd parts are well-animated and unrestrained.  You won't have to settle for shitty panty shots here; you may even get slightly turned on here and there.  There's also a good amount of laughs to be had, mainly driven by Hiyori, the only good character in the series.  She's very cute!  The soundtrack is outstanding; it really drives the humor.  It too is without pretension, and sounds like it's been generated in a day or two with cheap midi samples, but it fulfills its purpose to perfection.  The \"drama\" is completely retarded, so you can watch it ironically and find some enjoyment there too.\\n\\n\r\nThe biggest issue with this series is that it runs out of steam half way through.  The sexy scenes become rarer and rarer, and the \"drama\" takes more space over the humor.  Enjoyment drops like a stone and the ending is, as you would expect, a complete turd (i think i predicted the last 10 minutes perfectly).  \\n\\n\r\nNot recommended unless you are extremely bored and your backlog has nothing in it.",
            "date": "2017-02-15T22:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 240680,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/summitsama",
                "username": "summitsama"
            },
            "url": "https://myanimelist.net/reviews.php?id=240680"
        },
        {
            "content": "First of lets say if there is not gonna be a second season the score wont be as high. This review doesn't have any spoilers.\r\noverall I think this story is very good, but there are some problems I have with this show. 1) they've never showed the back story or the memories of hiyori. 2) didn't have a proper conclusion to any of yuuya's relationships with any characters.\r\nThe art of this show is really good it reminds me of Boku wa Tomodachi ga Sukunai.\r\nthe sound also amazing!!! I really love the most of the songs: the opening, the ending, and some song they use duringthe show!!! the voice acting is as good as the sound; they suit the characters.\\n\\n\r\nthe character are lovable and rememberable (if that's even a word :P) and attachable, as they would make u feel happy, sad, or angry.\\n\\n\r\nAll of this adds up to give u the most enjoyment you will ever have watching this anime!!! I say this anime is worth the time!!!! :D",
            "date": "2014-04-16T23:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 140253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/quentin464",
                "username": "quentin464"
            },
            "url": "https://myanimelist.net/reviews.php?id=140253"
        },
        {
            "content": "I just finished the current season of Saikin, (Recently, My Little Sister is Unusual) *THIS MAY CONTAIN SPOILERS*\r\nHere's my review\r\nA romance comedy, a girl named Mitsuki Kanzaki lives with her step-brother Yuuya after her mother remarries. One day, Mitsuki (Yes she looks like Ruri! But I wish she had her personality) is possessed by the self-proclaimed spirit of a young girl, Hiyori Kotobuki. Hiyori (in Mitsuki's body) must fall in love with Yuuya to move toward the \"Gates of Heaven\" or rather, Hiyori is hoping to have relations with yuuya through Satsukis body. Attached to Hiyoris spirit possessing her, is a chastity belt, that hasa gauge that feels up every time Hiyori is more and more satisfied emotionally or something, which is always on Mitsukis body instead of normal underwear and for some reason never puts normal underwear underneath even though she complains somebody might see it, everything is pretty much exposed because of it if her tiny skirt just so happened to lift up. If the chastity belts Gauge stays still and does not get what the gauge needs to fill, Mitsuki will die as well. (Poor Mitsuki right?)\\n\r\nAnywho, the fan service in this anime is well over 9000, many moments when you see skirts lift up and/or have times where Mitsuki gets sexually harrassed by Hiyori, even so it's a decent anime with some good humor, a nice plot and the characters are alright. Take away Yuuya getting slapped 200 times for being in the wrong place at the wrong time, or just being brought into an awkward situation by force (Just like almost every Anime) and it's a great series, Yuuya is a cool character, acts like a good brother towards his new step-sister even though he's always been alone, he tries to help her as much as he can if she's feeling down or feels she needs to talk about something, he's a good guy. Mitsuki is pretty moody at times, kind of a tsundere I guess but not as bad, but she's cute and has her nice side as well and you feel for her as you watch the series for what she has to go through. Hiyori on the other hand is bubbly, fun and charismatic and all she wants to do is get into Yuuyas pants, if she wasn't a spirit I'm sure she would just jump him and rape the guy.\\n\r\nThat being said it was a pretty good story, will probably watch a second season if it had one. It had some pretty damn funny moments in it as well.\\n\r\nRecommended for those who like fan service, comedy, romance, splice of life, etc.\\n\r\n7.5/10 for me.",
            "date": "2014-03-27T20:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 137365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1384699.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/burnsanimal",
                "username": "burnsanimal"
            },
            "url": "https://myanimelist.net/reviews.php?id=137365"
        },
        {
            "content": "Ok, weird anime is weird.\r\nThat´s pretty much all I can say about \"Saikin, Imouto no Yousu ga Chotto Okashinda ga\".\r\nI mean, look at the plot: A girl is obligated to wear a chastity belt until she can seduce her older brother (of course, not blood related) and send her ghost friend to heaven.\r\nIt´s pretty stupid, but I always give a try to stupid looking anime, because they might actually make me laugh. And this anime...made me laugh, at least a bit.\r\nStory: 6\r\nLook, even though there seems to be a story, most of the anime is just fanservice, scenes where it looks like I´m watching avery softcore hentai. There´s almost no development during it´s entirety, which is usual in these kinds of adaptations. Sometimes, I really didn´t know what I was watching, and I felt like rage quiting the episode right then and there. Still, sometimes it was actually fun. Sometimes.\\n\\n\r\nArt:5\\n\r\nEven though \"5\" means \"mediocre\" on MAL, the art of this anime is basically what the anime itself is, average. It looks like the art-style I´ve seen in so many other anime that sometimes I wonder if they´re all set in the same world or something. Not even bringing in the characters, that look like super generic characters. Sigh...\\n\\n\r\nSound:6\\n\r\nWhat can I really say about the sound? It wasn´t bad. \\n\r\nI have the habit of always listening to the OP and ED in each episode, so I eventually get them in my head, but I can say they weren´t bad. They were catchy and that´s what matters.\\n\\n\r\nCharacter:6\\n\r\nEven though this is a 6, the characters were really generic, as in they fit in all the existent character tropes, and they look like (yet again) characters taken from other generic anime series.\\n\r\nFirst, we have the \"Bland and Generic Male Protagonist That Lacks Balls\", if you really like this type of character, you can find him in about 90% of light novels.\\n\r\nThen, we have the \"Main Female Protagonist Who Faints Ignorance Of (Not Blood Related) Older Brother, But In Reality Is Just Being A Tsundere And Actually Wants His D\". The name says it all.\\n\r\nBesides them, we have other generic characters, like: \"Big Boobied Nee-san Type Childhood Friend That Also Wants Generic Male Protagonist´s D\", the ever lovable \"Deadpan Girl That Knows A Lot More That What She Leads On\", \"The Happy-Go-Lucky And Stupidly Perverted Best Friend\", and of course \"The Perverted Girl That Likes To Sexually Molest Other Girls\"...\\n\r\nYeah, all lovable characters, that we *really* love so much!!\\n\\n\r\nEnjoyment:6\\n\r\nSurprisingly, I actually enjoyed watching this, even though it was bland and generic, it wasn´t bad.\\n\\n\r\nOverall:6\\n\r\nI think that this series was just weird overall, and I seriously tell you to think twice before watching it. If you like ecchi that tries to be over-the-top but fails, then this is the anime for you. If you actually want to watch anime that has over-the-top ecchi then how about watching \"Shinmai Maou No Testament\" or \"KissXSis\".\\n\r\nOh well...\\n\r\nJust have that in mind.\\n\\n",
            "date": "2016-09-13T04:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 228951,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5251804.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AndriushaRi",
                "username": "AndriushaRi"
            },
            "url": "https://myanimelist.net/reviews.php?id=228951"
        },
        {
            "content": "I think I might've gotten cancer from watching this godawful anime. Lord have mercy... Am I going through a masochistic phase of some sort, as I have also watched School Days two weeks prior...? And that one already annoyed me to no end (altough the ending was pretty great lmaooo)\r\nBut THIS...\r\nOkay first of all, why are the Japanese so obsessed with portraying these sexualized brother/sister relationships - but they're almost NEVER even related by blood?? I mean sure, they're trying to make it ok, or, you know...make it seem like more of a coincidence than a weird fetish. But they do this every time andthat's my problem. I have seen this countless times and I'm sick of it.\\n\\n\r\nLook I'm really not into incest. But by making romantically involved characters actually blood-related (Game of Thrones is a good example) it would at least cause some drama that I'd actually be interested in watching. This step sibling formula is so overused that it's just beyond belief by now.\\n\\n\r\nSPOILERS AHEAD\\n\\n\r\nHere's all you need to know:\\n\r\nSo there's this one girl named Mitsuki, who suddenly got herself an older 'brother' called Yuuya. Then there's this other girl which I'm just gonna call Ghost-chan. Ghost-chan died without confessing her love to Yuuya, which is why she cannot rest in peace. And so she haunts Mitsuki, makes her wear a ~magical chastity belt for some fucking reason and also casually has sex with Mitsuki every now and then to like...idek...charge the belt with...the power of yuri- I mean...satisfaction (?) I HAVE NO IDEA. But ofc it's not enough as long as Ghost-chan (who will possess Mitsuki's body whenever she pleases) doesn't get/sleep with her crush Yuuya. Yep. That'll definitely be my biggest worry too, once I die.\\n\\n\r\nThe characters aren't just immature and super easily turned on by random shit, nah, they're also downright stupid. They have such unbelievably dumb moments sometimes, which is shown through the conclusions they draw for themselves and I just...wanted to cry every time.\\n\\n\r\nI felt really sorry for Mitsuki though, and I hate the anime even more for how her situation is handled. She's embarassing herself multiple times; She falls on her face for no reason at least two times per episode, she is kinda raped by a ghost a few times and that fucking belt even physically hurts her at some point. But yeah OF COURSE she starts developing feelings for Yuuya herself. Mhm, that's how I like my anime girls best: Totally degraded -.- And I know this is Ecchi, but please...just don't do it like this. Mitsuki clearly isn't having fun most of the time, and I definitely didn't have fun seeing her like this.\\n\\n\r\nBut why didn't I rate this bullshit even lower?\\n\r\nBecause, the art is okay I guess - as well as the sound, also very few lines were actually funny. The show even made me snort out of sheer disbelief 2-3 times, like when they referred to the Reaction Guys meme :'D But that's about it. The ending is also super bad and makes no sense, just like the whole thing. I'll never watch it ever again.\\n\\n\r\n(A lil' bit of trivia: There's a live action movie which is actual porn. I'm not the least bit surprised.)",
            "date": "2018-01-02T13:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 267212,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/175367.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lawli-Pop",
                "username": "Lawli-Pop"
            },
            "url": "https://myanimelist.net/reviews.php?id=267212"
        },
        {
            "content": "This show honestly tries too have the cake and eat it too and it kind of ruin a part of the main show. \r\nRecently My sister is Unusual isn't a bad show. Their is certainly worse. But with a mixture of elements done badly it just kind of leaves the show in an awkward state. \r\nThis show is very much Echi but at the same time it censors itself. It has stuff like shots of the MC's chastity belt but it censors it. It will censor the most random stuff at times too. I don't know why if they aren't o'k with showing sexual scenesthen why would they even put them in the show. They either should have gone full on Echi/Hentai or just not put them in the show at all.\\n\\n\r\nThe Ghost chick ( Hiyori) Is kind of an awful character for the most part of the show. I still enjoyed parts of her. But she can just be so insensitive.  Hiyori Doesn't even seem to care that she has basically made Mitsuki into a hostage. If Mitsuki doesn't help her she will die because of Hiyori and she doesn't even seem to care as much. Hiyori also has gone about and ruined Mitsuki's life. It just kind of annoying and makes me dislike her.\\n\\n\r\nMitsuki had a calm and alright life. But Hiyori came in and has put Mitsuki into embarrassing situations such as make Mitsuki Wet herself and having too Pee into a flower vase. It is just annoying. \\n\\n\r\nYuuya also tends to just be annoying as can be. He is so oblivious and dense it's annoying.  He tends to always force Mitsuki to other places cause he thinks something is wrong even when she saids she is alright.\\n\\n\r\nI honestly think this show would have been a better show. If instead of Hiyori wanting to get with Mitsuki brother she wanted to get with another chick. So instead of having Mitsuki want to date with her brother she starts getting emotions for a different girl in the show. So instead of MitsukixYuuya it would be someone like MitsukixYukina.\\n\\n\r\nI would honestly love to see MitsukixYukina a lot. I don't like the brother. Hell i wouldn't mind instead of her getting a Brother she gets Yukina as her sister. Yukina is an awesome character that i feel would be better fit for Mitsuki. \\n\\n\r\nOverall it's an alright show that could have been better.",
            "date": "2017-12-06T20:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 264676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264676"
        },
        {
            "content": "I gave Recently, My Sister is Unusual a watch in search of outrageous, original ecchi lulz. In this I was sorely disappointed, not least by the lack of more frequently inventive use of the show's premise to create entertaining and memorable scenes.\r\nThat's not to say it was a terrible show. It cut a light-hearted dash among the rest of my queue for this season, which involved a mixture of drama, intensity, violence and plot-twisting, whereas Recently, My Sister is 90% warmly predictable high-school bread and butter, and 10% risqué scenes that range from mild to fantastic, though unfortunately the latter was pretty darn rare. Ican see why some liked the characters, but for the amount of time we're spending watching them interacting each episode, I honestly think they could be far better. \\n\\n\r\nThe basic premise is outlined in the first episode, and from there on it's a pretty slow procession of largely trivial events played out by a very white-bread, boring male character (Yuuya), his cutely tsundere little sister (Mitsuki) and her uncontrollable ghost (Hiyori), plus four or five other characters who are even more forgettable, including Yuuya's buddy, whose provision of the typical perverted idiot-buddy role fostered two or three chuckles across six hours of content. Really, we're definitely not talking anything above average here in my opinion even by slice of life moeblob standards, and when it comes to the 'plot', if I were to be brutally honest, it's an entire season of pretty mild filler without any real qualities compared to other anime of the genre. Additionally, the visuals and soundtrack are really quite unimpressive as can be expected from much high-school anime.\\n\\n\r\nThe problem for me is that because of how boring and conventional the dynamics and characters were, I placed my hopes for the show in bold, quasi-incestuous ecchi entertainment. It's really unfortunate that most of what you get in Recently, My Sister is simply tame and done to death, consisting of tropes you can find in hundreds of other anime: Falling over in awkward positions, blushes, accidental boob-touching, pantyshots (in this case chastity-belt shots) and off-screen slaps to the cheek alongside screams. There are four or five scenes which step out of this pretty dreary routine (including the brilliant 'Metal Gear Yuuya'), but unfortunately they're too few to really make a difference and bump it up to 'upper average' for me when compared with other shows. While this one had the potential to be a total blast like Noucome, it ended up just being too mild, reserved and conventional to really achieve anything.\\n\\n\r\n3/10",
            "date": "2015-03-26T05:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 183446,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3829377.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Renegatz",
                "username": "Renegatz"
            },
            "url": "https://myanimelist.net/reviews.php?id=183446"
        },
        {
            "content": "\"Little sisters are difficult.\" - Kanzaki Yuuya.\r\nCouldn't agree more with that.\r\nStory : 8\r\nKanzaki Mitsuki is our female heroine; she's shy and cute. Her mom and Kanzaki Yuuya's father re-married. Having both their parents re-marry is obviously an awkward situation. Not to mention they're forced to live in one roof now, by themselves at that. 'Course they'd look strangers in both of their eyes. Saikin's plot is kinda original for me; it's refreshing. But the re-marrying stuff is kinda overused already. Beware on the ecchiness it contains. It does have censoring, though. Black random things devouring half of your screen, moving keyholes within Mitzuki's body. Bewarned: DO NOT WATCH IT IN PUBLIC(I needed to caps it). Back on the plot; Mitzuki discovers a lost soul bound to Earth because of her love for Kanzaki Yuuya, our male MC. Kotobuki Hiyori is the ghost girl who needs to get lovey-dovey with Yuuya to be able to cross the stairs to Heaven. Mitzuki gets caught up and will have no choice but to go with the flow.\\n\\n\\n\r\nArt : 7\\n\r\nSaikin's art is fairly good. Faces with sharp edges are done to make characters look cute, which is not bad at all. Everyone has big-puppy eyes to emphasize the \"cute\" drawing more. CG's are used a lot for backgrounds. Like for the cars, animals, and etc.\\n\\n\\n\r\nCharacters : 7\\n\r\nOf course, we always need are ever-so-densed male MC's in every show. And that's where Yuuya comes into. A guy who's dense as a rock, not too original if you ask me(almost every show has dense MC in it, though). Kanzaki Mitsuki who fulfills the role of the ever-so-moe little sister in the show. She's a tsundere at most times... No scratch that, she usually lashes out on Yuuya, maybe because they haven't known each other for too long. But later in the show she'd... You know, will soften up too. Kotobuki Hiyori, our girl ghost who's mind is full of ecchiness. She often complicates matter for the siblings. Honestly, Saikin's characters are not that original, but they're still good. \\n\\n\\n\\n\r\nMusic : 6\\n\r\nI didn't like them, so didn't paid too much attention to the music.\\n\\n\\n\\n\r\nEnjoyment : 8\\n\r\nI really enjoyed the show. Had some laughs I haven't had for a long time(this sums up how lonely I am). It's been a long time since I've watched a series this ecchi, and it made me feel so refreshed. That's probably why I enjoyed it this much. Nevertheless, the plot's not that complex, so you can immediately grasp the story with just the very first episode.\\n\\n\\n\\n\\n\\n\r\nOverall : 8\\n\r\nThe way how a ghost interferes between what should be a normal sister-brother relationship is quite amusing. I mean, it doesn't count as incest, right? I'm sure they made the adjustment of re-marrying stuff to stay in the \"legal track\", and to not count as incest. But anyway, it's still certainly entertaining for me. Apart from the ecchiness with half-censoring, it's safe to watch Saikin... really, trust me.  Of course, don't go watching it with your sister, you sis-con! JK. That concludes my very short review for Saikin, Imouto no Yousu ga Chotto Okashiinda ga.\\n",
            "date": "2014-07-09T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 151149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=151149"
        },
        {
            "content": "There are people that review sleazy anime with standards that would be more fitting for top shelf anime. These people do not understand the concept of reviews because an anime , as well as any product, should be reviewed with standards appropriate to its medium and genre. With that opening out of the way, let's talk about saikin, imouto (etc etc.) \"Recently my sister has been acting unusual\";\r\nART (And animation):\r\nIt has some of the most boring, pedestrian, mediocre art and animation I've ever seen, on the plus side I didn't see any blatant animation shortcuts but it makes sense that they didn't  take anybecause they use the most typical, low effort backgrounds and settings possible, bar a couple of exceptional scenes (Aquarium, \"heaven\", etc.).\\n\\n\r\nBecause of those rare instances, I would say it goes from a 5 to an 8... and yes, those few rare instances are beautifully rendered and gorgeous to look at. \\n\\n\\n\r\nCHARACTER (With little to no spoilers);\\n\r\nHere is where we enter a strange area, these characters, particularly one , are very fetishized, I WILL EXPLAIN LATER, WAIT FOR IT... but don't get me wrong the story is actually very good but it is very reliant on the characters, there is a lot of pathos and drama to be had here... the core premise of the anime  is that there is a ghost (Yure) that is trying to achieve ascension to what is heavily implied to be 'Heaven'. In order to achieve this, she must (Engage in sexual acts with the male lead...? we don't know (?????????)) and there we have the problem. We don't really know much about this character or her plight.\\n\\n\r\nShe is the force that moves the plot forward from the beginning until the end, and because we know so little, we are forced to just go along for the ride without having even the basic knowledge necessary to identify with the character.\\n\\n\r\nThis character is called Hiyori and she is the best part of the anime.\\n\r\nShe is bubbly, cute, playful, jealous, dynamic, annoying, interesting and more... she is a legitimate character with a seemingly tragic backstory. Without her the anime would have nothing to do, but as I said she is shrouded in complete mystery right down to her true identity which we never find out. Basically it is an unopened box which becomes a bit of a hassle as time goes by.\\n\\n\\n\r\nThe other two leads are;\\n\r\nMitsuki; A young girl who's mother has just remarried. She is a massive buzzkill the entire show and a very hateable character. She is not Kirino-level bitchy but she comes close... she is very rude, very unappreciative and just an overall drag to have in any scene. Worst of all, she is incredibly inconsistent with her motivations. Sometimes she hates everyone and treats everyone like garbage... other times she is friendly and wishes she had more people around her.\\n\\n\r\nIt is not interesting, it is not cute. She is the worst part of the show... unfortunately the show mainly takes place from her point of view. \\n\\n\r\nYuuya; A fairly bland, self-insert Japanese character. I could not tell you a single one of his characteristics beyond \"He is a young Japanese man\" ... well, he has one trait; He is INCREDIBLY patient with his horrible new sister. He is a Zen-rock given how much abuse he tolerates from the Mitsuki character.\\n\\n\\n\r\nPLEASE TAKE NOTE:\\n\r\nThere are two supporting female characters that spend the entire show \"Foreshadowing\" their involvement in supernatural affairs. This never gets paid off, not even a little bit. It is a complete waste of time so I did not even mention their names. \\n\\n\r\n I was like \"Oh okay, I think I see where this is going\" in the first episode when these characters are hinted to \"Know more than what they are sharing\" ... but even in the FINAL EPISODES they're still doing the foreshadowing thing with no end in sight for their shenanigans. Terrible characters that don't add up to anything.\\n\\n\\n\\n\\n\r\nSTORY;\\n\r\nAnd now let's talk about the elephant in the room. This is an ecchi anime that goes so hardcore so as to almost be hentai.... and that's not wrong. I am a man and I enjoy both ecchi and hentai... however, this specific anime is leaning heavily towards the disturbing fetishistic.\\n\\n\r\nThere is a strong leaning towards urination fetish and that's just.... not for me. There is also a strong undercurrent of BDSM going on ... but the worst part is;\\n\r\nThis reaches its highest points in the first 3 episodes and then it tones way down.\\n\r\nYes that's right. It goes full on fetish-mode as it's introduction to the audience.\\n\r\nI was like \"WTF?\" when I watched this, it takes some very weird turns.\\n\\n\r\nThat being said, if you can soldier through the first few episodes, you will be rewarded with a fairly quirky and unique screw-ball ecchi comedy that almost completely redeems itself. It has some great situations and even some solid comedy here and there. Honestly if more of the show was like the middle parts, it would be a fantastic show but alas, it is not.\\n\\n\\n\r\nThe beginning is very poor, rather than easing the viewer into the fetish it wants to explore, it hits you like a brick to the face with no build-up or tone... and that is the word of the day; TONE. In the first few episodes there is severe tonal discordance which makes it very difficult to watch or recommend. \"It gets better\" is not enough.\\n\\n\r\nAnyway, the ending of the show is a massive cop-out. Yes, I understand that they want to make more money, yes I understand it is probably based on a manga that is on-going. Yes, I get that we never knew much about the situation to begin with but none of that excuses the complete non-ending that is given to the audience. It is absolute garbage.\\n\\n\\n\\n\r\nTo summarize the story;\\n\r\nHORRIBLE beginning (First few episodes)\\n\r\nHORRIBLE ending (Last two episodes)\\n\r\nPretty good middle parts.\\n\\n\\n\\n\r\nSo, to conclude, do I recommend?\\n\r\n- No, do not watch if you are sensitive to fetish scenes, I would totally understand if someone didn't even bother getting through the first few episodes. There is a serious \"Wall\" before it \"Gets better\".\\n\\n\r\n- I do not recommend if you are looking for a light-hearted comedy show. This gets dark pretty often and the comedy is off-set by macabre set-pieces.\\n\\n\r\n- I do not recommend if you are looking for a serious, drama orientated show. The tonal dissonance will get on your nerves fast.\\n\\n\r\n- I do not recommend if you are looking for fap material. There is much better material out there and it is not as padded as this.\\n\\n\r\n- I do recommend if you meet the following criteria;\\n\r\n* You are very curious to see the middle portion of this anime, which as I said, is very good.\\n\r\n* You have high tolerance or maybe even a desire for BDSM and urine fetish anime (I don't).\\n\r\n* You want to see how spectacularly bad the beginning and ending of the anime are.\\n\\n\r\nBasically, almost no one should watch this anime.... I enjoyed the middle portion which was really quite good, but the fact that it begins and ends so horrendously means I can't recommend in almost any circumstances.\\n\\n\\n\r\ngg.",
            "date": "2016-02-19T14:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 211267,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061511.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dominick_Destine",
                "username": "Dominick_Destine"
            },
            "url": "https://myanimelist.net/reviews.php?id=211267"
        }
    ],
    [
        {
            "content": "Skip this anime else...........\r\nHear to my rant to convince yourself to do so..\r\nOk 1st of all lets start with my expectations before watching this anime.\r\nI wanted to watch a good rom-com preferably harem themed. I was okay even with one-on-one rom-com if it had good story.\r\nStory[1/10]:\r\nThe story had some potential. Initial episodes were quiet good and I thought the series might build on a good foundation but alas that didn't happen.\r\nThe story ends with an anti-climax which is totally crap. Its like \"WTF, Cmon, really??\"\r\nArt [9/10]:\r\nThe only thing that's good in this trash. Honestly Mitsuki was one of the cutest characters I have seen. Theanimation quality is good. Not the best but definitely good.\\n\\n\r\nMusic [5/10]:\\n\\n\r\nThere's no memorable background music or so. Its just plain and uninteresting. Songs are average at best.\\n\\n\r\nVerdict [4/10]:\\n\\n\r\nMitsuki is easily the worst immouto I have seen so far in my journey of 120-Animes. I feel sorry for the poor guy yuuya. Her non-stop pouting and annoying mood spoils the whole anime. Now I'm normally a very forgiving person. I'm very friendly and helpful. Unless somebody troubles me a lot I don't get angry. But here Mitsuki just throws that limit out of the window. I mean cmon this is not a shoujo anime where you can just keep clobbering the guy all the time. and if somebody says thats not her fault its the chastity belt. Then the author should have got rid of that thing itself because its spoiling the whole anime. Theres no conclusive ending, mitsuki doesn't get close to her brother neither does her brother end up with some other girl.\\n\\n\r\nYou put up with ill-mannered Mitsuki all the time hoping to see a conclusion in the last episode. And when you are hoping that its time to dump that ghost and have a good ending with the immouto the anime gives a solid KO punch on your temple!!\\n\\n\r\nThis anime is a waste of time. I feel robbed of my time. Even if you are just an ecchi fan stay away. This anime really isn't worth at all.\\n\\n\r\nI have given this a 4.\\n\\n\r\nIf I give a 6, I mean that the anime is BORING.\\n\r\n4=Disgusting. STAY AWAY. \\n\\n\r\nFor incest titles I suggest: OniAi, Oni-chan no koto suki ja nain da kara ne, Koi Kaze , To love ru series.\\n\\n\r\nHave a nice day. Thanks for reading.",
            "date": "2017-01-01T19:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 237215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675412.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/hachiman09",
                "username": "hachiman09"
            },
            "url": "https://myanimelist.net/reviews.php?id=237215"
        },
        {
            "content": "This is the worst ecchi I've ever watched.\r\nSeriously, this is such a bad excuse of an anime it makes me so mad.\r\nHere's the plot in a nutshell\r\n>Dead girl or whatever possesses a girl who's living with her brother or something\r\n>The dead girl has feelings for the moron brother and wants to bring them to fruition through the ill-fated girl she's possessing\r\n>She straight up took her freedom away from her and put a chastity belt on her that won't even allow her to pee for Christ's sake\r\n>Now she's faced with having to put up with it or else she will die, so she has to giveup her virginity and dignity as well\\n\r\n>The dead girl, despite having angel wings or something, isn't bothered by the moral consequences in the slightest\\n\\n\r\nSeriously, I'd have watched this if it was consensual, but this is kidnapping and detention with no sugar coating.\\n\\n\r\nI thought I'd at least watch it for the girl-on-girl shit but it's too much and I'm giving up.\\n\\n\r\nPoop in the form of anime, if you ask me.",
            "date": "2016-09-03T19:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 228239,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2138953.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/KasaneD",
                "username": "KasaneD"
            },
            "url": "https://myanimelist.net/reviews.php?id=228239"
        },
        {
            "content": "First off, this anime is more sexual than most I've seen (though it's not as bad as something that's just porn). If you don't like that at all, then this is not for you. I did, however, laugh during this anime. I even felt sad during one episode. Well it's not the kind of show that you can really recomend to anyone, I'm glad that I watched it. My 7's are probably most people's 5's or 6's, so keep that in mind while looking at my score. It's not a bad show, it just doesn't jump out as spectacularly good.",
            "date": "2014-04-30T13:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 141877,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2520783.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/yat282",
                "username": "yat282"
            },
            "url": "https://myanimelist.net/reviews.php?id=141877"
        },
        {
            "content": "I don't even know where to start as the series itself is alike. Fan service is poor but plotting is worse. The ghost has chosen this step-sister because of the guy she aims for, but until the end it doesn't even bother to describe how she's related to the guy. It doesn't talk why such characters can see this ghost, and why ending with having some mysterious characters act as if they set up the whole plot to happen.\r\nI find it more amusing that the title from where I acquired this series has a tag \"Another shitty sister-manga adaptation\". It filled my hopes in adifferent manner. It is actually shitty and being that honest on the tag is saying something.",
            "date": "2017-07-06T21:16:00+00:00",
            "helpful_count": 0,
            "mal_id": 252150,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4074287.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/V503412",
                "username": "V503412"
            },
            "url": "https://myanimelist.net/reviews.php?id=252150"
        }
    ]
]