[
    [
        {
            "content": "If you are reading this review, I assume that you have completed the first season already. Whether you liked the first season or not, I would like to mention that I enjoyed the first season very much and was expecting a lot from the second season in terms of plot advancement, comedy and character development. But what a shame! The quality of the anime dropped a big deal in this season (and so did it's rank).\r\nStory: 5/10\r\nThe second season is not about the pendant or developing relationships anymore. You can't blame the studio as it is just following the manga. This season is focused onOnodera's sister, Haru, who has apparently got a bad impression about Raku as rumors described him as perverted monster of a person.\\n\r\nThe premise sounds interesting but Haru is not introduced until 7th episode. That's more than halfway of the season. If you skip till episode 7, you'd miss nothing!! Literally there is no advancement in the plot and each episode is just dragged on with no conclusion. The whole production feels like one big series of OVAs.\\n\\n\r\nArt: 8/10\\n\r\nThe only element because of which I was able to go through all 12 episodes was the eye dazzling art.\\n\\n\r\nSound: 7/10\\n\r\nLiSA's Rally Go Round is a pretty good OP, but I didn't really liked the voice acting.\\n\\n\r\nCharacters: 6/10\\n\r\nTo be honest, I really liked the characters of the show in the first season and thought they were pretty funny. But this season made me literally dislike the characters. Raku is more dumber than ever. Most of the episodes are devoted to a single character, sometimes Chitoge, sometimes Marika. But when it comes to plot progression or romance development concerning anyone or the promise girl, there is no advancement from the first season.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\n\"It's true there is no or very little plot development but Nisekoi is supposed to be enjoyed, it's damn funny\"\\n\\n\r\n\"Nisekoi is the funniest anime I'v watched. It has much fanservice as well, It's a must watch\"\\n\\n\r\nI don't care whatever the Nisekoi fans will say, this season was really a waste of time. In terms of comedy, the first season was funny but in this season, the comedy is terribly forced and jokes are thrown just for joke's sake.\\n\\n\r\nNisekoi season 2 is watchable for big Nisekoi fans. However, if you weren't a fan of the first season, don't bother watching the second season.",
            "date": "2015-06-27T21:12:00+00:00",
            "helpful_count": 285,
            "mal_id": 191526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4246269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rkpandey",
                "username": "Rkpandey"
            },
            "url": "https://myanimelist.net/reviews.php?id=191526"
        },
        {
            "content": "I don't usually write anime reviews, but after seeing one of my favorite rom-com harem series turn into donkey ass I feel the need to write something for this one and warn others about this atrocious series that ruined itself.\r\nAh, the story. This element might have singlehandedly brought this anime down. The 2nd season of Nisekoi has the \"same\" plot as the 1st. A Yakuza head's son by the name of Ichijo Raku has a pendant, and he doesn't know who has the key to opening it. The one with the key is his \"true lover.\" Throughout the story we see a bunch of girlsjoin his harem with different keys. \\n\\n\r\nThe first season at least had SOME  plot progression, whereas in the 2nd season you might as well watch paint dry on a wall. In the 2nd season, its not about the pendant anymore, nor is it about him developing better relationships. Now, although you cannot blame the studio for merely just following the manga, the story is now focused on Onodera's sister who goes by the name of Haru. This ratchet little ignorant pitbull of a character gets saved by Raku from a bunch of gangbangers and refuses to believe that it was Raku who saved her. The only reason why she hates Raku is based off of the rumors she heard from others that described Raku as a perverted monster of a person. \\n\\n\r\nOkay, premise is \"alright,\" its safe for the audience to hope that we can see some character development within Raku and Haru right? Wrong. Not only does Haru get introduced in the 7th episode, which is more than halfway throughout the 2nd season, we get nothing before it! If you were to start at episode 7 in the 2nd season, you'd miss nothing. The episodes before are merely fillers. Even after Haru joins the harem, they are so focused on trying to push her to be the Main Focus that we get next to no character development between Raku and anyone else. It is now episode 11/12 and I have yet witnessed ANY genuine character development in the anime series except for the episodes that forced Raku and Haru together as the main dish, with a little spice of Onodera.\\n\\n\r\nThe Art is AMAZING. Only reason I made it this far was because of the art. It is merely eye candy, SHAFT always does a fantastic job with the artwork. \\n\\n\r\nSound is great! However nothing too special. I'd say its more on the better side because of how fitting the sound is with everything thats going on. \\n\\n\r\nThe characters? Oh right! This show was a harem right? Right right, we had characters other than Raku and Haru and Onodera. \\n\\n\r\nRaku: The same thickheaded character as before. His blatant ignorance to everyone's feelings toward him makes one want to rip their hair out, but he cant be hated as a character. He is lovable and charming to the max when he gets screentime. \\n\\n\r\nHaru: Eh, I see plethoras of comments talking about how shes the new ship with Raku but I don't like it. Her choices of refusing to believe that Raku is a genuinely good person is stressful to the audience. \\n\\n\r\nOnodera: Onodera is more or less the same as the first season. We see more character development with her and Raku and thats good to see because they are the #1 ship. \\n\\n\r\nLiterally every other girl in the harem: They are now irrelevant and are on the anime purely for the comedic reliefs. \\n\\n\r\nI wouldn't be surprised if the series gets dropped and a 3rd season never comes because I don't know what the mangaka, nor the studio is doing with this series. This show with its comedic scenes had so much potential to be a great comedic harem anime. Now however, the dream is lost. A 5/10 overall seems just about right, although theres this voice in the back of my head that is telling me that I am being too lenient. Lets hope the plot gets somewhere in the future. Cheers!",
            "date": "2015-06-25T14:24:00+00:00",
            "helpful_count": 93,
            "mal_id": 191246,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3976287.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Yuzaki",
                "username": "Yuzaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=191246"
        },
        {
            "content": "Oh god this Nisekoi season lol.\r\nIf you enjoyed first season of this show, don't raise your hopes up, cause this season is like a filler.\r\nStory:\r\nThe plot in Nisekoi is actually medicore.  The first season probably entertained you by it's comedy and you can call it romance lol... \r\nSecond s. is worse, while it's still pretty enjoyable to follow it goes nowhere.\r\nThe end felt like it's just begging and honestly there should be 24 episodes not 12...\r\n5/10\r\nArt:\r\nThe art is very nice to look at.\r\n8/10\r\nSound:\r\nOpening is really good along with the ed. The soundtrack overall is at high level so you can just watch this seasonfor art and sound if you're that kind of person.\\n\r\n8/10\\n\\n\r\nCharacter:\\n\r\nWhile the characters are very likable some of their actions or decisions are questionable. Why wouldn't Raku notice that he just got a harem and every girl likes him but he's just like hmm...? In this season some female characters got development unlike males cough..mc..cough.\\n\r\n7/10\\n\\n\r\nEnjoyment:\\n\r\nWas really hyped for this season. Damn  such a disappoitment. It was really enjoyable to watch but it could be so much better.\\n\r\n7/10\\n\\n\r\nOverall:\\n\r\nThis season was medicore-good. It can entertain you but it doesn't progress much where first season left. If you have free time and don't know what to watch, Nisekoi; is a good choice.\\n\\n\\n",
            "date": "2015-07-02T06:19:00+00:00",
            "helpful_count": 76,
            "mal_id": 192031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4448125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Azmou",
                "username": "Azmou"
            },
            "url": "https://myanimelist.net/reviews.php?id=192031"
        },
        {
            "content": "The sequel falls quite low compared to the prequel. \r\nNisekoi: barley gives any progression to the story. It's just 12 episodes filled with comedy.\r\nSure, it is a romance anime. But comedy has dominated it. No wonder it's called Nisekoi (False Love) because there isn't any in it. Yeah yeah, the girls are head over heels in love with Raku but does Raku have a clue? NO. Did he get a clue in season 1? NO.\r\nThough there is a slight progress in the story but that is more related to the past of the character and a hint of the promise. That's all there is, 1.5episodes about the story.\\n\\n\r\nThere you have it. Nisekoi: is meant to be enjoyed as a comedy anime with really cute characters and splendid animation. If you're looking for some good strong romance, you're in the wrong place.\\n\\n\r\nCharacters:\\n\r\nNew characters are introduced. But they get little importance aside from Haru Onodera. \\n\r\nAmong the old characters, whole episodes are devoted to a single character. Sometimes, it is Chitoge, sometimes Marika etcetera. \\n\\n\r\nA few episodes also show more of them in it. But as far as character progression, romance progression, the promise girl is concerned, that's a no go.\\n\\n\r\nEnjoyment:\\n\r\nYeah, I enjoyed the series. Since I like comedy and good animation, Niskeoi: was a nice anime to watch every week. But not an anime that I would watch as soon as it was available. It's the type you'd watch when bored and free, unlike another anime this season (Oregairu Zoku).\\n\\n\r\nNisekoi: does little to progress the story set in Nisekoi. It is full of comedy and filler type episodes. Not much progress about the promise. Mild story progress, nothing that important.\\n\\n\r\nDon't get me wrong, I really like the anime but I also want them to move ahead with the story.\\n\\n\r\nRakuXOnodera FTW!!!",
            "date": "2015-06-27T08:57:00+00:00",
            "helpful_count": 42,
            "mal_id": 191442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=191442"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nNisekoi: has a strange title when you stare at it. It is the second season of an anime that is quite popular, but instead of giving it a number or some kind of continuation phrase, it simply adds a colon to the end of its name. It seems quite out of place, perhaps making you wonder, “Why is that even there?” Traditionally colons in sentences are used in conjunction with lists or highlighting something specific. Or to put it another way, a colon is used when wishing to speak about a relevant thing or set ofthings. But Nisekoi: has nothing after its colon, and the reason for this becomes obvious when thought about briefly: there is “nothing” to say about the show. While this spells certain doom for the anime as a whole, it at least provides the audience with an interesting question pertaining to expectations.\\n\\n\r\nSTORY\\n\\n\r\nNisekoi: takes place shortly after the first season ended. Chitoge, Onodera, Tsugumi, and Marika are back, with everyone still semi-vying for Raku’s attention.\\n\\n\r\nNisekoi (the first season) is a series infamous not only for the nonexistence of romantic and relational developments but also for the insane amount of plot stalling it performs. The first season did this so much to the point that the anime had become synonymous with “keeping the status quo.” Nothing ever progressed because the anime did not want it to; expecting it to do otherwise was almost unfair given the direction it purposefully went time and again.\\n\\n\r\nWith this in mind, think of a grocery store chain called “Nisekoi:” and determine what it generally contains. There are fruits, vegetables, chips, drinks, meats, breads – a never-ending amount of food can be found within such establishments. A person is allowed to expect this because he or she managed to visit its parent grocery store, Nisekoi, sometime in the past. Along the same lines, it doesn’t generally contain cars, clothes, expensive jewelry, computers, and many other objects because grocery stores focus instead on selling products that pertain to their specialty. Now, this does not mean that a grocery store cannot sell these items; it is just that it is known not to. In other words, a person doesn’t go to a grocery store expecting to find the latest sapphires for sale because that is not what a grocery store was designed to offer.\\n\\n\r\nHow in the world does this relate to Nisekoi:, the anime? The second season suffers from what is known as “misplaced expectations.” This is a phrase that is defined as expecting “A” but receiving “B” despite the signs pointing towards “B.” For anime, these signs include the themes, any type of foreshadowing, what the characters represent, genres the show finds itself in, or any other kind of indicator for how the events will unfold. Like someone flabbergasted that he or she did not find diamonds at the grocery store, a person who has “misplaced expectations” when watching a show is not looking strictly at what the anime did but instead what he or she wanted it to do.\\n\\n\r\n“Misplaced expectations” are most often associated with sequels, as it is here with Nisekoi:, because there is already a foundation with which to work off of. Normally a sequel is viewed after the previous seasons have been completed, meaning the audience has already been exposed to certain ideas or details. New projects or unfamiliar territory should ideally be approached with no expectations whatsoever but since sequels have already had some of their signs propped up, it seems as if there have to be some expectations that are simply unavoidable.\\n\\n\r\nThus a difficult dilemma is raised: what is the audience “allowed” to expect? Certain aspects are easier to agree on: Chitoge’s new romantic feelings towards Raku, a return of the cast, and the same brand of comedy are parts of the anime people can nearly unanimously expect to find in the second season. But what about progression of the plot? As has been said, the first season had quite the array of “convenient inconveniences,” so perhaps one should not expect to see any sort of movement of the narrative or the relationships between the characters. Indeed, the structure of the narrative – how the various tales are segmented in an episodic nature – demonstrates the anime’s slice-of-life-oriented framing and subsequently unwillingness to press forward. Yet one can look at it the opposite way; since there was notsuch progression, one might expect to finally see it after so long. Some of the best episodes this season, such as Chitoge reconciling with her mother, Shuu confessing to his teacher, and the investigation of Onodera’s backstory, were executed so well because they subverted the very expectations the anime had set for itself.\\n\\n\r\nSince expectations vary so wildly in degree and importance, the conclusion is that all anime should be viewed through a lens that holds no expectations whatsoever, with the show being looked at for what it attempted and accomplished. To put it differently, in order to avoid “misplaced expectations” one should abstain from having expectations to begin with. In Nisekoi:’s case – as a slice-of-life construct featuring harem, romance, and comedic elements – it performs at a respectable level. The events are sporadic yet relevant; the characters are given appropriate screen-time to interact in multiple combinations; and the comedy manages to be a mixture of visual gags, misunderstandings, and over-the-top personality quirks. At the same time, the anime fails in key areas: the romance is subpar due to repetition, not all of the new additions to the cast feel as “part of the gang,” and there is very little in the way of themes.\\n\\n\r\nSo while Nisekoi:’s plot may not be something worth remembering, the interesting topic that ensues because of it certainly is.\\n\\n\r\nANIMATION\\n\\n\r\nAlthough this rarely happens – and by coincidence, it has happened twice within the past five reviews – this section will be kept shorter than usual. Per SHAFT ideology, Nisekoi: adopts a less-movement-more-style direction in terms of its art and animation. Characters are often standing still, with multicolored lights and colors surrounding their backs while their faces take on a wide range of reactions. The designs maintain their same flair, with Onodera’s plain yet cute looks, Chitoge’s beautiful blonde hair with accompanying red ribbon, and Shuu’s silly cat mouth signifying his carefree nature, with everyone having both school and casual attire to match the correct occasion.\\n\\n\r\nCHARACTERS\\n\\n\r\nDue in part to Nisekoi:’s everlasting preventative measures, the characters likewise often find themselves not developing. Being a slice-of-life outing, this is usually the case; characters do not normally experience drama or introspection of the same level as a psychological thriller, so it is understandable that the majority of their character istheir “character.” Onodera is still her extremely shy yet vastly determined self, Chitoge remains as the typical “tsundere” (with more “dere” than “tsun” this time around), and Marika is as overly obsessed with Raku as she has ever been. However, there are moments where the show provides further insight into the cast. These were brought up previously: Chitoge has the relationship with her mother mended, Shuu adds another dimensionality to his person through the heartbreak he embarks on, and Onodera’s past reveals just how genuine and sweet her feelings are for the boy she loves so much. These are the exceptions, not the rule, but divulging beyond what the characters normally offer was a definite boon.\\n\\n\r\nIn relation to Chitoge’s small plotline, the show actually introduces four new characters, namely Hana (Chitoge’s mother), Paula (Tsugumi’s friend), Haru (Onodera’s sister), and Fuu (Haru’s friend). What is interesting is that Marika seems to be missing a new connection, which leads to two problems that the anime has in regards to the newcomers: their non-harem presence and their eventual nonexistence.\\n\\n\r\nFirst, they are not directly related to the harem. Their inclusion seems nonsensical, since their relation to Raku is nearly nonexistent. To an extent this is understandable since there are already four women on the list. But careful consideration reveals that the new characters are there to highlight aspects of the veterans; Hana brings out Chitoge’s more personal and vulnerable side, Paula demonstrates Tsugumi’s transition from tiger to cub, and Haru makes it abundantly clear how kind Onodera is. Fuu is, once again, an exception. She has implied feelings towards Haru, but she is hardly around long enough to discuss. This is all well and good, but the problem is that none of these girls improves upon the harem nature of the anime. In fact, some even regress it; Hana refuses to mention some important detail regarding Chitoge and Raku’s childhood whereas Haru literally forces Raku away from Onodera. Disrupting arguably the most important facet of the show is nothing more than a negative.\\n\\n\r\nSecond, their removal from Nisekoi: leaves it in an awkward position. Essentially, the new characters, after being introduced and used for their singular purpose, leave the stage to never be utilized again. Fuu’s case is the extreme, with her making around two appearances at most, but this also holds true for Hana, Paula, and even Haru. They show up, do their business, and are never heard from again. It not only makes it difficult to really care about them but also makes them feel less important, as if what they do manage to take part in while they are around holds no merit since, like them, it is quickly forgotten.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme is a big bundle of fun. The whistling, the back-and-forth singing, and fast beat keep the song from ever slowing down, upping the playfulness it provides. Alongside the incredible range of the main vocalist, the piece is not only fitting but a joy to listen to as well. The ending theme is arguably stronger than the OP, matching not only its playfulness but improving on overall catchiness. The “la’s,” very simple beat, and various vocalists working individually and in harmony gives the track the feel-good vibe it was undoubtedly aiming for. Beyond the main OP and ED is a bonus opening theme that precedes Onodera’s magical girl romp and a slew of ending themes – nearly one for each girl – to shake up the formula time and again. These pieces are not as impressive but their inclusion is certainly not unwanted.\\n\\n\r\nThe rest of the soundtrack is mostly filled with background tracks that coincide with the present mood. Standard fare such as jazzy tracks for the laidback times, weird onomatopoeia pieces for the happy ones, and Nisekoi:’s signature guitar plus accordion for those heartfelt moments can be heard. As an OST, it is not as involved or worthwhile as the large amount of EDs to choose from but they at least serve their purpose well enough.\\n\\n\r\nVoice acting for the anime is somewhere above average. Special shout-outs are deserved for Kana Hanazawa as Onodera for her recognizably cute voice, Nao Touyama as Chitoge for her often frustrated speaking, Kana Asumi as Marika for her super-girly way of talking, and Ayane Sakura as Haru for the perfect younger sister performance.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime has another reputation, in that the girls are quite popular. Not just one of the haremettes but all of them are usually seen in a positive light. Sure, everyone has his or her favorite – mine is Onodera – but everyone in the game of love is quite entertaining to see. Onodera’s blushes are the best, Chitoge’s faces are hilarious, and Marika’s calm demeanor despite being downright bonkers would always make me smile.\\n\\n\r\nYet, there was something missing this season. The characters are the same and so is the comedy, but the “magic” never felt present. The main cause of this was due to the shift in perspective; Raku was almost always in the center with the girls revolving around him whereas the second season felt a bit too all-over-the-place. That is, instead of the girls “competing” with one another it felt more like “taking turns,” defeating the purpose of the harem in the first place. It is even worse since the anime does not and will not fully commit to one path anyway, making individual exchanges feel pointless.\\n\\n\r\nAnd despite my harping, I liked Haru’s character. Seeing her so evil towards Raku, based on perhaps one of the most ridiculous misunderstandings of all time, was quite comical. In a way, she acts as the anti-haremette, where she does not want anything to do with him but he always seemed to dote on and care for her more so than any of the other girls. Seeing her flustered beyond belief while ever so slightly becoming comfortable with his presence was likewise a lot of fun to see.\\n\\n\r\nNisekoi: causes people to harbor many valid and invalid expectations when moving from the previous season to the next. Disregarding them entirely, one will find a fun little anime, with some comedic characters, nice music, and stylized art. Unfortunately, the charm from the first season is lost in translation, the plot is lackluster, and the newcomers are rather weak. To summarize, here is what should have been added to its title: “Nisekoi: Not Sure Where to Go from Here.”\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, abstaining from “misplaced expectations” leaves a slice-of-life narrative that finds strength in its events and comedy but weakness in its romance and themes\\n\\n\r\nAnimation: Fine, okay art style, nice character designs, about average actual animation\\n\\n\r\nCharacters: Fine, the originals return, with some receiving extra attention compared to the rest, and newcomers arrive but leave little impact\\n\\n\r\nSound: Good, good OP, great ED, nice array of other OPs and EDs, okay soundtrack, above average VA work\\n\\n\r\nEnjoyment: Fine, Onodera and the other girls are fun, as is Haru, but the “magic” is no longer present\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-08-12T14:20:00+00:00",
            "helpful_count": 25,
            "mal_id": 195944,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=195944"
        },
        {
            "content": "I liked the first season, and I somewhat became disappointed at the 2nd. \r\nThe second season was full of high expectations after a successful 1st season, with a lot of anime fans arguing with who the promised girl is, who opens the locket, what team or girl or waifu they represent. It became a fan-seasoned service, and the plot was messed up.\r\nNo plot is present except SOME episodes. If you read the manga, you'll probably think \"what happened with the second season?!\" or something like that. The chapters of the manga are scattered in different episodes. Rally Go Round is one of the best openingthemes I've heard so far, and well, other than that, nothing changed in the series.\\n\\n\r\nAlthough some are disappointed, I enjoyed it, mainly because I'm an avid reader of the manga series. The main topic of the whole series did not play a huge part at the season (the locket and who the promised girl is)... well in some episodes, the locket made an appearance.\\n\\n\r\nTo summarize, nothing improved in this season, except the opening theme. I hope the anime bounces back in season 3 since there'll be a lot that will be tackled (a new character, new arcs, and well, an improved storyline).",
            "date": "2015-07-04T03:06:00+00:00",
            "helpful_count": 18,
            "mal_id": 192257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635020.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SeiIsFab",
                "username": "SeiIsFab"
            },
            "url": "https://myanimelist.net/reviews.php?id=192257"
        },
        {
            "content": "Nisekoi: is a series that's a little difficult to judge. It doesn't do anything particularly new or groundbreaking for the genre, but it doesn't have to. This sequel series to last year's Nisekoi is still just as fun to watch as it's predecessor, and that's all that really matters.\r\nOne of the biggest differences between Nisekoi: and Nisekoi (S1) is the tone of the plot. While season 2 definitely has some standout moments, the drama surrounding Raku's childhood promise and what's in his pendant has been significantly toned down, as the series instead chooses to focus more on the comedic side of things. Now, this isn'tnecessarily a bad thing -- It simply depends on what you liked most about the first season. If you enjoyed seeing the characters interact and poke fun at each other, you'll most definitely enjoy the majority of what Nisekoi: has to offer.\\n\\n\r\nOn the other hand, if you were hoping to finally discover just who holds the (quite literal) key to Raku's heart, you may be slightly disappointed to hear that there's not much development on that front. Personally, I feel this is Nisekoi:'s greatest fault -- Quite a few of the episodes have a \"filler\" feel to them, and the overarching story of the series never really moves forward. Thankfully, the main characters are still just as entertaining to watch as they were before, and there's a handful of new characters who join the cast this season.\\n\\n\r\nNormally, new characters would be a good thing; they keep things fresh, while providing a new dynamic for the main cast as a whole, right? In Nisekoi:'s case, that's not exactly true. The new characters are neither as fleshed out nor as fun to watch as the main cast, and I found the few episodes that feature them to be a bit of a drag. That's not to say that they're bad characters as a whole -- They just seem to appear out of nowhere with no real motive or explanation, and that made it hard to actually care about them. What bothers me is not that the characters are annoying or interfere with the story, it's that they're introduced but never expanded upon.\\n\\n\r\nOf course, this doesn't apply to all of the new characters we meet this season -- Not at all! It's only 2 or 3 of them that serve little purpose. Chitoge's workaholic mother, whom only appears in two or so episodes, stands out to me in particular as a wonderful new, albeit short lived addition to the cast. Her relationship with Raku is quite amusing to watch, and her strained interactions with Chitoge allow us to see an entirely different side of the titular gorilla-girl heroine. Haru Onodera, Kosaki's feisty little sister, seems to be somewhat of a divisive character; you'll either love her or you'll hate her. Lastly, Paula McCoy and Fuu are forgettable at best, as they don't really contribute anything worthwhile to the season as a whole. \\n\\n\r\nOne of my favorite episodes actually focused on Shu, Raku's best friend. Usually relegated to comic-relief, it was a breath of fresh air to see him get some much needed, yet somewhat unexpected character development. My absolute favorite episode, however, was episode 11. A true treat for any Onodera fans, episode 11 features Kosaki in the spotlight, and it's both hilarious and heartwarming. Seeing things from Kosaki's perspective also proves to be welcome change of pace, even if the first half is a bit silly. It also helps that episode 11 also features some wonderfully detailed animation when compared to the other episodes this season.\\n\\n\r\nOn the more technical side of things, the art, sound, and animation of Nisekoi: are wonderful, all on-par with the first season. Nisekoi:'s art is extremely pleasing to the eyes, and just like the last season, there's a plenty of unique scenery. The animation is exceptionally well-done all around, though there are occasional dips in quality. The OST is mellow and whimsical, fitting nicely into each scene. The opening credits feature some of the most unique visuals I've seen in a while, and the song itself is very catchy and energetic. The ending songs frequently switch around depending on what character starred in the episode, but they're all equally pleasant to listen to.\\n\\n\r\nIn the end, despite a couple of issues with the story and a few bland characters, Nisekoi: is still a highly enjoyable ride all the way to the end -- it's my personal favorite Spring anime this year, and I'd wholeheartedly recommend it to any fan of the series.",
            "date": "2015-06-26T16:10:00+00:00",
            "helpful_count": 18,
            "mal_id": 191355,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1848956.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rubesty",
                "username": "Rubesty"
            },
            "url": "https://myanimelist.net/reviews.php?id=191355"
        },
        {
            "content": "When the second season of Nisekoi was announced, I was expecting for it to finally have the revelation. Now that I've finished it, I am so disappointed as I was given 12 episodes that has nothing to do with it. All of the episodes can just be considered OVAs as it has no concrete connection to the \"main storyline\" of the anime.\r\nBUT! Don't get me wrong, it still lives up to the genre it belongs, which is RomCom. It succeeds in bringing romantic scenes and comedic ones. It's just that it pains me that this show lead me towards nowhere.\r\nThis is a review(duh) so let'sstart talking about where it shines the most and finish it with where it fails\\n\\n\r\nART&ANIMATION\\n\r\nThe art and animation is better than the first season's, which is saying something because the A&A in the first season is already good enough. In this season, we're given much more detailed backgrounds that is a must-see for art lovers. The fluidity of the animation is smooth. Colors are vibrant and clear. Character designs suit each character and are well done (Haru's hair is a wreck, though).\\n\\n\r\nSOUND\\n\r\nSoundtrack is OK, nothing special. OP is one of those rare ones that I don't skip. Some episodes have a different ED but I can't think of a reason why as for me, most of them are skippable. Voice acting is also OK, nothing special.\\n\\n\r\nCHARACTERS\\n\r\nWe've got two new characters to add in Raku's entourage of high school girls, Haru & Paula. However, they're unnecessary as they add no value to the story. This season showcased the minor characters more than the main characters but most of the time, it just doesn't work. There's no real character development that helped progress the main storyline. Sure, there were \"some\" character development but for what? \\n\\n\r\nSTORY\\n\r\nThis season feels like a bunch of fillers set on 1-cour. The story concerning the pendant is gone. It strayed from the main storyline which really made me disappointed. There's even that one episode that's about magical girls that didn't make any sense at all. However, there are strong episodes that are commendable like episode 10&11. It tells us the stories of some characters and I really loved how realistic and relatable they could be. \\n\\n\r\nENJOYMENT\\n\r\nTruth be told, the second season of Nisekoi is an utter disappointment for those awaiting of what will happen among Raku and his harem. It has its fun moments but that's not going to compensate for its lack of plot development.\\n\\n\r\nThe only thing I could say is that if you're going to watch this to satisfy your eyes, then go because this one is worthy to satisfy them. If not, then don't even bother.\\n\\n\r\nOverall = 5.6(6)/10",
            "date": "2015-06-30T08:33:00+00:00",
            "helpful_count": 16,
            "mal_id": 191801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675455.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ledo-kun",
                "username": "Ledo-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=191801"
        },
        {
            "content": "I was surprised by how much filler was in this. There was like 4 good episodes maybe? The arc with Chitoge's mom was good. Onodera's and Raku's past with each other is fleshed out in one episode. Everything else felt mediocre (not to mention those magical girl designs were ugly af...) and the thing that bugged me the most was the focus on minor/new characters that I didn't really care about. I'm also pretty tired of Chitoge hitting Raku, and he seems to be getting blander. There was basically no relationship development besides Chitoge's acknowledgment that she likes Raku. Onodera's little sister Haru was okayand got better, but she was stupidly judgemental and quick to conclusions for most of her screen time. Overall I guess I don't regret watching this but I wish shaft had used their time better. I think I would describe this season as cheap.",
            "date": "2015-07-07T01:36:00+00:00",
            "helpful_count": 14,
            "mal_id": 192610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3250659.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Savvylee",
                "username": "Savvylee"
            },
            "url": "https://myanimelist.net/reviews.php?id=192610"
        },
        {
            "content": "There have been a few sequels to anime that have been shameless filler in recent months. None of them were worth the hype that it originally sprouted upon announcement. However, that’s because they were story driven narratives that people took very seriously and wanted to know how the story and world would continue with the next continual season. One that definitely didn’t fit into this category was the sequel to the popular harem anime from 2014 called Nisekoi. For an anime that doesn’t  take its story or characters too seriously to begin with and have a sequel that is mostly comedic filler, that isjust a continuation from the start.\\n\\n\r\nLet’s not pretend that we thought the story in Nisekoi was something to be held in regard as outstanding because even the show dispels that notion. It wanted to be a dumb romantic comedy, that in some places satirizes the genre with Shaft’s over-the-top artistry, and nothing more. So, what the 2nd season brings on the table for fans of the series is simply a continuation of those hilarious and cute moments that made them adore the characters from the beginning. If filler was to be seen mostly in seasons based on anime that are purely comedic in nature ,such as Nisekoi, I think people wouldn’t be as annoyed by them as they did with, say, the 2nd season of Psycho Pass.\\n\\n\r\nWith that out of the way, Nisekoi: as it is called is, like I mentioned before, just more Nisekoi in that it just gives us more comedy and cutesy scenes involving the girls and our main protagonist. They are more or less the same in terms of the quality of the jokes coming from season one to season two. However, there are definitely some that set the bar up high than season one did with the hilarious dialogue between the characters. Thanks to the new characters they introduce in this season, which I’ll expound upon later, that open up a ton of cool possibilities they throw out to create even more hysterical scenes.\\n\\n\r\nShaft’s animation still boost these jokes up a notch with the vibrant character expressions that pop up every minute. They are every bit as wonderful as they were in the first season. In fact, I’d say it’s about the same level of quality of humor from the animation tricks when comparing the two of them. Great would be the right word to describe the quality itself, not excellent as there are a few jokes that flow off and taper off to nowhere.\\n\\n\r\nWhat little changes there are in Nisekoi:, they introduced two new characters that are noteworthy of mentioning. We are now introduced to Chitoge’s mother, Hana Kirisaki, who actually has a decent arc in the middle part of the season with Chitoge. It is formulaic as one could get, but Nisekoi knows how to turn something formulaic into comedy gold through and through. Finally, there is Onodera’s little sister, Haru Onodera. Haru’s brand of sisterly love antics of protecting her sister against Ichijou are always hilarious and adorable to see.  Everything about Haru at this point in Nisekoi has made this season worth the wait after just having a taste of her in the previous OVA leading up to this.\\n\\n\r\nDid I enjoy my time with this new season of Nisekoi? Indeed I did. Did it satisfy my continuous curiosity on how the romantic development between our hero and his love posse? No because I never had any to begin with. The fact of the matter is that Nisekoi has never fully taken itself seriously once you do the math of how often they’ve delved into the sillier moments than the serious tearjerkers that rarely happen. Comedy comes first in the world of Nisekoi and seriousness comes 2nd, and that’s fine as long as you do it right. Nisekoi just happens to be on that category and its 2nd season further proves that sentiment.\\n\\n\r\nGrade: A-\\n",
            "date": "2015-08-08T00:03:00+00:00",
            "helpful_count": 12,
            "mal_id": 195509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=195509"
        },
        {
            "content": "Hey there!\r\n-Before you read this review I'd like to mention that I am also up-to-date with the ongoing manga which this anime is based off of.\r\nI guess you can say that Nisekoi right now is one of those mainstream anime because of the various heroines that star in the show with their somewhat diverse personalities and scenarios around them.\r\nWith that comes a lot of more or less equal hate and love of the story.\r\nHonestly, I have no idea how this anime got a lot of the attention due to the story so it's most likely because of the \" Moe-factor \" or the grills. (Who doesn't like all 'em grills am I right? )\\n\\n\r\nBut I'm not gonna judge just from the anime's take on it but the series as a whole which also includes where the anime adapts itself from which is the manga.\\n\\n\r\nAnd having read the manga and anime. I can say that the story is so-so. With the story alone I don't think it would even survive this long. But in today's ocean of anime adaptations out there. I think that this anime really made the manga come to life. I proudly admit that having shaft produce Nisekoi was the best possible route the series could've taken. Having read the manga I can say that it was quite normal and boring. But after going through all those chapters and seeing it on screen moving in such a beautiful way was amazing.\\n\\n\r\nI understand why this series got a mediocre score compared to the first season but I think if people read the manga and then watched how Shaft made this so-so story into a work of art, this anime would easily pass the 8+ score.",
            "date": "2015-07-22T09:25:00+00:00",
            "helpful_count": 11,
            "mal_id": 194064,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4440942.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xenalius",
                "username": "Xenalius"
            },
            "url": "https://myanimelist.net/reviews.php?id=194064"
        },
        {
            "content": "Yay, more girls joining in Raku's harem. The joy. Isn't 4 girls enough for Raku? Seriously...All 4 girls are in love with you Raku, for crying out loud. \r\n(There will be some SPOILERS in my review)\r\nStory: (4/10) (SPOILERS)\r\nThe story continues from the 1st Season as the hunt for the key to his locket continues. \r\nThat plot synopsis alone is kind of misleading to me. This season didn't really have anything to do with Raku's locket. Well, if you count the episode where Onodera's little sister stole his locket and eventually returned it to him. Other than that, nothing. This season alone is just Raku spendingtime with one of the girls, mostly Chitoge. \\n\r\nThe plot have not changed. However, compared to the 1st season, the plot here is worse. Probably because due to the fact that this season didn't really focus on the plot at all.\\n\\n\\n\r\nArt/Animation: (9/10)\\n\r\nIf you watched the 1st Nisekoi then you're already familiar with the animation for this season's Nisekoi because it did not change. I'm not complaining or anything because the animation is great from the start. \\n\\n\\n\r\nSound: (7/10)\\n\r\nI don't know if this is just me but I didn't really find the OP great or even good. The OP song is Rally Go Round by LiSA. I loved her OP songs in SAO and Fate/Zero but for some reason, I didn't find it anywhere good at all. Please I want ClariS to sing the next OP if there is going to be a 3rd Season. \\n\r\nAgain, there are a lot of ED songs used in this season compared to the 1st season. There's now 7 ED songs and I only found 2 of the ED songs great. 1st is the ED song sung by Chitoge, Kosaki, Tsumugi, and Marika. I found that song great and worth listening to. The 2nd ED song which  I thought is great is \"Sleep...zzz\" by Chitoge. I honestly want Chitoge to sing more ED songs because her singing voice is beautiful. \\n\\n\\n\r\nCharacters: (6/10)\\n\r\nThe characters are pretty much the same as the previous season. Only 1 character got a character development and that is Chitoge. In the previous season, Chitoge is a full-blown tsundere girl. In this season, Chitoge is still a tsundere but she's starting to show more of her \"dere\" side or her soft and kind side. Raku is still a same old idiot Harem god. Onodera is still a same old dandere. Too shy to reveal her feelings to Raku. Tsugumi is still a same old kuudere and Marika is still a same old non-violent yandere girl. \\n\r\nThere are new characters that were introduced. One of them is Onodera's little sister, Haru. Another tsundere girl but not as violent as Chitoge. It took a whole season for Chitoge to show her \"dere\" side but it took Haru a couple of episodes to show her \"dere\" side. Another character introduced is Paula, colleague of Tsugumi and a foreigner (possibly American). This girl wasn't put in Raku's harem nor did she ever fall in love with Raku. Thank god. Like I said in my first review, the reason why I didn't rate the characters a score lower than 6 is because these characters are hilarious especiialy Haru and Marika. In this season, Marika is way more hilarious, earning her a 2nd spot on my favorite characters list.  (behind Chitoge). \\n\\n\\n\\n\r\nEnjoyment: (9/10)\\n\r\nIn the previous season, my enjoyment rating was perfect. However, in this season, I'll only give it a 9. Even though Marika is way more hilarious, it's really not enough to make it more funnier than the 1st season. That's the main reason why I enjoyed Nisekoi in the first place. Well, romance is another reason.\\n\\n\\n\\n\r\nOverall: (7/10)\\n\r\nCompared to the 1st season, this season is slightly worse. It felt like a huge filler and again, the story didn't go anywhere. The ending felt like a typical normal episode but it did make me happy because I'm with \"Team Chitoge\". The lack of episodes is also what made this show slightly worse than the first season. Why is it that this season only had 12 episodes but the first season had 20? If you were hyped up for this season after watching the 1st season then don't. You'll most likely be disappointed.\\n\\n\\n\\n\\n\r\nPros:\\n\r\n-Great Animation\\n\r\n-Hilarious characters\\n\r\n-New characters introduced were ok\\n\\n\\n\r\nCons:\\n\r\n-Mediocre story\\n\r\n-Soundtrack is slightly worse than the 1st season\\n\r\n-Most characters are the same\\n\r\n-Comedy is slightly worse than the 1st season\\n\r\n-Raku's locket, for the most part, is irrelevant in this season\\n\r\n-Lack of episodes\\n",
            "date": "2015-08-01T09:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 194892,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=194892"
        },
        {
            "content": "Waifu Wars: The Harem Strikes Back!\r\nNisekoi: is the sequel to the infamous herald of harems, the show that triggered one of the greatest waifu wars in the history of our world. Which team are you on? Team Chitoge? Team Onodera? Maybe you're a rebel and you're on Team Marika or Team Tsugumi, but you're all wrong, cause Team Onodera all the way!\r\nEither way, don't expect Nisekoi: to have any substantial and developing plot. It is Nisekoi after all. This season is basically a giant filler season, and it's basically just an attachment to the first season, as there isn't any relevant story line. This seasonis the \"Motto To-LOVE Ru\" of the Nisekoi series. It's basically just a bunch of short stories that the characters go through, while introducing some new characters that Raku can add to his collection.\\n\\n\r\nThe most impactful character introduced in this season is Onodera's little kid sister. While she does have some characteristics that may piss off some viewers, I found her to be the anime embodiment of my own little kid sister, and thus, I'm very biased with this season. \\n\\n\r\nNisekoi: is a fun and non-serious season to the overall story line. While it is by no means as good as its first season, it's still something that I believe anyone who has seen the first season should still watch, since it's still your everyday Nisekoi humor and characters being dense as hell!\\n\\n\r\nPros:\\n\r\n- Besides the lack of story, nothing's really changed! You still have your amazing and colorful cast of characters with their compelling attitudes and hilarious interactions with each other. \\n\r\n- Still hilarious! There were many moments where I nearly completely bursted out laughing. This season focused mainly on the comedic values after all.\\n\r\n- Still got that quirky and cheerful OST that sets up the lightheartedness of the show really well.\\n\r\n- This series actually has a surprising amount of character development, even for side characters.\\n\r\n- The shorts are actually really entertaining.\\n\\n\r\nCons:\\n\r\n- Despite the development that the characters go through there is NO ROMANTIC DEVELOPMENT!!! Just characters admitting that they like someone but doing absolutely nothing about it.\\n\r\n- 12 Naruto episodes.\\n\r\n- The density is back!\\n\\n\r\nStory: 2\\n\r\nAs mentioned many times, there basically is none. However, the shorts are either really entertaining or heartwarming, and they do contribute to some character growth. This season isn't exactly episodic, and the characters don't magically forget everything that happened before. Hopefully, just like To LOVE Ru did, Nisekoi will take the little developments that the characters went through with these shorts to make a kick ass third season.\\n\\n\r\nArt: 6\\n\r\nStill the beautiful art that we all know and love. The character designs are beautiful. Every member of the Raku Harem is attractive in their own way and have their little quirks about their design that make them so, such as Onodera's shy design and Chitoge's brilliant smile, etc. It's also very in touch with Shaft Studio's art style, like the fabulous and outrageous head tilts!\\n\\n\r\nSound: 5\\n\r\nThe OST is very catchy, as well as the OP. There isn't really anything special soundtrack wise, but the voice actors did a splendid job as always portraying the mood of their characters. HanaKana nailed Onodera's shy nature and Touyama brought out Chitoge's tsundere but delicate characteristics amazingly. I can't imagine any other voices for the characters.\\n\\n\r\nCharacter: 7\\n\r\nAs you can tell, I believe that the characters are the best part about Nisekoi. They are all so recognizable that even though Nisekoi is a pretty new anime series, they characters have become very iconic. This season definitely developed them a little bit more and introduced some new and interesting ones to help the main characters' development. I hope that the new characters will be able to shine more in future seasons. I even really like Raku, the extremely dense protagonist, because even though his denseness makes me want to punch him, he's still a really good guy and kind hearted, so I can't help but like him.\\n\\n\r\nEnjoyment: 5\\n\r\nI don't care if the story is crap or the romance isn't going anywhere, it's still Nisekoi. Facial expressions ftw!\\n\\n\r\nOverall: 5\\n\r\nWhile it is a let down compared to the first season, it's still worth watching for the humor, and let's be honest, comedy and waifus are the only reasons needed to watch this series. \\n",
            "date": "2016-02-25T10:45:00+00:00",
            "helpful_count": 10,
            "mal_id": 211682,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5146740.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Yuni",
                "username": "Yuni"
            },
            "url": "https://myanimelist.net/reviews.php?id=211682"
        },
        {
            "content": "Nisekoi 2, my review\r\nOk, so here are my ratings:\r\nStory:  My verdict, a Fair 6.\r\nArt: My verdict, a Mediocre 5\r\nSound: My verdict a Good 7\r\nCharacter: My verdict a Mediocre 5\r\nEnjoyment: My verdict also a Mediocre 5\r\nAnd last, Overall: My verdict a Poor 3\r\nSo, what was suppose to be a 20 something episode was reduce to just 12.... cu'z I could have sworn that this was suppose to run for that amount of episodes as indicated in MAL  after watching the first episode on April 11. Anyways, the anime basically has become what we can say is from good to bland, on the first sequelit was good, since we the audience where made to focus on the locket that the MC has during the first 9 or so episode, ok so  along the way we were made to forget the locket and focus on the MC guy and MC girl.....and it was very funny when the harem, one by one where added into the mix. As the 2nd sequel was introduced, this was the part were things becomes cliche and suddenly I find myself watching something that is the usual, the story itself basically is as the same as the usual harem based anime and the MC guy's role is no longer that good anymore the only consolation in this mix was the MC Girl who is now in love with the guy but still is wasn't enough to make the sequel that exciting, cu'z characterwise she is still this usual tsundere who never make enough attempt to confess her love for the MC guy, so I guess the story alone basically is fair enough to have such score (up). In the art category, well things are still the same, I still don't dig as to why Tsugumi would still be sporting a guys uniform that is not the school's standard issue, I still don't dig as to why Tachibana still wore her former school uniform that makes her look like a grandma, I still don't dig that long tie that we see in front of the girls school uniform, I mean is it as noose to hang themselves with, and there are still no fanservice in this anime, so it was all MEDIOCRE (up).On the sound category, I'd say i kinda like the VA's who did Raku, Chitoge, Tsumugi, Onodera and Tachibana's voice, also I  like the sequel's OST, so it's all good (up). What is enjoyable about this sequel........well, it was basically the fact that it was a run of the mill harem based anime and it nice that studio Aniplex has limit it to just 12 instead of the usual 20 something anime, since it was MEDIOCRE all the way (up) and Overall it was just simply poor (up) since there were no big development that has happen.......not even the introduction of Haru, Fuu and MaCoy can make up for for this sequel's overall in fact it can be compared to  like eating Meat and Potatoes in 4 succeeding rows where you become tired of it but you eat it anyway since there are no other choices, so should studio Aniplex and Shaft make a 3rd sequel???????If there won't be any major developments like finally getting to know what's inside the MC guy's locket then maybe they shouldn't .",
            "date": "2015-06-26T22:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 191397,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=191397"
        },
        {
            "content": "When you were watching the first season, did you ever think the following?\r\n\"Man, this anime is great! But you know... it has a bit too much plot development. It feels like Raku is going to have to pick a girl at some point, and I really don't want that to happen because endless fillers with no progression are the best. That progression with Onodera especially needs to go; that was really uninteresting. Can we just throw a little sister character in there that gets in the way of all potentially good Onodera scenes? And while we're at it, can we add a few more girls?Like, there just aren't enough girls that like Raku in this anime. Plus we really need to cut down on camera time for each character, you know. We're making them too interesting. OH I almost forgot, every character should ALMOST confess and then get conveniently interrupted, to preserve this dull stasis. And throw out that crap about Raku having to pretend he's in a relationship with Chitoge. I mean, be sure to remind the viewers that it's apparently still happening, but remove all of that tension with Claude and the opposing families. It's just too stressful, and getting in the way of moar girls.\"\\n\\n\r\nWell, I certainly didn't. Admittedly, I like a lot about Nisekoi:, though the reasons for that were established in the first season. The girls are cute and interesting, and had (past tense) a decent amount of plot development. But for some reason, the producers decided to bust out every rom-com cliche in the book for this second season, and in the end it felt a bit like To Love-Ru with out the ecchi (so... not much of anything). It was enjoyable, but completely lost the gripping feeling I had in the first season to watch just one more episode before going to bed.\\n\\n\r\nThe tension of every scene in the season 1 was so well put together. Raku desperately trying to appeal and appear single to Onodera, while having to fake a relationship with Chitoge. The anime really only needed those three characters as part of the love chart. You shouldn't expect any of that beautiful tension in this season. Each episode is basically a vignette of a particular character, experiencing one scene with Raku. It's a bit more than that at times, but it definitely doesn't feel like an evolving and continuous story anymore. It's just five girls hiding their feelings for Raku. (Really, five? Did we need another generic rom-com? OK I'll stop.)\\n\\n\r\nAs I said earlier, this season is only a 7/10 to me because of the support of the first season. Without the first season, this would likely be a 5/10. I still think it's enjoyable, but just be warned that you won't see the pleasantly surprising pace that you're likely used to.",
            "date": "2016-02-24T01:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 211585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64068.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/theeggman85",
                "username": "theeggman85"
            },
            "url": "https://myanimelist.net/reviews.php?id=211585"
        },
        {
            "content": "What's That I Hear? #Team Chitoge, #Team Onodera (And So On, Too Lazy To Mention All The Teams) So Which Team Won This Season? Let's Find Out In The Review Below\r\nStory: 7/10 This season literally didn't have any story to it. All episodes were split into two different stories = split story series it was this season. But the split stories were good with some being related to the main female characters and new characters along with some old characters. I think the manga might end with Raku being with Chitoge (This is not a spoiler. It is something I imagine might happen in thenear future.) \\n\\n\r\nSound: 9/10 Now this is something I have to give credit to cause there was separated ED for each main female character = Chitoge had her own ED and so did Onodera along with the other characters. The OP was pretty good and some music tracks in anime were good\\n\\n\r\nCharacters: 8/10 The characters aren't special in any way as always they are just like how there were in season 1  but this season we get to see the different sides of few characters along with some side characters and addition of 3 new characters.\\n\\n\r\nAnimation: 8/10 Animation was splendid for me this season (I think I am exaggerating a bit here) I really liked the art style, chibi design done and background design. Also some chitoge faces were really worth watching the show.\\n\\n\r\nEnjoyment: 8/10 It was pretty fun for me as there were unexpected things happening every now and then (Not like 1st season) I tell you one thing there's alot more fun you can expect from this than the first season. So happy watching  laughing\\n\\n\r\nOverall: Another good anime to watch when you are bored/tired from you work and school/college related stuff\\n\\n\r\nOverall Score: 8/10\\n\\n\r\nPersonal note: I suggest you buy the blu-ray to enjoy the animation and at the same time donate some money for the animation studios \\n\\n\r\nPersonal note 2: Don't expect story development from this season cause it ain't happening. Just enjoy the show for it's comdey.",
            "date": "2015-06-27T07:11:00+00:00",
            "helpful_count": 8,
            "mal_id": 191433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3243657.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Codered-sama",
                "username": "Codered-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=191433"
        },
        {
            "content": "STORY - 6\r\nART - 9\r\nSOUND - 8\r\nCHARACTER - 8\r\nENJOYMENT - 8\r\nThe fire may have slowly died down in Nisekoi: but the lingering warmth and erratic flickering of the flames were enough to awaken my comedic spirits. Observing the characters in this season was laugh-inducing. On the other hand, the lack of a story could define it as a time-waster.\r\nContinuing from its prequel, the charming cast is back with their romantic stresses close by. This time, rather than having an underlying plot with the pendant and the promised girl that we've gotten from before, it shifted more towards everyday activities. Episodic and digestible, everything was givenoff with a comedic spray full of love issues. In short, comedy had become a dominant replacement. Misunderstandings, inconveniences, and exaggerations were scattered throughout. Repetitions were present and some of the jokes were too forced to get any laughs out of me but overall, it had a great chemistry with various personalities reacting in entertaining manners. All that said, a few episodes were actually dedicated to short story lines that featured the main characters' history, giving each some spotlight. Other than unlocking more aspects with their characterization, from childhood memories to family ties, it also showed how they handled romance at their own pace. New characters were introduced to highlight them as well although the lack of screen time meant that any chances of investment were erased with the exception of Kosaki's sister, Haru Onodera. Witnessing her contradictions and ever-growing awareness towards Raku was a really fun high point for this season.\\n\\n\r\nCoating the surface of their everyday lives, the art remained as dazzling as ever. Playing around with lighting and mixing in geometric backgrounds created a highly-spirited ambience. It's sparkly and glimmered about with rainbow colors. With the above average animation exaggerating many visual gags, entertainment was there to tickle you at every corner. The presence of Shaft's distinct style, including prolonged close-up shots, achieved personal connections with the characters. Feeling their cuteness and embarrassments, their emotions were expressed as an appealing factor for your best girl of choice. Moe and chibi comedy captivated me while the jolly kind of soundtracks playing in the background clicked with the fun vibes. They were gentle on every scene. If the characters' attractive appearances weren't enough for you, the voice acting served as a delightful personality enhancer. They brought out a matching quality to let their persona shine through. From Chitoge's more-dere-less-tsun attitude and Kosaki's adorable endearment to Marika's clingy obsession or even Seishirou's tomboy coolness, despite the differences, they all have a similar feminine quality that was alluring and entertaining to listen to. Haru's voice seemed like she was about to lose her voice though but nevertheless, it was definitely cute.\\n\\n\r\nNisekoi: managed to operate with its still strong hilarities although the faded plot progression signified a lower glamor compared to before. It's a season of laughter with small hints for the promised girl. And if you don't mind that, it's a nice bundle of fun to enjoy in your free time.",
            "date": "2018-06-20T05:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 281643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=281643"
        },
        {
            "content": "if your read this review you already watch season 1 of this series. but not like seasons 1 this sequel just take daily life and littlebit improvement of character, if i says in one word this season more like one big OVA. New heroine and character maybe make story more progressive but if you want watch you can begin at eps 7, eps 1 until 6 is still daily life about heroine there is no important part in it. and unfortunate story have a flag about pendant, keys and childhood promise not explained at this seasons.\r\nbut like seasons 1 comedy and romance can still ienjoy it, and this season still have improvement at heroine and chraracter but not at childhood promise.\\n",
            "date": "2017-04-24T05:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 246216,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2890101.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nazeminato",
                "username": "nazeminato"
            },
            "url": "https://myanimelist.net/reviews.php?id=246216"
        },
        {
            "content": "*THIS REVIEW CONTAINS SPOILERS*\r\nThe first season was funny, romantic and adorable. This season on the other hand feels different. Not necessarily worse, just different.\r\nBefore anything else- please keep in mind that there are minor and major spoilers in this review, furthermore, if you haven’t seen the first season yet ( for whatever reason ) please don’t read the review due to huge spoilers.\r\nStory ( 6.5/10 )\r\nThe story starts where it ended; Chitaki being in love with Raku. However she is completely aware of it this time. Long story short- this is also how the season ended. The reason why the first season was so adorable, funny and romantic was due the relationships that were being developed. This season on the other hand has no character development. Instead they throw two new girls at you, in hope to spice up the relationships.\\n\\n\r\nThis anime went from a romantic/comedy to a harem. The reason this development is so disappointing is because of the first season. The first season didn’t feel like a harem until the ending, they simply spend so much time around character development.\\n\\n\r\nYou might ask yourself, is there really no character development at all?\\n\r\nThe first few episodes showed potential, however after the well known ‘magical girl’ episode it went all downhill.\\n\r\nJust like the first season there were moments of hope, moments of ‘is this ship finally going to leave the harbor and set sail?’. However just like the first season these events got interrupted by the most cliché things ever. It was funny at first, but it almost feels they are going to drag this story on forever.\\n\\n\r\nEvery single episode after felt like a filler with no purpose. The episodes were divided into two chapters of the manga, which made Nisekoi: no longer a story based anime, but gave it more an episodic nature. It honestly didn’t fit the anime after such a promising first season. The comedy however stayed funny.\\n\\n\r\nDon’t get the wrong idea about Nisekoi: though - it might not be as romantic as the first season. But it’s still worth your time if you enjoyed the first season. Apart from the lack of story and romance it's almost the same.\\n\\n\r\nCharacters ( 6/10 )\\n\r\nAs mentioned earlier in the review, we are introduced to two new characters, Paula the assassin and Haru, Onodera's little sister.\\n\r\nTo be fair- they are likeable( just like any other character in this show ), but this development makes the anime so much more complicated then it should of been. Older characters get less screen time and basically made the developments in the first season irrelevant.\\n\r\nThat being said, the characters in Nisekoi might not be unique but they are likeable nonetheless. \\n\\n\r\nArt ( 9/10 )\\n\r\nTopnotch, just like the first season. Really flawed characters, pretty backgrounds and really polished art overall. The reason why this anime can be considered as a comedy is also due to it’s unique way of expressions (which in this case really helped the anime).\\n\\n\r\nSound ( 7/10 )\\n\r\nThe opening and endingsongs were enjoyable and the soundtrack played during the episodes themselves was good aswell. Really nothing to complain about.\\n\\n\r\nPersonal enjoyment ( 7/10 )\\n\r\nYou might ask yourself, why did you still give Nisekoi an 7 despite all the things you’ve written?. To be fair, this anime is a good example of wasted potential, but it was enjoyable nonetheless.\\n\r\nEven while character development might be lacking and the story seems to be going nowhere, I did enjoy Nisekoi:.\\n\\n\r\nIs it as good as the first season? That is up for you to decide, I personally dislike harems due to their nature to never pick a girl and keep on dragging the story for countless of episodes. However if you do enjoy harems Nisekoi might be your piece of cake.\\n\r\nI would enjoy a third season to be fair- but not as much as I was looking forward to the second.\\n\\n\r\nThanks for your time, if you got any questions or recommendations to make my reviews better feel free to PM me.",
            "date": "2015-07-29T14:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 194639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4690893.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snowyboy",
                "username": "Snowyboy"
            },
            "url": "https://myanimelist.net/reviews.php?id=194639"
        },
        {
            "content": "Nisekoi, this title makes me wonder, was my love for Nisekoi: fake, or was it not? Well surely it cannot be fake, right?\r\nBefore I continue on, if you want a more in depth review then you may skip this read. I will also assume you have watched AT LEAST the first season of this show, and know a little bit of base knowledge for this season so I can \"spoil\" some of the more obvious stuff.\r\nFor those of you who take the time to read this, thank you. \r\nStory 4/10 (Let's dive right into it~)\r\n\"Raku and the girls are back! The hunt for the keyto his heart and locket continues in the second season of this fan favorite anime series.\" This was the synopsis, or the outline/summary/plot of the anime that they seem to tell you. But in all seriousness, there really wasn't much to do with the key and the locket in this season. Sure the characters who have a key tell you how they feel, and sure they talk about it, they just don't really capitalize on this point. Which, was a major flaw, and the synopsis sort of, well got my hopes up. The story/plot in this season merely turned into a love fest of needy girls. And the filler episode, just sort of destroyed me, I was not into that episode at all.\\n\r\nThe story wasn't much of a story in this season, I mean they did make progress it was just sort of awkward to react to. When I say, \"make progress\" I meant, \"almost no progress.\"\\n\r\nSure some episodes were sweet and heart warming, but mean while, others just didn't feel necessary. Overall I was ready for the worst, but really anticipating the best. Story wise I was let down. (Disappointment...)\\n\\n\r\nArt 7/10 \\n\r\nI'm not usually too picky when it comes to art. For Nisekoi I'm not that dazzled, but I do have to say that the very bright colorful, in your face color palette was good. The animation was pretty good, I've definitely seen animation like this before.\\n\r\nNothing that outstanding, but something I liked.\\n\\n\r\nSound 8/10\\n\r\nI'm also usually not that picky when it comes to sound either. There are a few points that I'm looking for though, like having a nice opening/openings and nice closing/closings. In the first season of Nisekoi I was truly amazed, I fell in love with pretty much every opening and closing that it had to offer. For the second season, that wasn't the case. Still, the sound track was still quite good, and it fit the anime well. Same with the voice acting, all the voices are pretty spot on, I enjoyed listening to them. \\n\r\nIn all seriousness the sound is probably the highlight of Nisekoi: . \\n\\n\r\nCharacter 5/10\\n\r\nWhen I watch Nisekoi, I love watching for the characters. They aren't THAT unique, but they all have their weirdness's to them, which I adore. When it came to Nisekoi: I felt like they didn't stick true to how the characters were in the first season. Of course, you do have to take to account how the characters feel/act around the MC, after the events of season 1. Which does change how the characters are in Nisekoi: quite dramatically, which was \"meh\" to me.\\n\r\nWhile the characters did change, most of them had very little progress made in terms of story. I feel like the show sort of denied progress for characters who needed it, and let characters who didn't need it, get it. They added in some new characters to this season, which I didn't mind, but having characters sort of just \"being there\" can just be a waste of time. Overall most characters barely made any development and the characters became sort of predictable, and bland. Bland because they sort of just do the same thing or act the same way over and over and over again. \\n\\n\r\nEnjoyment 6/10\\n\r\nI fairly enjoyed Nisekoi:. Once I realized that the show was going to focus more on the character aspect more than the story aspect I sort of realized that I should just enjoy it on how it is. Of course story plays a huge part on enjoyment for me. So when you start to stray from that I also start to stray from that, meaning I end up not focusing on it too much since I know i'll just get my hopes up. Overall my enjoyment was purely based on the characters, sound and art. (Which can be a good thing, but at the same time also a bad thing.) \\n\\n\r\nFinal Verdict 5/10\\n\r\nWhen people say, Nisekoi should be enjoyed for how it is, it should be, I do not disagree on this point. I do agree with people who say, well this season made me sad, since it did make me sad. I was sooooooooooo, disappointed. The quality just dropped, you know when people say, it went \"0 to 60 in 2 seconds!\" That's sort of how it was for me, except it went from 0 to 60 then steadily back to 0 in a few episodes. The 0 to 60 was season 1, and then the drop to 0 was season 2. \\n\r\nI recommend this to those of you who want laughs, since this series is just funny. But beware that this season of Nisekoi can be highly disappointing, and well just not that good.",
            "date": "2015-08-02T00:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 194946,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4710550.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SunZun",
                "username": "SunZun"
            },
            "url": "https://myanimelist.net/reviews.php?id=194946"
        }
    ],
    [
        {
            "content": "If you are reading this review, I assume that you have completed the first season already. Whether you liked the first season or not, I would like to mention that I enjoyed the first season very much and was expecting a lot from the second season in terms of plot advancement, comedy and character development. But what a shame! The quality of the anime dropped a big deal in this season (and so did it's rank).\r\nStory: 5/10\r\nThe second season is not about the pendant or developing relationships anymore. You can't blame the studio as it is just following the manga. This season is focused onOnodera's sister, Haru, who has apparently got a bad impression about Raku as rumors described him as perverted monster of a person.\\n\r\nThe premise sounds interesting but Haru is not introduced until 7th episode. That's more than halfway of the season. If you skip till episode 7, you'd miss nothing!! Literally there is no advancement in the plot and each episode is just dragged on with no conclusion. The whole production feels like one big series of OVAs.\\n\\n\r\nArt: 8/10\\n\r\nThe only element because of which I was able to go through all 12 episodes was the eye dazzling art.\\n\\n\r\nSound: 7/10\\n\r\nLiSA's Rally Go Round is a pretty good OP, but I didn't really liked the voice acting.\\n\\n\r\nCharacters: 6/10\\n\r\nTo be honest, I really liked the characters of the show in the first season and thought they were pretty funny. But this season made me literally dislike the characters. Raku is more dumber than ever. Most of the episodes are devoted to a single character, sometimes Chitoge, sometimes Marika. But when it comes to plot progression or romance development concerning anyone or the promise girl, there is no advancement from the first season.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\n\"It's true there is no or very little plot development but Nisekoi is supposed to be enjoyed, it's damn funny\"\\n\\n\r\n\"Nisekoi is the funniest anime I'v watched. It has much fanservice as well, It's a must watch\"\\n\\n\r\nI don't care whatever the Nisekoi fans will say, this season was really a waste of time. In terms of comedy, the first season was funny but in this season, the comedy is terribly forced and jokes are thrown just for joke's sake.\\n\\n\r\nNisekoi season 2 is watchable for big Nisekoi fans. However, if you weren't a fan of the first season, don't bother watching the second season.",
            "date": "2015-06-27T21:12:00+00:00",
            "helpful_count": 285,
            "mal_id": 191526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4246269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rkpandey",
                "username": "Rkpandey"
            },
            "url": "https://myanimelist.net/reviews.php?id=191526"
        },
        {
            "content": "I don't usually write anime reviews, but after seeing one of my favorite rom-com harem series turn into donkey ass I feel the need to write something for this one and warn others about this atrocious series that ruined itself.\r\nAh, the story. This element might have singlehandedly brought this anime down. The 2nd season of Nisekoi has the \"same\" plot as the 1st. A Yakuza head's son by the name of Ichijo Raku has a pendant, and he doesn't know who has the key to opening it. The one with the key is his \"true lover.\" Throughout the story we see a bunch of girlsjoin his harem with different keys. \\n\\n\r\nThe first season at least had SOME  plot progression, whereas in the 2nd season you might as well watch paint dry on a wall. In the 2nd season, its not about the pendant anymore, nor is it about him developing better relationships. Now, although you cannot blame the studio for merely just following the manga, the story is now focused on Onodera's sister who goes by the name of Haru. This ratchet little ignorant pitbull of a character gets saved by Raku from a bunch of gangbangers and refuses to believe that it was Raku who saved her. The only reason why she hates Raku is based off of the rumors she heard from others that described Raku as a perverted monster of a person. \\n\\n\r\nOkay, premise is \"alright,\" its safe for the audience to hope that we can see some character development within Raku and Haru right? Wrong. Not only does Haru get introduced in the 7th episode, which is more than halfway throughout the 2nd season, we get nothing before it! If you were to start at episode 7 in the 2nd season, you'd miss nothing. The episodes before are merely fillers. Even after Haru joins the harem, they are so focused on trying to push her to be the Main Focus that we get next to no character development between Raku and anyone else. It is now episode 11/12 and I have yet witnessed ANY genuine character development in the anime series except for the episodes that forced Raku and Haru together as the main dish, with a little spice of Onodera.\\n\\n\r\nThe Art is AMAZING. Only reason I made it this far was because of the art. It is merely eye candy, SHAFT always does a fantastic job with the artwork. \\n\\n\r\nSound is great! However nothing too special. I'd say its more on the better side because of how fitting the sound is with everything thats going on. \\n\\n\r\nThe characters? Oh right! This show was a harem right? Right right, we had characters other than Raku and Haru and Onodera. \\n\\n\r\nRaku: The same thickheaded character as before. His blatant ignorance to everyone's feelings toward him makes one want to rip their hair out, but he cant be hated as a character. He is lovable and charming to the max when he gets screentime. \\n\\n\r\nHaru: Eh, I see plethoras of comments talking about how shes the new ship with Raku but I don't like it. Her choices of refusing to believe that Raku is a genuinely good person is stressful to the audience. \\n\\n\r\nOnodera: Onodera is more or less the same as the first season. We see more character development with her and Raku and thats good to see because they are the #1 ship. \\n\\n\r\nLiterally every other girl in the harem: They are now irrelevant and are on the anime purely for the comedic reliefs. \\n\\n\r\nI wouldn't be surprised if the series gets dropped and a 3rd season never comes because I don't know what the mangaka, nor the studio is doing with this series. This show with its comedic scenes had so much potential to be a great comedic harem anime. Now however, the dream is lost. A 5/10 overall seems just about right, although theres this voice in the back of my head that is telling me that I am being too lenient. Lets hope the plot gets somewhere in the future. Cheers!",
            "date": "2015-06-25T14:24:00+00:00",
            "helpful_count": 93,
            "mal_id": 191246,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3976287.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Yuzaki",
                "username": "Yuzaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=191246"
        },
        {
            "content": "Oh god this Nisekoi season lol.\r\nIf you enjoyed first season of this show, don't raise your hopes up, cause this season is like a filler.\r\nStory:\r\nThe plot in Nisekoi is actually medicore.  The first season probably entertained you by it's comedy and you can call it romance lol... \r\nSecond s. is worse, while it's still pretty enjoyable to follow it goes nowhere.\r\nThe end felt like it's just begging and honestly there should be 24 episodes not 12...\r\n5/10\r\nArt:\r\nThe art is very nice to look at.\r\n8/10\r\nSound:\r\nOpening is really good along with the ed. The soundtrack overall is at high level so you can just watch this seasonfor art and sound if you're that kind of person.\\n\r\n8/10\\n\\n\r\nCharacter:\\n\r\nWhile the characters are very likable some of their actions or decisions are questionable. Why wouldn't Raku notice that he just got a harem and every girl likes him but he's just like hmm...? In this season some female characters got development unlike males cough..mc..cough.\\n\r\n7/10\\n\\n\r\nEnjoyment:\\n\r\nWas really hyped for this season. Damn  such a disappoitment. It was really enjoyable to watch but it could be so much better.\\n\r\n7/10\\n\\n\r\nOverall:\\n\r\nThis season was medicore-good. It can entertain you but it doesn't progress much where first season left. If you have free time and don't know what to watch, Nisekoi; is a good choice.\\n\\n\\n",
            "date": "2015-07-02T06:19:00+00:00",
            "helpful_count": 76,
            "mal_id": 192031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4448125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Azmou",
                "username": "Azmou"
            },
            "url": "https://myanimelist.net/reviews.php?id=192031"
        },
        {
            "content": "The sequel falls quite low compared to the prequel. \r\nNisekoi: barley gives any progression to the story. It's just 12 episodes filled with comedy.\r\nSure, it is a romance anime. But comedy has dominated it. No wonder it's called Nisekoi (False Love) because there isn't any in it. Yeah yeah, the girls are head over heels in love with Raku but does Raku have a clue? NO. Did he get a clue in season 1? NO.\r\nThough there is a slight progress in the story but that is more related to the past of the character and a hint of the promise. That's all there is, 1.5episodes about the story.\\n\\n\r\nThere you have it. Nisekoi: is meant to be enjoyed as a comedy anime with really cute characters and splendid animation. If you're looking for some good strong romance, you're in the wrong place.\\n\\n\r\nCharacters:\\n\r\nNew characters are introduced. But they get little importance aside from Haru Onodera. \\n\r\nAmong the old characters, whole episodes are devoted to a single character. Sometimes, it is Chitoge, sometimes Marika etcetera. \\n\\n\r\nA few episodes also show more of them in it. But as far as character progression, romance progression, the promise girl is concerned, that's a no go.\\n\\n\r\nEnjoyment:\\n\r\nYeah, I enjoyed the series. Since I like comedy and good animation, Niskeoi: was a nice anime to watch every week. But not an anime that I would watch as soon as it was available. It's the type you'd watch when bored and free, unlike another anime this season (Oregairu Zoku).\\n\\n\r\nNisekoi: does little to progress the story set in Nisekoi. It is full of comedy and filler type episodes. Not much progress about the promise. Mild story progress, nothing that important.\\n\\n\r\nDon't get me wrong, I really like the anime but I also want them to move ahead with the story.\\n\\n\r\nRakuXOnodera FTW!!!",
            "date": "2015-06-27T08:57:00+00:00",
            "helpful_count": 42,
            "mal_id": 191442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=191442"
        },
        {
            "content": "(This has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nNisekoi: has a strange title when you stare at it. It is the second season of an anime that is quite popular, but instead of giving it a number or some kind of continuation phrase, it simply adds a colon to the end of its name. It seems quite out of place, perhaps making you wonder, “Why is that even there?” Traditionally colons in sentences are used in conjunction with lists or highlighting something specific. Or to put it another way, a colon is used when wishing to speak about a relevant thing or set ofthings. But Nisekoi: has nothing after its colon, and the reason for this becomes obvious when thought about briefly: there is “nothing” to say about the show. While this spells certain doom for the anime as a whole, it at least provides the audience with an interesting question pertaining to expectations.\\n\\n\r\nSTORY\\n\\n\r\nNisekoi: takes place shortly after the first season ended. Chitoge, Onodera, Tsugumi, and Marika are back, with everyone still semi-vying for Raku’s attention.\\n\\n\r\nNisekoi (the first season) is a series infamous not only for the nonexistence of romantic and relational developments but also for the insane amount of plot stalling it performs. The first season did this so much to the point that the anime had become synonymous with “keeping the status quo.” Nothing ever progressed because the anime did not want it to; expecting it to do otherwise was almost unfair given the direction it purposefully went time and again.\\n\\n\r\nWith this in mind, think of a grocery store chain called “Nisekoi:” and determine what it generally contains. There are fruits, vegetables, chips, drinks, meats, breads – a never-ending amount of food can be found within such establishments. A person is allowed to expect this because he or she managed to visit its parent grocery store, Nisekoi, sometime in the past. Along the same lines, it doesn’t generally contain cars, clothes, expensive jewelry, computers, and many other objects because grocery stores focus instead on selling products that pertain to their specialty. Now, this does not mean that a grocery store cannot sell these items; it is just that it is known not to. In other words, a person doesn’t go to a grocery store expecting to find the latest sapphires for sale because that is not what a grocery store was designed to offer.\\n\\n\r\nHow in the world does this relate to Nisekoi:, the anime? The second season suffers from what is known as “misplaced expectations.” This is a phrase that is defined as expecting “A” but receiving “B” despite the signs pointing towards “B.” For anime, these signs include the themes, any type of foreshadowing, what the characters represent, genres the show finds itself in, or any other kind of indicator for how the events will unfold. Like someone flabbergasted that he or she did not find diamonds at the grocery store, a person who has “misplaced expectations” when watching a show is not looking strictly at what the anime did but instead what he or she wanted it to do.\\n\\n\r\n“Misplaced expectations” are most often associated with sequels, as it is here with Nisekoi:, because there is already a foundation with which to work off of. Normally a sequel is viewed after the previous seasons have been completed, meaning the audience has already been exposed to certain ideas or details. New projects or unfamiliar territory should ideally be approached with no expectations whatsoever but since sequels have already had some of their signs propped up, it seems as if there have to be some expectations that are simply unavoidable.\\n\\n\r\nThus a difficult dilemma is raised: what is the audience “allowed” to expect? Certain aspects are easier to agree on: Chitoge’s new romantic feelings towards Raku, a return of the cast, and the same brand of comedy are parts of the anime people can nearly unanimously expect to find in the second season. But what about progression of the plot? As has been said, the first season had quite the array of “convenient inconveniences,” so perhaps one should not expect to see any sort of movement of the narrative or the relationships between the characters. Indeed, the structure of the narrative – how the various tales are segmented in an episodic nature – demonstrates the anime’s slice-of-life-oriented framing and subsequently unwillingness to press forward. Yet one can look at it the opposite way; since there was notsuch progression, one might expect to finally see it after so long. Some of the best episodes this season, such as Chitoge reconciling with her mother, Shuu confessing to his teacher, and the investigation of Onodera’s backstory, were executed so well because they subverted the very expectations the anime had set for itself.\\n\\n\r\nSince expectations vary so wildly in degree and importance, the conclusion is that all anime should be viewed through a lens that holds no expectations whatsoever, with the show being looked at for what it attempted and accomplished. To put it differently, in order to avoid “misplaced expectations” one should abstain from having expectations to begin with. In Nisekoi:’s case – as a slice-of-life construct featuring harem, romance, and comedic elements – it performs at a respectable level. The events are sporadic yet relevant; the characters are given appropriate screen-time to interact in multiple combinations; and the comedy manages to be a mixture of visual gags, misunderstandings, and over-the-top personality quirks. At the same time, the anime fails in key areas: the romance is subpar due to repetition, not all of the new additions to the cast feel as “part of the gang,” and there is very little in the way of themes.\\n\\n\r\nSo while Nisekoi:’s plot may not be something worth remembering, the interesting topic that ensues because of it certainly is.\\n\\n\r\nANIMATION\\n\\n\r\nAlthough this rarely happens – and by coincidence, it has happened twice within the past five reviews – this section will be kept shorter than usual. Per SHAFT ideology, Nisekoi: adopts a less-movement-more-style direction in terms of its art and animation. Characters are often standing still, with multicolored lights and colors surrounding their backs while their faces take on a wide range of reactions. The designs maintain their same flair, with Onodera’s plain yet cute looks, Chitoge’s beautiful blonde hair with accompanying red ribbon, and Shuu’s silly cat mouth signifying his carefree nature, with everyone having both school and casual attire to match the correct occasion.\\n\\n\r\nCHARACTERS\\n\\n\r\nDue in part to Nisekoi:’s everlasting preventative measures, the characters likewise often find themselves not developing. Being a slice-of-life outing, this is usually the case; characters do not normally experience drama or introspection of the same level as a psychological thriller, so it is understandable that the majority of their character istheir “character.” Onodera is still her extremely shy yet vastly determined self, Chitoge remains as the typical “tsundere” (with more “dere” than “tsun” this time around), and Marika is as overly obsessed with Raku as she has ever been. However, there are moments where the show provides further insight into the cast. These were brought up previously: Chitoge has the relationship with her mother mended, Shuu adds another dimensionality to his person through the heartbreak he embarks on, and Onodera’s past reveals just how genuine and sweet her feelings are for the boy she loves so much. These are the exceptions, not the rule, but divulging beyond what the characters normally offer was a definite boon.\\n\\n\r\nIn relation to Chitoge’s small plotline, the show actually introduces four new characters, namely Hana (Chitoge’s mother), Paula (Tsugumi’s friend), Haru (Onodera’s sister), and Fuu (Haru’s friend). What is interesting is that Marika seems to be missing a new connection, which leads to two problems that the anime has in regards to the newcomers: their non-harem presence and their eventual nonexistence.\\n\\n\r\nFirst, they are not directly related to the harem. Their inclusion seems nonsensical, since their relation to Raku is nearly nonexistent. To an extent this is understandable since there are already four women on the list. But careful consideration reveals that the new characters are there to highlight aspects of the veterans; Hana brings out Chitoge’s more personal and vulnerable side, Paula demonstrates Tsugumi’s transition from tiger to cub, and Haru makes it abundantly clear how kind Onodera is. Fuu is, once again, an exception. She has implied feelings towards Haru, but she is hardly around long enough to discuss. This is all well and good, but the problem is that none of these girls improves upon the harem nature of the anime. In fact, some even regress it; Hana refuses to mention some important detail regarding Chitoge and Raku’s childhood whereas Haru literally forces Raku away from Onodera. Disrupting arguably the most important facet of the show is nothing more than a negative.\\n\\n\r\nSecond, their removal from Nisekoi: leaves it in an awkward position. Essentially, the new characters, after being introduced and used for their singular purpose, leave the stage to never be utilized again. Fuu’s case is the extreme, with her making around two appearances at most, but this also holds true for Hana, Paula, and even Haru. They show up, do their business, and are never heard from again. It not only makes it difficult to really care about them but also makes them feel less important, as if what they do manage to take part in while they are around holds no merit since, like them, it is quickly forgotten.\\n\\n\r\nSOUND\\n\\n\r\nThe opening theme is a big bundle of fun. The whistling, the back-and-forth singing, and fast beat keep the song from ever slowing down, upping the playfulness it provides. Alongside the incredible range of the main vocalist, the piece is not only fitting but a joy to listen to as well. The ending theme is arguably stronger than the OP, matching not only its playfulness but improving on overall catchiness. The “la’s,” very simple beat, and various vocalists working individually and in harmony gives the track the feel-good vibe it was undoubtedly aiming for. Beyond the main OP and ED is a bonus opening theme that precedes Onodera’s magical girl romp and a slew of ending themes – nearly one for each girl – to shake up the formula time and again. These pieces are not as impressive but their inclusion is certainly not unwanted.\\n\\n\r\nThe rest of the soundtrack is mostly filled with background tracks that coincide with the present mood. Standard fare such as jazzy tracks for the laidback times, weird onomatopoeia pieces for the happy ones, and Nisekoi:’s signature guitar plus accordion for those heartfelt moments can be heard. As an OST, it is not as involved or worthwhile as the large amount of EDs to choose from but they at least serve their purpose well enough.\\n\\n\r\nVoice acting for the anime is somewhere above average. Special shout-outs are deserved for Kana Hanazawa as Onodera for her recognizably cute voice, Nao Touyama as Chitoge for her often frustrated speaking, Kana Asumi as Marika for her super-girly way of talking, and Ayane Sakura as Haru for the perfect younger sister performance.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime has another reputation, in that the girls are quite popular. Not just one of the haremettes but all of them are usually seen in a positive light. Sure, everyone has his or her favorite – mine is Onodera – but everyone in the game of love is quite entertaining to see. Onodera’s blushes are the best, Chitoge’s faces are hilarious, and Marika’s calm demeanor despite being downright bonkers would always make me smile.\\n\\n\r\nYet, there was something missing this season. The characters are the same and so is the comedy, but the “magic” never felt present. The main cause of this was due to the shift in perspective; Raku was almost always in the center with the girls revolving around him whereas the second season felt a bit too all-over-the-place. That is, instead of the girls “competing” with one another it felt more like “taking turns,” defeating the purpose of the harem in the first place. It is even worse since the anime does not and will not fully commit to one path anyway, making individual exchanges feel pointless.\\n\\n\r\nAnd despite my harping, I liked Haru’s character. Seeing her so evil towards Raku, based on perhaps one of the most ridiculous misunderstandings of all time, was quite comical. In a way, she acts as the anti-haremette, where she does not want anything to do with him but he always seemed to dote on and care for her more so than any of the other girls. Seeing her flustered beyond belief while ever so slightly becoming comfortable with his presence was likewise a lot of fun to see.\\n\\n\r\nNisekoi: causes people to harbor many valid and invalid expectations when moving from the previous season to the next. Disregarding them entirely, one will find a fun little anime, with some comedic characters, nice music, and stylized art. Unfortunately, the charm from the first season is lost in translation, the plot is lackluster, and the newcomers are rather weak. To summarize, here is what should have been added to its title: “Nisekoi: Not Sure Where to Go from Here.”\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, abstaining from “misplaced expectations” leaves a slice-of-life narrative that finds strength in its events and comedy but weakness in its romance and themes\\n\\n\r\nAnimation: Fine, okay art style, nice character designs, about average actual animation\\n\\n\r\nCharacters: Fine, the originals return, with some receiving extra attention compared to the rest, and newcomers arrive but leave little impact\\n\\n\r\nSound: Good, good OP, great ED, nice array of other OPs and EDs, okay soundtrack, above average VA work\\n\\n\r\nEnjoyment: Fine, Onodera and the other girls are fun, as is Haru, but the “magic” is no longer present\\n\\n\r\nFinal Score: 5/10",
            "date": "2015-08-12T14:20:00+00:00",
            "helpful_count": 25,
            "mal_id": 195944,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=195944"
        },
        {
            "content": "I liked the first season, and I somewhat became disappointed at the 2nd. \r\nThe second season was full of high expectations after a successful 1st season, with a lot of anime fans arguing with who the promised girl is, who opens the locket, what team or girl or waifu they represent. It became a fan-seasoned service, and the plot was messed up.\r\nNo plot is present except SOME episodes. If you read the manga, you'll probably think \"what happened with the second season?!\" or something like that. The chapters of the manga are scattered in different episodes. Rally Go Round is one of the best openingthemes I've heard so far, and well, other than that, nothing changed in the series.\\n\\n\r\nAlthough some are disappointed, I enjoyed it, mainly because I'm an avid reader of the manga series. The main topic of the whole series did not play a huge part at the season (the locket and who the promised girl is)... well in some episodes, the locket made an appearance.\\n\\n\r\nTo summarize, nothing improved in this season, except the opening theme. I hope the anime bounces back in season 3 since there'll be a lot that will be tackled (a new character, new arcs, and well, an improved storyline).",
            "date": "2015-07-04T03:06:00+00:00",
            "helpful_count": 18,
            "mal_id": 192257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635020.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SeiIsFab",
                "username": "SeiIsFab"
            },
            "url": "https://myanimelist.net/reviews.php?id=192257"
        },
        {
            "content": "Nisekoi: is a series that's a little difficult to judge. It doesn't do anything particularly new or groundbreaking for the genre, but it doesn't have to. This sequel series to last year's Nisekoi is still just as fun to watch as it's predecessor, and that's all that really matters.\r\nOne of the biggest differences between Nisekoi: and Nisekoi (S1) is the tone of the plot. While season 2 definitely has some standout moments, the drama surrounding Raku's childhood promise and what's in his pendant has been significantly toned down, as the series instead chooses to focus more on the comedic side of things. Now, this isn'tnecessarily a bad thing -- It simply depends on what you liked most about the first season. If you enjoyed seeing the characters interact and poke fun at each other, you'll most definitely enjoy the majority of what Nisekoi: has to offer.\\n\\n\r\nOn the other hand, if you were hoping to finally discover just who holds the (quite literal) key to Raku's heart, you may be slightly disappointed to hear that there's not much development on that front. Personally, I feel this is Nisekoi:'s greatest fault -- Quite a few of the episodes have a \"filler\" feel to them, and the overarching story of the series never really moves forward. Thankfully, the main characters are still just as entertaining to watch as they were before, and there's a handful of new characters who join the cast this season.\\n\\n\r\nNormally, new characters would be a good thing; they keep things fresh, while providing a new dynamic for the main cast as a whole, right? In Nisekoi:'s case, that's not exactly true. The new characters are neither as fleshed out nor as fun to watch as the main cast, and I found the few episodes that feature them to be a bit of a drag. That's not to say that they're bad characters as a whole -- They just seem to appear out of nowhere with no real motive or explanation, and that made it hard to actually care about them. What bothers me is not that the characters are annoying or interfere with the story, it's that they're introduced but never expanded upon.\\n\\n\r\nOf course, this doesn't apply to all of the new characters we meet this season -- Not at all! It's only 2 or 3 of them that serve little purpose. Chitoge's workaholic mother, whom only appears in two or so episodes, stands out to me in particular as a wonderful new, albeit short lived addition to the cast. Her relationship with Raku is quite amusing to watch, and her strained interactions with Chitoge allow us to see an entirely different side of the titular gorilla-girl heroine. Haru Onodera, Kosaki's feisty little sister, seems to be somewhat of a divisive character; you'll either love her or you'll hate her. Lastly, Paula McCoy and Fuu are forgettable at best, as they don't really contribute anything worthwhile to the season as a whole. \\n\\n\r\nOne of my favorite episodes actually focused on Shu, Raku's best friend. Usually relegated to comic-relief, it was a breath of fresh air to see him get some much needed, yet somewhat unexpected character development. My absolute favorite episode, however, was episode 11. A true treat for any Onodera fans, episode 11 features Kosaki in the spotlight, and it's both hilarious and heartwarming. Seeing things from Kosaki's perspective also proves to be welcome change of pace, even if the first half is a bit silly. It also helps that episode 11 also features some wonderfully detailed animation when compared to the other episodes this season.\\n\\n\r\nOn the more technical side of things, the art, sound, and animation of Nisekoi: are wonderful, all on-par with the first season. Nisekoi:'s art is extremely pleasing to the eyes, and just like the last season, there's a plenty of unique scenery. The animation is exceptionally well-done all around, though there are occasional dips in quality. The OST is mellow and whimsical, fitting nicely into each scene. The opening credits feature some of the most unique visuals I've seen in a while, and the song itself is very catchy and energetic. The ending songs frequently switch around depending on what character starred in the episode, but they're all equally pleasant to listen to.\\n\\n\r\nIn the end, despite a couple of issues with the story and a few bland characters, Nisekoi: is still a highly enjoyable ride all the way to the end -- it's my personal favorite Spring anime this year, and I'd wholeheartedly recommend it to any fan of the series.",
            "date": "2015-06-26T16:10:00+00:00",
            "helpful_count": 18,
            "mal_id": 191355,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1848956.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rubesty",
                "username": "Rubesty"
            },
            "url": "https://myanimelist.net/reviews.php?id=191355"
        },
        {
            "content": "When the second season of Nisekoi was announced, I was expecting for it to finally have the revelation. Now that I've finished it, I am so disappointed as I was given 12 episodes that has nothing to do with it. All of the episodes can just be considered OVAs as it has no concrete connection to the \"main storyline\" of the anime.\r\nBUT! Don't get me wrong, it still lives up to the genre it belongs, which is RomCom. It succeeds in bringing romantic scenes and comedic ones. It's just that it pains me that this show lead me towards nowhere.\r\nThis is a review(duh) so let'sstart talking about where it shines the most and finish it with where it fails\\n\\n\r\nART&ANIMATION\\n\r\nThe art and animation is better than the first season's, which is saying something because the A&A in the first season is already good enough. In this season, we're given much more detailed backgrounds that is a must-see for art lovers. The fluidity of the animation is smooth. Colors are vibrant and clear. Character designs suit each character and are well done (Haru's hair is a wreck, though).\\n\\n\r\nSOUND\\n\r\nSoundtrack is OK, nothing special. OP is one of those rare ones that I don't skip. Some episodes have a different ED but I can't think of a reason why as for me, most of them are skippable. Voice acting is also OK, nothing special.\\n\\n\r\nCHARACTERS\\n\r\nWe've got two new characters to add in Raku's entourage of high school girls, Haru & Paula. However, they're unnecessary as they add no value to the story. This season showcased the minor characters more than the main characters but most of the time, it just doesn't work. There's no real character development that helped progress the main storyline. Sure, there were \"some\" character development but for what? \\n\\n\r\nSTORY\\n\r\nThis season feels like a bunch of fillers set on 1-cour. The story concerning the pendant is gone. It strayed from the main storyline which really made me disappointed. There's even that one episode that's about magical girls that didn't make any sense at all. However, there are strong episodes that are commendable like episode 10&11. It tells us the stories of some characters and I really loved how realistic and relatable they could be. \\n\\n\r\nENJOYMENT\\n\r\nTruth be told, the second season of Nisekoi is an utter disappointment for those awaiting of what will happen among Raku and his harem. It has its fun moments but that's not going to compensate for its lack of plot development.\\n\\n\r\nThe only thing I could say is that if you're going to watch this to satisfy your eyes, then go because this one is worthy to satisfy them. If not, then don't even bother.\\n\\n\r\nOverall = 5.6(6)/10",
            "date": "2015-06-30T08:33:00+00:00",
            "helpful_count": 16,
            "mal_id": 191801,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675455.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ledo-kun",
                "username": "Ledo-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=191801"
        },
        {
            "content": "I was surprised by how much filler was in this. There was like 4 good episodes maybe? The arc with Chitoge's mom was good. Onodera's and Raku's past with each other is fleshed out in one episode. Everything else felt mediocre (not to mention those magical girl designs were ugly af...) and the thing that bugged me the most was the focus on minor/new characters that I didn't really care about. I'm also pretty tired of Chitoge hitting Raku, and he seems to be getting blander. There was basically no relationship development besides Chitoge's acknowledgment that she likes Raku. Onodera's little sister Haru was okayand got better, but she was stupidly judgemental and quick to conclusions for most of her screen time. Overall I guess I don't regret watching this but I wish shaft had used their time better. I think I would describe this season as cheap.",
            "date": "2015-07-07T01:36:00+00:00",
            "helpful_count": 14,
            "mal_id": 192610,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3250659.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Savvylee",
                "username": "Savvylee"
            },
            "url": "https://myanimelist.net/reviews.php?id=192610"
        },
        {
            "content": "There have been a few sequels to anime that have been shameless filler in recent months. None of them were worth the hype that it originally sprouted upon announcement. However, that’s because they were story driven narratives that people took very seriously and wanted to know how the story and world would continue with the next continual season. One that definitely didn’t fit into this category was the sequel to the popular harem anime from 2014 called Nisekoi. For an anime that doesn’t  take its story or characters too seriously to begin with and have a sequel that is mostly comedic filler, that isjust a continuation from the start.\\n\\n\r\nLet’s not pretend that we thought the story in Nisekoi was something to be held in regard as outstanding because even the show dispels that notion. It wanted to be a dumb romantic comedy, that in some places satirizes the genre with Shaft’s over-the-top artistry, and nothing more. So, what the 2nd season brings on the table for fans of the series is simply a continuation of those hilarious and cute moments that made them adore the characters from the beginning. If filler was to be seen mostly in seasons based on anime that are purely comedic in nature ,such as Nisekoi, I think people wouldn’t be as annoyed by them as they did with, say, the 2nd season of Psycho Pass.\\n\\n\r\nWith that out of the way, Nisekoi: as it is called is, like I mentioned before, just more Nisekoi in that it just gives us more comedy and cutesy scenes involving the girls and our main protagonist. They are more or less the same in terms of the quality of the jokes coming from season one to season two. However, there are definitely some that set the bar up high than season one did with the hilarious dialogue between the characters. Thanks to the new characters they introduce in this season, which I’ll expound upon later, that open up a ton of cool possibilities they throw out to create even more hysterical scenes.\\n\\n\r\nShaft’s animation still boost these jokes up a notch with the vibrant character expressions that pop up every minute. They are every bit as wonderful as they were in the first season. In fact, I’d say it’s about the same level of quality of humor from the animation tricks when comparing the two of them. Great would be the right word to describe the quality itself, not excellent as there are a few jokes that flow off and taper off to nowhere.\\n\\n\r\nWhat little changes there are in Nisekoi:, they introduced two new characters that are noteworthy of mentioning. We are now introduced to Chitoge’s mother, Hana Kirisaki, who actually has a decent arc in the middle part of the season with Chitoge. It is formulaic as one could get, but Nisekoi knows how to turn something formulaic into comedy gold through and through. Finally, there is Onodera’s little sister, Haru Onodera. Haru’s brand of sisterly love antics of protecting her sister against Ichijou are always hilarious and adorable to see.  Everything about Haru at this point in Nisekoi has made this season worth the wait after just having a taste of her in the previous OVA leading up to this.\\n\\n\r\nDid I enjoy my time with this new season of Nisekoi? Indeed I did. Did it satisfy my continuous curiosity on how the romantic development between our hero and his love posse? No because I never had any to begin with. The fact of the matter is that Nisekoi has never fully taken itself seriously once you do the math of how often they’ve delved into the sillier moments than the serious tearjerkers that rarely happen. Comedy comes first in the world of Nisekoi and seriousness comes 2nd, and that’s fine as long as you do it right. Nisekoi just happens to be on that category and its 2nd season further proves that sentiment.\\n\\n\r\nGrade: A-\\n",
            "date": "2015-08-08T00:03:00+00:00",
            "helpful_count": 12,
            "mal_id": 195509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=195509"
        },
        {
            "content": "Hey there!\r\n-Before you read this review I'd like to mention that I am also up-to-date with the ongoing manga which this anime is based off of.\r\nI guess you can say that Nisekoi right now is one of those mainstream anime because of the various heroines that star in the show with their somewhat diverse personalities and scenarios around them.\r\nWith that comes a lot of more or less equal hate and love of the story.\r\nHonestly, I have no idea how this anime got a lot of the attention due to the story so it's most likely because of the \" Moe-factor \" or the grills. (Who doesn't like all 'em grills am I right? )\\n\\n\r\nBut I'm not gonna judge just from the anime's take on it but the series as a whole which also includes where the anime adapts itself from which is the manga.\\n\\n\r\nAnd having read the manga and anime. I can say that the story is so-so. With the story alone I don't think it would even survive this long. But in today's ocean of anime adaptations out there. I think that this anime really made the manga come to life. I proudly admit that having shaft produce Nisekoi was the best possible route the series could've taken. Having read the manga I can say that it was quite normal and boring. But after going through all those chapters and seeing it on screen moving in such a beautiful way was amazing.\\n\\n\r\nI understand why this series got a mediocre score compared to the first season but I think if people read the manga and then watched how Shaft made this so-so story into a work of art, this anime would easily pass the 8+ score.",
            "date": "2015-07-22T09:25:00+00:00",
            "helpful_count": 11,
            "mal_id": 194064,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4440942.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xenalius",
                "username": "Xenalius"
            },
            "url": "https://myanimelist.net/reviews.php?id=194064"
        },
        {
            "content": "Yay, more girls joining in Raku's harem. The joy. Isn't 4 girls enough for Raku? Seriously...All 4 girls are in love with you Raku, for crying out loud. \r\n(There will be some SPOILERS in my review)\r\nStory: (4/10) (SPOILERS)\r\nThe story continues from the 1st Season as the hunt for the key to his locket continues. \r\nThat plot synopsis alone is kind of misleading to me. This season didn't really have anything to do with Raku's locket. Well, if you count the episode where Onodera's little sister stole his locket and eventually returned it to him. Other than that, nothing. This season alone is just Raku spendingtime with one of the girls, mostly Chitoge. \\n\r\nThe plot have not changed. However, compared to the 1st season, the plot here is worse. Probably because due to the fact that this season didn't really focus on the plot at all.\\n\\n\\n\r\nArt/Animation: (9/10)\\n\r\nIf you watched the 1st Nisekoi then you're already familiar with the animation for this season's Nisekoi because it did not change. I'm not complaining or anything because the animation is great from the start. \\n\\n\\n\r\nSound: (7/10)\\n\r\nI don't know if this is just me but I didn't really find the OP great or even good. The OP song is Rally Go Round by LiSA. I loved her OP songs in SAO and Fate/Zero but for some reason, I didn't find it anywhere good at all. Please I want ClariS to sing the next OP if there is going to be a 3rd Season. \\n\r\nAgain, there are a lot of ED songs used in this season compared to the 1st season. There's now 7 ED songs and I only found 2 of the ED songs great. 1st is the ED song sung by Chitoge, Kosaki, Tsumugi, and Marika. I found that song great and worth listening to. The 2nd ED song which  I thought is great is \"Sleep...zzz\" by Chitoge. I honestly want Chitoge to sing more ED songs because her singing voice is beautiful. \\n\\n\\n\r\nCharacters: (6/10)\\n\r\nThe characters are pretty much the same as the previous season. Only 1 character got a character development and that is Chitoge. In the previous season, Chitoge is a full-blown tsundere girl. In this season, Chitoge is still a tsundere but she's starting to show more of her \"dere\" side or her soft and kind side. Raku is still a same old idiot Harem god. Onodera is still a same old dandere. Too shy to reveal her feelings to Raku. Tsugumi is still a same old kuudere and Marika is still a same old non-violent yandere girl. \\n\r\nThere are new characters that were introduced. One of them is Onodera's little sister, Haru. Another tsundere girl but not as violent as Chitoge. It took a whole season for Chitoge to show her \"dere\" side but it took Haru a couple of episodes to show her \"dere\" side. Another character introduced is Paula, colleague of Tsugumi and a foreigner (possibly American). This girl wasn't put in Raku's harem nor did she ever fall in love with Raku. Thank god. Like I said in my first review, the reason why I didn't rate the characters a score lower than 6 is because these characters are hilarious especiialy Haru and Marika. In this season, Marika is way more hilarious, earning her a 2nd spot on my favorite characters list.  (behind Chitoge). \\n\\n\\n\\n\r\nEnjoyment: (9/10)\\n\r\nIn the previous season, my enjoyment rating was perfect. However, in this season, I'll only give it a 9. Even though Marika is way more hilarious, it's really not enough to make it more funnier than the 1st season. That's the main reason why I enjoyed Nisekoi in the first place. Well, romance is another reason.\\n\\n\\n\\n\r\nOverall: (7/10)\\n\r\nCompared to the 1st season, this season is slightly worse. It felt like a huge filler and again, the story didn't go anywhere. The ending felt like a typical normal episode but it did make me happy because I'm with \"Team Chitoge\". The lack of episodes is also what made this show slightly worse than the first season. Why is it that this season only had 12 episodes but the first season had 20? If you were hyped up for this season after watching the 1st season then don't. You'll most likely be disappointed.\\n\\n\\n\\n\\n\r\nPros:\\n\r\n-Great Animation\\n\r\n-Hilarious characters\\n\r\n-New characters introduced were ok\\n\\n\\n\r\nCons:\\n\r\n-Mediocre story\\n\r\n-Soundtrack is slightly worse than the 1st season\\n\r\n-Most characters are the same\\n\r\n-Comedy is slightly worse than the 1st season\\n\r\n-Raku's locket, for the most part, is irrelevant in this season\\n\r\n-Lack of episodes\\n",
            "date": "2015-08-01T09:34:00+00:00",
            "helpful_count": 10,
            "mal_id": 194892,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=194892"
        },
        {
            "content": "Waifu Wars: The Harem Strikes Back!\r\nNisekoi: is the sequel to the infamous herald of harems, the show that triggered one of the greatest waifu wars in the history of our world. Which team are you on? Team Chitoge? Team Onodera? Maybe you're a rebel and you're on Team Marika or Team Tsugumi, but you're all wrong, cause Team Onodera all the way!\r\nEither way, don't expect Nisekoi: to have any substantial and developing plot. It is Nisekoi after all. This season is basically a giant filler season, and it's basically just an attachment to the first season, as there isn't any relevant story line. This seasonis the \"Motto To-LOVE Ru\" of the Nisekoi series. It's basically just a bunch of short stories that the characters go through, while introducing some new characters that Raku can add to his collection.\\n\\n\r\nThe most impactful character introduced in this season is Onodera's little kid sister. While she does have some characteristics that may piss off some viewers, I found her to be the anime embodiment of my own little kid sister, and thus, I'm very biased with this season. \\n\\n\r\nNisekoi: is a fun and non-serious season to the overall story line. While it is by no means as good as its first season, it's still something that I believe anyone who has seen the first season should still watch, since it's still your everyday Nisekoi humor and characters being dense as hell!\\n\\n\r\nPros:\\n\r\n- Besides the lack of story, nothing's really changed! You still have your amazing and colorful cast of characters with their compelling attitudes and hilarious interactions with each other. \\n\r\n- Still hilarious! There were many moments where I nearly completely bursted out laughing. This season focused mainly on the comedic values after all.\\n\r\n- Still got that quirky and cheerful OST that sets up the lightheartedness of the show really well.\\n\r\n- This series actually has a surprising amount of character development, even for side characters.\\n\r\n- The shorts are actually really entertaining.\\n\\n\r\nCons:\\n\r\n- Despite the development that the characters go through there is NO ROMANTIC DEVELOPMENT!!! Just characters admitting that they like someone but doing absolutely nothing about it.\\n\r\n- 12 Naruto episodes.\\n\r\n- The density is back!\\n\\n\r\nStory: 2\\n\r\nAs mentioned many times, there basically is none. However, the shorts are either really entertaining or heartwarming, and they do contribute to some character growth. This season isn't exactly episodic, and the characters don't magically forget everything that happened before. Hopefully, just like To LOVE Ru did, Nisekoi will take the little developments that the characters went through with these shorts to make a kick ass third season.\\n\\n\r\nArt: 6\\n\r\nStill the beautiful art that we all know and love. The character designs are beautiful. Every member of the Raku Harem is attractive in their own way and have their little quirks about their design that make them so, such as Onodera's shy design and Chitoge's brilliant smile, etc. It's also very in touch with Shaft Studio's art style, like the fabulous and outrageous head tilts!\\n\\n\r\nSound: 5\\n\r\nThe OST is very catchy, as well as the OP. There isn't really anything special soundtrack wise, but the voice actors did a splendid job as always portraying the mood of their characters. HanaKana nailed Onodera's shy nature and Touyama brought out Chitoge's tsundere but delicate characteristics amazingly. I can't imagine any other voices for the characters.\\n\\n\r\nCharacter: 7\\n\r\nAs you can tell, I believe that the characters are the best part about Nisekoi. They are all so recognizable that even though Nisekoi is a pretty new anime series, they characters have become very iconic. This season definitely developed them a little bit more and introduced some new and interesting ones to help the main characters' development. I hope that the new characters will be able to shine more in future seasons. I even really like Raku, the extremely dense protagonist, because even though his denseness makes me want to punch him, he's still a really good guy and kind hearted, so I can't help but like him.\\n\\n\r\nEnjoyment: 5\\n\r\nI don't care if the story is crap or the romance isn't going anywhere, it's still Nisekoi. Facial expressions ftw!\\n\\n\r\nOverall: 5\\n\r\nWhile it is a let down compared to the first season, it's still worth watching for the humor, and let's be honest, comedy and waifus are the only reasons needed to watch this series. \\n",
            "date": "2016-02-25T10:45:00+00:00",
            "helpful_count": 10,
            "mal_id": 211682,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5146740.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Yuni",
                "username": "Yuni"
            },
            "url": "https://myanimelist.net/reviews.php?id=211682"
        },
        {
            "content": "Nisekoi 2, my review\r\nOk, so here are my ratings:\r\nStory:  My verdict, a Fair 6.\r\nArt: My verdict, a Mediocre 5\r\nSound: My verdict a Good 7\r\nCharacter: My verdict a Mediocre 5\r\nEnjoyment: My verdict also a Mediocre 5\r\nAnd last, Overall: My verdict a Poor 3\r\nSo, what was suppose to be a 20 something episode was reduce to just 12.... cu'z I could have sworn that this was suppose to run for that amount of episodes as indicated in MAL  after watching the first episode on April 11. Anyways, the anime basically has become what we can say is from good to bland, on the first sequelit was good, since we the audience where made to focus on the locket that the MC has during the first 9 or so episode, ok so  along the way we were made to forget the locket and focus on the MC guy and MC girl.....and it was very funny when the harem, one by one where added into the mix. As the 2nd sequel was introduced, this was the part were things becomes cliche and suddenly I find myself watching something that is the usual, the story itself basically is as the same as the usual harem based anime and the MC guy's role is no longer that good anymore the only consolation in this mix was the MC Girl who is now in love with the guy but still is wasn't enough to make the sequel that exciting, cu'z characterwise she is still this usual tsundere who never make enough attempt to confess her love for the MC guy, so I guess the story alone basically is fair enough to have such score (up). In the art category, well things are still the same, I still don't dig as to why Tsugumi would still be sporting a guys uniform that is not the school's standard issue, I still don't dig as to why Tachibana still wore her former school uniform that makes her look like a grandma, I still don't dig that long tie that we see in front of the girls school uniform, I mean is it as noose to hang themselves with, and there are still no fanservice in this anime, so it was all MEDIOCRE (up).On the sound category, I'd say i kinda like the VA's who did Raku, Chitoge, Tsumugi, Onodera and Tachibana's voice, also I  like the sequel's OST, so it's all good (up). What is enjoyable about this sequel........well, it was basically the fact that it was a run of the mill harem based anime and it nice that studio Aniplex has limit it to just 12 instead of the usual 20 something anime, since it was MEDIOCRE all the way (up) and Overall it was just simply poor (up) since there were no big development that has happen.......not even the introduction of Haru, Fuu and MaCoy can make up for for this sequel's overall in fact it can be compared to  like eating Meat and Potatoes in 4 succeeding rows where you become tired of it but you eat it anyway since there are no other choices, so should studio Aniplex and Shaft make a 3rd sequel???????If there won't be any major developments like finally getting to know what's inside the MC guy's locket then maybe they shouldn't .",
            "date": "2015-06-26T22:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 191397,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648536.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/La_Matona301",
                "username": "La_Matona301"
            },
            "url": "https://myanimelist.net/reviews.php?id=191397"
        },
        {
            "content": "When you were watching the first season, did you ever think the following?\r\n\"Man, this anime is great! But you know... it has a bit too much plot development. It feels like Raku is going to have to pick a girl at some point, and I really don't want that to happen because endless fillers with no progression are the best. That progression with Onodera especially needs to go; that was really uninteresting. Can we just throw a little sister character in there that gets in the way of all potentially good Onodera scenes? And while we're at it, can we add a few more girls?Like, there just aren't enough girls that like Raku in this anime. Plus we really need to cut down on camera time for each character, you know. We're making them too interesting. OH I almost forgot, every character should ALMOST confess and then get conveniently interrupted, to preserve this dull stasis. And throw out that crap about Raku having to pretend he's in a relationship with Chitoge. I mean, be sure to remind the viewers that it's apparently still happening, but remove all of that tension with Claude and the opposing families. It's just too stressful, and getting in the way of moar girls.\"\\n\\n\r\nWell, I certainly didn't. Admittedly, I like a lot about Nisekoi:, though the reasons for that were established in the first season. The girls are cute and interesting, and had (past tense) a decent amount of plot development. But for some reason, the producers decided to bust out every rom-com cliche in the book for this second season, and in the end it felt a bit like To Love-Ru with out the ecchi (so... not much of anything). It was enjoyable, but completely lost the gripping feeling I had in the first season to watch just one more episode before going to bed.\\n\\n\r\nThe tension of every scene in the season 1 was so well put together. Raku desperately trying to appeal and appear single to Onodera, while having to fake a relationship with Chitoge. The anime really only needed those three characters as part of the love chart. You shouldn't expect any of that beautiful tension in this season. Each episode is basically a vignette of a particular character, experiencing one scene with Raku. It's a bit more than that at times, but it definitely doesn't feel like an evolving and continuous story anymore. It's just five girls hiding their feelings for Raku. (Really, five? Did we need another generic rom-com? OK I'll stop.)\\n\\n\r\nAs I said earlier, this season is only a 7/10 to me because of the support of the first season. Without the first season, this would likely be a 5/10. I still think it's enjoyable, but just be warned that you won't see the pleasantly surprising pace that you're likely used to.",
            "date": "2016-02-24T01:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 211585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/64068.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/theeggman85",
                "username": "theeggman85"
            },
            "url": "https://myanimelist.net/reviews.php?id=211585"
        },
        {
            "content": "What's That I Hear? #Team Chitoge, #Team Onodera (And So On, Too Lazy To Mention All The Teams) So Which Team Won This Season? Let's Find Out In The Review Below\r\nStory: 7/10 This season literally didn't have any story to it. All episodes were split into two different stories = split story series it was this season. But the split stories were good with some being related to the main female characters and new characters along with some old characters. I think the manga might end with Raku being with Chitoge (This is not a spoiler. It is something I imagine might happen in thenear future.) \\n\\n\r\nSound: 9/10 Now this is something I have to give credit to cause there was separated ED for each main female character = Chitoge had her own ED and so did Onodera along with the other characters. The OP was pretty good and some music tracks in anime were good\\n\\n\r\nCharacters: 8/10 The characters aren't special in any way as always they are just like how there were in season 1  but this season we get to see the different sides of few characters along with some side characters and addition of 3 new characters.\\n\\n\r\nAnimation: 8/10 Animation was splendid for me this season (I think I am exaggerating a bit here) I really liked the art style, chibi design done and background design. Also some chitoge faces were really worth watching the show.\\n\\n\r\nEnjoyment: 8/10 It was pretty fun for me as there were unexpected things happening every now and then (Not like 1st season) I tell you one thing there's alot more fun you can expect from this than the first season. So happy watching  laughing\\n\\n\r\nOverall: Another good anime to watch when you are bored/tired from you work and school/college related stuff\\n\\n\r\nOverall Score: 8/10\\n\\n\r\nPersonal note: I suggest you buy the blu-ray to enjoy the animation and at the same time donate some money for the animation studios \\n\\n\r\nPersonal note 2: Don't expect story development from this season cause it ain't happening. Just enjoy the show for it's comdey.",
            "date": "2015-06-27T07:11:00+00:00",
            "helpful_count": 8,
            "mal_id": 191433,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3243657.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Codered-sama",
                "username": "Codered-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=191433"
        },
        {
            "content": "STORY - 6\r\nART - 9\r\nSOUND - 8\r\nCHARACTER - 8\r\nENJOYMENT - 8\r\nThe fire may have slowly died down in Nisekoi: but the lingering warmth and erratic flickering of the flames were enough to awaken my comedic spirits. Observing the characters in this season was laugh-inducing. On the other hand, the lack of a story could define it as a time-waster.\r\nContinuing from its prequel, the charming cast is back with their romantic stresses close by. This time, rather than having an underlying plot with the pendant and the promised girl that we've gotten from before, it shifted more towards everyday activities. Episodic and digestible, everything was givenoff with a comedic spray full of love issues. In short, comedy had become a dominant replacement. Misunderstandings, inconveniences, and exaggerations were scattered throughout. Repetitions were present and some of the jokes were too forced to get any laughs out of me but overall, it had a great chemistry with various personalities reacting in entertaining manners. All that said, a few episodes were actually dedicated to short story lines that featured the main characters' history, giving each some spotlight. Other than unlocking more aspects with their characterization, from childhood memories to family ties, it also showed how they handled romance at their own pace. New characters were introduced to highlight them as well although the lack of screen time meant that any chances of investment were erased with the exception of Kosaki's sister, Haru Onodera. Witnessing her contradictions and ever-growing awareness towards Raku was a really fun high point for this season.\\n\\n\r\nCoating the surface of their everyday lives, the art remained as dazzling as ever. Playing around with lighting and mixing in geometric backgrounds created a highly-spirited ambience. It's sparkly and glimmered about with rainbow colors. With the above average animation exaggerating many visual gags, entertainment was there to tickle you at every corner. The presence of Shaft's distinct style, including prolonged close-up shots, achieved personal connections with the characters. Feeling their cuteness and embarrassments, their emotions were expressed as an appealing factor for your best girl of choice. Moe and chibi comedy captivated me while the jolly kind of soundtracks playing in the background clicked with the fun vibes. They were gentle on every scene. If the characters' attractive appearances weren't enough for you, the voice acting served as a delightful personality enhancer. They brought out a matching quality to let their persona shine through. From Chitoge's more-dere-less-tsun attitude and Kosaki's adorable endearment to Marika's clingy obsession or even Seishirou's tomboy coolness, despite the differences, they all have a similar feminine quality that was alluring and entertaining to listen to. Haru's voice seemed like she was about to lose her voice though but nevertheless, it was definitely cute.\\n\\n\r\nNisekoi: managed to operate with its still strong hilarities although the faded plot progression signified a lower glamor compared to before. It's a season of laughter with small hints for the promised girl. And if you don't mind that, it's a nice bundle of fun to enjoy in your free time.",
            "date": "2018-06-20T05:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 281643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=281643"
        },
        {
            "content": "if your read this review you already watch season 1 of this series. but not like seasons 1 this sequel just take daily life and littlebit improvement of character, if i says in one word this season more like one big OVA. New heroine and character maybe make story more progressive but if you want watch you can begin at eps 7, eps 1 until 6 is still daily life about heroine there is no important part in it. and unfortunate story have a flag about pendant, keys and childhood promise not explained at this seasons.\r\nbut like seasons 1 comedy and romance can still ienjoy it, and this season still have improvement at heroine and chraracter but not at childhood promise.\\n",
            "date": "2017-04-24T05:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 246216,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2890101.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nazeminato",
                "username": "nazeminato"
            },
            "url": "https://myanimelist.net/reviews.php?id=246216"
        },
        {
            "content": "*THIS REVIEW CONTAINS SPOILERS*\r\nThe first season was funny, romantic and adorable. This season on the other hand feels different. Not necessarily worse, just different.\r\nBefore anything else- please keep in mind that there are minor and major spoilers in this review, furthermore, if you haven’t seen the first season yet ( for whatever reason ) please don’t read the review due to huge spoilers.\r\nStory ( 6.5/10 )\r\nThe story starts where it ended; Chitaki being in love with Raku. However she is completely aware of it this time. Long story short- this is also how the season ended. The reason why the first season was so adorable, funny and romantic was due the relationships that were being developed. This season on the other hand has no character development. Instead they throw two new girls at you, in hope to spice up the relationships.\\n\\n\r\nThis anime went from a romantic/comedy to a harem. The reason this development is so disappointing is because of the first season. The first season didn’t feel like a harem until the ending, they simply spend so much time around character development.\\n\\n\r\nYou might ask yourself, is there really no character development at all?\\n\r\nThe first few episodes showed potential, however after the well known ‘magical girl’ episode it went all downhill.\\n\r\nJust like the first season there were moments of hope, moments of ‘is this ship finally going to leave the harbor and set sail?’. However just like the first season these events got interrupted by the most cliché things ever. It was funny at first, but it almost feels they are going to drag this story on forever.\\n\\n\r\nEvery single episode after felt like a filler with no purpose. The episodes were divided into two chapters of the manga, which made Nisekoi: no longer a story based anime, but gave it more an episodic nature. It honestly didn’t fit the anime after such a promising first season. The comedy however stayed funny.\\n\\n\r\nDon’t get the wrong idea about Nisekoi: though - it might not be as romantic as the first season. But it’s still worth your time if you enjoyed the first season. Apart from the lack of story and romance it's almost the same.\\n\\n\r\nCharacters ( 6/10 )\\n\r\nAs mentioned earlier in the review, we are introduced to two new characters, Paula the assassin and Haru, Onodera's little sister.\\n\r\nTo be fair- they are likeable( just like any other character in this show ), but this development makes the anime so much more complicated then it should of been. Older characters get less screen time and basically made the developments in the first season irrelevant.\\n\r\nThat being said, the characters in Nisekoi might not be unique but they are likeable nonetheless. \\n\\n\r\nArt ( 9/10 )\\n\r\nTopnotch, just like the first season. Really flawed characters, pretty backgrounds and really polished art overall. The reason why this anime can be considered as a comedy is also due to it’s unique way of expressions (which in this case really helped the anime).\\n\\n\r\nSound ( 7/10 )\\n\r\nThe opening and endingsongs were enjoyable and the soundtrack played during the episodes themselves was good aswell. Really nothing to complain about.\\n\\n\r\nPersonal enjoyment ( 7/10 )\\n\r\nYou might ask yourself, why did you still give Nisekoi an 7 despite all the things you’ve written?. To be fair, this anime is a good example of wasted potential, but it was enjoyable nonetheless.\\n\r\nEven while character development might be lacking and the story seems to be going nowhere, I did enjoy Nisekoi:.\\n\\n\r\nIs it as good as the first season? That is up for you to decide, I personally dislike harems due to their nature to never pick a girl and keep on dragging the story for countless of episodes. However if you do enjoy harems Nisekoi might be your piece of cake.\\n\r\nI would enjoy a third season to be fair- but not as much as I was looking forward to the second.\\n\\n\r\nThanks for your time, if you got any questions or recommendations to make my reviews better feel free to PM me.",
            "date": "2015-07-29T14:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 194639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4690893.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snowyboy",
                "username": "Snowyboy"
            },
            "url": "https://myanimelist.net/reviews.php?id=194639"
        },
        {
            "content": "Nisekoi, this title makes me wonder, was my love for Nisekoi: fake, or was it not? Well surely it cannot be fake, right?\r\nBefore I continue on, if you want a more in depth review then you may skip this read. I will also assume you have watched AT LEAST the first season of this show, and know a little bit of base knowledge for this season so I can \"spoil\" some of the more obvious stuff.\r\nFor those of you who take the time to read this, thank you. \r\nStory 4/10 (Let's dive right into it~)\r\n\"Raku and the girls are back! The hunt for the keyto his heart and locket continues in the second season of this fan favorite anime series.\" This was the synopsis, or the outline/summary/plot of the anime that they seem to tell you. But in all seriousness, there really wasn't much to do with the key and the locket in this season. Sure the characters who have a key tell you how they feel, and sure they talk about it, they just don't really capitalize on this point. Which, was a major flaw, and the synopsis sort of, well got my hopes up. The story/plot in this season merely turned into a love fest of needy girls. And the filler episode, just sort of destroyed me, I was not into that episode at all.\\n\r\nThe story wasn't much of a story in this season, I mean they did make progress it was just sort of awkward to react to. When I say, \"make progress\" I meant, \"almost no progress.\"\\n\r\nSure some episodes were sweet and heart warming, but mean while, others just didn't feel necessary. Overall I was ready for the worst, but really anticipating the best. Story wise I was let down. (Disappointment...)\\n\\n\r\nArt 7/10 \\n\r\nI'm not usually too picky when it comes to art. For Nisekoi I'm not that dazzled, but I do have to say that the very bright colorful, in your face color palette was good. The animation was pretty good, I've definitely seen animation like this before.\\n\r\nNothing that outstanding, but something I liked.\\n\\n\r\nSound 8/10\\n\r\nI'm also usually not that picky when it comes to sound either. There are a few points that I'm looking for though, like having a nice opening/openings and nice closing/closings. In the first season of Nisekoi I was truly amazed, I fell in love with pretty much every opening and closing that it had to offer. For the second season, that wasn't the case. Still, the sound track was still quite good, and it fit the anime well. Same with the voice acting, all the voices are pretty spot on, I enjoyed listening to them. \\n\r\nIn all seriousness the sound is probably the highlight of Nisekoi: . \\n\\n\r\nCharacter 5/10\\n\r\nWhen I watch Nisekoi, I love watching for the characters. They aren't THAT unique, but they all have their weirdness's to them, which I adore. When it came to Nisekoi: I felt like they didn't stick true to how the characters were in the first season. Of course, you do have to take to account how the characters feel/act around the MC, after the events of season 1. Which does change how the characters are in Nisekoi: quite dramatically, which was \"meh\" to me.\\n\r\nWhile the characters did change, most of them had very little progress made in terms of story. I feel like the show sort of denied progress for characters who needed it, and let characters who didn't need it, get it. They added in some new characters to this season, which I didn't mind, but having characters sort of just \"being there\" can just be a waste of time. Overall most characters barely made any development and the characters became sort of predictable, and bland. Bland because they sort of just do the same thing or act the same way over and over and over again. \\n\\n\r\nEnjoyment 6/10\\n\r\nI fairly enjoyed Nisekoi:. Once I realized that the show was going to focus more on the character aspect more than the story aspect I sort of realized that I should just enjoy it on how it is. Of course story plays a huge part on enjoyment for me. So when you start to stray from that I also start to stray from that, meaning I end up not focusing on it too much since I know i'll just get my hopes up. Overall my enjoyment was purely based on the characters, sound and art. (Which can be a good thing, but at the same time also a bad thing.) \\n\\n\r\nFinal Verdict 5/10\\n\r\nWhen people say, Nisekoi should be enjoyed for how it is, it should be, I do not disagree on this point. I do agree with people who say, well this season made me sad, since it did make me sad. I was sooooooooooo, disappointed. The quality just dropped, you know when people say, it went \"0 to 60 in 2 seconds!\" That's sort of how it was for me, except it went from 0 to 60 then steadily back to 0 in a few episodes. The 0 to 60 was season 1, and then the drop to 0 was season 2. \\n\r\nI recommend this to those of you who want laughs, since this series is just funny. But beware that this season of Nisekoi can be highly disappointing, and well just not that good.",
            "date": "2015-08-02T00:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 194946,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4710550.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SunZun",
                "username": "SunZun"
            },
            "url": "https://myanimelist.net/reviews.php?id=194946"
        }
    ],
    [
        {
            "content": "That's it? The last episode didn't feel like a finale. I kept thinking as I was watching it, \"I thought this was the last episode but how can it be?\" I loved this season aside from the first and last episode. They both felt like filler episodes. Maybe I'm just not a Chitoge fan, but I find her episodes a bit boring. Haru and Kosaki on the other hand are perfect. Haru somehow has stolen my heart and made the show even better. I like Marika too (although she was hardly in the season) and Tsugumi is amazing. The magical girl episode was so differentbut one of my favorite episodes. Overall, very bad start and very bad ending.",
            "date": "2015-06-26T22:35:00+00:00",
            "helpful_count": 7,
            "mal_id": 191391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685632.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nekocyan",
                "username": "nekocyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=191391"
        },
        {
            "content": "I dislike this season because:\r\n1) episodes has been reduced (1st season have 20 while this time only 12)\r\n2) there is too much filler in this season\r\n3) many part of the episodes are not connected to earlier episodes\r\nfor those enjoyed the 1st season, you can continue watching this 2nd season but don't put your hopes too high as it might disappoint you...",
            "date": "2015-07-21T15:02:00+00:00",
            "helpful_count": 7,
            "mal_id": 194014,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1490793.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MuhdNurHidayat",
                "username": "MuhdNurHidayat"
            },
            "url": "https://myanimelist.net/reviews.php?id=194014"
        },
        {
            "content": "If you expect to see character development after seeing all the development from Season one then you're someone like a typical shounen fan where everything can transform instantly I guess, this is rom-com so don't expect super Saiyan transformation level or progression here\r\nSince the characters were introduced and developed, and we get to see where they are at there shouldn't be much development only progression towards accepting their own true feelings.\r\nThe first season was for introducing the characters, but this season is mainly to see their interactions and how they handle their feelings.\r\nThis season focuses on mostly the characters' interaction with one another to seewhat they actually feel. In the end, we get to know they kinda come to an understanding with their feelings which is nice to see.\\n\\n\r\nIf you're to watch for character development and analyze the anime itself please just give up because there's nothing here honestly. Story cant change upside down dramatically in 20 episodes, this is to be expected it's not a shounen focused but a rom-com.",
            "date": "2018-12-04T23:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 295291,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VRez",
                "username": "VRez"
            },
            "url": "https://myanimelist.net/reviews.php?id=295291"
        },
        {
            "content": "Nisekoi: is the 2nd season in the Nisekoi franchise and most likely not the last we'll see of it; which is something to be thankful of.\r\nThe first season of Nisekoi is brilliant, and whilst the 2nd season is far from bad; it is definitely not quite as enjoyable or moving as the 1st season. \r\nNot that this should have to be said, but watching the sequel season would be pointless if you haven't seen the first...watching the OVA's however isn't really necessary.\r\nThe second season continues the with Raku and Chitoge continuing their fake relationship, and the situation regarding which key (Chitoge's, Marika's or Kosaki's) isthe one to open up Raku's locket, meaning who he loved and promised to marry as a child, is yet to be resolved. \\n\r\nRaku saves a young girl one day who was in trouble but in the process loses his locket by accident. The season continues from here showing the impact this new girl has on the situation, and Raku trying to get his Locket back.\\n\\n\r\nThere are two big changes in this season. The first is the introduction of two more characters whom have relations to the main cast, the second is a change in how each episode is carried out (I'll explain shortly).\\n\r\nThe two new characters (Named Paula and Haru) are both enjoyable, and compliment the already excellent selection of characters very nicely. One of them gets considerably less screen time and character development than the other but based on the plot for this season that was always going to happen.\\n\\n\r\nWhat may annoy some viewers, or they potentially just find less enjoyable; is that this does subtract time away from some of the cast, If there's a particular shipping you have for this anime, you may have less time to enjoy it as you'd like (the heaviest casualty here is Marika).\\n\\n\r\nWhat I've previously stated didn't annoy me personally, as I thought the main reason for a decline in quality of the second season is the change in episode structure. With the exceptions of a few episodes, the episodes are basically split into multiple (mainly two) stories. Sometimes they're linked, some involve the same character(s) being focused on and sometimes it's seemingly random. \\n\r\nThis leads to a season where there is minimal plot development at times and has in many ways the feeling of a filler season aimed at easing in new characters and slowing down the story's pace. \\n\\n\r\nNow based on what I've said already, you might get the impression that 2nd season is vastly inferior, not enjoyable or perhaps not worth bothering with...If that is the case I have misled you as that would be incorrect.\\n\\n\r\nThe second season maintains the same kind of charm, humour and dilemmas that the prequel had in abundance, meaning that you'll most likely find this season enjoyable too. Just be aware that this by no means a clone in style to it's predecessor, and whether that's a good thing or not is ultimately for you to decide.",
            "date": "2015-06-26T12:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 191330,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4587217.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RDLVAlmond",
                "username": "RDLVAlmond"
            },
            "url": "https://myanimelist.net/reviews.php?id=191330"
        },
        {
            "content": "After Watching Season 1 and getting dissapointed i didnt have my eyes on Nisekoi anymore but i thought i should give it a try after reading reviews on myanimelist about the 2nd season.First of all Nisekoi isnt an anime that story/plot is good it totally sucks and i knew it before i started watching the 2nd season,if you are reading this and want to watch Nisekoi for plot/story i suggest you dont start it at all.                                                     Second of all in my opinion Nisekoi has one of the best art on anime i have ever seen though i think it got a little bad in the 2nd season                                                The Sound wasnt anything special it was ok                                                         I Personally Love all the Main Characters of Nisekoi expect the Male Main Character because he is a baka Also i liked all the Supporting Characters as well.                          Enjoyment was something else for me,I had a great time watching Nisekoi,i wouldnt have that much enjoyment if the 2nd season would have continued the same as the 1st.                                                                                                                             Overall i put an 8 Because the Art,Character and Enjoyment were really good despite the sound and story being ok and bad.",
            "date": "2015-10-12T12:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 201102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4457735.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/LouM",
                "username": "LouM"
            },
            "url": "https://myanimelist.net/reviews.php?id=201102"
        },
        {
            "content": "THIS REVIEW HAS SPOILERS\r\nNisekoi had a story that definitely made me interested at first but dragged on at times and became an utter disappointment. The characters are annoying and frustrating and could have been so much better.\r\n1st season's story progressed at a tolerable rate until bitch ass Tachibana came around. This season was just complete butt. 2nd season was basically like a slice of life about stupid things. What the hell is this stupid shit with Tachibana needing to pass a math test. Dumbest waste of time. Onodera's younger sister was SO annoying when she was introduced. Not much progress was made in regards toIchijou's true love. That magical school girl episode was actually so pointless.\\n\\n\r\nI did enjoy the episodes involving Kirisaki's mom, and Onodera's sister becomes less of an annoyance after episode 9. Now we're back to a retarded episode about \" onodera needs to lose weight! \"\\n\\n\r\nwhat the actual\\n\\n\r\nAt least Kirisaki isn't a complete bitch towards Ichijou like she was in the 1st season, so that's a massive relief.\\n\\n\r\nBut honestly, characters do the dumbest things, make the dumbest choices, are so indecisive, and could have been fleshed out so much better. Loved the art style of Kirisaki, Ichijou's character design was tolerable, Tachibana was infuriating, Tsugumi was the least annoying character of them all.\\n\\n\r\nEnjoyment 8-9/10\\n\r\nOverall 7/10 would watch again",
            "date": "2015-08-06T21:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 195388,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3136699.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lvl2Cow",
                "username": "Lvl2Cow"
            },
            "url": "https://myanimelist.net/reviews.php?id=195388"
        },
        {
            "content": "Story: The story is nothing completely new, it's innovative. There are events that correlate with the life situations of the characters. It's a harem. You get one guy with a flock of girls trying to impress him. There is a good amount of character development. The characters' feelings change and their actions follow suite. A predictable story at times, but enjoyable in the way the characters' personalities are portrayed. \r\nCharacter: The characters themselves have unique traits except for the main male protagonist and the female he is dating. They both kind of fit into a generic couple that can be very boring at times. Theshine of the show comes from the other main characters, meaning every other female. \\n\\n\r\nArt:The art style isn't too memorable, it's the character design that is memorable. There are a lot of vibrant colors, and the eye designs stand out. Proportions of the characters are all made to be attractive, most of the characters maintain a very similar body shape. Quality animation, the \"sparkle\" effect scenes are cute and tend to stand out in a good way. \\n\\n\r\nSound:I am not much of a sound person, as in I don't particularly pay attention to the kind of music. Most anime tend to have great music that is fitting for the mood. The voice actors did a good job conveying senses of embarrassment, anger, sadness, ect. in each character. There weren't any choppy sound effects that I could pick up on. \\n\\n\r\nI really enjoyed this series overall, mostly because I am a sucker for RomComs. If romantic comedies are your style, then this is a must-see. \\n\\n",
            "date": "2016-04-17T12:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 216583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3979971.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SlimyPickle",
                "username": "SlimyPickle"
            },
            "url": "https://myanimelist.net/reviews.php?id=216583"
        },
        {
            "content": "TL:DR: Sequel isn't good as prequel.\r\nIn the beginning I have to thank to my long travelling time to-and-fro in between my place and my uni so that I could finish Nisekoi, 2 seasons along with the OVAs, inside the bus. I hope that the passengers wouldn't consider me as a weirdo or whatever because Nisekoi isn't something that you can watch in public (especially during certain scenes, welp)\r\nStory: 5\r\nNisekoi: continues whatever left behind in Nisekoi... or not. There are only very few episodes about the main plot, while the rest are \"technically\" fillers. As I mentioned in my review about the first season, I neverread its manga so I didn't know anything about the second season. Since the studio decides to follow the manga plot, you can hardly blame anyone for this.\\n\\n\r\nRather than calling Nisekoi: a second season, it's more like a visual novel, with Raku as the main character entering different characters' routes and helps solving their problems.\\n\\n\r\nBreakdown for each episode:\\n\\n\r\nEP1: Chitoge\\n\r\nEP2: Tsugumi\\n\r\nEP3,4: Chitoge\\n\r\nEP5: Marika\\n\r\nEP6: All of them\\n\r\nEP7: Kosaki's little sister, Haru\\n\r\nEP8: First half filler, second half Haru\\n\r\nEP9: First half filler, second half Kosaki and Haru\\n\r\nEP10: Shu and maybe... Ruri\\n\r\nEP11: Kosaki\\n\r\nEP12: Chitoge\\n\\n\r\nPretty much summarising \"second season\".\\n\\n\r\nArt: 8\\n\\n\r\nStill very good compared to the first season, so it remains as 8.\\n\\n\r\nSound: 7\\n\\n\r\nWell, I don't really like the OP as compared to that of first season. EDs are again performed by VA and OST is just \"meh\" for me.\\n\\n\r\nCharacter: 5\\n\\n\r\nAside from characters from the first season, we have new characters joining second season, but does that mean good? No.\\n\\n\r\nUnfortunately, most of the old characters show little to no development in the second season. We have new character, Haru, who is a protective little sister who tries to keep her sister (Kosaki) as far away as possible from Raku due to a lot of misunderstandings. Eventually, it seems like she joins the \"harem\" group as well. We also have another new character called Paula, who appears as a rival of Tsugumi, but there's zero development about her.\\n\\n\r\nThe only thing that I am surprised of, is during Shu's route, ended with Ruri's VA singing the ED. (For a moment I was expecting Shu's VA singing the ED lol)\\n\\n\r\nSo, Shu x Ruri confirmed? :P\\n\\n\r\nEnjoyment: 7\\n\\n\r\nWell, there are still a lot of funny moments throughout the series though I have to admit that the cliches are being overused.\\n\\n\r\nOverall: 6\\n\\n\r\nIf you have some time, Nisekoi is okay as a whole, but don't raise your hopes too high when you watch its sequel. Otherwise, be prepared to get disappointed (like me).\\n\\n\r\nIn short, Nisekoi: doesn't have an ending (in anime) yet so I am guessing there will be a third season... no idea. If you wish to know how the story goes, read the manga (which is not going to happen, for me)\\n\\n\r\n~~~~~~~~~~~~~~\\n\\n\r\nAs for the OVAs....\\n\\n\r\nif (your interest = fan service)\\n\r\n   watch it;\\n\r\nelse\\n\r\n   don't watch it;\\n\\n\r\nNeedless to say, I watched them and oh gawd the amount of fan service... (insert your own imagination here).\\n\\n\r\nPhew, a long review eh.",
            "date": "2016-03-01T08:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 212027,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2529171.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/imnoob92",
                "username": "imnoob92"
            },
            "url": "https://myanimelist.net/reviews.php?id=212027"
        },
        {
            "content": "This season was disappointing story wise. If you've seen the first season, which I'm sure you have, they have their story built,but they are not doing anything with it.Just filler and an occasional hint to who \"The Girl\" is. We even get to learn the significance behind things we thought were little. None the less they still played their part as a romantic comedy.  \r\nArt: As usual the art was fantastic. The art in this show really ties in with the comedy and brings life to it, so you sit there bored. Some parts are a little outrageous, but nicely done.\r\nThe music was fantastic.The sound when with the mood of the show the whole way through. You might want to sit through though the OP and ED.\\n\\n\\n\r\nCharacters: The characters  were done well. The reason I say just \"well\" is some characters are becoming extremely annoying. More specifically, Raku, Chitoge and Kosaki. The only reason all three main are annoying me is because this love triangle is boring. It's played out at this point, and their being too obvious, yet somehow they're all oblivious. Also, Tachibana is just in the way now. It was nice to see her in the first season because she made it interesting but, I can't stand her anymore.\\n\\n\\n\r\nThough the story was disappointing, I was enjoyable nonetheless. At its core, its still \"Nisekoi\" and you cant really push that aside. Considering, \"Nisekoi\"means \"False love\" I guess they still played their part.",
            "date": "2016-01-17T04:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 208733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3700537.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Animeguy25",
                "username": "Animeguy25"
            },
            "url": "https://myanimelist.net/reviews.php?id=208733"
        },
        {
            "content": "I don't think I will have much things to say since I have write most of things I wanna say about Nisekoi in the previous season. But there is one thing about Nisekoi: that I wanna say to you guys before you watch this:\r\nGo read the manga first!\r\nWhy? I will explain. There is anime that filled with way too much filler episode like Bleach and Naruto. And here Nisekoi:.....the manga that remove filler from the manga (LMAO)\r\nWhat's bad? That actually some story that removed pretty much important relation in the story (For example: Paula McCoy introduction to Raku group) Why is it important? in theanime they remove that part and go direct to the Pool Cleaning which then skip why the lone 'white fang' consider to join Raku group with Haru Onodera.\\n\\n\r\nAnd some other story I don't really recall since I read the manga after finishing Nisekoi:\\n\\n\r\nAh right..I was looking for the chapter to continue from Nisekoi: (which is happen in the chapter 101) and I start at 72 (The first time I met that shrine maiden that tell Raku have bad cursed if it's not settled before new year...which happen to be very funny) and I don't recall watching it in the anime. So I thought it was the latest chapter after ....that's what I thought until I met familiar chapter few chapter after that. Then I realize..oh man...THEY SKIPPING THE CHAPTER.\\n\\n\r\nIt's a bit waste actually since as slice of life comedy manga most chapter is worth the time. I'm not sure why the production team chose to do that and settle with a 12 Episodes Series filled with arc story that I don't think fitting the core storyline (I mean what the hell is that filling the series with Onodera Mahou Shoujo Patisserie)\\n\\n\r\nWhen I notice that manga Nisekoi have 220 something chapter then I know I hate this type of anime where I got to wait forever for them to finish the story (which more often or not they don't!) Just like what happen with Tonari no Kaibutsu-Kun which was pretty shame since the manga is totally masterpiece IMO.\\n\\n\r\nOh well...still Nisekoi: have the same characteristic with Nisekoi, no different in term of presentation (Shaft as always).\\n\\n\r\nI am expecting a longer series because the story is fun enough to be enjoyed in the daily basis. Oh that reminds me fellow audience....\\n\\n\r\nTRY NOT TO BINGE WATCHING NISEKOI. You may enjoy it since the core story is expanded in the series of high school life of Raku.\\n\\n\r\nDon't forget again...I recommend you to read the manga first (at least until Chapter 100) then you can happily watch this. Cheers!",
            "date": "2016-11-07T22:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 233418,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5161820.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/samuel_sfx",
                "username": "samuel_sfx"
            },
            "url": "https://myanimelist.net/reviews.php?id=233418"
        },
        {
            "content": "This anime was wasted because of generic protagonist #98726. If it shifted towards the conflict between the yakuza and the beehive the story could have been better but no it had to be that generic harem shtick. This might as well be an isekai anime since the characters are so unrealistic.\r\nStory 3: It's a harem. Guy likes someone and shocker she likes him as well. Did they do anything about it? Well he's no generic guy if he decided to make a move now. It's so frustrating to watch how the main characters are so afraid to make a move knowing they like each other.What's worst is none of them seems to take a hint.\\n\\n\r\nCharacters 1: raku is one my most hated character. He's nice and suddenly all the characters are going for him. What!? Chitoge is the tsundere that wins in the end. Kosaki is the childhood friend that loses (oops, is that spoiler? Idc). Tachibana is the sick girl that loves raku and loses. I forgot the rest of the casts.\\n\\n\r\nArt 6: It's made by shaft of course it's good.\\n\\n\r\nSound 4: op's are decent. I never really cared for the ed and ost.\\n\\n\r\nEnjoyment 1: like I said before if it shifted it's focus on the conflict between the war of the two gangs and made the false engagement between raku and chitoge a side story this could have been a better anime. For instance make 1 member of the yakuza have a grudge on someone on the gang but because of the cease fire he gets a dilema of pursuing his revenge or maintaining the peace among them.\\n\\n\r\nOverall 2: if you're new to anime you might find something to like about this show but if you've seen a lot of anime this will be frustrating to watch. Especially that ending.\\n",
            "date": "2018-08-13T00:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 286350,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4638953.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/The-End-of-Mike",
                "username": "The-End-of-Mike"
            },
            "url": "https://myanimelist.net/reviews.php?id=286350"
        },
        {
            "content": "Nisekoi review\r\nThis is the story of a boy with a pendant and some generic girls who are boring.\r\nStory 2/10\r\nThis show had a good idea and concept and tried the deconstruction of the harem-school genre anime but everything became a mess. Why is it a mess you are wondering because the characters failed to do their job according to the concept and idea that the author came up with it.\r\nThe story is not much to say about it’s common because the setting is in a school the characters are generic school anime characters : The usual dumb dense main character with the same haircut , thetsundere childhood friend , the reverse trap , the legendary transfer student with a big plot and heart and finally the megane character who is usually the friend of the mc.\\n\r\nThe purpose of the story is that the main character can find the girl of his dreams from his childhood using a stupid pendant and a key who can open that pendant is the choosen one.\\n\r\nThe story started well the main character made a pact with a girl to engage in” false love” that’s fine it suits the rom/com anime where the mc has to encounter many obstacles and misunderstandings to get the girl. What was poor executed was the fact that it was predictable from the fck first episode who would he end up with. I question myself what was the purpose of the pendant and key used as a plot device if that didn’t bring any change to the ending of the story. \\n\r\nSeason 1 was enjoyable ,good, the characters had development the story was progressing well and then season 2 came and everything became a clusterfuck. Instead of focusing on the characters and the progression of the story and have a fck ending the season was filled with stupid fillers that had no connection and didn’t help the story at all. \\n\r\nThe good thing from season 2 was the story of Chitoge’s mother which helped us to find more about her and her circumtances. Another mentionable thing is the confession and teacher love complex from Shuu this added a tone of maturity for the show.Thats all the rest was a waste of time and garbage filler stories.\\n\\n\r\nCharacters 1/10\\n\r\nThe most generic characters for a rom/com anime but some of them bring something different to the story but the execution of it it’s a dizaster.\\n\\n\r\nRaku the main character who is dense and dumb as fuck. Why because he can’t even read the fck clues when a girl likes him or tries to confess to him.Let’s not mention the plot convience devices this anime adds to drag on the story and make it a eternal challenge for the mc to choose a fck girl already.\\n\\n\r\nChitoge the usual annoying thorn in the side of people tsundere character. Why every school –genre fck anime uses a tsundere it’s a overused cliché and concept.Her character is simple she is the “false” lover of Raku and they are just pretending to date and other bullshit but guess what like in every rom/com generic anime she falls in love with him but acts as a tsundere and never admits her feelings.\\n\\n\r\nMarika the transfer student which every rom/com requires she has a kind heart and loves Raku. But wait the mc is so fck stupid that he doesn’t get that so he needs a key who can open a pendant to understand that.\\n\\n\r\nOnodera this the waifu character for every plebian who watches an anime for the 2D girls not the story . She is perfect what can I say more I want her too but wait the mc was such a bastard and a dumb fuck (I love Emilia). I hope a truck runs over him.\\n\\n\r\nTsugumi is the reverse trap who dresses as boy because she has her circumtances but a good think and what makes it different from other anime is the fact that Nisekoi explains why she does that.\\n\r\nThank you.Also my favourite character because of the big plot.\\n\\n\r\nOther characters are boring as fuck and generic and I don’t even remember them they’re just for the sake of the story or used as plot devices to make the story endless.\\n\\n\r\nAnimation 7/10 \\n\r\nBeautifull colors which enchant the girls and make them more sexy and attractive as a 2D waifu material.\\n\\n\r\nSound 9/10 \\n\r\nThe first song was awesome because Clariss has the best voice . Also I am biased towards that .\\n\\n\r\nEnjoyment 4/10\\n\r\nOf course I enjoyed fanservice and a nonsensical story who doesn’t like to see Tsugumi and Raku in a closet sweating together and then more fanservice bath scenes and of course the legendary beach episode. What a masterpiece of anime is made nowdays great just great!\\n\\n\r\nOverall 4/10 \\n\r\nNothing special for this anime unless you like some drama mixed with comedy but that was well done in season 1 but in season 2 was a clusterfuck and a joke.\\n\r\nIf you are searching for your 2D waifu like all weboos do this anime definitely suits your taste. As a conclusion I enjoyed the anime the comedy and the girls but the story was pure shit full of cliché and other dumb stuff.",
            "date": "2017-04-05T03:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 244685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=244685"
        },
        {
            "content": "Uh, so this season was pretty disappointing. It contained so many fillers that even if you don't follow the manga, you will have missed nothing. \r\nStory: 5/10\r\nEssentially nonexistent. There seemed to be some sort of story in the first few episodes, but the later ones are 100% filler and there was even one episode that was just a pure spin-off from the parent story. There is basically no romance development; just random short stories that do nothing to move the plot forward. \r\nSome people might say that the second season remained faithful to the manga. It did, but there was enough source material that theycould have skipped all these filler episodes. Instead, they chose none of the plot-advancing parts and just stuck with useless short stories. \\n\\n\r\nArt: 7/10\\n\\n\r\nIt actually feels like the art downgraded from season one.\\n\\n\r\nSound: 7/10\\n\\n\r\nAverage opening and ending. Many of the soundtracks from season one are reused in season two, which is neither good nor bad.\\n\\n\r\nCharacters: 6/10\\n\\n\r\nEven though the characters are pretty generic and fall into harem character archetypes, they still somehow managed to keep it interesting in season one. In season two, however, they failed to focus at all on any of the characters and thus we get zero development. The same characters from season one are still the same exact characters you'll see in season two. No growth, no development, no advancement. It's just not possible to give 6+ characters development in only 12 episodes. A lot of people have said that this season could have been much better if it were 24 episodes, and I agree. They simply crammed too much into too little time, resulting in a shallow story and shallow characters. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nOverall just pretty disappointing. It's hard to find any redeeming qualities in this season when they executed the first season so well.\\n\\n\r\nOverall: 6/10\\n\\n\r\nUsually it's a good idea to watch sequels even if they're terrible, just so you can keep up with the story in case there's more sequels, but this season was so filler that you can probably just skip the entire season and wait for a (hopefully) season three.",
            "date": "2015-08-01T22:59:00+00:00",
            "helpful_count": 5,
            "mal_id": 194940,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=194940"
        },
        {
            "content": "There's always a time we are happy to get a sequel of our favorite anime. Well, there's also a time where we just want to forget the second one. Well, that time arrived for me upon finishing the second season of Nisekoi. \r\nArt: 7/10\r\nIt's still colorful and as it is like the first one.\r\nSound: 7/10\r\nOP and ED sounds fine. The ambient music fits perfectly.\r\nCharacter: 6/10\r\nNo major characters development, just new mediocre characters introduced.\r\nEnjoyment: 6/10\r\nStill enjoyed some jokes but some are too forced or recycled. \r\nStory: 5/10\r\nToo slow, FILLERS and no new stuff.\r\nOverall: 6/10\r\nI was expecting a lot of things from the second season but endedup being disappointed. I would say this series dropped down big time. You can still watch it for the lols but don't expect the plot to progressed. \\n\\n",
            "date": "2015-12-18T00:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 205882,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5048005.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/koharuchin",
                "username": "koharuchin"
            },
            "url": "https://myanimelist.net/reviews.php?id=205882"
        },
        {
            "content": "before anything, id like to say that i have enjoyed the first season. it had an amazing plot, not to mention the character adaptation and the comedy. \r\nAs far as goes, for the season, the story hasn't really developed in plot wise or even comedy wise. to be honest, i was looking forward for this season, and the story just wasn't even relevant. same characters, daily life and nothing more.\r\nOkay, if you really enjoyed the first season, i don't think it would be a huge waste of time to watch this season, yet i doubt you'd benfit anything plot wise. If you didn't enjoy thefirst season, i bet, this is a huge waste of time. \\n\\n\r\noverall, even the comedy wasn't as good as the first season and the plot didn't go anywhere regarding the main story. \\n\\n",
            "date": "2015-09-02T12:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 197690,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JustAkitteh",
                "username": "JustAkitteh"
            },
            "url": "https://myanimelist.net/reviews.php?id=197690"
        },
        {
            "content": "First of all: I'm not native english so please excuse any spelling or grammar mistakes.\r\nAnd I never planned to write a review either. But I was a big fan of the first season of Nisekoi, so I just can't stand to share my opinion of the second one.\r\nStory: 6/10\r\nAt the beginning it was great but then the whole one strongly flattens and only the usually good comedy remains. Everything else becomes simply meaningless. And also the introduction of Haru, Kosaki's sister, wasn't that special for me. Also the later arising cuts that makes a whole episode into two short stories was kind of annyoing. Bythese cuts there were also no more connections and it followed one story after another. \\n\\n\r\nArt: 9/10\\n\r\nThe art is still beautiful and I really really love it. \\n\\n\r\nSound: 8/10\\n\r\nThe sound was good. I haven't expect something else. Even though I'm not a big fan of Haru's voice but it fits her character very well. And I liked the opening very much.\\n\\n\r\nCharacter: 6/10\\n\r\nDon't get me wrong, I still love every single character in this anime. But I was a bit disappointed that they haven't changed that much. I mean, it's cute how their feelings change and stuff like that but I expected at least a little bit more.\\n\\n\r\nEnjoyment: 7/10\\n\r\nWhen the anime was ongoing I followed it up to the thenth episode. The last two took me so long to finish because I got kind of bored. But the last two were really good again and it entertained me very well. Nothing more, nothing less.\\n\\n\r\nOverall: 7/10\\n\r\nEven though I was a bit disappointed, I still enjoyed watching it. For everyone who search for something to kill time, Nisekoi; is perfect for you, just no tension construction and no clear finale can become recognizable and that makes it fell like you watch an OVA. I wouldn't be surprised if the next season has 24 episodes again and it's called Nisekoi 2.",
            "date": "2015-10-08T13:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 200783,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4784959.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kaoriix",
                "username": "Kaoriix"
            },
            "url": "https://myanimelist.net/reviews.php?id=200783"
        },
        {
            "content": "While I've written a review for Season 1 of Nisekoi, I think Season 2 is different enough to warrant it's own review as well.\r\nThe first season was much more about Raku's journey to find who gave him the locket. This was driven by the fake relationship between him and Chitoge, and the gangs who were constantly on the brink of war. Now, in season 2, those plotlines are almost completely gone.\r\nSure, they exist, however they are not included in the same capacity as the first season. I don't remember Claude even being mentioned in Season 2, and the relationship was only brought up at timeswhen a new character who wasn't in the loop needed to remind us.\\n\\n\r\nSimilarly to the first season, this season of Nisekoi does two things exceptionally well. It's art-style is out of the park, and the use of single episode stories to flesh out characters is performed spectacularly. Most of the characters are still stereotyped, however the story that these single arcs have been building at least allow us to see what type of characters they are. Interestingly enough, this season also allowed for backstory of some major characters, which was severely lacking in season 1. My complaint about the characters being \"cookie-cutter\" rings much less true by the conclusion of this season.\\n\\n\r\nStill, this show is blue balls the anime. I swear to God, I like this show yet the only characters showing some growth are side characters like Ruru, Shu, or Odenara's younger sister. If this glaring issue could be fixed, this show could easily be an 8 or a 9 for me. However when previous episodes seem to rarely have relevance to a current plot, it's hard to build a lasting investment.\\n\\n\r\nI'm gonna give this show the same rating as I gave the first season. They changed some things up, however they didn't really improve the issues I had with the first season.",
            "date": "2018-03-22T06:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 274525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6874523.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AmericanSomnium",
                "username": "AmericanSomnium"
            },
            "url": "https://myanimelist.net/reviews.php?id=274525"
        },
        {
            "content": "Did you like the first season of Nisekoi? Well, don't expect much from the second season. Why? Because it's basically To Love Ru without Ecchi. Let me explain.\r\nFirst, there was a change in plot. The previous season was very plot-driven, and characters developed as the story went on. But for this season, it was character-driven, so there was hardly any plot. It simply revolves around the heroines living their daily lives. \r\nThe good thing about this switch is that we get to know more about the characters, which makes us understand their personality even better.\r\nThe one thing that will never change in this series isthe art style. Its artistic presentation of a rom-com remained. It's colorful, spontaneous, fluid and unique. If you liked the art style of Monogatari Series, then you'll like this show.\\n\\n\r\nAll in all, it was a good show, but it could've been better. I'd recommend this to those who are fans of the characters in the show, but I prefer you watch the first season instead. Those who love second seasons are simply expressing false love.",
            "date": "2016-06-29T22:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 222398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=222398"
        },
        {
            "content": "People want honest reviews - so here's my personal opinion of the Second Season: \r\nI felt that it is Crap.\r\nMy reasoning is as follows:\r\nLittle to no plot development from the first season.  For a story to succeed - it must go somewhere.  This storyline did not go anywhere.  It's like you're on a ferris wheel and you're back to the start at the end of Season 2.  Except you're back at the Start of Season 2 and not 1 when everything was fresh and fun.\r\nExamples:\r\na. The Locket part of the story never went anywhere.  Those episodes should be considered \"filler\"as they never developed it.  The locket is broken, it gets fixed, and then they don't go anywhere with it.  It's a focus then they drop the focus entirely and go onto other things.\\n\\n\r\nb. Character interactions were exactly the same at the end of the 2nd season as they were at the end of the first.  After 12 episodes you'd think there'd be clear interests happening.  Yet - No - there were no clear direction of any interests except for the last episode and the story behind that was weak at best.\\n\\n\r\nc. Raku's love interest in Onodera should have shown some change - but no - it's exactly the same as season 1.  Where there should be some type of building/lowering of character interest/love between the two there's only 1 (2?) episodes then it's on to something else.\\n\\n\\n\r\nFinally - but not least - they lost the little bit of fan service they had and turned it into a Rom Com entirely.  At least with the first season there was a little fan service that really made the Comedy even more funny.\\n\\n\r\nThis season they tossed it to the wayside and tried to push a straight Rom Com on us.  My opinion is that they failed horribly in changing the dynamics from the first to second season.\\n\\n\r\nWhile the the first season I give a solid 8 - I can't find myself giving this season anything more than a 3.  For the artwork alone.  \\n\\n",
            "date": "2015-07-06T10:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 192500,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1112169.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/thumpz99",
                "username": "thumpz99"
            },
            "url": "https://myanimelist.net/reviews.php?id=192500"
        },
        {
            "content": "But, then season two comes along and everything that made this show stand out from the herd vanishes. Raku and Chitoge having to fake their relationship is hardly mentioned. More characters are introduced but they only serve to expand the harem. The episodes about Hana (Chitoge’s mother) were great because they served to humanize Chitoge and make Raku’s plight seem worthwhile. But the ideal that they have to perpetuate the illusion is used only as a barrier to Chitoge and Raku admitting they might actually have developed feelings for each other. Haru is presented as yet another obstacle in Raku’s path to Kosaki but becauseshe doesn’t consider her own sister’s thoughts and feelings she comes off as annoying to the nth degree. I wish Paula had gotten all of Haru’s screen time. Watching Paula figure out that Tsugumi liked Raku and press her about it would’ve been far more entertaining. Do these 12 episodes diminish the first 20? No. Are the just as good? No! Just another sequel that doesn’t measure up.",
            "date": "2017-06-05T18:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 249342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=249342"
        }
    ],
    [
        {
            "content": "Hey remember season 1. It was pretty good right? Well sadly season 2 isn't the sequel we were looking for. The story was worse than last year as they made no progress and the last episode made me want to make me pull my hair out as it made no sense at all. The good thing is that the art stayed the same as their art is beautiful. I liked the the opening rally go round, but that's it when it comes to sound and music. NOW the thing that really got me triggered was the characters. The original cast didn't change at all whichis fine. Except Markia became more annoying and Maiko's arc was stupid. But Nisekoi just had to add more characters. However more characters is not always better. The new cast sucks, and are not fully developed at all. The anime would be better without them. I still enjoyed the anime but not as much as season 1. Let's pray that season 3 can fix all of these problems",
            "date": "2017-05-27T21:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 248691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MikeQ802",
                "username": "MikeQ802"
            },
            "url": "https://myanimelist.net/reviews.php?id=248691"
        },
        {
            "content": "Allot of people have thought what it would be like if one of your childhood friends became your lover in the future... You know a small \"childhood crush\" develops from all the years you've spent together into something much bigger and more serious. Nisekoi does exactly that but they bump it up by asking \"What if your childhood FRINEDS became your potential lovers.\"\r\nWhen I think of romantic-comedies, I think of Nisekoi, it does exactly what this genre is all about... Telling the story of teens who fall in love... With some good old comedy. I'm gonna be honest, I've never read the Nisekoi manga, forthe most part i'm not a huge fan of manga's and if there is an anime adaption of something chances are i'm going to check that out instead... However I really have been meaning to get around to reading the Nisekoi manga because sadly the anime isn't fully complete and might never be... However the story the anime does tell is amazing, every character genially feels interesting and not just the main \"pretty\" girls... Almost all of the side character's in Niskoi weren't just thrown off to the side to make more screentime for the \"pretty\" girls. They even got an episode or 2 explaining their story a little more. But most surprisingly was Raku actually felt like a fully developed character. I talk about how all the time in romantic-comedies the main male characters is just kind of there because they need someone to put the main girls into awkward positions... Raku does that, but they still keep the focus on him as well. He has a personality and he's ACTUALLY important to the plot. They can't just replace him with some random male they found off the street simply to put them into awkward positions... Without Raku there is no plot because he has ties to EVERY girl and it's not like he just randomly met them. He has a back story with each one and in order for the plot to be relevant they NEED Raku to actually be around.\\n\\n\r\nAll in all I loved Nisekoi, it was nothing spectacular but it was still really interesting and funny. Some people might just say if you want to truly experience Nisekoi you should just read the manga. I agree with that, however I don't think you shouldn't watch the anime.... All you need to know is if you're in it for the plot you should probably read the manga first as it explains a heck of allot more than the anime.",
            "date": "2017-05-13T16:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 247612,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5280691.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/UmbraFrost",
                "username": "UmbraFrost"
            },
            "url": "https://myanimelist.net/reviews.php?id=247612"
        },
        {
            "content": "TL;DR:Endless Drama Never Ends,Answer Could Never Be Discovered \r\nNisekoi: is like an endless romance,while looping-lops all around the behind of the drama.It surely make some laughters,but for our long-awaited Nisekoi fans,who are hoping this series could make clear cutout of the answer behind the lock,is a miserable nightmare.\r\nI detested this show is due to the fact that this show is completely off the rails.It would be acceptable for inserting comedy inside the show,while progressing the story.However,none of the story continues,in fact Nisekoi: is even brought us to a fantasy world,while making this endless comedy.Yes,it's undeniable that it could catch someone's laughters,but none of the Nisekoicharacteristics could be shown.Thats like putting madoka characters into the Nisekoi and it wouldn't be any different.\\n\\n\r\nThe art style,sound effects,visuals still keep its track from the last season,therefore I praised them hardly.Colourful background,enjoyable music can't go any wrong.\\n\\n\r\nIn fact,if you want to look for the answer of Nisekoi ,I would recommend you just go ahead watch the ovas and wouldn't be bad.If you would like to devote your time on Nisekoi characters messing around the endless comedy,this might be a good choice to you then.\\n\\n\r\nOverall:4/10 (E) (Acceptable)",
            "date": "2017-04-16T18:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 245669,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569911.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Swordarc",
                "username": "Swordarc"
            },
            "url": "https://myanimelist.net/reviews.php?id=245669"
        },
        {
            "content": "TL; DR:\r\nLetdown. What.. A.. Letdown.\r\nIf you haven't watched season 1 of Nisekoi, and wish to see my review on the first season, here it is : https://myanimelist.net/reviews.php?id=241765\r\nI assume you have watched season 1. I gave Nisekoi Season 1 a score of 7 because the concept was unique, and that drove my interest to continue watching the series, in hopes that some form of resolution would be achieved in the end. That didn't happen. No closure was achieved and the plot was left hanging.\r\nThat's why we have season 2 right? NOT AT ALL. I promise you, even if you watch season 2, the story only progressesby around 3%. It's obvious that Shaft is trying to milk this series by forcing a third season, but screw that. I can bet no fan has stayed on. Everyone has dropped Nisekoi, and for good reason. NOTHING HAPPENS.\\n\\n\r\nSTORY - 2/10\\n\\n\r\nUghh. I'm not gonna bother elaborating this too much. The story is dreadful for FOUR reasons.\\n\\n\r\nFirst, NOTHING HAPPENS. Yes, That's right. There is no plot. The continuation of the concept from Season 1 didn't work because nothing happened. The love dispute continues. We have no clue who Raku made the promise to. In fact, the promise is only mention once in season 2. I'm not sure whether the producers forgot what the story was, or they stop caring entirely.\\n\\n\r\nSecond, POINTLESS FILLERS. Say what?? Fillers? But season 2 only has 12 episodes? Yes, exactly. With the limited episodes they have, and the dumb decision to fit in fillers, the plot completely stops moving. Not to mention, the filler was corny, and seemed like it was pulled out from a weirdo's fetish dream. MINOR SPOILER ALERT! (Skip to next paragraph to avoid reading the spoiler) It was about Magic girls or something. Go on. Check. This Anime never was meant to be a magic genre, but somehow, that filler was there.\\n\\n\r\nThird, ANOTHER CHARACTER. *sigh*. There is a major problem when your original characters are already suffering from insufficient screentime. But introducing a new and extremely annoying character just killed it for me. The new character had ZERO relevance to the main plot, interacts with the hero for around only 4 episodes, only to drown in the background with the rest of the badly developed characters. \\n\\n\r\nFourth, and finally, FAN SERVICE TO OBVIOUSLY COVER FOR THE LACK OF SUBSTANCE. There you have it. They used the old tactic of fan service to distract you from realising that the story stopped moving. What's more, the fan service sucks too. It's not even something worth getting excited for.\\n\\n\r\nART - 8/10\\n\\n\r\nBEAR IN MIND, EVALUATION OF QUALITY OF ART AND SOUND IS MADE INDEPENDENT FROM THE STORY (This means, the terrible story didn't affect the art and sound)\\n\\n\r\nOkay. I'll be fair to this series and say, two aspects (Art and Sound) are the only thing worth praise in this Anime. I know that art is subjective and it depends on your preference, however, I will generally describe the artistic value of this piece as neutral as I may.\\n\\n\r\nThe characters are drawn well enough to draw out emotions and feelings from the viewers. For example, the girls in the Anime are drawn good enough for anyone to believe that this is what a 'beautiful' girl looks like.\\n\\n\r\nThe animation panels were consistence and the style didn't seem to deviate as the series progressed. The fluidity of each passing scene felt natural and worked well in telling the story.\\n\\n\r\nThe colours in the Anime are also not a problem. There were no blinding colours as observed in some bad Animation out there, (ahem, Pokemon) but were vibrant enough to keep the story alive, cheerful happy. This tone suits the story and didn't feel unnecessarily forced.\\n\\n\r\nThe backgrounds were to a certain extent good, but definitely not special. Not something worth remembering, and certainly doesn't make you pause the video and say, \"wow\". It's not bad though, I must say, as the backgrounds didn't interfere with the telling of the story.\\n\\n\r\nSOUND - 8/10\\n\\n\r\nFirst, let's talk about the opening themes. In my opinion, it was perfectly suited to the tone of the story. The cheerful, fast paced melody is in a way a metaphor to show the cheerful, ever-so-happy attitude of high school kids and the innocence of love. The opening themes might not land in everyone's Itunes playlists, but if you hear it, even once, you would already be able to guess what the story is about.\\n\\n\r\nMore importantly, the voice acting. BEAR IN MIND, I WATCHED THE ANIME IN JAPANESE AUDIO. The Japanese voice actors fit into their roles very well. In fact, the tones they had were appropriate to how their characters were portrayed in the series, so much so that you can easily tell apart who's voice belong to who even if the screen went black. Never in the series did the voice acting sound unusual, unnatural and forced. Not once. Kudos to the voice actors.\\n\\n\r\nCHARACTER - 3/10\\n\\n\r\nI always emphasize this : in any Animation series, we want ALL the major characters to grow as a person and reveal who they are as a person naturally, without forcing it. This means, we would like to observe how a character behaves, not be told how they behave. The development of some characters were severely lacking, and it was obvious too. I know that in any Harem, it's hard to balance the screentime of every girl, however, if the series were to introduce a major and important character so late into the series, and not bother to develop that character, they might as well not introduce the character at all. What's the point of having such an important character be unnaturally forced to fit into a plot if it just clutters everything and ruins the character as a person?\\n\\n\r\nPlus, The new character was bloody annoying, when she wasn't meant to be. (Once you watch this series, you'll get it.)\\n\\n\r\nENJOYMENT - 4/10\\n\\n\r\nThe rule of thumb for any harem is this; You must have good plot OR you must have good fan service.\\n\\n\r\nThis series had none of those. It was difficult to watch this series. The only thing that kept me going was the desire to seek closure from season 1. (But in the end, I didn't get any closure)\\n\\n\r\nI must say, Shaft really lives up to their bad reputation. This is the proof.\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-04T00:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 241829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6078944.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Izuka-kun",
                "username": "Izuka-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241829"
        },
        {
            "content": "The only good thing about Nisekoi season 2 is the animation quality. I'm serious. This season is on the level of Naruto / Bleach anime originals (filler) and bad even at that. It might be the adaptation of the novels, but hell, this is what timeskips are for!\r\nLet's summarise without spoilers:\r\nIMPOSSIBLE TO SPOIL ANYTHING BECAUSE NOTHING HAPPENS. AT ALL.\r\n12 episodes of badly combined fanservice and literally story-stasis. There is no relationship / story progression on the main plot (which, to be fair wasn't that exciting anyway even in the original series) and you get a completely new cast of uninteresting and irrelevant characters, like:\r\n- Asecond hitman girl who has 2 eps dedicated to herself and literally contributes nothing to the main plot\\n\r\n- The little sister of one of the main heroines, who is essentially used as an excuse to freeze the main plot again (she steals the pendant and keeps it for multiple episodes - not like it matters, because even if that keepsake is around, no one cares about it in this season)\\n\r\n- The mother of Chitoge who has 2 eps dedicated to her and yet again, has a miserable attempt to push the relationship / story forward in her last episode, however the directors / writers do their best to erase all of that immediately in the next episode (essentially it's retconned out / never spoken of again)\\n\\n\r\nThey also increase the bust size of the hitman girl from season 1 with at least two sizes, coz why not, no one cares about story anyway?\\n\\n\r\nThis season is sort of insulting to the series as well as the fans. Don't waste your life / time watching this, you will not be missing out any story, it's essentially a really long OVA at the beach / pool with revolting amounts of fanservice and not much else.\\n\\n\r\nLet's wait for season 3 (if that ever happens after this) and hope they can at least move 1 inch forward in that.",
            "date": "2017-01-22T14:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 238883,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/yehaw",
                "username": "yehaw"
            },
            "url": "https://myanimelist.net/reviews.php?id=238883"
        },
        {
            "content": "Hi. Amateur reviewer here.\r\nI just finished this season of Nisekoi just now. Here's my short and brief review about it.\r\nOh, there's a little spoiler here so I suggest reading this after watching.\r\nStory: 7... oh wait no, let me give it an 8\r\nThe vibe of the first season is still there with Raku as your typical dense yet charming shounen. Plus, the leading girls are also there, with brute force (yes, i'm talking to you, Chitoge *hides beneath curtains*).\r\nBut in terms of story progression about your \"Ms. Promise Girl\" ...sorry but unfortunately you won't find those hints these season. Yeah, I was quite disappointed too becauseI was getting my mind and heart ready for these hints but... huhuhu.\\n\\n\r\nBy the way, this season tackles about and gives an overview about all the leading girls like their pasts and such and I'm quite amazed how they fit those in 12 episodes. Plus, one character stood out so much for me so much this season and the very reason why I changed my score to 8.\\n\\n\r\nArt: 10\\n\\n\r\nYep, still as cute as always. The animation passed with flying colors. The opening theme is cool (the animation of it is superb) and the ending theme is okay. Though those fanservice was a bit overwhelming for me... especially the magical shoujo episode. If they should have just turned that into an OVA, they would have time for story progression but well... it's fanservice and they increased their cuteness with frills and fur so I forgive them.\\n\\n\r\nSound: 9\\n\\n\r\nThose cute voices are out again, yipee~ ehem. The seiyuus are doing their job marvelously. Opening song and ending songs are great. No complaints here.\\n\\n\r\nCharacter: 8\\n\\n\r\nMaiiiikoooo!!!! You shone so bright this season, I give you my praise~ *sobs*\\n\\n\r\nAnyways, I wanted to give this a nine but I decided not to because because some characters stood out so much that it shadowed the other characters. Because of the spotlight they gave to the leading characters, they didn't have enough time to focus on enlarging our knowledge on our newfound species/characters. Though I think Paula got hers enough and Haru too much, Fuu-chan (in case you can't remember, she's the girl with the big side braid) faded in the background. I'm so curious about her identity since she showed up in the opening theme but all she got was a short introduction, nothing more.\\n\\n\r\nBut if you're gonna ask me if there are character developments, yes there are plenty. Yet if you'll gonna ask me if there are a progress on the romance part, sorry no confessions... yet.\\n\\n\r\nEnjoyment: 9\\n\\n\r\nI know some people didn't like this season because it doesn't show much about the promise girl or the story progression is quite slow but for me, I quite enjoyed it. The element of blushing and love still exists through the entire season. It's a little more tamed than the first season yet it is still satisfying and still bring the sweet love story you crave for Nisekoi.\\n\\n\r\nOverall: 9\\n\\n\r\nThis season of Nisekoi gave me a new light and perspective on some characters (Maiiiikoooo~ ehem) and even though it has its flaws, it is a great watch and leaves you hanging for season 3 which I hope would fulfill the gaps that this season left behind.",
            "date": "2015-07-16T12:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 193574,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2525105.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mira071198",
                "username": "Mira071198"
            },
            "url": "https://myanimelist.net/reviews.php?id=193574"
        },
        {
            "content": "[TL;DR: A season-long filler. Absolutely nothing significant happens in this second season, no character development, no payoff, the overall story doesn't budge an inch. It's still pretty, the animation is still great and the slapstick and fanservice still overpowers everything. Ultimately: fun, but a waste of time. It's not bad, it's just lackluster. Good for a chuckle or two if you have nothing better to do on a boring afternoon.]\r\nAfter the first season of Nisekoi ended, many theorized there won't be a second season anytime soon. Unsurprising, since the source manga has been spinning it's wheels for a while now, producing nothing but filler contentin droves. Adapting it to a new season seemed like a waste, maybe a few OVAs at most. But kicking logic in the butt, here it is: [Nisekoi:]\\n\\n\r\nIn this second season the main story of Ichijō's locket, the \"fake\" relationship with Chitoge, the girls with the keys and him finding his long lost soulmate is just completely shelved. What we do get, is a straight up filler season with loosely connected by-the-book story bits, some fan service and two new completely superfluous characters who add nothing to the story. Ichijō and his harem keep circling each other with some fun moments but basically no payoff. The rest is just your average slice-of-life set pieces with a new school year, Valentine's Day, Christmas Eve, the obligatory swimsuit/fanservice episode (pool cleaning this time around) and so on. An exercise in mediocrity.\\n\\n\r\nHaving said all that, I would highlight two things about this season. The first is the mini-arc of Chitoge and her mother in episode 3-4. It was really well done, the story was intense and it had a really satisfying payoff. (Also, the 4th episode was ONLY one that touched on the main story, even if just a vague hint.) The second one is episode 10, where we learn more about one of the least used support characters, Shū. It's a pretty slow episode with lots of dialogue, but one of very few where the emotional charge wasn't ruined by badly timed slapstick. \\n\\n\r\nOther than that, there is really nothing remarkable about Nisekoi: in the slightest. It's not \"bad\" per se, it's just kinda lackluster after the intensity of the first season. The art style and the animation is still top-notch, the music and sound is still good and it's still kinda fun to watch the Nisekoi gang doing their thing, but after watching the whole thing I felt like I wasted 12 episodes to nothing. The series stays true to the source material, I give it that much, but maybe this should've been the point to go a little bit original. I'm still hopeful for the third season...",
            "date": "2016-04-05T09:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 215580,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4129013.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Playbahnosh",
                "username": "Playbahnosh"
            },
            "url": "https://myanimelist.net/reviews.php?id=215580"
        },
        {
            "content": "I really feel like there's a lot of wasted potential here...\r\nNisekoi 2! The anime which continues in it's path from the first season. However with this season things are a lot less focused on the main goals of the first season, and much more focused on a bunch of filler. I don't mind filler, but with an anime like this, I really would have appreciated more of the main story. What we got though was around 10 full episodes of pure filler. Some of it was pretty entertaining, and some of it even introduced new characters in entertaining ways. But I really can't say thatit works out in the end.\\n\\n\r\nI really do love the characters this anime has developed over time. And the development here (even with all of the filler) is still somewhat present with a few characters. In terms of figuring out who put what in that locket, well that was skimmed over in the first episode and then absolutely *never* brought up again. That right there kinda makes this entire anime not even worth watching (unless you like the characters, like myself). But like I've said before, the characters *really* do make this anime. Chitoge is taking new leaps with her \"fake\" love with Raku, and Onodera's sister finally makes an appearance. So honestly, the characters alone make this anime worth the watch, in my opinion.\\n\\n\r\nFor some reason, while streaming this, my version of the anime didn't show the OP or ED so I had to look it up and they're actually damn catchy. As for the art, it's more or less like the first season, pretty good!\\n\\n\r\nSo overall, this anime is a big mess at the moment. There's a lot of good fun to be watched here. And if you're like me, and don't really mind the (sometimes) pointless filler that this anime throws at you, then I think you'll be fine. But again, there really isn't any \"story\" here, rather, there's a lot of pretty decent character development to be seen.\\n\\n",
            "date": "2018-08-29T19:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 287727,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=287727"
        },
        {
            "content": "This is a complete downgrade from the first Nisekoi, season 2 with only 12 episodes and 90% of the episodes were complete filler with one episode being some magical girl crap that literally had no correlation to the story at all.\r\nI can see why they stopped at season 2 since they would have to do 5 seasons of pure filler if following the manga just to reach the ending...\r\nThey should please the fan base, have last 12 episodes that is an alternative ending for Ichijou to end up with the person who truly deserves to be with him.....",
            "date": "2018-08-20T01:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 286924,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6171663.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DAK-DAK-MASTA",
                "username": "DAK-DAK-MASTA"
            },
            "url": "https://myanimelist.net/reviews.php?id=286924"
        },
        {
            "content": "I've really enjoyed Nisekoi's first season, but this \"sequel\" just disappoint me a little. It feels like a bunch of fillers, background stories of characters that don't even have to do with the initial plot and even null development of the plot itself (the padlock pendant thing). Anyways, it preserves the nice comedy and you're going to have good laughs with their likeable characters... sadly, is just that. I've not read the manga, but if there is a third season, you can perfectly skip this one and you won't even notice.\r\nStory: 3/10.. the fillers don't bother me that much, but what about the main plot?\r\nArt:8/10 very nice!\\n\r\nSound: 7/10 Ok!\\n\r\nCharacters: 8/10 My favorites! I like tachibana a lot lol\\n\r\nOverall: 6/10",
            "date": "2016-01-04T20:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 207768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4597276.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/el_cecece",
                "username": "el_cecece"
            },
            "url": "https://myanimelist.net/reviews.php?id=207768"
        },
        {
            "content": "The second iteration of Nisekoi supposedly brings us down further on the path of the harem, but in the end it really doesn't do anything at all.\r\nAs much as I wanted this anime to progress, it simply refused to do anything interesting in the slightest. This anime actually has some sort of story, making it already unique in the harem genre. The thing which annoys you the most though is the lack of progression. Every time something happens in this anime what could progress the story, it's as if the writers are too afraid to actually let it happen, and therefore find a way tosqueeze themselves out of the situation. This makes the development overall, if any, fairly frustrating to watch.\\n\\n\r\nThe art is rather good, and really knows how to portray certain scenes. Although it's not outstanding, it does the job very well. The soundtrack also compliments the series in some ways, although somewhat forgetful.\\n\\n\r\nThe characters are the main reason why the show is enjoyable to watch. Although they are rather generic, it's fairly entertaining to watch them struggle as they try to express their feelings, which is basically the main point of this romance harem. \\n\\n\r\nOverall I'd say that if you enjoyed the first season, you will enjoy this one too. Just don't expect anything revolutionary, because that will not happen. It's certainly entertaining, I'll give it that.",
            "date": "2017-04-03T03:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 244475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4819065.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Seidai",
                "username": "Seidai"
            },
            "url": "https://myanimelist.net/reviews.php?id=244475"
        },
        {
            "content": "As of right now i do not know if i am going to keep watching this anime, as they keep doing only secondary stuff and forgetting the main plot...\r\nLike i stated in the previous \"review\" this type of avoiding the plot thing has become old and people are bored of it, it is for this reason that a lot of anime's fail to continue as they try to extend an anime by avoiding the plot whereas if they keep the plot they could create more and more complex plot points...\r\nBut alas they disregard the plot and keep making unusable stuff like bringing other characters inthe midst of already troubled waters...\\n\r\nYes i mean Kosaki's sister, they have a great character that they haven't exploited and wasted it Tsugumi which is one of the main reasons i started watching the anime for just to watch how little they use her character or even care for it...\\n\r\nThis anime while fair to watch it is in fact not the type of anime you would enjoy doing a marathon off...\\n\r\nAgain the story is just being kept on hold on every fucking episode and as soon as you see a ray of hope about the plot it is darken by a stupidity they make on the anime...\\n\r\nThe few episodes that Tsugumi's character has been use are fun but in the end fail to capture you as she is in love with Raku too while denying it and is just kept in the dark after being shown a little...\\n\r\nOh in the first season we had Chitoge and Raku tried to open the pendant with Chitoge's key to see if she is the \"girl\" (at this point we don't know if she was the one who gave him the pendant or he gave her the key or what the fuck is all this about) who was promised to be married to him and it ends breaking the key inside the pendant and he sends it to be repaired for it to take in anime time about 6 months to be repaired...\\n\r\nWhen repaired they want to try again and check who is the girl but this time with all 3 keys in hand just to let them know that they can't because the lock has something and won't open not even with the right key...\\n\r\nAgain this is the kind of bullshit we are tired of seeing, atleast try to come up with better excuses to delay the plot but having so long and then not being able to give us anything is detestable and an insult...\\n\r\nAs for the rest of the story it is to be seen...",
            "date": "2016-11-20T17:55:00+00:00",
            "helpful_count": 1,
            "mal_id": 234098,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Buterbing",
                "username": "Buterbing"
            },
            "url": "https://myanimelist.net/reviews.php?id=234098"
        },
        {
            "content": "I didn't really like this season as much as the first one, and I like the first one a lot. \r\nWhy? Well:\r\n>This season has practically no story, it is more into showing dumb interactions in uninteresting episodes.\r\n>9 out of 12 episodes are just filler. Even so, the 3 that actually have something to do with character development, are probably the best in the whole series. Those really saved the season for me.\r\n> The story gets an slightly above average 6; but it is just because Chitoge and Maiko's episodes.\r\n>I don't have any problems with the show's art. In fact, I really like the style thatShaft puts in their shows. The opening theme is fun and vibrant, and there are some other themes that really got stuck in my head. 8/10 for the art, and 7 for the music.\\n\\n\r\n>Characters... I hate Haru. She is so annoying. The new characters introduced in this season are extremely annoying to me. About the cast of the first season, except for Chitoge and Maiko, they don't really get any developement. This is the main reason why I didn't get into this season.\\n\\n\r\n>Even with the flaws this season has, I love Nisekoi (first season better) and i find myself coming back to this anime over and over again. \\n\r\n>Second season is not a really big deal, but i did enjoy it to a certain degree. It gets a 6 for my personal enjoyment. And an overall score of 6.\\n\\n\r\n>I recommend you to watch the first season and if you really got into Nisekoi, you should read the manga. Even if it still full of filler, it is quicker to read it.\\n\\n\r\nThank you for reading and hope this was of some help. Later!",
            "date": "2016-07-20T15:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 224511,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4941043.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gumil",
                "username": "Gumil"
            },
            "url": "https://myanimelist.net/reviews.php?id=224511"
        },
        {
            "content": "The second season of Nisekoi, although the entire season feels more like a patchwork of OVA episodes with how sheerly sloppy some of this is. And this is coming from someone who thought that the previous OVA for the series was fantastically done and meaningful.\r\nStory 4/10: Although the story continues on the first seasons \"find the childhood promise girl\" that made it actually interesting... it instead focuses on the worst aspects of the first season and the source material. In otherwords, it stagnates for 12 episodes and gets literally nowhere in almost any way. Most of what is accomplished, could have been condensed into asingle episode, if not half an episode.\\n\\n\r\nThen it has the audacity to introduce everyone-saw-it-coming plot twists and plot devices that otherwise stop anything from moving the story forward, but instead slow it down further. It even throws in scenes that directly contradict previous scenes or events.\\n\\n\r\nArt 7/10: Roughly the same as the first season, but noticeable improvements, mainly in image quality and consistency.\\n\\n\r\nSound 7/10: It's a Slice-of-Life Romantic (comedy?) anime. Sound is one of the last things to be concerned about, although it needs to be(and is) passable.\\n\\n\r\nCharacter 6/10: Although the first season was rather fantastic with its character development, the second season however is not in regards to the MC. And it's not even the story or the characters fault, it's the authors for forcing such awkward, redundant, and contradictory scenes into the anime directly after the MC starts to get some reasonable and well deserved development.\\n\\n\r\nCharacters other than the MC seem to get a great amount of development in the sense that you understand the different characters motivations and inner thoughts substantially more. Meanwhile the MC is sitting there brainwashing himself to believe something that, just simply put, isn't true anymore and he is in denial. Throughout the entire second season at that with no progression whatsoever for the MAIN CHARACTER.\\n\\n\r\nBy far the best character is \"Shu\", who is working behind the scenes. By subtlety manipulating, giving vague but suggestive hints, and overall interfering with others who wish to interfere with the main plot themselves. Especially in the OVA.\\n\\n\r\nEnjoyment 5/10: Although it did fill the craving of wanting to see more Nisekoi, it ultimately made me somewhat regret watching it. It forced some of the worst aspects of the show to such a sheer extent that it was cringe worthy and I had a hard time NOT skipping these scenes. These scenes of course being those dreaded, incredibly awkward, and utterly ridiculous fawning scenes between Raku and Onodera. Especially when they purposely have the MC Raku monologue insults towards other characters simply for \"suggesting\" the truth to him previously, or insults his own inner thoughts that also suggest the truth.\\n\\n\r\nOverall 7/10: Not fantastic by any means, but it has substantial character development for everyone but the most important character. Which in turn will help understand any future seasons more, should they happen in the first place. There is almost enough source material for roughly 2 more seasons if you go by the seeming formula of skimming over 50ish chapters of the manga and picking pivotal moments to convert. So don't be surprised for another season of this, but at the same time don't expect it. \\n\\n\r\nThe series still hasn't gotten much of anywhere until the more recent chapters, and these kinds of character development for the MC should have been taking place substantially earlier. The only other Anime/Media I've seen this in is extremely mainstream anime where they purposely try to distract the viewer with side-stories and forced plot-devices to distract from the fact that they are purposely dragging the series well past when it should have at least concluded the current story arc.\\n\\n\r\nThe problem being that if you want to understand events further in the story, see and understand a characters offset behavior, or understand references/flashbacks/etc... You pretty much need to watch these 12 solid episodes of arbitrary filler material, or else suffer further down the line. It's like if an OVA had some of the most important information in the series and took place randomly inbetween episodes. You basically need to watch it, but you may not even know that it exists in the first place. Seeing as OVA's generally aren't bundled together in chronological order to the anime episodes. It would be largely upsetting to finally understand what happens after you see future events, and could very well change your outlook of the events afterwords.\\n\\n\r\nTL;DR - A must watch if you want to understand the story further down the line. You may not enjoy it, but you have to swallow your pride so that you don't regret it later.",
            "date": "2015-09-26T17:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 199729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845968.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Jebus_Kreist",
                "username": "Jebus_Kreist"
            },
            "url": "https://myanimelist.net/reviews.php?id=199729"
        },
        {
            "content": "I will keep this simple and frank. This whole season was just a whole bunch of fillers rather than an anime with an actual plot. The story was almost nonexistent because there was almost no coherency between each consecutive episode. Art was not as good as that from the beginning of season 1. However the sound was good because the voice for each character was executed perfectly, especially Onodera's(I'm an Onodera fan). However, as for the personality of the characters, Chitoge, in particular reminds me of Melon from Akikan, annoying, stubborn, yet still a bit lovable. I hope there is a season 3 where theycreate two endings to meet the needs of both Chitoge and Onodera fans. Hopefully a Kimi No Todoke confession for both characters.",
            "date": "2017-12-28T22:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 266709,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4664087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SimplyKaori",
                "username": "SimplyKaori"
            },
            "url": "https://myanimelist.net/reviews.php?id=266709"
        }
    ]
]