[
    [
        {
            "content": "(The review covers all seasons, even though I also talk about the latest.)\r\nAfter six seasons, Natsume Yuujinchou excels as much in the art of conveying powerful emotions during each episode without ever giving the impression that the series becomes tiresome. If I were to describe this series most appropriately, I would say it's heartwarming, moving and (personally) exotic.\r\nThe synopsis is simple. We follow Natsume Takashi, a 15-year-old orphan boy who can see supernatural creatures called \"youkai\" or spirits, a capacity he inherited from his grandmother Reiko, who had died for many years. He also receives his grandmother's \"Book of Friends\" which contains all the contractsshe has made with youkai. With the powerful youkai Nyanko-sensei or Madara, Natsume gradually releases the various spirits that were linked to his grandmother.\\n\\n\r\nNatsume Yuujinchou has a simple structure. Each episode relates a new story featuring relationships between youkai or youkai-human relationships, and generally a difficulty concerning youkai(s). Each story is well written, sprinkled with mystery while disseminating hints enabling the viewer to arouse his curiosity. Some episodes focus only on Natsume, his adoptive family and friends. In all cases, the interactions between the different characters are very well-developed and in a natural way. The episodic format might suggest that in the long term it would become repetitive, but the diversity of stories is impressive with a relatively unpredictable style, sometimes resulting in a happy ending, sometimes a separation. It depends.\\n\r\nEven if the universe is fictional, the relationships are real. Natsume understands that youkai aren't so different from humans. They also have qualities, defects and feelings of all kinds: regrets, love, sadness.\\n\\n\r\nThe storytelling is executed masterfully. Usually we follow the story from the point of view of Natsume. We have therefore access to his thoughts, remarks on what he sees, other characters, etc. But at times, it happens also that the story is told to us by other more secondary characters. This season, there were Natsume's two friends: Kitamoto and Nishimura. It was interesting to have their opinion on Natsume and generally their point of view when they surprise Natsume helping a youkai (which they can't see of course).\\n\\n\r\nFor the characters: Natsume is a truly endearing character. Each of us can identify with him. I think at some point in life, we all spent moments isolating ourselves from others. (It was my case) And his kindness and timidity can't leave you indifferent and... it's impossible to hate him !\\n\r\nHis relationship with Nyanko-sensei is very fun to see. Nyanko-sensei can be seen as the pet of Natsume but thanks to its very powerful powers, Nyanko-sensei is also present to protect Natsume against a possible danger. Although this aspect isn't explicit in the series, I think it's really the key figure that has filled (at least partially) the solitude of Natsume.\\n\\n\r\nConcerning the supporting characters, I can say that after six seasons, they have received a complete development and are very endearing. Whether Natsume's friends, his adoptive family or his friends youkai, all have a real involvement in the plot and have their own personality. None of them is actually unidimensional and can't be classified in the \"dere-dere personality\". There are some runnings gags as when Taki is in ecstasy when she sees Nyanko-sensei because she finds him cute. But overall I can't define the characters with basic archetypes. The entourage of Natsume is undoubtedly composed of people who are fundamentally good (although Natori ...) since Natsume is himself a kind and caring person. I suppose the good people draw attention of the good people.\\n\\n\r\nThe atmosphere of the series is marvelous. Whether its splendid soundtrack with comforting music and others more adapted to the action scenes or its backrounds representing a calm, peaceful and mysterious countryside. The animation of the series is satisfactory without being exceptional either: mostly traditional animation. To come back to the scenery, I can say unequivocally that I have rarely seen such beautiful scenery in anime. Each image of the opening deserves a screenshot.\\n\r\nRei Yasuda's ending song is magnificent. This is probably my favorite ED for this past season. The melody and the lyrics correspond perfectly with the themes of the series.\\n\r\nI also add that there is a new OST in this season that I appreciate very much: the one we hear during the preview after the ending song.\\n\\n\r\nFinally, this narrative tells of self-fulfilment of Natsume. At the beginning of the series, Natsume is a lonely character who doesn't really have friends and is often suspicious when he meets new people, youkai or humans. It's difficult to open to others because of the feeling of rejection that he has known since his childhood. But then, thanks to the \"Book of Friends\", Natsume meets different spirits with which he become friends. We can notice that the opening of this new season emphasizes the evolution of the character especially when we see the \"current\" Natsume watching the \"child\" Natsume. He also became friends with many of his schoolmates. Whether it is his friends who know his abilities or his friends who do not know the existence of spirits, everyone will encourage Natsume to go ahead and support him if he needs help. Similarly for his adoptive parents, the Fujiwara, who really take care of him. Natsume doesn't wish to break his relationship with them and they never informed them either of his capacity or the Book of Friends. I hope one day Natsume will reveal them. Maybe in season 7?\\n\\n\r\nIn short, the series succeeds brilliantly from a simple plot to show us gradually what I can call a masterpiece. Each story, whether tearful or joyful, offers a life lesson to its viewers.\\n\r\nWith this, I take leave of you and I hope we'll see the sequel in the future.\\n\\n\r\nThank you for reading the review.",
            "date": "2017-06-20T16:46:00+00:00",
            "helpful_count": 111,
            "mal_id": 250492,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4797625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TuyNOM",
                "username": "TuyNOM"
            },
            "url": "https://myanimelist.net/reviews.php?id=250492"
        },
        {
            "content": "I'm here one more time to make a review of the best anime. Well, Natsume Yuujinchou is the most heartwarming anime I've ever watched. I've just finished watching the anime and I can really say it now: Natsume Yuujinchou NEVER disappoints me. \r\nStory: 10/10 - Like every season of Natsume Yuujinchou, it's about Natsume, a boy who had a tough childhood, lost his parents and now lives with the Fujiwara family. One day, he found the Book of Friends, a book that owns the names of many youkais, so Natsume is trying to give it back to all of them. The episodes can be massivesometimes (even more to people that doesn't like Slice of Life), but I must say that I enjoy EVERY single episode, some of them are really heartwarming, some episodes are dramatic, some will make you tense, but most of them will make you relax and enjoy life haha. If you're expecting for a big drama, this anime is not for you. The atmosphere of the episodes is so wonderful, it's calm and heartwarming.(like I said before)\\n\\n\r\nArt: 9/10 - The art style is a little bit simple, but it's beautiful, without exaggeration. Characters well-made, great sceneries and the youkais are very cool too.\\n\\n\r\nSound: 10/10 - Natsume Yuujinchou's OST is just marvelous! I think the OP of this season has become my favorite, and the ED is also great, but the most important are the background musics. They are awesome, and very calm too (just like in every season), they match perfectly with the situations. I have downloaded every OST of Natsume Yuujinchou, including this new season. It's a good OST to listen to when you want to relax.\\n\\n\r\nCharacter: 10/10 - Natsume is a gentle, shy and and isolated boy, what makes many of us identify with him at some point. Nyanko-sensei (his \"pet\") is really funny and despite they fight/argue many times, their relationship is great and Nyanko is really loyal. Most episodes are focused in other characters, like Nyanko-Sensei, Natsume's friends, but especially in the Youkais that appears asking to Natsume's help. But I can say that every character is very well worked, even the youkais who appears just for an episode or so.\\n\\n\r\nEnjoyment: 10/10 - Like every season, I enjoyed very much watching this full season. I really hope there will be more seasons. Natsume Yuujinchou always make my day better and happier!\\n\\n\r\nOverall - 9.8/10 - Well.... It's Natsume Yuujinchou, it's always 10/10. I totally recommend everyone to watch it!",
            "date": "2017-05-11T13:44:00+00:00",
            "helpful_count": 75,
            "mal_id": 247468,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3795693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GabrielaWolff",
                "username": "GabrielaWolff"
            },
            "url": "https://myanimelist.net/reviews.php?id=247468"
        },
        {
            "content": "To be honest, in just 4 days, I finished watching all the 5 seasons of this anime, oh boy no regrets. Probably the only anime I binge-watched all of its seasons religiously, even though I'm a pretty busy person because of work, I HAVE to find time to binge-watch this show because it's just amazing and heartwarming. \r\nThis anime is one of the greatest animes ever.\r\nStory: 10/10\r\nI know that this season is not finished airing yet, but I know, like its previous seasons, the story will be amazing. No, the story is not repetitive, like what the other people thinks. I'm one of those peoplewho detest repetitive plot or cliche plot or predictable stories; if Natsume Yuujinchou series is like that -- I already gave up on the show and proceed binge-watching something. Well, I didn't stop and yet I'm asking for MORE! \\n\\n\r\nEvery episode you get to explore different youkai's story and personality, you get to love Natsume and Nyanko-sensei more, you get to appreciate everything around you, and every episode will make your heart so warm you always want to cry because it's so beautiful. \\n\\n\r\nAfter each episode, your wish that you want to live with Natsume, the Fujiwaras, be with Nyanko-sensei, and Taki and Tanuma just goes out of control. If you guys know the memes on the internet asking if you want to live in the anime world, which one do you want to live in? It's definitely the world of this anime.\\n\\n\r\nArt: 10/10\\n\r\nThe animation is just everything in the show, it lives up to the heartwarming tone of the anime.\\n\\n\r\nSound: 10/10\\n\r\nOne of the reasons why I freaking loved this anime so much is because of its soundtracks. Every OP and ED of this anime is just so gooood. And just like the previous seasons, the music of this season is gooood too. Whoever's behind the music of this show, thank you so much. \\n\\n\r\nCharacter: 10/10\\n\r\nI love every character in the show, I mean even the villains. Omg what is wrong with me. \\n\\n\r\nEnjoyment: 10/10\\n\r\nMe smiling and crying so hard at the same time because of this show? Yes and thank you so much for making me feel this way.\\n\\n\r\nOverall: 100000000/10\\n\r\nIt kinda sad that unlike other airing animes, Natsume Yuujinchou is not that popular. It deserves all the hype, the love, and the attention from all the anime fans (even the non-anime fans). But I actually feel great because I'm not one of those people who is missing out on a very amazing show.\\n\\n\r\nIf you're looking for a sign to watch this show: THIS IS THE SIGN! Watch the show NOW! Of course, watch season 1 first up to season 5 -- you're not going to regret it. Enjoy! :)",
            "date": "2017-05-17T01:51:00+00:00",
            "helpful_count": 47,
            "mal_id": 247894,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5466849.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheDoggoneGirl",
                "username": "TheDoggoneGirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=247894"
        },
        {
            "content": "The story is a masterpiece since season 1 \r\nthe everyday life of Natsume while protecting the Book of Friends inherit from his grandmother.\r\nHis character become great he gain more trust to his friend he still learn a lot from the everyday experience (Story 10/10)\r\nArt is great too the animation better and better from season 1. they portrait the characters really well (Art 10/10)\r\nThe Opening and Ending Songs are great have deep meaning and its perfect for the characters in the anime\r\n(Sound 10/10)\r\nThe characters are great even there are small cameo roles in some episode but they portrait it really well \r\n(Character 10/10)\r\nThe Enjoyment watching theanime is great I cant get enough with it I will miss them . (Enjoyment 10/10)\\n\\n\r\nI really recommend this anime the story is a masterpiece I think this is the anime that I watch with this many season and hopefully many more to come\\n\r\nOverall 10/10",
            "date": "2017-06-20T18:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 250498,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5655301.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nath51",
                "username": "Nath51"
            },
            "url": "https://myanimelist.net/reviews.php?id=250498"
        },
        {
            "content": "The 6th Season of Natsume's book of friends, First of all I'm proud of how far this series has come and just how consistent it is with it's quality. It's an anime that has never disappointed me, And I hope it gets a lot more seasons.\r\nLike every season, Natsume Yuujinchou plays to it's strengths. It's a very relaxing anime. It's quiet, slow(for good reasons), full of lovable characters. It's a vibe, a very spirtual vibe that it gives off through it's country side atmosphere and it's fantasy elements. It sometimes gets pretty dark and mysterious which adds a lot of flavor to this show. Thestorytelling in every episode is superb, It's always fresh and simple, The use of symbolism and Goblins to tell a new tale every episode shows how well scripted and cohesive it is.\\n\\n\r\nEvery season it slowly pushes the story, this time it got to a point that a lot of people were biting their nails for a pretty long time, and they kinda ended it there, so I can't wait to see what happens next, I might read this manga before Attack on titan if they don't make any announcements soon.\\n\\n\r\nI honestly don't have anything major to complain, sometimes it's a little unbelievable how some people react to Natsume, But it happens very rarely and it's something I can slide because of the characterization. That's it. The animation is good too, it's not anything crazy but it works very well for it's environment and the vibe that it gives off, The music is always spectacular, I'll say this, during exam times or if you have any stress, just listen to this OST it'll help. It's just beautiful.\\n\\n\r\nOverall just another amazing season of my most favorite slice of life ever, Some people might not find it interesting but I would definitely recommend watching this and all it's previous seasons.\\n\\n\r\nI would give a 9.5/10.",
            "date": "2017-06-21T10:04:00+00:00",
            "helpful_count": 28,
            "mal_id": 250550,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tigermaskshinobi",
                "username": "tigermaskshinobi"
            },
            "url": "https://myanimelist.net/reviews.php?id=250550"
        },
        {
            "content": "My first impressions for this show after watching the first two episodes, I felt that the season would focus on motifs of Natsume growing up with unique capabilities and what life was like for him during these difficult times. It turns out that I wasn’t too far off on my hypothesis! Woot.Very much like the previous season, this new addition has been quite reflective in regards to Natsume’s past, mostly in relation to the obstacles that he faced as a child. We get to experience more concrete glimpses into the core facets via contemplative thoughts that our protagonist has about the person he used tobe and the person that he’s become. This breathtakingly puts into perspective the character growth that he’s undergone over the span of the past 72-episodes.\\n\\n\r\nEvery single aspect about Natsume’s Book of Friends is a stunning masterpiece and a subtle ode to Japanese culture and spiritual beliefs. It’s presented in glorious animation, infused with the aesthetics of tradition and history. From the mannerisms and etiquette, to the way that everyone interacts with another-supernatural or otherwise-to the common dilemmas involving dysfunctional and complicated familial bonds, friendships steeped in misunderstanding, and the simple emotions of loneliness that’s blossomed from a deep loss–all of these come together in a marvellous, fluid way to create a story that’s highly engaging and compassionate.\\n\\n\r\nVisually, the anime is just as lovely, if not more, as its predecessors. The natural surroundings of the forests, neighbourhoods, and mountainous regions are depicted with great detail while retaining an air of ordinary beauty. The characters are all natural and easy to differentiate from one to the next. Whenever it calls for it, the suspense, laced with ethereal affects, conjures just the right amount of tension without feeling heavy, forced, or insufficient.\\n\\n\r\nThe soundtrack continues to be wholeheartedly magical with melodies composed of piano, shamisen, and wood instruments that work together to instil warm-hearted emotions and empathetic responses. It’s tasteful, sophisticated, and so easy to listen to, making it the absolute perfect accompaniment to the classic aura of Japanese culture.\\n\\n\r\nRegardless of all of these things to love and appreciate, the best parts of the season were the themes of friendship and family, the bonds that tie people together, which is inherent in every new instalment to the serial. It’s a show that really peels away all of the layers that make humans such complex creatures and reveals us for the simpletons that we are: individuals who fight our own realm of loneliness; people who just want to love and be loved and accepted, whether it’s romantic, familial, etc.\\n\\n\r\nIn conclusion, Natsume’s Book of Friends was one of the best shows out there for the Spring 2017 Anime line-up, and it will always be a masterpiece for me. It’s the kind of genuine feel-good series to pick up when you need it the most. I highly recommend this to all fans of anime, especially if you’re new to the medium. It can be enjoyed by anyone who loves a beautiful story.\\n\\n\r\n10 maple leaves outta 10!\\n",
            "date": "2017-07-04T15:49:00+00:00",
            "helpful_count": 22,
            "mal_id": 251951,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5453400.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yon_Nyan",
                "username": "Yon_Nyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=251951"
        },
        {
            "content": "The story line of Natsume Yuujinchou is impeccable and it left me with an incredibly warm feeling after watching every single episode. The opening and ending songs really tie in well together with the plot, and it is one of the few animes where i do not skip through the ops and eds. I followed this series for a long time already, but there is still the unwavering anticipation for the next episode/ season to come out.\r\nNatsume has really developed over the seasons and in this season, we see more about his relationships with others. He is not the mediocre hero, and that is whatmakes him so relatable and the series so uplifting and pleasing. The anime makes me smile every single time.\\n\\n",
            "date": "2017-06-01T21:57:00+00:00",
            "helpful_count": 9,
            "mal_id": 249087,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/megansimyr",
                "username": "megansimyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=249087"
        },
        {
            "content": "If you've made it as far as the sixth season you're probably well aware of the charm and appeal of Natsume. What I'm here to call everyone's attention to however is this season has PEAK Nyanko-sensei animation. You will be treated to love, bounciness, cuteness, care and attention put into each frame of art that is the upmost joy to watch out of this calico cat. The likes of which you didn't realized would be topped from before. Okay, thank you for coming to my TED talk\r\n...\r\nIf you would like more of a substantial review, Natsume Yuujinchou Roku is as heartwarming, bittersweet, and cozy towatch as it's always been. The continued creativity with each new youkai still amazes and forever leaves me wanting more. While the episodic nature of the show leaves me content, the ever so slight progressions in everyone's character as well changes in the plot are evident enough that Natsume Yuujinchou still doesn't yet show signs of getting dull anytime soon. The only complaint I could have is more new additions to the sound track would be nice, but it's a small qualm considering the OST is good enough to have a regular spot on all my playlists even after 5 years. This series truly is a very dear masterpiece that will enrich your life for the better.",
            "date": "2019-03-30T22:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 304992,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4230357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sushi-kushi",
                "username": "sushi-kushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=304992"
        },
        {
            "content": "So far among all the anime series I have watched, this one is the best. I loved all the 11 episodes of this season, especially the first 3. \r\nIt is amazing to see how much Natsume has changed throughout the seasons. His interactions with everyone around him, be it youkai or human, is definitely fun to watch. His sudden facial impressions are priceless. There are no characters you can hate, of course if you are up for this type of story. This is my second time watching the whole series. \r\nTo be honest, when I started watching the series for the first time last year,I wanted to drop it as first few episodes were not up to my expectations. I am so glad I didn't quit, which led me to this awesome season. \\n\\n\r\nHoping for a season 7 :D",
            "date": "2018-03-01T08:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 272726,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4665396.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SakuraAme",
                "username": "SakuraAme"
            },
            "url": "https://myanimelist.net/reviews.php?id=272726"
        },
        {
            "content": "Natsume yuujinchou is one of the few shows which calms the soul. Throughout watching it, since season 1, it made me feel extremely calm and happy about the world around me. That in itself is one of it's biggest successes. Amongst all the gore, action and fast paced anime, natsume yuujinchou gives us the opportunity to look around at the world around us and appreciate beauty. It has beautiful messages in each episode about kindness and empathy, which teaches one alot.\r\nStory- 10/10\r\nThe story in itself is great with each episode bringing some new characters or just telling the story of the older characters. Natsume yuujinchouhad the ability to make simple stories seem extremely \"feelsy\" and basically just amazing.\\n\\n\r\nsound-9/10\\n\r\nThe music itself was brilliant. Ever since season 1 the ending songs have been great and so peaceful. The opening to this season was great and probably the best so far. The ost has been good as usual bringing out feels when required. \\n\\n\r\nCharacters -10\\n\r\nThe characters of natsume yuujinchou are incredibly fascinating. All possess different characteristics, whether it is the lovable protagonist natsume takashi, whos childhood and upbringing gives us much depth into his character or Reiko his grandmother who is very different yet similar to him. Some memorable characters would be natsume, reiko, nyanko sensei, natori and I could just go on. All characters are so well developed and so have so much depth. It's just amazing.\\n\\n\r\nOverall 10/10\\n\r\nWatching natsume yuujinchou has been such a great journey for me and it had such a positive impact on my life. I am grateful for this anime and highly recommend it to everyone for it's incredible ability to make us \"feel\". It's been fantastic and I can't wait for season 7.",
            "date": "2018-05-25T06:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 281344,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6634373.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lifeislife",
                "username": "Lifeislife"
            },
            "url": "https://myanimelist.net/reviews.php?id=281344"
        },
        {
            "content": "*Spoiler Free Review*\r\nFirst of all i need to mention that this review will be a review of all the seasons so i will post this to here and to the first season's review section.\r\nWhen i first started watching Natsume Yuujinchou, it felt kind of boring. It was cute and all but i am not a person who watches episodal anime that much. I felt like i would drop it if it continued like that. Because every episode Natsume met with a new youkai and gave their name or helped them. And i found it a bit boring. But i kept watching. At the end ofseason one, i got used to how the story goes on and i got used to the characters.\\n\r\nThen i started watching the second season. I realized that i actually started liking it.\\n\r\nAnd when i started watching the third season, i loved it. \\n\r\nIt probably wasnt because the third season had better quality than the second season or the first season. It was probably because, you get to know some characters during the first two seasons, you get to know the whole town and the anime makes you feel like you are a part of that world now. You feel the characters feelings as if they are you friends, you feel the sadness in the air, you feel the happiness... \\n\r\nSo yes, it started slowly but it was done like that to be able to have a really good setting. And when you get into it, you love it.\\n\r\nAlso when they were finished with introducing the characters and the setting, they started telling a main story too. And the main story interested me a lot.\\n\\n\r\nAfter i started liking it, i loved watching all the episodes. The fifth season had some boring episodes in my opinion but only \"some\".\\n\\n\r\nNatsume Yuujinchou had a really calming atmosphere. There were many episodes i watched with a smile on my face. There were many episodes that made me forget my saddness. And there were many episodes that made me really emotional too. Natsume meets with many youkai and has a journey with many youkai. Of course you can not relate to all of the youkai's feelings but there were many times i related a lot and felt like crying a lot. And also when they became happy, there were a lot of times i became happy too.  \\n\r\nStory-8\\n\\n\r\nThe art develops a lot. There are 3 years between the first season and the second season. Also there is 4 years between the fourth season and the fifth season. Thats why the art gets a lot better in the sixth season and its really beautiful. Especially the sixth season's opening is a feast for one's eyes.\\n\r\nArt-9\\n\\n\r\nI really liked many of the openings and the endings except the first season's. Also the insert songs are great imo too. There is especially one song called Haru wo shiraseru mono. Whenever i hear it, i feel so many emotions inside.\\n\r\nSound-8\\n\\n\r\nI really like nearly all of the characters. I even like Reiko and want to see her a lot more. \\n\r\n*Natsume is the best boy*\\n\r\nCharacters-9\\n\\n\r\nSo to sum up, i loved Natsume Yuujinchou. If you would like to watch something relaxing you should deff give it a chance. And dont drop it in the first season. \\n\\n\r\nBtw my 9 starts is for the whole series\\n\r\n1st season-7stars\\n\r\n2nd season-8 stars\\n\r\n3rd season-9 stars\\n\r\n4th season-9 stars\\n\r\n5th season- 8 stars\\n\r\n6th season-9 stars",
            "date": "2019-03-09T07:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 303165,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6202716.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JadeCeci",
                "username": "JadeCeci"
            },
            "url": "https://myanimelist.net/reviews.php?id=303165"
        },
        {
            "content": "So, I've made it to the sixth season of Natsume's Book of Friends. Each season, I feel like this story gets better and better and closer and closer to what I want to see from it. \r\nMy favorite aspect of this season (as has been for the past couple seasons) was the development that we get to see for Natsume and his friends. Unlike previous seasons, though, I feel like this season started to bring Natsume's two worlds together in a way we hadn't seen before, which is something I was highly anticipating. I don't know if the story will take it past the bitswe got in this season, but I really hope so. Another thing I really want to see more of that we got a little bit of during this season was some internal conflict going on with Natsume. Like I said, there was some, but I would really love to see a point in the future where Natsume has some pretty serious struggles with the world of youkai and humans. \\n\\n\r\nThere was more development for Reiko this season, as I was hoping for from last season, though it actually felt like a small bit of a decline from season five. However, I enjoyed the anime's way of telling her story this season because we got to hear more about her as a person in her own time rather than this person from however many years ago that could talk to youkai.\\n\\n\r\nI will say this season, while amazing, seemed like a bit of a set up for what's to come. For example: who are Natsume's grandparents, really? How much power does Natsume actually have? Will there come a time when Natsume thinks it's best to open up to everyone in his life about youkai? Unfortunately, these questions don't get answered this season, but the set up is just as magical and fantastical as all the other seasons have been.\\n\\n\r\nThis anime really does take you to another world and I think, regardless of the fact that it may not start out as everyone's cup of tea, it's going to end up being a lovely anime for anyone to watch.",
            "date": "2019-03-07T17:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 303087,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=303087"
        },
        {
            "content": "If you are here reading the review for the sixth season then you must have already watched the previous seasons, I presume. \r\n**DECLARATION**This is the only anime out of vast collection that I want to get new episodes till my last breathe. I mean it. \r\nNatsume yuujinchou introduces new stories every single episode and yet it never fails to leave a heart warming feeling. starting from season 1 till this season 6, I without any doubt enjoyed every single story. I understand that there are not much of plots and twists in it but in this world full of hectic routine you might want toescape into a peaceful word and relax. The morale I get from the ending of each episode is clearly relatable to our real life to some certain extend.\\n\\n\r\nMusic -\\n\r\n10/10\\n\r\nI loved all the openings and endings. The music seems to be made just for this anime, it fits in perfectly.\\n\\n\r\nArt-\\n\r\n8/10\\n\r\nThe art quality is not that up to the mark but if it a good story it doesn't really hurt much. I love the art though (I sound biased sowwy)\\n\\n\r\nEnjoyment-\\n\r\n10/10\\n\r\nI urge everyone to give it a try at least one episode.",
            "date": "2017-06-13T13:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 249832,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/megumi461",
                "username": "megumi461"
            },
            "url": "https://myanimelist.net/reviews.php?id=249832"
        },
        {
            "content": "Watched seasons 1 to 5 in three days. A well done anime that includes the characters journey with youkai(spirits), who all have their own agenda be it good or bad. Natsume, the lead character has a helpful personality where he aids youkai whenever they need his help. He inherited a book called the book of friends from his grandmother, who took the names of youkai she defeated and wrote them in the book, in order to control them. Natsume has been through a bad childhood and is now beginning to make friends. He has a so called bodyguard madara, a cat that can transform intoa powerful youkai. He is very funny and very greedy. This anime definitely deserves a watch.",
            "date": "2017-05-24T00:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 248399,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6268571.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rasengan123456",
                "username": "Rasengan123456"
            },
            "url": "https://myanimelist.net/reviews.php?id=248399"
        },
        {
            "content": "Natsume Yuujinchou Roku: Another smashing success for the Natsume Yuujinchou series! Finally, Natsume has some friends...\r\nThis season, we take a step back and explore Natsume Takashi's relationships rather than his personal battle with his supernatural powers. This season is mostly focused on developing the relationship between Natsume and the exorcist/actor Natori. However, Little Natsume gets an episode, we get an ENTIRE episode dedicated to Natsume's besties Kitamoto and Nishimuri, and finally, we learn a little more about Reiko and even... the possibility that Natsume has a grandfather??? \r\nCharacter: 10\r\nThe characters are what keep this series going. The feelings are real. The relationships are real. Thecharacters are real. This is what I love about Natsume Yuujinchou. The characters are created with such sincerity that it is incredibly easy to find a personal connection every episode. \\n\\n\r\nNatsume Takashi was a timid and shy boy. Now he's finally growing up and becoming a handsome young gentleman. He has found confidence in himself and in his friends. \\n\\n\r\nTanuma and Taki finally are able to help Natsume. It's incredibly rewarding to see them repay the help that they have received in previous episodes. \\n\\n\r\nKITAMOTO AND NISHIMURA: Natsume's two normal friends are the hidden MVPs of the season. I was so excited to see these two get an entire episode dedicated to them. We get a glimpse at their problems and and their somewhat awkward interactions with Natsume. Previously Natsume would try to hide things or run away from these two, but I'm so glad that now Natsume is opening up more. I hope to see more of these two in the future.  \\n\\n\\n\r\nStory: 8\\n\\n\r\nIt's Natsume's Book of Friends. Previously, the story was centered around Natsume's youkai friends and the book of friends. Now, the story has pivoted towards Natsume's human friends.  \\n\\n\r\nThe story started out strong with Little Natsume, which allowed us to focus on Taki and Tanuma, the two spiritually aware friends that Natsume is starting to trust and embrace more and more. Natsume helps a couple of random youkai and classmates, but mostly he has to deal with this exorcist crap with Natori. I'm not in love with the whole exorcist/evil plotline, and although it is something new, I'm not sure it feels totally natural to me.\\n\\n\r\nArt: 8\\n\r\nThe animation has consistently been improving season after season, and the art is consistently good. This season's opening is a vast improvement over season 5's. \\n\\n\r\nSound: 8\\n\r\nThe opening is excellent, and the BGM has not changed significantly, so the sound is overall very good. Not a fan of the ED though. \\n\\n\\n\r\nEnjoyment:9\\n\r\nA very pleasant anime to watch. Slightly more dramatic than previous seasons. \\n\\n\r\nOverall: 8\\n\r\nNot my favorite season of the series but still a very strong continuation of Natsume Yuujinchou. There were some real gems in this season but also some less compelling episodes. I'm excited for season 7! \\n\\n\\n",
            "date": "2017-06-30T15:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 251567,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pooprocks",
                "username": "pooprocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=251567"
        },
        {
            "content": "I have loved this series since I watched episode 1 of the first season. It is gentle, wistful, sad, thought provoking and really just a joy. It seems to be the very essence of Japan. \r\nI like all sorts of anime. Mech's, Fantasies, Romances.. but Natsume Yuunjinchou holds the soul of my love for anime. Reviews have been written by some who don't seem to realise that this is like a book of fairy tales. Like Grimm's, or Anderson's. They don't need to be anything more than they are. Natsume Yuunjinchou doesn't need to be any more than it is.\r\nIt  makes me laugh. Itmakes me cry. I talk to other people about it. I even have a couple of figurines looking over my shoulder from a shelf. They are the only figurines I own... have ever owned. The series means a lot to me and, it seems, to many, many others. I hope it lasts forever!",
            "date": "2017-06-20T08:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 250443,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Serendip",
                "username": "Serendip"
            },
            "url": "https://myanimelist.net/reviews.php?id=250443"
        }
    ],
    [
        {
            "content": "(The review covers all seasons, even though I also talk about the latest.)\r\nAfter six seasons, Natsume Yuujinchou excels as much in the art of conveying powerful emotions during each episode without ever giving the impression that the series becomes tiresome. If I were to describe this series most appropriately, I would say it's heartwarming, moving and (personally) exotic.\r\nThe synopsis is simple. We follow Natsume Takashi, a 15-year-old orphan boy who can see supernatural creatures called \"youkai\" or spirits, a capacity he inherited from his grandmother Reiko, who had died for many years. He also receives his grandmother's \"Book of Friends\" which contains all the contractsshe has made with youkai. With the powerful youkai Nyanko-sensei or Madara, Natsume gradually releases the various spirits that were linked to his grandmother.\\n\\n\r\nNatsume Yuujinchou has a simple structure. Each episode relates a new story featuring relationships between youkai or youkai-human relationships, and generally a difficulty concerning youkai(s). Each story is well written, sprinkled with mystery while disseminating hints enabling the viewer to arouse his curiosity. Some episodes focus only on Natsume, his adoptive family and friends. In all cases, the interactions between the different characters are very well-developed and in a natural way. The episodic format might suggest that in the long term it would become repetitive, but the diversity of stories is impressive with a relatively unpredictable style, sometimes resulting in a happy ending, sometimes a separation. It depends.\\n\r\nEven if the universe is fictional, the relationships are real. Natsume understands that youkai aren't so different from humans. They also have qualities, defects and feelings of all kinds: regrets, love, sadness.\\n\\n\r\nThe storytelling is executed masterfully. Usually we follow the story from the point of view of Natsume. We have therefore access to his thoughts, remarks on what he sees, other characters, etc. But at times, it happens also that the story is told to us by other more secondary characters. This season, there were Natsume's two friends: Kitamoto and Nishimura. It was interesting to have their opinion on Natsume and generally their point of view when they surprise Natsume helping a youkai (which they can't see of course).\\n\\n\r\nFor the characters: Natsume is a truly endearing character. Each of us can identify with him. I think at some point in life, we all spent moments isolating ourselves from others. (It was my case) And his kindness and timidity can't leave you indifferent and... it's impossible to hate him !\\n\r\nHis relationship with Nyanko-sensei is very fun to see. Nyanko-sensei can be seen as the pet of Natsume but thanks to its very powerful powers, Nyanko-sensei is also present to protect Natsume against a possible danger. Although this aspect isn't explicit in the series, I think it's really the key figure that has filled (at least partially) the solitude of Natsume.\\n\\n\r\nConcerning the supporting characters, I can say that after six seasons, they have received a complete development and are very endearing. Whether Natsume's friends, his adoptive family or his friends youkai, all have a real involvement in the plot and have their own personality. None of them is actually unidimensional and can't be classified in the \"dere-dere personality\". There are some runnings gags as when Taki is in ecstasy when she sees Nyanko-sensei because she finds him cute. But overall I can't define the characters with basic archetypes. The entourage of Natsume is undoubtedly composed of people who are fundamentally good (although Natori ...) since Natsume is himself a kind and caring person. I suppose the good people draw attention of the good people.\\n\\n\r\nThe atmosphere of the series is marvelous. Whether its splendid soundtrack with comforting music and others more adapted to the action scenes or its backrounds representing a calm, peaceful and mysterious countryside. The animation of the series is satisfactory without being exceptional either: mostly traditional animation. To come back to the scenery, I can say unequivocally that I have rarely seen such beautiful scenery in anime. Each image of the opening deserves a screenshot.\\n\r\nRei Yasuda's ending song is magnificent. This is probably my favorite ED for this past season. The melody and the lyrics correspond perfectly with the themes of the series.\\n\r\nI also add that there is a new OST in this season that I appreciate very much: the one we hear during the preview after the ending song.\\n\\n\r\nFinally, this narrative tells of self-fulfilment of Natsume. At the beginning of the series, Natsume is a lonely character who doesn't really have friends and is often suspicious when he meets new people, youkai or humans. It's difficult to open to others because of the feeling of rejection that he has known since his childhood. But then, thanks to the \"Book of Friends\", Natsume meets different spirits with which he become friends. We can notice that the opening of this new season emphasizes the evolution of the character especially when we see the \"current\" Natsume watching the \"child\" Natsume. He also became friends with many of his schoolmates. Whether it is his friends who know his abilities or his friends who do not know the existence of spirits, everyone will encourage Natsume to go ahead and support him if he needs help. Similarly for his adoptive parents, the Fujiwara, who really take care of him. Natsume doesn't wish to break his relationship with them and they never informed them either of his capacity or the Book of Friends. I hope one day Natsume will reveal them. Maybe in season 7?\\n\\n\r\nIn short, the series succeeds brilliantly from a simple plot to show us gradually what I can call a masterpiece. Each story, whether tearful or joyful, offers a life lesson to its viewers.\\n\r\nWith this, I take leave of you and I hope we'll see the sequel in the future.\\n\\n\r\nThank you for reading the review.",
            "date": "2017-06-20T16:46:00+00:00",
            "helpful_count": 111,
            "mal_id": 250492,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4797625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TuyNOM",
                "username": "TuyNOM"
            },
            "url": "https://myanimelist.net/reviews.php?id=250492"
        },
        {
            "content": "I'm here one more time to make a review of the best anime. Well, Natsume Yuujinchou is the most heartwarming anime I've ever watched. I've just finished watching the anime and I can really say it now: Natsume Yuujinchou NEVER disappoints me. \r\nStory: 10/10 - Like every season of Natsume Yuujinchou, it's about Natsume, a boy who had a tough childhood, lost his parents and now lives with the Fujiwara family. One day, he found the Book of Friends, a book that owns the names of many youkais, so Natsume is trying to give it back to all of them. The episodes can be massivesometimes (even more to people that doesn't like Slice of Life), but I must say that I enjoy EVERY single episode, some of them are really heartwarming, some episodes are dramatic, some will make you tense, but most of them will make you relax and enjoy life haha. If you're expecting for a big drama, this anime is not for you. The atmosphere of the episodes is so wonderful, it's calm and heartwarming.(like I said before)\\n\\n\r\nArt: 9/10 - The art style is a little bit simple, but it's beautiful, without exaggeration. Characters well-made, great sceneries and the youkais are very cool too.\\n\\n\r\nSound: 10/10 - Natsume Yuujinchou's OST is just marvelous! I think the OP of this season has become my favorite, and the ED is also great, but the most important are the background musics. They are awesome, and very calm too (just like in every season), they match perfectly with the situations. I have downloaded every OST of Natsume Yuujinchou, including this new season. It's a good OST to listen to when you want to relax.\\n\\n\r\nCharacter: 10/10 - Natsume is a gentle, shy and and isolated boy, what makes many of us identify with him at some point. Nyanko-sensei (his \"pet\") is really funny and despite they fight/argue many times, their relationship is great and Nyanko is really loyal. Most episodes are focused in other characters, like Nyanko-Sensei, Natsume's friends, but especially in the Youkais that appears asking to Natsume's help. But I can say that every character is very well worked, even the youkais who appears just for an episode or so.\\n\\n\r\nEnjoyment: 10/10 - Like every season, I enjoyed very much watching this full season. I really hope there will be more seasons. Natsume Yuujinchou always make my day better and happier!\\n\\n\r\nOverall - 9.8/10 - Well.... It's Natsume Yuujinchou, it's always 10/10. I totally recommend everyone to watch it!",
            "date": "2017-05-11T13:44:00+00:00",
            "helpful_count": 75,
            "mal_id": 247468,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3795693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GabrielaWolff",
                "username": "GabrielaWolff"
            },
            "url": "https://myanimelist.net/reviews.php?id=247468"
        },
        {
            "content": "To be honest, in just 4 days, I finished watching all the 5 seasons of this anime, oh boy no regrets. Probably the only anime I binge-watched all of its seasons religiously, even though I'm a pretty busy person because of work, I HAVE to find time to binge-watch this show because it's just amazing and heartwarming. \r\nThis anime is one of the greatest animes ever.\r\nStory: 10/10\r\nI know that this season is not finished airing yet, but I know, like its previous seasons, the story will be amazing. No, the story is not repetitive, like what the other people thinks. I'm one of those peoplewho detest repetitive plot or cliche plot or predictable stories; if Natsume Yuujinchou series is like that -- I already gave up on the show and proceed binge-watching something. Well, I didn't stop and yet I'm asking for MORE! \\n\\n\r\nEvery episode you get to explore different youkai's story and personality, you get to love Natsume and Nyanko-sensei more, you get to appreciate everything around you, and every episode will make your heart so warm you always want to cry because it's so beautiful. \\n\\n\r\nAfter each episode, your wish that you want to live with Natsume, the Fujiwaras, be with Nyanko-sensei, and Taki and Tanuma just goes out of control. If you guys know the memes on the internet asking if you want to live in the anime world, which one do you want to live in? It's definitely the world of this anime.\\n\\n\r\nArt: 10/10\\n\r\nThe animation is just everything in the show, it lives up to the heartwarming tone of the anime.\\n\\n\r\nSound: 10/10\\n\r\nOne of the reasons why I freaking loved this anime so much is because of its soundtracks. Every OP and ED of this anime is just so gooood. And just like the previous seasons, the music of this season is gooood too. Whoever's behind the music of this show, thank you so much. \\n\\n\r\nCharacter: 10/10\\n\r\nI love every character in the show, I mean even the villains. Omg what is wrong with me. \\n\\n\r\nEnjoyment: 10/10\\n\r\nMe smiling and crying so hard at the same time because of this show? Yes and thank you so much for making me feel this way.\\n\\n\r\nOverall: 100000000/10\\n\r\nIt kinda sad that unlike other airing animes, Natsume Yuujinchou is not that popular. It deserves all the hype, the love, and the attention from all the anime fans (even the non-anime fans). But I actually feel great because I'm not one of those people who is missing out on a very amazing show.\\n\\n\r\nIf you're looking for a sign to watch this show: THIS IS THE SIGN! Watch the show NOW! Of course, watch season 1 first up to season 5 -- you're not going to regret it. Enjoy! :)",
            "date": "2017-05-17T01:51:00+00:00",
            "helpful_count": 47,
            "mal_id": 247894,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5466849.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TheDoggoneGirl",
                "username": "TheDoggoneGirl"
            },
            "url": "https://myanimelist.net/reviews.php?id=247894"
        },
        {
            "content": "The story is a masterpiece since season 1 \r\nthe everyday life of Natsume while protecting the Book of Friends inherit from his grandmother.\r\nHis character become great he gain more trust to his friend he still learn a lot from the everyday experience (Story 10/10)\r\nArt is great too the animation better and better from season 1. they portrait the characters really well (Art 10/10)\r\nThe Opening and Ending Songs are great have deep meaning and its perfect for the characters in the anime\r\n(Sound 10/10)\r\nThe characters are great even there are small cameo roles in some episode but they portrait it really well \r\n(Character 10/10)\r\nThe Enjoyment watching theanime is great I cant get enough with it I will miss them . (Enjoyment 10/10)\\n\\n\r\nI really recommend this anime the story is a masterpiece I think this is the anime that I watch with this many season and hopefully many more to come\\n\r\nOverall 10/10",
            "date": "2017-06-20T18:22:00+00:00",
            "helpful_count": 38,
            "mal_id": 250498,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5655301.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nath51",
                "username": "Nath51"
            },
            "url": "https://myanimelist.net/reviews.php?id=250498"
        },
        {
            "content": "The 6th Season of Natsume's book of friends, First of all I'm proud of how far this series has come and just how consistent it is with it's quality. It's an anime that has never disappointed me, And I hope it gets a lot more seasons.\r\nLike every season, Natsume Yuujinchou plays to it's strengths. It's a very relaxing anime. It's quiet, slow(for good reasons), full of lovable characters. It's a vibe, a very spirtual vibe that it gives off through it's country side atmosphere and it's fantasy elements. It sometimes gets pretty dark and mysterious which adds a lot of flavor to this show. Thestorytelling in every episode is superb, It's always fresh and simple, The use of symbolism and Goblins to tell a new tale every episode shows how well scripted and cohesive it is.\\n\\n\r\nEvery season it slowly pushes the story, this time it got to a point that a lot of people were biting their nails for a pretty long time, and they kinda ended it there, so I can't wait to see what happens next, I might read this manga before Attack on titan if they don't make any announcements soon.\\n\\n\r\nI honestly don't have anything major to complain, sometimes it's a little unbelievable how some people react to Natsume, But it happens very rarely and it's something I can slide because of the characterization. That's it. The animation is good too, it's not anything crazy but it works very well for it's environment and the vibe that it gives off, The music is always spectacular, I'll say this, during exam times or if you have any stress, just listen to this OST it'll help. It's just beautiful.\\n\\n\r\nOverall just another amazing season of my most favorite slice of life ever, Some people might not find it interesting but I would definitely recommend watching this and all it's previous seasons.\\n\\n\r\nI would give a 9.5/10.",
            "date": "2017-06-21T10:04:00+00:00",
            "helpful_count": 28,
            "mal_id": 250550,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tigermaskshinobi",
                "username": "tigermaskshinobi"
            },
            "url": "https://myanimelist.net/reviews.php?id=250550"
        },
        {
            "content": "My first impressions for this show after watching the first two episodes, I felt that the season would focus on motifs of Natsume growing up with unique capabilities and what life was like for him during these difficult times. It turns out that I wasn’t too far off on my hypothesis! Woot.Very much like the previous season, this new addition has been quite reflective in regards to Natsume’s past, mostly in relation to the obstacles that he faced as a child. We get to experience more concrete glimpses into the core facets via contemplative thoughts that our protagonist has about the person he used tobe and the person that he’s become. This breathtakingly puts into perspective the character growth that he’s undergone over the span of the past 72-episodes.\\n\\n\r\nEvery single aspect about Natsume’s Book of Friends is a stunning masterpiece and a subtle ode to Japanese culture and spiritual beliefs. It’s presented in glorious animation, infused with the aesthetics of tradition and history. From the mannerisms and etiquette, to the way that everyone interacts with another-supernatural or otherwise-to the common dilemmas involving dysfunctional and complicated familial bonds, friendships steeped in misunderstanding, and the simple emotions of loneliness that’s blossomed from a deep loss–all of these come together in a marvellous, fluid way to create a story that’s highly engaging and compassionate.\\n\\n\r\nVisually, the anime is just as lovely, if not more, as its predecessors. The natural surroundings of the forests, neighbourhoods, and mountainous regions are depicted with great detail while retaining an air of ordinary beauty. The characters are all natural and easy to differentiate from one to the next. Whenever it calls for it, the suspense, laced with ethereal affects, conjures just the right amount of tension without feeling heavy, forced, or insufficient.\\n\\n\r\nThe soundtrack continues to be wholeheartedly magical with melodies composed of piano, shamisen, and wood instruments that work together to instil warm-hearted emotions and empathetic responses. It’s tasteful, sophisticated, and so easy to listen to, making it the absolute perfect accompaniment to the classic aura of Japanese culture.\\n\\n\r\nRegardless of all of these things to love and appreciate, the best parts of the season were the themes of friendship and family, the bonds that tie people together, which is inherent in every new instalment to the serial. It’s a show that really peels away all of the layers that make humans such complex creatures and reveals us for the simpletons that we are: individuals who fight our own realm of loneliness; people who just want to love and be loved and accepted, whether it’s romantic, familial, etc.\\n\\n\r\nIn conclusion, Natsume’s Book of Friends was one of the best shows out there for the Spring 2017 Anime line-up, and it will always be a masterpiece for me. It’s the kind of genuine feel-good series to pick up when you need it the most. I highly recommend this to all fans of anime, especially if you’re new to the medium. It can be enjoyed by anyone who loves a beautiful story.\\n\\n\r\n10 maple leaves outta 10!\\n",
            "date": "2017-07-04T15:49:00+00:00",
            "helpful_count": 22,
            "mal_id": 251951,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5453400.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yon_Nyan",
                "username": "Yon_Nyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=251951"
        },
        {
            "content": "The story line of Natsume Yuujinchou is impeccable and it left me with an incredibly warm feeling after watching every single episode. The opening and ending songs really tie in well together with the plot, and it is one of the few animes where i do not skip through the ops and eds. I followed this series for a long time already, but there is still the unwavering anticipation for the next episode/ season to come out.\r\nNatsume has really developed over the seasons and in this season, we see more about his relationships with others. He is not the mediocre hero, and that is whatmakes him so relatable and the series so uplifting and pleasing. The anime makes me smile every single time.\\n\\n",
            "date": "2017-06-01T21:57:00+00:00",
            "helpful_count": 9,
            "mal_id": 249087,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/megansimyr",
                "username": "megansimyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=249087"
        },
        {
            "content": "If you've made it as far as the sixth season you're probably well aware of the charm and appeal of Natsume. What I'm here to call everyone's attention to however is this season has PEAK Nyanko-sensei animation. You will be treated to love, bounciness, cuteness, care and attention put into each frame of art that is the upmost joy to watch out of this calico cat. The likes of which you didn't realized would be topped from before. Okay, thank you for coming to my TED talk\r\n...\r\nIf you would like more of a substantial review, Natsume Yuujinchou Roku is as heartwarming, bittersweet, and cozy towatch as it's always been. The continued creativity with each new youkai still amazes and forever leaves me wanting more. While the episodic nature of the show leaves me content, the ever so slight progressions in everyone's character as well changes in the plot are evident enough that Natsume Yuujinchou still doesn't yet show signs of getting dull anytime soon. The only complaint I could have is more new additions to the sound track would be nice, but it's a small qualm considering the OST is good enough to have a regular spot on all my playlists even after 5 years. This series truly is a very dear masterpiece that will enrich your life for the better.",
            "date": "2019-03-30T22:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 304992,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4230357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sushi-kushi",
                "username": "sushi-kushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=304992"
        },
        {
            "content": "So far among all the anime series I have watched, this one is the best. I loved all the 11 episodes of this season, especially the first 3. \r\nIt is amazing to see how much Natsume has changed throughout the seasons. His interactions with everyone around him, be it youkai or human, is definitely fun to watch. His sudden facial impressions are priceless. There are no characters you can hate, of course if you are up for this type of story. This is my second time watching the whole series. \r\nTo be honest, when I started watching the series for the first time last year,I wanted to drop it as first few episodes were not up to my expectations. I am so glad I didn't quit, which led me to this awesome season. \\n\\n\r\nHoping for a season 7 :D",
            "date": "2018-03-01T08:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 272726,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4665396.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SakuraAme",
                "username": "SakuraAme"
            },
            "url": "https://myanimelist.net/reviews.php?id=272726"
        },
        {
            "content": "Natsume yuujinchou is one of the few shows which calms the soul. Throughout watching it, since season 1, it made me feel extremely calm and happy about the world around me. That in itself is one of it's biggest successes. Amongst all the gore, action and fast paced anime, natsume yuujinchou gives us the opportunity to look around at the world around us and appreciate beauty. It has beautiful messages in each episode about kindness and empathy, which teaches one alot.\r\nStory- 10/10\r\nThe story in itself is great with each episode bringing some new characters or just telling the story of the older characters. Natsume yuujinchouhad the ability to make simple stories seem extremely \"feelsy\" and basically just amazing.\\n\\n\r\nsound-9/10\\n\r\nThe music itself was brilliant. Ever since season 1 the ending songs have been great and so peaceful. The opening to this season was great and probably the best so far. The ost has been good as usual bringing out feels when required. \\n\\n\r\nCharacters -10\\n\r\nThe characters of natsume yuujinchou are incredibly fascinating. All possess different characteristics, whether it is the lovable protagonist natsume takashi, whos childhood and upbringing gives us much depth into his character or Reiko his grandmother who is very different yet similar to him. Some memorable characters would be natsume, reiko, nyanko sensei, natori and I could just go on. All characters are so well developed and so have so much depth. It's just amazing.\\n\\n\r\nOverall 10/10\\n\r\nWatching natsume yuujinchou has been such a great journey for me and it had such a positive impact on my life. I am grateful for this anime and highly recommend it to everyone for it's incredible ability to make us \"feel\". It's been fantastic and I can't wait for season 7.",
            "date": "2018-05-25T06:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 281344,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6634373.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Lifeislife",
                "username": "Lifeislife"
            },
            "url": "https://myanimelist.net/reviews.php?id=281344"
        },
        {
            "content": "*Spoiler Free Review*\r\nFirst of all i need to mention that this review will be a review of all the seasons so i will post this to here and to the first season's review section.\r\nWhen i first started watching Natsume Yuujinchou, it felt kind of boring. It was cute and all but i am not a person who watches episodal anime that much. I felt like i would drop it if it continued like that. Because every episode Natsume met with a new youkai and gave their name or helped them. And i found it a bit boring. But i kept watching. At the end ofseason one, i got used to how the story goes on and i got used to the characters.\\n\r\nThen i started watching the second season. I realized that i actually started liking it.\\n\r\nAnd when i started watching the third season, i loved it. \\n\r\nIt probably wasnt because the third season had better quality than the second season or the first season. It was probably because, you get to know some characters during the first two seasons, you get to know the whole town and the anime makes you feel like you are a part of that world now. You feel the characters feelings as if they are you friends, you feel the sadness in the air, you feel the happiness... \\n\r\nSo yes, it started slowly but it was done like that to be able to have a really good setting. And when you get into it, you love it.\\n\r\nAlso when they were finished with introducing the characters and the setting, they started telling a main story too. And the main story interested me a lot.\\n\\n\r\nAfter i started liking it, i loved watching all the episodes. The fifth season had some boring episodes in my opinion but only \"some\".\\n\\n\r\nNatsume Yuujinchou had a really calming atmosphere. There were many episodes i watched with a smile on my face. There were many episodes that made me forget my saddness. And there were many episodes that made me really emotional too. Natsume meets with many youkai and has a journey with many youkai. Of course you can not relate to all of the youkai's feelings but there were many times i related a lot and felt like crying a lot. And also when they became happy, there were a lot of times i became happy too.  \\n\r\nStory-8\\n\\n\r\nThe art develops a lot. There are 3 years between the first season and the second season. Also there is 4 years between the fourth season and the fifth season. Thats why the art gets a lot better in the sixth season and its really beautiful. Especially the sixth season's opening is a feast for one's eyes.\\n\r\nArt-9\\n\\n\r\nI really liked many of the openings and the endings except the first season's. Also the insert songs are great imo too. There is especially one song called Haru wo shiraseru mono. Whenever i hear it, i feel so many emotions inside.\\n\r\nSound-8\\n\\n\r\nI really like nearly all of the characters. I even like Reiko and want to see her a lot more. \\n\r\n*Natsume is the best boy*\\n\r\nCharacters-9\\n\\n\r\nSo to sum up, i loved Natsume Yuujinchou. If you would like to watch something relaxing you should deff give it a chance. And dont drop it in the first season. \\n\\n\r\nBtw my 9 starts is for the whole series\\n\r\n1st season-7stars\\n\r\n2nd season-8 stars\\n\r\n3rd season-9 stars\\n\r\n4th season-9 stars\\n\r\n5th season- 8 stars\\n\r\n6th season-9 stars",
            "date": "2019-03-09T07:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 303165,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6202716.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JadeCeci",
                "username": "JadeCeci"
            },
            "url": "https://myanimelist.net/reviews.php?id=303165"
        },
        {
            "content": "So, I've made it to the sixth season of Natsume's Book of Friends. Each season, I feel like this story gets better and better and closer and closer to what I want to see from it. \r\nMy favorite aspect of this season (as has been for the past couple seasons) was the development that we get to see for Natsume and his friends. Unlike previous seasons, though, I feel like this season started to bring Natsume's two worlds together in a way we hadn't seen before, which is something I was highly anticipating. I don't know if the story will take it past the bitswe got in this season, but I really hope so. Another thing I really want to see more of that we got a little bit of during this season was some internal conflict going on with Natsume. Like I said, there was some, but I would really love to see a point in the future where Natsume has some pretty serious struggles with the world of youkai and humans. \\n\\n\r\nThere was more development for Reiko this season, as I was hoping for from last season, though it actually felt like a small bit of a decline from season five. However, I enjoyed the anime's way of telling her story this season because we got to hear more about her as a person in her own time rather than this person from however many years ago that could talk to youkai.\\n\\n\r\nI will say this season, while amazing, seemed like a bit of a set up for what's to come. For example: who are Natsume's grandparents, really? How much power does Natsume actually have? Will there come a time when Natsume thinks it's best to open up to everyone in his life about youkai? Unfortunately, these questions don't get answered this season, but the set up is just as magical and fantastical as all the other seasons have been.\\n\\n\r\nThis anime really does take you to another world and I think, regardless of the fact that it may not start out as everyone's cup of tea, it's going to end up being a lovely anime for anyone to watch.",
            "date": "2019-03-07T17:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 303087,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=303087"
        },
        {
            "content": "If you are here reading the review for the sixth season then you must have already watched the previous seasons, I presume. \r\n**DECLARATION**This is the only anime out of vast collection that I want to get new episodes till my last breathe. I mean it. \r\nNatsume yuujinchou introduces new stories every single episode and yet it never fails to leave a heart warming feeling. starting from season 1 till this season 6, I without any doubt enjoyed every single story. I understand that there are not much of plots and twists in it but in this world full of hectic routine you might want toescape into a peaceful word and relax. The morale I get from the ending of each episode is clearly relatable to our real life to some certain extend.\\n\\n\r\nMusic -\\n\r\n10/10\\n\r\nI loved all the openings and endings. The music seems to be made just for this anime, it fits in perfectly.\\n\\n\r\nArt-\\n\r\n8/10\\n\r\nThe art quality is not that up to the mark but if it a good story it doesn't really hurt much. I love the art though (I sound biased sowwy)\\n\\n\r\nEnjoyment-\\n\r\n10/10\\n\r\nI urge everyone to give it a try at least one episode.",
            "date": "2017-06-13T13:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 249832,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/megumi461",
                "username": "megumi461"
            },
            "url": "https://myanimelist.net/reviews.php?id=249832"
        },
        {
            "content": "Watched seasons 1 to 5 in three days. A well done anime that includes the characters journey with youkai(spirits), who all have their own agenda be it good or bad. Natsume, the lead character has a helpful personality where he aids youkai whenever they need his help. He inherited a book called the book of friends from his grandmother, who took the names of youkai she defeated and wrote them in the book, in order to control them. Natsume has been through a bad childhood and is now beginning to make friends. He has a so called bodyguard madara, a cat that can transform intoa powerful youkai. He is very funny and very greedy. This anime definitely deserves a watch.",
            "date": "2017-05-24T00:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 248399,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6268571.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rasengan123456",
                "username": "Rasengan123456"
            },
            "url": "https://myanimelist.net/reviews.php?id=248399"
        },
        {
            "content": "Natsume Yuujinchou Roku: Another smashing success for the Natsume Yuujinchou series! Finally, Natsume has some friends...\r\nThis season, we take a step back and explore Natsume Takashi's relationships rather than his personal battle with his supernatural powers. This season is mostly focused on developing the relationship between Natsume and the exorcist/actor Natori. However, Little Natsume gets an episode, we get an ENTIRE episode dedicated to Natsume's besties Kitamoto and Nishimuri, and finally, we learn a little more about Reiko and even... the possibility that Natsume has a grandfather??? \r\nCharacter: 10\r\nThe characters are what keep this series going. The feelings are real. The relationships are real. Thecharacters are real. This is what I love about Natsume Yuujinchou. The characters are created with such sincerity that it is incredibly easy to find a personal connection every episode. \\n\\n\r\nNatsume Takashi was a timid and shy boy. Now he's finally growing up and becoming a handsome young gentleman. He has found confidence in himself and in his friends. \\n\\n\r\nTanuma and Taki finally are able to help Natsume. It's incredibly rewarding to see them repay the help that they have received in previous episodes. \\n\\n\r\nKITAMOTO AND NISHIMURA: Natsume's two normal friends are the hidden MVPs of the season. I was so excited to see these two get an entire episode dedicated to them. We get a glimpse at their problems and and their somewhat awkward interactions with Natsume. Previously Natsume would try to hide things or run away from these two, but I'm so glad that now Natsume is opening up more. I hope to see more of these two in the future.  \\n\\n\\n\r\nStory: 8\\n\\n\r\nIt's Natsume's Book of Friends. Previously, the story was centered around Natsume's youkai friends and the book of friends. Now, the story has pivoted towards Natsume's human friends.  \\n\\n\r\nThe story started out strong with Little Natsume, which allowed us to focus on Taki and Tanuma, the two spiritually aware friends that Natsume is starting to trust and embrace more and more. Natsume helps a couple of random youkai and classmates, but mostly he has to deal with this exorcist crap with Natori. I'm not in love with the whole exorcist/evil plotline, and although it is something new, I'm not sure it feels totally natural to me.\\n\\n\r\nArt: 8\\n\r\nThe animation has consistently been improving season after season, and the art is consistently good. This season's opening is a vast improvement over season 5's. \\n\\n\r\nSound: 8\\n\r\nThe opening is excellent, and the BGM has not changed significantly, so the sound is overall very good. Not a fan of the ED though. \\n\\n\\n\r\nEnjoyment:9\\n\r\nA very pleasant anime to watch. Slightly more dramatic than previous seasons. \\n\\n\r\nOverall: 8\\n\r\nNot my favorite season of the series but still a very strong continuation of Natsume Yuujinchou. There were some real gems in this season but also some less compelling episodes. I'm excited for season 7! \\n\\n\\n",
            "date": "2017-06-30T15:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 251567,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pooprocks",
                "username": "pooprocks"
            },
            "url": "https://myanimelist.net/reviews.php?id=251567"
        },
        {
            "content": "I have loved this series since I watched episode 1 of the first season. It is gentle, wistful, sad, thought provoking and really just a joy. It seems to be the very essence of Japan. \r\nI like all sorts of anime. Mech's, Fantasies, Romances.. but Natsume Yuunjinchou holds the soul of my love for anime. Reviews have been written by some who don't seem to realise that this is like a book of fairy tales. Like Grimm's, or Anderson's. They don't need to be anything more than they are. Natsume Yuunjinchou doesn't need to be any more than it is.\r\nIt  makes me laugh. Itmakes me cry. I talk to other people about it. I even have a couple of figurines looking over my shoulder from a shelf. They are the only figurines I own... have ever owned. The series means a lot to me and, it seems, to many, many others. I hope it lasts forever!",
            "date": "2017-06-20T08:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 250443,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Serendip",
                "username": "Serendip"
            },
            "url": "https://myanimelist.net/reviews.php?id=250443"
        }
    ]
]