[
    [
        {
            "content": "Well, this is my first review, and I don't think I'm good at writing them, but I'll give a try.\r\nI've scored the three previous season to 7, mainly because it was repetitive, and there was not this thing that embraces your mind and take you to an other world. \r\nAnd then, I've watched this season, the final one. And it is perfect. Louise is becoming more and more mature, even if she keeps her tsundere style which is still funny (although it annoyed me a lot of times, but hey, it's who she is after all). For Saito, it's approximatively the same, he's growing too,and we really see their relationship evolving...\\n\\n\r\nAbout the scenes, there is a lot more romantic scenes than before, which is wonderful because their kind of different from the previous season, there is something that makes you feel good, and you're happy for them too in some way.\\n\r\nSince I was also obsessed by the magic scenes with void magic and all that, you should know that there's also a LOT more of these scenes, and I found that they were much more impressive.\\n\\n\r\nI'm also noticing the OST which is just full of epicness (special note for the song \"Passion\" which I'm listening right now).\\n\\n\\n\r\nI think they did a really good work, this season embraces the whole series, and every episode makes you feel wonderful and the two final episodes are just so much awesome that you can't accept it is already over, and then you see how it was just a nicely dream in which you will go back someday...\\n",
            "date": "2013-05-14T04:28:00+00:00",
            "helpful_count": 154,
            "mal_id": 97149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2000272.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/matonyan",
                "username": "matonyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=97149"
        },
        {
            "content": "Zero no Tsukaima F is the final season of the series and it features a young boy Saito getting abused by his master Louise. Stuff happens, Saito is extremely indecisive about his relationship with Louise, stuff gets fixed. Nothing new is really found in this season and I won't go too much into detail about the summary because hey, you should have seen the previous three seasons before you watch the 4th one, no?\r\nSo about the story.. heh. If you have seen the previous seasons, you'll have a pretty good idea what happens. Some stuff happens, maybe some random fanservice here and there, filler episodesrandomly thrown in out of nowhere, a problem occurs  and is solved with usually an unrealistic solution that probably has some plot holes. And by plot holes, I don't mean \"look very deep into the anime\" ones, I mean \"wtf how did they just do that it didn't make any sense at all\" kind of plot holes. It takes the fantasy genre to a whole new level and again, not in a good way (SPOILER example: Saito stealing a fighter jet from a military base in 2 seconds).  Some of it can be attributed to the fact that the majority of the season was rushed but all in all, they really did not need some of the fillers; it was just a waste of time. If you're one of those people that like to have an intricate plot with plenty of BAM moments, this is not the anime for you. The plot is lackluster and very predictable. The ending was a perfect example of this. Personally, I thought the ending was very predictable but it fits the anime. Having said that though, ZnT is NOT about the story. If you have been watching this for the story, then I got news for you, choose something else to watch. The story here is just there to have at least some \"meaning\"  between each episode, nothing special.\\n\\n\r\nAl-right, the characters. The characters are again, nothing special. An abusive tsundere, some boobs, some more boobs, and a loli. This anime throughout the seasons has shown no character development, Louise and Saito were supposedly married at the end of season two but Saito is still an indecisive guy and Louise still blows him up. Usually this would lower the score as dynamic characters are always good but the thing is, it's what the anime is known for. This is why most people have continued to watch though the seasons. Sure, Saito will piss you off every time he ogles some girls breast because he completely lacks self-control or some other stuff that ticks you off. The non-changing character foils that have been constant throughout all four seasons is the selling point of this anime. You don't watch this to see some well thought out strategy like Death Note or the plain awesomeness of Steins;Gate, you watch this too see Saito getting blown up by explosions and the tsundere Louise being her usual self and the relationship between them. I will have to say that it will probably get tiring if you watch this in one go.\\n\\n\r\nThe sound doesn't really do much considering most of the BGM is just reused from the previous seasons. In some cases, it certainly does help set the mood and I loved how they reused one of the openings during one of the final episodes. The energetic OP also adds towards the enjoyment of the anime; it fits the mood. Though the EP isn't bad, the usage of it is certainly questionable in some cases. Something some by Rie Kugimiya doesn't really fit certain situations if you know what I mean.\\n\\n\r\nThe art wasn't really exceptional and doesn't take away from the anime itself. Not much to comment on this as it doesn't feature any special art style. The battle scenes were too short in my opinion.\\n\\n\r\nI'm a Louise fan so this is probably biased but I really enjoyed the series overall. If I was to use by biased score, this would be a 10/10 just because I'm a huge Louise fan. That's kind of the thing with this anime, either you'll hate the characters (I don't think many people expected much out of the story anyways) or come to love em. The story was really annoying at certain points because of the number of episodes that were just pointless. They could have easily just spent a couple of minutes or not even included certain parts (really didn't need a episode dedicated towards the crowning of a queen) of the anime. The ending however, was probably the saving grace for this anime. I personally value a conclusive ending opposed to some random harem ending. Overall, I think that this season manages to set up the end of the series only leaving some minor plot holes. Watch this with a grain of salt in mind.\\n\\n\r\nFeedback is appreciated as this was my first review.",
            "date": "2012-04-01T14:24:00+00:00",
            "helpful_count": 114,
            "mal_id": 57655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/theazntiger",
                "username": "theazntiger"
            },
            "url": "https://myanimelist.net/reviews.php?id=57655"
        },
        {
            "content": "Four episodes in, and things actually got to a pretty explosive and fantastic start - the first three episodes are devoted entirely to closing up what the third season left hanging, and it does so EXTREMELY well. New characters are introduced, but they don't take up too much time in favor of action and plot. Those first three episodes on their own could have made the entire season, to the point that if they had been released as an OVA on their own, I wouldn't have been surprised. \r\n... And perhaps they should have. With the fourth episode, we're treated to the typical cliches andgags, with Louise wanting Saito on her own time but being her nasty, violent excuse for \"tsun\" the rest of the time. Admittedly, in the first episode, there was an argument that was fairly petty, but it was resolved surprisingly well for this series. \\n\\n\r\nFurthermore, the fact that Siesta, who was a fairly enjoyable character in the first season, and now even Tabitha, have been reduced to, essentially, characters that just cling to Saito just to cause an issue for Louise, not to mention the fact that Louise constantly takes THEIR affections out on Saito, almost as often as he's pledged his devotion to her (he does, admittedly, ask for it sometimes) just makes things all the more ridiculous.\\n\\n\r\nWhat's more, there's a plot device used to keep Siesta around, in that the queen asked her to be Saito's maid, but thinking about it - Wouldn't the queen know better than to do this after observing them for, oh, five minutes? Especially given that Siesta's self-proclaimed \"love rival\" is the queen's best friend, and as of season three, sister?\\n\\n\r\nUltimately, the flaw with what follows the great first three episodes (or perhaps just great THIRD episode - the first had its share of these problems as well) is that this series is trying to be a harem when it's got an established romance, and isn't letting its characters develop like they should in order to keep the harem aspect going when it's been clear (and even canon) from early on that there is no point to having a harem here.\\n\\n\r\nOur protagonists have been saying from as early as the second season they love each other, we should not be arriving on the fourth season with the relationship still acting in a standstill, and with Louise acting in the same, petty way she has been all along, guided by shallow plot devices.\\n\\n\r\nAside from the romance/harem aspect of the series, however, the plot seems to be shaping up to be as good as always, and development outside of Louise has been decent. We've seen how Saito has grown since he's come to this world, and even how side characters like Guiche have taken to being warriors in their own way. \\n\\n\r\nOverall, I'll be watching to the end, but unless things improve drastically in regards to Louise and her relationship with Saito this time around, I think I won't be too sad to see this one end here.",
            "date": "2012-01-31T13:02:00+00:00",
            "helpful_count": 86,
            "mal_id": 52939,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/164133.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/oversevethousand",
                "username": "oversevethousand"
            },
            "url": "https://myanimelist.net/reviews.php?id=52939"
        },
        {
            "content": "So.... The 4th season of Zero no Tsukaima, and let me tell you why I scored this so poorly.\r\n All through out the whole series Louise has not changed in any aspect what so ever. She still goes on with the same routine, \"oh I'm going to trust Saito from now on\" and ends up frying his ass at least once in each episode. \r\nThis season would have been some what bearable if Louise had some character development, but unfortunately that is not the case.\r\nThis also goes for the other characters as well, almost NOBODY has really developed through the series. Because of this eachepisode is just the same thing over and over again, and to be honest I'm sick and tired of it. \\n",
            "date": "2012-01-27T23:27:00+00:00",
            "helpful_count": 58,
            "mal_id": 52699,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1071765.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KiriyaXIII",
                "username": "KiriyaXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=52699"
        },
        {
            "content": "Zero no Tsukaima F\r\nI thought that i was going to hate this season just like as the third season, but surprisingly this is the best season of the entire anime, everything is improved and i finally enjoyed a lot a season of this anime and for once i didn't found pointless and annoying Louise and Saito's realationship\r\nStory\r\nThe story is very good, it was improved on this season, there's just two stories to follow, the mission that the queen Henrietta gave both of the two to see the pope and see what the Pope wants with them and the other story is the finally growing relationshipbetween Louise and Saito, finally there's not hate-love between them, but more love, more romantic and that was great, finally something that i wanted the producers to make, and both stories are well paced; The story to make all the void magic users to be reunited because there's is a profecy that a big Dragon will destroy the world and only the four void users can stop him, but it's interrupted because one of the Void users is the enemy and will not help them, the things get complicated... meanwhile Louise and Saito's bond gets stronger and stronger and will have a pleasant ending for them, but not for me, because finally they were really close to eachother and i wanted to see that since the beginning.\\n\\n\r\nArt & Animation\\n\r\nThe art and animations really improved, it was colorful and brighter, and smooth, it was the best of the four seasons, the overall was very good.\\n\\n\r\nSound\\n\r\nThe sound was the same, with little changes but still was good.\\n\\n\r\nCharacter\\n\r\nFinally they developed Louise and Saito, and it was a big improvement, the other characters weren't behind on improvement neither, finally we get to know more a lot of their background, overall it was very good.\\n\\n\r\nEnjoyment\\n\r\nThe only season that i enjoyed a lot and wanted every season to be like this, because i felt like they restarted and improved everything on a good way, the ending left me wanting more, because they finally are together and trusth eachother and i liked how Louise changed from being the kind of tsundere that i hate to a calm tsundere like Taiga when she was with Ryuuji.",
            "date": "2015-08-07T15:40:00+00:00",
            "helpful_count": 33,
            "mal_id": 195456,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195456"
        },
        {
            "content": "This is the fourth season of Zero no Tsukaima,it's a romantic harem with supernatural powers. As for the story it's the same good ol story from the last three seasons it starts off with Saito dreaming about Louise and Siesta then he touches Louises boob then wakes up because in his dream he describes her boob as a flat plain and Siesta's as a Mountain range then Louise blows a hole through the wall with her explosion. I kinda figured i'd start that way, but to be honest I feel like Saito is more of a perv after every season progress. Also i'm starting tofind that when ever a romantic serious moment is about to happen something funny happens for relief.As for the sound&art it's still the same  from the other three seasons.In conclusion this series isn't perfect, but since I been watching from season one im hooked. I've enjoyed the pass three seasons of this anime and i'm looking forward to this fourth season.Although i've only watched one episode I think it's going to be a good one.\\n",
            "date": "2012-01-08T13:32:00+00:00",
            "helpful_count": 21,
            "mal_id": 51277,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/802755.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ramzacloud",
                "username": "ramzacloud"
            },
            "url": "https://myanimelist.net/reviews.php?id=51277"
        },
        {
            "content": "Zero no Tsunami F is the final and last sequel to \"Familiar of Zero\" series.\r\n I am very excited to review this show as this was also a pathway for me to enjoy and love anime. Please start with season one.\r\n Zero no Tsunami F and it's prequel may be your classic harem with a Tsusendere and a average boy as your main character with lots of girls surrounding him but this is worth the watch. Giving this show a 8 was a solid score surrounding this series as a whole but could have exceeded my expectations even more.\r\n When looking at the 2 maincharacter which are Louise and Saito. You can really say that there relationship is funny, cute and overdramatic at certain times. When the manga was being adapted into an anime I was surprised that it lasted so long with four seasons completed. Tbh I think everyone had a thrilling ride watching this show.\\n\\n\r\n Knowing this was a romantic comedy with a magic theme that had been included gave it a refreshing feeling to the viewer as each sometimes episode contained a element of randomness which gave us a comedic and light refreshing feel towards the show.\\n\\n\r\n The anime begins by continuing to describe the adventures that follow the \"Hero\" Hiraga, Saito and the \"unique women\" called Le Blanc de La Vallière, Louise Francoise Better known as (Zero Louise) whom has a funny but cute relationship. Reference to the first season is where Saito appears from the human world to Tristein Academy.\\n\\n\r\n This anime includes other genres such as comedy and drama that is centred around the main characters. The magic and dramatic elements are given at unexpected moments but that builds up the enjoyment. This however creates a very unique and always different situations between the main characters, but when we observe this situation we can a new picture that is created when a new cloud always get painted over the old. When watching the show you know these characters have a sense of little or no maturity at all (Really pushing it Louise there) and gives them the ability to tackle new challenges with awesome but hilarious methods. This type of lifestyle gives a pretty accurate description of the whole anime and it is pretty different from your usual romantic comedy that we occasionally see from time to time.\\n\\n\r\n I find the pacing of the show to be slow/moderate in the viewers point but I am not judge. It tells us a story in a suitable manner that is executed with minor or no flaws at all. This allows the viewer to be entertained with none or little mood swings. If the series was any slower or faster I might have to change my thoughts on the shows progression.\\n\\n\r\n Being a romantic comedy anime, It all comes down to Familiar of Zero being able to give us comedic and straight in the face lines. The interactions between different characters gives us different moments in were we just laugh hysterically or cry. You can relate to the characters emotions shown by facial expressions and the uneasy movement they might produce. Being a comedic anime I am certain it will make you laugh and give dramatic moments where you will not feel at ease.\\n\\n\r\n Zero no Tsukami is a good way to enter a romantic comedy where you will be laugh away. When the audience try's to understand the characters I think they will judge them by there personality and how they interact and develop new bonds and feelings which tighten the show all together. This gives the audience a small feeling of the characters current emotions. \\n\r\n The comedy and drama may not seem new to most but with the addition of random twists and characters gives light to a whole new drama. on Classical comedy being one of them, It depends if the viewer has enjoyed it in which it has altered the opinion of the viewer towards the series. However having some magic included will also draw the audience closer and will have a significant influence on there overall opinion of the show.\\n\\n\r\n Again having not read the manga I wouldn't presume that the anime is way off from its paper counterpart.\\n\\n\r\n Having magic integrated into the show gives it a new light.\\n\\n\r\n The anime try to tackle the development of relationships between characters through dramatic or random situations and through interactions and actions done by the characters which little by little develops more and more. The difference this show has compared to others of the same genre is how the characters are portrayed and overly influenced. We see the story from the main 2 characters however there is parts that give the views of the other characters as they encounter new challenges and develop new feelings towards them and others.\\n\r\n Thus telling us Zero no Tsukami gives us an enjoyable watch to take in and remember.\\n\r\n The design of the characters is well based given the date for this show and its prequel with little or some difference in facial features and expression.\\n\\n\r\n The setting is wonderful and gives us a magical theme by the use of different light schemes and scenery. The colour used is simplistic and elegant giving a bright view of the setting.\\n\\n\r\n Concluding this review. Zero no Tsukami was giving a different feel compared to its recommendations. I did not know wether I was gonna enjoy it or be completely bored and mad but I am glad I am safe as this turned to be an very good show whom anyone can enjoy no matter your age.\\n\\n\r\n Thanks for reading",
            "date": "2014-12-18T13:59:00+00:00",
            "helpful_count": 19,
            "mal_id": 172905,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3069717.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pokeguy123",
                "username": "pokeguy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=172905"
        },
        {
            "content": "The final spell is...! Explosion...again?\r\nAUTHOR'S NOTE: \r\nWith 4 seasons under its belt, Zero no Tsukaima has quite the history of being a popular anime. I'm not a fan of magic/fantasy animes but the first season impressed me enough to continue watching the 2nd and 3rd season. The reason why I want to take the final season into account is to wrap Zero no Tsukaima up in a package and show you why it fell into oblivion in its final premise.\r\nSTORY (5/10):\r\nIt was expected. Before I even touched the first episode, I closed my eyes and used my clairvoyant magic to predict what this story wouldbe about. Miraculously, I was able to stay ten steps ahead of the anime, as it went on. An anime with such predictable plot can't be enjoyed, as viewers like twist and surprises (unless, you don't...?). I was able to hold my patience for the 1st season, but I had already grown tired of the repetitive storyline at the middle of the 2nd season. I had hoped at the final season, the writers would come up with a well-crafted ending. No, it was not a well-crafted ending, in fact, it left me sitting there unsatisfied and possibly annoyed. For the last season, the writers somehow mustered all of their powers to create as much plot holes as possible, in order to create their own disastrous ending. Even with two worlds they could play with (the real world vs the magic world), the writers could not handle such large responsibilities and decided to keep Japan out of the loop until the very end of the anime.\\n\\n\r\nThere is no storyline in the final season. In 12 episodes, many of them were fillers, while the real plot felt like Groundhog Day, cases of villainy acts which are outdone by the magical words: deux ex machina. This anime should have been re-titled: \"Zero, the Duex ex Machina\" because that's all you are going to see in the battles in Zero no Tsukaima F.\\n\\n\r\nART (5/10):\\n\r\nA lot of laziness. Since the final season mostly focuses on Halkeginia, we see copy and paste backgrounds and recycled animations. What were the production team thinking? I highly doubt the art will impress viewers, especially if you have been watching the previous seasons. It's the same old, same old. Dull and inexpensive, even the Academy, which looked detailed and beautiful in the first season now looks like a Barbie playhouse.\\n\\n\r\nThe action scenes aren't very moving either. And with half of the episodes being fillers, we don't get to see much action. In fact, the only notable scene in the final season is the final battle...though it's not impressive at all.\\n\\n\r\nSOUND (8/10):\\n\r\nIchiko and Rie Kugimiya must be amazing artists (they are), as they were featured in the OP and the EP for all four seasons. I've enjoyed all of the OPs and EPs in the Zero no Tsukaima series and was pleasantly surprised that they were all sung by these two wonderful artists. The OP \"I'll Be There For You\" by Ichiko has an adventurous melody which keeps the viewers interested and pumped up while the EP \"Kiss Shite Agenai\" sung by Kugimiya is catchy and bouncy, which brings the anime to a nice close. However, it does get awkward when the anime begins to take its cliffhangers to a darker turn. The EP seems to disturb whatever emotions the anime tried to display.\\n\\n\r\nCHARACTERS (5/10):\\n\r\nSaito Hiraga has been our main hero of Zero no Tsukaima for four seasons. Throughout these years, I've tried to comprehend and analyze his personality and his growth. You want to know what I found out? He's a tortured boy, leashed and whipped by a girl who has a permanent, problematic personality called here in America...well, a bitch. Now, I know that may sound misogynistic but hear me out, ladies. I don't care how much you love your man, but if you have any of the personalities of the characters here in Zero no Tsukaima -- please get out of my face. That is extremely unattractive. And having to see Saito still fall for any of these characters is utterly baffling. Despite his mysterious charm towards Louise and the other weirdos in the anime, I applaud his loyalty and patience.\\n\\n\r\nLouise Françoise Le Blanc de La Vallière is our main heroine. Despite her fancy, bourgeoisie, exaggerated name, her personality does not match to that caliber. If there was a game called \"Tsundere\", Louise would be the final boss. A complete super-ultra tsundere, she may become your favorite anime character (if you're an M) or you may want to slap her upside the head and tell her to shut up (if you're an S). However, she does a cute side to her -- just don't provoke her or speak of, think of, or touch another woman. Whether it was a misunderstanding or your true intentions, our heroine will pour down her wrath on you before listening to your reasoning, no matter how convincing they are.\\n\\n\r\nThe villains in Zero no Tsukaima F are not interesting at all. Actually, if you technically take out the characters that have died off extremely quickly or allied with the hero/heroine, there is only one villain in the entire season, which is complete laziness on the production team's part.\\n\\n\r\nI feel like we are supposed to learn from the allies and friends more than the hero/heroine. They are willing to sacrifice limbs in order to protect the main characters and we see this in each episode consecutively. Whether they are love rivals, or ex-villains, they always give way to the main characters so they can shine.\\n\\n\r\nOVERALL (5/10):\\n\r\nI've had my share of fun in the first and second season, but it has become too bland. It's like taking a lick of a never-ending lollipop (Tootsie-pop, anyone?). The Zero no Tsukaima series has given us the perfect picture of a well-versed anime with a lot of potential, slowly rotting around the edges. Although I've tried to recall the comedy and romantic moments, I couldn't fully enjoy the final season due to its poor execution. \\n\\n\r\n*cough* Louise is overrated. *cough*",
            "date": "2013-12-16T01:24:00+00:00",
            "helpful_count": 15,
            "mal_id": 124067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3374685.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/trillshit",
                "username": "trillshit"
            },
            "url": "https://myanimelist.net/reviews.php?id=124067"
        },
        {
            "content": "I just finished watching the last episode! ^-^ And I loved it! If you haven't seen the last episode or the series I suggest you stop reading *Major Spoiler Alert* \r\nWell I think the ending was cool, but I wanted to see how the parents reacted but.... their reaction was probably WTF and lots of arguing and slapping and etc... ^-^ Haha.... Ya also I wanted to see what happened to them in the end! Did they have kids? how did the maid (is her name sista?) ended up? Oh and the elf chick tiffa! (I really hated her character... I honestly didn't think theauthor needed to add her but then again.... whatever!) so ya! But the series was awesome! 10/10 people! I recommend this to 13+ people! (: Maybe just a little older because of the content but hey your the one watching it. If you enjoy it then hey, don't mind me. But the series was fabulous I hope the author makes a final OVA for her readers to know how they ended up! Cross your fingers",
            "date": "2012-03-31T11:21:00+00:00",
            "helpful_count": 11,
            "mal_id": 57549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1223731.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kawiigirl11",
                "username": "Kawiigirl11"
            },
            "url": "https://myanimelist.net/reviews.php?id=57549"
        },
        {
            "content": "Let me just start from the top... hopefully all these emotions and thoughts racing in my mind will still be there by the time I'm done writing this but. I had not expected much from this show, this what almost felt to be half-assed show with nothing in it. Of course... that's when I first started. Looking back now, this show had absolutely been one of my favorites. How the jokeful beginning, although what back then I had thought to be (when i say beginning i literally mean the first episode) god awful had only contributed to the over all beauty of this anime. Thisis one of the few animes that I felt had wrapped up very nicely. There was no\"wait, can't there be an episode where they do this?\" Everything had been fulfilled in this anime. The serious moments had only been uplifted as the jokeful ones were meant to be. To be honest, I'm glad there were this many episodes, around 50. Because with this, you can almost feel the full impact of the entire anime. The love between Saito and Louise, their moments together, how they grew to be fond of each other and literally couldn't live without each other. You could feel the steady tension, the rising emotions and feelings. It had felt like you WERE saito, as each episode (throughout the entire series) had shown you a little bit of their lives. Each and every part, their fights, when they didn't like each other, when they missed each other, when they loved each other, and everything. This had all contributed to the overall feel of the anime, leaving you with this almost heart ache when the serious moments do come. As I'd like to point out clearly, you could feel the steadiness of the anime, like as if it never skipped. You don't see them liking each other out of the blue for no reason, you reason with yourself how they got to like each other and it makes sense. It's not a surprise when you see them admit and say \"i love you\" because you could feel the steadiness and pacing. After finishing this anime.... I do believe I must call it a flower anime, or some corny stuff like that. An anime that, honestly, in the beginning you don't even know why you're watching. It seems to be horrid and god awful and this shouldn't even exist. However, when you finally finish it, or the more you progress into it, the more you realize that every past action is simply meant to bring about the beauty in the next. It's a snowball effect, and that's why at the end you're left with a big giant freakin snowball in your heart and you are left in a room alone in the dark, where you just realize you finished a beautiful heart-felt anime. (or maybe thats just me). Here's how I recommend this anime, it will only be beautiful and amazing if you watch this from start to finish. Every screentime ever scene every everything had feelings and emotions that would later bloom. If you are not going to watch this anime from start to finish. Don't, cus otherwise if you don't, it is the shittiest anime ever. However, from start to finish, at the end of the day, I could not help but add this as one of my favorites. (also, i had added this to an overall of 10 because, the story and character interactions i simply could not help but feel that this anime is worthy of a 10. Also, this is an overall review of the whole anime. I hope this will still help you in watching the last season or not though.)",
            "date": "2014-07-09T04:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 151175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3161881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SovietPsycho",
                "username": "SovietPsycho"
            },
            "url": "https://myanimelist.net/reviews.php?id=151175"
        },
        {
            "content": "Zero no Tsukaima has been going on to it's fourth season now, and personally i think it's not better or worst than it's other seasons. \r\nthe story, is i think 8/10. i like the plots and every thing, since it makes some exciting moments and all, but mostly i think it's just the romance, and ecchi that i think are most appealing to Zero no Tsukaima. there's just A LOT of romance, and ecchi much more than action or comedy. anyone out there who doesn't like these stuff probably shouldn't watch it, or rather you shouldn't even be reading this since there's three seasons beforethis that you may quit already if you don't like harem. all i could say is that it has some, very little sad part, in my opinion, because of how annoying the argument between Louise and Saito is, rather than the feeling of sadness of their arguments. there might be people out there that totally disagree with that, but i'm just getting it out there. the fighting scene are pretty nice. Well though out of how they fight, how the groups interact and connect to others, especially the ideas of the final weapon, what they used to fight. i it should have more feelings to it, than just fan service.\\n\\n\r\nthe art was pretty ok.. giving it 7/10 probably is the best i could. the pictures and all were very cute and nice looking. the background, the characters designs were just great, but the most thing that i think is lacking are more of the smooth movement of the art. sometime i think the part of a character, such as the hair just move like a paper... note very sooth motion to it, and it doesn't quite look natural, or realistic to a normal hair, even though it's not normal hair anyway... the color and designs of all things were nice, but in my opinion it needs a little more smoothness to the movements of the characters.\\n\\n\r\nthe sounds are great, 9/10. it has a nice soundtrack to it at the right moment, whether the situation gets in a bad, or a good mood. the sounds pretty much fits in most of all things in the anime, and it's very accurate in terms of how it would actually sounds in the reality.\\n\\n\r\nthe characters could be good or bad depending on your own thinking, 8/10. as of that most character to me is pretty normal, but in every anime there are just some characters that just annoys the heck out of you, making you wish there's not just that character. but those characters are just a need thing so that it would probably make other characters looks better. Louise is just one of the character that just is annoying. this is probably debatable since there's a lot of different kinds of people in this world, and i think she is, is because of how she act, or what she say to Saito. i'm not a big fan of Saito that much too, since even though he have an important role, it doesn't even look like he's even trying in anything, such as, he barely even practice much. he does but not much, since if you had watch what happens in the near to last episode, he has shown to be pretty weak still. he's only strong probably because of the things that support him, such as his sword. so far the only person in Zero no Tsukaima that i don't quite like is just Louise, since she can be a lot of a bother, and of course her words are just both cute, but mostly irritating.\\n\\n\r\noverall i think this anime is worth to watch. if people like anime that has romance as its genre i think this might be a great anime. it's very enjoyable, relaxing and sometimes it just takes your minds of stuff, like for example i'm writing this review after finished watching this anime, and totally forgot to do the project that is due tomorrow. if you finished all the other seasons and finally going to watch this final season, i hope that you will enjoy the most of it, but don't get into it that much, that you might attempt to do the thing at the final episode with the plane and the moon. ( trying to not give away any spoilers )",
            "date": "2012-05-21T20:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 61677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/128889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pakin",
                "username": "pakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=61677"
        },
        {
            "content": "This is my first review, so lets start n_n\r\nZero no Tsukaima F, maybe the worst season of the ZNT series, plus non of al the Zero no tsukaima seasons were never such a masterpiece, but this season, oh, this!... i never expected such piece of... poop. By the way, let's start by sections.\r\n-Character: The same thing as the other season~ \"Saito-Kun i love you\", 2 second later \"Saito-Kun you stupid dog! EXPLOXION KJSJBHJKFDS!\" is really annoying and people get tired of the same thing, sometimes i wish that Louise would be less dumb and pick another one to, at least, make Saito jealous. Also, someof the enemies that are in te OP, they just appear in 3 chapters and they piss me off, they don't do Nothing!they just stand there because yes. The same with others. I think the only extras who did something in the anime were Tiffa and Siesta... But just in an echii way. Characters doesn't exist in this anime: 2\\n\\n\r\n-Art & Animation: I really like the art, i've seen better, but is still something that makes it special, but the problem in this anime is the animation. Sometimes it get's really lazy, maybe animations were made with sony vegas (ba dum tss): 7\\n\\n\r\n-Story: Is nothing new, i've already seen Saito dissapear and then appear again in the previous seasons, a lot of boobs and and the Saito-lovers and blah blah... Really tedious, at least the fight scenes were enough enjoyable to make me put interest in the anime: 3\\n\\n\r\n-Sound: Nothing special, is not bad, actually is good, but is really forgettable: 6\\n\\n\r\nAnd finally:\\n\r\n-Enjoyment: Did i enojoy the anime? no, is as simple as that, no, i didn't enjoy it. The scenes who were comedy\" it was just a box about to explode of fanservice. In all the anime i just laughed at 1 scene. the fight scenes were really ok, if those scenes weren't tedious i would enjoy it more.\\n\\n\r\n-Final Result: the anime is like this: First 8 episodes are fanservice-explosion-conflict-more fanservice- drama-conflict resolved-Fanservice-explosion That's all, the rest of the episodes are just drama-saito's gone-drama-saito's back- conflict resolved- fanservice again. Just like the Third season. It was a waste of time? Mmmmm... let's say yes: 3/10",
            "date": "2013-11-10T10:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 119875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2365279.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GeNESiS-P",
                "username": "GeNESiS-P"
            },
            "url": "https://myanimelist.net/reviews.php?id=119875"
        },
        {
            "content": "I have watched the first three seasons of the anime, and was actually awaiting the final season of Zero no Tsukaima witho a lot anticipation. I will address each of the following elements in order:\nStory (5)\nThe plot of the final season is borderline nothing special to a disappointment. The character interactions are just basically repeated. The females that were all gaga over Saito continue to fight for his love and every episode has its share of big boobs. I was very disappointed in the way the story line tossed away the struggle against Joseph, King of Galia. Compared to the stories behind the previous seasons,the final season seems like it's composed of 6 legit episodes and then 6 fillers. \\n\\n\nArt (7)\\n\\n\nThe artwork is the same as it has been in the previous seasons. I never regarded the art in this anime a masterpiece, but I didn't hate it either. It's alright.\\n\\n\nSound (7)\\n\\n\nThe music does get very repetitive depending on the style of the scene, but the previous seasons of this anime have already prepared me to expect this so there wasn't any disappointment there. Given the mediocre storytelling, I guess the makers complimented it with mediocre sound choices.\\n\\n\nCharacter (7)\\n\\n\nSome new characters are introduces and they are as cliche as you will find them in any anime.\\n\nIf you have seen previous seasons, then the characters remain pretty much the same as they were.\\n\\n\nEnjoyment (7)\\n\\n\nIt's definitely enjoyable. I don't think anyone was expecting a masterpiece out of this one.\\n\\n\nOverall (7)\\n\\n\nViewers may find this season a bit disappointing if they were anticipating it. Upon closer examination, the final season is really what we all expected: a light, entertaining, cliche, conclusion to the Familiar of Zero series. Not too good. Not bad. Meh.",
            "date": "2013-03-29T23:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 91559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/504400.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zhango",
                "username": "Zhango"
            },
            "url": "https://myanimelist.net/reviews.php?id=91559"
        },
        {
            "content": "How an anime goes from good to very good.\r\nI rated the previous seasons as following:\r\nSeason 1: 6\r\nSeason 2 and 3: 7\r\nThe main reasoning behind this, being that especially season 1, had insanely rushed material, and the plot felt lacking. \r\nSeason 4 is a whole different thing, and I am going to explain why.\r\nThe plot/story in this season starts off well made, and interesting. I rushed through this season faster then any of the others. I kinda feel that the whole plot and storytelling style grows on you. You kinda realize that this anime was never ment for slow-paced plot with huge details in how theworld works (Log Horizon is a grand example of this). It's also not all about the realization of the style, it's about the presentation of  the style in this season, that makes it better then the others. \\n\\n\r\nFor one of the few times in this anime, I have actually understood most of Louise's actions. I have understood when she got mad at him. (Because, be honest, who didn't hate the guts out of that girl in the first 1-2 seasons? Atleast I did. I was actually so mad at her at times I was hitting my PC.) The example here comes from when Saito kissed someone he shouldn't have. And there was no explaining against it. After all, it's a harem anime, so stuff like this will happen, but I felt that the way Louise and Saito handled it felt rushed and left them both with a weakened relationship. This did not show at all, as their relationship is basically rising every single episode in season 4. \\n\\n\r\nMany people are giving this season a -1 for lackluster episodes. I am mainly thinking about the mid-episodes where Louise, Saito, Tabitha, and last but not least Siesta is at their mansion. These episodes, are episodes I really like. For me, a person who really falls in love with characters, these are golden. I really enjoy just watching the characters enjoy themselves, and I really enjoy watching Saito and Louise getting together. I personally give more positives due to the season having time for relaxed pure good-feel episodes with lots of HILARIOUS harem. \\n\\n\r\nIn this season, I believe everything improved. Especially the humour. I was actually laughing quite a lot. If you have already finished the season, I am especially thinking of when Tifa enters the room and can't fit her dress on, Louise goes to help, and her dress just falls off whipping her boobs out. Saito's face really got me.\\n\\n\r\nNot just this, but now that Louise treating Saito as a dog became more rarely, it got humourus when she actually did. And as the season progressed in many ways, I also had the feeling that he deserved it. Not like he did in the first seasons, where in my opinion wished Saito to dump Louise and go away with Siesta. \\n\\n\r\nSiesta is one of the best developed characters in the anime if you ask me. Her personality is so easy to spot and is really amazingly developed in a way that you feel like you really, really know her. She is a very humourus character. I can't count how many times she made me laugh this season, and each laugh made me love her more. This one scene, when Louise and Siesta is talking about what I remember as potentional enemies, and Siesta brings up Tabitha's dragon. When Siesta impersonates the dragon, is the best Siesta moment in my opinion.  (If anyone has a YT clip or gif from this, please PM me as I really wanna see this again.)\\n\\n\r\nAs it goes for the op song in this season, I have to say I am a bit disappointed. It did not live up to it's previous season 3 op, and of course First kiss from season 1. FIRST KISS KARA HAJIMARU! \\n\\n\r\nThe ending was for me, settling. I love endings that leave you fed up (not in a bad way) with the anime. There are no questions to be answered, and everything went as you had hoped. This ending had that, and I loved every second of the last couple of episodes. \\n\\n\r\nAs an ending to my review, I thank the developers of this anime for an amazing ride. I am very glad I picked this anime up, and I am very glad I continued watching after a lackluster season 1. This anime and especially season 4, have given me tons of laughs and tears. Tears of sadness and joy from the last episode.",
            "date": "2015-04-24T19:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 186394,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4519750.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yamete_Kudasai",
                "username": "Yamete_Kudasai"
            },
            "url": "https://myanimelist.net/reviews.php?id=186394"
        },
        {
            "content": "After completing the previous three seasons of the show, I will say the final season lived up to my expectation, with significantly more story development than the season 1 and season 3.  Zero f begins by finishing off the cliff-hangers from last season, followed by a few light-heart comedic episodes, and finally develop into a final, climatic arc. If you are a fan of the light novel, the last arc is probably not to your liking, as it derives significantly from the book. However, if you have not read the novel, the arc  is quite satisfying, especially the ending.The ending is perhaps one of the most complete ending (as in no loose end) I have seen.\\n\r\n  Overall, if you have watched the previous three seasons, this season still retains what makes the series great, the comedy and the ecchiness. An improvement over previous seasons is an increase in character development (which will be more apparent if you have watched the previous seasons). If you have not watched any of the previous seasons, I suggest you give the series a try if you are a fan of comedy or fantasy.  \\n",
            "date": "2012-03-25T16:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 56909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/heipo",
                "username": "heipo"
            },
            "url": "https://myanimelist.net/reviews.php?id=56909"
        },
        {
            "content": "This is a great ending, to one of the most enjoyable anime out there, the story is not the most complex, but it is simple and different, and it follows the previous seasons very well. This season had a lot of romance too, and some nice action scenes\r\nZero no tsukaima F concludes the story in a great way and like I said it may not have the best plot or characters, but it is very enjoyable and fun to watch, the mix of comedy romance action and fan service is very good, if you don't like ecchi it might annoy you, but if you gotover to the last season then it won't be a problem.\\n\r\nStory(9/10) - Great, has a good ammount of romance, it has a great ending and yu get to see character development.\\n\r\nArt (9/10) - pretty good, beautiful characters, good animation but not perfect, some details on animation make it a 9 instead of a 10.\\n\r\nSound (8/10) - Great voice acting, the music is good but not great.\\n\r\nCharacter (9/10) - Even though they are cliche, they feel unique in some way or another, and each character gets some development even though it focuses on the two main characters, we get to see more about the princess and other characters, wich is pretty nice. Even tough louise may get boring at sometimes, she is still very enjoyable.\\n\r\nOverall (9/10) - One of the most enjoyable anime to watch ever, even tough it may be cliche at some times, it will be enjoyable and fun to watch till the very end, and the beautiful romance between the two main characters is a plus.",
            "date": "2012-10-13T00:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 74791,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1422735.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Karffebon",
                "username": "Karffebon"
            },
            "url": "https://myanimelist.net/reviews.php?id=74791"
        },
        {
            "content": "Zero no Tsukaima F is the last season and the 4th season of the zero no taukaima series. Before i write my review i would like to tell u about this particular story. It is a fantasy romantic harem. This harem is not a harem where the guy likes all the  girls but the girls like that one guy. The guy likes only one girl tho. Saito and Loiuse has developed a relationship over the past seasons. This relationship is like a master to pet relation. the girl is tsundere so if u like that u might like this. In a harem animemost of the time all the girls are different. from tsundere to nice and calm to big breasted. this anime has this which makes this a great harem anime. the story is great. it is very intresting. the story also develops tye characters and the enjoyment. the music is good too  having them in the right parts and the voice acting is great. the art is great however is not as great as the new anime thatbhas been coming out. I think the author wanted to keep the classic view of the art caz the previous ones were like that too. This siries.is a must watch",
            "date": "2012-09-03T05:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 71495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/347293.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lukeww123456",
                "username": "lukeww123456"
            },
            "url": "https://myanimelist.net/reviews.php?id=71495"
        },
        {
            "content": "I am going to make this a review about all four seasons of Zero no Tsukaima (while mainly focusing on this one) and I am going to try doing this without giving away any spoilers if possible. \r\nZero no Tsukaima is an anime with incredible potential. What I mean by that is, if it dropped all the nonsense (fan service and repetition for instance) and focused on the story and such, it could have been amazing. It has some moments of clarity where it focuses on the story and the characters and when it does that, it is brilliant. (But it usually lasts just fora few minutes and that's a shame.)\\n\\n\r\nStory:\\n\\n\r\nLong story short, the story is basically about a boy who finds himself in another world, in this place no one speaks his language and he has no idea what's going on or how the got there. An accident gives him the ability to understand this strange language and he learns he has been summoned as a familiar to a mage and since most familiars are animals of some kind and a human familiar is (almost) unheard of, he is being threaded like an animal. By another accident he finds out being a familiar gives him special abilities. Basically an ability to use all weapons. So far so good right? Wrong, creators of the anime doesn't know a thing about storytelling. So usually the show is riddled by moments what a 10 year old would consider kinky and funny. This usually happens on every episode, several times. On top of that, this usually ruins whats supposed to be emotional moments. An act of heroism, an act of sacrifice, and boom, same nonsense about being funny and kinky. This is one of the rare shows that would benefit from a fan recut. Take out all the nonsense, rearrange some scenes and focus on the story a bit more. But I digress. As far as I understand, if the anime fallowed the original material properly, most of these issues would be resolved, but alas it didn't go that way.\\n\\n\r\nArt:\\n\\n\r\nArt is usually good overall. Colors can get a bit too bright or too dull at times, but thats to be expected. Not much bad, nothing groundbreaking, just fine.\\n\\n\r\nSound:\\n\\n\r\nI wasn't able to find anything wrong with the sound other than some characters sounding annoying, so moving on.\\n\\n\r\nCharacter:\\n\\n\r\nHow do I put this... Characters are fine but incredibly inconsistent. They seem to forget all about their past, their motivation and their abilities all the time. Also, there are many moments where character development gets abandoned simply to put forward the harem side of the anime. Which is especially stupid since the protagonist  has already picked the main girl. Also, there is an issue with characters appearing once and being forgotten by the next episode. From what I gather, this is mostly do to anime not truly fallowing the original material where most of these issues not present.\\n\\n\r\nEnjoyment:\\n\\n\r\nYou can actually enjoy this anime if you skip some of the terrible and annoying repetitive stuff. I tried watching it that way for the second time around and it really improved my enjoyment of it.\\n\\n\r\nOverall:\\n\\n\r\nThis anime has great potential but fails to deliver because after a while it becomes incredibly repetitive. But if you have time to waste, it is a good enough anime to watch.",
            "date": "2018-01-27T13:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 269816,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5108187.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/remembrance",
                "username": "remembrance"
            },
            "url": "https://myanimelist.net/reviews.php?id=269816"
        },
        {
            "content": "Hi. This is the first time I have ever written a review so don't expect much. This whole review is basically about what i enjoyed about the series however I won't be going deep into stuff like the art sound and whatnot. Besides, you guys will most likely not see m review anyways but here it goes.\r\nWhen I first started the series from season 1, I thought well i guess its not bad bud probably not something i would enjoy. Well, as I watched more of the series, the more I realised about how much i regretted my words.\r\nI'm kinda really into the harem genre,and even more of the romance genre, so I'm kinda biased with this, so i bet only the people who absolutely adore romance will kinda understand me. Also this review is just solely based off of what I enjoyed about this whole series in general.\\n\\n\r\nFirst and foremost, I adore Louise so much so the people who have finished the series will understand why I liked it so much. Also I'm just happy with how everything ended up. I wish I could explain more but this is the best I can put it into words. However though since I really wanted Saito to be exclusive to Louise, I wasn't really a fan of how he was interacting with so many girls, I hoped this would lessen as the series continued but well it didn't. That's probably weird for me to say since I said harem is one of my favourite genres. \\n\\n\r\nWell anyways time to wrap this up. Overall I gave the series an 8, but keep in mind I based this review on how much I enjoyed it and nothing else. But I am a fan of the OST. Also anyone who has been watching since season 1 will get a nostalgic feeling towards the end of the episode. Also I LOVED how they ended the series. By the way I know i wrote this review like way after the series ended so I apologise. I hope at least one person finds this review helpfull.",
            "date": "2017-12-30T08:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 266859,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6756040.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lemonation",
                "username": "lemonation"
            },
            "url": "https://myanimelist.net/reviews.php?id=266859"
        },
        {
            "content": "This review will be covering all 4 seasons of the show and might include some spoilers:\r\nI went into this show having no idea what to expect, with most animes I had watched at least a few clips on YouTube so I kind of knew what to expect and what would happen story wise. This anime was an exception, I saw someone on a forum say that this was a really good romance/comedy anime (I'm a big fan of this genre) so I was bored one day and decided to watch the first few episodes. \r\nWithin the first 2 or 3 I was hooked on theshow, it has a really good sense of humour, the art style is really pleasant, each of the characters are really unique and interesting. In the first season there isn't a massive focus on the romance between the characters but there are a lot of nice, sweet scenes that give you enough to look forward to how it will go in the next few seasons. The first season's story is relatively the same, its not over the top with action and instead acts as nice introduction to all of the characters.\\n\\n\r\nThe story picks up a lot in the following seasons, there is a lot of character development and universe expansion, you start to see a lot of the countries you only heard mentioned in previous seasons and it carries a lot of story over from the previous seasons. \\n\\n\r\nSeasons 1-3 were excellent yet somehow season 4 managed to be even better, you see some major character development from both Louise and Saito, their relationship advances leaps and bounds and even the story somehow gets better than it already was. I don't say this lightly, but the ending of season 4 is the closest thing to perfection I have ever seen in an anime so far.\\n\\n\r\n\"The Familiar Of Zero\" is a truly excellent show that I would recommend to anyone. \\n\r\nOverall I give the entire series a 9/10",
            "date": "2017-09-24T07:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 258503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6505245.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UnknownAK",
                "username": "UnknownAK"
            },
            "url": "https://myanimelist.net/reviews.php?id=258503"
        }
    ],
    [
        {
            "content": "Well, this is my first review, and I don't think I'm good at writing them, but I'll give a try.\r\nI've scored the three previous season to 7, mainly because it was repetitive, and there was not this thing that embraces your mind and take you to an other world. \r\nAnd then, I've watched this season, the final one. And it is perfect. Louise is becoming more and more mature, even if she keeps her tsundere style which is still funny (although it annoyed me a lot of times, but hey, it's who she is after all). For Saito, it's approximatively the same, he's growing too,and we really see their relationship evolving...\\n\\n\r\nAbout the scenes, there is a lot more romantic scenes than before, which is wonderful because their kind of different from the previous season, there is something that makes you feel good, and you're happy for them too in some way.\\n\r\nSince I was also obsessed by the magic scenes with void magic and all that, you should know that there's also a LOT more of these scenes, and I found that they were much more impressive.\\n\\n\r\nI'm also noticing the OST which is just full of epicness (special note for the song \"Passion\" which I'm listening right now).\\n\\n\\n\r\nI think they did a really good work, this season embraces the whole series, and every episode makes you feel wonderful and the two final episodes are just so much awesome that you can't accept it is already over, and then you see how it was just a nicely dream in which you will go back someday...\\n",
            "date": "2013-05-14T04:28:00+00:00",
            "helpful_count": 154,
            "mal_id": 97149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2000272.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/matonyan",
                "username": "matonyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=97149"
        },
        {
            "content": "Zero no Tsukaima F is the final season of the series and it features a young boy Saito getting abused by his master Louise. Stuff happens, Saito is extremely indecisive about his relationship with Louise, stuff gets fixed. Nothing new is really found in this season and I won't go too much into detail about the summary because hey, you should have seen the previous three seasons before you watch the 4th one, no?\r\nSo about the story.. heh. If you have seen the previous seasons, you'll have a pretty good idea what happens. Some stuff happens, maybe some random fanservice here and there, filler episodesrandomly thrown in out of nowhere, a problem occurs  and is solved with usually an unrealistic solution that probably has some plot holes. And by plot holes, I don't mean \"look very deep into the anime\" ones, I mean \"wtf how did they just do that it didn't make any sense at all\" kind of plot holes. It takes the fantasy genre to a whole new level and again, not in a good way (SPOILER example: Saito stealing a fighter jet from a military base in 2 seconds).  Some of it can be attributed to the fact that the majority of the season was rushed but all in all, they really did not need some of the fillers; it was just a waste of time. If you're one of those people that like to have an intricate plot with plenty of BAM moments, this is not the anime for you. The plot is lackluster and very predictable. The ending was a perfect example of this. Personally, I thought the ending was very predictable but it fits the anime. Having said that though, ZnT is NOT about the story. If you have been watching this for the story, then I got news for you, choose something else to watch. The story here is just there to have at least some \"meaning\"  between each episode, nothing special.\\n\\n\r\nAl-right, the characters. The characters are again, nothing special. An abusive tsundere, some boobs, some more boobs, and a loli. This anime throughout the seasons has shown no character development, Louise and Saito were supposedly married at the end of season two but Saito is still an indecisive guy and Louise still blows him up. Usually this would lower the score as dynamic characters are always good but the thing is, it's what the anime is known for. This is why most people have continued to watch though the seasons. Sure, Saito will piss you off every time he ogles some girls breast because he completely lacks self-control or some other stuff that ticks you off. The non-changing character foils that have been constant throughout all four seasons is the selling point of this anime. You don't watch this to see some well thought out strategy like Death Note or the plain awesomeness of Steins;Gate, you watch this too see Saito getting blown up by explosions and the tsundere Louise being her usual self and the relationship between them. I will have to say that it will probably get tiring if you watch this in one go.\\n\\n\r\nThe sound doesn't really do much considering most of the BGM is just reused from the previous seasons. In some cases, it certainly does help set the mood and I loved how they reused one of the openings during one of the final episodes. The energetic OP also adds towards the enjoyment of the anime; it fits the mood. Though the EP isn't bad, the usage of it is certainly questionable in some cases. Something some by Rie Kugimiya doesn't really fit certain situations if you know what I mean.\\n\\n\r\nThe art wasn't really exceptional and doesn't take away from the anime itself. Not much to comment on this as it doesn't feature any special art style. The battle scenes were too short in my opinion.\\n\\n\r\nI'm a Louise fan so this is probably biased but I really enjoyed the series overall. If I was to use by biased score, this would be a 10/10 just because I'm a huge Louise fan. That's kind of the thing with this anime, either you'll hate the characters (I don't think many people expected much out of the story anyways) or come to love em. The story was really annoying at certain points because of the number of episodes that were just pointless. They could have easily just spent a couple of minutes or not even included certain parts (really didn't need a episode dedicated towards the crowning of a queen) of the anime. The ending however, was probably the saving grace for this anime. I personally value a conclusive ending opposed to some random harem ending. Overall, I think that this season manages to set up the end of the series only leaving some minor plot holes. Watch this with a grain of salt in mind.\\n\\n\r\nFeedback is appreciated as this was my first review.",
            "date": "2012-04-01T14:24:00+00:00",
            "helpful_count": 114,
            "mal_id": 57655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/theazntiger",
                "username": "theazntiger"
            },
            "url": "https://myanimelist.net/reviews.php?id=57655"
        },
        {
            "content": "Four episodes in, and things actually got to a pretty explosive and fantastic start - the first three episodes are devoted entirely to closing up what the third season left hanging, and it does so EXTREMELY well. New characters are introduced, but they don't take up too much time in favor of action and plot. Those first three episodes on their own could have made the entire season, to the point that if they had been released as an OVA on their own, I wouldn't have been surprised. \r\n... And perhaps they should have. With the fourth episode, we're treated to the typical cliches andgags, with Louise wanting Saito on her own time but being her nasty, violent excuse for \"tsun\" the rest of the time. Admittedly, in the first episode, there was an argument that was fairly petty, but it was resolved surprisingly well for this series. \\n\\n\r\nFurthermore, the fact that Siesta, who was a fairly enjoyable character in the first season, and now even Tabitha, have been reduced to, essentially, characters that just cling to Saito just to cause an issue for Louise, not to mention the fact that Louise constantly takes THEIR affections out on Saito, almost as often as he's pledged his devotion to her (he does, admittedly, ask for it sometimes) just makes things all the more ridiculous.\\n\\n\r\nWhat's more, there's a plot device used to keep Siesta around, in that the queen asked her to be Saito's maid, but thinking about it - Wouldn't the queen know better than to do this after observing them for, oh, five minutes? Especially given that Siesta's self-proclaimed \"love rival\" is the queen's best friend, and as of season three, sister?\\n\\n\r\nUltimately, the flaw with what follows the great first three episodes (or perhaps just great THIRD episode - the first had its share of these problems as well) is that this series is trying to be a harem when it's got an established romance, and isn't letting its characters develop like they should in order to keep the harem aspect going when it's been clear (and even canon) from early on that there is no point to having a harem here.\\n\\n\r\nOur protagonists have been saying from as early as the second season they love each other, we should not be arriving on the fourth season with the relationship still acting in a standstill, and with Louise acting in the same, petty way she has been all along, guided by shallow plot devices.\\n\\n\r\nAside from the romance/harem aspect of the series, however, the plot seems to be shaping up to be as good as always, and development outside of Louise has been decent. We've seen how Saito has grown since he's come to this world, and even how side characters like Guiche have taken to being warriors in their own way. \\n\\n\r\nOverall, I'll be watching to the end, but unless things improve drastically in regards to Louise and her relationship with Saito this time around, I think I won't be too sad to see this one end here.",
            "date": "2012-01-31T13:02:00+00:00",
            "helpful_count": 86,
            "mal_id": 52939,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/164133.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/oversevethousand",
                "username": "oversevethousand"
            },
            "url": "https://myanimelist.net/reviews.php?id=52939"
        },
        {
            "content": "So.... The 4th season of Zero no Tsukaima, and let me tell you why I scored this so poorly.\r\n All through out the whole series Louise has not changed in any aspect what so ever. She still goes on with the same routine, \"oh I'm going to trust Saito from now on\" and ends up frying his ass at least once in each episode. \r\nThis season would have been some what bearable if Louise had some character development, but unfortunately that is not the case.\r\nThis also goes for the other characters as well, almost NOBODY has really developed through the series. Because of this eachepisode is just the same thing over and over again, and to be honest I'm sick and tired of it. \\n",
            "date": "2012-01-27T23:27:00+00:00",
            "helpful_count": 58,
            "mal_id": 52699,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1071765.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KiriyaXIII",
                "username": "KiriyaXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=52699"
        },
        {
            "content": "Zero no Tsukaima F\r\nI thought that i was going to hate this season just like as the third season, but surprisingly this is the best season of the entire anime, everything is improved and i finally enjoyed a lot a season of this anime and for once i didn't found pointless and annoying Louise and Saito's realationship\r\nStory\r\nThe story is very good, it was improved on this season, there's just two stories to follow, the mission that the queen Henrietta gave both of the two to see the pope and see what the Pope wants with them and the other story is the finally growing relationshipbetween Louise and Saito, finally there's not hate-love between them, but more love, more romantic and that was great, finally something that i wanted the producers to make, and both stories are well paced; The story to make all the void magic users to be reunited because there's is a profecy that a big Dragon will destroy the world and only the four void users can stop him, but it's interrupted because one of the Void users is the enemy and will not help them, the things get complicated... meanwhile Louise and Saito's bond gets stronger and stronger and will have a pleasant ending for them, but not for me, because finally they were really close to eachother and i wanted to see that since the beginning.\\n\\n\r\nArt & Animation\\n\r\nThe art and animations really improved, it was colorful and brighter, and smooth, it was the best of the four seasons, the overall was very good.\\n\\n\r\nSound\\n\r\nThe sound was the same, with little changes but still was good.\\n\\n\r\nCharacter\\n\r\nFinally they developed Louise and Saito, and it was a big improvement, the other characters weren't behind on improvement neither, finally we get to know more a lot of their background, overall it was very good.\\n\\n\r\nEnjoyment\\n\r\nThe only season that i enjoyed a lot and wanted every season to be like this, because i felt like they restarted and improved everything on a good way, the ending left me wanting more, because they finally are together and trusth eachother and i liked how Louise changed from being the kind of tsundere that i hate to a calm tsundere like Taiga when she was with Ryuuji.",
            "date": "2015-08-07T15:40:00+00:00",
            "helpful_count": 33,
            "mal_id": 195456,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195456"
        },
        {
            "content": "This is the fourth season of Zero no Tsukaima,it's a romantic harem with supernatural powers. As for the story it's the same good ol story from the last three seasons it starts off with Saito dreaming about Louise and Siesta then he touches Louises boob then wakes up because in his dream he describes her boob as a flat plain and Siesta's as a Mountain range then Louise blows a hole through the wall with her explosion. I kinda figured i'd start that way, but to be honest I feel like Saito is more of a perv after every season progress. Also i'm starting tofind that when ever a romantic serious moment is about to happen something funny happens for relief.As for the sound&art it's still the same  from the other three seasons.In conclusion this series isn't perfect, but since I been watching from season one im hooked. I've enjoyed the pass three seasons of this anime and i'm looking forward to this fourth season.Although i've only watched one episode I think it's going to be a good one.\\n",
            "date": "2012-01-08T13:32:00+00:00",
            "helpful_count": 21,
            "mal_id": 51277,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/802755.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ramzacloud",
                "username": "ramzacloud"
            },
            "url": "https://myanimelist.net/reviews.php?id=51277"
        },
        {
            "content": "Zero no Tsunami F is the final and last sequel to \"Familiar of Zero\" series.\r\n I am very excited to review this show as this was also a pathway for me to enjoy and love anime. Please start with season one.\r\n Zero no Tsunami F and it's prequel may be your classic harem with a Tsusendere and a average boy as your main character with lots of girls surrounding him but this is worth the watch. Giving this show a 8 was a solid score surrounding this series as a whole but could have exceeded my expectations even more.\r\n When looking at the 2 maincharacter which are Louise and Saito. You can really say that there relationship is funny, cute and overdramatic at certain times. When the manga was being adapted into an anime I was surprised that it lasted so long with four seasons completed. Tbh I think everyone had a thrilling ride watching this show.\\n\\n\r\n Knowing this was a romantic comedy with a magic theme that had been included gave it a refreshing feeling to the viewer as each sometimes episode contained a element of randomness which gave us a comedic and light refreshing feel towards the show.\\n\\n\r\n The anime begins by continuing to describe the adventures that follow the \"Hero\" Hiraga, Saito and the \"unique women\" called Le Blanc de La Vallière, Louise Francoise Better known as (Zero Louise) whom has a funny but cute relationship. Reference to the first season is where Saito appears from the human world to Tristein Academy.\\n\\n\r\n This anime includes other genres such as comedy and drama that is centred around the main characters. The magic and dramatic elements are given at unexpected moments but that builds up the enjoyment. This however creates a very unique and always different situations between the main characters, but when we observe this situation we can a new picture that is created when a new cloud always get painted over the old. When watching the show you know these characters have a sense of little or no maturity at all (Really pushing it Louise there) and gives them the ability to tackle new challenges with awesome but hilarious methods. This type of lifestyle gives a pretty accurate description of the whole anime and it is pretty different from your usual romantic comedy that we occasionally see from time to time.\\n\\n\r\n I find the pacing of the show to be slow/moderate in the viewers point but I am not judge. It tells us a story in a suitable manner that is executed with minor or no flaws at all. This allows the viewer to be entertained with none or little mood swings. If the series was any slower or faster I might have to change my thoughts on the shows progression.\\n\\n\r\n Being a romantic comedy anime, It all comes down to Familiar of Zero being able to give us comedic and straight in the face lines. The interactions between different characters gives us different moments in were we just laugh hysterically or cry. You can relate to the characters emotions shown by facial expressions and the uneasy movement they might produce. Being a comedic anime I am certain it will make you laugh and give dramatic moments where you will not feel at ease.\\n\\n\r\n Zero no Tsukami is a good way to enter a romantic comedy where you will be laugh away. When the audience try's to understand the characters I think they will judge them by there personality and how they interact and develop new bonds and feelings which tighten the show all together. This gives the audience a small feeling of the characters current emotions. \\n\r\n The comedy and drama may not seem new to most but with the addition of random twists and characters gives light to a whole new drama. on Classical comedy being one of them, It depends if the viewer has enjoyed it in which it has altered the opinion of the viewer towards the series. However having some magic included will also draw the audience closer and will have a significant influence on there overall opinion of the show.\\n\\n\r\n Again having not read the manga I wouldn't presume that the anime is way off from its paper counterpart.\\n\\n\r\n Having magic integrated into the show gives it a new light.\\n\\n\r\n The anime try to tackle the development of relationships between characters through dramatic or random situations and through interactions and actions done by the characters which little by little develops more and more. The difference this show has compared to others of the same genre is how the characters are portrayed and overly influenced. We see the story from the main 2 characters however there is parts that give the views of the other characters as they encounter new challenges and develop new feelings towards them and others.\\n\r\n Thus telling us Zero no Tsukami gives us an enjoyable watch to take in and remember.\\n\r\n The design of the characters is well based given the date for this show and its prequel with little or some difference in facial features and expression.\\n\\n\r\n The setting is wonderful and gives us a magical theme by the use of different light schemes and scenery. The colour used is simplistic and elegant giving a bright view of the setting.\\n\\n\r\n Concluding this review. Zero no Tsukami was giving a different feel compared to its recommendations. I did not know wether I was gonna enjoy it or be completely bored and mad but I am glad I am safe as this turned to be an very good show whom anyone can enjoy no matter your age.\\n\\n\r\n Thanks for reading",
            "date": "2014-12-18T13:59:00+00:00",
            "helpful_count": 19,
            "mal_id": 172905,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3069717.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pokeguy123",
                "username": "pokeguy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=172905"
        },
        {
            "content": "The final spell is...! Explosion...again?\r\nAUTHOR'S NOTE: \r\nWith 4 seasons under its belt, Zero no Tsukaima has quite the history of being a popular anime. I'm not a fan of magic/fantasy animes but the first season impressed me enough to continue watching the 2nd and 3rd season. The reason why I want to take the final season into account is to wrap Zero no Tsukaima up in a package and show you why it fell into oblivion in its final premise.\r\nSTORY (5/10):\r\nIt was expected. Before I even touched the first episode, I closed my eyes and used my clairvoyant magic to predict what this story wouldbe about. Miraculously, I was able to stay ten steps ahead of the anime, as it went on. An anime with such predictable plot can't be enjoyed, as viewers like twist and surprises (unless, you don't...?). I was able to hold my patience for the 1st season, but I had already grown tired of the repetitive storyline at the middle of the 2nd season. I had hoped at the final season, the writers would come up with a well-crafted ending. No, it was not a well-crafted ending, in fact, it left me sitting there unsatisfied and possibly annoyed. For the last season, the writers somehow mustered all of their powers to create as much plot holes as possible, in order to create their own disastrous ending. Even with two worlds they could play with (the real world vs the magic world), the writers could not handle such large responsibilities and decided to keep Japan out of the loop until the very end of the anime.\\n\\n\r\nThere is no storyline in the final season. In 12 episodes, many of them were fillers, while the real plot felt like Groundhog Day, cases of villainy acts which are outdone by the magical words: deux ex machina. This anime should have been re-titled: \"Zero, the Duex ex Machina\" because that's all you are going to see in the battles in Zero no Tsukaima F.\\n\\n\r\nART (5/10):\\n\r\nA lot of laziness. Since the final season mostly focuses on Halkeginia, we see copy and paste backgrounds and recycled animations. What were the production team thinking? I highly doubt the art will impress viewers, especially if you have been watching the previous seasons. It's the same old, same old. Dull and inexpensive, even the Academy, which looked detailed and beautiful in the first season now looks like a Barbie playhouse.\\n\\n\r\nThe action scenes aren't very moving either. And with half of the episodes being fillers, we don't get to see much action. In fact, the only notable scene in the final season is the final battle...though it's not impressive at all.\\n\\n\r\nSOUND (8/10):\\n\r\nIchiko and Rie Kugimiya must be amazing artists (they are), as they were featured in the OP and the EP for all four seasons. I've enjoyed all of the OPs and EPs in the Zero no Tsukaima series and was pleasantly surprised that they were all sung by these two wonderful artists. The OP \"I'll Be There For You\" by Ichiko has an adventurous melody which keeps the viewers interested and pumped up while the EP \"Kiss Shite Agenai\" sung by Kugimiya is catchy and bouncy, which brings the anime to a nice close. However, it does get awkward when the anime begins to take its cliffhangers to a darker turn. The EP seems to disturb whatever emotions the anime tried to display.\\n\\n\r\nCHARACTERS (5/10):\\n\r\nSaito Hiraga has been our main hero of Zero no Tsukaima for four seasons. Throughout these years, I've tried to comprehend and analyze his personality and his growth. You want to know what I found out? He's a tortured boy, leashed and whipped by a girl who has a permanent, problematic personality called here in America...well, a bitch. Now, I know that may sound misogynistic but hear me out, ladies. I don't care how much you love your man, but if you have any of the personalities of the characters here in Zero no Tsukaima -- please get out of my face. That is extremely unattractive. And having to see Saito still fall for any of these characters is utterly baffling. Despite his mysterious charm towards Louise and the other weirdos in the anime, I applaud his loyalty and patience.\\n\\n\r\nLouise Françoise Le Blanc de La Vallière is our main heroine. Despite her fancy, bourgeoisie, exaggerated name, her personality does not match to that caliber. If there was a game called \"Tsundere\", Louise would be the final boss. A complete super-ultra tsundere, she may become your favorite anime character (if you're an M) or you may want to slap her upside the head and tell her to shut up (if you're an S). However, she does a cute side to her -- just don't provoke her or speak of, think of, or touch another woman. Whether it was a misunderstanding or your true intentions, our heroine will pour down her wrath on you before listening to your reasoning, no matter how convincing they are.\\n\\n\r\nThe villains in Zero no Tsukaima F are not interesting at all. Actually, if you technically take out the characters that have died off extremely quickly or allied with the hero/heroine, there is only one villain in the entire season, which is complete laziness on the production team's part.\\n\\n\r\nI feel like we are supposed to learn from the allies and friends more than the hero/heroine. They are willing to sacrifice limbs in order to protect the main characters and we see this in each episode consecutively. Whether they are love rivals, or ex-villains, they always give way to the main characters so they can shine.\\n\\n\r\nOVERALL (5/10):\\n\r\nI've had my share of fun in the first and second season, but it has become too bland. It's like taking a lick of a never-ending lollipop (Tootsie-pop, anyone?). The Zero no Tsukaima series has given us the perfect picture of a well-versed anime with a lot of potential, slowly rotting around the edges. Although I've tried to recall the comedy and romantic moments, I couldn't fully enjoy the final season due to its poor execution. \\n\\n\r\n*cough* Louise is overrated. *cough*",
            "date": "2013-12-16T01:24:00+00:00",
            "helpful_count": 15,
            "mal_id": 124067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3374685.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/trillshit",
                "username": "trillshit"
            },
            "url": "https://myanimelist.net/reviews.php?id=124067"
        },
        {
            "content": "I just finished watching the last episode! ^-^ And I loved it! If you haven't seen the last episode or the series I suggest you stop reading *Major Spoiler Alert* \r\nWell I think the ending was cool, but I wanted to see how the parents reacted but.... their reaction was probably WTF and lots of arguing and slapping and etc... ^-^ Haha.... Ya also I wanted to see what happened to them in the end! Did they have kids? how did the maid (is her name sista?) ended up? Oh and the elf chick tiffa! (I really hated her character... I honestly didn't think theauthor needed to add her but then again.... whatever!) so ya! But the series was awesome! 10/10 people! I recommend this to 13+ people! (: Maybe just a little older because of the content but hey your the one watching it. If you enjoy it then hey, don't mind me. But the series was fabulous I hope the author makes a final OVA for her readers to know how they ended up! Cross your fingers",
            "date": "2012-03-31T11:21:00+00:00",
            "helpful_count": 11,
            "mal_id": 57549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1223731.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kawiigirl11",
                "username": "Kawiigirl11"
            },
            "url": "https://myanimelist.net/reviews.php?id=57549"
        },
        {
            "content": "Let me just start from the top... hopefully all these emotions and thoughts racing in my mind will still be there by the time I'm done writing this but. I had not expected much from this show, this what almost felt to be half-assed show with nothing in it. Of course... that's when I first started. Looking back now, this show had absolutely been one of my favorites. How the jokeful beginning, although what back then I had thought to be (when i say beginning i literally mean the first episode) god awful had only contributed to the over all beauty of this anime. Thisis one of the few animes that I felt had wrapped up very nicely. There was no\"wait, can't there be an episode where they do this?\" Everything had been fulfilled in this anime. The serious moments had only been uplifted as the jokeful ones were meant to be. To be honest, I'm glad there were this many episodes, around 50. Because with this, you can almost feel the full impact of the entire anime. The love between Saito and Louise, their moments together, how they grew to be fond of each other and literally couldn't live without each other. You could feel the steady tension, the rising emotions and feelings. It had felt like you WERE saito, as each episode (throughout the entire series) had shown you a little bit of their lives. Each and every part, their fights, when they didn't like each other, when they missed each other, when they loved each other, and everything. This had all contributed to the overall feel of the anime, leaving you with this almost heart ache when the serious moments do come. As I'd like to point out clearly, you could feel the steadiness of the anime, like as if it never skipped. You don't see them liking each other out of the blue for no reason, you reason with yourself how they got to like each other and it makes sense. It's not a surprise when you see them admit and say \"i love you\" because you could feel the steadiness and pacing. After finishing this anime.... I do believe I must call it a flower anime, or some corny stuff like that. An anime that, honestly, in the beginning you don't even know why you're watching. It seems to be horrid and god awful and this shouldn't even exist. However, when you finally finish it, or the more you progress into it, the more you realize that every past action is simply meant to bring about the beauty in the next. It's a snowball effect, and that's why at the end you're left with a big giant freakin snowball in your heart and you are left in a room alone in the dark, where you just realize you finished a beautiful heart-felt anime. (or maybe thats just me). Here's how I recommend this anime, it will only be beautiful and amazing if you watch this from start to finish. Every screentime ever scene every everything had feelings and emotions that would later bloom. If you are not going to watch this anime from start to finish. Don't, cus otherwise if you don't, it is the shittiest anime ever. However, from start to finish, at the end of the day, I could not help but add this as one of my favorites. (also, i had added this to an overall of 10 because, the story and character interactions i simply could not help but feel that this anime is worthy of a 10. Also, this is an overall review of the whole anime. I hope this will still help you in watching the last season or not though.)",
            "date": "2014-07-09T04:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 151175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3161881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SovietPsycho",
                "username": "SovietPsycho"
            },
            "url": "https://myanimelist.net/reviews.php?id=151175"
        },
        {
            "content": "Zero no Tsukaima has been going on to it's fourth season now, and personally i think it's not better or worst than it's other seasons. \r\nthe story, is i think 8/10. i like the plots and every thing, since it makes some exciting moments and all, but mostly i think it's just the romance, and ecchi that i think are most appealing to Zero no Tsukaima. there's just A LOT of romance, and ecchi much more than action or comedy. anyone out there who doesn't like these stuff probably shouldn't watch it, or rather you shouldn't even be reading this since there's three seasons beforethis that you may quit already if you don't like harem. all i could say is that it has some, very little sad part, in my opinion, because of how annoying the argument between Louise and Saito is, rather than the feeling of sadness of their arguments. there might be people out there that totally disagree with that, but i'm just getting it out there. the fighting scene are pretty nice. Well though out of how they fight, how the groups interact and connect to others, especially the ideas of the final weapon, what they used to fight. i it should have more feelings to it, than just fan service.\\n\\n\r\nthe art was pretty ok.. giving it 7/10 probably is the best i could. the pictures and all were very cute and nice looking. the background, the characters designs were just great, but the most thing that i think is lacking are more of the smooth movement of the art. sometime i think the part of a character, such as the hair just move like a paper... note very sooth motion to it, and it doesn't quite look natural, or realistic to a normal hair, even though it's not normal hair anyway... the color and designs of all things were nice, but in my opinion it needs a little more smoothness to the movements of the characters.\\n\\n\r\nthe sounds are great, 9/10. it has a nice soundtrack to it at the right moment, whether the situation gets in a bad, or a good mood. the sounds pretty much fits in most of all things in the anime, and it's very accurate in terms of how it would actually sounds in the reality.\\n\\n\r\nthe characters could be good or bad depending on your own thinking, 8/10. as of that most character to me is pretty normal, but in every anime there are just some characters that just annoys the heck out of you, making you wish there's not just that character. but those characters are just a need thing so that it would probably make other characters looks better. Louise is just one of the character that just is annoying. this is probably debatable since there's a lot of different kinds of people in this world, and i think she is, is because of how she act, or what she say to Saito. i'm not a big fan of Saito that much too, since even though he have an important role, it doesn't even look like he's even trying in anything, such as, he barely even practice much. he does but not much, since if you had watch what happens in the near to last episode, he has shown to be pretty weak still. he's only strong probably because of the things that support him, such as his sword. so far the only person in Zero no Tsukaima that i don't quite like is just Louise, since she can be a lot of a bother, and of course her words are just both cute, but mostly irritating.\\n\\n\r\noverall i think this anime is worth to watch. if people like anime that has romance as its genre i think this might be a great anime. it's very enjoyable, relaxing and sometimes it just takes your minds of stuff, like for example i'm writing this review after finished watching this anime, and totally forgot to do the project that is due tomorrow. if you finished all the other seasons and finally going to watch this final season, i hope that you will enjoy the most of it, but don't get into it that much, that you might attempt to do the thing at the final episode with the plane and the moon. ( trying to not give away any spoilers )",
            "date": "2012-05-21T20:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 61677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/128889.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pakin",
                "username": "pakin"
            },
            "url": "https://myanimelist.net/reviews.php?id=61677"
        },
        {
            "content": "This is my first review, so lets start n_n\r\nZero no Tsukaima F, maybe the worst season of the ZNT series, plus non of al the Zero no tsukaima seasons were never such a masterpiece, but this season, oh, this!... i never expected such piece of... poop. By the way, let's start by sections.\r\n-Character: The same thing as the other season~ \"Saito-Kun i love you\", 2 second later \"Saito-Kun you stupid dog! EXPLOXION KJSJBHJKFDS!\" is really annoying and people get tired of the same thing, sometimes i wish that Louise would be less dumb and pick another one to, at least, make Saito jealous. Also, someof the enemies that are in te OP, they just appear in 3 chapters and they piss me off, they don't do Nothing!they just stand there because yes. The same with others. I think the only extras who did something in the anime were Tiffa and Siesta... But just in an echii way. Characters doesn't exist in this anime: 2\\n\\n\r\n-Art & Animation: I really like the art, i've seen better, but is still something that makes it special, but the problem in this anime is the animation. Sometimes it get's really lazy, maybe animations were made with sony vegas (ba dum tss): 7\\n\\n\r\n-Story: Is nothing new, i've already seen Saito dissapear and then appear again in the previous seasons, a lot of boobs and and the Saito-lovers and blah blah... Really tedious, at least the fight scenes were enough enjoyable to make me put interest in the anime: 3\\n\\n\r\n-Sound: Nothing special, is not bad, actually is good, but is really forgettable: 6\\n\\n\r\nAnd finally:\\n\r\n-Enjoyment: Did i enojoy the anime? no, is as simple as that, no, i didn't enjoy it. The scenes who were comedy\" it was just a box about to explode of fanservice. In all the anime i just laughed at 1 scene. the fight scenes were really ok, if those scenes weren't tedious i would enjoy it more.\\n\\n\r\n-Final Result: the anime is like this: First 8 episodes are fanservice-explosion-conflict-more fanservice- drama-conflict resolved-Fanservice-explosion That's all, the rest of the episodes are just drama-saito's gone-drama-saito's back- conflict resolved- fanservice again. Just like the Third season. It was a waste of time? Mmmmm... let's say yes: 3/10",
            "date": "2013-11-10T10:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 119875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2365279.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GeNESiS-P",
                "username": "GeNESiS-P"
            },
            "url": "https://myanimelist.net/reviews.php?id=119875"
        },
        {
            "content": "I have watched the first three seasons of the anime, and was actually awaiting the final season of Zero no Tsukaima witho a lot anticipation. I will address each of the following elements in order:\nStory (5)\nThe plot of the final season is borderline nothing special to a disappointment. The character interactions are just basically repeated. The females that were all gaga over Saito continue to fight for his love and every episode has its share of big boobs. I was very disappointed in the way the story line tossed away the struggle against Joseph, King of Galia. Compared to the stories behind the previous seasons,the final season seems like it's composed of 6 legit episodes and then 6 fillers. \\n\\n\nArt (7)\\n\\n\nThe artwork is the same as it has been in the previous seasons. I never regarded the art in this anime a masterpiece, but I didn't hate it either. It's alright.\\n\\n\nSound (7)\\n\\n\nThe music does get very repetitive depending on the style of the scene, but the previous seasons of this anime have already prepared me to expect this so there wasn't any disappointment there. Given the mediocre storytelling, I guess the makers complimented it with mediocre sound choices.\\n\\n\nCharacter (7)\\n\\n\nSome new characters are introduces and they are as cliche as you will find them in any anime.\\n\nIf you have seen previous seasons, then the characters remain pretty much the same as they were.\\n\\n\nEnjoyment (7)\\n\\n\nIt's definitely enjoyable. I don't think anyone was expecting a masterpiece out of this one.\\n\\n\nOverall (7)\\n\\n\nViewers may find this season a bit disappointing if they were anticipating it. Upon closer examination, the final season is really what we all expected: a light, entertaining, cliche, conclusion to the Familiar of Zero series. Not too good. Not bad. Meh.",
            "date": "2013-03-29T23:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 91559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/504400.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zhango",
                "username": "Zhango"
            },
            "url": "https://myanimelist.net/reviews.php?id=91559"
        },
        {
            "content": "How an anime goes from good to very good.\r\nI rated the previous seasons as following:\r\nSeason 1: 6\r\nSeason 2 and 3: 7\r\nThe main reasoning behind this, being that especially season 1, had insanely rushed material, and the plot felt lacking. \r\nSeason 4 is a whole different thing, and I am going to explain why.\r\nThe plot/story in this season starts off well made, and interesting. I rushed through this season faster then any of the others. I kinda feel that the whole plot and storytelling style grows on you. You kinda realize that this anime was never ment for slow-paced plot with huge details in how theworld works (Log Horizon is a grand example of this). It's also not all about the realization of the style, it's about the presentation of  the style in this season, that makes it better then the others. \\n\\n\r\nFor one of the few times in this anime, I have actually understood most of Louise's actions. I have understood when she got mad at him. (Because, be honest, who didn't hate the guts out of that girl in the first 1-2 seasons? Atleast I did. I was actually so mad at her at times I was hitting my PC.) The example here comes from when Saito kissed someone he shouldn't have. And there was no explaining against it. After all, it's a harem anime, so stuff like this will happen, but I felt that the way Louise and Saito handled it felt rushed and left them both with a weakened relationship. This did not show at all, as their relationship is basically rising every single episode in season 4. \\n\\n\r\nMany people are giving this season a -1 for lackluster episodes. I am mainly thinking about the mid-episodes where Louise, Saito, Tabitha, and last but not least Siesta is at their mansion. These episodes, are episodes I really like. For me, a person who really falls in love with characters, these are golden. I really enjoy just watching the characters enjoy themselves, and I really enjoy watching Saito and Louise getting together. I personally give more positives due to the season having time for relaxed pure good-feel episodes with lots of HILARIOUS harem. \\n\\n\r\nIn this season, I believe everything improved. Especially the humour. I was actually laughing quite a lot. If you have already finished the season, I am especially thinking of when Tifa enters the room and can't fit her dress on, Louise goes to help, and her dress just falls off whipping her boobs out. Saito's face really got me.\\n\\n\r\nNot just this, but now that Louise treating Saito as a dog became more rarely, it got humourus when she actually did. And as the season progressed in many ways, I also had the feeling that he deserved it. Not like he did in the first seasons, where in my opinion wished Saito to dump Louise and go away with Siesta. \\n\\n\r\nSiesta is one of the best developed characters in the anime if you ask me. Her personality is so easy to spot and is really amazingly developed in a way that you feel like you really, really know her. She is a very humourus character. I can't count how many times she made me laugh this season, and each laugh made me love her more. This one scene, when Louise and Siesta is talking about what I remember as potentional enemies, and Siesta brings up Tabitha's dragon. When Siesta impersonates the dragon, is the best Siesta moment in my opinion.  (If anyone has a YT clip or gif from this, please PM me as I really wanna see this again.)\\n\\n\r\nAs it goes for the op song in this season, I have to say I am a bit disappointed. It did not live up to it's previous season 3 op, and of course First kiss from season 1. FIRST KISS KARA HAJIMARU! \\n\\n\r\nThe ending was for me, settling. I love endings that leave you fed up (not in a bad way) with the anime. There are no questions to be answered, and everything went as you had hoped. This ending had that, and I loved every second of the last couple of episodes. \\n\\n\r\nAs an ending to my review, I thank the developers of this anime for an amazing ride. I am very glad I picked this anime up, and I am very glad I continued watching after a lackluster season 1. This anime and especially season 4, have given me tons of laughs and tears. Tears of sadness and joy from the last episode.",
            "date": "2015-04-24T19:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 186394,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4519750.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yamete_Kudasai",
                "username": "Yamete_Kudasai"
            },
            "url": "https://myanimelist.net/reviews.php?id=186394"
        },
        {
            "content": "After completing the previous three seasons of the show, I will say the final season lived up to my expectation, with significantly more story development than the season 1 and season 3.  Zero f begins by finishing off the cliff-hangers from last season, followed by a few light-heart comedic episodes, and finally develop into a final, climatic arc. If you are a fan of the light novel, the last arc is probably not to your liking, as it derives significantly from the book. However, if you have not read the novel, the arc  is quite satisfying, especially the ending.The ending is perhaps one of the most complete ending (as in no loose end) I have seen.\\n\r\n  Overall, if you have watched the previous three seasons, this season still retains what makes the series great, the comedy and the ecchiness. An improvement over previous seasons is an increase in character development (which will be more apparent if you have watched the previous seasons). If you have not watched any of the previous seasons, I suggest you give the series a try if you are a fan of comedy or fantasy.  \\n",
            "date": "2012-03-25T16:06:00+00:00",
            "helpful_count": 6,
            "mal_id": 56909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/heipo",
                "username": "heipo"
            },
            "url": "https://myanimelist.net/reviews.php?id=56909"
        },
        {
            "content": "This is a great ending, to one of the most enjoyable anime out there, the story is not the most complex, but it is simple and different, and it follows the previous seasons very well. This season had a lot of romance too, and some nice action scenes\r\nZero no tsukaima F concludes the story in a great way and like I said it may not have the best plot or characters, but it is very enjoyable and fun to watch, the mix of comedy romance action and fan service is very good, if you don't like ecchi it might annoy you, but if you gotover to the last season then it won't be a problem.\\n\r\nStory(9/10) - Great, has a good ammount of romance, it has a great ending and yu get to see character development.\\n\r\nArt (9/10) - pretty good, beautiful characters, good animation but not perfect, some details on animation make it a 9 instead of a 10.\\n\r\nSound (8/10) - Great voice acting, the music is good but not great.\\n\r\nCharacter (9/10) - Even though they are cliche, they feel unique in some way or another, and each character gets some development even though it focuses on the two main characters, we get to see more about the princess and other characters, wich is pretty nice. Even tough louise may get boring at sometimes, she is still very enjoyable.\\n\r\nOverall (9/10) - One of the most enjoyable anime to watch ever, even tough it may be cliche at some times, it will be enjoyable and fun to watch till the very end, and the beautiful romance between the two main characters is a plus.",
            "date": "2012-10-13T00:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 74791,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1422735.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Karffebon",
                "username": "Karffebon"
            },
            "url": "https://myanimelist.net/reviews.php?id=74791"
        },
        {
            "content": "Zero no Tsukaima F is the last season and the 4th season of the zero no taukaima series. Before i write my review i would like to tell u about this particular story. It is a fantasy romantic harem. This harem is not a harem where the guy likes all the  girls but the girls like that one guy. The guy likes only one girl tho. Saito and Loiuse has developed a relationship over the past seasons. This relationship is like a master to pet relation. the girl is tsundere so if u like that u might like this. In a harem animemost of the time all the girls are different. from tsundere to nice and calm to big breasted. this anime has this which makes this a great harem anime. the story is great. it is very intresting. the story also develops tye characters and the enjoyment. the music is good too  having them in the right parts and the voice acting is great. the art is great however is not as great as the new anime thatbhas been coming out. I think the author wanted to keep the classic view of the art caz the previous ones were like that too. This siries.is a must watch",
            "date": "2012-09-03T05:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 71495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/347293.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/lukeww123456",
                "username": "lukeww123456"
            },
            "url": "https://myanimelist.net/reviews.php?id=71495"
        },
        {
            "content": "I am going to make this a review about all four seasons of Zero no Tsukaima (while mainly focusing on this one) and I am going to try doing this without giving away any spoilers if possible. \r\nZero no Tsukaima is an anime with incredible potential. What I mean by that is, if it dropped all the nonsense (fan service and repetition for instance) and focused on the story and such, it could have been amazing. It has some moments of clarity where it focuses on the story and the characters and when it does that, it is brilliant. (But it usually lasts just fora few minutes and that's a shame.)\\n\\n\r\nStory:\\n\\n\r\nLong story short, the story is basically about a boy who finds himself in another world, in this place no one speaks his language and he has no idea what's going on or how the got there. An accident gives him the ability to understand this strange language and he learns he has been summoned as a familiar to a mage and since most familiars are animals of some kind and a human familiar is (almost) unheard of, he is being threaded like an animal. By another accident he finds out being a familiar gives him special abilities. Basically an ability to use all weapons. So far so good right? Wrong, creators of the anime doesn't know a thing about storytelling. So usually the show is riddled by moments what a 10 year old would consider kinky and funny. This usually happens on every episode, several times. On top of that, this usually ruins whats supposed to be emotional moments. An act of heroism, an act of sacrifice, and boom, same nonsense about being funny and kinky. This is one of the rare shows that would benefit from a fan recut. Take out all the nonsense, rearrange some scenes and focus on the story a bit more. But I digress. As far as I understand, if the anime fallowed the original material properly, most of these issues would be resolved, but alas it didn't go that way.\\n\\n\r\nArt:\\n\\n\r\nArt is usually good overall. Colors can get a bit too bright or too dull at times, but thats to be expected. Not much bad, nothing groundbreaking, just fine.\\n\\n\r\nSound:\\n\\n\r\nI wasn't able to find anything wrong with the sound other than some characters sounding annoying, so moving on.\\n\\n\r\nCharacter:\\n\\n\r\nHow do I put this... Characters are fine but incredibly inconsistent. They seem to forget all about their past, their motivation and their abilities all the time. Also, there are many moments where character development gets abandoned simply to put forward the harem side of the anime. Which is especially stupid since the protagonist  has already picked the main girl. Also, there is an issue with characters appearing once and being forgotten by the next episode. From what I gather, this is mostly do to anime not truly fallowing the original material where most of these issues not present.\\n\\n\r\nEnjoyment:\\n\\n\r\nYou can actually enjoy this anime if you skip some of the terrible and annoying repetitive stuff. I tried watching it that way for the second time around and it really improved my enjoyment of it.\\n\\n\r\nOverall:\\n\\n\r\nThis anime has great potential but fails to deliver because after a while it becomes incredibly repetitive. But if you have time to waste, it is a good enough anime to watch.",
            "date": "2018-01-27T13:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 269816,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5108187.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/remembrance",
                "username": "remembrance"
            },
            "url": "https://myanimelist.net/reviews.php?id=269816"
        },
        {
            "content": "Hi. This is the first time I have ever written a review so don't expect much. This whole review is basically about what i enjoyed about the series however I won't be going deep into stuff like the art sound and whatnot. Besides, you guys will most likely not see m review anyways but here it goes.\r\nWhen I first started the series from season 1, I thought well i guess its not bad bud probably not something i would enjoy. Well, as I watched more of the series, the more I realised about how much i regretted my words.\r\nI'm kinda really into the harem genre,and even more of the romance genre, so I'm kinda biased with this, so i bet only the people who absolutely adore romance will kinda understand me. Also this review is just solely based off of what I enjoyed about this whole series in general.\\n\\n\r\nFirst and foremost, I adore Louise so much so the people who have finished the series will understand why I liked it so much. Also I'm just happy with how everything ended up. I wish I could explain more but this is the best I can put it into words. However though since I really wanted Saito to be exclusive to Louise, I wasn't really a fan of how he was interacting with so many girls, I hoped this would lessen as the series continued but well it didn't. That's probably weird for me to say since I said harem is one of my favourite genres. \\n\\n\r\nWell anyways time to wrap this up. Overall I gave the series an 8, but keep in mind I based this review on how much I enjoyed it and nothing else. But I am a fan of the OST. Also anyone who has been watching since season 1 will get a nostalgic feeling towards the end of the episode. Also I LOVED how they ended the series. By the way I know i wrote this review like way after the series ended so I apologise. I hope at least one person finds this review helpfull.",
            "date": "2017-12-30T08:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 266859,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6756040.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lemonation",
                "username": "lemonation"
            },
            "url": "https://myanimelist.net/reviews.php?id=266859"
        },
        {
            "content": "This review will be covering all 4 seasons of the show and might include some spoilers:\r\nI went into this show having no idea what to expect, with most animes I had watched at least a few clips on YouTube so I kind of knew what to expect and what would happen story wise. This anime was an exception, I saw someone on a forum say that this was a really good romance/comedy anime (I'm a big fan of this genre) so I was bored one day and decided to watch the first few episodes. \r\nWithin the first 2 or 3 I was hooked on theshow, it has a really good sense of humour, the art style is really pleasant, each of the characters are really unique and interesting. In the first season there isn't a massive focus on the romance between the characters but there are a lot of nice, sweet scenes that give you enough to look forward to how it will go in the next few seasons. The first season's story is relatively the same, its not over the top with action and instead acts as nice introduction to all of the characters.\\n\\n\r\nThe story picks up a lot in the following seasons, there is a lot of character development and universe expansion, you start to see a lot of the countries you only heard mentioned in previous seasons and it carries a lot of story over from the previous seasons. \\n\\n\r\nSeasons 1-3 were excellent yet somehow season 4 managed to be even better, you see some major character development from both Louise and Saito, their relationship advances leaps and bounds and even the story somehow gets better than it already was. I don't say this lightly, but the ending of season 4 is the closest thing to perfection I have ever seen in an anime so far.\\n\\n\r\n\"The Familiar Of Zero\" is a truly excellent show that I would recommend to anyone. \\n\r\nOverall I give the entire series a 9/10",
            "date": "2017-09-24T07:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 258503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6505245.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/UnknownAK",
                "username": "UnknownAK"
            },
            "url": "https://myanimelist.net/reviews.php?id=258503"
        }
    ],
    [
        {
            "content": "Meh, so if you're reading this you've probably watched the other 3 seasons of Louise and chums, and if you haven't, watch those first.  Firstly as you'll understand what's going on and second, as this show gets progressively worse with every season. \r\nI can only rate it as mediocre at best and somewhat dissapointing.  It may have been a while since I watched the previous seasons but I'm sure this season relied more heavily on fan-service.  Which isn't always a bad thing, especially if you enjoy boob comedy (or lack of) and tsunderes, but if it's in lieu of a decent storythen it can get a bit weak over 12 episodes.  They probably shouldn't have bothered. \\n\\n\r\nSo yeah, watch it if you like Louise, Tifa or Siesta, or their seiyuus but other than that, it's a bit poor and really, as a swan-song, it could/should have been better.\\n\\n\r\nI've given it 6/10; was probably being kind.\\n\\n",
            "date": "2012-05-06T17:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 60683,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/228567.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mantzy",
                "username": "Mantzy"
            },
            "url": "https://myanimelist.net/reviews.php?id=60683"
        },
        {
            "content": "*As you read please note that the familiar of zero and FOZ are the same thing as Zero no Tsukaima*\r\nAs a finale of a (to say the least) LEGENDARY series in the familiar of zero i had very high expectations. I say that my expectations were above met. You should already know what the familiar of zero (FOZ) is all about but if you don't go ahead and watch the first 3 seasons before you read this. \r\nStory-9/10 \r\nWith all the annoying things from the 2nd and 3rd seasons (most having to do with being repetitive) I say do it again, push the boundaries oflove (and viewer morals) as far as they can go and see beautiful things come from it. I say that the plot is great but i don't know how many times i seen the same dang recipe in which you screw up then you make up and from that it's it only flaw. But there were some new twists here and there.\\n\\n\r\nArt and Sound-10/10\\n\r\nI cant say that i'm a big critic when it comes to sound but i like both the opening and closing themes. As well as the background music that fits the mood of the scene. All animations were crisp and clean and characters were all looking up-to-par.\\n\\n\r\nCharacter-9/10\\n\r\nCharacters are probably one of the hugest advantages over animes. I got to say i did not like some of the characters from the start (I'm looking at you Mr. de Gramont) but over time they start to build on you and you accept them. But some characters i think get in the way with the plot and friendships too many times. \\n\\n\r\nEnjoyment-10/10!\\n\r\nIf i could give the enjoyment anything higher i would, but a 10 would have to do. Ah the memories as i look back at this season is such feeling of overwhelming joy. You will laugh, you will be in a state of awe, you will maybe even shed a tear. YOU WILL ENJOY THE FAMILIAR OF ZERO!\\n\\n\r\nOverall-10/10\\n\r\nThis anime shot to the tops of my favorite list for many reasons, it was funny and had romance, loved both of the main characters, and the exact last moment of the last episode led you wanting an extra episode (which can be good). It was just a excellent conclusion to a even more excellent series. If you for any reason are thinking about ignoring the conclusion then DON'T!-Dennis",
            "date": "2013-06-10T16:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 100641,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1986960.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/pacdmaster",
                "username": "pacdmaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=100641"
        },
        {
            "content": "Well its been a massive roller coaster of The Magical Misadventures of Saito and friends. Still left to wonder how this managed to get a budget enough to make 4 seasons of it.\r\nSeason fours story stick to that of previous in the fact of when something happens it only stays for an episode, two if you're lucky. However the finale does hold out for almost an entire four episodes for the final climax of the season, a new record as far as this series is concerned. Doesn't stop the fact it seems like each episode could have been only 6 minutes long if you cutout all the pointless scenes.\\n\\n\r\nArt, and the term is used loosely, has barely improved and in some areas it seemed to have gotten worse. Most notable on faces, half the time they lack any real emotion or they were so crudely done you cant see half of it. Then there's the little moments, such as hair waving when dancing, moves a hell of a lot more than it really should.\\n\\n\r\nMusic went back to its season 2 type. Good proper pieces that didn't end in just a minute or two, it lasted though the duration of the scene or battle. It however doesn't stop that some sounds and light pieces are reused a few times too many and still the faint lurking sound of background static during slow silent scenes, should you have ears and headphone acute enough to notice it.\\n\\n\r\nCharacter brought in some new developments as there was one part it could have turned into a massive romantic drama scandal or taken a huge twist on the main characters love life. but it's quickly dismissed later on as if it never happened which is utterly mind boggling as to why something meant to be a serious thing is brushed off as a minor issue. And this doesn't happen just once, it happens a few times throughout this season, some worse than others but they're more or less treated the same way.\\n\\n\r\nOverall enjoyment when going into this season was low. Personal note, i just wanted it over and done with and ended up taking a two week hiatus from it. But upon returning to finish the final few episodes, it was pleasing to see that it actually picked up on its action, story and drama to the point where it actually got rather interesting. Apart form the fact of the realism when obtaining such high grade weapons, goes completely out the window and more dead things return from the grave than a zombie movie, it was a much improved ending other previous seasons as greatly acceptable considering the disappointment of its predecessors.",
            "date": "2015-03-14T23:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 182366,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=182366"
        },
        {
            "content": "Probably my favorite Harem anime to date.\r\nZero No Tsukaima F, an anime that's been around for quite some time and only now have I finished it. Honestly though, I'm thoroughly impressed with this series. Not just impressed though, I'm actually satisfied. For once a harem anime that doesn't have the MC tripping on some in-animate object to only land in some girls' boobs, a trope that's plagued nearly half of series that I've seen. There's actually a story here, with good characters that are really enjoyable. \r\nHowever the characters are debatable. If you're not a fan of Tsundere's I would highly suggest you don't watchthis series (although if you've made it this far then you probably don't mind). \\n\\n\r\nTo make this review short: all in all, I highly recommend you watch this (or re-watch this). And my only complaint would be the ending, I REALLY wish they added just a bit more to the ending instead of rushing through the last episode. Albeit, I had a great time and will definitely re-watch this series.\\n\\n\\n",
            "date": "2019-05-03T19:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 307748,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=307748"
        },
        {
            "content": "This is the first review i've ever done and it will be spoiler free, and even though ive watched anime that were arguable better than this i felt obligated to right this review.\r\nSince this is the fourth season of the series im assuming everyone reading this has watched all four. But if for some reason your reading this and haven't i will say it is a must watch.\r\nMost people will think giving this a 10 is really overrating the anime. But the reason it felt necessary was how this last season made it all worth it. when you watched (or watch) the firstseason you think \"ok that was pretty good, ill give the rest of the series a try\". Then season 2 comes around and you think \"well once again pretty good, but feels a little repetitive\". now season three rolls around and you like \"alright how many times are you gonna do the same thing, this is still entertaining but getting ridiculous\". But at this point dont make the same mistake i did and put off the last season. I cant really place my finger on what exactly it was, maybe putting all the time into this anime  and seeing the light at the end of the tunnel. But of all the anime ive watch (which at this point is about 100) this is the most satisfying last six episodes i have ever seen. it makes you look back at the last three seasons and think \"ok, that was definitely worth it, and really not that bad in the first place\".  Most people who dont like this show cant see past the fan service or repetitive jokes, but if you can i promise it will be worth it.",
            "date": "2015-04-27T01:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 186577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3582333.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/evilduck321",
                "username": "evilduck321"
            },
            "url": "https://myanimelist.net/reviews.php?id=186577"
        },
        {
            "content": "The fourth and final season of The Familiar of Zero, where to begin! Im one of those audiences that can really get into an anime, and the fourth season did a very good job in hauling me back in, after the second season let down and the third season sort of comeback, i had my disbelief's but I am more than glad I stuck with it! \r\nFor those who are questioning if you should stick and watch the final season I am telling, no, I am begging you to continue and enjoy it. Yes, the previous seasons had their ups and downs but after recentlyfinishing the last season, let me say i can't find anything I did not truly enjoy about it. No stupid moments, no let downs, happy endings, the whole works, they delivered and I am so happy!\\n\\n\r\nI am going to be biased a little, as I am a big fan of harems and rom coms', I don't know why but they just click with me, I am just saying that as I might get more than a little carried away here. I was definitely not expecting all of the various relationships through the series. With most harems, yes all of the characters have one or so episode about background story and how they fall in love with the main character, but I love how through all four seasons of The Familiar of Zero, everyone develops continuously, they aren't shoved to the side. Yes this does not have anything about the final season, so why talk about it?  I want to comment about how all the characters, and how they all end up happy with only one of the characters being paired up with the main character. In most harems, I find that all of the girls who are \"not chosen\" are left on the spot, with only an episode about how they are let down and not really touched on anymore. The final season did more than a wonderful job at concluding the romances through the various characters, and they are not left on the spot all alone just being a \"third wheel\" to the couple. Its hard to explain without getting into detail so I suggest watching and learn what the heck I am talking about!\\n\\n\r\nThe final thing I want to comment on is the second final episode, I am not going to spoil it but something happens. It angers me very much the writers made it out to be the way it was, however, I also praise them on the wonderful work they did at how they did it and how they finished it with the final episode, I am very happy they made me jump my seat screaming at the computer, and I hope that future anime's that I watch draw me in, in such a peculiar manner that the Familiar of Zero F did.\\n\\n\r\nOverall well done, you have my thanks for another great anime!",
            "date": "2015-11-15T18:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 203451,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4960123.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/YRUBetter",
                "username": "YRUBetter"
            },
            "url": "https://myanimelist.net/reviews.php?id=203451"
        },
        {
            "content": "This anime series would have been a 10/10 for me if not for one person bringing the entire show down.\r\nThat person is Louise.  let me explain. (spoilers obviously)\r\nThis anime was a lot of fun to watch as far as the plot goes. good believable characters staying true to their character when events unfolded. You have saito, a badass mc with a dynamic harem who is actually decisive for once and can see why ladies fall for him...is what I would have said if he was actually the mc. No the mc is louise because she summons saito as her familiar and has the sameproblems like your typical harem protagonist. She is weak, indecisive, undeserving, and most of all stupid. Sure saito gets the spotlight but the bottom line is he exists for louise. The fact he can and did die while louise has that mc plot armor to save her ass after making stupid decisions time and time again kind of seals the mc deal to me. \\n\\n\r\nNow before I get into why I just hate louise and how she ruins the entire series for me, I need to explain why I don't blame saito for some of the stupid things he does nor any of the other girls in his fake but rather dynamic harem. Let's start with Saito.\\n\\n\r\nHere is a guy who has been summoned into a completely different world to serve as some girl's slave. He took it pretty well and even lives up to the title as familiar. He even dies for this girl and her world while at the same time, even washes the girl's dirty pantsus. Don't get me wrong, dude has flaws and does things he shouldn't that hurts louise but at the same time, I understand why he does such things. Louise is no doubt, abusive towards him and constantly rewards his attempts to please her by overreacting explosions. By the 3rd season, she starts kicking the balls which is never ok towards the guy you love and plain to have children with. The girls who were throwing themselves at saito were serious threats to their relationship by rewarding him when Louise should have been the one to do so.  \\n\\n\r\nNow to discuss why I don't hate any of the women throwing themselves at saito.  The nature of saito's harem is very dynamic and just doesn't happen for no reason. It happens over time with each female having believable reasons why they want to pursue him when they know he is serious about louise. Hell two of the ladies fell off the harem wagon due to other interests/wanting to support another member of saito's harem.  I have read many reviews/opinions/polls angry at these ladies for trying to get with saito\\n\r\nbut if one saw from the ladies point of view, it makes perfect sense for why they would go after saito which is they all, at some level, think saito can do better. \\n\\n\r\n Queen Henrietta goes for him because louise doesn't treasure saito who could die at any moment like her childhood love did. Saito literally dies fighting against 70,000 dudes just to make sure they all escape and next week louise is casting explosion on saito as soon as he comes back alive to go home to her. \\n\\n\r\nThen there is Siesta the maid(best girl seriously) who knows she has to be aggressive if she wants to win saito. In a world where nobles treat her like shit, Saito is a shinning star in her world. He is a man that did not care what nobles thought of him and treated commoners kindly. Just about every commoner treat him like he is their champion for his actions and it doesn't help he has earned himself a title that puts him in the same, if not, higher standing to nobles. To her, she constantly sees a good man being treated horribly by a noble and wants to free him like he saved her from a bad noble as well. \\n\\n\r\nTiffa is a shy sheltered elf girl that happens to cast phoenix down on saito. She didn't go for saito at first and the relationship between them was purely an innocent one. well more on her side than his but still. It wasn't till saito kept making an impression on her and helping her meet new people that feelings started to develop.  For a girl who didn't have her own familiar yet, she was envious that louise got such a great familiar only for her to treat him badly in her eyes. All she ever saw was louise casting explosion/kicking saito in the nuts. It's no wonder she wanted to go for saito too. \\n\\n\r\nFinally there is Tabathia/Charlotte who joined the harem wagon during the events in season 3 because of saito not only forgiving her, but also going to personally save her from her uncle. It may seem to make no sense for her to fall for saito but for me, it's all too clear and it leads to the final problem I have with louise. Tabathia knows she can be a far more capable partner for saito than louise ever was. Throughout the entire series, Saito pretty much did all of the work while louise constantly kept getting them into danger, Like running off into deep dark woods by herself, going to places where she is clearly the target, trying to beat people with her shit skills only for her to get captured making saito's job as a familiar way harder. During the time saito was training his knights, know what louise was doing? being pissed she doesn't get to spend time with saito instead of, you know, train to develop her new void mage powers. like 90% of plot could have been solved if she would have just trained.  Know why when Tabathia saves them, she actually does it? it's because she read some books and practicing her magic like lousie should have been doing. So in Tabathia's mind, louise doesn't deserve a familiar like saito and because she works hard, believes she can protect saito better because she has been doing it since season 1.\\n\\n\\n\r\nThat is why I give this anime a 6 because if louise would have just tried to be a better mage, tried to be less abusive, tried to realize that even though some fault lies with saito for not resisting these women harder, that he shouldn't be treated like that due to the women in question making moves on him, I would have enjoyed the series more. At least their relationship does mature a little in the 4th season but honestly, the story felt like, in the end, saito was going to get stolen and with very good reason. \\n\\n\r\nanyway I do say it's not a bad anime at the end of it all and one should give it a chance.",
            "date": "2016-04-19T23:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 216731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3717691.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/NoobSoul48",
                "username": "NoobSoul48"
            },
            "url": "https://myanimelist.net/reviews.php?id=216731"
        },
        {
            "content": "Zero no Tsukaima F is the fourth season of Zero no Tsukaima series . As the final season for this series , i gotta say that nothing change really . From the story plot , to the characters plot and mostly everything . It's like an episodic anime from season to season . That being said , it's still a good anime .\r\nStory:7\r\nAfter the event from last season , Saito now have to face Joseph , who is trying to have a war . After the most shortest battle ever with Joseph , war was stopped and peace is finally a dream come true .Tifa , the elf girl who tried to summon her Familiar , summoned Saito instead . This is where the stories of the rune of God's Heart , Lifdrasir begins . The story plot have too many flaws that i don't understand why didn't they fix it . Laziness could be one of the answer here .\\n\\n\r\nArt:7\\n\r\nBasically the same as before . Nothing has been upgraded or anything . Got some nice 3D animation which is nice .\\n\\n\r\nSound:8\\n\r\nSame voice actor and actress . They got some nice OST that have a thrill effect . Same goes with OP and ED . I like the OP better .\\n\\n\r\nCharacter:7\\n\r\nNothing change like before . They introduce us with some new characters like Luctiana , another elf girl who have some connection with Tifa somehow , Vittorio Serevare , another void mage who is known as the holiness or Pope and more . They also got some more ''Melons'' boobs than ''Lemons'' one which is obvious . That's all really . Nothing change at all .\\n\\n\r\nEnjoyment:8\\n\r\nFrom what i have seen , i didn't enjoy it much for a few episodes of it . After some more episodes , i enjoy it just fine . The comedy is as funny as before . The romance are kind of uninteresting here . Why ? From my point of view , what they tried to do is like this . Make the lovers , Louise and Saito of course , fight in some way like making Louise find out that the Queen herself , Henrietta , kiss Saito and making Louise cry . After that , they make up . Not long after that , they fight again . The cycle continues . That is not what romance or love story is all about . I think Romance are only serve as a side dish here . Good thing the ending was a happy one . The harem is as always , Harem-licious . The fight scenes are okay i guess .\\n\\n\r\nOverall:7\\n\r\nAs a fan of Zero no Tsukaima series , i can say that this is a must watch but don't put too much hope for this one . It's one of those anime where you're either like it or hate it . I like it but i wish they could have been better . Can't do anything about it now because the series has ended . What's done is done i guess .",
            "date": "2015-03-28T17:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 183815,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=183815"
        },
        {
            "content": "[ I said that this is a review on the anime Zero no Tsukaima , all seasons included ! I just thought it was better to do this review on the page of last season , here ]\r\n[ I also want to apologize for my bad English but I am French and this is my first review]\r\nFirst, I do not seem to realize that I watched four whole seasons ! I found it a lot, so you have to have time to spend . The positive point is that the characters and their feelings change over time, new characters arrive , the plot extends again,and again ...\\n\r\nIt is very difficult to give an opinion on the entire 4 seasons of this anime, because I totally do not remember any of the episodes. If I had to give an overall opinion, I enjoyed this series, even if the theme and the characters were a little too \" medieval \" for my taste.\\n\\n\r\n[ SPOILERS ]\\n\r\nI must confess that the first season, I really did not like the character of Louise ( I saw it as a kid a little capricious, still typing on his familiar ) . But the seasons , she became one of my favorite characters . Many times, she wanted to be nice to Saito, but she always found to fricoter with other girls (but sometimes there was a bit forced ) . I admired the attitude towards the Princess Louise Henrietta , she was extremely modest and very committed to his country. Like what, finally , she is a good person, who knows how to respect . After each of his personality .\\n\r\nFor me, Saito 's still obsessed . Always watching chest girls, without even listening to what they have to say sometimes! I understand he is a normal boy from Japan , not having had an education aristocrat , but still. I did not understand either why all the main girls fall completely in love with him ... ( Tabitha fell in my opinion ) I guess it is because it is Gandalf and he saved the country and beat all the bad guys. The good thing about this character is that it has a determination and an outstanding courage, who rarely lose .\\n\r\nFor other characters, I have almost every popular , I think ( at the tall blonde sister Louise , it irritates me one! Always make moral lessons ... )\\n\r\nAfter that, the love between the two main characters is real, despite the stories and deceptions. I found even more cute sometimes. The scenes in which they declared their love and everything, it was very romantic (even if it just after shouting at each ) . I must admit that, despite everything , I really loved the episode 12 of season 2 ... I found it sad ... and super exciting to the end! (even if it goes unfortunately twist) . This episod remain my favorite.\\n\r\nFor the end of this anime ( episode 12 , season 4), it was not really to my taste ... coincidentally, this is the day of solar eclipse. And then a plane with missiles, it does not fly like that is a snap! I found it a bit surreal .\\n\r\n[ SPOILERS ]\\n\\n\r\nTo conclude , I think Zero no Tsukaima (globally) is a kind of fairy tale version of manga, a little futuristic, with lots of fan service. In fact it is a bit like the story of a prince who must protect a princess (unless it is a familiar and often beaten up because he is cheating ) . Frankly, I do not regret watching this anime . The 4 seasons of Zero no Tsukaima , I give 7.5 (This note does not appear on this site, it's a personal note). Yes , this is exactly the note should . In this season , I give 8 ( this is the note that appears at the top because I 'm still on page Zero no Tsukaima F).\\n\r\nI have great hesitation to write this review . I just wanted to express my opinion because I 've seen a lot of people did. In the end , I just think a long comment. Sorry if you find me boring or dull , but I do not like magazines too serious . If you read it , thank you , if you have not read , I do not want you at all!",
            "date": "2014-03-08T11:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 135065,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3341359.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zelie",
                "username": "Zelie"
            },
            "url": "https://myanimelist.net/reviews.php?id=135065"
        },
        {
            "content": "Zero no Tsukaima was a series I started on a whim. I really didn't have too many expectations for it. \r\nMy love for this series has grown since watching the first episode. Since then, I've finished the rest of the seasons and anxiously awaited each episode of the Final season as it came out. In my honest opinion, this was the best season out of all of them, mainly because it just met and exceeded every single one of my expectations.\r\nStory: 9/10\r\nZero no Tsukaima F starts off where Princess no Rondo left off, but with a few new twists thrown in. First off was howSaito managed to become the familiar of both Tiffa and Louise, due to an accident. This newfound power come in handy, as discovered when Louise uses her newest void power. However, it comes at a heavy price. Near the end of the series, Louise does something that, I'm sure, made just about everyone scream out in frustration. She sends Saito back to his world. \\n\r\nOverall, I thought the storyline was pretty good, but there was definitively places where it seemed rather rushed, especially in the last episode. (I really can't see Siesta, Tiffa, Tabitha, and Henrietta getting over Saito choosing Louise THAT easily.)\\n\\n\r\nArt: 9/10\\n\r\nIf you've seen any other season of Zero no Tsukaima (Which I will assume you have), the art is the same. Nothing new, nothing old.\\n\\n\r\nSound: 10/10\\n\r\nThe music in Zero no Tsukaima F is perfect in every way. The music itself, as well as the places where it's played, adds to the effect of the scenes very well. There is nothing at all to complain about here.\\n\\n\r\nCharacter: 9/10\\n\r\nBeing the last season, I really didn't think there would be any form of character development. I didn't know how wrong I would be. Louise decides, against her own feelings, and sends Saito back to his world. Saito, upon his return, actually (finally) conveys his true feelings for Louise, and asks for her hand in marriage (Cmon... we ALL saw that coming! :D). The only real complaint I have is in the end. I can see how the other girls after Saito would accept his choice, but not as easily as they did... (I'm not really complaining though, since Saito has to be with Louise. No exceptions.)\\n\\n\r\nEnjoyment: 10/10\\n\r\nHowever sad I might be that this is the last season, I enjoyed Zero no Tsukaima F greatly. The mixture of fast-paced action, along with the new plot twists thrown in made the story extremely enjoyable. But, the part I loved the most was, you guessed it, the very end. Louise uses her void powers to bring them back to Tokyo! A happy ending for an amazing series.\\n\\n\r\nEven though I anticipated what would happen at the last episode, I still can't help but just go D'AWWWWWW in the final 5-6 minutes. I loved it, it was amazing, and there's nothing else I can say but this. GO WATCH IT!",
            "date": "2012-03-24T19:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 56825,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1117163.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/TabiNoTochuu",
                "username": "TabiNoTochuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=56825"
        },
        {
            "content": "Zero no Tsukiama is a harem with lots of ecchi.\r\nThat is probably the deciding factor on whether people will watch this series.\r\nFor those of you that enjoy watching a guy win the hearts of the ladies and get some fan service in the process..Zero no Tsukaima is a light-hearted journey of consistent humor that never really changes.\r\nAs for the entire series. S1 and S2 are both good. S3 was terrible (it honestly felt like a waste of time and without purpose). S4 goes back to being as good as S1 and S2.\r\nS4 (F) Wraps up our plot. Ends our journey and overall will leave youlikely satisfied and if you've watched the previous seasons the ending is fairly guessable, but good.\\n\\n\r\nWhy does this anime get a 9 overall from me?\\n\\n\r\nIt was a fun anime to watch. I loved the plot in S1 and despite a bunch of overused humor throughout the series it was a decent watch.\\n\\n\r\nCharacters were the best in S1 and S2, S3 and S4 leaves only small changes and is more about the plot and humor.\\n\\n\r\nSound. Average. Nothing really to remember, but not terrible.\\n\\n\r\nArt. A fun and light style that works well and looks good.\\n\\n\r\nStory. Ok lets face it. The story in S4 is complete crap. I gave it a mediocre to be nice. Its not really the reason we watch this anime though.\\n\\n\r\nOverall Zero is a unique journey that many viewers will enjoy.\\n\\n",
            "date": "2012-03-31T15:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 57565,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Drew7",
                "username": "Drew7"
            },
            "url": "https://myanimelist.net/reviews.php?id=57565"
        },
        {
            "content": "This review is of the entire series of Zero no Tsukaima, so i will be taking into account the series as a whole.\r\nZero No Tsukaima F is the final season in the series, and to start off, the story was fairly intriguing, though the male kead getting sent to another world isn't anything new, throughout the series you can see the main characters see their flaws, which in other anime of this type, they pretty much don't have. \r\n overall it was enjoyable, though roughly half of the first season felt like a slog, after that, it was all smooth sailing. because this is thefourth season of the series there is a lot of development between all of the characters, and their environment, thought sometimes there can be a little bit of deus ex machina, the plot is interesting if you enjoy seeing the characters grow together, though one thing that this series gets wrong is they use Louise's tsundere tendencies as comic relief a little too often, though in some cases it's completely warranted\\n\r\nThis show is best experienced blind rather than knowing anything about the characters, world, or plot, as, if you gp into it while knowing too much of those things, it will feel a lot more boring than it is, simply because they beat around the bush a lot when it comes to the characters finding anything out. If you enjoy this kind of thing, and don't mind marathoning a show, it will be enjoyable.",
            "date": "2016-12-22T11:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 236140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DaRampishDat",
                "username": "DaRampishDat"
            },
            "url": "https://myanimelist.net/reviews.php?id=236140"
        },
        {
            "content": "TL;DR: If you already watched the first 3 seasons, don't stop now!\r\nI won't write a super long review on this, as you most likely already have seen the first 3 seasons when checking out reviews here.\r\nSeason 4 is in my opinion the best of them all. The story is well done, the relationship between Louise and Saito breaks its partially repetitive pattern and finally advances, and with some major tragedy in between comes to a truly beautiful happy end. \r\nThe ending is so well-rounded that I'd say that is the optimal ending the series could've had, no need for more seasons whatsoever.\r\n**SPOILERS AHEAD**\r\nIf you wantto be spoiled what happens in their relationship (very shortly); Saito gets another power which allows him to increase void magic (e.g. of Louise) at the cost of his own life energy. Louise confesses her love to him right before they part ways (she tricked him so he wouldn't risk his own life), but Saito manages to get back and after winning, proposes to Louise. They get married, and Saito shows her his world.",
            "date": "2018-10-14T05:37:00+00:00",
            "helpful_count": 1,
            "mal_id": 291709,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7157568.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Leyren",
                "username": "Leyren"
            },
            "url": "https://myanimelist.net/reviews.php?id=291709"
        },
        {
            "content": "This series is bad, i did not enjoy nothing while watching it.\r\nBut, i don't know how to express myself.\r\nI knew i was watching garbage since season one, but...\r\nStory: 5\r\nCan't say too much about it, simple medieval fantasy with elfs, nothing new.\r\nArt: 9\r\nAnimation get really criticied over the years, but this art was amazing for the series. \r\nI'd give it a 10 if it wasn't THIS exact anime.\r\nSound: 6\r\nMeh, this wasn't a strong point, nothing to sasy about it.\r\nCharacters: 7\r\nI.HATE.TSUNDERES. i said by the start of this review that this anime was thrash. \r\nBut, over all the seasons, all characters get to fit in.\r\nEnjoyment: 1 \r\nIHATE ECCHIS, FFS JUST STOP GETTING CLICHE-CHAN TO STOP EVERY ENJOYABLE SCENE.\\n\\n\r\nOverall: 10\\n\r\nThis anime was a \"droug\" for me, i couldn't stop watching even if it was 9:00AM. \\n\r\nI literally ended up watching all 4 seasons in less than 4 days, and jesus, i don't regret anything.\\n\r\nI HAVE to give this series a 10 overall.\\n\r\nJust watch it, it is pathetic. but i loved it.",
            "date": "2018-02-10T00:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 271164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6661876.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 10,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bodrak",
                "username": "Bodrak"
            },
            "url": "https://myanimelist.net/reviews.php?id=271164"
        },
        {
            "content": "Hmm, this season is far better than the 2nd and 3rd ones, at least no more breast stuff. The story is just ok, but it's really successful as a comedy :)",
            "date": "2012-03-25T13:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 56891,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/navieh",
                "username": "navieh"
            },
            "url": "https://myanimelist.net/reviews.php?id=56891"
        },
        {
            "content": "*WARNING: Will Contain Spoilers* \r\nThis is my review for the final episode of Zero No Tsukaima.\r\nSo, the final episode of the entire series of Zero No Tsukaima, it made me sad that it was ending, I really loved the series from season 1. The relationship that was built between Louise and Saito, the troubleshot Louise has in showing her love for Saito. Saito's love for her and his friends which Louise takes both the right and wrong ways.  \r\nContinuing on to the final episode, The Dragon is on its way to the Magic Academy to eat the two Void Mages (Tiffa and Louise). Saito;however, is trapped in the Human realm because Louise sent him back in order to save him! \"Sacrifices For Love\" which is a recurring theme throughout the whole series. Saito is down in the dumps and wants to go back and save Louise and his new \"home\". Luckily for Saito, there's a LUNAR ECLIPSE! Who would've guessed! Using the logic from the past series, if there's a Solar Eclipse he go back to the human world from the Magic world, if there's a Lunar eclipse he can go back to the magic world from the human world. \\n\\n\r\nThey never showed how Saito got that Fighter Jet besides him getting dropped off at the air base, so we can assume he got passed all the security peoples. So he flies towards the Lunar eclipse and VOILA he's back in the magic world, hooray! Louise is almost about to die, blah, blah, blah, Saito saves her, they kill the dragon, they get married, the end... Close cut ending nothing else happens.  BUT WAIT! Louise takes them back to the human world and they explore and have fun, finally they go to where Saito used to live, Saito rings the gate bell, the end. \\n\\n\r\nI think it ended abruptly, I wish they really showed the interaction between Saito, his wife (Louise), and his family. Hopefully they'll make a OVA showing this. I didn't really like the ending but one can hope that Saito gets lucky with all the girls, if you catch my drift ;) Forever Otaku...",
            "date": "2012-03-25T16:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 56915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zephyrat",
                "username": "Zephyrat"
            },
            "url": "https://myanimelist.net/reviews.php?id=56915"
        },
        {
            "content": "Because series has Ended, i can do my Homework.\r\nBest Ending, that could be maded.\r\nSaito is Able to return his world any time he want, thanks to Louise's Spell.\r\nAt least he got merried with Louise, a real merried. (not like in Futatsuki no Kishi)\r\nSo everything has Ended.\r\nThere's No chance for any more series,  meaby OVA about Saito and Louise days in Saito's World or Visit Saito's Parrents, but its only my speculations. Thats All",
            "date": "2012-03-24T14:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 56803,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/14498.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ari91",
                "username": "Ari91"
            },
            "url": "https://myanimelist.net/reviews.php?id=56803"
        },
        {
            "content": "First, i have to say i have just finished watching the 4th season of Zero no Tsukaima and i thought this anime was amazing! I did not watch the first 3 seasons but i totally got the plot and all the characters. It was the first series i really felt like i could watch coming in at the end and still understand everything thats going on in the whole 4 seasons of this show. I really enjoyed watching this show. If you haven't seen it i would defiantly check this anime series out! The reason why i gave the story a 9 was only becauseit didn't have originality through the whole show. There was of course love triangles and the damsel in distress moments most of the time. But i do believe they handled those moments pretty well. The art i thought could have been a little better but for the most part it was pretty well done. I gave everything else a 10 cause i really thought everything was put together very nicely. The plot had romance, drama, action, adventure, and comedy all in one. I will defiantly miss this show now that it has ended. Fighting Zero no Tsukaima!! :)",
            "date": "2012-03-24T18:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 56819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/475524.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kagomeyuki89",
                "username": "kagomeyuki89"
            },
            "url": "https://myanimelist.net/reviews.php?id=56819"
        },
        {
            "content": "Honestly, this anime is one of the better ones I have watched. I mean, there are quite a lot of animes of this genre out there and this is one of the better ones but this season wasn't really satisfying it is like they are still trying to put up the fact that Saito is Saito who loves being Saito and this basically means Louise is still blessed with the Blessing of First Girl from the story. Now let me explain my ratings\r\nStory(3/10)\r\n  Just like all other Harem Animes the plot barely moves every season let alone watching how it slugs through its plotevery episode. Even though rushing through the episodes is just a sad thing to do towards all animes. But honestly, I will suggest this anime only to people who like to see a lot of the girls chest.\\n\\n\r\nArt(7/10)\\n\r\nNow, this animes art style is still pretty nice compared to some other animes as it still gives the viewers a sense of happiness with some cute moments animated well. But I still wouldn't give this anime a 10 because I didn't particularly enjoy this anime as a whole and even though this doesn't have anything to do with the review *whispers Fate/Stay Night Unlimited Bladeworks is still the best art wise.\\n\\n\r\nSound(5/10)\\n\r\nThe sound in this anime is still the same quality as with most others I have watched. So I have no comment. But just to tell you,the voice actress/actor are not so good as to allow to just listen to the voices and know the story.\\n\\n\r\nCharacter(4/10)\\n\r\nThis is a Harem... Need I say more?\\n\\n\r\nEnjoyment(8/10)\\n\r\nI enjoyed this anime because I get to see Tabhita oh and Tabhita and Tabhita... Oh wait I can assure you this is a diferent reason Saito. Just Joking, Tabhita :D",
            "date": "2015-11-19T04:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 203701,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5001199.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Olej",
                "username": "Olej"
            },
            "url": "https://myanimelist.net/reviews.php?id=203701"
        },
        {
            "content": "The fourth season of Zero no Tsukaima in my opinion was not the best season of the show, that impotent parts of the story seem to be rushed while the the parts that are not as important seem to drag on forever. I found my self getting annoyed by some of the decisions the characters would make, the story has some very cheesy parts and was very predicable in some cases which annoyed me even more. The ending seems very rushed and kind of complete, I guess the writers want to leave what happens after in your hands. Despite some of the disadvantages in thisshow overall is was an okay show. The overall story was good and some of the characters were rather likable. The animations and art style is really good and on par with its time. I enjoyed a lot of the background music and it fit the show perfectly. I wish they took their time with the more important scenes and and less time on the side story's and less important scenes. I found this anime overall enjoyable and would recommend it to anyone.",
            "date": "2013-03-08T19:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 89109,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2253679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EnduringInsanity",
                "username": "EnduringInsanity"
            },
            "url": "https://myanimelist.net/reviews.php?id=89109"
        }
    ],
    [
        {
            "content": "Until the saga of '' THE FAMILIAR OF ZERO '' is legal, you can not have a good plot, but has fun characters. The anime to try to be a little more serious, but it really is in the middle term, abusing the clichés and a lot of times tests your patience, reaching even be repetitive and annoying as in previous seasons, and softens the middle to the end. The end result is '' Zero no Tsukaima: F '' is legal for those who require little it may seem ridiculous but that's right, a fun and kinda cool anime.",
            "date": "2015-07-03T16:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 192185,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4547041.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iky009",
                "username": "iky009"
            },
            "url": "https://myanimelist.net/reviews.php?id=192185"
        },
        {
            "content": "I'll make this revies as short as possible:))\r\nStory(7/10)\r\nIt has good plot but the love story and romance here kinda sucks.. too much corny..I can't stand it\r\nArt(9/10)\r\nIt has a good art like in the MMORPG\r\nCharacter(9/10)\r\nIt has kinda like MMORPG like I said and has multiple races \r\nEnjoyment(9/10)\r\nIt's funny coz it has kinda ecchi and something like that..\r\nOverall(8/10)\r\nIt's definitely good anime but I guess the love story here the only thing that is sucks",
            "date": "2012-03-30T10:54:00+00:00",
            "helpful_count": 0,
            "mal_id": 57423,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1186789.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/crescent917",
                "username": "crescent917"
            },
            "url": "https://myanimelist.net/reviews.php?id=57423"
        },
        {
            "content": "Ok, I will just get straight to to the point. What pretty much the guy that got the most highest vot said would be true. I would like to say that I am reading light novel so I kinda can't help but to compare.\r\n But anyway the anime was enjoyable, very very rush. I mean the episode1 to 3, who is suppose to be Joseph act was super rush. The light novel took 3 books to get to josep death, but the point is he got kill though not in the way but anyway that the anime and I know they had limited amount ofepisodes. Anyway majority of the scenes didn't make much sense. I mean the best example would be site stealing the plane, I mean shit man, if this is the level of security in a air base, military must be really crap. .....  \\n\\n\r\nSpoiler there for the novel\\n\r\nMajority of the stuff doesn't actually happened like that from what I've read from the book, and it is the pop who showed sito world to only Harietta, Tiffania, and Louis. Also when Louis tried to send him home she didn't send him to his home but 6000 years In the past during the era of the founder. Also Julio becomes an enemie, the pop wants to take over the elfe lands. Louis forgets her memories of sito ( read novel for the reason), sito sward doesn't get broken by the dragon ( from what I seen , the dragon was not part of the story but again not all volumes are translate) sito news ward is a katana. Harieta is a real bitch after showing her true color to use sito as a tool of war. Sito do get married to louis in volume 18 but by then the anime would have had another season. Tabith does become queen but some shit happens and escap her kingdom and was replac with Joseph daughter (yes he have a daughter) and planning for world domination. A new void user appeared. \\n\\n\r\nAnyway read the novel a lot more shit happens. Only season 1 & 2 of the anime stay true to th story\\n\\n\\n\r\nAnyway, the anime compared to the light novel would be like a 2 or 3.   But by itself, I guess a 7 mayb lower but it still pretty much got to the point of the story so it's was pretty enjoyable.  \\n\\n\r\nAs a super recommendation, read the light novel. It takes time to come out but those guys at bakatsuki still do a great job. The story have a lot more interesting stuff going on thant what all zero no tsukaima anime series showed in all season. It will also make more sense. \\n\\n\r\nBut I glade they finish the show, so guys I'm out . Watch this show with out comparing it with the novel, it. Was still a awesome show just to rush",
            "date": "2012-07-05T16:51:00+00:00",
            "helpful_count": 0,
            "mal_id": 65421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/djtremix",
                "username": "djtremix"
            },
            "url": "https://myanimelist.net/reviews.php?id=65421"
        }
    ]
]