[
    [
        {
            "content": "(Please Note: may contain light spoilers) \r\nI personally have been looking forward to this season since the day it was announced. I’m sure I can’t say the same for those of you who poorly rated or just plain dropped this anime during its first season for reasons that include but are not limited to:\r\n1) the Art\r\n2) The gags that aren’t funny\r\n4) The stereotypes\r\n5) The setting\r\n6) Your hatred of the main character\r\nThese are all fairly reasonable things that would turn off any hardcore anime lover who has watched such a series. However, for those of you who think that this season will be just as mucha waste of time as the first season, let me just say this: \\n\\n\r\nTHIS IS WHERE SHIT GETS REAL!!!!!!!!!!!!!\\n\\n\\n\r\nStory:\\n\r\nThe story takes place at Hakoniwa Academy right after Medaka beat the ever-living shit out of Unzen of the disciplinary committee because of a freaking dress violation. Of course she gets called to the principal’s office not to get scolded for destroying half the school, but rather to take Unzens place in a little project known as the Flask Plan. Now what is the Flask Plan you may ask? It’s an experiment were the goal is to produce a potion that will turn anyone who drinks it into a genius. \\n\\n\r\nIn order to accomplish this goal, the principle has gathered 13 students who (aside from being fucking trolls) are overpowered super geniuses and is using them as the foundation of the plan. They are called the 13th Party. One problem though, once a formula is actually made, the students at the Academy will be used as test subjects and most likely won’t survive. Realizing this, Medaka takes it upon herself and the student council to investigate the plan and find out what is REALLY going on behind the scenes of their school.\\n\\n\r\nThis season is equivalent to the Water 7 arc in One Piece and the Mukuro arc in Hitman Reborn. It’s were the pace of the story picks up, suspense builds, tension rises, shocking truths are revealed and some of the most interesting battles take place.\\n\\n\r\nYes you read that last part right, this is where your cheesey, tasteless, annoying little school life story turns into what it truly was meant to be: One of the most engaging and original Shounen Battle series to be created. \\n\\n\\n\r\nCharaters:\\n\r\nOne of the main problems with season 1 is that it only covered a small section of the manga. We were given the premise of the series but specific details regarding the characters and events of the past were only mention briefly in the last few episodes. This time, however, more details are given us regarding the main cast:\\n\r\nMedaka- We find out more about her family and abilities\\n\r\nZenkichi- We discover how hard he’s worked in order to stay near Medaka since they were 2 \\n\r\nAkune- We find out about how he was in middle school and why he’s so infatuated with Medaka\\n\r\nMogana- We find out about what Medaka means to her as a friend\\n\\n\r\nYou could call the 13th Party the villains of this arc but as time goes on that line will just get more and more blurred because their back stories and past are revealed to us. Whether or not these students were born lucky or cursed is rather hard to say. They can do the seemingly impossible easily and it’s as though no matter what they do, they will succeed regardless of luck or skill (they can, for example, roll a bunch of dice and defy the laws of physics).  But whether or not they are happy with what they are is one of the big questions that will get addressed here. I’ll try to summarize a few of these “students”:\\n\r\n- A psychic super saiyen\\n\r\n- A masked midget\\n\r\n- A black guy, with a Japanese name who speaks French\\n\r\n- A mass murderer\\n\r\n- A chick with a knife in her head\\n\r\n- And a cyborg\\n\r\n(Note: I am not kidding about ANY of these things but maybe now you can see why GAINEX decided to animate this series)\\n\\n\\n\r\nMusic and Art: \\n\r\nThe artwork is the same as first season so if that was an issue before then too bad. The opening and ending themes, however, sound a bit darker than the previous seasons. Overall I find them better than the first seasons.\\n\r\nP.S. If you’ve read the manga then you’ll know how badly GAINEX is trolling us with the opening. For those of you who haven’t read the manga then just pay CLOSE attention to the characters that are shown (especially the last one).\\n\\n\\n\r\nTheme:\\n\r\nThis plot actually brings us back to the idea of perfection that was shown to us in the form of Medaka. Season 1 was all about revealing the characters and enforcing the idea that Medaka is perfect by comparing her to normal people. The fact that we’re suppose to hate the main character shows that we would rather have someone who works hard but falls flat on their face, then a hypocritical, perfectionist who always wins like Medaka. \\n\\n\r\nThis season, however, is about understanding that Medaka isn’t the only broken character in the series and that she didn’t ask to be how she is. There are a lot of things that we can’t help: what kind of parents gave birth to you, what era you were born into etc. But what this season tells us is that sometimes we can’t choose whether or not were born with talent and, if we are, will that automatically make us any happier than anyone who wasn’t? Will having a body that can make you move instantly on reflex make you happy? Will having the power to read minds make you happy? Will having the ability to master anything and everything you see make you happy? Or will it just make you feared and viewed as something abnormal?\\n\\n\r\nEnjoyment:\\n\r\n I for one, as a fan of the manga, find this season pretty enjoyable. At the very least if you’ve watched the first season and/or read the manga then watch this season if only to find out what this anime is REALLY about.",
            "date": "2012-11-27T18:44:00+00:00",
            "helpful_count": 137,
            "mal_id": 78559,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1164769.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/edorcean100",
                "username": "edorcean100"
            },
            "url": "https://myanimelist.net/reviews.php?id=78559"
        },
        {
            "content": "Medaka Box Abnormal is the sequel to Medaka Box, so if you haven’t watched that, don’t bother with this anime. As a proper sequel, it picks up where the first season ended, however the main genre is very different than the first season. It turns the first season into a sort of lengthy introduction and puts emphasis on battles and “abnormalities” (strange inhuman abilities based on nature aspects) of individuals compared to the first season that focused on humour and SOL. Nearly every mainstream shounen does this, but this anime does it on a completely different level, what makes many people dislike it. But itisn’t serious and it never tries to be so it shouldn’t be taken seriously or people will be very let down.\\n\\n\r\nThat “light” feel is taken into the story as well with it being a bit cliché, while it raises very interesting questions. Is it right to be strong without doing anything for it? To Medaka and Zenkichi, two of the main characters, it’s something people shouldn’t even think about because getting stronger and suffering go hand in hand. Of course, they are bound to meet people that think otherwise. This is the first moment where people turn away from the show with rolling eyes. It’s because of how it’s handled. Surely, with Medaka being able to do inhuman deeds simply because she was born with it, she isn’t the right person to tell others that they have to suffer to get strong.\\n\\n\r\nHowever, if you don’t turn away so fast, you’ll see that there’s much more to Medaka Box Abnormal than just hypocrisy. Here comes Zenkichi, the other lead character, who is the exact opposite of her talent wise. He might be strong, both physically and mentally, however it is mentioned, not once, that he got there by hard work and was very weak during his childhood. Unfortunately, the rest of the main characters don’t do the themes justice as most of them are “specials”; very talented people or abnormals. Of course, most of the time, they can’t rival the abnormals that are villains.\\n\\n\r\nOne of the biggest problems I had with the story was how all themes were presented. Medaka Box Abnormal sure deals with very interesting issues but they are usually solved by main characters simply stating their opinion, even though villains keep asking better and better questions. The difference between the “good” guys and the “bad” guys is nothing but the way they answer them. That wouldn’t be such a problem if the show didn’t portray the main character’s opinion as the right one and everything else as wrong and it goes as far as Medaka deciding what’s right for the rest of the world (that doesn’t make her think about it even for a bit).\\n\\n\r\nArt doesn’t really help its case. It might look really strange and it’s difficult to get used to it but once I did, I fell in love with it. Animation is fluent and very well done. There’s lots of fanservice but it doesn’t feel overdone or annoying because it’s usually played for laughs. \\n\\n\r\nWhile it might look like a huge mess, and it somewhat is, most of it is done supposedly to create a comedic effect. However, not everything looks like it’s trying to parody itself. Character interactions and presentation is probably the best part of the anime. While characters themselves aren’t something to remember, their relationships and feelings are delivered perfectly. You can see how they feel about what they say or about what is happening or simply know their nature by their actions. I found this to be the best part of Medaka Box Abnormal because to me it felt more real than most of SOLs I’ve finished and it made the anime more enjoyable.\\n\\n\r\nMedaka Box Abnormal is definitely not a perfect anime. It’s difficult to like because it tries to jam too many genres together and never truly focuses on one. And even when it does (for a while) it usually overdoes it for bigger effect. However, if you do find something enjoyable about it, stick until the very end because it won’t go away easily. I recommend this anime only if you’re bored or open minded.",
            "date": "2012-12-29T14:07:00+00:00",
            "helpful_count": 39,
            "mal_id": 81854,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SuiNoByakko",
                "username": "SuiNoByakko"
            },
            "url": "https://myanimelist.net/reviews.php?id=81854"
        },
        {
            "content": "Now that this sequel has ended, so it's time to make a review of this thing and i gonna go straight to the point for every category of this anime, oh there maybe some spoilers that I may have placed:\r\nStory: Good 7 .\r\nBasically, it still has the same genre and it is still set in the same school with a very lame name,\" Sandbox Academy\"- unless it is a daycare center, who the heck gives a school with a name like that? What's added here are lousy terminologies like Flask Plan, Abnormals and 13 party or Class 13. However unlike the previous season this onehas more action in which the focus is no longer on Medaka (or at least for the most part) instead each member of the student council who were fighting along side her, has a piece of the action and a little bit of the drama. But what makes the action genre in which the group plans to destroy the so-called 'Flask Plan\" of this anime good, is that the setting of the action   sort of have a slight resemblance of  Bruce Lee's \"Game of Death\"  HAAAAAAAAYA!!!! But with a certain twist of course. \\n\\n\\n\r\nArt and sound: Mediocre 5.\\n\\n\r\nWell, it is still the same art used from the previous season and it still has the same amount of fanservice. There are the usual seiyu's who did the voices of the protagonists and I don't give much of the damn about the seiyu's who did the voices of the antagonists, as for the opening theme....I hate it, the ending theme....I like it.\\n\\n\\n\r\nCharacter: Fair 6.\\n\\n\r\nOn Medaka, she is still this heroine who is sooo perfect that there is nothing she can't do and won't do thingy as usual, but, in this sequel she underwent the same unwritten rule that every protagonist have to undergo which is that a protagonist have to face such seemly difficult odds in which he/she is nearing defeat which the audience feels the protagonist's suffering and then the climax, the protagonist rose up in victory. Then again the ration of the protagonist nearing defeat in some difficult odds and rising up in victory was not well balance, in fact for Medaka to emerge victorious is seemly too obvious to the point that we the audience don't even felt her suffering and it easy for one to brush it aside.\\n\\n\\n\r\nZenkichi Hitoyoshi- as usual he is still Medaka's Guard Dog and still serving as \\n\r\nStudent Council General Affairs Manager, unlike in the previous episode here he was now kicking ass and exhibiting his special ability. As usual I'll never understand author, Nisio Isin   as to why he as to insist that the character is a practitioner of Savate when his fighting style is no different that any other anime with a martial arts genre. What I like about him is Medaka having feelings for him and seeing him hugging her.\\n\\n\r\n Mogana Kikaijima-  The Student Council Treasurer, what's good about her was her reaching out to Yukuhashi which to me is cute, she probably the weakest among the group with only a sonic boom as her weapon and being able to breath like a fish (figure of speech). Since this anime has an ecchi genre and Medaka is the most ecchiest, she is more like the runner up of the ecchiest cast of this anime.\\n\\n\r\n Kouki Akune- the \"Destroyer\" I like his nick name, I like the part that he goes fighting this cyborg chick Itami Koga, it is basically nice that he was able to display his fighting ability and be able to do as to what was expected of his reputation.\\n\\n\r\nIn the previous season of my review, I gave this category a low score, but having seen the other protagonist given their share of the lime light the score belongs to Medaka's subordinates.\\n\\n\\n\r\nEnjoyment: Good 7.\\n\\n\r\nI admit, I do find the ecchi and the martial arts part of this anime good, frankly that's as good as it get, besides this sequel ended in a cliffhanger in which the last episode was about Misogi Kumagawa, Najima Aijimu and Saki.\\n\\n\\n\r\nOverall: Poor 3.\\n\\n\r\nOk, thought the story is good the action and ecchi are alright, the thing about this anime is that it has a lot of useless terminologies that were carelessly used by the author Nisio Isin, terminologies that complicates this anime and manga as a whole, in fact the said terminology \"Abnormal\" vs Normal vs Special doesn't actually categorize the students in fact even though the character's info mentioned that this character is an abnormal one would be surprise that the said character can be taken down by a protagonist who is normal. It is very disgusting that the author himself uses one conflicting  terminology to explain another conflicting terminology. Frankly the author is simply banking on the the main protagonist's ability to be the student council's president as this girl who is the very essence of a perfect and domineering  apex bully, of course there is the fanservice that comes with it, but overall with the cliffhanger, this sequel lacks a very good surprising climax .  \\n\\n\\n\r\nWill there be another sequel? Well, it looks like it.\\n\\n\\n\\n",
            "date": "2012-12-28T10:59:00+00:00",
            "helpful_count": 33,
            "mal_id": 81694,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 3,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=81694"
        },
        {
            "content": "I'll try to be brief, since this anime doesn't deserve a thorough review. \r\nI prefer the first season, as there, the author did not attempt to exceed their capacity until the last few episodes. Here, the story is \"serious\" from the beginning, making any and all issues glaringly obvious. \r\nFirstly, the characters are designed in an irrational way and often behave inconsistently. This both reduces the effectiveness of intentional humor, as well as interferes with \"serious\" story developments (or let's just call them 'non-comedic' since you can't take anything seriously in this anime).\r\nSecondly, special skills and other plot devices are explained with pseudoscience, which ispure torture, as I love science and 'realistic' sci-fi and hate pseudoscience with equal passion. It would be better if the author had just pulled the 'magic' card without trying too hard to explain the mechanism behind any ability or drug or whatever, since they obviously lack basic education on how things work in the real world.\\n\\n\r\nIf you liked the final episodes of the first season more than those preceding them, you may very well enjoy this season even more. If not, you may want to steer clear to avoid wasting time like I did.",
            "date": "2018-09-14T14:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 289010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/122026.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/VVayfarer",
                "username": "VVayfarer"
            },
            "url": "https://myanimelist.net/reviews.php?id=289010"
        },
        {
            "content": "How do you define an \"ideal\" human being? The perfect human understands his reality. All that we see as art, aesthetic, is just applied excellence. People always have to train to be the best at something, No one is born excellent, Some are born closer to and have an easier time acquiring skill. So, to think of perfection as something unnatural or Godly, would be to misperceive the reality of the matter, right?\r\nThe second season of medaka box, dubbed ‘Abnormal’ resumes following the somewhat mindblowing conclusion to the first season which saw a complete half revolution turn in the emphasis and plot of the wholeseries. In the second season we are introduced to a world of normal, specials and abnormals.\\n\\n\r\nNormals here are defined as everyday folk such as myself and maybe even you, Specials are people who greatly excel in a particular field and Abnormals from their name itself we can guess possess some sort of strange ability and able to achieve great feats that leave us normal folks dumbstruck. One factor I was greatly impressed with about the abnormal abilities was that the series tries to explain to us the mechanics and how these abilities work and unlike most shows that introduce some kind of wild out outrageous and thought provoking phenomenon to do this, medaka box simply uses Biology and Anatomy. The abilities are explained as being born from some sort of efficiency or deficiency of an organ, enzymes or muscle in the body. This greatly enhances a viewer’s experience and even gives the show (dare I say it to a shounen anime) a sense of realism. \\n\\n\r\nA scheme is later hatched by the principal called the ‘flask plan’ to perform research on a few Abnormals in the school so as to find out how abnormality works with the main aim of discovering some kind of method to transform normal human beings into abnormals or in other words make them perfect. The scheme itself i’m afraid to say isn’t necessarily original and without a doubt is a slight alteration from the all too familiar concept of a group of individuals who believe themselves greater than normal humans decide to rule over them. The principal also intends upon making this discovery to use the students of the school as test subjects for his experiments which could have adverse effects on them, and upon getting word of this of course, the student council consisting of medaka and co. try to stop the plan.\\n\\n\r\nThe highschool is divided into 13 sub classes ranging from numbers 1-13 and as it also happens, all the abnormal students are in class 13 of their respective grades. A group of these students have been selected to be the roots of the flask plan called the ’13 party’ and medaka’s objective will be to defeat this group thereby bringing a halt to the project. At the end of the first season we witness medaka defeat Unzen and at the start of the second season we are told that Unzen was a part of the 13 party, however due to his defeat he is unable to participate anymore and Medaka being the one who defeated him is now the most likely beneficiary to take his place. Feeling proud of their abilities most of the students in class 13 hardly come to school but upon hearing of the experiment most of them return with the prospect of attempting to take part but just as Medaka defeated Unzen to enter contention, they also believe they need to defeat her to have a chance to join, therefore presenting medaka’s group with a sizable amount of opponents. This of course was nothing more than to show us indeed how powerful Medaka was when compared to other abnormals and also for the viewer to hold highly in prospect the other members of the 13 party upon their introduction. \\n\\n\r\nThe school setting itself is seemingly devoid of teachers or any kind of academic activities for that matter. The main base of the experiment itself is an underground base on the campus; the base is divided into floors each holding one member of the experiment meaning medaka has to defeat them floor by floor making the series hold a sort of platform game feel to it which isn’t such a good idea. However giving the modern school setting and having super powered individuals, there will be a need to make use of an enclosed environment to demonstrate these abilities so the writers had a limited amount of choices in terms of location.\\n\\n\r\nGainax resume their duty of animation but however I will admit I’m not a fan of the art style used in the show, the use of extremely heavy pencil lines especially under the eyes give most characters a wild expression making them look as though high on cocaine with only voice actors and changes in facial expression making it otherwise. However when compared to some mediocre animation we saw in the first season, Gainax did a great job with animation on the second season. It has a number of fluid and nicely orchestrated action sequences here and there but these action sequences may seem dragged on a times by no fault of the animation but by characters overlooking a fight giving commentary on almost every little factor, something that should have been kept to a minimum or removed completely.\\n\\n\r\nMinami Kuribyashi resumes her role as she again sings the OP, entitled ‘Believe’ and unlike the first season’s OP that had a happy-go-lucky beat and feel to it, this one had more of a melodramatic and serious tone thus accurately depicting the complete shift in emphasis of the series. BGM mostly consisted of instrumentals and the sound director does well to appropriate each instrument well into a scene. Tension, suspense and other moments are most of the time complemented with a nice instrument to get a better feel of the atmosphere but the series still could have done better with its choice of soundtracks.\\n\\n\r\nThe show also takes pride in its host of very peculiar and strange set of characters with their differing ideals and philosophies on humanity. Medaka herself retaining her honest do-good attitude has this stubborn ideal of believing that all humans have some good in them and will a times go to whatever length to protect this ideal, often times purposely falling into enemy traps which looked to me nothing more than a weak excuse to extend the story. Her tenacious personality may come off as a bit annoying a times but her die hard attitude will leave most people wanting more. Most members of the 13 party will leave audiences absolutely dazzled, just as it’s depicted in the show that normal people see them as amazing or on another level, I have to admit even I sitting on the other side of the screen could also tell. The show uses the personality of these characters very well to keep viewers hooked to the screen and this factor was without a doubt the series strongest point.\\n\\n\r\nThe beginning of the show I have to admit was amazing but as time went on it started to lose quite a bit of edge especially towards its climax but it was still an enjoyable experience in the end. The series main problem was not as a result of its execution or anything it could help but in my opinion the writers seemingly not giving enough thought or effort into the storyline towards the ending as they did initially and seemed to be running out of ideas along the way and finally adopting cliché basic shounen analogies in the end. Despite all this, it still manages to impress with its fluid animation, applied sciences and extremely strange set of characters. The second season was without a doubt a lot better than the first and with more material still to be animated we can only expect things to only get better in future.\\n",
            "date": "2013-01-16T12:36:00+00:00",
            "helpful_count": 16,
            "mal_id": 83855,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1019085.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zee530",
                "username": "Zee530"
            },
            "url": "https://myanimelist.net/reviews.php?id=83855"
        },
        {
            "content": "Following on from the prequel, the story picks up straight where it left off, and if you had any questions, they'll begin to be answered.\r\nThe school is a mess and Medaka starts learning about herself, while we start to learn about Normals, Specials and Abnormals. \r\nRight away they aren't afraid to throw in people with abilities, which we're just learning about, so in some ways it feels like a completely different anime with the same characters, but it all starts to come together. \r\nThe dub voice sync is still a bit off but it's not a big deal.\r\nOne thing about the battles, is that eventhough they basically kill each other, afterward Medaka or Zenkichi will offer friendship. All most of these people want is to feel normal and have friends, and all they want is to offer that, even after everything. It's one of the charms that I enjoy about this series. \\n\\n\r\nThis season is in a way completely different to the first like I mentioned before. I feel like the first season was good in it self, but it let down on the build up to this season. Which was better than the first, though the disconnect between them both and the weird flow makes it hard to rate this and review for others.\\n\\n\r\nIn the end if you've watched the first season, this is worth watching to finish the story. There's a lot more action and can get pretty intense for the second half.",
            "date": "2016-10-25T07:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 232593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232593"
        },
        {
            "content": "the progress walk in a fast-pace so it's not boring to watch\r\neach abnormalities are very unique\r\nthough the ending is a real cliffhanger, but i think there would be another season so it's alright",
            "date": "2013-01-01T10:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 82228,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932752.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EteheralForm",
                "username": "EteheralForm"
            },
            "url": "https://myanimelist.net/reviews.php?id=82228"
        },
        {
            "content": "The second season of Medaka box. Those who watched the first season might have been a little disappointed at first, Cause the story basically takes a bunch of episodes till it gets interesting. Season 2 of Medaka box is where the real fun starts and slowly starts to build up towards the more interesting and awesome parts of the manga. \r\nI for one read the manga and seeing as how nearly the manga and anime are the same I can say for certain that people will really enjoy this New season. \r\nSo far there's not a thing that I didn't like in this show andif your like me and love interesting characters and over the top weird yet interesting powers like this show has u will love it! Especially in the later episodes of this show!\\n\\n\r\nI must warn u though, Instead of fighting scenes where it goes on without much talk in it.Medaka box isn't like that. It's more of an explaining fight moment thing u will see everytime\\n\\n\r\nHope u found this review usefull and if not then ''Kumagawa Misogi'' will get u\\n",
            "date": "2012-11-16T16:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 77725,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356168.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yurihyuuga",
                "username": "Yurihyuuga"
            },
            "url": "https://myanimelist.net/reviews.php?id=77725"
        },
        {
            "content": "I've also done a review for the first season so if you want to see that, just go look for it. Yeah.. this is a sequel so watch the first season if you don't want to screw yourself over this series by watching the sequel first. \r\nAs expected for a sequel, Medaka Box Abnormal picks up where the last season left off and it turns out that a whole new plot developed from the previous events. As I watched the first episode, it felt kind of different and I was surprised that it was already intense right at the first episode. Unlike the last seasonwhich was progressively intense, this one turns out to be a true sequel and continuation. As I have said, the plot of the series has become entirely different from the initial depictions. From a funny daily school student council shenanigans story into a fully pledged action and shounen setting. Though the story has become somewhat different, the art is still the same though it improved a bit on the animations. The new opening is much better than the last season's so this one was catchier. For the characters, yes the main characters are still there so no need to worry about that. But however, a lot have been introduced since the plot has become different so expect a lot of connections to the previous season. I might have enjoyed this season more than the first one since this series decided to show its true colours by unleashing the hidden shounen power that it was subtly hinting in the first season. Well that sounds a bit too shounen but you'll understand that if you watch it. One thing I didn't like about this was that the conclusion was not somehow the real conclusion and there will be more to this series. I was really confused about the final episode and maybe it was trying to hint a sequel? Well.. I don't really have my hopes up but even though this series was predictable as a shounen anime, I did enjoy it quite a bit.",
            "date": "2018-05-04T17:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 279781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=279781"
        },
        {
            "content": "I don't know how Nisio Isin--who has a history of writing complex, sophisticated, and intensely original things like The Monogatari series, Katanagatari, and the Zaregoto books--could write something as idiotic and generic as this show. The first season was awful school life, with bad gags, a ridiculous plot, and none of the clever writing I sort of expect from Nisio Isin; this season had all the same problems except now it's a mediocre battle-anime. I don't know what went wrong, but considering how good this could have been, it's really a shame.",
            "date": "2012-12-26T00:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 81366,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/icovoc",
                "username": "icovoc"
            },
            "url": "https://myanimelist.net/reviews.php?id=81366"
        },
        {
            "content": "Medaka Box Abnormal was 10x+ better than Medaka Box (aka season 1).  It was a little darker and more violent with suped up abnormal teens fighiting each other.  Think of MB as an introduction or set up to MBA. Every aspect was good to excellent in my opinion save maybe the last episode.  I mean wtf was that?  I've never seen a last episode that didn't have any of the main characters or the title character in it.  I'm completely over wondering OVAs aren't released with the series. Episode 12 truly annoyed me. Don't get me wrong, it was interesting,but it's placement was annoying especially if there isn't another season. Overally, I enjoyed Medaka Box Abnormal and hope there is a 3rd season.",
            "date": "2012-12-29T01:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 81804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1739023.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dragynfaerie",
                "username": "dragynfaerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=81804"
        },
        {
            "content": "This Series is a sequel to 'Medaka box' There is some humor in the game, rarely romance and a lot of action. The story is pretty much about Kurokami, Medaka finding out she is not the only one that is different from normal students. Though she been invited which barely been talked about at the end of the 1st series along with her 3 friends wanting to keep by her side. To me the story is good, so is artwork but what fails me is where is mainly to due with 'Abnormal' Is ridiculous overpowered and also making it hard for the other 3 maincharacters to be in spot light this rather made it disappointing to me.",
            "date": "2015-05-12T12:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 187680,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4590111.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cursedprince91",
                "username": "Cursedprince91"
            },
            "url": "https://myanimelist.net/reviews.php?id=187680"
        },
        {
            "content": "Very good overall story of a girl who wishes to be normal, but by all standards she is anything but. It really gives a good focus on her learning from the others, who like her, are not normal humans. The fights are amazing, if you really like fighting anime, you would be very happy here. There are some traces of ecchi, but not to the point some other series go to. Hopefully anyone who watches this can really get some enjoyment out of it.",
            "date": "2013-01-04T17:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 82648,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1988108.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kierran5",
                "username": "kierran5"
            },
            "url": "https://myanimelist.net/reviews.php?id=82648"
        },
        {
            "content": "Medaka Box Abnormal is the second season to the slice-of-life series Medaka Box. Unlike its predecessor, however, it tackles much darker themes and finally gives us a reason for why Medaka acts the way she does. Minus the stripping, of course. \r\nStory: 6\r\nAlthough it differs greatly from the school comedy genre, the story is very typical shounen. Some villain, in this case a man with the personality of Gilgamesh and the ability to control people, wants to create the perfect human by sacrificing the students of Hakoniwa. Medaka is the key to this project, and when she refuses to join, many battles ensue.\r\nSound: 7\r\nThere wereonly a few songs that stood out to me, but they were perfect for the what they were trying to convey. The voice actors did a good job capturing the emotions of the characters and the opening (Believe) was enjoyable.\\n\\n\r\nCharacter: 9\\n\r\nThis is where Medaka Box Abnormal really shines. It makes you think about why people act in a certain way. The backstories of the villains are so well done that you can't help but wonder if they are actually bad people. Not to mention the variety of powers they have. Most of the time, I felt like I was watching the show to see what power the villain would have next, rather than seeing where the story goes. Also, all of the main cast get their own backstories. Let's just say that even though I hated Medaka from the first season, the second season made me think she's actually not that bad and feel sorry for her.\\n\\n\r\nEnjoyment: 8\\n\r\nI definitely enjoyed watching this series, and even if you haven't seen the first season, there's nothing wrong with jumping into the second.\\n\\n\r\nOverall: The only problem I had with Abnormal is that the story is just a build-up for a third season that may or may not happen. Which is sad, because the Minus arc is really where the story gets good.",
            "date": "2013-12-19T13:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 124645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3406891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Voltundra",
                "username": "Voltundra"
            },
            "url": "https://myanimelist.net/reviews.php?id=124645"
        }
    ],
    [
        {
            "content": "(Please Note: may contain light spoilers) \r\nI personally have been looking forward to this season since the day it was announced. I’m sure I can’t say the same for those of you who poorly rated or just plain dropped this anime during its first season for reasons that include but are not limited to:\r\n1) the Art\r\n2) The gags that aren’t funny\r\n4) The stereotypes\r\n5) The setting\r\n6) Your hatred of the main character\r\nThese are all fairly reasonable things that would turn off any hardcore anime lover who has watched such a series. However, for those of you who think that this season will be just as mucha waste of time as the first season, let me just say this: \\n\\n\r\nTHIS IS WHERE SHIT GETS REAL!!!!!!!!!!!!!\\n\\n\\n\r\nStory:\\n\r\nThe story takes place at Hakoniwa Academy right after Medaka beat the ever-living shit out of Unzen of the disciplinary committee because of a freaking dress violation. Of course she gets called to the principal’s office not to get scolded for destroying half the school, but rather to take Unzens place in a little project known as the Flask Plan. Now what is the Flask Plan you may ask? It’s an experiment were the goal is to produce a potion that will turn anyone who drinks it into a genius. \\n\\n\r\nIn order to accomplish this goal, the principle has gathered 13 students who (aside from being fucking trolls) are overpowered super geniuses and is using them as the foundation of the plan. They are called the 13th Party. One problem though, once a formula is actually made, the students at the Academy will be used as test subjects and most likely won’t survive. Realizing this, Medaka takes it upon herself and the student council to investigate the plan and find out what is REALLY going on behind the scenes of their school.\\n\\n\r\nThis season is equivalent to the Water 7 arc in One Piece and the Mukuro arc in Hitman Reborn. It’s were the pace of the story picks up, suspense builds, tension rises, shocking truths are revealed and some of the most interesting battles take place.\\n\\n\r\nYes you read that last part right, this is where your cheesey, tasteless, annoying little school life story turns into what it truly was meant to be: One of the most engaging and original Shounen Battle series to be created. \\n\\n\\n\r\nCharaters:\\n\r\nOne of the main problems with season 1 is that it only covered a small section of the manga. We were given the premise of the series but specific details regarding the characters and events of the past were only mention briefly in the last few episodes. This time, however, more details are given us regarding the main cast:\\n\r\nMedaka- We find out more about her family and abilities\\n\r\nZenkichi- We discover how hard he’s worked in order to stay near Medaka since they were 2 \\n\r\nAkune- We find out about how he was in middle school and why he’s so infatuated with Medaka\\n\r\nMogana- We find out about what Medaka means to her as a friend\\n\\n\r\nYou could call the 13th Party the villains of this arc but as time goes on that line will just get more and more blurred because their back stories and past are revealed to us. Whether or not these students were born lucky or cursed is rather hard to say. They can do the seemingly impossible easily and it’s as though no matter what they do, they will succeed regardless of luck or skill (they can, for example, roll a bunch of dice and defy the laws of physics).  But whether or not they are happy with what they are is one of the big questions that will get addressed here. I’ll try to summarize a few of these “students”:\\n\r\n- A psychic super saiyen\\n\r\n- A masked midget\\n\r\n- A black guy, with a Japanese name who speaks French\\n\r\n- A mass murderer\\n\r\n- A chick with a knife in her head\\n\r\n- And a cyborg\\n\r\n(Note: I am not kidding about ANY of these things but maybe now you can see why GAINEX decided to animate this series)\\n\\n\\n\r\nMusic and Art: \\n\r\nThe artwork is the same as first season so if that was an issue before then too bad. The opening and ending themes, however, sound a bit darker than the previous seasons. Overall I find them better than the first seasons.\\n\r\nP.S. If you’ve read the manga then you’ll know how badly GAINEX is trolling us with the opening. For those of you who haven’t read the manga then just pay CLOSE attention to the characters that are shown (especially the last one).\\n\\n\\n\r\nTheme:\\n\r\nThis plot actually brings us back to the idea of perfection that was shown to us in the form of Medaka. Season 1 was all about revealing the characters and enforcing the idea that Medaka is perfect by comparing her to normal people. The fact that we’re suppose to hate the main character shows that we would rather have someone who works hard but falls flat on their face, then a hypocritical, perfectionist who always wins like Medaka. \\n\\n\r\nThis season, however, is about understanding that Medaka isn’t the only broken character in the series and that she didn’t ask to be how she is. There are a lot of things that we can’t help: what kind of parents gave birth to you, what era you were born into etc. But what this season tells us is that sometimes we can’t choose whether or not were born with talent and, if we are, will that automatically make us any happier than anyone who wasn’t? Will having a body that can make you move instantly on reflex make you happy? Will having the power to read minds make you happy? Will having the ability to master anything and everything you see make you happy? Or will it just make you feared and viewed as something abnormal?\\n\\n\r\nEnjoyment:\\n\r\n I for one, as a fan of the manga, find this season pretty enjoyable. At the very least if you’ve watched the first season and/or read the manga then watch this season if only to find out what this anime is REALLY about.",
            "date": "2012-11-27T18:44:00+00:00",
            "helpful_count": 137,
            "mal_id": 78559,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1164769.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/edorcean100",
                "username": "edorcean100"
            },
            "url": "https://myanimelist.net/reviews.php?id=78559"
        },
        {
            "content": "Medaka Box Abnormal is the sequel to Medaka Box, so if you haven’t watched that, don’t bother with this anime. As a proper sequel, it picks up where the first season ended, however the main genre is very different than the first season. It turns the first season into a sort of lengthy introduction and puts emphasis on battles and “abnormalities” (strange inhuman abilities based on nature aspects) of individuals compared to the first season that focused on humour and SOL. Nearly every mainstream shounen does this, but this anime does it on a completely different level, what makes many people dislike it. But itisn’t serious and it never tries to be so it shouldn’t be taken seriously or people will be very let down.\\n\\n\r\nThat “light” feel is taken into the story as well with it being a bit cliché, while it raises very interesting questions. Is it right to be strong without doing anything for it? To Medaka and Zenkichi, two of the main characters, it’s something people shouldn’t even think about because getting stronger and suffering go hand in hand. Of course, they are bound to meet people that think otherwise. This is the first moment where people turn away from the show with rolling eyes. It’s because of how it’s handled. Surely, with Medaka being able to do inhuman deeds simply because she was born with it, she isn’t the right person to tell others that they have to suffer to get strong.\\n\\n\r\nHowever, if you don’t turn away so fast, you’ll see that there’s much more to Medaka Box Abnormal than just hypocrisy. Here comes Zenkichi, the other lead character, who is the exact opposite of her talent wise. He might be strong, both physically and mentally, however it is mentioned, not once, that he got there by hard work and was very weak during his childhood. Unfortunately, the rest of the main characters don’t do the themes justice as most of them are “specials”; very talented people or abnormals. Of course, most of the time, they can’t rival the abnormals that are villains.\\n\\n\r\nOne of the biggest problems I had with the story was how all themes were presented. Medaka Box Abnormal sure deals with very interesting issues but they are usually solved by main characters simply stating their opinion, even though villains keep asking better and better questions. The difference between the “good” guys and the “bad” guys is nothing but the way they answer them. That wouldn’t be such a problem if the show didn’t portray the main character’s opinion as the right one and everything else as wrong and it goes as far as Medaka deciding what’s right for the rest of the world (that doesn’t make her think about it even for a bit).\\n\\n\r\nArt doesn’t really help its case. It might look really strange and it’s difficult to get used to it but once I did, I fell in love with it. Animation is fluent and very well done. There’s lots of fanservice but it doesn’t feel overdone or annoying because it’s usually played for laughs. \\n\\n\r\nWhile it might look like a huge mess, and it somewhat is, most of it is done supposedly to create a comedic effect. However, not everything looks like it’s trying to parody itself. Character interactions and presentation is probably the best part of the anime. While characters themselves aren’t something to remember, their relationships and feelings are delivered perfectly. You can see how they feel about what they say or about what is happening or simply know their nature by their actions. I found this to be the best part of Medaka Box Abnormal because to me it felt more real than most of SOLs I’ve finished and it made the anime more enjoyable.\\n\\n\r\nMedaka Box Abnormal is definitely not a perfect anime. It’s difficult to like because it tries to jam too many genres together and never truly focuses on one. And even when it does (for a while) it usually overdoes it for bigger effect. However, if you do find something enjoyable about it, stick until the very end because it won’t go away easily. I recommend this anime only if you’re bored or open minded.",
            "date": "2012-12-29T14:07:00+00:00",
            "helpful_count": 39,
            "mal_id": 81854,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SuiNoByakko",
                "username": "SuiNoByakko"
            },
            "url": "https://myanimelist.net/reviews.php?id=81854"
        },
        {
            "content": "Now that this sequel has ended, so it's time to make a review of this thing and i gonna go straight to the point for every category of this anime, oh there maybe some spoilers that I may have placed:\r\nStory: Good 7 .\r\nBasically, it still has the same genre and it is still set in the same school with a very lame name,\" Sandbox Academy\"- unless it is a daycare center, who the heck gives a school with a name like that? What's added here are lousy terminologies like Flask Plan, Abnormals and 13 party or Class 13. However unlike the previous season this onehas more action in which the focus is no longer on Medaka (or at least for the most part) instead each member of the student council who were fighting along side her, has a piece of the action and a little bit of the drama. But what makes the action genre in which the group plans to destroy the so-called 'Flask Plan\" of this anime good, is that the setting of the action   sort of have a slight resemblance of  Bruce Lee's \"Game of Death\"  HAAAAAAAAYA!!!! But with a certain twist of course. \\n\\n\\n\r\nArt and sound: Mediocre 5.\\n\\n\r\nWell, it is still the same art used from the previous season and it still has the same amount of fanservice. There are the usual seiyu's who did the voices of the protagonists and I don't give much of the damn about the seiyu's who did the voices of the antagonists, as for the opening theme....I hate it, the ending theme....I like it.\\n\\n\\n\r\nCharacter: Fair 6.\\n\\n\r\nOn Medaka, she is still this heroine who is sooo perfect that there is nothing she can't do and won't do thingy as usual, but, in this sequel she underwent the same unwritten rule that every protagonist have to undergo which is that a protagonist have to face such seemly difficult odds in which he/she is nearing defeat which the audience feels the protagonist's suffering and then the climax, the protagonist rose up in victory. Then again the ration of the protagonist nearing defeat in some difficult odds and rising up in victory was not well balance, in fact for Medaka to emerge victorious is seemly too obvious to the point that we the audience don't even felt her suffering and it easy for one to brush it aside.\\n\\n\\n\r\nZenkichi Hitoyoshi- as usual he is still Medaka's Guard Dog and still serving as \\n\r\nStudent Council General Affairs Manager, unlike in the previous episode here he was now kicking ass and exhibiting his special ability. As usual I'll never understand author, Nisio Isin   as to why he as to insist that the character is a practitioner of Savate when his fighting style is no different that any other anime with a martial arts genre. What I like about him is Medaka having feelings for him and seeing him hugging her.\\n\\n\r\n Mogana Kikaijima-  The Student Council Treasurer, what's good about her was her reaching out to Yukuhashi which to me is cute, she probably the weakest among the group with only a sonic boom as her weapon and being able to breath like a fish (figure of speech). Since this anime has an ecchi genre and Medaka is the most ecchiest, she is more like the runner up of the ecchiest cast of this anime.\\n\\n\r\n Kouki Akune- the \"Destroyer\" I like his nick name, I like the part that he goes fighting this cyborg chick Itami Koga, it is basically nice that he was able to display his fighting ability and be able to do as to what was expected of his reputation.\\n\\n\r\nIn the previous season of my review, I gave this category a low score, but having seen the other protagonist given their share of the lime light the score belongs to Medaka's subordinates.\\n\\n\\n\r\nEnjoyment: Good 7.\\n\\n\r\nI admit, I do find the ecchi and the martial arts part of this anime good, frankly that's as good as it get, besides this sequel ended in a cliffhanger in which the last episode was about Misogi Kumagawa, Najima Aijimu and Saki.\\n\\n\\n\r\nOverall: Poor 3.\\n\\n\r\nOk, thought the story is good the action and ecchi are alright, the thing about this anime is that it has a lot of useless terminologies that were carelessly used by the author Nisio Isin, terminologies that complicates this anime and manga as a whole, in fact the said terminology \"Abnormal\" vs Normal vs Special doesn't actually categorize the students in fact even though the character's info mentioned that this character is an abnormal one would be surprise that the said character can be taken down by a protagonist who is normal. It is very disgusting that the author himself uses one conflicting  terminology to explain another conflicting terminology. Frankly the author is simply banking on the the main protagonist's ability to be the student council's president as this girl who is the very essence of a perfect and domineering  apex bully, of course there is the fanservice that comes with it, but overall with the cliffhanger, this sequel lacks a very good surprising climax .  \\n\\n\\n\r\nWill there be another sequel? Well, it looks like it.\\n\\n\\n\\n",
            "date": "2012-12-28T10:59:00+00:00",
            "helpful_count": 33,
            "mal_id": 81694,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 3,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=81694"
        },
        {
            "content": "I'll try to be brief, since this anime doesn't deserve a thorough review. \r\nI prefer the first season, as there, the author did not attempt to exceed their capacity until the last few episodes. Here, the story is \"serious\" from the beginning, making any and all issues glaringly obvious. \r\nFirstly, the characters are designed in an irrational way and often behave inconsistently. This both reduces the effectiveness of intentional humor, as well as interferes with \"serious\" story developments (or let's just call them 'non-comedic' since you can't take anything seriously in this anime).\r\nSecondly, special skills and other plot devices are explained with pseudoscience, which ispure torture, as I love science and 'realistic' sci-fi and hate pseudoscience with equal passion. It would be better if the author had just pulled the 'magic' card without trying too hard to explain the mechanism behind any ability or drug or whatever, since they obviously lack basic education on how things work in the real world.\\n\\n\r\nIf you liked the final episodes of the first season more than those preceding them, you may very well enjoy this season even more. If not, you may want to steer clear to avoid wasting time like I did.",
            "date": "2018-09-14T14:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 289010,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/122026.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/VVayfarer",
                "username": "VVayfarer"
            },
            "url": "https://myanimelist.net/reviews.php?id=289010"
        },
        {
            "content": "How do you define an \"ideal\" human being? The perfect human understands his reality. All that we see as art, aesthetic, is just applied excellence. People always have to train to be the best at something, No one is born excellent, Some are born closer to and have an easier time acquiring skill. So, to think of perfection as something unnatural or Godly, would be to misperceive the reality of the matter, right?\r\nThe second season of medaka box, dubbed ‘Abnormal’ resumes following the somewhat mindblowing conclusion to the first season which saw a complete half revolution turn in the emphasis and plot of the wholeseries. In the second season we are introduced to a world of normal, specials and abnormals.\\n\\n\r\nNormals here are defined as everyday folk such as myself and maybe even you, Specials are people who greatly excel in a particular field and Abnormals from their name itself we can guess possess some sort of strange ability and able to achieve great feats that leave us normal folks dumbstruck. One factor I was greatly impressed with about the abnormal abilities was that the series tries to explain to us the mechanics and how these abilities work and unlike most shows that introduce some kind of wild out outrageous and thought provoking phenomenon to do this, medaka box simply uses Biology and Anatomy. The abilities are explained as being born from some sort of efficiency or deficiency of an organ, enzymes or muscle in the body. This greatly enhances a viewer’s experience and even gives the show (dare I say it to a shounen anime) a sense of realism. \\n\\n\r\nA scheme is later hatched by the principal called the ‘flask plan’ to perform research on a few Abnormals in the school so as to find out how abnormality works with the main aim of discovering some kind of method to transform normal human beings into abnormals or in other words make them perfect. The scheme itself i’m afraid to say isn’t necessarily original and without a doubt is a slight alteration from the all too familiar concept of a group of individuals who believe themselves greater than normal humans decide to rule over them. The principal also intends upon making this discovery to use the students of the school as test subjects for his experiments which could have adverse effects on them, and upon getting word of this of course, the student council consisting of medaka and co. try to stop the plan.\\n\\n\r\nThe highschool is divided into 13 sub classes ranging from numbers 1-13 and as it also happens, all the abnormal students are in class 13 of their respective grades. A group of these students have been selected to be the roots of the flask plan called the ’13 party’ and medaka’s objective will be to defeat this group thereby bringing a halt to the project. At the end of the first season we witness medaka defeat Unzen and at the start of the second season we are told that Unzen was a part of the 13 party, however due to his defeat he is unable to participate anymore and Medaka being the one who defeated him is now the most likely beneficiary to take his place. Feeling proud of their abilities most of the students in class 13 hardly come to school but upon hearing of the experiment most of them return with the prospect of attempting to take part but just as Medaka defeated Unzen to enter contention, they also believe they need to defeat her to have a chance to join, therefore presenting medaka’s group with a sizable amount of opponents. This of course was nothing more than to show us indeed how powerful Medaka was when compared to other abnormals and also for the viewer to hold highly in prospect the other members of the 13 party upon their introduction. \\n\\n\r\nThe school setting itself is seemingly devoid of teachers or any kind of academic activities for that matter. The main base of the experiment itself is an underground base on the campus; the base is divided into floors each holding one member of the experiment meaning medaka has to defeat them floor by floor making the series hold a sort of platform game feel to it which isn’t such a good idea. However giving the modern school setting and having super powered individuals, there will be a need to make use of an enclosed environment to demonstrate these abilities so the writers had a limited amount of choices in terms of location.\\n\\n\r\nGainax resume their duty of animation but however I will admit I’m not a fan of the art style used in the show, the use of extremely heavy pencil lines especially under the eyes give most characters a wild expression making them look as though high on cocaine with only voice actors and changes in facial expression making it otherwise. However when compared to some mediocre animation we saw in the first season, Gainax did a great job with animation on the second season. It has a number of fluid and nicely orchestrated action sequences here and there but these action sequences may seem dragged on a times by no fault of the animation but by characters overlooking a fight giving commentary on almost every little factor, something that should have been kept to a minimum or removed completely.\\n\\n\r\nMinami Kuribyashi resumes her role as she again sings the OP, entitled ‘Believe’ and unlike the first season’s OP that had a happy-go-lucky beat and feel to it, this one had more of a melodramatic and serious tone thus accurately depicting the complete shift in emphasis of the series. BGM mostly consisted of instrumentals and the sound director does well to appropriate each instrument well into a scene. Tension, suspense and other moments are most of the time complemented with a nice instrument to get a better feel of the atmosphere but the series still could have done better with its choice of soundtracks.\\n\\n\r\nThe show also takes pride in its host of very peculiar and strange set of characters with their differing ideals and philosophies on humanity. Medaka herself retaining her honest do-good attitude has this stubborn ideal of believing that all humans have some good in them and will a times go to whatever length to protect this ideal, often times purposely falling into enemy traps which looked to me nothing more than a weak excuse to extend the story. Her tenacious personality may come off as a bit annoying a times but her die hard attitude will leave most people wanting more. Most members of the 13 party will leave audiences absolutely dazzled, just as it’s depicted in the show that normal people see them as amazing or on another level, I have to admit even I sitting on the other side of the screen could also tell. The show uses the personality of these characters very well to keep viewers hooked to the screen and this factor was without a doubt the series strongest point.\\n\\n\r\nThe beginning of the show I have to admit was amazing but as time went on it started to lose quite a bit of edge especially towards its climax but it was still an enjoyable experience in the end. The series main problem was not as a result of its execution or anything it could help but in my opinion the writers seemingly not giving enough thought or effort into the storyline towards the ending as they did initially and seemed to be running out of ideas along the way and finally adopting cliché basic shounen analogies in the end. Despite all this, it still manages to impress with its fluid animation, applied sciences and extremely strange set of characters. The second season was without a doubt a lot better than the first and with more material still to be animated we can only expect things to only get better in future.\\n",
            "date": "2013-01-16T12:36:00+00:00",
            "helpful_count": 16,
            "mal_id": 83855,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1019085.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zee530",
                "username": "Zee530"
            },
            "url": "https://myanimelist.net/reviews.php?id=83855"
        },
        {
            "content": "Following on from the prequel, the story picks up straight where it left off, and if you had any questions, they'll begin to be answered.\r\nThe school is a mess and Medaka starts learning about herself, while we start to learn about Normals, Specials and Abnormals. \r\nRight away they aren't afraid to throw in people with abilities, which we're just learning about, so in some ways it feels like a completely different anime with the same characters, but it all starts to come together. \r\nThe dub voice sync is still a bit off but it's not a big deal.\r\nOne thing about the battles, is that eventhough they basically kill each other, afterward Medaka or Zenkichi will offer friendship. All most of these people want is to feel normal and have friends, and all they want is to offer that, even after everything. It's one of the charms that I enjoy about this series. \\n\\n\r\nThis season is in a way completely different to the first like I mentioned before. I feel like the first season was good in it self, but it let down on the build up to this season. Which was better than the first, though the disconnect between them both and the weird flow makes it hard to rate this and review for others.\\n\\n\r\nIn the end if you've watched the first season, this is worth watching to finish the story. There's a lot more action and can get pretty intense for the second half.",
            "date": "2016-10-25T07:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 232593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=232593"
        },
        {
            "content": "the progress walk in a fast-pace so it's not boring to watch\r\neach abnormalities are very unique\r\nthough the ending is a real cliffhanger, but i think there would be another season so it's alright",
            "date": "2013-01-01T10:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 82228,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932752.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EteheralForm",
                "username": "EteheralForm"
            },
            "url": "https://myanimelist.net/reviews.php?id=82228"
        },
        {
            "content": "The second season of Medaka box. Those who watched the first season might have been a little disappointed at first, Cause the story basically takes a bunch of episodes till it gets interesting. Season 2 of Medaka box is where the real fun starts and slowly starts to build up towards the more interesting and awesome parts of the manga. \r\nI for one read the manga and seeing as how nearly the manga and anime are the same I can say for certain that people will really enjoy this New season. \r\nSo far there's not a thing that I didn't like in this show andif your like me and love interesting characters and over the top weird yet interesting powers like this show has u will love it! Especially in the later episodes of this show!\\n\\n\r\nI must warn u though, Instead of fighting scenes where it goes on without much talk in it.Medaka box isn't like that. It's more of an explaining fight moment thing u will see everytime\\n\\n\r\nHope u found this review usefull and if not then ''Kumagawa Misogi'' will get u\\n",
            "date": "2012-11-16T16:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 77725,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356168.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yurihyuuga",
                "username": "Yurihyuuga"
            },
            "url": "https://myanimelist.net/reviews.php?id=77725"
        },
        {
            "content": "I've also done a review for the first season so if you want to see that, just go look for it. Yeah.. this is a sequel so watch the first season if you don't want to screw yourself over this series by watching the sequel first. \r\nAs expected for a sequel, Medaka Box Abnormal picks up where the last season left off and it turns out that a whole new plot developed from the previous events. As I watched the first episode, it felt kind of different and I was surprised that it was already intense right at the first episode. Unlike the last seasonwhich was progressively intense, this one turns out to be a true sequel and continuation. As I have said, the plot of the series has become entirely different from the initial depictions. From a funny daily school student council shenanigans story into a fully pledged action and shounen setting. Though the story has become somewhat different, the art is still the same though it improved a bit on the animations. The new opening is much better than the last season's so this one was catchier. For the characters, yes the main characters are still there so no need to worry about that. But however, a lot have been introduced since the plot has become different so expect a lot of connections to the previous season. I might have enjoyed this season more than the first one since this series decided to show its true colours by unleashing the hidden shounen power that it was subtly hinting in the first season. Well that sounds a bit too shounen but you'll understand that if you watch it. One thing I didn't like about this was that the conclusion was not somehow the real conclusion and there will be more to this series. I was really confused about the final episode and maybe it was trying to hint a sequel? Well.. I don't really have my hopes up but even though this series was predictable as a shounen anime, I did enjoy it quite a bit.",
            "date": "2018-05-04T17:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 279781,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=279781"
        },
        {
            "content": "I don't know how Nisio Isin--who has a history of writing complex, sophisticated, and intensely original things like The Monogatari series, Katanagatari, and the Zaregoto books--could write something as idiotic and generic as this show. The first season was awful school life, with bad gags, a ridiculous plot, and none of the clever writing I sort of expect from Nisio Isin; this season had all the same problems except now it's a mediocre battle-anime. I don't know what went wrong, but considering how good this could have been, it's really a shame.",
            "date": "2012-12-26T00:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 81366,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/icovoc",
                "username": "icovoc"
            },
            "url": "https://myanimelist.net/reviews.php?id=81366"
        },
        {
            "content": "Medaka Box Abnormal was 10x+ better than Medaka Box (aka season 1).  It was a little darker and more violent with suped up abnormal teens fighiting each other.  Think of MB as an introduction or set up to MBA. Every aspect was good to excellent in my opinion save maybe the last episode.  I mean wtf was that?  I've never seen a last episode that didn't have any of the main characters or the title character in it.  I'm completely over wondering OVAs aren't released with the series. Episode 12 truly annoyed me. Don't get me wrong, it was interesting,but it's placement was annoying especially if there isn't another season. Overally, I enjoyed Medaka Box Abnormal and hope there is a 3rd season.",
            "date": "2012-12-29T01:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 81804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1739023.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dragynfaerie",
                "username": "dragynfaerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=81804"
        },
        {
            "content": "This Series is a sequel to 'Medaka box' There is some humor in the game, rarely romance and a lot of action. The story is pretty much about Kurokami, Medaka finding out she is not the only one that is different from normal students. Though she been invited which barely been talked about at the end of the 1st series along with her 3 friends wanting to keep by her side. To me the story is good, so is artwork but what fails me is where is mainly to due with 'Abnormal' Is ridiculous overpowered and also making it hard for the other 3 maincharacters to be in spot light this rather made it disappointing to me.",
            "date": "2015-05-12T12:40:00+00:00",
            "helpful_count": 5,
            "mal_id": 187680,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4590111.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cursedprince91",
                "username": "Cursedprince91"
            },
            "url": "https://myanimelist.net/reviews.php?id=187680"
        },
        {
            "content": "Very good overall story of a girl who wishes to be normal, but by all standards she is anything but. It really gives a good focus on her learning from the others, who like her, are not normal humans. The fights are amazing, if you really like fighting anime, you would be very happy here. There are some traces of ecchi, but not to the point some other series go to. Hopefully anyone who watches this can really get some enjoyment out of it.",
            "date": "2013-01-04T17:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 82648,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1988108.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kierran5",
                "username": "kierran5"
            },
            "url": "https://myanimelist.net/reviews.php?id=82648"
        },
        {
            "content": "Medaka Box Abnormal is the second season to the slice-of-life series Medaka Box. Unlike its predecessor, however, it tackles much darker themes and finally gives us a reason for why Medaka acts the way she does. Minus the stripping, of course. \r\nStory: 6\r\nAlthough it differs greatly from the school comedy genre, the story is very typical shounen. Some villain, in this case a man with the personality of Gilgamesh and the ability to control people, wants to create the perfect human by sacrificing the students of Hakoniwa. Medaka is the key to this project, and when she refuses to join, many battles ensue.\r\nSound: 7\r\nThere wereonly a few songs that stood out to me, but they were perfect for the what they were trying to convey. The voice actors did a good job capturing the emotions of the characters and the opening (Believe) was enjoyable.\\n\\n\r\nCharacter: 9\\n\r\nThis is where Medaka Box Abnormal really shines. It makes you think about why people act in a certain way. The backstories of the villains are so well done that you can't help but wonder if they are actually bad people. Not to mention the variety of powers they have. Most of the time, I felt like I was watching the show to see what power the villain would have next, rather than seeing where the story goes. Also, all of the main cast get their own backstories. Let's just say that even though I hated Medaka from the first season, the second season made me think she's actually not that bad and feel sorry for her.\\n\\n\r\nEnjoyment: 8\\n\r\nI definitely enjoyed watching this series, and even if you haven't seen the first season, there's nothing wrong with jumping into the second.\\n\\n\r\nOverall: The only problem I had with Abnormal is that the story is just a build-up for a third season that may or may not happen. Which is sad, because the Minus arc is really where the story gets good.",
            "date": "2013-12-19T13:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 124645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3406891.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Voltundra",
                "username": "Voltundra"
            },
            "url": "https://myanimelist.net/reviews.php?id=124645"
        }
    ]
]