[
    [
        {
            "content": "I'll try to get straight to the point with this review.  Before watching this series I had never read the manga nor had I ever seen anything about it beyond the wiki page for the show.  I thought it looked decent so I began watching.\r\nThe anime had a very promising first episode and the characters seems well thought out and reasonably likable.  I found it entertaining and continued onward.\r\nIt goes all downhill from there.  The plot starts out strong and then begins failing very quickly.  There is a massive amount of what I would claim is filler and you reallycannot see much progression at all in the story throughout the entire 1st and 2nd series.  (I just found out that the third was canceled &gt;_&lt;)\\n\\n\r\nBasically you could skip episodes 10-47 ish and still know whats going on.  The part that really got to me was how often they would play a song while slowly moving frames across the screen to take up time during an episode.  I know what the characters faces look like and I don't need to see close ups of them doing nothing for 10 minutes every episode.  They never even bothered to come up with new songs, just replayed them.\\n\\n\r\nIf you can sit through 52 episodes of sameness and you enjoy that feel free to watch.  I have nothing against the characters or the idea behind the show.  It just seems to me that they never went anywhere with it.  Maybe the manga is better, I wouldn't know.  Hope this review is helpful and not seen as a hate thread.",
            "date": "2007-11-03T19:12:00+00:00",
            "helpful_count": 265,
            "mal_id": 1205,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/George47",
                "username": "George47"
            },
            "url": "https://myanimelist.net/reviews.php?id=1205"
        },
        {
            "content": "Tsubasa RESERVoir Chronicle (TRC) - the anime - showed a lot of promise from its very first episode.  However, because of the fact that TRC is aired during the children\\'s hour in Japan, which limits exactly the kind of content they are allowed to put into this anime, as a result, have disappointed many viewers thinking they would be witnessing a story that was close to what was written in the manga by CLAMP.  However, despite all of that, Tsubasa Chronicle still shapes up to be a relatively enjoying series, if you can get through a couple of the more slower arcs andhorrendous fillers.\\n\\n\r\nFirst of, in case you did not know, CLAMP decided to \\&quot;recycle\\&quot; a lot of its characters from Card Captor Sakura and other anime in this show.  In essence, you will see a ton of familiar faces, but that\\'s all they are - faces.  For the most part they have completely different personalities and histories.  I don\\'t know if that\\'s because they ran out of ideas for completely new characters or not, but that\\'s just the way it is.  But don\\'t get me wrong, it\\'s definitely not a bad thing.  \\n\\n\r\nThe animation, as usual from CLAMP, is up to par with today\\'s standards and what today\\'s viewers expect from an anime.  It\\'s very crisp and clean and very colorful.  The relationship between Sakura and Syaoran is something you could shed a tear witnessing the trials they go through, but once again, the slowness of it all prevents a continuous enjoyment of that.\\n\\n\r\nYuki Kaijura has once again put together a very beautiful soundtrack to go along with this anime.  From the very first time the piece named \\&quot;A song of storm and fire\\&quot; is played with the anime, that alone will urge you to keep watching this anime.  However, this anime does progress extremely slowly at times, especially after the first arc and the fillers (you wouldn\\'t think there would be fillers in a 26-episode season, but there are) are extremely boring, possibly with the exception of one or two filler arcs.\\n\\n\r\nEven with all of that, its the animation and music that keeps Tsubasa RESERVoir Chronicles - the anime - alive and what keeps its viewers, in my mind anyway.  The story has the potential (well, it does if you read the manga) to be amazing, but the fillers and slow progress prevent it from doing so.  If you want to know what happens, pick up the manga and start reading it.  You won\\'t be disappointed.  The anime is something you have to be patient with.",
            "date": "2007-06-01T18:28:00+00:00",
            "helpful_count": 157,
            "mal_id": 339,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3959.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VK11",
                "username": "VK11"
            },
            "url": "https://myanimelist.net/reviews.php?id=339"
        },
        {
            "content": "I will be firm in saying that nobody, NOT ONE OF YOU would have given this anime the time of day if it hadn't recycled characters from better anime. \r\nCLAMP, in a move of sweeping lack of creativity, decided to make another franchise by reusing their old characters. I gotta say, smart move, CLAMP--your cash cow is ready to be chopped up and sold. \r\nAnd this is what Tsubasa Chronicle is: a sell-out. \r\nThe story is bland and boring. Dimension-travellers bound together for whatever reasons, but you know, viewers won't care because they get to see Sakura and Shaoran or whatever his name is gogaga over one another once again and two yaoi-fodder guys vacillate between passion and disgust of one another. \\n\\n\r\nThe art was mediocre. It wasn't good, wasn't bad. Nothing special. Like the sound. \\n\\n\r\nI cannot give the characters a good rating because they aren't characters. They are just themselves from the old anime transported to a new one to serve a purpose. They aren't developed, they aren't deep, it isn't good. \\n\\n\r\nI was yawning and scratching a lot while watching this--that can't be good. \\n\\n\r\nOverall, this is unfabulous crap. Don't watch it. Unless you're a CLAMP fan and you won't listen to me.",
            "date": "2008-10-26T11:23:00+00:00",
            "helpful_count": 138,
            "mal_id": 8997,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=8997"
        },
        {
            "content": "First of all I\\'d like to say that I have been a fan of Tsubasa RESERVoir CHRoNiCLE [ the manga ] since the beginning, I got out of it for a while and then got back into it and what did I find when I picked back up reading the manga? Well, I found out that TRC had been turned into an anime. I first I thought \"Great! I can\\'t wait to see everyone animated!\" but what happened when I watched \"Tsubasa Chronicle\" was indescribable. \r\nFirst of all the art was flat out BAD. The character\\'s look like noodles and their expressions and movements lookslabored and dorky. Second of all their voices aren\\'t the best thing in the world. And worst of all, the thing that made me want to pull my large intestine out and hang myself with it was that Bee Train/NHK absolutely BUTCHERED plot. There is no excuse for what Bee Train and NHK did to a simply epic story. The anime was filled to the BRIM with OOC filler episodes that completely messed with the characters of Tsubasa and characters from crossover series. Bee Train/NHK shoved a whole laod of relationships that aren\\'t supposed to be there into the series. \\n\\n\r\nThey actually went to the extent where they changed someone\\'s past. It was an epic failure and yes: CLAMP themselves disowned the anime. Thankfully CLAMP has been working on a wonderful looking set of OVA\\'s called Tokyo Revelations. I\\'ve seen pictures of what the animation looks like and I can say right now that the art of the OVA\\'s is going to be phenomenal. No more overly scrawny characters. And the best part about the OVA\\'s is going to be that they actually follow the correct plot.  Bah. I REJOICE almost every day because season three of Tsubasa Chronicle was canceled. The anime is severely deprived of the true plot. Tsubasa Chronicle really does not reflect the true beauty and qualities that fans have been following in Tsubasa RESERVoir CHRoNiCLE for years. I was actually very dissapointed as I was looking forward to Tsubasa being animated, but alas, this is what I got.\\n",
            "date": "2007-07-31T18:07:00+00:00",
            "helpful_count": 95,
            "mal_id": 639,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8873.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Altomare",
                "username": "Altomare"
            },
            "url": "https://myanimelist.net/reviews.php?id=639"
        },
        {
            "content": "***A word to the wise: You should probably only read this review if you haven't read the manga version. If you HAVE read it, and have an open mind, then my review will probably help too***\r\nI've seen a few animes that have been based off of mangas [it seems like less and less anime these days are original] and it is very rare that the entire plot line will be in the anime. I was delighted with Itazura na Kiss because for the most part, it does follow the manga version very well, and the characters look the same in both anime and manga. \r\nAsfor Tsubasa Chronicle, I have only glanced at the manga and never read it. However, I know how it is to read a manga, see the anime version, and be very disappointed. That is why I said if you have read the manga, you should probably not watch Tsubasa Chronicle, for you will be very upset. I know that it strays from it's original plot, but if you have just finished, say, Cardcaptor Sakura and want to watch the &quot;next&quot; thing, then I highly suggest Tsubasa Chronicle. Here is why. \\n\\n\r\nStory: The story follows Syaoran and Sakura from Cardcaptors, but that is all they are. Their appearances are of a teenage Syaoran and Sakura, but their personalities are in no way the same, except that Sakura is still sweet. Syaoran does not still have that awkward temper of his from Cardcaptors, so when you are watching this anime you kind of forget who their original characters were [which is a good thing, because if you didn't, you'd watch the series very disappointed that Sakura isn't with Kero-chan whipping out Sakura cards with Syaoran trying to confess to her :p]. Anyway, Sakura has lost her memory through feathers that sprouted into wings out of her back, and Syaoran travels with the memory-free Sakura through different worlds to collect the feathers and return her memory. However, in exchange for being able to save her, Syaoran has to agree to let the memories of him be erased from Sakura's memory [and it is highly hinted that Sakura is in love with Syaoran, who, judging by his actions, is also in love with her]. So this time around, it is Syaoran fighting, and not Sakura. It's a good story, because traveling to different worlds is very interesting to watch. Instead of being like a normal plot line where you get a different world for every episode, they will stay in one world for around three episodes and develop characters in the other worlds, which I think is very interesting and nice, because normally anime only focuses on the central characters.\\n\\n\r\nArt: Some people complain about the art. It is a little quick looking because their limbs are long lines with large hands, but I actually like it. It's a nice change from the usual super-detailed Clamp because it makes the characters move a little better and it looks a little more updated. I'm not saying it's the best ever, but it honestly doesn't bother me. There is still a lot of super-detailed Clamp things like the clothing, magical items, etc.\\n\\n\r\nSounds: The music is beautiful. It does get used a lot, the same thing over and over I mean, but all in all it's really pretty and epic. It's not something you'd expect from this anime, and I like the recurring themes so much I don't mind if they get played again.\\n\\n\r\nCharacter: I personally like this Syaoran. He is a little predictable, but he is tough and fights with all of his heart to find Sakura's feathers, even though he has no motivation but to save her, since she has lost her memories of him. It is his love for her that makes him different from usual characters. He's not weak, he doesn't back down. All he needs is to look at Sakura and he is filled with the spirit to fight for her. Sakura, if you'll pardon me, reminds me greatly of Chi from Chobits when she loses her memory. If you watch the anime, you'll see what I mean. I half expected her to go &quot;Chiiiiii?&quot; every time she saw something like a bird or a new person. Thankfully, she doesn't go so far as to refer to herself in third person. She does, however, get the same happy, dazed looks that Chi gets, and smiles a lot which seems to turn even bad guys good. But hey, it's still Clamp after all. ;-]  Sakura and Syaoran are also joined by Fai, who is a delightfully carefree magician that is so classic with Clamp because of his easy-going nature, and Kurogane, who is a tough warrior that works together with Fai and brings a lot of the comedy to the story. Mokona from Rayearth is also there, and he is just soooooo cute. :D You will see a lot of characters from other Clamp works, but be warned: THEY ARE NOT THE SAME. They only LOOK like their original characters, but their personalities are different. Although it has to be said...Yukito and Sakura's brother from Cardcaptor sort of hint at their original characters, especially when you see them in different worlds. :D\\n\\n\r\nEnjoyment: So far, I'm enjoying it. Everyone said that I would hate it after I'd seen 10 episodes, but I am on 13 and still like it. I know I'll finish it. I mean yes, a lot of time is spent panning character's faces and doing flashbacks to the previous episode at the beginning of a new one, but if you skip it and just put up with a lot of zooming in on Syaoran's face, then you'll be able to finish it too. I have to admit, it is the worst zooming-in-on-a-character-to-use-up-time I've ever seen, but I just try to ignore it. But hey, I still look forward to each episode, so obviously it's not as big of a deal as everyone says it is.\\n\\n\r\nOverall: Like I said at the beginning of my long review, just watch it if you haven't read the manga. It really is a good story if you just treat it like an anime and not an anime based off of a manga. Albeit the long pauses on someone's face, the repetitive themes, and the flashbacks, I'm still enjoying it. And I've given up animes before that were far worse. So give it a shot and try to finish it. ;-]",
            "date": "2008-10-04T13:56:00+00:00",
            "helpful_count": 38,
            "mal_id": 8414,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60810.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mantret",
                "username": "Mantret"
            },
            "url": "https://myanimelist.net/reviews.php?id=8414"
        },
        {
            "content": "\"For all my life... I've wanted strength. I didn't want those things precious to me to be taken away from me anymore. But, to have strength means to invite disaster to come to you. And strength alone can't really protect you.\"\r\nTsubasa Reservoir Chronicles... took me a while to get into it. I don't really know why, but I feel like it might have just been because of the slow start, but it also might have been because of the slightly cliché story. However, once I started paying more attention, it got more interesting with every episode. The story unfolded a little more, the characters gotmore lovable, and the fight scenes got a lot better. So, without further ado, let's get this review started, shall we?\\n\\n\r\nAs I previously stated, the anime had a bit of a slow start, and the story was a bit of a cliché. It's about a boy and a girl. The boy being a villager, the girl being a princess. Both have been best friends since they were children. One day, the princess and the boy spend the day together, the princess having something supposedly important to tell the boy, but is not able to. That night, an unknown magic force calls the princess, and a ritual is performed. However, the boy saves her before the ritual is completed, but she looses every single one of her memories. The kingdom's priest then teleports the two of them to the Dimensional Witch, where they are also greeted by two others meeting with her, one a swordsman, and the other a mage. The Witch then tells the boy that in order to help the princess regain her memories, they must go dimension hopping, but at a price. In order to have the power to do that, the boy must give up all of the princess' memories of him. Even if they recover all of her memories, she will never remember him. He agrees, and the story is about the princess, the boy, the swordsman, and the mage as they all travel together, looking for her memories. As they go dimension hopping, they run into trouble nearly every world they visit, and help out the people of that world, involving overthrowing evil rulers, stopping a gang war, and fighting demons. Like I said, the whole \"Girl loosing her memory\" is a bit of a cliché, but their journeys together make it a lot better.\\n\\n\r\nI liked the artwork a lot. The anime was made by Bee Train, the studio behind Phantom ~Requiem for the Phantom~, Murder Princess, and the .//hack series. The artwork in Tsubasa reminded me of all of the other animes that Bee Train made, so it felt familiar to me. For those of you who have watched those other series as well, if you enjoyed them then you're going to be satisfied with the artwork of Tsubasa.\\n\\n\r\nI own both seasons of Tsubasa on DVD, so I own the English Dub. That means I have not seen the Sub version yet, but I thought it was fine. I liked Vic Mignogna as Fai, he was probably my favorite character. I also liked Monica Rial as Sakura, but the only problem I had with her was her singing. It must have sounded better in Japanese, but I didn't like Sakura's singing voice in the English version. Jason Liebrecht played Syaoran, and I enjoyed listening to his voice, as well as Christopher Sabat as Kurogane. Overall an interesting choice for the dub cast, but it could have been better in my opinion.\\n\\n\r\nAlright, now it's down to the characters. To start off, we have Syaoran, the male protagonist of Tsubasa. He's calm, collected, a really good kicker evidently, and he's willing to risk it all in order to save Sakura. Sakura is the main female protagonist, and she is kind and caring to everyone. She's the kind of girl who would be totally worth saving, unlike a few other main female protagonists in certain animes... next is Fai. Fai was, in a word, awesome. He's funny, he's smart, and he's asking for a deathwish by calling Kurogane nicknames like \"Kuro-poo\". Speaking of Kuro-poo, he was my second favorite character in Tsubasa, just because he was so crazy angry all the time, and it makes for some pretty hilarious moments. Now, for the one character that I loath... Mokona. It probably has something to do with all of the annoying animal sidekicks in anime, but Mokona was probably the most annoying of all of them. It's the high pitched voice that makes me the most angry, but it's also how obnoxiously cute it is. Other than Mokona, I liked all of the characters.\\n\\n\r\nI liked this anime a lot. If it were on TV, I'd watch it every week once a new episode airs. I liked it, but the slow start kind of gave me the wrong impression of it at the start, but if you want to understand the story, it's required of you to watch it from episode 1. After a few episodes though, it gets better, trust me. For those of you who enjoy animes with mostly enjoyable characters and good fight scenes, you'd enjoy Tsubasa. If you can't stand slow starts and annoying animal sidekicks, then steer clear. But overall, I'm liking this series so far. Now, if you'll excuse me, time to start watching Season 2.",
            "date": "2013-07-02T22:02:00+00:00",
            "helpful_count": 31,
            "mal_id": 103561,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=103561"
        },
        {
            "content": "Tsubasa RESERVoir CHRoNiCLE is one of my favorite manga series. I was happy to discover that it had been made into an anime series, and after I stopped watching it after the first 16 episodes, I decided to pick it up again. I was only planning on finishing the first season, and after making my way through the last 10 episodes I needed to watch, I've definitely been dissuaded from watching the second season and just sticking with the manga, which I will be referencing throughout this review. (No spoilers though!)\r\nStory: The story is drawn out, and the series is riddled with fillers and randomthings that weren't true to the original manga. When it was true to the manga, it was plagued by slow pacing. Things were added that were just there to stretch out the episodes to the allotted 25 minutes, such as long pauses in conversations, flashbacks, and unnecessary, lifeless panning shots. The story itself is broken into arcs: as the main characters travel, each world they visit is its own arc, which is more or less self-contained. They're not too complex, and they all follow the same basic formula: the group lands in a world, a feather is somewhere in the world they landed in, some bad guys want the feather for themselves, fight the bad guys, move on to the next world, rinse and repeat. This persists until the end of the season, but not necessarily by fault of pacing - the manga followed the same formula up until the Tokyo arc, so it's hardly surprising that the anime followed suit. However, it doesn't work as a standalone; there's nothing to tie everything together in the end.\\n\\n\r\nArt/Animation: The animation itself is very... lacking. Tsubasa is a beautifully drawn manga, but the anime... not so much. The proportions, especially the facial proportions in particular, are wonky. Bee Train did not do a very good job of translating CLAMP's style of manga into animation. As far as the actual movement... there isn't much of it, and when there is it's still very stiff. Scenes that should've been dynamic weren't dynamic at all. In a word, it's underwhelming. Aside from the wonky proportions and the not-so-stellar animation, the character designs are solid. I am also fond of the color choices: generally bright, colorful, and pleasing to the eye.\\n\\n\r\nSound: The sound is the thing about this anime that really shines. The opening is good and the ending, sung by Maaya Sakamoto, is beautiful. The background music was penned by Kajiura Yuki, and you can't go wrong with her; her music gives the series a feeling of mysticism and magic. Overall, the soundtrack is absolutely stellar. As for the voices, after reading the manga for so long, hearing the characters speak out loud was a bit jarring, but I got used to it. Yui Makino in particular does a great job as Sakura, and is an excellent spiritual successor to Sakura Tange (who voiced Sakura in the original Cardcaptor Sakura series and was not working as a voice actress at the time Tsubasa was animated). I also enjoyed Tetsu Inada as Kurogane and Daisuke Namikawa as Fai. I only watched it in Japanese so I can't speak for the English dub.\\n\\n\r\nCharacter: Call me a CLAMP fangirl, but I love it when they crossover their characters. That said, a majority of Tsubasa's character are, indeed, not original to the series. However, individually, they vary from world to world, so despite the bad impression that the phrase \"recycled characters\" leaves, there is diversity. However, with different sets of characters in each world, not much depth is given to the supporting cast. On the other hand, the main characters are well-written for what they were given. The characters' backstories - particularly Kurogane's and Fai's - were never animated, so their motivations and subtleties in characterization might be a bit unclear. But for what it was, it was done well. The main cast is diverse in personality and their dynamic is very good - they work well together both as comrades and as a makeshift family. One thing that did suffer, however, is the relationship between two particular characters (who I will not name so as not to spoil). As the series goes on, it appears that the writers decided to disregard all subtleties regarding one character's romantic feelings for another character. It really takes away from their development and it gives the impression that the writers just wanted to rush it and appease the viewers with a romantic relationship rather than have it develop more slowly (and much more satisfyingly) as it did in the manga.\\n\\n\r\nEnjoyment: Lots of filler material makes this series feel very boring and stretched out. Like I said before, when two characters are having a conversation, it seems like they're going as slow as possible just to waste time. There are long pauses in between statements, even right in the middle of sentences! It made some parts very annoying to watch, and had me thinking, \"When will this be over?\" The pacing issues are a huge detriment to this series. On top of that, the fillers aren't even that interesting to watch. I was disappointed to find out that the last episode of this season is also a filler! I did, however, enjoy the Outo arc in particular. I still got some entertainment value out of watching the characters I love, but the pacing and filler dragged down my enjoyment of the show by a lot.\\n\\n\r\nOverall: The only things really holding this series up are the characters and the music. Everything else about it, especially the pacing and filler, is painful. CLAMP themselves disowned this adaptation of their manga. But if you're willing to tolerate the constant filler, I say go for it. However, if you'd rather have your share of Tsubasa without all the filler, I recommend heading over to your local bookstore.",
            "date": "2008-06-23T18:36:00+00:00",
            "helpful_count": 19,
            "mal_id": 5734,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11933.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Neko-Hoshishima",
                "username": "Neko-Hoshishima"
            },
            "url": "https://myanimelist.net/reviews.php?id=5734"
        },
        {
            "content": "Much like berryful I had no idea about this series going into it, manga or anime-wise. I had seen some Tsubasa stuff in Animate when I lived in Japan and had figured that I should watch it someday...\r\nI happened to pick up the first 3 DVDs from my library and what I learned about this anime is that its totally not worth the time. I'm not sure what year this was anime-converted from manga but the way they did the anime compared to the manga (from what I've read) was the real killer. \r\nThe first few episodes seem interesting, character presentation and all, and thensuddenly were thrown into the storyline. Suddenly were introduced to four different worlds and three new characters (one of which is nameless and seems to be the main antagonist, monocle and beard and all). \\n\\n\r\nThe show then goes into a pokemon-esque/duel monsters/digimon etc world where characters are completely devoid of development. Suddenly the seemingly wussy main character becomes a formidable fighter and all other characters throw in their two cents etc. etc.\\n\\n\r\nI don't know if it's because I watched processed shows from FUNIMATION (you suck) but the music in this was horrible. Simply awful. Who decides to hire wailing singers in like every movie and drama? The music in general is awful! It never matched the mood in the later episodes and came at completely random moments. The key frames are also horrible, and like another review mentioned, we sometimes get a characters face for 2 minutes XD. The story is also lame as hell once you get into it more and more and reminds me of a very crappy copy of Inu Yasha minus the intrigue of the characters and their situation. Instead we get flat one dimensional characters, crap music, though great animation, and a super lame lets collect and travel the world(s) story.\\n\\n\r\nOverall I would not at all recommend this particular series. I know there are far better out there (though not entirely similar Kou Kara Maoh comes to mind). If you're wondering why the hell did Misc watch 11 episodes, well, DVD is more enjoyable than sitting in front of the laptop for however many hours I wasted XD.",
            "date": "2008-12-04T15:51:00+00:00",
            "helpful_count": 17,
            "mal_id": 10099,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/117348.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/miscanime",
                "username": "miscanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=10099"
        },
        {
            "content": "I haven't watched Card Captor Sakura, but I heard that both these series are serialized by Clamp and both have main characters.  But I do not know how alike they are in attitude. What I do know is that both have the same facial features.  As such, the art has no originality, though, they were created by the same animators, in the end, you can't help but correlate both characters.  \r\nStoryline wise, traveling to other worlds is interesting, but it doesn't keep the audience hooked, in my case that is.\r\nThe art would be difficult in my own opinion, since it would takea lot of brain storming to create a different kind of world.  And having succeeded at doing it, Clamp is worthy of praise.\\n\\n\r\nMusic, I believe stands out in this series.  I am a lover of classical, opera and chorale music and using such genre appealed to me.  Unfortunately, playing the same music that stand out, over and over, in the long run became annoying to me.\\n\\n\r\nLike I said, some of the characters have no originality.  But since this is a crossover between Card Captor  Sakura, maybe they intentionally did it.\\n\\n\r\nEnjoyment.  I did enjoy it, but not to the point where I would hang out with it over time.  I watched it because I have no other thing to watch.\\n\\n\r\nOverall, I give it a 7.6.  This is mainly because it did not cater to my age range.  Although there are shojo productions out there that were outstanding, this was just mundane.  I'd recommend this to teens aged 10-18.",
            "date": "2007-10-14T08:40:00+00:00",
            "helpful_count": 16,
            "mal_id": 1029,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/13055.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sweetburntlips",
                "username": "sweetburntlips"
            },
            "url": "https://myanimelist.net/reviews.php?id=1029"
        },
        {
            "content": "So after reading through the manga, getting impatient waiting for the dub, I watched the series on Youtube. And I'm duly impressed. I had high expectations of this series, and so I when I heard about it I was skeptical (as my deep dark fantasy desire was to personally make this show my self) Of course being a fan-boy to Koichi Mashimo and and Yuki Kajiura It boosted my confidence more.\r\nThe plot is well adapted. Anime has the double edge sword when it comes to adaptation, either it's a very very loyal adaption nearly 100% in which case there is no longer a point toread the manga, or it's so different that you wonder, did the writers just read the summary on the back of the book?  But this is adapted in both differently while playing true to the Manga. The occasional sub-plots provide for some dramatic moments. Such as the plot of Chu'Nyan's (manga spelling) reunitment with her mother (I must admit I was crying during that point) and well other moments that proved to be not useless. Sub plots are tricky, you can milk them too much if you are not careful. Fortunately the play these out nicely.  There aren't too many and they aren't entirely pointless.  They provide for good character developments and expand the quest with out making it far too easy on the characters.\\n\\n\r\nI'd have to say, at first I read some criticism about Kajiura's music score. But I have to say this is one of her finest yet. She has some very powerful, unique, and interesting melodies. Especially the opening piece. The opening scene is so powerful with visuals, and the music choice. I don't know Yuki to work a lot with bigger instrumental styles, but I do hear a lot. She seems to have a lot more orchestral than she does songs. Not like her usual motif. I'm impressed, very impressed. I love the opening theme. While this wasn't a Kajiura composition (Also unusual for a Mashimo-Kajiura work) It's an awesome theme. \\n\\n\r\nNow many might complain about the long limbs. Frnakley I don't care. It's the same way in the manga, as it is in the Anime. As long as the Animation doesn't look like paper cut outs, I don't have any complaints.  I think BEE TRAIN was actually trying to replicate the style seen in the manga which they didn't need to do but they went out of their way to do it.  Minako Shiba has done fantastic with her character designers and the BEE TRAIN Staff shine the anime.\\n\\n\r\nOne of the biggest flaws is the constant flash back usage of previous episodes. I find my self fast forwarding through the episode as it slowly recaps what happened. And in these flash backs, they have real continuity problems.  Unfortunately they get a little carried away with the flashbacks.  It's very clear Mashimo doesn't fear a slow paced plot.  Which has it's ups and downs.\\n\\n\r\nGreat acting from the Japanese cast. Particularly Yui Makino as Sakura. As for the U.S. cast I feel Monica Rial was not the best choice.  She simply was not for this role, she's a good actress but this was just not the role I could see her in. Other than that the English cast is an all star knock out.  Though I would have had some preferences for other characters.  They do their best and that's all we can ask for right?  I felt Vic and Sabat were fantastic choices for Fay and Kurogane, Savage not as much for Mokona. \\n\\n\r\nI say see this series. If you are a CCS fan. Manga Fan, see this Anime.",
            "date": "2008-03-31T09:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 3510,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44864.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShadowBlazer3000",
                "username": "ShadowBlazer3000"
            },
            "url": "https://myanimelist.net/reviews.php?id=3510"
        },
        {
            "content": "Remember the show ‘Cardcaptors Sakura’? You remember… The little Girl Sakura who has to find all the Clow cards! And her rival, Chinese boy Syaoran Li? \r\tWell, guess who’s back in this anime?!\r\tTsubasa (Which means ‘Wings’) is CLAMP’s ultimate cross-over manga! Every single manga they’ve ever written is in this series!\r\tIn this story, our little Sakura isn’t so little anymore, now a teen – and quite a rebel princess at times, she goes off to visit her childhood friend, Syaoran, a young archaeologist, at the Clow Ruins to finally proclaim her feelings for him. \r\tUnfortunately, Fate has a different plan for the two of them.\r\tSuddenly,Sakura loses her memory in the form of beautiful feathers and Syaoran vows to find them all.\\n\\n\r\tSorry to say that these feathers won’t be easy to find. They lie in different worlds, where people who find them first will either gain the feather’s great power for good… or for evil.\\n\\n\r\tAnd so, Syaoran makes a pact with a space-time witch in order to gain the ability to travel through worlds – For a heavy price.\\n\\n\r\tGaining allies; one unwilling to return to his own world, the other who can’t wait to return to his, the group journey through many different worlds to find the missing feathers. \\n\\n\r\tBut, unknown to them… there’s a greater darkness that follows their every footstep along the way…\\n\\n\r\tIf you’re into action-packed stories, or ones full of romance, promise, hope, angst, comedy, or any genre at all, really… Tsubasa is definitely for you! You’ll be drawn to the characters immediately and absolutely adore little Mokona!",
            "date": "2007-02-05T14:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 122,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/169.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nekokitsune",
                "username": "Nekokitsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=122"
        },
        {
            "content": "Seeing as I haven't read the manga for this show (or any manga for that matter) I won't be referring or comparing these two (as I hear that the manga is \"way\" better than the show).\r\nStory:\r\nTo me the story didn't seem to be very great from the start. Basically in the first episode everything was put together and it felt rushed and was a very lazy way to introduce the characters and plot. Then after I watched further into the show I got even more disappointed as I found out that the style of Tsubasa was just a bunch of mini stories making up theshow that didn't really develop the initial story. However, I did like how Tsubasa would come up with different ideas of the mini stories making it somewhat interesting to see what would happen next, except then I kept finding myself getting annoyed by the fact that none were very good and lacked interest.\\n\\n\r\nAnimation:\\n\r\nWell once again I still find that art/animation isn't very hard to accomplish with today's standards. Like most animes the animation was pretty much the same as any other anime. The characters were well drawn and the backgrounds were up to detail. There was one point where I felt I was watching an anime from the 90's because of the poorly drawn facial expressions and extras, but everything else felt normal as normal gets.\\n\\n\r\nSound:\\n\r\nThis may be a little biased, but the sound was very corny at times. I know they were trying to be dramatic (or maybe romantic) by playing slow music during some of the episodes and it would have been good if they didn't do it for 5 times. After hearing it over and over again it became (to me at least) a joke. Like: &quot;Oh god, now there doing a music montage and getting 10 different close-ups of everyones face.&quot; They could have done with a little variety of background music also, seeing as they were visiting different worlds that could do with more than just the same tune. As for theme songs I thought they were good and helped set the mood of the story.\\n\\n\r\nCharacter:\\n\r\nUsually when I watch an anime there's always one character whom I wish would simply die and get out of the picture. In this show, although it was close at times,  there wasn't really any characters I hated. When I first began to watch this show I already knew what the roles and personalities of all the main characters would most likely be and I was dead on for all of them except Sakura. I don't know if that is a positive to know what the characters would be like because then I easily predicted (and they were all so predictable) what each character would do and got bored of seeing the same thing happen. Predictability is no problem if the characters themselves are interesting which I found most to be. Also as a side note there were no supporting characters. For example if you see a new character and he/she leaves the picture then there outta there! FOR GOOD =)\\n\\n\r\nEnjoyment:\\n\r\nI guess I could say this show had a bad start for me and if I would have only watched they first half then I would probably give enjoyment a 3. But then after a while I started to enjoy some of the episodes and thought that overall it was an ok if not good show to watch. Maybe its just me but, this show is too soft (this is coming from someone who likes gorey animes). Not great but not bad so I give it a 7. (6 to me is where I begin start to hating)",
            "date": "2008-05-27T02:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 5032,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45809.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/klemon_qhap",
                "username": "klemon_qhap"
            },
            "url": "https://myanimelist.net/reviews.php?id=5032"
        },
        {
            "content": "I think i need to add something here.. i don't expect anybody to vote how useful my review was.. but let me just say this. (This is just my opinion ^_^) There is a lot of responses to this anime that there is a lot of filler and pointless scenes. however i have to disagree.\r\n1) Each of the characters grow more and more into their roles.\r\n2) Not always will they go to a dimension and find a feather... so of course there will be episodes that seem there is no reason that they should even be there. The characters have no idea what realm thefeathers are in.\\n\\n\r\n2) Clamp is trying to introduce all of their previous characters from other animations into this one. So i'd assume some of it is just for our enjoyment of seeing them appear.\\n\\n\r\n3) If the anime moved any faster then there are things that happen that are impossible to answer if the story doesnt explain itself as it goes... \\n\\n\r\nI do know not to expect it is exactly like the manga but it doesnt always follow exact.  i hope my words are clear enough. I will say this.. The OVA is the best of the series so far. Very dark like the manga and its by a different studio, not bubble-bee. =) Please watch it when you finish the first 2 seasons of this wonderful series.",
            "date": "2008-07-03T02:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 5978,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7460.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/darkwhisper",
                "username": "darkwhisper"
            },
            "url": "https://myanimelist.net/reviews.php?id=5978"
        },
        {
            "content": "There are 2 points-of-view when judging this Anime:\r\n-When you didn't read the manga.\r\n-When you already read the manga.\r\nThese 2 points of view can lead to very different judgements, and that's why I'm gonna review using both of them.\r\nFirst one, is watching this anime without reading nothing from the manga.\r\nHere we go:\r\n   Tsubasa is basically the story of Sakura, a princess who has a great power inside her, and her long-time childhood Friend Syaoran.\r\nAfter having her memores lost and spread around many different worlds, Syaoran goes in a quest the recover them all and save the princess, with the help of Fye and Kurogane,two other character that will have great importance in the plot.\\n\\n\r\nThe anime has almost no violence at all. Kinda like Dragon Ball Super: There are battles, minor injuries, but no blood.\\n\r\nStuff like alchohol also don't make appearence.\\n\\n\r\nThe journey is fun to watch. The humor and the characters are really pleasurable to watch.\\n\r\nIs that kind of anime that you can prepare some coffee, sit on the chair and watch it just to enjoy the free time you got, you know?\\n\\n\r\nIt's kinda follows the same recipe until the end of the second season. No biggies here. When you finish the anime, you will probably be like:\\n\r\n\"Ok, that was pretty good, but no ending. I wonder what happens after it.\"\\n\\n\r\nAnd that's the moment You go and read the manga.... And everything changes.\\n\\n\r\nNow, reading the manga, you will notice some different things here:\\n\r\nThere are blood and violence in the manga (mainly in the later parts of it, wait until you get to the Tokyo Revelations arc), and also alchohol, for example.\\n\\n\r\nAnd also, after an specific arc of the story, you will notice that the anime and the manga follow COMPLETE different plot-lines. And that's why I said that your opinion about the anime, changes deppending on if you read or not the manga.\\n\\n\r\nThat probably  happened because the anime wanted to avoid the violence, and noticed it would be impossible at one point, so it decided to change it all, and that made the fans go really mad about it.\\n\\n\r\nThe thing is, that doesn't means that the anime is bad... it's just the the manga is actually better.\\n\r\nThe manga has a really deeper plot and gets dark and a LOT interesting, while the anime keeps the bright and good mood all the time.\\n\\n\r\nI watched the anime first, and really liked it. And I suggest you to watch it too.\\n\r\nIf you wanna avoid disapointment, you can watch the anime and then, read the manga. Since it will only get better, instead of getting something good, then something worse.\\n\\n\\n\\n\r\nART: 10\\n\r\nI really love CLAMP art-style. It's highly niche, since there are people who hate it, and people who love it including myslef.\\n\r\nI find it beautiful and pleasing. It's unique and different from many other anime.\\n\\n\r\nSTORY: 7\\n\r\nThe plot is fairly good. It is pretty simple, but still fun to watch it.\\n\r\nIf you have already enjoyed the anime plot, the manga is a lot, and I mean a LOT more complex and deeper..\\n\\n\r\nOVERALL: 7\\n\r\nI gonna resume the rest of the subjects here: it is good.\\n\r\nThe characthers are attrative, unique and cool. The soundtrack is AMAZING, the songs are just epic. And the anime is pretty enjoyable and fun.\\n\\n\r\nFinal Thought: The anime is not bad as many says. I suggest you to give it a chance, because it IS good. \\n\r\nThe only thing is that it gets completly smashed by the manga after you read it.\\n\r\nDon't worry with the \"manga is better\" thing, because taht doen't make the anime itself bad. It is still a good anime and you can still have fun watching it.",
            "date": "2017-09-02T13:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 256745,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635842.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DkClaude",
                "username": "DkClaude"
            },
            "url": "https://myanimelist.net/reviews.php?id=256745"
        },
        {
            "content": "I enjoyed the Tsubasa Reservoir Chronicle manga immensely so when I found the anime I was very excited. But after the first few episodes I realized some major problems with the series. My two main issues being that they recap on the story far too often and the music doesn't fit the mood sometimes. And then the very last episode of the season ended with Sakura wishing for people who had died to return which goes against the whole theme of the manga. Overall I enjoyed this but I felt very frustrated while watching it at times.",
            "date": "2010-05-31T22:14:00+00:00",
            "helpful_count": 10,
            "mal_id": 26640,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328106.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mizilla",
                "username": "Mizilla"
            },
            "url": "https://myanimelist.net/reviews.php?id=26640"
        },
        {
            "content": "Story (7) - Very slow pace, with lots of fillers. There was 1 or 2 interstings story arcs, but the rest is disapointing. I believe it&acute;s not the story itself, since the manga doesnt seem to have that problem. Its how it was develloped in this series. As i said in the start, the story lost itself between many fillers, long long conversations explaining things that didnt make any sense to be explained, while other important things were left behind undevelloped.\r\nSo, only a 7 in this aspect.\r\nArt (8-) - Nothing really special, however, some good appointments in terms of character design. The rest in justenough to be considered good.\\n\\n\r\nSound (10+) - For me, the best aspect in the whole series. I liked the op and ed, and background music is just amazing. It gives a lot of atmosphere and fits very well with this type of anime. Character voices were also pretty well made, and in general, sound fits very well with the rest. \\n\r\nIt is certantly not because of sound that this anime disappointed me. \\n\\n\r\nCharacter (8-) - I liked them, in terms of image and role in the story. Its quite a good creation, but as it came closer to the end, i noticed that they are not that well develloped, and the relations between them seemed a little bit messed up.\\n\r\nStill, this is good enough, although i think manga seems to be much better in this aspect (comparing with what i already saw from the manga).\\n\\n\r\nEnjoyment (6-) - I dont even need to be an expert to notice the big number of fillers in this anime. It turned most of the episodes (with exception of 1/2 arcs) boring, sleepy, and not interesting at all. Many moments with lots of conversation/lack of action, some long pauses, and aspects/information with not sense at all, clearly used to fill in time in the series. \\n\r\nWell, not everything was bad. One of the beginning arcs, and the last one gave some interest to watch (that was quickly replaced by an poor, really poor last episode :s) , but its too few for an anime wich i had some expectations.\\n\\n\r\noverall (7) - I dont even need to see all the manga to find out why this is not a good one. It disappointed me a lot.\\n\r\nWith the exception of the music aspect, wich i give the credit because it was really good, the rest was far below my expectations. \\n\r\nThe fillers, lack of action and lots of conversations....and who knows, probably after reading more from the manga i will find some more negative aspects about this one.\\n\\n",
            "date": "2008-11-30T15:46:00+00:00",
            "helpful_count": 8,
            "mal_id": 9974,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fr0z3nshad3",
                "username": "fr0z3nshad3"
            },
            "url": "https://myanimelist.net/reviews.php?id=9974"
        },
        {
            "content": "I went from Cardcaptor Sakura to this series, so overall I think I saw an improvement atleast in the maturity level. And though there were some things I found lacking I am going to continue to the second season. \r\nLikes:\r\nIt is a really interesting story idea and I just love the chance to explore different worlds. The characters have some depth, unique traits and all set eachother apart nicely. Also, the interactions between characters is pretty amusing. Actually, the anime overall is pretty funny as well as being serious. It touches on issues that CC seemed to skirt around and actually makes you \"feel\" forthe characters.\\n\\n\r\nDisklikes:\\n\r\nThere was a lot of potential, but as the story moves on it almost seems to get less interesting. I saw this in CC as well. Each episode's format is repetitive and that started to cause me to lose interest. Also, sometimes the expressions on the characters faces drove me nuts... during certain scenes they would appear placid, when I felt there should have been more emotion. \\n\\n\r\nOverall, this anime is something that I enjoyed when I was bored. It was not something that I obsessed over or had to watch constantly until I finished the season. Yet, it does have a unique story and is an easy watch. I probably will not ever rewatch it, but it is definitely something I don't regret watching.",
            "date": "2008-02-05T21:56:00+00:00",
            "helpful_count": 7,
            "mal_id": 2340,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/31739.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/restivesilence",
                "username": "restivesilence"
            },
            "url": "https://myanimelist.net/reviews.php?id=2340"
        },
        {
            "content": "First I saw CCS, then I noticed a new anime called Tsubasa Chronicles.\r\nI thought it was a sequel, but it was a new story.\r\nAnd even when I first lay eyes on this anime, I fall for it ^-^\r\nThis anime is quite touching, even if it have action and fantasy in it.\r\nTwo childhood friend who develop feeling for each other.\r\nSyaoran sacrifise the relationship between him and Sakura, so Sakura would live even if he knows that she wouldn't remember him.\r\nBut as the story goes, Sakura once more fall for Syaoran, without the past memories of them.\r\nI often tears whenever there's a flashback about them...",
            "date": "2008-03-01T00:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 2808,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/YuyuiSakura",
                "username": "YuyuiSakura"
            },
            "url": "https://myanimelist.net/reviews.php?id=2808"
        },
        {
            "content": "As Vladimir Putin has once said, \"I'll be brief\".\r\nI stumbled upon this anime after watching \"Chobits\". I was quite familiar with CLAMP and some of their works, so I decided to fill this particular gap in my aсquaintance with this series.\r\nPeople often say \"No regrets\", but I DO regret watching Tsubasa Chronicles.\r\nWhy? Well, let me tell you.\r\nFirst - the story is your basic and \"favorite\" GONNA CATCH 'EM ALL!!11 (sad smiley) type of stories. Our heroes travel through different worlds trying to find Sakura-hime's feathers in order to get her memories and personality back. \r\nThe premise is kinda promising, but the execution is very poor- the worlds are unimaginitive, plain and boring as cows. Or sheep (they're actually quite funny and cute, so I'll stick with cows). There was one TV-show called \"Sliders\" (sadly with living human beings), which had a similair premise with much better execution. In other words, the idea is not so unoriginal, but it could have been done better.\\n\\n\r\nA few words about art & sound. I think the animators' salary was something about a bowl of rice, because graphics in this show are very dull and greyish. No bright colors, no decent animation, the show looks very cheap. Hell, I've seen some hentai drawn better than that!\\n\\n\r\nSound is little better, but it's still just average. The same musical tracks are repeated over and over, even when they don't fit the scene at all. Hey, but who cares? The animator guy ate the last bowl of rice, so our composer will have to work for an \"arigatou\".\\n\\n\r\nOne thing that made me hate this show is the characters. Yeah, Kurogane and Fai are nice fellows, but Syaoran and especially Sakura made my dinner go out of my mouth every time I saw them on screen. Syaoran is one of the most dull and uninspired shounen heroes of all the time. I think he has no personality, just this blind and exaggerated loyalty towards Sakura, who says nothing but \"SYAORAN-KUN!\" ALL THE TIME. Hell, in one episode she shouted it for about 9 times, on some occasions - FOR NO REASON. Yep, that's all she does in this show - being a helpless and a mentally challenged damsel in distress. It's not quite and makes you want to protect her, it's simply pathetic.\\n\\n\r\nThe story feels like it should've been made in 12 episodes, the plot moves sooo slow and it's too predictable. There's a glimpse of an intrigue in the last story arc, but it is resolved undescribably silly.\\n\\n\r\nJust like the whole show - it's not fun, it's not original, it's not curious. It's just silly.\\n\\n\r\nAnd boring, as a result.\\n",
            "date": "2012-08-29T09:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 71107,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/212332.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Johnny_FBI",
                "username": "Johnny_FBI"
            },
            "url": "https://myanimelist.net/reviews.php?id=71107"
        },
        {
            "content": "The storyline is wonderful, the sound track is amazing and the characters all give an extra plot twist to the real storyline. Sadly, the anime doesn't really reach a point that it actually gets to the main storyline. \r\nTsubasa Chronicle is a good show if you're a shoujo addicted fangirl, looking for some new anime. But it's certainly nothing good for the die hard CLAMP and TRC-manga fans. If you have no problems with reading the manga instead of watching the anime, I'm telling you, go read the manga. \r\nAnimation is a disappointment. Art is also pretty screwed up. Even I, someone without eye foranimation quality could see it.\\n\\n\r\nThis anime = A no no.\\n\r\nThe OVA = BIg yes.\\n\r\nThe manga = to die for.",
            "date": "2009-10-25T07:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 19991,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/247460.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sky-e",
                "username": "Sky-e"
            },
            "url": "https://myanimelist.net/reviews.php?id=19991"
        }
    ],
    [
        {
            "content": "I'll try to get straight to the point with this review.  Before watching this series I had never read the manga nor had I ever seen anything about it beyond the wiki page for the show.  I thought it looked decent so I began watching.\r\nThe anime had a very promising first episode and the characters seems well thought out and reasonably likable.  I found it entertaining and continued onward.\r\nIt goes all downhill from there.  The plot starts out strong and then begins failing very quickly.  There is a massive amount of what I would claim is filler and you reallycannot see much progression at all in the story throughout the entire 1st and 2nd series.  (I just found out that the third was canceled &gt;_&lt;)\\n\\n\r\nBasically you could skip episodes 10-47 ish and still know whats going on.  The part that really got to me was how often they would play a song while slowly moving frames across the screen to take up time during an episode.  I know what the characters faces look like and I don't need to see close ups of them doing nothing for 10 minutes every episode.  They never even bothered to come up with new songs, just replayed them.\\n\\n\r\nIf you can sit through 52 episodes of sameness and you enjoy that feel free to watch.  I have nothing against the characters or the idea behind the show.  It just seems to me that they never went anywhere with it.  Maybe the manga is better, I wouldn't know.  Hope this review is helpful and not seen as a hate thread.",
            "date": "2007-11-03T19:12:00+00:00",
            "helpful_count": 265,
            "mal_id": 1205,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/George47",
                "username": "George47"
            },
            "url": "https://myanimelist.net/reviews.php?id=1205"
        },
        {
            "content": "Tsubasa RESERVoir Chronicle (TRC) - the anime - showed a lot of promise from its very first episode.  However, because of the fact that TRC is aired during the children\\'s hour in Japan, which limits exactly the kind of content they are allowed to put into this anime, as a result, have disappointed many viewers thinking they would be witnessing a story that was close to what was written in the manga by CLAMP.  However, despite all of that, Tsubasa Chronicle still shapes up to be a relatively enjoying series, if you can get through a couple of the more slower arcs andhorrendous fillers.\\n\\n\r\nFirst of, in case you did not know, CLAMP decided to \\&quot;recycle\\&quot; a lot of its characters from Card Captor Sakura and other anime in this show.  In essence, you will see a ton of familiar faces, but that\\'s all they are - faces.  For the most part they have completely different personalities and histories.  I don\\'t know if that\\'s because they ran out of ideas for completely new characters or not, but that\\'s just the way it is.  But don\\'t get me wrong, it\\'s definitely not a bad thing.  \\n\\n\r\nThe animation, as usual from CLAMP, is up to par with today\\'s standards and what today\\'s viewers expect from an anime.  It\\'s very crisp and clean and very colorful.  The relationship between Sakura and Syaoran is something you could shed a tear witnessing the trials they go through, but once again, the slowness of it all prevents a continuous enjoyment of that.\\n\\n\r\nYuki Kaijura has once again put together a very beautiful soundtrack to go along with this anime.  From the very first time the piece named \\&quot;A song of storm and fire\\&quot; is played with the anime, that alone will urge you to keep watching this anime.  However, this anime does progress extremely slowly at times, especially after the first arc and the fillers (you wouldn\\'t think there would be fillers in a 26-episode season, but there are) are extremely boring, possibly with the exception of one or two filler arcs.\\n\\n\r\nEven with all of that, its the animation and music that keeps Tsubasa RESERVoir Chronicles - the anime - alive and what keeps its viewers, in my mind anyway.  The story has the potential (well, it does if you read the manga) to be amazing, but the fillers and slow progress prevent it from doing so.  If you want to know what happens, pick up the manga and start reading it.  You won\\'t be disappointed.  The anime is something you have to be patient with.",
            "date": "2007-06-01T18:28:00+00:00",
            "helpful_count": 157,
            "mal_id": 339,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3959.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VK11",
                "username": "VK11"
            },
            "url": "https://myanimelist.net/reviews.php?id=339"
        },
        {
            "content": "I will be firm in saying that nobody, NOT ONE OF YOU would have given this anime the time of day if it hadn't recycled characters from better anime. \r\nCLAMP, in a move of sweeping lack of creativity, decided to make another franchise by reusing their old characters. I gotta say, smart move, CLAMP--your cash cow is ready to be chopped up and sold. \r\nAnd this is what Tsubasa Chronicle is: a sell-out. \r\nThe story is bland and boring. Dimension-travellers bound together for whatever reasons, but you know, viewers won't care because they get to see Sakura and Shaoran or whatever his name is gogaga over one another once again and two yaoi-fodder guys vacillate between passion and disgust of one another. \\n\\n\r\nThe art was mediocre. It wasn't good, wasn't bad. Nothing special. Like the sound. \\n\\n\r\nI cannot give the characters a good rating because they aren't characters. They are just themselves from the old anime transported to a new one to serve a purpose. They aren't developed, they aren't deep, it isn't good. \\n\\n\r\nI was yawning and scratching a lot while watching this--that can't be good. \\n\\n\r\nOverall, this is unfabulous crap. Don't watch it. Unless you're a CLAMP fan and you won't listen to me.",
            "date": "2008-10-26T11:23:00+00:00",
            "helpful_count": 138,
            "mal_id": 8997,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=8997"
        },
        {
            "content": "First of all I\\'d like to say that I have been a fan of Tsubasa RESERVoir CHRoNiCLE [ the manga ] since the beginning, I got out of it for a while and then got back into it and what did I find when I picked back up reading the manga? Well, I found out that TRC had been turned into an anime. I first I thought \"Great! I can\\'t wait to see everyone animated!\" but what happened when I watched \"Tsubasa Chronicle\" was indescribable. \r\nFirst of all the art was flat out BAD. The character\\'s look like noodles and their expressions and movements lookslabored and dorky. Second of all their voices aren\\'t the best thing in the world. And worst of all, the thing that made me want to pull my large intestine out and hang myself with it was that Bee Train/NHK absolutely BUTCHERED plot. There is no excuse for what Bee Train and NHK did to a simply epic story. The anime was filled to the BRIM with OOC filler episodes that completely messed with the characters of Tsubasa and characters from crossover series. Bee Train/NHK shoved a whole laod of relationships that aren\\'t supposed to be there into the series. \\n\\n\r\nThey actually went to the extent where they changed someone\\'s past. It was an epic failure and yes: CLAMP themselves disowned the anime. Thankfully CLAMP has been working on a wonderful looking set of OVA\\'s called Tokyo Revelations. I\\'ve seen pictures of what the animation looks like and I can say right now that the art of the OVA\\'s is going to be phenomenal. No more overly scrawny characters. And the best part about the OVA\\'s is going to be that they actually follow the correct plot.  Bah. I REJOICE almost every day because season three of Tsubasa Chronicle was canceled. The anime is severely deprived of the true plot. Tsubasa Chronicle really does not reflect the true beauty and qualities that fans have been following in Tsubasa RESERVoir CHRoNiCLE for years. I was actually very dissapointed as I was looking forward to Tsubasa being animated, but alas, this is what I got.\\n",
            "date": "2007-07-31T18:07:00+00:00",
            "helpful_count": 95,
            "mal_id": 639,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8873.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Altomare",
                "username": "Altomare"
            },
            "url": "https://myanimelist.net/reviews.php?id=639"
        },
        {
            "content": "***A word to the wise: You should probably only read this review if you haven't read the manga version. If you HAVE read it, and have an open mind, then my review will probably help too***\r\nI've seen a few animes that have been based off of mangas [it seems like less and less anime these days are original] and it is very rare that the entire plot line will be in the anime. I was delighted with Itazura na Kiss because for the most part, it does follow the manga version very well, and the characters look the same in both anime and manga. \r\nAsfor Tsubasa Chronicle, I have only glanced at the manga and never read it. However, I know how it is to read a manga, see the anime version, and be very disappointed. That is why I said if you have read the manga, you should probably not watch Tsubasa Chronicle, for you will be very upset. I know that it strays from it's original plot, but if you have just finished, say, Cardcaptor Sakura and want to watch the &quot;next&quot; thing, then I highly suggest Tsubasa Chronicle. Here is why. \\n\\n\r\nStory: The story follows Syaoran and Sakura from Cardcaptors, but that is all they are. Their appearances are of a teenage Syaoran and Sakura, but their personalities are in no way the same, except that Sakura is still sweet. Syaoran does not still have that awkward temper of his from Cardcaptors, so when you are watching this anime you kind of forget who their original characters were [which is a good thing, because if you didn't, you'd watch the series very disappointed that Sakura isn't with Kero-chan whipping out Sakura cards with Syaoran trying to confess to her :p]. Anyway, Sakura has lost her memory through feathers that sprouted into wings out of her back, and Syaoran travels with the memory-free Sakura through different worlds to collect the feathers and return her memory. However, in exchange for being able to save her, Syaoran has to agree to let the memories of him be erased from Sakura's memory [and it is highly hinted that Sakura is in love with Syaoran, who, judging by his actions, is also in love with her]. So this time around, it is Syaoran fighting, and not Sakura. It's a good story, because traveling to different worlds is very interesting to watch. Instead of being like a normal plot line where you get a different world for every episode, they will stay in one world for around three episodes and develop characters in the other worlds, which I think is very interesting and nice, because normally anime only focuses on the central characters.\\n\\n\r\nArt: Some people complain about the art. It is a little quick looking because their limbs are long lines with large hands, but I actually like it. It's a nice change from the usual super-detailed Clamp because it makes the characters move a little better and it looks a little more updated. I'm not saying it's the best ever, but it honestly doesn't bother me. There is still a lot of super-detailed Clamp things like the clothing, magical items, etc.\\n\\n\r\nSounds: The music is beautiful. It does get used a lot, the same thing over and over I mean, but all in all it's really pretty and epic. It's not something you'd expect from this anime, and I like the recurring themes so much I don't mind if they get played again.\\n\\n\r\nCharacter: I personally like this Syaoran. He is a little predictable, but he is tough and fights with all of his heart to find Sakura's feathers, even though he has no motivation but to save her, since she has lost her memories of him. It is his love for her that makes him different from usual characters. He's not weak, he doesn't back down. All he needs is to look at Sakura and he is filled with the spirit to fight for her. Sakura, if you'll pardon me, reminds me greatly of Chi from Chobits when she loses her memory. If you watch the anime, you'll see what I mean. I half expected her to go &quot;Chiiiiii?&quot; every time she saw something like a bird or a new person. Thankfully, she doesn't go so far as to refer to herself in third person. She does, however, get the same happy, dazed looks that Chi gets, and smiles a lot which seems to turn even bad guys good. But hey, it's still Clamp after all. ;-]  Sakura and Syaoran are also joined by Fai, who is a delightfully carefree magician that is so classic with Clamp because of his easy-going nature, and Kurogane, who is a tough warrior that works together with Fai and brings a lot of the comedy to the story. Mokona from Rayearth is also there, and he is just soooooo cute. :D You will see a lot of characters from other Clamp works, but be warned: THEY ARE NOT THE SAME. They only LOOK like their original characters, but their personalities are different. Although it has to be said...Yukito and Sakura's brother from Cardcaptor sort of hint at their original characters, especially when you see them in different worlds. :D\\n\\n\r\nEnjoyment: So far, I'm enjoying it. Everyone said that I would hate it after I'd seen 10 episodes, but I am on 13 and still like it. I know I'll finish it. I mean yes, a lot of time is spent panning character's faces and doing flashbacks to the previous episode at the beginning of a new one, but if you skip it and just put up with a lot of zooming in on Syaoran's face, then you'll be able to finish it too. I have to admit, it is the worst zooming-in-on-a-character-to-use-up-time I've ever seen, but I just try to ignore it. But hey, I still look forward to each episode, so obviously it's not as big of a deal as everyone says it is.\\n\\n\r\nOverall: Like I said at the beginning of my long review, just watch it if you haven't read the manga. It really is a good story if you just treat it like an anime and not an anime based off of a manga. Albeit the long pauses on someone's face, the repetitive themes, and the flashbacks, I'm still enjoying it. And I've given up animes before that were far worse. So give it a shot and try to finish it. ;-]",
            "date": "2008-10-04T13:56:00+00:00",
            "helpful_count": 38,
            "mal_id": 8414,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60810.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mantret",
                "username": "Mantret"
            },
            "url": "https://myanimelist.net/reviews.php?id=8414"
        },
        {
            "content": "\"For all my life... I've wanted strength. I didn't want those things precious to me to be taken away from me anymore. But, to have strength means to invite disaster to come to you. And strength alone can't really protect you.\"\r\nTsubasa Reservoir Chronicles... took me a while to get into it. I don't really know why, but I feel like it might have just been because of the slow start, but it also might have been because of the slightly cliché story. However, once I started paying more attention, it got more interesting with every episode. The story unfolded a little more, the characters gotmore lovable, and the fight scenes got a lot better. So, without further ado, let's get this review started, shall we?\\n\\n\r\nAs I previously stated, the anime had a bit of a slow start, and the story was a bit of a cliché. It's about a boy and a girl. The boy being a villager, the girl being a princess. Both have been best friends since they were children. One day, the princess and the boy spend the day together, the princess having something supposedly important to tell the boy, but is not able to. That night, an unknown magic force calls the princess, and a ritual is performed. However, the boy saves her before the ritual is completed, but she looses every single one of her memories. The kingdom's priest then teleports the two of them to the Dimensional Witch, where they are also greeted by two others meeting with her, one a swordsman, and the other a mage. The Witch then tells the boy that in order to help the princess regain her memories, they must go dimension hopping, but at a price. In order to have the power to do that, the boy must give up all of the princess' memories of him. Even if they recover all of her memories, she will never remember him. He agrees, and the story is about the princess, the boy, the swordsman, and the mage as they all travel together, looking for her memories. As they go dimension hopping, they run into trouble nearly every world they visit, and help out the people of that world, involving overthrowing evil rulers, stopping a gang war, and fighting demons. Like I said, the whole \"Girl loosing her memory\" is a bit of a cliché, but their journeys together make it a lot better.\\n\\n\r\nI liked the artwork a lot. The anime was made by Bee Train, the studio behind Phantom ~Requiem for the Phantom~, Murder Princess, and the .//hack series. The artwork in Tsubasa reminded me of all of the other animes that Bee Train made, so it felt familiar to me. For those of you who have watched those other series as well, if you enjoyed them then you're going to be satisfied with the artwork of Tsubasa.\\n\\n\r\nI own both seasons of Tsubasa on DVD, so I own the English Dub. That means I have not seen the Sub version yet, but I thought it was fine. I liked Vic Mignogna as Fai, he was probably my favorite character. I also liked Monica Rial as Sakura, but the only problem I had with her was her singing. It must have sounded better in Japanese, but I didn't like Sakura's singing voice in the English version. Jason Liebrecht played Syaoran, and I enjoyed listening to his voice, as well as Christopher Sabat as Kurogane. Overall an interesting choice for the dub cast, but it could have been better in my opinion.\\n\\n\r\nAlright, now it's down to the characters. To start off, we have Syaoran, the male protagonist of Tsubasa. He's calm, collected, a really good kicker evidently, and he's willing to risk it all in order to save Sakura. Sakura is the main female protagonist, and she is kind and caring to everyone. She's the kind of girl who would be totally worth saving, unlike a few other main female protagonists in certain animes... next is Fai. Fai was, in a word, awesome. He's funny, he's smart, and he's asking for a deathwish by calling Kurogane nicknames like \"Kuro-poo\". Speaking of Kuro-poo, he was my second favorite character in Tsubasa, just because he was so crazy angry all the time, and it makes for some pretty hilarious moments. Now, for the one character that I loath... Mokona. It probably has something to do with all of the annoying animal sidekicks in anime, but Mokona was probably the most annoying of all of them. It's the high pitched voice that makes me the most angry, but it's also how obnoxiously cute it is. Other than Mokona, I liked all of the characters.\\n\\n\r\nI liked this anime a lot. If it were on TV, I'd watch it every week once a new episode airs. I liked it, but the slow start kind of gave me the wrong impression of it at the start, but if you want to understand the story, it's required of you to watch it from episode 1. After a few episodes though, it gets better, trust me. For those of you who enjoy animes with mostly enjoyable characters and good fight scenes, you'd enjoy Tsubasa. If you can't stand slow starts and annoying animal sidekicks, then steer clear. But overall, I'm liking this series so far. Now, if you'll excuse me, time to start watching Season 2.",
            "date": "2013-07-02T22:02:00+00:00",
            "helpful_count": 31,
            "mal_id": 103561,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=103561"
        },
        {
            "content": "Tsubasa RESERVoir CHRoNiCLE is one of my favorite manga series. I was happy to discover that it had been made into an anime series, and after I stopped watching it after the first 16 episodes, I decided to pick it up again. I was only planning on finishing the first season, and after making my way through the last 10 episodes I needed to watch, I've definitely been dissuaded from watching the second season and just sticking with the manga, which I will be referencing throughout this review. (No spoilers though!)\r\nStory: The story is drawn out, and the series is riddled with fillers and randomthings that weren't true to the original manga. When it was true to the manga, it was plagued by slow pacing. Things were added that were just there to stretch out the episodes to the allotted 25 minutes, such as long pauses in conversations, flashbacks, and unnecessary, lifeless panning shots. The story itself is broken into arcs: as the main characters travel, each world they visit is its own arc, which is more or less self-contained. They're not too complex, and they all follow the same basic formula: the group lands in a world, a feather is somewhere in the world they landed in, some bad guys want the feather for themselves, fight the bad guys, move on to the next world, rinse and repeat. This persists until the end of the season, but not necessarily by fault of pacing - the manga followed the same formula up until the Tokyo arc, so it's hardly surprising that the anime followed suit. However, it doesn't work as a standalone; there's nothing to tie everything together in the end.\\n\\n\r\nArt/Animation: The animation itself is very... lacking. Tsubasa is a beautifully drawn manga, but the anime... not so much. The proportions, especially the facial proportions in particular, are wonky. Bee Train did not do a very good job of translating CLAMP's style of manga into animation. As far as the actual movement... there isn't much of it, and when there is it's still very stiff. Scenes that should've been dynamic weren't dynamic at all. In a word, it's underwhelming. Aside from the wonky proportions and the not-so-stellar animation, the character designs are solid. I am also fond of the color choices: generally bright, colorful, and pleasing to the eye.\\n\\n\r\nSound: The sound is the thing about this anime that really shines. The opening is good and the ending, sung by Maaya Sakamoto, is beautiful. The background music was penned by Kajiura Yuki, and you can't go wrong with her; her music gives the series a feeling of mysticism and magic. Overall, the soundtrack is absolutely stellar. As for the voices, after reading the manga for so long, hearing the characters speak out loud was a bit jarring, but I got used to it. Yui Makino in particular does a great job as Sakura, and is an excellent spiritual successor to Sakura Tange (who voiced Sakura in the original Cardcaptor Sakura series and was not working as a voice actress at the time Tsubasa was animated). I also enjoyed Tetsu Inada as Kurogane and Daisuke Namikawa as Fai. I only watched it in Japanese so I can't speak for the English dub.\\n\\n\r\nCharacter: Call me a CLAMP fangirl, but I love it when they crossover their characters. That said, a majority of Tsubasa's character are, indeed, not original to the series. However, individually, they vary from world to world, so despite the bad impression that the phrase \"recycled characters\" leaves, there is diversity. However, with different sets of characters in each world, not much depth is given to the supporting cast. On the other hand, the main characters are well-written for what they were given. The characters' backstories - particularly Kurogane's and Fai's - were never animated, so their motivations and subtleties in characterization might be a bit unclear. But for what it was, it was done well. The main cast is diverse in personality and their dynamic is very good - they work well together both as comrades and as a makeshift family. One thing that did suffer, however, is the relationship between two particular characters (who I will not name so as not to spoil). As the series goes on, it appears that the writers decided to disregard all subtleties regarding one character's romantic feelings for another character. It really takes away from their development and it gives the impression that the writers just wanted to rush it and appease the viewers with a romantic relationship rather than have it develop more slowly (and much more satisfyingly) as it did in the manga.\\n\\n\r\nEnjoyment: Lots of filler material makes this series feel very boring and stretched out. Like I said before, when two characters are having a conversation, it seems like they're going as slow as possible just to waste time. There are long pauses in between statements, even right in the middle of sentences! It made some parts very annoying to watch, and had me thinking, \"When will this be over?\" The pacing issues are a huge detriment to this series. On top of that, the fillers aren't even that interesting to watch. I was disappointed to find out that the last episode of this season is also a filler! I did, however, enjoy the Outo arc in particular. I still got some entertainment value out of watching the characters I love, but the pacing and filler dragged down my enjoyment of the show by a lot.\\n\\n\r\nOverall: The only things really holding this series up are the characters and the music. Everything else about it, especially the pacing and filler, is painful. CLAMP themselves disowned this adaptation of their manga. But if you're willing to tolerate the constant filler, I say go for it. However, if you'd rather have your share of Tsubasa without all the filler, I recommend heading over to your local bookstore.",
            "date": "2008-06-23T18:36:00+00:00",
            "helpful_count": 19,
            "mal_id": 5734,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11933.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Neko-Hoshishima",
                "username": "Neko-Hoshishima"
            },
            "url": "https://myanimelist.net/reviews.php?id=5734"
        },
        {
            "content": "Much like berryful I had no idea about this series going into it, manga or anime-wise. I had seen some Tsubasa stuff in Animate when I lived in Japan and had figured that I should watch it someday...\r\nI happened to pick up the first 3 DVDs from my library and what I learned about this anime is that its totally not worth the time. I'm not sure what year this was anime-converted from manga but the way they did the anime compared to the manga (from what I've read) was the real killer. \r\nThe first few episodes seem interesting, character presentation and all, and thensuddenly were thrown into the storyline. Suddenly were introduced to four different worlds and three new characters (one of which is nameless and seems to be the main antagonist, monocle and beard and all). \\n\\n\r\nThe show then goes into a pokemon-esque/duel monsters/digimon etc world where characters are completely devoid of development. Suddenly the seemingly wussy main character becomes a formidable fighter and all other characters throw in their two cents etc. etc.\\n\\n\r\nI don't know if it's because I watched processed shows from FUNIMATION (you suck) but the music in this was horrible. Simply awful. Who decides to hire wailing singers in like every movie and drama? The music in general is awful! It never matched the mood in the later episodes and came at completely random moments. The key frames are also horrible, and like another review mentioned, we sometimes get a characters face for 2 minutes XD. The story is also lame as hell once you get into it more and more and reminds me of a very crappy copy of Inu Yasha minus the intrigue of the characters and their situation. Instead we get flat one dimensional characters, crap music, though great animation, and a super lame lets collect and travel the world(s) story.\\n\\n\r\nOverall I would not at all recommend this particular series. I know there are far better out there (though not entirely similar Kou Kara Maoh comes to mind). If you're wondering why the hell did Misc watch 11 episodes, well, DVD is more enjoyable than sitting in front of the laptop for however many hours I wasted XD.",
            "date": "2008-12-04T15:51:00+00:00",
            "helpful_count": 17,
            "mal_id": 10099,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/117348.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/miscanime",
                "username": "miscanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=10099"
        },
        {
            "content": "I haven't watched Card Captor Sakura, but I heard that both these series are serialized by Clamp and both have main characters.  But I do not know how alike they are in attitude. What I do know is that both have the same facial features.  As such, the art has no originality, though, they were created by the same animators, in the end, you can't help but correlate both characters.  \r\nStoryline wise, traveling to other worlds is interesting, but it doesn't keep the audience hooked, in my case that is.\r\nThe art would be difficult in my own opinion, since it would takea lot of brain storming to create a different kind of world.  And having succeeded at doing it, Clamp is worthy of praise.\\n\\n\r\nMusic, I believe stands out in this series.  I am a lover of classical, opera and chorale music and using such genre appealed to me.  Unfortunately, playing the same music that stand out, over and over, in the long run became annoying to me.\\n\\n\r\nLike I said, some of the characters have no originality.  But since this is a crossover between Card Captor  Sakura, maybe they intentionally did it.\\n\\n\r\nEnjoyment.  I did enjoy it, but not to the point where I would hang out with it over time.  I watched it because I have no other thing to watch.\\n\\n\r\nOverall, I give it a 7.6.  This is mainly because it did not cater to my age range.  Although there are shojo productions out there that were outstanding, this was just mundane.  I'd recommend this to teens aged 10-18.",
            "date": "2007-10-14T08:40:00+00:00",
            "helpful_count": 16,
            "mal_id": 1029,
            "reviewer": {
                "episodes_seen": 16,
                "image_url": "https://cdn.myanimelist.net/images/userimages/13055.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sweetburntlips",
                "username": "sweetburntlips"
            },
            "url": "https://myanimelist.net/reviews.php?id=1029"
        },
        {
            "content": "So after reading through the manga, getting impatient waiting for the dub, I watched the series on Youtube. And I'm duly impressed. I had high expectations of this series, and so I when I heard about it I was skeptical (as my deep dark fantasy desire was to personally make this show my self) Of course being a fan-boy to Koichi Mashimo and and Yuki Kajiura It boosted my confidence more.\r\nThe plot is well adapted. Anime has the double edge sword when it comes to adaptation, either it's a very very loyal adaption nearly 100% in which case there is no longer a point toread the manga, or it's so different that you wonder, did the writers just read the summary on the back of the book?  But this is adapted in both differently while playing true to the Manga. The occasional sub-plots provide for some dramatic moments. Such as the plot of Chu'Nyan's (manga spelling) reunitment with her mother (I must admit I was crying during that point) and well other moments that proved to be not useless. Sub plots are tricky, you can milk them too much if you are not careful. Fortunately the play these out nicely.  There aren't too many and they aren't entirely pointless.  They provide for good character developments and expand the quest with out making it far too easy on the characters.\\n\\n\r\nI'd have to say, at first I read some criticism about Kajiura's music score. But I have to say this is one of her finest yet. She has some very powerful, unique, and interesting melodies. Especially the opening piece. The opening scene is so powerful with visuals, and the music choice. I don't know Yuki to work a lot with bigger instrumental styles, but I do hear a lot. She seems to have a lot more orchestral than she does songs. Not like her usual motif. I'm impressed, very impressed. I love the opening theme. While this wasn't a Kajiura composition (Also unusual for a Mashimo-Kajiura work) It's an awesome theme. \\n\\n\r\nNow many might complain about the long limbs. Frnakley I don't care. It's the same way in the manga, as it is in the Anime. As long as the Animation doesn't look like paper cut outs, I don't have any complaints.  I think BEE TRAIN was actually trying to replicate the style seen in the manga which they didn't need to do but they went out of their way to do it.  Minako Shiba has done fantastic with her character designers and the BEE TRAIN Staff shine the anime.\\n\\n\r\nOne of the biggest flaws is the constant flash back usage of previous episodes. I find my self fast forwarding through the episode as it slowly recaps what happened. And in these flash backs, they have real continuity problems.  Unfortunately they get a little carried away with the flashbacks.  It's very clear Mashimo doesn't fear a slow paced plot.  Which has it's ups and downs.\\n\\n\r\nGreat acting from the Japanese cast. Particularly Yui Makino as Sakura. As for the U.S. cast I feel Monica Rial was not the best choice.  She simply was not for this role, she's a good actress but this was just not the role I could see her in. Other than that the English cast is an all star knock out.  Though I would have had some preferences for other characters.  They do their best and that's all we can ask for right?  I felt Vic and Sabat were fantastic choices for Fay and Kurogane, Savage not as much for Mokona. \\n\\n\r\nI say see this series. If you are a CCS fan. Manga Fan, see this Anime.",
            "date": "2008-03-31T09:51:00+00:00",
            "helpful_count": 15,
            "mal_id": 3510,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44864.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShadowBlazer3000",
                "username": "ShadowBlazer3000"
            },
            "url": "https://myanimelist.net/reviews.php?id=3510"
        },
        {
            "content": "Remember the show ‘Cardcaptors Sakura’? You remember… The little Girl Sakura who has to find all the Clow cards! And her rival, Chinese boy Syaoran Li? \r\tWell, guess who’s back in this anime?!\r\tTsubasa (Which means ‘Wings’) is CLAMP’s ultimate cross-over manga! Every single manga they’ve ever written is in this series!\r\tIn this story, our little Sakura isn’t so little anymore, now a teen – and quite a rebel princess at times, she goes off to visit her childhood friend, Syaoran, a young archaeologist, at the Clow Ruins to finally proclaim her feelings for him. \r\tUnfortunately, Fate has a different plan for the two of them.\r\tSuddenly,Sakura loses her memory in the form of beautiful feathers and Syaoran vows to find them all.\\n\\n\r\tSorry to say that these feathers won’t be easy to find. They lie in different worlds, where people who find them first will either gain the feather’s great power for good… or for evil.\\n\\n\r\tAnd so, Syaoran makes a pact with a space-time witch in order to gain the ability to travel through worlds – For a heavy price.\\n\\n\r\tGaining allies; one unwilling to return to his own world, the other who can’t wait to return to his, the group journey through many different worlds to find the missing feathers. \\n\\n\r\tBut, unknown to them… there’s a greater darkness that follows their every footstep along the way…\\n\\n\r\tIf you’re into action-packed stories, or ones full of romance, promise, hope, angst, comedy, or any genre at all, really… Tsubasa is definitely for you! You’ll be drawn to the characters immediately and absolutely adore little Mokona!",
            "date": "2007-02-05T14:13:00+00:00",
            "helpful_count": 13,
            "mal_id": 122,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/169.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Nekokitsune",
                "username": "Nekokitsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=122"
        },
        {
            "content": "Seeing as I haven't read the manga for this show (or any manga for that matter) I won't be referring or comparing these two (as I hear that the manga is \"way\" better than the show).\r\nStory:\r\nTo me the story didn't seem to be very great from the start. Basically in the first episode everything was put together and it felt rushed and was a very lazy way to introduce the characters and plot. Then after I watched further into the show I got even more disappointed as I found out that the style of Tsubasa was just a bunch of mini stories making up theshow that didn't really develop the initial story. However, I did like how Tsubasa would come up with different ideas of the mini stories making it somewhat interesting to see what would happen next, except then I kept finding myself getting annoyed by the fact that none were very good and lacked interest.\\n\\n\r\nAnimation:\\n\r\nWell once again I still find that art/animation isn't very hard to accomplish with today's standards. Like most animes the animation was pretty much the same as any other anime. The characters were well drawn and the backgrounds were up to detail. There was one point where I felt I was watching an anime from the 90's because of the poorly drawn facial expressions and extras, but everything else felt normal as normal gets.\\n\\n\r\nSound:\\n\r\nThis may be a little biased, but the sound was very corny at times. I know they were trying to be dramatic (or maybe romantic) by playing slow music during some of the episodes and it would have been good if they didn't do it for 5 times. After hearing it over and over again it became (to me at least) a joke. Like: &quot;Oh god, now there doing a music montage and getting 10 different close-ups of everyones face.&quot; They could have done with a little variety of background music also, seeing as they were visiting different worlds that could do with more than just the same tune. As for theme songs I thought they were good and helped set the mood of the story.\\n\\n\r\nCharacter:\\n\r\nUsually when I watch an anime there's always one character whom I wish would simply die and get out of the picture. In this show, although it was close at times,  there wasn't really any characters I hated. When I first began to watch this show I already knew what the roles and personalities of all the main characters would most likely be and I was dead on for all of them except Sakura. I don't know if that is a positive to know what the characters would be like because then I easily predicted (and they were all so predictable) what each character would do and got bored of seeing the same thing happen. Predictability is no problem if the characters themselves are interesting which I found most to be. Also as a side note there were no supporting characters. For example if you see a new character and he/she leaves the picture then there outta there! FOR GOOD =)\\n\\n\r\nEnjoyment:\\n\r\nI guess I could say this show had a bad start for me and if I would have only watched they first half then I would probably give enjoyment a 3. But then after a while I started to enjoy some of the episodes and thought that overall it was an ok if not good show to watch. Maybe its just me but, this show is too soft (this is coming from someone who likes gorey animes). Not great but not bad so I give it a 7. (6 to me is where I begin start to hating)",
            "date": "2008-05-27T02:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 5032,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45809.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/klemon_qhap",
                "username": "klemon_qhap"
            },
            "url": "https://myanimelist.net/reviews.php?id=5032"
        },
        {
            "content": "I think i need to add something here.. i don't expect anybody to vote how useful my review was.. but let me just say this. (This is just my opinion ^_^) There is a lot of responses to this anime that there is a lot of filler and pointless scenes. however i have to disagree.\r\n1) Each of the characters grow more and more into their roles.\r\n2) Not always will they go to a dimension and find a feather... so of course there will be episodes that seem there is no reason that they should even be there. The characters have no idea what realm thefeathers are in.\\n\\n\r\n2) Clamp is trying to introduce all of their previous characters from other animations into this one. So i'd assume some of it is just for our enjoyment of seeing them appear.\\n\\n\r\n3) If the anime moved any faster then there are things that happen that are impossible to answer if the story doesnt explain itself as it goes... \\n\\n\r\nI do know not to expect it is exactly like the manga but it doesnt always follow exact.  i hope my words are clear enough. I will say this.. The OVA is the best of the series so far. Very dark like the manga and its by a different studio, not bubble-bee. =) Please watch it when you finish the first 2 seasons of this wonderful series.",
            "date": "2008-07-03T02:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 5978,
            "reviewer": {
                "episodes_seen": 14,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7460.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/darkwhisper",
                "username": "darkwhisper"
            },
            "url": "https://myanimelist.net/reviews.php?id=5978"
        },
        {
            "content": "There are 2 points-of-view when judging this Anime:\r\n-When you didn't read the manga.\r\n-When you already read the manga.\r\nThese 2 points of view can lead to very different judgements, and that's why I'm gonna review using both of them.\r\nFirst one, is watching this anime without reading nothing from the manga.\r\nHere we go:\r\n   Tsubasa is basically the story of Sakura, a princess who has a great power inside her, and her long-time childhood Friend Syaoran.\r\nAfter having her memores lost and spread around many different worlds, Syaoran goes in a quest the recover them all and save the princess, with the help of Fye and Kurogane,two other character that will have great importance in the plot.\\n\\n\r\nThe anime has almost no violence at all. Kinda like Dragon Ball Super: There are battles, minor injuries, but no blood.\\n\r\nStuff like alchohol also don't make appearence.\\n\\n\r\nThe journey is fun to watch. The humor and the characters are really pleasurable to watch.\\n\r\nIs that kind of anime that you can prepare some coffee, sit on the chair and watch it just to enjoy the free time you got, you know?\\n\\n\r\nIt's kinda follows the same recipe until the end of the second season. No biggies here. When you finish the anime, you will probably be like:\\n\r\n\"Ok, that was pretty good, but no ending. I wonder what happens after it.\"\\n\\n\r\nAnd that's the moment You go and read the manga.... And everything changes.\\n\\n\r\nNow, reading the manga, you will notice some different things here:\\n\r\nThere are blood and violence in the manga (mainly in the later parts of it, wait until you get to the Tokyo Revelations arc), and also alchohol, for example.\\n\\n\r\nAnd also, after an specific arc of the story, you will notice that the anime and the manga follow COMPLETE different plot-lines. And that's why I said that your opinion about the anime, changes deppending on if you read or not the manga.\\n\\n\r\nThat probably  happened because the anime wanted to avoid the violence, and noticed it would be impossible at one point, so it decided to change it all, and that made the fans go really mad about it.\\n\\n\r\nThe thing is, that doesn't means that the anime is bad... it's just the the manga is actually better.\\n\r\nThe manga has a really deeper plot and gets dark and a LOT interesting, while the anime keeps the bright and good mood all the time.\\n\\n\r\nI watched the anime first, and really liked it. And I suggest you to watch it too.\\n\r\nIf you wanna avoid disapointment, you can watch the anime and then, read the manga. Since it will only get better, instead of getting something good, then something worse.\\n\\n\\n\\n\r\nART: 10\\n\r\nI really love CLAMP art-style. It's highly niche, since there are people who hate it, and people who love it including myslef.\\n\r\nI find it beautiful and pleasing. It's unique and different from many other anime.\\n\\n\r\nSTORY: 7\\n\r\nThe plot is fairly good. It is pretty simple, but still fun to watch it.\\n\r\nIf you have already enjoyed the anime plot, the manga is a lot, and I mean a LOT more complex and deeper..\\n\\n\r\nOVERALL: 7\\n\r\nI gonna resume the rest of the subjects here: it is good.\\n\r\nThe characthers are attrative, unique and cool. The soundtrack is AMAZING, the songs are just epic. And the anime is pretty enjoyable and fun.\\n\\n\r\nFinal Thought: The anime is not bad as many says. I suggest you to give it a chance, because it IS good. \\n\r\nThe only thing is that it gets completly smashed by the manga after you read it.\\n\r\nDon't worry with the \"manga is better\" thing, because taht doen't make the anime itself bad. It is still a good anime and you can still have fun watching it.",
            "date": "2017-09-02T13:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 256745,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5635842.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DkClaude",
                "username": "DkClaude"
            },
            "url": "https://myanimelist.net/reviews.php?id=256745"
        },
        {
            "content": "I enjoyed the Tsubasa Reservoir Chronicle manga immensely so when I found the anime I was very excited. But after the first few episodes I realized some major problems with the series. My two main issues being that they recap on the story far too often and the music doesn't fit the mood sometimes. And then the very last episode of the season ended with Sakura wishing for people who had died to return which goes against the whole theme of the manga. Overall I enjoyed this but I felt very frustrated while watching it at times.",
            "date": "2010-05-31T22:14:00+00:00",
            "helpful_count": 10,
            "mal_id": 26640,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328106.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mizilla",
                "username": "Mizilla"
            },
            "url": "https://myanimelist.net/reviews.php?id=26640"
        },
        {
            "content": "Story (7) - Very slow pace, with lots of fillers. There was 1 or 2 interstings story arcs, but the rest is disapointing. I believe it&acute;s not the story itself, since the manga doesnt seem to have that problem. Its how it was develloped in this series. As i said in the start, the story lost itself between many fillers, long long conversations explaining things that didnt make any sense to be explained, while other important things were left behind undevelloped.\r\nSo, only a 7 in this aspect.\r\nArt (8-) - Nothing really special, however, some good appointments in terms of character design. The rest in justenough to be considered good.\\n\\n\r\nSound (10+) - For me, the best aspect in the whole series. I liked the op and ed, and background music is just amazing. It gives a lot of atmosphere and fits very well with this type of anime. Character voices were also pretty well made, and in general, sound fits very well with the rest. \\n\r\nIt is certantly not because of sound that this anime disappointed me. \\n\\n\r\nCharacter (8-) - I liked them, in terms of image and role in the story. Its quite a good creation, but as it came closer to the end, i noticed that they are not that well develloped, and the relations between them seemed a little bit messed up.\\n\r\nStill, this is good enough, although i think manga seems to be much better in this aspect (comparing with what i already saw from the manga).\\n\\n\r\nEnjoyment (6-) - I dont even need to be an expert to notice the big number of fillers in this anime. It turned most of the episodes (with exception of 1/2 arcs) boring, sleepy, and not interesting at all. Many moments with lots of conversation/lack of action, some long pauses, and aspects/information with not sense at all, clearly used to fill in time in the series. \\n\r\nWell, not everything was bad. One of the beginning arcs, and the last one gave some interest to watch (that was quickly replaced by an poor, really poor last episode :s) , but its too few for an anime wich i had some expectations.\\n\\n\r\noverall (7) - I dont even need to see all the manga to find out why this is not a good one. It disappointed me a lot.\\n\r\nWith the exception of the music aspect, wich i give the credit because it was really good, the rest was far below my expectations. \\n\r\nThe fillers, lack of action and lots of conversations....and who knows, probably after reading more from the manga i will find some more negative aspects about this one.\\n\\n",
            "date": "2008-11-30T15:46:00+00:00",
            "helpful_count": 8,
            "mal_id": 9974,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/25161.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fr0z3nshad3",
                "username": "fr0z3nshad3"
            },
            "url": "https://myanimelist.net/reviews.php?id=9974"
        },
        {
            "content": "I went from Cardcaptor Sakura to this series, so overall I think I saw an improvement atleast in the maturity level. And though there were some things I found lacking I am going to continue to the second season. \r\nLikes:\r\nIt is a really interesting story idea and I just love the chance to explore different worlds. The characters have some depth, unique traits and all set eachother apart nicely. Also, the interactions between characters is pretty amusing. Actually, the anime overall is pretty funny as well as being serious. It touches on issues that CC seemed to skirt around and actually makes you \"feel\" forthe characters.\\n\\n\r\nDisklikes:\\n\r\nThere was a lot of potential, but as the story moves on it almost seems to get less interesting. I saw this in CC as well. Each episode's format is repetitive and that started to cause me to lose interest. Also, sometimes the expressions on the characters faces drove me nuts... during certain scenes they would appear placid, when I felt there should have been more emotion. \\n\\n\r\nOverall, this anime is something that I enjoyed when I was bored. It was not something that I obsessed over or had to watch constantly until I finished the season. Yet, it does have a unique story and is an easy watch. I probably will not ever rewatch it, but it is definitely something I don't regret watching.",
            "date": "2008-02-05T21:56:00+00:00",
            "helpful_count": 7,
            "mal_id": 2340,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/31739.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/restivesilence",
                "username": "restivesilence"
            },
            "url": "https://myanimelist.net/reviews.php?id=2340"
        },
        {
            "content": "First I saw CCS, then I noticed a new anime called Tsubasa Chronicles.\r\nI thought it was a sequel, but it was a new story.\r\nAnd even when I first lay eyes on this anime, I fall for it ^-^\r\nThis anime is quite touching, even if it have action and fantasy in it.\r\nTwo childhood friend who develop feeling for each other.\r\nSyaoran sacrifise the relationship between him and Sakura, so Sakura would live even if he knows that she wouldn't remember him.\r\nBut as the story goes, Sakura once more fall for Syaoran, without the past memories of them.\r\nI often tears whenever there's a flashback about them...",
            "date": "2008-03-01T00:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 2808,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39983.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/YuyuiSakura",
                "username": "YuyuiSakura"
            },
            "url": "https://myanimelist.net/reviews.php?id=2808"
        },
        {
            "content": "As Vladimir Putin has once said, \"I'll be brief\".\r\nI stumbled upon this anime after watching \"Chobits\". I was quite familiar with CLAMP and some of their works, so I decided to fill this particular gap in my aсquaintance with this series.\r\nPeople often say \"No regrets\", but I DO regret watching Tsubasa Chronicles.\r\nWhy? Well, let me tell you.\r\nFirst - the story is your basic and \"favorite\" GONNA CATCH 'EM ALL!!11 (sad smiley) type of stories. Our heroes travel through different worlds trying to find Sakura-hime's feathers in order to get her memories and personality back. \r\nThe premise is kinda promising, but the execution is very poor- the worlds are unimaginitive, plain and boring as cows. Or sheep (they're actually quite funny and cute, so I'll stick with cows). There was one TV-show called \"Sliders\" (sadly with living human beings), which had a similair premise with much better execution. In other words, the idea is not so unoriginal, but it could have been done better.\\n\\n\r\nA few words about art & sound. I think the animators' salary was something about a bowl of rice, because graphics in this show are very dull and greyish. No bright colors, no decent animation, the show looks very cheap. Hell, I've seen some hentai drawn better than that!\\n\\n\r\nSound is little better, but it's still just average. The same musical tracks are repeated over and over, even when they don't fit the scene at all. Hey, but who cares? The animator guy ate the last bowl of rice, so our composer will have to work for an \"arigatou\".\\n\\n\r\nOne thing that made me hate this show is the characters. Yeah, Kurogane and Fai are nice fellows, but Syaoran and especially Sakura made my dinner go out of my mouth every time I saw them on screen. Syaoran is one of the most dull and uninspired shounen heroes of all the time. I think he has no personality, just this blind and exaggerated loyalty towards Sakura, who says nothing but \"SYAORAN-KUN!\" ALL THE TIME. Hell, in one episode she shouted it for about 9 times, on some occasions - FOR NO REASON. Yep, that's all she does in this show - being a helpless and a mentally challenged damsel in distress. It's not quite and makes you want to protect her, it's simply pathetic.\\n\\n\r\nThe story feels like it should've been made in 12 episodes, the plot moves sooo slow and it's too predictable. There's a glimpse of an intrigue in the last story arc, but it is resolved undescribably silly.\\n\\n\r\nJust like the whole show - it's not fun, it's not original, it's not curious. It's just silly.\\n\\n\r\nAnd boring, as a result.\\n",
            "date": "2012-08-29T09:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 71107,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/212332.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Johnny_FBI",
                "username": "Johnny_FBI"
            },
            "url": "https://myanimelist.net/reviews.php?id=71107"
        },
        {
            "content": "The storyline is wonderful, the sound track is amazing and the characters all give an extra plot twist to the real storyline. Sadly, the anime doesn't really reach a point that it actually gets to the main storyline. \r\nTsubasa Chronicle is a good show if you're a shoujo addicted fangirl, looking for some new anime. But it's certainly nothing good for the die hard CLAMP and TRC-manga fans. If you have no problems with reading the manga instead of watching the anime, I'm telling you, go read the manga. \r\nAnimation is a disappointment. Art is also pretty screwed up. Even I, someone without eye foranimation quality could see it.\\n\\n\r\nThis anime = A no no.\\n\r\nThe OVA = BIg yes.\\n\r\nThe manga = to die for.",
            "date": "2009-10-25T07:54:00+00:00",
            "helpful_count": 6,
            "mal_id": 19991,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/247460.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sky-e",
                "username": "Sky-e"
            },
            "url": "https://myanimelist.net/reviews.php?id=19991"
        }
    ],
    [
        {
            "content": "I had heard of this anime for a long time and had always wanted to watch it. I finally got around to it and ended up binging it. I'll admit to not having read the manga at times it can get a little confusing, especially at the end of series two where, for me at least, it felt like I had been thrown into something I didn't understand, such as in the 'Spring Thunder Chronicle' where I felt a little lost and perhaps had missed an episode. I think the remedy to understanding the jump would be to read the manga to fully understand thesituation. Overall,  the anime was very enjoyable and the characters, especially Fai and Kurogane, really carry the series. Enjoying it as I did and being a fan of quite a few things that CLAMP have produced, I wouldn't be averse to a reboot, perhaps even going further in the manga. Not all English dubs are as good as you hoped but I thought the voice cast was also very good again, Fai's and Kurogane's voice actors stand out. An enjoyable series that if nothing else will leave you wanting more.",
            "date": "2018-08-17T09:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 286695,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7348089.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Coffee-Shop-Girl",
                "username": "Coffee-Shop-Girl"
            },
            "url": "https://myanimelist.net/reviews.php?id=286695"
        },
        {
            "content": "Look... With every other review I've written, and with every other review I will write, I've made an extremely conscious effort to be as objective as possible. I've done the whole Art/Sound/Character/Enjoyment thing and then given my conclusions at the end.\r\nWith this show, it's not possible for me to be objective and I will not bother going through the motions. Plain and simple, this is my single favorite anime of all time. It is NOT the best anime of all time. It is not one of the top 100 best anime of all time. But, without a doubt, it's my favorite.\r\nIf you want some objectivecriticisms, the animation is imperfect and characters sometimes look like they're 7'5 and 80 pounds, the story is never finished and there are several characters and cliches here you've seen elsewhere. And yet, I just don't care... There is no accounting for personal taste and this anime with it's phenomenal characters, breathtaking soundtrack and heart string tugging story hits all the right notes for me and is simply my all time personal favorite.\\n\\n\r\nThe entire main cast is super super likable and extremely developed, the adventure feels magical and mystical, there is a love story which I'm always a huge sucker for and there is charm and humor in spades. \\n\\n\r\nOBJECTIVE RATING- 7\\n\r\nPERSONAL ENJOYMENT RATING- INFINITY",
            "date": "2018-05-19T14:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 280939,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/RyanSpring",
                "username": "RyanSpring"
            },
            "url": "https://myanimelist.net/reviews.php?id=280939"
        },
        {
            "content": "i don't like writing long reviews because i feel like it's boring and would be a waste of your valuable time. Personally I think that this anime is one of the \"greats\". I've seen plenty of anime, and while the plot may not be extremly  deep, it's still wicked interesting. Its basically about one dude who goes out looking for fragments ( feathers) of the girl he likes. now normally this plot would suck, but it doesnt. It's blended with tons of other stories and tons of other characters, and slowly you see how brilliant the story really is. I reccommend  that youwatch this. the art may not be to what your used to in 2010, but it's good enough to look past. in fact you probably won't care because of the great characters and story, Ill admit that the anime has 1 achillies heel tho. and that's that it ENDS. well not ends but i should say doesn't get completed. it just kinda pulls you in, doesn't let go, and then kinda drop kicks you when you get to the OAV's. \\n\\n\r\nwell i guess this is kinda long, o well. So all in all, watch it. now. I'm promising you that your like it, and if you don't then your a ginger for you have no souls.I'm kidding, maybe.",
            "date": "2010-05-09T00:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 25885,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321464.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/thekidd",
                "username": "thekidd"
            },
            "url": "https://myanimelist.net/reviews.php?id=25885"
        },
        {
            "content": "i'm going to be blunt, as an anime, Tsubasa made me want to cry, and i tell you they were certainly not tears of joy. I am a die hard fan of the manga. it has all the elements of a fantastic series; great characters, interesting plot twists and hey they even travel to different worlds, what's not to like? The anime just butchered everything. Let's put it this way, if you were a die hard fan of the Lord of the Rings series, and then all the sudden the movie came out and Ganondorf was a freakin' fairy princess would you cry then? Ididn't see much wrong with the art and voice actors, i thought that they were decent. What totally threw me off was the annoying \"epic\" music and the fluttery magicalness of it all. The manga presents the magic like an eerie curse, and in Yoko and  fai's case, totally bad-ass. By the time I reached the third episode in the anime i couldn't go on. They went so far as to even alter the episodes so they give you a sappy happy feel, like \"hey! even the bad guys are good guys!\" -- WHAT!??? Even without having read the book the anime still seems to be missing captivating elements. \\n\\n\r\nBut alas, enough said about the anime, GO AND READ THE MANGA NOW!\\n",
            "date": "2013-02-21T11:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 87461,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2197681.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/baka00punk",
                "username": "baka00punk"
            },
            "url": "https://myanimelist.net/reviews.php?id=87461"
        },
        {
            "content": "I'd like to make this clear before I start. First of all, this review will be most helpful if you haven't read the manga. If you had, you might be a little disappointed in the anime. Second of all, to all of the haters, remember that this was originally intended to be a kids anime, not an teen-adult anime: meaning that sometimes it had to cut out some intense parts and dumb others down a bit. And I enjoyed it for what it was, not for what it could be.\r\nWhat really led me to give a 9 was because it was addicting. I hadn't watchedCCS or any other Clamp work. This was one of my first animes. Anyways, I first watched this when I was little(r) and I found it to be really enjoyable. This review will be for both seasons...soooo...let's go!\\n\\n\r\nStory: Well there are a lot of interesting ideas out there. For example, strange monsters called Pokemon coming out of Poke-balls. Or ninjas that had cat whiskers (I'm looking at you Naruto). Some ideas were hits, others were misses. This idea was a hit for me. The story immediately drew me in, with two star-crossed lovers that had unfortunately fallen into some cruel fate. (Hituzen :) ) Cool idea, huh? The only thing that set the whole thing back was the pacing. The first episode--great. Then it dragged its feet for a bit, and then finally got to the meat of it all. The first 10 episodes were really hard to get through. However, it really got good towards the end, especially at Outo. That arc was honestly amazing. Though there were fillers, and the anime really differed from the manga, I really didn't care. I thought it was pretty interesting to see what Bee Train could come up with next. In the end, the story was great, except for the pacing that really killed it. \\n\\n\r\nArt: After watching some more Clamp works, I really began to think: where did Tsubasa go wrong with the art? Ok, its better than a lot of other animes. But when Mokona (the magical bean bun of a creature) begins to change sizes, you start to wonder if some of these errors were just careless. For example, sometimes I just can't help staring at the screen because Fai looks so cute. But other times, I just can't help but slap the screen because they totally screwed up his face. However, the art was pretty decent, not as good as like Code Geass or Clannad, but good enough that I could tolerate it. \\n\\n\r\nSound: Oh yes. Ok, maybe they overuse some songs. AT LEAST THEY'RE GOOD SONGS! Yuki Kajiura, as usual, out-do's herself with A Song of Storm and Thunder and other various OST's, and Maaya Sakamota/Kinya Kotani are great OP/ED artists. I thought it was cool that Yui Makino even sang some stuff herself. Amazing music.\\n\\n\r\nCharacter: OK, no spoilers here, but the character development was pretty good considering the circumstances. These first few arcs don't really allow a whole lot of development, but what did happen was pretty good. Most saw Fai's mystery behind his nonchalant facade, and Kurogane's steadfast qualities. You even get some foreshadowing for the next next season/OVA. Ok, maybe Sakura was a little Mary-Sue-ish, but I didn't really mind.\\n\\n\r\nEnjoyment: Pssh, I was addicted to this anime when I was a kid. I stumbled on an AMV quite a while after and then got RE-addicted. This anime has this pull, even through all of its flaws. A kind of \"let's see where this goes\" kind of thing. \\n\\n\r\nAppreciate this anime for what it was meant to be. This anime is an all time favorite (yes and I have watched other well-received animes like Clannad and Maid-sama) for me.",
            "date": "2013-04-04T18:49:00+00:00",
            "helpful_count": 5,
            "mal_id": 92429,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/littlekitty441",
                "username": "littlekitty441"
            },
            "url": "https://myanimelist.net/reviews.php?id=92429"
        },
        {
            "content": "The animation was the worst I have ever seen. All the characters were tall and lankey. I mean it was bad! It looked like something my eight old sister drew up on the spot. This really surprised me because I've seen other CLAMP Animes such as X and Card Captors and Tsubasa Chronicle does even compare. The bad art totally cancels out the interesting plot. \r\nTip to Manga Readers- From what I here they cut of alot of the good stuff when they made the anime because it aired in Children's Hour. \r\nSAVE YOURSELF THE PAIN AND DON'T WATCH THIS!!!",
            "date": "2010-06-19T20:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 27365,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/239453.jpg",
                "scores": {
                    "animation": 2,
                    "character": 10,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Joseph666",
                "username": "Joseph666"
            },
            "url": "https://myanimelist.net/reviews.php?id=27365"
        },
        {
            "content": "Adaptations of any kind have the challenging task of being both faithful to the source material and entertaining on its own. Fate/Stay Night, Umineko no Naku Koro ni, and of course, Tsubasa Chronicle. These adaptations have been universally panned for being \"terrible adaptations\" that are a disgrace to the original work.\r\nBut I beg to differ. People tend to exaggerate when it comes to criticisms of adaptations, and this was no exception.\r\nStory: 7\r\nCrossovers are fun. They span across multiple genres and multiple universes. That's the main hook of Tsubasa Chronicle's story, that you would rarely know what's in store for you. It can lead to manypossibilities and much variety as you travel to various worlds. Tsubasa's story of Syaoran traveling across dimensions in search of Sakura's precious possessions is the perfect excuse to dive into such fun storytelling, so CLAMP has done a good job in this.\\n\\n\r\nBest of all, the story can go into some very heartbreaking, tearjerking, and downright depressing moments. You'll be shedding tears half of the times, I'd imagine, while laughing along the nonsensical banter during the other half. Being a shounen manga, these are some of the familiar things you can expect: tears, heartfelt themes that teach children something meaningful, and a large amount of action.\\n\\n\r\nIf you have followed the manga as I did, you will be confused by the chronology of the story in the anime as a lot of events were jumbled up and out of order. But that is a minor concern in my opinion, as not only did it not affect the story in negative ways, it even improves upon it. There are a couple of changes made to the story; some changes made certain scenes more powerful and emotional, such as what happened to that treasured object of Chu'nyan's mother, while others withheld important information till later to retain the mystery and suspense.\\n\\n\r\nThere were some censored content, however, due to the anime's unfortunate airing hours, and it resulted in the removal of certain scenes involving alcoholism and gambling. Those scenes, in my opinion, are superfluous. The characters being drunk were funny and charming, but not important.\\n\\n\r\nWhat truly hurts the story isn't the mixed up timeline of the story, but the filler episodes. There are technically only two filler episodes if you don't count the extra backstory they added to supporting characters (I'll get to that good point later). To put it simply, those fillers, as with any kind of filler, suck. They are mediocre content that's a bore and a chore, adding nothing new and nothing interesting other than to take up the precious time the anime already lacks. In fact, my biggest concern for the anime wasn't the wrong order of the story, but the lack of time the anime has for such a lengthy manga. I heard that the anime didn't manage to adapt everything from the manga, and seeing these fillers, it's not hard to imagine why.\\n\\n\r\nFinally, some of the \"next episode previews\" practically spoil the story ahead of time, so avoid them if you haven't read the manga.\\n\\n\r\nCharacter: 9\\n\r\nThere's a reason why I put such a high score for this aspect. Of course, CLAMP is known for their excellent characters in their stories, and Tsubasa is no exception. You'll find familiar characters from CLAMP's other tales like xxxHolic, X/1999, Magic Knight Rayearth, Chobits, and of course, Cardcaptor Sakura. This isn't necessarily a bad thing as we are already familiar with what kind of person those characters are in spite of the slight changes in their personality here.\\n\\n\r\nSyaoran is as you see him in Cardcaptor Sakura; brave, athletic and a close friend of Sakura, but unlike CCS, he isn't brash or rude towards Sakura, but respects her as the Princess of Clow. His fate in Tsubasa is the most tragic fate thus far as you'll see in the series. I'm hoping for a happy ending for him, but things don't seem bright in Syaoran's future.\\n\\n\r\nIn spite of being the possessor of the show's MacGuffin, this version of Sakura doesn't have a very big role so far. Oftentimes, she feels like a plot-device, a damsel to be rescued. When she does get moments of her own, they do not portray her as a very interesting character. She was in love with Syaoran, she's grateful to him, and she's kind to everyone - that's all you need to know about her. Unlike Syaoran, Sakura seems shallow in comparison, but that might change in the future as she regains more of her memories.\\n\\n\r\nThen we have Kurogane, one of the two main characters not from any of CLAMP's previous work. He's a ninja who is exiled from his version of Japan by Princess Tomoyo (yes, that Tomoyo from CCS). He's your typical masculine hero with wise words about manhood to offer for Syaoran, but is often teased by the other new main character, Fai D. Flowright.\\n\\n\r\nFai is the more interesting of the two, as he seems to be one of those people with a tragic past but is smiling all the time. So far, nothing explicit has been revealed about his past, and I hope to learn more about him in season two.\\n\\n\r\nAnd the main reason for my high score here: the anime improves the characters.\\n\\n\r\nRegarding the \"filler content\" that is the additional backstory of supporting characters, those were interesting and gave us more context as well as made us care more about these otherwise ignored side characters. They even made the anime more endearing as we learn how Sakura resolves certain conflict with her kind heart early in the story. These are important moments that I could only wonder why CLAMP didn't spend time writing about.\\n\\n\r\nArt: 5\\n\r\nYes, we know the artstyle sucks. It seems to be a trend among anime made in the 2000s to have such mediocre animation (till they improve later on in the late 2000s and early 2010s when high definition became more common). Much like Umineko no Naku Koro ni, the animation is blend, boring, and simplistic compared to the source material. Tsubasa in particular removed comedic expressions the characters had while saying certain lines, making them more somber and serious during those moments. That was a bad move that merely made things more dull and less energetic. It contradicts the tone of CLAMP stories (fun and energetic) and is definitely a disgrace to the manga, albeit its only disgrace.\\n\\n\r\nThat said, the action scenes are easier to comprehend here than in the manga. I never liked fight scenes in manga. Due to their black-and-white nature, making out what is happening in manga fight scenes can be difficult sometimes, especially if the artist decided to get creative with the scene and added visible sound effects or those streaks in the air you normally wouldn't see in a fight in real life. The anime does make it less of a pain to watch the fight scenes... but it didn't necessarily improve it. It's still simplistic and definitely no Ufotable's remake of Fate.\\n\\n\r\nSound: 8\\n\r\nIt's Yuki Kajiura! Of course it's amazing! Operatic music tends to create powerful emotions in the audience for some reason, and it definitely works here with a story of such epic scale. The sound is also the main and biggest reason you should watch the anime. I've always preferred anime over manga because of the music, especially when the music makes the story much more emotional. Some people consider it a cheap illusion for you to get emotional because of the music rather than because of the story. I feel that to be a stupid criticism, as the music is no more an illusion than the writing. It's more of a combination of the two, the music and the story coming together to make you cry. If the story is bad, I wouldn't shed a tear even if it's Kajiura.\\n\\n\r\nAlas, the music does get a tad repetitive over time. Many of the same tracks are used throughout the series, and you'll undoubtedly come to recognize them (especially the iconic \"sad music\"). Thankfully, there remains a wide variety of scores for the various worlds our heroes travel to, leaving an even wider variety of tone and atmosphere that make the story more interesting.\\n\\n\r\nEnjoyment: 7\\n\r\nDue to the many reasons stated above, I quite enjoyed this anime series so far. It's not the most amazing story ever, and I'd be lying if I said the manga was an addictive page-turner that kept me hooked till the end (I had to put it on-hold at one point), but it's an entertaining adventure and a heartfelt story you could go to whenever you need something to cry or laugh about.\\n\\n\r\nOverall: 7\\n\r\nAs an adaptation, I've seen much worse. Adaptations are always hard to make. You have to please the fanboys of the original source material while ensuring the story works on a different medium. So when someone makes it remotely decent, it's always something to praise about. Tsubasa Chronicle works for me as an anime and has my seal of approval. Its added backstory especially (minus the filler episodes) makes this a worthwhile anime to check out for fans of the manga. In spite of its flaws, Tsubasa is a decent work, and I didn't regret watching it.",
            "date": "2018-03-28T01:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 275410,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331516.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RyderFlynn",
                "username": "RyderFlynn"
            },
            "url": "https://myanimelist.net/reviews.php?id=275410"
        },
        {
            "content": "Tsubasa Chronicle is a shounen title based on the manga from female mangaka group CLAMP. It tells the tale of Syaoran and Princess Sakura, two young adults who live in the kingdom of Clow County. Syaroan is the adopted son of Fujitaka Kinomoto, an archaeologist who introduces Syaroan to the world of mining. One evening, the ruins where an archaeological expedition are taking place glow with a mysterious power. Syaroan investigates this and finds Sakura there in a hypnotic state. Her memories are soon scattered from her to different dimensions (or worlds) in the form of feathers. Additionally, strange soldiers with elongated claws soon appearin Clow County and go after Sakura and Syaroan. With the assistance of Yukito, the high priest, Syaroan and Sakura are transported to the location of the Dimensional Witch, Yuuko. There they obtain Mokona, a small white rabbit creature who can teleport between worlds, to aid them on their quest. Also joining them are two others who have been teleported to the Dimensional Witch – Fai, a magician who’s escaping his home country in fear of a king, and Kurogane, a swordsman who was transported against his will to the Dimensional Witch and who wishes to return to his home world.\\n\\n\r\nTsubasa Chronicle is an interesting anime on account that it features characters found in CLAMP’s other works. Sakura and Syaoran, for example, are main characters in CLAMP’s famous manga Cardcaptor Sakura. The characters aren’t necessarily “reused”, as they have different backstories from their other material, but their personalities are roughly the same. As of this review, I am not familiar with the entirety of CLAMP’s character lineup, so a few cameo appearances may have gone over my head (such as Mokona’s excited reaction to knowing who the Amen’osa are in Episode 11). That said, Tsubasa Chronicle isn’t, to my knowledge, a sequel of any show nor depends on previous manga knowledge to watch, so they serve more as fan-service than something crucial to understanding the show.\\n\\n\r\nCLAMP’s idea for the show is another point of interest. The concept of jumping between worlds has lots of opportunities to let creativity fly. Though I won’t say that wasn’t met (since this is really relative to whoever is viewing the anime), it left me feeling more disappointed than amazed. I would like to say the problem stems from CLAMP being overly ambitious in their pursuit, having a lot of ideas but not really knowing how to execute them. As a result, it left me trying to find ways to generate hype and excitement instead of it naturally coming from watching the anime. \\n\\n\r\nSome of these problems lie mainly with the characters. Fai is running away from his home world, but it is really unclear why outside of that the king wants to get him. The king is shown trapped in some crystal at the beginning of the anime, but how he got there and what else is going on in Fai’s world is a mystery. Fai could be a traitor or maybe someone wrongly accused of something, but after 26 episodes, it still remains unknown. Despite Fai being known as a magician, he doesn’t use any magic in this series. This isn’t because he lost it, but more to the fact that with his “tattoo” gone, he refuses to use it. As the episodes progress, it seems Fai is more in place to be the “yang” to Kurogane’s “yin” – a balance in dynamics more so than an actual character. Kurogane is a more explicit example – in a flashback, it is revealed that he has a curse upon him by the princess of his land. Due to Kurogane’s violent nature, this curse’s effect is that Kurogane gets weaker with every person he kills. This is an idea that can be explored as a way of Kurogane learning about inner strength as opposed to just outer strength. Despite this, these opportunities are passed by – not once does Kurogane kill someone in this series. Considering his alarming backstory (killing countless people just to prove he was the strongest in the land), the fact that he’s so reserved in the present is a rather sudden shift. To me, it would be more effective to see the results in action (such as Kurogane losing against opponents we know he could defeat) rather than have a constant fear of what the consequences would look like.\\n\\n\r\nTsubasa Chronicle also has a heavy use of supernatural elements. These can add a bit of flavor to an anime but I’m not too fond of them here. The problems with the magical powers stem from how they’re used in each of the worlds. In the first world, animal-like familiars called “Kudan” assist everyone present in fights or day-to-day life. The main party also receives these Kudan, but because of the lack of depth they are given in this “arc”, they feel more like a way to resolve a plot or continue the story than the spiritual extension that they are supposed to represent. Consider Fai’s Kudan – it appears for one scene only and is only used to help Fai fly to the top of a building. That’s not the only time magical elements appear once. Supposedly, Mokona serves as a magical “translator” for the party so they can understand each other – when removed from the party, they cannot communicate. This only happens in the first arc after Mokona is temporarily away from the party. Since the range of Mokona’s power is unknown, and also considering the party splits occasionally with no issues in translation, this feels like an issue that was forgotten and used to add tension to the one scene it was present in. You could argue that this feeling of false tension happens a lot in this series. During the tournament episode (which, according to what I’ve read, is a filler episode!), Fai warns the party that the fighters of this region can shoot lightning from their hands! Instead of feeling uneasy for our heroes, we see Kurogane brush off the attack like it was nothing and Syoaran dodging these wild shots with ease. No tension is truly felt because our characters don’t have to worry about the threat. It takes the idea of a tournament full of tough fighters and trivializes it. Perhaps Fai disqualifying himself and Kurogane for stepping out of the ring without an actual fight summarizes it best. These are but a few of the instances of Tsubasa Chronicle putting more stock in the fact that it has magic rather than knowing how to properly use it.\\n\\n\r\nThe animation studio for Tsubasa Chronicle is Bee Train. Though the backgrounds and scenery are pleasant as is, the animation quality is little more than mediocre. Long stills are used frequently in the first half and CLAMP’s style of drawing people (long limbed and thin people) can look rather goofy in some of the mid-shots or long shots. Even during key frames, there is still something to be desired. During most of the emotional or serious scenes, the characters display neutral or mute faces. This makes the characters look like they don’t care about what’s happening. There are times when some fluidity occurs in the animation, but it’s far and few between episodes. As for sound, the music is a bit sparse but it has a decent amount of variance. There’s a female chorale piece that wouldn’t sound too far out of place on the later Madoka Magica soundtrack, a sad string piece, and a moody jazz arrangement amongst one or two other tracks. They’re not bad, but the limitations are present and I fell out of favor with some of the music due to it being played too often (the female chorale piece in particular). Opening BLAZE is a mid-tempo pop rock piece with a piano hook while ending Loop by Sakamoto Maaya is an OK acoustic guitar ballad. The seiyuus don’t display a whole lot of emotion, which again hurts the heavier scenes and makes them fall flat. The way Makino Yui (seiyuu of Sakura) says “Syaoran-kun” sounds the same in almost every scene and at times even got a bit grating to hear.\\n\\n\r\nOverall, I give Tsubasa Chronicle a 3.5/10. I was hoping to find more favor with this series as opposed to when I read Cardcaptor Sakura but it appears it was not the case. Perhaps those that are more familiar with the CLAMP-verse enjoyed it / will enjoy it more than I did. I cannot recommend this title.\\n\\n\r\nDo you like or dislike this anime? If you haven't watched it, are you encouraged to watch it or not? Leave a comment on my profile telling me what you think of the anime and/or my review.\\n\\n\r\nThanks for reading and have a blessed day!",
            "date": "2018-02-20T13:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 272034,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4774895.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PlatinuMan",
                "username": "PlatinuMan"
            },
            "url": "https://myanimelist.net/reviews.php?id=272034"
        },
        {
            "content": "Tsubasa Chronicle is a pretty good show and it’s certainly a good way to waste time.\r\nThe show’s main concept is built on a romance story. The first episodes will show a love connection between two childhood friends, but coming from different classes, their relationship is split as well as the time they can spend together. During an excavation check on some ancient ruins, Princess Sakura blindly and unconsciously follows a voice to the ruins. There, she ends up sprouting wings and starts her ascension to another dimension, but her ascension was interrupted, and as a result, she lost all of her memories and conveniently, thesememories are in the shape of many magical feathers. So, the point of the story is for this group of 5 people to travel to many worlds in search of these lost memories, or else, Princess Sakura will die. \\n\\n\r\nUnfortunately,  the price Syaoran must pay in order for her memories to be restored is the relationship he had with Princess Sakura. Any memories she had made with him during their childhood will never be fully restored, or will they?\\n\\n\r\n~Story 8/10~\\n\r\nThe story isn’t unique, but I found it kind of intriguing at first. The love background is a good hook for those who love romance stories. The concept of having many sub-stories and sub-plots thicken the experience you have watching this show, however, the experience is kept at arms-length because you know the story will inevitably end and another one will start.\\n\\n\r\nThese sub-stories were very long. Some encompassed 4-5 episodes while others only needed two. Some of them seemed exceptionally long when there was really no need for them to be.\\n\\n\r\n~Character 5/10~\\n\r\nThe characters are quite similar to other shows and some of them you’ll see are from xXxHoLiC such as Yuko and Mokona. The other characters are pretty typical. Princess Sakura is a very “good” person who brings honesty and kindness out of people. Syaoran is a fearless young man who will do anything he needs to in order for Sakura to smile. Kurogane is a very classical Japanese person who has a very hard time tolerating others and does not conform well to new rules that they so often run into in the new worlds.  Fai is a carefree-fugitive magician who is on the run from a very powerful man who could easily kill him.\\n\\n\r\nAs said before, the characters are not unique. What is even worse is that the characters do not seem to have any ability to critically think. For example, the first world they travel to; the very first person they run into had the feather they are looking for. Unfortunately, it was hidden and was being unintentionally used and Mokona can feel when the feather is nearby and they were able to feel the presence of the feather a few different times when they were with their new friend. So… 4 episodes later, the gang finally realizes that their new friend is the one who had the feather all along. That is what I mean by the lack of critical thinking. They could not put together the idea that their friend was the one who had the feather. I was able to guess who had the feather 10 minutes after they arrived to the new world.\\n\\n\r\nCharacter depth was good, however, the supporting characters (Fai and Kurogane) don’t seem to get very much depth to their backgrounds. Syaoran has the best depth of all the characters and shows why he is so willing to put his life in danger to retrieve the memories of the girl he loved.\\n\\n\r\n~Sound 8/10~\\n\r\nOne of my favorite voice actresses plays many characters in the English dub. And not to mention the  English Dub isn’t bad at all. The music is pretty good actually, but the dialogue can be frustrating. The magic sounds are not unique, so there will be a sense of familiarity.\\n\\n\r\nThe dialogue drives me nuts. Whenever I watch a show, someone will make a statement, and another character will repeat the same sentence, but this time with a question mark. After a hundred of those repeated lines, I was quite frustrated with Tsubasa Chronicle.\\n\\n\r\n~Art 8/10~\\n\r\nThe art style is very consistent throughout the show. It isn’t too child-like and isn’t too serious and that set will with this kind of series. It’s nice to see different color palettes being used for different worlds, even the darker worlds seem better with a little light.\\n\\n\r\n~Enjoyment 8/10~\\n\r\nI enjoyed the series, but I found myself getting frustrated with the lack of critical thinking and planning. Fighting happens often enough to keep me from getting bored, but the dialogue can sometimes be very lengthy and hard to understand. Overall, this series is pretty good. If you are someone who liked Dragonball Z, xXxHoLiC or Zero no Tsukaima, then I think you’ll enjoy this show too.\\n\\n\r\nSub Group Used: [Arigatou]\\n",
            "date": "2011-11-23T19:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 47935,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/266635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Romie-chan",
                "username": "Romie-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=47935"
        },
        {
            "content": "this my first review so bear with me this anime is pretty good it's average but sweet and has some nice adventure for this review i'm talking about the first and second season here i go.\r\nstory 8- the story was good save the love of his life from dying very sweet traveling to other worlds is  cool\r\nsound 7\r\ncharacter 7- i liked Syaoran he was brave and sweet he would do anything for Sakura what i didn't like was the constant repetition  of him saying that he made a promise and he's gonna keep it no matter what it got annoying.\r\nSakura was always sokind and helpful to others she always wanted to help in some way so that she wouldn't feel useless it's adorable how much they care about each other and how Syaoran always calls her princess\\n\r\nKurogane can be pretty nice when he's not annoyed most of time he helps Syaoran fight and he's great at it too\\n\r\nFay i didn't like him that much he was annoying always putting a stupid smile on his face even when they're in danger it pisses me off \\n\r\nMokona he's a little creature who really likes to bug Kurogane i don't really have any complaints about him\\n\r\nenjoyment 7- the constant repetition of the flashbacks and how they bring back other people from different worlds and they always forget that that supposed to happen but the adventure and stuff is nice i enjoyed it for the most part \\n\r\noverall 7- overall  it's not great but it's not horrible either in my opinion it's pretty good so watch if you like fantasy adventure action that's not bloody or boring and not cringe worthy characters you might enjoy it",
            "date": "2016-02-03T11:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 210033,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4545108.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/butterflygirl12",
                "username": "butterflygirl12"
            },
            "url": "https://myanimelist.net/reviews.php?id=210033"
        },
        {
            "content": "this is a review with regard for the entire series(2 seasons around 50 something episodes) so those of you who plan to start watching can have an idea of what this is.\r\nwell it starts of as the classic gathering of a fellowship for the beginning of their quest that will lead each of the protagonists to their goals.basic storytelling idea that always works.as far as the series with 1st and 2nd season is concerned the story remains true to that(the ovas are a different story though).we have the princess,the knight,the warrior and the rogue/mage roles filled and ready to go.all is well.and then it starts.theproblems with the story start with the first scene.i dont wanna give any spoilers and i dont wanna give you a summary of the story so all i say is that the first scene never gets explained.evar!and the worse part in this is that there is no ending to the story.the series ends \"presumably\" halfway across their quest.and thats all ladies and jentlemen!that is the main reason why i think that conceptually and story wise this anime fails terribly to tell as about the tsubasa chronicles story.i dont consider this a spoiler.more like a warning that i would really want to know before i started watching.\\n\r\nAnyway,as in the description you have an adventure with magic and tons of fantasy that will travel you across the infinite dimentions of space and time and you will visit a variety of worlds in different timelines.that was kind of unique in this anime and i liked it.But there was no romance.i mean yeah i didnt expect to see titanic but still seriously the romance is so mild that you may even not notice it.so it fails in that..\\n\r\nAnother thing that starts good but ends up a disaster is the presence of the bad guys who manipulate our heroes.their presence and agendas are never explained.that was terrible too.you expect this to lead you somewhere but it just stops half way to the end...if there ever is an end to these chronicles..just check the manga and you'll understand.\\n\r\nso concerning the story it completely fails!...better to read the manga and watch this anime just to satisfy your curiosity without any expectations.\\n\\n\r\nthe art is good.the colors the animations and the characters and world designs are above average.one more thing!at last an anime that the characters dont wear the same clothes all the time!!!\\n\\n\r\nthe same goes for sound.the songs are very nice and the score of the series will remind you of oldscholl rave(happyhardcore)..plus some really awesome ambient songs with ethnic style female vocalists(that reminded me kalafina) that will make you wanna get the soundtrack immediately!the voice acting fits perfectly with the characters.generally i think that they really did put a lot of work in sound and music production for this series.\\n\\n\r\nnow the characters...hmmm...i wont deny that they are awesome plus their backgrounds,at least for those that we get to see in the series.but from an experienced storytellers view i find them a little bit lacking.kurogane and fay are good,really good.but sakurachan and sayoran are somehow too oversimplified?not developed enough?i just expected more considaring that they are the protagonists and the main focus of the story.i even found lots of the secondary characters a lot more interesting than sakura and sayoran and got myself thinking if those two really have any reason to be in the story.i guess you cant have a story without the princess but sayoran is weird.many people will object but thats because they read the manga.as far as the anime is concerned it fails!you cant have your secondary characters be more interesting than your 2 protagonists that are supposed to have a romance!maybe thats why the romance fails.\\n\r\nyou will however see many famous characters from other CLAMP creations.\\n\\n\r\nenjoyment?yeah...i had some good laughs and there were some good emotional moments.some good battles too.but due to the lack of any ending/conclusion it just leaves you hanging.especially considaring that if you follow the OVAs after the series you might get confused and bored.in the end,all things considared, i thought that this was an abomination,just my personal opinion.\\n\\n\r\noverall...i dont understand why they went through the trouble of making this series.yeah i understand that probably there might have been some badjet problems and that may be the reason why the story never leads to a conclusion or ending but still...the lack of powerfull personalities for the main male and female roles and the romance that never really gets where its supposed to go...its just not good enough to classify it as a good anime.its just mediocre.\\n\\n\r\ni have high expectations ,especially from the story,so this anime fails for me.many people will dissagree but remember that the majority of those are the people who read the manga and i think that its kind of unfair to give an anime good reviews just because you liked the manga.\\n\\n\r\ni followed all the animations that came with this story and in the end i thought that it was a waste of time.the only good thing for me in this anime is the sound/music,mokona and the appearence and role of Yuuko from xxxholic.",
            "date": "2012-09-16T18:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 72513,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/936321.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/techstepman",
                "username": "techstepman"
            },
            "url": "https://myanimelist.net/reviews.php?id=72513"
        },
        {
            "content": "As a child it is very likely that you watched Cardcaptors Sakura- well this time all your favourite characters are back including some new ones. The story takes place in a world called Clow where our female protagnist, Sakura lives with her brother, the king of Clow Touya and the priest Yukito. Her childhood friend, Syaoran whom she dearly loves does not have his childhood memories. One day it is revealed that Sakura has strong powers within her, and all her feathers, which are her memories are scattered throughout different worlds. It is up to Syaoran to search for her feathers by going from demensionto demension, but what price will he have to pay in order to do so. Who will we meet, and what will he encounter. \\n\\n\r\nStory.\\n\r\nThe whole concept of this story is outstanding. I love how Syaoran still fights for Sakura even though he knows that Sakura dosen't remember him. It's a really good kick ass fighting show, with light romance. \\n\\n\r\nArt: Clamp has a unique artstyle for every manga. I think the art was beautiful for this specific animanga. The Sakura and Syaoran from here look similar to the ones from Cardcaptors Sakura, but yet different. \\n\\n\r\nSound\\n\r\nThe soundtrack for this anime was breathetaking, every piece was sutible for the scene. It harmonized well with it. \\n\\n\r\nCharacter. \\n\r\nAt first I didn't really like any of the characters besides Kurogane and Tomoyo-hime, but there is such amazing character development, especially for Fye and Syaoran\\n\\n\r\nEnjoyment. \\n\r\nThis anime can slightly be dull at points, but each world that they travel to is different, and has a different background. It blows my mind that someone can write like that.\\n\\n\r\nOverall: \\n\r\nI think that this is a fantastic series and I recomend it to you all. I think it's perfect for everyone. Good Work Clamp ! :D",
            "date": "2012-04-30T14:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 60077,
            "reviewer": {
                "episodes_seen": 38,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1281337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/otakuhime26",
                "username": "otakuhime26"
            },
            "url": "https://myanimelist.net/reviews.php?id=60077"
        },
        {
            "content": "while watching this anime i have noticed, that the story plot and characters are the same as in Card captor Sakura, since the story goes by clows that's the kingdom that sakura is the princess off, maybe this story adaption is a sequel of card captor Sakura  that takes place before the original story, now that's just my way off guessing how it goes i didn't find any story links about it but its just my way off thinking i could be wrong but then again i believe  what i see and there is  no other explanation \r\ni am still currently watchingthis anime i enjoy it, coz i am very curious about it and how it will end i like the characters as well the story, i like Fai D. Flowright coz he is such a care free pearson and makes everything sound so easy, ok well i like them all in a way they all have some meanings as well\\n\\n\\n",
            "date": "2010-12-16T04:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 32780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/294856.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/GaLaXiA20",
                "username": "GaLaXiA20"
            },
            "url": "https://myanimelist.net/reviews.php?id=32780"
        },
        {
            "content": "Many people's are not sure whether to watch this. Because there are a lot of negative saying about it. \r\nBut this show is great. Especially for Cardcaptor Sakura watchers, but I'm not saying it is not for non-watchers.\r\nThe first season and second seasons are good. But the real thing starts with the OVA. The OVA was just outstanding! The first and second seasons are worth finishing for for the OVA.\r\nThe story is good. As stated in the summary. Adventuring other world to collect Princess Sakura's feathers/memories. I will give it 7/10.\r\nThe art is bad... Bee Train just messed it up. But the OVA's, and themovie is from Production I.G (which just lightens it up). I will give it 5/10\\n\\n\r\nThe sound is the only outstanding part of the anime! It's just beautiful, composed by Yuki Kajiura. I will give it 10/10\\n\\n\r\nThe character's developments are also great. You will probably get attached to them, I won't say in no time, because it took a little time for me. And the mascot, Mokona is just so cute~~~~. I will give it 9/10\\n\\n\r\nEnjoyment: 7/10 \\n\\n\r\nOverall: 7/10\\n\\n\r\nBut, I will give it 10/10 for the whole series! It's definetly worth checking out! My fav. So what are you doing? Go watch it now! :)\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-08-10T14:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 226422,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5130594.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AceKoori",
                "username": "AceKoori"
            },
            "url": "https://myanimelist.net/reviews.php?id=226422"
        },
        {
            "content": "Tsubasa Chronicle is interesting in that the quality of the anime fluctuates wildly.\r\nThe first few episodes set up a certain hype that the rest of the anime struggles to live up to and that can make it extremely disappointing to curious viewers.\r\nBeing separated into arcs, the viewer will be introduced to new characters at every interval. This can provide an excellent foundation for exploration and inspiration, but when they introduce characters who are uninteresting (or worse yet, annoying), then the series can suddenly grind to a halt as you try to trudge your way along into the next arc.\r\nI'm pleased to say that the seriesstill works out to have more good than bad overall.\\n\\n\r\nA lot of people criticize the art in the show, but I didn't actually find it to be that bad. The backgrounds were lovely and the simpler style of the characters allowed for more fluid action when they weren't filling the minutes in with atmospheric panning shots.\\n\\n\r\nThat said, I don't think any of the animators have animated a fight scene in their life before working on this show. Shaoran is seen presenting his foot to an enemy on multiple occasions.\\n\\n\r\nThis is supposed to present as a threat, but the risk of someone simply grabbing your foot and twisting you in such a way that you lose your balance is high. Anyone with even a basic understanding of fighting can tell you how important keeping your balance is.\\n\\n\r\nSo with that in mind, I still maintain that the art was decent enough and the animation was good when the characters were moving, but they needed more reference material.\\n\\n\r\nI didn't have any issue with the sound, however, I would've appreciated more music variety, especially pieces without vocals.\\n\\n\r\nThe characters weren't anything special, but they were likeable enough with their relationships and motivations in mind.\\n\\n\r\nI'd recommend this series to anyone who enjoys sugary sweetness, fantasy, and fairy tales.",
            "date": "2019-04-18T07:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 306575,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7821858.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tinker_Jet",
                "username": "Tinker_Jet"
            },
            "url": "https://myanimelist.net/reviews.php?id=306575"
        },
        {
            "content": "NOTE: I have never ever read the manga before, which I am highly hoping for a better story. And I haven’t watched the second season.\r\nThe first episode was promising. It is a good reason why you should engage with this anime. But the start of their journey was, at the same time, the start of their downfall. The pacing was slow; the fillers would tell you that this is one of the worst anime ever just because of that. They just BUTCHERED an anime, which had the potential to become the anime of all time!\r\nThinking that this is a good shounen anime to follow, itwas bad… more than bad, actually. The fact that they’d call the manga “shounen,” the anime should be, too, right? Yet, I don’t see why I should like it anymore if it’s called to be shounen. We all might have different tastes but the fights aren’t what I call shounen anymore. Oh, hell, and when they show fighting scenes, you don’t see them fighting at all… They do, actually, but they’re like “PEW PEW” for 5-10 seconds and after a few seconds, they’d pause, probably talk and go dramatic, go for another short “PEW PEW” and the fight is finish with either the enemy escaping, giving up, or “transformed into a whole new person.” Uuuuuh! I just don’t know how to describe its terribleness this “shounen” anime is!\\n\\n\r\nThis doesn’t sound like shounen anymore… not at all.\\n\\n\r\nNot only that but the animation isn’t even something to boast at about. As a fan of CLAMP, I love their animation. It’s either the animation producer couldn’t draw them well with “good expressions” or they are just up for ill-expressed anime characters. Eventually, I found the animation fair… There was nothing special. Something ordinary-like… \\n\\n\r\nThe sound was good… In fact, it’s outstanding! I like how Mokona does his “cuteness” all the way through with how it talks. The rest were good, too, but I think the sound was pulled down by the horrendous moments they made.\\n\\n\r\nApparently, I found the characters “flawless” or “too flawless.” Sure, protagonists are supposed to be like that but I think there wasn’t even a hint of “badness” there. The only one I saw was Kurogane being short-tempered. What more? Well, regardless of that, they were good characters and weren’t fairly disappointing. At the very least, they were doing well.\\n\\n\r\nBut thank goodness, the anime still gave me enjoyment. It isn’t really a good show to kill time (since there isn’t “much” of the uniqueness and the different fun you would experience) but it gives a good sense of fun. I don’t know why but I seemingly found it fun (the usual fun). Then again, the presence of boringness was there. Still, they were doing very good at it.\\n\\n\r\nOverall, it was good. I wouldn’t recommend watching the anime though… I haven’t watched the second season of Tsubasa RESERVoir Chronicle (anime) nor the manga so I can’t really find a good “touch” for it, and make too hasty and crappy conclusions.\\n\\n\r\nThe only thing that is urging me to continue watching this anime, anyway, is because it’s made by CLAMP… That’s probably it.",
            "date": "2010-05-03T11:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 25687,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/125654.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/xevar25",
                "username": "xevar25"
            },
            "url": "https://myanimelist.net/reviews.php?id=25687"
        },
        {
            "content": "I watched the OVA first before seeing this so thought to give this a chance on what its albout. Most fans are negative about it which is true but i happened to enjoyed it a bit. Not a masterpiece anime work but good watch  with your whole family. Plan to have my future kids watch this show whenever it may happen but with english dub. \r\nIt did have a interesting story about two childhood friends meet up again and may seem like about to say their feelings for each other but got inturrupted by the clock bell lol. then, one night the princess feathersis out and is now everywhere in other fantasy lands. So thats how the journey begins with other two people with their own problems in their own land where the dimenshional witch made them to go on the quest to get each feather to bring the princess memories. Though their is a sad part which won't say. I loved how go to different lands and saving places than just getting the feathers including meeting interesting people. It does get repetive knowing when going to have them meet the real enemey we see all the time and who is that person in that liquid thing that is sleeping. Animation well very dull but it made the characters very enjoyable when its not a masterpiece of art.\\n\r\nThe music in this i happend to love a lot including &quot;You are my love&quot; and &quot; A Song of storm and fire&quot;, and many more. very made great emotions with the story and the characters. without it, i don't know how it would look but maybe it will so who knows.\\n\r\nSo a good anime to watch maybe once but a great example on people in real life to go on traveling to visit around the world except not finding the feathers lol. Right now next second season but only till 42 since people say up till then its all fillers :(",
            "date": "2008-04-01T08:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 3530,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36174.jpg",
                "scores": {
                    "animation": 4,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shakesgrl20",
                "username": "Shakesgrl20"
            },
            "url": "https://myanimelist.net/reviews.php?id=3530"
        },
        {
            "content": "I watched the show and realized that the ending explained absolutely nothing so i read the manga...PLEASE ONLY watch this if you already watched the manga i loved the show but it was almost completely filler...the manga howver is AWESOME!!!!",
            "date": "2008-07-16T18:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 6339,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72426.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Akatsuki-chan",
                "username": "Akatsuki-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=6339"
        },
        {
            "content": "the fact that Sakura-hime looked like weakling to me is pretty annoying (no offense, guys). i love cardcaptor sakura because she was so fantastic and strong willed unlike in this anime that she was like a helpless girl without Syaoran. \r\nTheir love story is considered fair. With a girl who liked her bestfriend but unable to confess up to the point that she lost her memories... and here comes the dense guy who loved her but unable to confess his feelings for her but sacrifice that love just for her to be alive. Heavens!! This is tragedy! honestly, i like the syaoran-sakura tandem in cardcaptorsakura so this anime was pretty awkward to me in the first place. \\n\\n\r\nit may sounded negative but the twists of the story brought me up to the last frame of the series (1, 2, Tokyo revelations) and even to the last page of the manga. the world of this series was so dark and mysterious, filled with schemes which are later revealed in the end part.",
            "date": "2016-05-26T18:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 219386,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5385711.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Angel_Apocalypse",
                "username": "Angel_Apocalypse"
            },
            "url": "https://myanimelist.net/reviews.php?id=219386"
        },
        {
            "content": "This anime is one of the best anime i've seen so far. The one thing I like about Tsubasa is that it inserts characters from Clamp's past works and puts them all together in one story. Speaking of story, the story is about a princess named Sakura who suddenly loses her memories from some powerful magic. Which than all the memories are scattered to diffenert dimensions. In order to bring Sakura's memories back, a boy named Syouran must travel to different dimensions and find the feathers. He is joined by a warrior named Kurogane, a wizard named Fai, and a little white creature named Mokonawho job is to help our heroes travel to dimensions and find the feathers. However the feathers are very powerful and can create choas if fallen into the wrong hands. \\n\\n\r\nThe only that's keeping me from giving this anime a perfect 10 is that Syouran's price from the dimension witch is Sakura's memory of Syouran. It's sad cause if you read the manga, you'll see that she tries to tell Syouran that she loves him. And now she'll never have that chance cause she won't remember him!\\n\\n\r\nOther than that this anime is a great show to watch. You should watch it!",
            "date": "2010-07-27T17:56:00+00:00",
            "helpful_count": 2,
            "mal_id": 29007,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326384.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/trishoverman47",
                "username": "trishoverman47"
            },
            "url": "https://myanimelist.net/reviews.php?id=29007"
        }
    ],
    [
        {
            "content": "The anime itself is not bad. But it turns a very psychological story into a show for children and disregards the bloody parts that should follow after episode 42 (I think) completely. \r\nThe voice-acting is top-notch for sure and the soundtrack beautiful but that's where it ends. Sure, if you did not read the manga this anime can be great but if even CLAMP, the mangaka of this series, have the third season cancelled because they think that the anime is crap you know that something is not right.\r\nLet me give you one piece of advice. Do NOT watch this anime when you expect themangas story in color, because it is not. You should try and ignore the manga if you want to watch because otherwise you will be disappointed. \\n\r\nThe studio butchered the story, every fan knows that. I don't want to completely trash it here because I did not hate it and it made me read my absolute favorite manga but it just lacks the psychological aspects and the beauty of the original.\\n\r\nI recommend the anime to those who don't like it when a series turns from happy and funny to dark and dangerous but I don't recommend it to those who know the manga.\\n\r\nIf you want to read with matching voices, watch a few episodes because, as I said, the voice-acting is superb.",
            "date": "2013-08-18T12:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 110211,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/650781.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KazeNoChikara",
                "username": "KazeNoChikara"
            },
            "url": "https://myanimelist.net/reviews.php?id=110211"
        },
        {
            "content": "Season 1: Pretty well done, slow moving but hey makes it good for young kids\r\nSeason 2: Starts out fine the last arc however is made up crap and ruined it so much CLAMP wouldn't let them make a 3rd season.\r\nThe manga Tsubasa Reservoir Chronicle is a master piece, 10/10\r\nThe anime on the other hand sucked for the following reasons:\r\nWas animated by Bee Train.\r\nBee Train is crap.\r\nBee Train sucks.\r\nBee Train holds the rights for the characters 'Sayourn' and 'Sakura' \r\nand had the attitude \"If we can't do it, no one can\".\r\nBee Train would not allow another Animation Studio to animate\r\nthe series such as I.G.Production which didthe OVA's\\n\r\nBee Train deserves to be crushed by the economic crisis.\\n\\n\r\nBasically, if Bee Train didn't animate this the anime would have \\n\r\nbeen epic.\\n\\n\r\nAlso for those saying that CLAMP just recycled the characters,\\n\r\na reason for this is it helped people who were challenged by\\n\r\nthe plot and wouldn't be able to understand it get an idea of \\n\r\nthe parallel worlds idea which is central to the plot (need to \\n\r\nread the manga)\\n\\n\r\nThis series is actually intertwined with another series by CLAMP \\n\r\ncalled xxxHolic. The two stories take place in the now termed \\n\r\n\"CLAMP universe\".\\n\\n\r\nThe soundtrack for the series was the best part, composed\\n\r\nby a true musical genius.",
            "date": "2011-07-07T06:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 38807,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/508337.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HotdogDragon",
                "username": "HotdogDragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=38807"
        },
        {
            "content": "The first time I saw this series was on television dubbed with our language. When I saw this, I was like, “What the hell is happening? This is Sakura and Shaoran from Cardcaptor Sakura only they are in their teens.”\r\nThere’s a long review coming…………\r\nAbout the STORY\r\nTo be honest, the story and main plot is somewhat ambitious because it is very challenging but you know what, they are able to do it splendidly that is why it is no doubt genius. CLAMP does it again. In fact, you can even consider this as the ultimate work of CLAMP. This is beyond being original. No one hasever done this kind of plot and I don’t think no one can copy it as well because this kind of storyline and plot is really for the CLAMP WORKS only. If you have read the manga, you would understand what I am saying because it is not revealed here. I don’t want to spoil it for viewers who haven’t read the manga. I still can’t comprehend how brilliant this work is. I cannot believe how the mangakas are able to create such storyline and plot. And as if that is not enough, this is an episodic-type of series. It is not enough that they’ve come up with such magnificent story but they have to create a different new story that comes with new world that the characters arrive into. This is the very reason why I love episodic series because every new story comes with new excitement that is different from the other stories. And the main plot of the story is another different issue because that’s the one that gives the biggest excitement. Like the trademark of a CLAMP WORK, the story is conservative and heart-warming. The drama is not overly done that would make you feel too depress about it but rather would make you relate and be involve with the story. The romantic part as well, like the other works, it is pure and conservative. Even without the act of being like a typical couple like kissing, hugging or even simple as holding hands, the love story is still well-express. It just shows that being romantic doesn’t always have to be being lewd and fooling around too much. And even if it is more like a traditional love story like in fairy tales, the romance is not cliché at all. But of course, even if it is a CLAMP trademark, the storyline and romantic part of the series is still very much original and have their own uniqueness that is different from other CLAMP WORKS. Just to add, I don’t think it is possible to erase someone from your memory most especially if almost all of your memories are about that someone. If that someone almost defines who you are then erasing that person would mean erasing your existence. \\n\\n\r\nAbout the CHARACTERS\\n\r\nOne of the most interesting parts of the series is the gathering of almost all the characters from the different works of CLAMP. That is one of the reasons why I said that this is the ultimate work of CLAMP aside from the story. I just love when characters from different anime crosses over into another. It is fun and exciting. And in this case, some of the characters do not only cross over but they are actually part of the main plot. How the hell did the mangakas manage to do that? That is just genius. Well, you will surely understand what I am saying if you are a genuine CLAMP follower. But of course, let’s not forget the main characters. I admire how the relationships if the main characters develop when they are very much a stranger from the start. Their personalities are not only their difference but their reason for traveling also. Mokona, is obviously from another anime and also from another anime way back. I loved Mokona before from that anime and even loving him or her more.\\n\\n\r\nAbout FAI and KUROGANE\\n\r\n I strongly believe that among all the characters, Fai and Kurogane are the most prominent original character from this series. I honestly don’t remember their characters from other CLAMP works. Fai is the typical laid back character who acts like he doesn’t care or doesn’t know a thing when in fact; he knows what is really happening. His poker face gives a very mysterious aura about him that wants you to be so curious about his real identity. But even if that is the case, he is usually the one who gives advises to everyone, most especially to Sakura. You could say that he is the smartest one among the group and that’s not only intellectually. On the other hand, Kurogane is the rough one with a short-temper personality. Though he sometimes not honest with his feelings and would show his concern about others in a roundabout way. And if Fai usually the one he gives advises to everyone, Kurogane is the only one who can see through Fai’s poker face. He knows what to say to Fai when his about to hide his true feelings. And because he is the strongest among the group, he is the best teacher for Shaoran. I just love the complicated yet very unique relationship of this two. \\n\\n\r\nAbout SAKURA and SHAORAN\\n\r\nSakura and Shaoran are the most shocking characters because not only they are from another anime but they are in their teen years. During Cardcaptor Sakura, I was thinking what would Sakura and Shaoran would look like when they grow up and here they are. CLAMP just granted my wish.  Sakura here is not so different from the other anime when it comes to their pure and good heart. Though I admit, that Sakura in here is the epitome of the so-called damsel in distress character. She is very frail, needs to be protected all the time, and would always faint. Usually this is the type of character that I hate the most but for some reason I don’t hate her character. Perhaps, unlike the typical weak female character, Sakura is not weak when it comes to her personality. She is strong-willed and so kind-hearted. Though, it is almost funny that her feathers are very powerful when she looks like she would always be unconscious. Shaoran, on the other hand, is quite different from the character in the other anime. He is very calm, straightforward, and so honest with what he truly feels. Well, both characters are strong-willed and kind. Of course, if Sakura is the damsel in distress, Shaoran is the knight in shining armor. He is the epitome of that persona because he would do anything to protect Sakura and would stop at nothing to achieve his goal. Their love story is not cheesy or over-dramatic at all when it should be considering their relationship is somewhat typical and very much like a fairy tale. You can even say that it is a modern day damsel in distress and knight in shining armor type of love story. But for some reason, it is not over the top or cliché at all. I guess, that is a CLAMP magic. When they create a love story, it is sweet, touching, conservative, heart-warming but not to the point that it is becoming too cliché or too dramatic. \\n\\n\r\nAbout the ANIMATION and SOUNDS\\n\r\nBut of course, all CLAMP works have the best animation with beautiful graphics, exciting visual effects, and breath-taking landscapes. Not to mention that this is one of the latest work of CLAMP, so you are assured that the animation is latest. Indeed, CLAMP is one of the best when it comes to illustration and artwork in the anime world. But one of the most amazing parts of this series is the sounds. I am genuinely in love with all the sounds of this series. And when I say all, I mean everything which is very much rare because not all animes’ sounds are likeable. There would be one or two soundtracks that you would like but in here, everything is beautiful. From opening themes to ending themes to character songs to insert songs, everything are just so amazing that it is almost like a sin how they are able to do that. The soundtracks are not your typical anime songs. It’s like it has a touch of every sounds in the world. Western, Asian, Indian, Ethnic sounds are very much well incorporated. \\n\\n\r\nWith that all said, I don’t know if you would not consider this GENIUS. If not then I don’t know what in the world would you describe how magnificent this series is. Every aspect of this series is amazing. From the storyline and plot to dialogues to characters to animation and even the sounds are just so brilliant. I am so glad that I lived to witness such creation. \\n",
            "date": "2012-12-09T08:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 79640,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79640"
        },
        {
            "content": "Now, I haven't watched this anime in a while so I probably won't be able to accurately desrcibe things like sound and flashbacks or whatever. Vaguely though, I can remember that I liked the manga better. \r\nCharacters:\r\n  This may be a bit biased because I've watched Cardcaptor Sakura and read the manga before watching Tsubasa, but to me, the characters seemed a bit flat. I mean, take Sakura for example. I know that she's lost her memories and everything but for the most part, she was pretty much useless and dead weight. She was the 'damsel in distress' that requires saving almost every singletime. And that brings me to my next point: Syaoran. Overall, he was okay, albeit a bit dull, but his whole thought process through the series was 'Sakura, Sakura, Sakura'. Sakura everything pretty much. I understand that he loves her because they're childhood friends, but that's a bit overexaggerating everything. I thought it would be better if he had more of a personality.In comparison, the Sakura and Syaoran in CCS were much better. Sakura actually helped fight, made mistakes, and triumphed in the end while Syaoran initially hated her and grew to love her after watching her. Fai and Kurogane were okay. They were completely new characters and it was interesting to see them interact with each other and bring some comic relief to the story.\\n\\n\r\nPlot:\\n\r\n  The plot ended up being a bit repetitive, in my opinion. It was usually the same... travel to a new world, fight monsters, get feather, move on. In addition, there were a bunch of filler episodes throughout the seasons. Some of them were pretty good, like episode 37 which had me clutching my stomach the whole entire time, but in general, they just made the whole series waaayy longer than it should've been. That alone might've made me stop watching (because I hate watchig super long animes) but because I loved the manga and CLAMP, I decided to keep going. Again, I haven't watched this recently so I could be slightly mistaken. \\n\\n\r\nSound:\\n\r\n  I don't really know about the soundtrack, but a lot of people keep saying how it's repetitive. I do know that the music by Yuki Kajura was absolutely amazing though! For example, I have Break the Sword of Justice downloaded on my ipod. The seiyuu's were pretty good too.\\n\\n\r\nArt:\\n\r\n  Like most CLAMP works, the art was good. It was a bit on the simple side however. The one thing that kind of got to me slightly was that the limbs were really long an lanky. Once you get over that though, you can enjoy the anime better.\\n\\n\r\nOverall:\\n\r\n  Overall, I enjoyed this anime. I do not hate this anime even though it seems like I do from my review. I did watch it when I was younger though so I don't know what my reaction would be if I watched it now. If you have the patience to struggle through some filler and added episodes, then I suggest you watch it.",
            "date": "2012-04-14T19:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 58819,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/478331.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chikkoi",
                "username": "Chikkoi"
            },
            "url": "https://myanimelist.net/reviews.php?id=58819"
        },
        {
            "content": "Tsubasa Chronicles (TRC) \r\n I loved the characters and the story line and plot it was really good it got me interested in it the first time i saw it i saw episode 20 first then i went home and looked it up and started watching it and i love it, also the people who did their voices were good at them my 2 fav's are Kurogane and Fai.",
            "date": "2012-12-20T16:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 80696,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1709543.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KuroYohoh",
                "username": "KuroYohoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=80696"
        }
    ]
]